{
    "0405.HK": {
        "short_name": "YUEXIU REIT",
        "long_name": "Yuexiu Real Estate Investment Trust",
        "summary": "Yuexiu Real Estate Investment Trust (Â\u0093Yuexiu REITÂ\u0094) was listed on the Hong Kong Stock Exchange of Hong Kong Limited on 21 December 2005 and is the first listed real estate investment trust only investing in properties in the People's Republic of China (the Â\u0093PRCÂ\u0094) in the world. Yuexiu REIT focuses on office, retail and other commercial purposes, strives for properties which can bring considerable cash flows and returns and identifies business opportunities for achieving higher revenue growth through the optimization of its operations. The current property portfolio comprises eight high quality properties, namely White Horse Building, Fortune Plaza, City Development Plaza, Victory Plaza, Guangzhou International Finance Center in Guangzhou, Yuexiu Tower in Shanghai, Wuhan Properties in Wuhan and Victory Business Centre in Hangzhou, with a total area of ownership of approximately 973,001 square metres. All properties are located in the central business district (Â\u0093CBDÂ\u0094) of Guangzhou, Shanghai, Wuhan and Hangzhou respectively. The categories of the properties include professional clothing market, Grade-A offices, multiple functional commercial offices, retail business, hotel and serviced apartments etc. The Manager of Yuexiu REIT is Yuexiu REIT Asset Management Limited (Â\u0093ManagerÂ\u0094). Yuexiu REIT is managed by an experienced professional team with extensive experience in real estate management, asset management and the securities market and brings long-term and steady investment incomes to the Unitholders (Â\u0093UnitholdersÂ\u0094) of Yuexiu REIT through actively managing its assets and expanding its operations. While the real estate investment trust market is flourishing, the Manager is committed to becoming a professional asset management institution with a focus on the PRC commercial property market, continuing asset appreciation capability, commercial operation capability, capital operation capability and a leading position in the industry.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wanchai",
        "zipcode": null,
        "website": "http://www.yuexiureit.com",
        "market_cap": "Small Cap"
    },
    "0435.HK": {
        "short_name": "SUNLIGHT REIT",
        "long_name": "Sunlight Real Estate Investment Trust",
        "summary": "Sunlight REIT (Stock code: 435) is a real estate investment trust authorized by the Securities and Futures Commission and constituted by the trust deed dated 26 May 2006 (as amended and supplemented by six supplemental deeds) (the Â\u0093Trust DeedÂ\u0094), and has been listed on The Stock Exchange of Hong Kong Limited on 21 December 2006. Sunlight REIT offers investors the opportunity to invest in a diversified portfolio of 11 office and five retail properties in Hong Kong with a total gross rentable area of over 1.2 million sq. ft.. The office properties are primarily located in core business areas, including Wan Chai and Sheung Wan, as well as in decentralized business areas such as Mong Kok and North Point. The key retail properties are situated in regional transportation hubs and new towns including Sheung Shui, Tseung Kwan O and Yuen Long.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.sunlightreit.com",
        "market_cap": "Small Cap"
    },
    "0808.HK": {
        "short_name": "PROSPERITY REIT",
        "long_name": "Prosperity Real Estate Investment Trust",
        "summary": "Prosperity REIT [SEHK: 808] is a Hong Kong collective investment scheme authorized under section 104 of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong). Prosperity REIT owns a diverse portfolio of seven high-quality properties in the decentralized business districts of Hong Kong, comprising all, or a portion of, three Grade A office buildings, one commercial building, two industrial/office buildings and one industrial building, with a total gross rentable area of about 1.28 million sq. ft.",
        "currency": "HKD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.prosperityreit.com",
        "market_cap": "Small Cap"
    },
    "87001.HK": {
        "short_name": "HUI XIAN REIT",
        "long_name": "Hui Xian Real Estate Investment Trust",
        "summary": "Hui Xian Real Estate Investment Trust (\"Hui Xian REIT\") is a Hong Kong collective investment scheme authorised under section 104 of the Securities and Futures Ordinance (Chapter 571 of the Laws of Hong Kong). Hui Xian REIT was established on 1 April 2011 and had not carried on any operation prior to 29 April 2011 (date of listing), and its units were listed on The Stock Exchange of Hong Kong Limited (the \"HKSE\") since that date. Hui Xian REIT is governed by the Deed of Trust constituting Hui Xian REIT dated 1 April 2011 as amended by four supplemental deeds dated 24 May 2013, 16 May 2014, 28 May 2015 and 19 May 2017 (the \"Trust Deed\") made between Hui Xian Asset Management Limited (the \"Manager\") and DB Trustees (Hong Kong) Limited (the \"Trustee\"), and the Code on Real Estate Investment Trusts (the \"REIT Code\") issued by the Securities and Futures Commission (the \"SFC\"). The principal activity of Hui Xian REIT and its controlled entities (the \"Group\") is to own and invest in high quality commercial properties with the objective of producing stable and sustainable distributions to unitholders and to achieve long term growth in the net asset value per unit.",
        "currency": "CNY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.huixianreit.com",
        "market_cap": "Small Cap"
    }
}