{
  "0GM.DU": {
    "city": "Rotkreuz",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "DUS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "graceNT AG",
    "market": "dr_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "GRACENT AG INH.  SF1,04",
    "state": null,
    "summary": "graceNT AG provides IT-based medical products. Its products are used in the prevention of common diseases; and age-typical complaints, such as postural and back problems, insomnia, burn-out syndrome or dementia, and falling. The company is headquartered in Rotkreuz, Switzerland.",
    "website": "http://www.gracent.com",
    "zipcode": "6343"
  },
  "0QNO.L": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "LSE",
    "industry": "Medical Laboratories & Research",
    "long_name": "Lonza Group Ltd",
    "market": "gb_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "LONZA GROUP AG LONZA GROUP ORD ",
    "state": null,
    "summary": "Lonza Group Ltd supplies products and services to the pharmaceutical, biotech, and specialty ingredients markets worldwide. The company operates through two segments, Pharma Biotech & Nutrition, and Specialty Ingredients. The Pharma Biotech & Nutrition segment provides technology platforms, including drug substance and drug product; and develops and manufactures customized active pharmaceutical ingredients and biopharmaceuticals, as well as formulation services and delivery systems for pharmaceutical and nutritional applications. It serves pharmaceutical companies, biotechnology firms, and medical research and testing organizations, as well as consumer health and nutrition companies. The Specialty Ingredients segment engages in the microbial control solutions and specialty chemical services businesses. Its Microbial control solutions business has offerings in professional hygiene, and home and personal care markets; and offerings in paints and coating, wood protection, material protection, and crop protection. This segments also offers specialty chemicals in electronics, aerospace, food and feed ingredients, agro chemicals, and diversified specialty chemicals markets. The company has collaboration with Moderna, Inc. to manufacture a potential COVID-19 vaccine, mRNA-1273. Lonza Group Ltd was founded in 1897 and is headquartered in Basel, Switzerland.",
    "website": "http://www.lonza.com",
    "zipcode": "4002"
  },
  "8IM1.F": {
    "city": "Zug",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Devices",
    "long_name": "Implantica AG",
    "market": "dr_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "IMPLANTICA AG  SDR./1",
    "state": null,
    "summary": "Implantica AG, a medtech company, researches, develops, and sells medical implants for unmet medical needs in Switzerland. The company develops RefluxStop, a passive CE-marked implant for prevention of gastroesophageal reflux. It also develops e-InVivo, a sensor implant to monitor a multitude of health parameters and provide diagnostic information, as well as control treatment from inside the body; wireless energising platform; AppetiteControl, an implant to treat obesity by controlling appetite; and UriControl, a remote controlled implant to treat urinary incontinence for men and women. The company was founded in 2015 and is based in Zug, Switzerland.",
    "website": "http://www.implantica.com",
    "zipcode": "6300"
  },
  "ACIU": {
    "city": "Lausanne",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "AC Immune SA",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AC Immune SA",
    "state": null,
    "summary": "AC Immune SA, a clinical stage biopharmaceutical company, discovers, designs, and develops medicines and diagnostic products for the prevention and treatment of neurodegenerative diseases associated with protein misfolding. Its SupraAntigen and Morphomer platforms are designed to generate vaccines, antibodies, and small molecules, which selectively interact with misfolded proteins that are common in a range of neurodegenerative diseases. The company is developing Crenezumab, a humanized, conformation-specific monoclonal antibody, which is in Phase II clinical prevention trial for the treatment of Alzheimer's disease (AD). It is also developing ACI-24, an anti-Abeta vaccine candidate that is in Phase II clinical study for AD, as well as completed Phase Ib clinical study for Down syndrome; ACI-35, an anti-Tau vaccine candidate that has completed Phase Ib clinical study; and Tau- positron emission tomography (PET) imaging tracer, which is in Phase II clinical study. In addition, the company is researching and developing small molecule Tau aggregation inhibitors for AD and NeuroOrphan indications. Further, it has discovery and preclinical stage molecules targeting range of neurodegenerative diseases, which include diagnostics targeting TDP-43, alpha-synuclein, and NLRP3. The company has license agreements and collaborations with Genentech, Inc.; Biogen International GmbH; Janssen Pharmaceuticals, Inc.; Life Molecular Imaging SA; Eli Lilly and Company; and WuXi Biologics. AC Immune SA was incorporated in 2003 and is headquartered in Lausanne, Switzerland.",
    "website": "http://www.acimmune.com",
    "zipcode": "1015"
  },
  "ADCT": {
    "city": "Epalinges",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Biotechnology",
    "long_name": "ADC Therapeutics SA",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "ADC Therapeutics SA",
    "state": null,
    "summary": "ADC Therapeutics SA, a clinical-stage oncology-focused biotechnology company, develops antibody drug conjugates (ADC) for patients suffering from hematological malignancies and solid tumors. Its lead product candidates are loncastuximab tesirine (ADCT-402), an ADC that is in a Phase II clinical trial for the treatment of relapsed or refractory diffuse large B-cell lymphoma (DLBCL) and follicular lymphoma, and Phase III clinical trial in combination with rituximab to treat relapsed or refractory DLBCL, as well as Phase I/II clinical trial in combination with ibrutinib for relapsed or refractory DLBCL and mantle cell lymphoma; and camidanlumab tesirine (ADCT-301), an ADC that is in a pivotal Phase II clinical trial for the treatment of relapsed or refractory Hodgkin lymphoma and non-Hodgkin lymphoma, and Phase Ib clinical trial for selected advanced solid tumors. The company also develops clinical-stage product candidates, such as ADCT-601 that is in a Phase Ia clinical trial for the treatment of selected advanced tumors; and ADCT-602, and a Phase I/II clinical trial for relapsed or refractory acute lymphoblastic leukemia, as well as preclinical product candidates, including ADCT-701 and ADCT-901 for the treatment of selected advanced solid tumors. It has a collaboration and license agreement with Genmab A/S, Bergenbio AS, and Synaffix B.V. ADC Therapeutics SA was incorporated in 2011 and is headquartered in Epalinges, Switzerland.",
    "website": "http://www.adctherapeutics.com",
    "zipcode": "1066"
  },
  "ADXN": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Addex Therapeutics Ltd",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Addex Therapeutics Ltd",
    "state": null,
    "summary": "Addex Therapeutics Ltd, a development-stage biopharmaceutical company, discovers, develops, and commercializes small-molecule pharmaceutical products for central nervous system (CNS) disorders in Switzerland. The company focuses on the discovery of oral small molecule allosteric modulators of G-protein coupled receptors. Its lead programs include Dipraglurant for the treatment of Parkinson's disease levodopa-induced dyskinesia, and dystonia; ADX71149 for epilepsy and undisclosed CNS disorders; and GABAB PAM for addiction. It has license and collaboration agreement with Janssen Pharmaceuticals Inc. to develop mGluR2PAM compounds for the treatment of human health. The company was formerly known as Addex Pharmaceuticals Ltd and changed its name to Addex Therapeutics Ltd in March 2012. Addex Therapeutics Ltd was founded in 2002 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.addextherapeutics.com",
    "zipcode": "1202"
  },
  "ADXN.SW": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Addex Therapeutics Ltd",
    "market": "ch_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ADDEX N",
    "state": null,
    "summary": "Addex Therapeutics Ltd, a development-stage biopharmaceutical company, discovers, develops, and commercializes small-molecule pharmaceutical products for central nervous system (CNS) disorders in Switzerland. The company focuses on the discovery of oral small molecule allosteric modulators of G-protein coupled receptors. Its lead programs include Dipraglurant for the treatment of Parkinson's disease levodopa-induced dyskinesia, and dystonia; ADX71149 for epilepsy and undisclosed CNS disorders; and GABAB PAM for addiction. It has license and collaboration agreement with Janssen Pharmaceuticals Inc. to develop mGluR2PAM compounds for the treatment of human health. The company was formerly known as Addex Pharmaceuticals Ltd and changed its name to Addex Therapeutics Ltd in March 2012. Addex Therapeutics Ltd was founded in 2002 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.addextherapeutics.com",
    "zipcode": "1202"
  },
  "AEVS.SW": {
    "city": "Fribourg",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Care Facilities",
    "long_name": "Aevis Victoria SA",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AEVIS N",
    "state": null,
    "summary": "Aevis Victoria SA engages in healthcare, hospitality, lifestyle, and infrastructure sectors in Switzerland. The company operates through Hospitals, Hospitality, Telemedicine, and Real Estate segments. It operates 22 hospitals with 1,496 beds; manages 9 luxury hotels with a total of 940 rooms and 306 suites; and a portfolio of 39 healthcare related real estate properties with a total rentable surface of 182,207 sqm, as well as 18 hotel related real estate properties with a total surface of 100,913 sqm. The company also provides telemedicine, and ambulance and day clinic services. In addition, it engages in the patient hotel, better aging, radiology institute, pharmacy, ophthalmology, real estate management, stem cells, cosmetics, and publishing businesses, as well as organizes seminars. The company was formerly known as AEVIS Holding SA and changed its name to Aevis Victoria SA in June 2015. The company is headquartered in Fribourg, Switzerland. Aevis Victoria SA is a subsidiary of M.R.S.I. Medical Research, Services and Investments S.A.",
    "website": "http://www.aevis.com",
    "zipcode": "1700"
  },
  "ALC": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Alcon Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "Alcon Inc.",
    "state": null,
    "summary": "Alcon, Inc., an eye care company, researches, develops, manufactures, distributes, and sells eye care products for eye care professionals and their patients worldwide. The company's Surgical segment offers equipment, instrumentation and diagnostics, intraocular lenses (IOLs), and other implantables; and consumables, including viscoelastics, surgical solutions, incisional instruments, surgical custom packs, and other products for use in surgical procedures. Its cataract products include centurion vision system, LenSx femtosecond laser, LuxOR surgical ophthalmic microscope, NGENUITY 3D visualization system, and ORA system for intra-operative measurements; custom pak surgical procedure packs; vitreoretinal products comprising constellation vision systems, procedure packs, lasers and hand-held microsurgical instruments, and grieshaber and MIVS instruments, as well as scissors, forceps and micro-instruments, medical grade vitreous tamponades, and Hypervit vitrectomy probes; refractive surgery products, including WaveLight lasers and Contoura Vision used for LASIK treatment; and EX-PRESS glaucoma filtration device; and implantables products, including AcrySof IQ IOLs products include monofocal IOLs and advanced technology IOLs under PanOptix and ReSTOR brands for the correction of presbyopia and astigmatism at the time of cataract surgery. Its Vision Care segment provides daily disposable, reusable, and color-enhancing contact lenses; ocular health products, including devices and over-the-counter products for dry eye, over-the-counter products for contact lens care, and ocular allergies; and ocular vitamins and redness relievers under the TOTAL, PRECISION, DAILIES AquaComfort PLUS, Air Optix, Opti-Free, Clear Care, Tears Naturale, Genteal, ICAPS, and Vitalux brands. The company was formerly known as Alcon Universal S.A. and changed the name to Alcon, Inc. in December 2001. Alcon, Inc. was founded in 1945 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.alcon.com",
    "zipcode": null
  },
  "ALC.SW": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Alcon Inc.",
    "market": "ch_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ALCON N",
    "state": null,
    "summary": "Alcon, Inc., an eye care company, researches, develops, manufactures, distributes, and sells eye care products for eye care professionals and their patients worldwide. The company's Surgical segment offers equipment, instrumentation and diagnostics, intraocular lenses (IOLs), and other implantables; and consumables, including viscoelastics, surgical solutions, incisional instruments, surgical custom packs, and other products for use in surgical procedures. Its cataract products include centurion vision system, LenSx femtosecond laser, LuxOR surgical ophthalmic microscope, NGENUITY 3D visualization system, and ORA system for intra-operative measurements; custom pak surgical procedure packs; vitreoretinal products comprising constellation vision systems, procedure packs, lasers and hand-held microsurgical instruments, and grieshaber and MIVS instruments, as well as scissors, forceps and micro-instruments, medical grade vitreous tamponades, and Hypervit vitrectomy probes; refractive surgery products, including WaveLight lasers and Contoura Vision used for LASIK treatment; and EX-PRESS glaucoma filtration device; and implantables products, including AcrySof IQ IOLs products include monofocal IOLs and advanced technology IOLs under PanOptix and ReSTOR brands for the correction of presbyopia and astigmatism at the time of cataract surgery. Its Vision Care segment provides daily disposable, reusable, and color-enhancing contact lenses; ocular health products, including devices and over-the-counter products for dry eye, over-the-counter products for contact lens care, and ocular allergies; and ocular vitamins and redness relievers under the TOTAL, PRECISION, DAILIES AquaComfort PLUS, Air Optix, Opti-Free, Clear Care, Tears Naturale, Genteal, ICAPS, and Vitalux brands. The company was formerly known as Alcon Universal S.A. and changed the name to Alcon, Inc. in December 2001. Alcon, Inc. was founded in 1945 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.alcon.com",
    "zipcode": null
  },
  "ALCN.MX": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Alcon Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ALCON AG",
    "state": null,
    "summary": "Alcon, Inc., an eye care company, researches, develops, manufactures, distributes, and sells eye care products for eye care professionals and their patients worldwide. The company's Surgical segment offers equipment, instrumentation and diagnostics, intraocular lenses (IOLs), and other implantables; and consumables, including viscoelastics, surgical solutions, incisional instruments, surgical custom packs, and other products for use in surgical procedures. Its cataract products include centurion vision system, LenSx femtosecond laser, LuxOR surgical ophthalmic microscope, NGENUITY 3D visualization system, and ORA system for intra-operative measurements; custom pak surgical procedure packs; vitreoretinal products comprising constellation vision systems, procedure packs, lasers and hand-held microsurgical instruments, and grieshaber and MIVS instruments, as well as scissors, forceps and micro-instruments, medical grade vitreous tamponades, and Hypervit vitrectomy probes; refractive surgery products, including WaveLight lasers and Contoura Vision used for LASIK treatment; and EX-PRESS glaucoma filtration device; and implantables products, including AcrySof IQ IOLs products include monofocal IOLs and advanced technology IOLs under PanOptix and ReSTOR brands for the correction of presbyopia and astigmatism at the time of cataract surgery. Its Vision Care segment provides daily disposable, reusable, and color-enhancing contact lenses; ocular health products, including devices and over-the-counter products for dry eye, over-the-counter products for contact lens care, and ocular allergies; and ocular vitamins and redness relievers under the TOTAL, PRECISION, DAILIES AquaComfort PLUS, Air Optix, Opti-Free, Clear Care, Tears Naturale, Genteal, ICAPS, and Vitalux brands. The company was formerly known as Alcon Universal S.A. and changed the name to Alcon, Inc. in December 2001. Alcon, Inc. was founded in 1945 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.alcon.com",
    "zipcode": null
  },
  "ASCN.SW": {
    "city": "Baar",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Health Information Services",
    "long_name": "Ascom Holding AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "ASCOM N",
    "state": null,
    "summary": "Ascom Holding AG, together with its subsidiaries, provides healthcare ICT and mobile workflow solutions worldwide. It offers Digistat suite, a patient data management software system; Unite Messaging Suite that delivers intelligent integration, advanced messaging, and system management; teleCARE IP that provides end to end messaging, emergency call, and wander management for active seniors; and Telligence, a patient response system delivers relevant information at the point of care and throughout the care process. The company also provides smartphone applications, mobile devices, VoWiFi handsets, and paging solution, as well as voice over IP with digitally enhanced cordless telephony (DECT) technology. It offers its solutions for hospitals, long term care, retail stores, manufacturing, and hospitality industries, as well as for psychiatric and correctional facilities. The company is headquartered in Baar, Switzerland.",
    "website": "http://www.ascom.com",
    "zipcode": "6340"
  },
  "BIIO": {
    "city": "Cham",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Devices",
    "long_name": "Bionovate Technologies Corp.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BIONOVATE TECHNOLOGIES CORP",
    "state": null,
    "summary": "Bionovate Technologies Corp., a medical device company, focuses on developing automated treatment for age spots. It intends to develop and provide automated computerized system that treats age spots anywhere on the body. The company targets to sell its systems to physicians and spas worldwide. The company was formerly known as MJP International Ltd. and changed its name to Bionovate Technologies Corp. in December 2017. Bionovate Technologies Corp. was founded in 2010 and is based in Cham, Switzerland. As of September 28, 2020, Bionovate Technologies Corp. operates as a subsidiary of Human Data AG.",
    "website": null,
    "zipcode": "6330"
  },
  "BPMUF": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Basilea Pharmaceutica AG",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BASILEA PHARMACEUTICA AG",
    "state": null,
    "summary": "Basilea Pharmaceutica AG, a commercial stage biopharmaceutical company, focuses on the development of products that address the medical needs in the therapeutic areas of oncology and anti-infectives. It offers Cresemba, an intravenous and oral azole antifungal drug for the treatment of invasive aspergillosis and mucormycosis in the United States, the European Union, and internationally, as well as in Phase III clinical trials for invasive fungal infections in Japan. The company also provides Zevtera, an antibiotic for the treatment of community and hospital-acquired pneumonia, as well as in Phase III clinical trials for the treatment of acute bacterial skin and skin structure infections, and Staphylococcus aureus bacteremia in European and various non-European countries. In addition, it engages in developing Derazantinib, a small molecule inhibitor, which is in phase 2 clinical trial for bile duct cancer, as well as in phase ½ clinical trial for bladder and stomach cancer; and Lisavanbulin, a tumor checkpoint controller drug. The company was founded in 2000 and is headquartered in Basel, Switzerland.",
    "website": "http://www.basilea.com",
    "zipcode": "4058"
  },
  "BSLN.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Basilea Pharmaceutica AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BASILEA N",
    "state": null,
    "summary": "Basilea Pharmaceutica AG, a commercial stage biopharmaceutical company, focuses on the development of products that address the medical needs in the therapeutic areas of oncology and anti-infectives. It offers Cresemba, an intravenous and oral azole antifungal drug for the treatment of invasive aspergillosis and mucormycosis in the United States, the European Union, and internationally, as well as in Phase III clinical trials for invasive fungal infections in Japan. The company also provides Zevtera, an antibiotic for the treatment of community and hospital-acquired pneumonia, as well as in Phase III clinical trials for the treatment of acute bacterial skin and skin structure infections, and Staphylococcus aureus bacteremia in European and various non-European countries. In addition, it engages in developing Derazantinib, a small molecule inhibitor, which is in phase 2 clinical trial for bile duct cancer, as well as in phase ½ clinical trial for bladder and stomach cancer; and Lisavanbulin, a tumor checkpoint controller drug. The company was founded in 2000 and is headquartered in Basel, Switzerland.",
    "website": "http://www.basilea.com",
    "zipcode": "4058"
  },
  "CLTN.SW": {
    "city": "Altstätten",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "COLTENE Holding AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "COLTENE N",
    "state": null,
    "summary": "COLTENE Holding AG develops, manufactures, and sells disposables, tools, and equipment for dentists and dental laboratories in Europe, the Middle East, Africa, North America, Latin America, and Asia/Oceania. It offers restoration products, including conventional composites, bulk-fill composites, CAD/CAM solutions, composite veneering systems, core build-ups, bondings, etching gels, temporary materials, luting, curing lights, characterizations, and parapulpal pins; and endodontics products, such as posts, rotary and hand files, irrigation solutions, obturation and sealing materials, Gutta-percha and paper points, endo engines, apex locators, medicaments, and endo accessories. The company also provides prosthetics comprising bite registration, retractions, A-silicones, C-silicones, and accessories; and treatment auxiliaries consisting of dental rolls and dispensers, cotton pellets and dispensers, aspirator tips, dental dams and dam kits, dental dam clamps and accessories, dental scalers, electrosurgery, and occlusion verification products. In addition, it offers infection control products, which include ultrasonic cleaning units, ultrasonic cleaning solution, face masks, patient bibs, headrest covers, sterile and non sterile covers, and disinfection products; rotary instruments, such as diamond and carbide burs, polishers, kits, and accessories; and laboratory products comprising gingiva masks, lab putty products, model making products, waxes, occlusion control products, accessories, HP burs, and silicone polishers. The company was formerly known as Medisize Holding AG and changed its name to COLTENE Holding AG in April 2008. COLTENE Holding AG was founded in 2005 and is headquartered in Altstätten, Switzerland.",
    "website": "http://www.coltene.com",
    "zipcode": "9450"
  },
  "CRSP": {
    "city": "Zug",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "CRISPR Therapeutics AG",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "CRISPR Therapeutics AG",
    "state": null,
    "summary": "CRISPR Therapeutics AG, a gene editing company, focuses on developing transformative gene-based medicines for serious human diseases. The company develops its products using Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)/CRISPR-associated protein 9 (Cas9), a gene editing technology that allows for precise directed changes to genomic DNA. It has a portfolio of therapeutic programs in a range of disease areas, including hemoglobinopathies, oncology, regenerative medicine, and rare diseases. The company's lead product candidate is CTX001, an ex vivo CRISPR gene-edited therapy for treating patients suffering from transfusion-dependent beta thalassemia or severe sickle cell disease in which a patient's hematopoietic stem cells are engineered to produce high levels of fetal hemoglobin in red blood cells. It is also developing CTX110, a donor-derived gene-edited allogeneic CAR-T therapy targeting cluster of differentiation 19 positive malignancies. In addition, the company is developing allogeneic CAR-T programs comprising CTX120 targeting B-cell maturation antigen for the treatment of relapsed or refractory multiple myeloma; and CTX130 for the treatment of solid tumors and hematologic malignancies. Further, it engages in the development of regenerative medicine programs in diabetes; and in vivo and other genetic disease programs to treat glycogen storage disease Ia, Duchenne muscular dystrophy, myotonic dystrophy type 1, and cystic fibrosis. The company has strategic partnerships with Bayer Healthcare LLC, Vertex Pharmaceuticals Incorporated, and ViaCyte, Inc. It also has a strategic partnership with Nkarta, Inc. to research, develop, and commercialize CRISPR/Cas9 gene-edited cell therapies for cancer. The company was formerly known as Inception Genomics AG and changed its name to CRISPR Therapeutics AG in April 2014. CRISPR Therapeutics AG was incorporated in 2013 and is headquartered in Zug, Switzerland.",
    "website": "http://www.crisprtx.com",
    "zipcode": "6300"
  },
  "CSBTF": {
    "city": "Schlieren",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Kuros Biosciences AG",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "KUROS BIOSCIENCES AG",
    "state": null,
    "summary": "Kuros Biosciences AG, a biopharmaceutical company, engages in the discovery, development, and commercialization of biopharmaceutical products for the treatment and prevention of chronic diseases in the United States, the United Kingdom, and internationally. Its sealants pipeline products include Neuroseal EU and US for the treatment of dural sealant cranial. The company's orthobiologics pipeline products include MagnetOs Granules and MagnetOs Putty in EU and US for the treatment of orthopedics, spinal, and dental problems. Its fibrin/PTH orthobiologics pipeline products comprise KUR-111, which has completed Phase II clinical trial for the treatment of tibial plateau fractures; and KUR-113, which completed Phase II clinical trial for the treatment of tibial shaft fractures, as well as is in the Phase I trial for the treatment of spinal interbody fusion. The company has collaboration with Checkmate Pharmaceuticals LLC for the development of CYT003 for the treatment of oncology. Kuros Biosciences AG is headquartered in Schlieren, Switzerland.",
    "website": "http://www.kuros.ch",
    "zipcode": "8952"
  },
  "CSUI": {
    "city": "Dietikon",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Cannabis Suisse Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "CANNABIS SUISSE CORP",
    "state": null,
    "summary": "Cannabis Suisse Corp. engages in the cultivation and distribution of recreational tobacco products and medical CBD oils in Switzerland. The company sells its products through a distribution network of retailers and online shops under the Swiss4Life retail brand. The company was formerly known as Geant Corp. and changed its name to Cannabis Suisse Corp. in February 2019. Cannabis Suisse Corp. was incorporated in 2016 and is based in Dietikon, Switzerland.",
    "website": "http://www.cannabissuissecorp.com",
    "zipcode": "8953"
  },
  "ELN.F": {
    "city": "Epalinges",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Elanix Biotechnologies AG",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "ELANIX BIOTECHN.AG",
    "state": null,
    "summary": "Elanix Biotechnologies AG, a tissue regeneration company, develops and commercializes products for acute wound care, dermatological, and gynecological applications, and provides cell technology services. It also owns cell banks containing various quantities of cells. The company was founded in 1966 and is headquartered in Epalinges, Switzerland.",
    "website": "http://www.elanixbiotechnologies.ch",
    "zipcode": "1066"
  },
  "ELVAF": {
    "city": "Reinach",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Evolva Holding SA",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "EVOLVA HOLDING SA",
    "state": null,
    "summary": "Evolva Holding SA discovers, develops, and commercializes ingredients for use in food, nutrition, personal healthcare, agriculture, and other sectors in Switzerland, the United States, and internationally. It offers branded ingredients, such as Veri-te Resveratrol, a natural ingredient in grapes, as well as other plants, including peanuts, cranberries, and Japanese knotweed for use in age-related health conditions; Nootkashield for pest control applications; EverSweet Stevia, a sweetener use in food, beverages, and table-top sweeteners; Nootkatone, an ingredient for flavour and fragrance applications; Valencene, an aroma ingredient; and Vanillin, an extracted from the seed pods of the vanilla orchid and is made up of a complex mixture of taste components. It serves the nutrition, flavors and fragrances, animal health, personal care, and pharmaceutical markets. The company was founded in 2004 and is headquartered in Reinach, Switzerland.",
    "website": "http://www.evolva.com",
    "zipcode": "4153"
  },
  "EVE.SW": {
    "city": "Reinach",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Evolva Holding SA",
    "market": "ch_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "EVOLVA N",
    "state": null,
    "summary": "Evolva Holding SA discovers, develops, and commercializes ingredients for use in food, nutrition, personal healthcare, agriculture, and other sectors in Switzerland, the United States, and internationally. It offers branded ingredients, such as Veri-te Resveratrol, a natural ingredient in grapes, as well as other plants, including peanuts, cranberries, and Japanese knotweed for use in age-related health conditions; Nootkashield for pest control applications; EverSweet Stevia, a sweetener use in food, beverages, and table-top sweeteners; Nootkatone, an ingredient for flavour and fragrance applications; Valencene, an aroma ingredient; and Vanillin, an extracted from the seed pods of the vanilla orchid and is made up of a complex mixture of taste components. It serves the nutrition, flavors and fragrances, animal health, personal care, and pharmaceutical markets. The company was founded in 2004 and is headquartered in Reinach, Switzerland.",
    "website": "http://www.evolva.com",
    "zipcode": "4153"
  },
  "G2AB.F": {
    "city": "Sankt Gallen",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Vifor Pharma AG",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "VIFOR PHARMA UNSP.ADR/0,2",
    "state": null,
    "summary": "Vifor Pharma AG, a pharmaceutical company, focuses on the development, manufacture, and commercialization of pharmaceutical products in Switzerland, rest of Europe, the United States, and internationally. The company offers Ferinject/Injectafer, a solution of ferric carboxymaltose used for the treatment of iron deficiency and iron deficiency anemia; Maltofer, an oral iron polymaltose complex for infants, children, adolescents, and pregnant woman with iron deficiency; and Mircera, a long-acting erythropoiesis-stimulating agent (ESA) to treat symptomatic anemia associated with the chronic kidney disease (CKD). It also provides Retacrit, a short-acting ESA; Venofer, an intravenous iron sucrose used in the intravenous treatment of iron deficiency; and Velphoro, a non-calcium, iron-based chewable phosphate binder for the treatment of hyperphosphatemia in adults with CKD undergoing dialysis. In addition, the company offers Rayaldee, an orally administered, extended release formulation of calcifediol for the treatment of secondary hyperparathyroidism in patients with CKD; Veltassa for the treatment of hyperkalaemia in CKD and chronic heart failure patients; and Invokana to treat diabetic kidney disease. Further, it developing Vadadustat, an investigational oral hypoxia-inducible factor prolyl hydroxylase inhibitor for the treatment of anemia due to chronic kidney disease; Avacopan, an orally-administered, highly selective inhibitor of C5aR1 for the treatment of orphan and rare renal diseases; ANG-3777 for the treatment of delayed graft function and cardiac surgery-associated acute kidney injury; Difelikefalin for the treatment for chronic kidney disease-associated pruritus; and VIT-2763 to treat beta-thalassemia. Vifor Pharma AG has a strategic partnership with Fresenius Kabi. The company was formerly known as Galenica AG and changed its name to Vifor Pharma AG in April 2017. Vifor Pharma AG was founded in 1872 and is headquartered in Sankt Gallen, Switzerland.",
    "website": "http://www.viforpharma.com",
    "zipcode": "9014"
  },
  "GALE.SW": {
    "city": "Bern",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Distribution",
    "long_name": "Galenica AG",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "GALENICA N",
    "state": null,
    "summary": "Galenica AG operates as a healthcare provider in Switzerland and internationally. It operates through two segments, Health & Beauty, and Services. The Health & Beauty segment operates 522 pharmacies, including 366 owned pharmacies and 156 partner pharmacies under the Amavita, Sun Store, and Coop Vitality brands. This segment also offers medication for treatment of patients at home; launches and distributes a portfolio of consumer health, pharmaceutical, and parapharmaceutical products; and marketing and sale services to partners in the healthcare market. The Services segment provides range of specialized pre-wholesale services, including storage, distribution, and debt collection to pharmaceutical and healthcare companies. This segment also offers logistics services for the healthcare market; master data for the healthcare market; management software solutions for pharmacies; and develops tools to securely manage, communicate, and distribute sensitive health data and enhance patient safety. The company was founded in 1927 and is headquartered in Bern, Switzerland.",
    "website": "http://www.galenica.com",
    "zipcode": "3027"
  },
  "GEM.F": {
    "city": "Plan-les-Ouates",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "GeNeuro SA",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "GENEURO SA  SF-,05",
    "state": null,
    "summary": "GeNeuro SA, a clinical-stage biopharmaceutical company, develops drugs for the treatment of neurodegenerative and autoimmune diseases. Its lead therapeutic candidate is temelimab, a monoclonal antibody, which has completed Phase IIb clinical trial for the treatment of multiple sclerosis; and is in Phase IIa to treat type 1 diabetes, as well as is in Phase I for the treatment of chronic inflammatory demyelinating polyneuropathy. The company has cooperative research and development agreements with The National Institute of Neurological Disorders and Stroke to develop novel therapeutic antibodies for the treatment of amyotrophic lateral sclerosis; and Academic labs to develop inflammatory psychosis. GeNeuro SA was founded in 2006 and is headquartered in Plan-les-Ouates, Switzerland.",
    "website": "http://www.geneuro.ch",
    "zipcode": "1228"
  },
  "GNHAF": {
    "city": "Sankt Gallen",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Vifor Pharma AG",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "VIFOR PHARMA AG",
    "state": null,
    "summary": "Vifor Pharma AG, a pharmaceutical company, focuses on the development, manufacture, and commercialization of pharmaceutical products in Switzerland, rest of Europe, the United States, and internationally. The company offers Ferinject/Injectafer, a solution of ferric carboxymaltose used for the treatment of iron deficiency and iron deficiency anemia; Maltofer, an oral iron polymaltose complex for infants, children, adolescents, and pregnant woman with iron deficiency; and Mircera, a long-acting erythropoiesis-stimulating agent (ESA) to treat symptomatic anemia associated with the chronic kidney disease (CKD). It also provides Retacrit, a short-acting ESA; Venofer, an intravenous iron sucrose used in the intravenous treatment of iron deficiency; and Velphoro, a non-calcium, iron-based chewable phosphate binder for the treatment of hyperphosphatemia in adults with CKD undergoing dialysis. In addition, the company offers Rayaldee, an orally administered, extended release formulation of calcifediol for the treatment of secondary hyperparathyroidism in patients with CKD; Veltassa for the treatment of hyperkalaemia in CKD and chronic heart failure patients; and Invokana to treat diabetic kidney disease. Further, it developing Vadadustat, an investigational oral hypoxia-inducible factor prolyl hydroxylase inhibitor for the treatment of anemia due to chronic kidney disease; Avacopan, an orally-administered, highly selective inhibitor of C5aR1 for the treatment of orphan and rare renal diseases; ANG-3777 for the treatment of delayed graft function and cardiac surgery-associated acute kidney injury; Difelikefalin for the treatment for chronic kidney disease-associated pruritus; and VIT-2763 to treat beta-thalassemia. Vifor Pharma AG has a strategic partnership with Fresenius Kabi. The company was formerly known as Galenica AG and changed its name to Vifor Pharma AG in April 2017. Vifor Pharma AG was founded in 1872 and is headquartered in Sankt Gallen, Switzerland.",
    "website": "http://www.viforpharma.com",
    "zipcode": "9014"
  },
  "GNHAY": {
    "city": "Sankt Gallen",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Vifor Pharma AG",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "VIFOR PHARMA AG",
    "state": null,
    "summary": "Vifor Pharma AG, a pharmaceutical company, focuses on the development, manufacture, and commercialization of pharmaceutical products in Switzerland, rest of Europe, the United States, and internationally. The company offers Ferinject/Injectafer, a solution of ferric carboxymaltose used for the treatment of iron deficiency and iron deficiency anemia; Maltofer, an oral iron polymaltose complex for infants, children, adolescents, and pregnant woman with iron deficiency; and Mircera, a long-acting erythropoiesis-stimulating agent (ESA) to treat symptomatic anemia associated with the chronic kidney disease (CKD). It also provides Retacrit, a short-acting ESA; Venofer, an intravenous iron sucrose used in the intravenous treatment of iron deficiency; and Velphoro, a non-calcium, iron-based chewable phosphate binder for the treatment of hyperphosphatemia in adults with CKD undergoing dialysis. In addition, the company offers Rayaldee, an orally administered, extended release formulation of calcifediol for the treatment of secondary hyperparathyroidism in patients with CKD; Veltassa for the treatment of hyperkalaemia in CKD and chronic heart failure patients; and Invokana to treat diabetic kidney disease. Further, it developing Vadadustat, an investigational oral hypoxia-inducible factor prolyl hydroxylase inhibitor for the treatment of anemia due to chronic kidney disease; Avacopan, an orally-administered, highly selective inhibitor of C5aR1 for the treatment of orphan and rare renal diseases; ANG-3777 for the treatment of delayed graft function and cardiac surgery-associated acute kidney injury; Difelikefalin for the treatment for chronic kidney disease-associated pruritus; and VIT-2763 to treat beta-thalassemia. Vifor Pharma AG has a strategic partnership with Fresenius Kabi. The company was formerly known as Galenica AG and changed its name to Vifor Pharma AG in April 2017. Vifor Pharma AG was founded in 1872 and is headquartered in Sankt Gallen, Switzerland.",
    "website": "http://www.viforpharma.com",
    "zipcode": "9014"
  },
  "GNRO.PA": {
    "city": "Plan-les-Ouates",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Biotechnology",
    "long_name": "GeNeuro SA",
    "market": "fr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "GENEURO",
    "state": null,
    "summary": "GeNeuro SA, a clinical-stage biopharmaceutical company, develops drugs for the treatment of neurodegenerative and autoimmune diseases. Its lead therapeutic candidate is temelimab, a monoclonal antibody, which has completed Phase IIb clinical trial for the treatment of multiple sclerosis; and is in Phase IIa to treat type 1 diabetes, as well as is in Phase I for the treatment of chronic inflammatory demyelinating polyneuropathy. The company has cooperative research and development agreements with The National Institute of Neurological Disorders and Stroke to develop novel therapeutic antibodies for the treatment of amyotrophic lateral sclerosis; and Academic labs to develop inflammatory psychosis. GeNeuro SA was founded in 2006 and is headquartered in Plan-les-Ouates, Switzerland.",
    "website": "http://www.geneuro.ch",
    "zipcode": "1228"
  },
  "IDIA.SW": {
    "city": "Allschwil",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Idorsia Ltd",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "IDORSIA N",
    "state": null,
    "summary": "Idorsia Ltd, a biopharmaceutical company, discovers, develops, and commercializes drugs for unmet medical needs in Switzerland. The company has a clinical development pipeline that cover various therapeutic areas, including CNS, cardiovascular, and immunological disorders, as well as orphan diseases. Idorsia Ltd has a collaboration agreement with Janssen Biotech Inc. to jointly develop and commercialize aprocitentan and its derivative compounds or products; ReveraGen to research and co-develop vamorolone, a non-hormonal steroid modulator for the treatment of duchenne muscular dystrophy; and Hoffman-La Roche Inc. to develop and market compounds in the field of cancer immunotherapy. It also has a collaboration with Antares Pharma, Inc. for the development of a self- administered drug device product for Selatogrel; and Neurocrine Biosciences, Inc. to develop and commercialize ACT-709478, which is in Phase 1 clinical trial for the treatment of epilepsy. The company was incorporated in 2017 and is headquartered in Allschwil, Switzerland.",
    "website": "http://www.idorsia.com",
    "zipcode": "4123"
  },
  "IDRSF": {
    "city": "Allschwil",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Idorsia Ltd",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "IDORSIA LTD",
    "state": null,
    "summary": "Idorsia Ltd, a biopharmaceutical company, discovers, develops, and commercializes drugs for unmet medical needs in Switzerland. The company has a clinical development pipeline that cover various therapeutic areas, including CNS, cardiovascular, and immunological disorders, as well as orphan diseases. Idorsia Ltd has a collaboration agreement with Janssen Biotech Inc. to jointly develop and commercialize aprocitentan and its derivative compounds or products; ReveraGen to research and co-develop vamorolone, a non-hormonal steroid modulator for the treatment of duchenne muscular dystrophy; and Hoffman-La Roche Inc. to develop and market compounds in the field of cancer immunotherapy. It also has a collaboration with Antares Pharma, Inc. for the development of a self- administered drug device product for Selatogrel; and Neurocrine Biosciences, Inc. to develop and commercialize ACT-709478, which is in Phase 1 clinical trial for the treatment of epilepsy. The company was incorporated in 2017 and is headquartered in Allschwil, Switzerland.",
    "website": "http://www.idorsia.com",
    "zipcode": "4123"
  },
  "IMP-A-SDB.ST": {
    "city": "Zug",
    "country": "Switzerland",
    "currency": "SEK",
    "exchange": "STO",
    "industry": "Medical Devices",
    "long_name": "Implantica AG",
    "market": "se_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "Implantica AG SDB",
    "state": null,
    "summary": "Implantica AG, a medtech company, researches, develops, and sells medical implants for unmet medical needs in Switzerland. The company develops RefluxStop, a passive CE-marked implant for prevention of gastroesophageal reflux. It also develops e-InVivo, a sensor implant to monitor a multitude of health parameters and provide diagnostic information, as well as control treatment from inside the body; wireless energising platform; AppetiteControl, an implant to treat obesity by controlling appetite; and UriControl, a remote controlled implant to treat urinary incontinence for men and women. The company was founded in 2015 and is based in Zug, Switzerland.",
    "website": "http://www.implantica.com",
    "zipcode": "6300"
  },
  "IMR.F": {
    "city": "Lausanne",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "AC Immune SA",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "AC IMMUNE SA  SF-,02",
    "state": null,
    "summary": "AC Immune SA, a clinical stage biopharmaceutical company, discovers, designs, and develops medicines and diagnostic products for the prevention and treatment of neurodegenerative diseases associated with protein misfolding. Its SupraAntigen and Morphomer platforms are designed to generate vaccines, antibodies, and small molecules, which selectively interact with misfolded proteins that are common in a range of neurodegenerative diseases. The company is developing Crenezumab, a humanized, conformation-specific monoclonal antibody, which is in Phase II clinical prevention trial for the treatment of Alzheimer's disease (AD). It is also developing ACI-24, an anti-Abeta vaccine candidate that is in Phase II clinical study for AD, as well as completed Phase Ib clinical study for Down syndrome; ACI-35, an anti-Tau vaccine candidate that has completed Phase Ib clinical study; and Tau- positron emission tomography (PET) imaging tracer, which is in Phase II clinical study. In addition, the company is researching and developing small molecule Tau aggregation inhibitors for AD and NeuroOrphan indications. Further, it has discovery and preclinical stage molecules targeting range of neurodegenerative diseases, which include diagnostics targeting TDP-43, alpha-synuclein, and NLRP3. The company has license agreements and collaborations with Genentech, Inc.; Biogen International GmbH; Janssen Pharmaceuticals, Inc.; Life Molecular Imaging SA; Eli Lilly and Company; and WuXi Biologics. AC Immune SA was incorporated in 2003 and is headquartered in Lausanne, Switzerland.",
    "website": "http://www.acimmune.com",
    "zipcode": "1015"
  },
  "KURN.SW": {
    "city": "Schlieren",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Kuros Biosciences AG",
    "market": "ch_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Kuros N",
    "state": null,
    "summary": "Kuros Biosciences AG, a biopharmaceutical company, engages in the discovery, development, and commercialization of biopharmaceutical products for the treatment and prevention of chronic diseases in the United States, the United Kingdom, and internationally. Its sealants pipeline products include Neuroseal EU and US for the treatment of dural sealant cranial. The company's orthobiologics pipeline products include MagnetOs Granules and MagnetOs Putty in EU and US for the treatment of orthopedics, spinal, and dental problems. Its fibrin/PTH orthobiologics pipeline products comprise KUR-111, which has completed Phase II clinical trial for the treatment of tibial plateau fractures; and KUR-113, which completed Phase II clinical trial for the treatment of tibial shaft fractures, as well as is in the Phase I trial for the treatment of spinal interbody fusion. The company has collaboration with Checkmate Pharmaceuticals LLC for the development of CYT003 for the treatment of oncology. Kuros Biosciences AG is headquartered in Schlieren, Switzerland.",
    "website": "http://www.kuros.ch",
    "zipcode": "8952"
  },
  "LONN.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Diagnostics & Research",
    "long_name": "Lonza Group Ltd",
    "market": "ch_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "LONZA N",
    "state": null,
    "summary": "Lonza Group Ltd supplies products and services to the pharmaceutical, biotech, and specialty ingredients markets worldwide. The company operates through two segments, Pharma Biotech & Nutrition, and Specialty Ingredients. The Pharma Biotech & Nutrition segment provides technology platforms, including drug substance and drug product; and develops and manufactures customized active pharmaceutical ingredients and biopharmaceuticals, as well as formulation services and delivery systems for pharmaceutical and nutritional applications. It serves pharmaceutical companies, biotechnology firms, and medical research and testing organizations, as well as consumer health and nutrition companies. The Specialty Ingredients segment engages in the microbial control solutions and specialty chemical services businesses. Its Microbial control solutions business has offerings in professional hygiene, and home and personal care markets; and offerings in paints and coating, wood protection, material protection, and crop protection. This segments also offers specialty chemicals in electronics, aerospace, food and feed ingredients, agro chemicals, and diversified specialty chemicals markets. The company has collaboration with Moderna, Inc. to manufacture a potential COVID-19 vaccine, mRNA-1273. Lonza Group Ltd was founded in 1897 and is headquartered in Basel, Switzerland.",
    "website": "http://www.lonza.com",
    "zipcode": "4002"
  },
  "LZAGF": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Diagnostics & Research",
    "long_name": "Lonza Group Ltd",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "LONZA GROUP AG",
    "state": null,
    "summary": "Lonza Group Ltd supplies products and services to the pharmaceutical, biotech, and specialty ingredients markets worldwide. The company operates through two segments, Pharma Biotech & Nutrition, and Specialty Ingredients. The Pharma Biotech & Nutrition segment provides technology platforms, including drug substance and drug product; and develops and manufactures customized active pharmaceutical ingredients and biopharmaceuticals, as well as formulation services and delivery systems for pharmaceutical and nutritional applications. It serves pharmaceutical companies, biotechnology firms, and medical research and testing organizations, as well as consumer health and nutrition companies. The Specialty Ingredients segment engages in the microbial control solutions and specialty chemical services businesses. Its Microbial control solutions business has offerings in professional hygiene, and home and personal care markets; and offerings in paints and coating, wood protection, material protection, and crop protection. This segments also offers specialty chemicals in electronics, aerospace, food and feed ingredients, agro chemicals, and diversified specialty chemicals markets. The company has collaboration with Moderna, Inc. to manufacture a potential COVID-19 vaccine, mRNA-1273. Lonza Group Ltd was founded in 1897 and is headquartered in Basel, Switzerland.",
    "website": "http://www.lonza.com",
    "zipcode": "4002"
  },
  "LZAGY": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Diagnostics & Research",
    "long_name": "Lonza Group Ltd",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "LONZA GROUP AG",
    "state": null,
    "summary": "Lonza Group Ltd supplies products and services to the pharmaceutical, biotech, and specialty ingredients markets worldwide. The company operates through two segments, Pharma Biotech & Nutrition, and Specialty Ingredients. The Pharma Biotech & Nutrition segment provides technology platforms, including drug substance and drug product; and develops and manufactures customized active pharmaceutical ingredients and biopharmaceuticals, as well as formulation services and delivery systems for pharmaceutical and nutritional applications. It serves pharmaceutical companies, biotechnology firms, and medical research and testing organizations, as well as consumer health and nutrition companies. The Specialty Ingredients segment engages in the microbial control solutions and specialty chemical services businesses. Its Microbial control solutions business has offerings in professional hygiene, and home and personal care markets; and offerings in paints and coating, wood protection, material protection, and crop protection. This segments also offers specialty chemicals in electronics, aerospace, food and feed ingredients, agro chemicals, and diversified specialty chemicals markets. The company has collaboration with Moderna, Inc. to manufacture a potential COVID-19 vaccine, mRNA-1273. Lonza Group Ltd was founded in 1897 and is headquartered in Basel, Switzerland.",
    "website": "http://www.lonza.com",
    "zipcode": "4002"
  },
  "MED.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Devices",
    "long_name": "Medartis Holding AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MEDARTIS N",
    "state": null,
    "summary": "Medartis Holding AG, a medical device company, develops, manufactures, and sells implant solutions worldwide. Its medical devices are used for surgical fixation of bone fractures for upper and lower extremities, as well as for the craniomaxillofacial region. The company offers osteosynthesis systems for the areas of the hand, wrist, elbow, shoulder, and foot and ankle, as well as for the areas of the mandible, midface, and cranium under the APTUS and MODUS names. The company serves the surgeons, hospitals, and medical centers, as well as group purchasing organizations. Medartis Holding AG was founded in 1997 and is headquartered in Basel, Switzerland.",
    "website": "http://www.medartis.com",
    "zipcode": "4057"
  },
  "MLLCF": {
    "city": "Schlieren",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Molecular Partners AG",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MOLECULAR PARTNERS AG",
    "state": null,
    "summary": "Molecular Partners AG operates as a clinical-stage biopharmaceutical company. It is developing Abicipar, a DARPin therapeutic candidate, which is in Phase III clinical trials for the treatment of wet age-related macular degeneration, as well as for diabetic macular edema; and MP0250 that binds and inhibit vascular endothelial growth factor and hepatocyte growth factor pathways, which restores clinical sensitivity to various standard-of-care therapies in multiple myeloma. The company is also developing MP0274 that is in Phase I clinical trials for HER2-positive solid tumors; MP0310, which is in Phase I clinical trials for immuno-oncology; MPO317, a tumor-localized immune agonist that activates immune cells in the tumor; and Peptide-MHC, a tumor-localized immune-cell agonist to attack tumors. It has strategic partnerships with Allergan, Inc. and Amgen SA; and collaboration with AGC Biologics to develop anti-COVID-19 DARPin program. Molecular Partners AG was founded in 2004 and is headquartered in Schlieren, Switzerland.",
    "website": "http://www.molecularpartners.com",
    "zipcode": "8952"
  },
  "MOLN.SW": {
    "city": "Schlieren",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Molecular Partners AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MOLECULAR PARTNERS N",
    "state": null,
    "summary": "Molecular Partners AG operates as a clinical-stage biopharmaceutical company. It is developing Abicipar, a DARPin therapeutic candidate, which is in Phase III clinical trials for the treatment of wet age-related macular degeneration, as well as for diabetic macular edema; and MP0250 that binds and inhibit vascular endothelial growth factor and hepatocyte growth factor pathways, which restores clinical sensitivity to various standard-of-care therapies in multiple myeloma. The company is also developing MP0274 that is in Phase I clinical trials for HER2-positive solid tumors; MP0310, which is in Phase I clinical trials for immuno-oncology; MPO317, a tumor-localized immune agonist that activates immune cells in the tumor; and Peptide-MHC, a tumor-localized immune-cell agonist to attack tumors. It has strategic partnerships with Allergan, Inc. and Amgen SA; and collaboration with AGC Biologics to develop anti-COVID-19 DARPin program. Molecular Partners AG was founded in 2004 and is headquartered in Schlieren, Switzerland.",
    "website": "http://www.molecularpartners.com",
    "zipcode": "8952"
  },
  "MOVE.SW": {
    "city": "Castel San Pietro",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Devices",
    "long_name": "Medacta Group SA",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "MEDACTA GROUP N",
    "state": null,
    "summary": "Medacta Group SA develops, manufactures, and distributes orthopedic and spinal surgery medical devices in Europe, North America, the Asia-Pacific, and internationally. It offers personalized kinematic models and 3D planning tools for use in hip, knee, shoulder, sports medicine, and spine procedures. The company was founded in 1958 and is headquartered in Castel San Pietro, Switzerland.",
    "website": "http://www.medacta.com",
    "zipcode": "6874"
  },
  "MYMX": {
    "city": "Epalinges",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Mymetics Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "MYMETICS CORPORATION",
    "state": null,
    "summary": "Mymetics Corporation, a vaccine company, focuses on researching and developing vaccines for infectious and life disabling diseases in Switzerland. The company's product pipeline includes various vaccine candidates, such as HIV-1/AIDS, malaria, Covid-19, intra nasal influenza, respiratory syncytial virus, and chikungunya. It has a collaboration agreement with Texas Biomedical Research Institute; PATH Malaria Vaccine Initiative and the Laboratory of Malaria Immunology and Vaccinology of the National Institute of Allergy and Infectious Diseases to develop and produce virosome based vaccine formulations for a malaria transmission-blocking vaccine candidate; and Sanofi Pasteur Biologics, LLC to investigate the immunogenicity of influenza vaccines. The company was formerly known as ICHOR Corporation and changed its name to Mymetics Corporation in July 2001. Mymetics Corporation was founded in 1990 and is based in Epalinges, Switzerland.",
    "website": "http://www.mymetics.com",
    "zipcode": "1066"
  },
  "NLSP": {
    "city": "Stans",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "NLS Pharmaceutics AG",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "NLS Pharmaceutics Ltd.",
    "state": null,
    "summary": "NLS Pharmaceutics AG, a biopharmaceutical company, engages in the discovery and development of drug therapies to treat rare and complex central nervous system disorders. The company is focusing on the development of treatments for narcolepsy, idiopathic hypersomnia, and other rare sleep disorders, as well as neurodevelopmental disorders, such as attention deficit hyperactivity disorder (ADHD). Its two lead product candidates, include Quilience, for the treatment of excessive daytime sleepiness and cataplexy; and Nolazol, for the treatment of ADHD. NLS Pharmaceutics AG was founded in 2015 and is based in Stans, Switzerland.",
    "website": "http://www.nlspharma.com",
    "zipcode": "6370"
  },
  "NOTA.F": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "NOVARTIS NAM. ADR 1",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "NOVN.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "ch_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "NOVARTIS N",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "NOVNEE.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "ch_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "NOVARTIS  N 2. LINIE",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "NVS": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "Novartis AG",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "NVS.BA": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "ar_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "NOVARTIS AG",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "NVSEF": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "NOVARTIS AG",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "NVSN.MX": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Drug Manufacturers - General",
    "long_name": "Novartis AG",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "NOVARTIS AG",
    "state": null,
    "summary": "Novartis AG researches, develops, manufactures, and markets healthcare products worldwide. The company operates through two segments, Innovative Medicines and Sandoz. The Innovative Medicines segment offers prescription medicines for patients and healthcare providers. It also provides ophthalmology, neuroscience, immunology, hepatology and dermatology, respiratory, established, and cardiovascular, renal and metabolism medicine products. The Sandoz segment provides active ingredients and finished dosage forms of small molecule pharmaceuticals to third parties across a range of therapeutic areas, as well as finished dosage form anti-infectives. It also provides active pharmaceutical ingredients and intermediates primarily antibiotics; protein- or other biotechnology-based products, including biosimilars; and biotechnology manufacturing services. Novartis AG has a license and collaboration agreement with Alnylam Pharmaceuticals to develop, manufacture, and commercialize inclisiran; an agreement with CureVac to manufacture COVID-19 vaccine candidate CVnCoV; and collaboration with Artios Pharma Limited to create next generation DDR cancer therapies. The company was incorporated in 1996 and is headquartered in Basel, Switzerland.",
    "website": "http://www.novartis.com",
    "zipcode": "4056"
  },
  "OBSN.SW": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "ObsEva SA",
    "market": "ch_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "OBSEVA N",
    "state": null,
    "summary": "ObsEva SA, a biopharmaceutical company, focuses on the development and commercialization of novel therapeutics for women suffering from reproductive health and pregnancy. The company is developing Linzagolix, an oral gonadotropin-releasing hormone receptor antagonist for the treatment of pain associated with endometriosis and heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. It also is developing Ebopiprant, an oral and selective prostaglandin F2a, or PGF2a receptor antagonist, as a once daily treatment for preterm labor in weeks 24 to 34 of gestational age; and Nolasiban, an oral oxytocin receptor antagonist to enhance clinical pregnancy and live birth rates in women undergoing in vitro fertilization. The company was founded in 2012 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.obseva.com",
    "zipcode": "1228"
  },
  "OBSV": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "ObsEva SA",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ObsEva SA",
    "state": null,
    "summary": "ObsEva SA, a biopharmaceutical company, focuses on the development and commercialization of novel therapeutics for women suffering from reproductive health and pregnancy. The company is developing Linzagolix, an oral gonadotropin-releasing hormone receptor antagonist for the treatment of pain associated with endometriosis and heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. It also is developing Ebopiprant, an oral and selective prostaglandin F2a, or PGF2a receptor antagonist, as a once daily treatment for preterm labor in weeks 24 to 34 of gestational age; and Nolasiban, an oral oxytocin receptor antagonist to enhance clinical pregnancy and live birth rates in women undergoing in vitro fertilization. The company was founded in 2012 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.obseva.com",
    "zipcode": "1228"
  },
  "OBSVN.MX": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Biotechnology",
    "long_name": "ObsEva SA",
    "market": "mx_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "OBSEVA SA",
    "state": null,
    "summary": "ObsEva SA, a biopharmaceutical company, focuses on the development and commercialization of novel therapeutics for women suffering from reproductive health and pregnancy. The company is developing Linzagolix, an oral gonadotropin-releasing hormone receptor antagonist for the treatment of pain associated with endometriosis and heavy menstrual bleeding associated with uterine fibroids in pre-menopausal women. It also is developing Ebopiprant, an oral and selective prostaglandin F2a, or PGF2a receptor antagonist, as a once daily treatment for preterm labor in weeks 24 to 34 of gestational age; and Nolasiban, an oral oxytocin receptor antagonist to enhance clinical pregnancy and live birth rates in women undergoing in vitro fertilization. The company was founded in 2012 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.obseva.com",
    "zipcode": "1228"
  },
  "PHBA.F": {
    "city": "Stäfa",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Sonova Holding AG",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SON.HO.UN.ADR 1/5 SF -,05",
    "state": null,
    "summary": "Sonova Holding AG designs, develops, manufactures, and distributes hearing systems for adults and children with hearing impairment. It operates through two segments, Hearing Instruments and Cochlear Implants segments. It offers wireless communication products, rechargeable hearing aids, and professional audiological care services. The company provides hearing instruments under the Phonak, Unitron, and Hansaton brand names; cochlear implants under the Advanced Bionics brand; and professional hearing care services under the AudioNova, Audium, AuditionSanté, Boots Hearingcare, Connect Hearing, Fiebing, Geers, Hansaton, Lapperre, Lindacher, Schoonenberg, Triton, and Vitakustik brands. Sonova Holding AG sells its products through wholesale companies and independent distributors; and provides professional audiological care services through a network of approximately 3,500 stores and clinics. It operates in the Americas, Europe, the Middle East, Africa, and the Asia/Pacific. The company was formerly known as Phonak Holding AG and changed its name to Sonova Holding AG in August 2007. Sonova Holding AG was founded in 1947 and is headquartered in Stäfa, Switzerland.",
    "website": "http://www.sonova.com",
    "zipcode": "8712"
  },
  "POLN.SW": {
    "city": "Allschwil",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Polyphor AG",
    "market": "ch_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Polyphor N",
    "state": null,
    "summary": "Polyphor AG, a clinical stage biopharmaceutical company, focuses on developing macrocycle drugs for cancer. Its lead drug candidates include Balixafortide (POL6326), an antagonist of the chemokine receptor CXCR4, which is in Phase III for combination treatment in oncology; POL6014, an inhaled inhibitor of neutrophil elastase, which is in Phase Ib clinical trial for the treatment of cystic fibrosis and other neutrophilic lung diseases; and outer membrane protein targeting antibiotics (OMPTA) platform. The company is also developing POL7306, targeting the most resistant MDR strains of all Gram-negative ESKAPE, including enterococcus faecium, staphylococcus aureus, klebsiella pneumoniae, acinetobacter baumannii, pseudomonas aeruginosa, and enterobacter species pathogens; and inhaled murepavadin (POL7080), a precision outer membrane protein targeting antibiotic for the treatment of pseudomonas aeruginosa. Polyphor AG was founded in 1996 and is headquartered in Allschwil, Switzerland.",
    "website": "http://www.polyphor.com",
    "zipcode": "4123"
  },
  "PPGN.SW": {
    "city": "Zug",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "PolyPeptide Group AG",
    "market": "ch_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "POLYPEPTIDE N",
    "state": null,
    "summary": "PolyPeptide Group AG operates as a pharmaceutical products contract development and manufacturing organization worldwide. It focuses on proprietary and generic GMP-grade peptides used by pharmaceutical and biotech companies in approved pharmaceutical products, drugs in clinical development, and in generic products. The company provides GMP compliance and inspection, custom research and development, pre-GMP development, production, quality assurance, quality control, and regulatory support services. It also manufactures and sells peptide-based generics, cosmetic peptides, and individualized peptide therapeutics. The company was founded in 1996 and is based in Zug, Switzerland.",
    "website": "http://www.polypeptide.com",
    "zipcode": "6300"
  },
  "QTNT": {
    "city": "Eysins",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Diagnostics & Research",
    "long_name": "Quotient Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "Quotient Limited",
    "state": null,
    "summary": "Quotient Limited, a commercial-stage diagnostics company, develops, manufactures, commercializes, and sells products for the global transfusion diagnostics market in the United States, France, Japan, and internationally. The company is developing MosaiQ, a proprietary technology platform, which provides tests for immunohematology, serological disease screening, and molecular disease screening. Its conventional reagent products for blood grouping include antisera products that are used to identify blood group antigens; reagent red blood cells, which enable the identification of blood group antibodies; whole blood control products for use as daily quality assurance tests; and ancillary products that are used to support blood grouping. The company also offers MosaiQ COVID-19 Microarray that is designed as a serological disease screening microarray specific to COVID-19 antibody detection. It sells its products to hospitals, donor collection agencies, independent testing laboratories, original equipment manufacturers, and blood banking operation and other diagnostics companies. Quotient Limited was founded in 2007 and is headquartered in Eysins, Switzerland.",
    "website": "http://www.quotientbd.com",
    "zipcode": "1262"
  },
  "RHHBF": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE HOLDINGS AG",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "RHHBY": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE HOLDINGS AG",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "RHHVF": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "us_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE HOLDINGS AG",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "RHO6.F": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "dr_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE HLDG SP.ADR 1/8",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "RLF.SW": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Relief Therapeutics Holding AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "RELIEF THERAPEUTICS N",
    "state": null,
    "summary": "Relief Therapeutics Holding AG, a biopharmaceutical company, provides patients with therapeutic relief from serious diseases with high unmet medical need. The company focuses on clinical-stage programs based on molecules of natural origin (peptides and proteins) with a history of clinical use and either initial human activity with efficacy data or a strong scientific rationale. Its lead compound is RLF-100 (aviptadil), a synthetic human vasoactive intestinal peptide (VIP) with a multifaceted mode of action in respiratory indications is being investigated in two U.S. Phase 2b/3 clinical trials in acute respiratory deficiency due to COVID-19, as well as in Phase 2 clinical trial for the treatment of pulmonary sarcoidosis. The company is also involved in clinical development of RLF-100 for other indications in acute and chronic lung diseases. Relief Therapeutics Holding AG is based in Geneva, Switzerland.",
    "website": "http://www.relieftherapeutics.com",
    "zipcode": "1202"
  },
  "RLFTF": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Relief Therapeutics Holding AG",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "RELIEF THERAPEUTICS HOLDING AG",
    "state": null,
    "summary": "Relief Therapeutics Holding AG, a biopharmaceutical company, provides patients with therapeutic relief from serious diseases with high unmet medical need. The company focuses on clinical-stage programs based on molecules of natural origin (peptides and proteins) with a history of clinical use and either initial human activity with efficacy data or a strong scientific rationale. Its lead compound is RLF-100 (aviptadil), a synthetic human vasoactive intestinal peptide (VIP) with a multifaceted mode of action in respiratory indications is being investigated in two U.S. Phase 2b/3 clinical trials in acute respiratory deficiency due to COVID-19, as well as in Phase 2 clinical trial for the treatment of pulmonary sarcoidosis. The company is also involved in clinical development of RLF-100 for other indications in acute and chronic lung diseases. Relief Therapeutics Holding AG is based in Geneva, Switzerland.",
    "website": "http://www.relieftherapeutics.com",
    "zipcode": "1202"
  },
  "RO.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "ch_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE I",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "ROG.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "ch_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE GS",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "ROGN.MX": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Drug Manufacturers - General",
    "long_name": "Roche Holding AG",
    "market": "mx_market",
    "market_cap": "Mega Cap",
    "sector": "Healthcare",
    "short_name": "ROCHE HOLDINGS AG",
    "state": null,
    "summary": "Roche Holding AG engages in the prescription pharmaceuticals and diagnostics businesses in Switzerland, Germany, and internationally. It offers pharmaceutical products for treating anemia, cancer, cardiovascular, central nervous system, dermatology, hepatitis B and C, HIV/AIDS, inflammatory and autoimmune, intensive care medicine, leukemia, lymphoma, metabolic disorders, ophthalmology, respiratory disorders, rheumatoid arthritis, skin cancer, and transplantation. The company also offers in vitro diagnostics solutions for indications, such as cardiology, hematology, blood donor screening, coagulation, infectious disease, gynecology, oncology, and women's health. In addition, it supplies diagnostic instruments, reagents, consumables, and test kits for use in the diverse research market. Roche Holding AG has collaboration with Gilead Sciences, Inc. for COVID-19; a license and collaboration agreement with Shionogi & Co., Ltd. to develop and commercialize Xofluza, as well as SemaThera Inc. to develop biologicals for the treatment of diabetic retinopathy and other ischemic retinal diseases; and has collaboration with Affimed N.V to study AFM24 in combination with PD-L1 checkpoint inhibitor in EGFR expressing solid tumors. The company was founded in 1896 and is headquartered in Basel, Switzerland.",
    "website": "http://www.roche.com",
    "zipcode": "4070"
  },
  "ROSE.SW": {
    "city": "Frauenfeld",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Zur Rose Group AG",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "ZUR ROSE GROUP N",
    "state": null,
    "summary": "Zur Rose Group AG operates an e-commerce pharmacy and a wholesale business for medical and pharmaceutical products under the Zur Rose and DocMorris brands in Germany, Switzerland, and rest of Europe. It offers consumer health, beauty, and personal care products. The company also provides medicines management services. It operates stationary pharmacy shops. The company sells its products directly to physicians, online mail-order pharmacies, and private individuals. The company was formerly known as Zur Rose AG and changed its name to Zur Rose Group AG in May 2015. Zur Rose Group AG was founded in 1993 and is headquartered in Frauenfeld, Switzerland.",
    "website": "http://www.zurrosegroup.com",
    "zipcode": "8500"
  },
  "SANN.SW": {
    "city": "Pratteln",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Biotechnology",
    "long_name": "Santhera Pharmaceuticals Holding AG",
    "market": "ch_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "SANTHERA N",
    "state": null,
    "summary": "Santhera Pharmaceuticals Holding AG, a specialty pharmaceutical company, together with its subsidiaries, develops and commercializes medicines for rare neuromuscular and pulmonary diseases with high unmet medical need in the European Union and internationally. It is developing Duchenne muscular dystrophy (DMD) product portfolio to treat patients irrespective of causative mutations, disease stage, or age. The company's late stage drug candidate include vamorolone, which is being developed as treatments for DMD. Its clinical stage pipeline also comprises lonodelestat (POL6014) to treat cystic fibrosis and other neutrophilic pulmonary diseases, as well as omigapil and an exploratory gene therapy approach targeting congenital muscular dystrophies. The company also out-licenses ex-North American rights to its approved product, Raxone (idebenone), for the treatment of Leber's hereditary optic neuropathy. It has collaboration agreement with Cold Spring Harbor Laboratory to investigate the potential of lonodelestat (POL6014), a potent inhibitor of human neutrophil elastase, as a therapeutic intervention for COVID-19-related acute respiratory distress syndrome. Santhera Pharmaceuticals Holding AG is headquartered in Pratteln, Switzerland.",
    "website": "http://www.santhera.com",
    "zipcode": "4133"
  },
  "SAUHF": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Straumann Holding AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "STRAUMANN HOLDING AG",
    "state": null,
    "summary": "Straumann Holding AG provides tooth replacement and orthodontic solutions worldwide. It researches, develops, manufactures, and supplies dental implant systems, biomaterials, CADCAM prosthetics, digital equipment, software, clear aligner systems, and various materials for dental applications. The company offers dental implant systems for tissue and bone level; titanium, titanium alloy, ceramic, and mini dental implant systems; and guided and non-guided surgical instruments, as well as implant-borne prosthetics. It provides biomaterials, such as bone augmentation materials, membranes, fleeces, and sponges; ceramic healing and screw retained abutments; intraoral scanning solutions; 3D printers; milling machines; and prevention products. In addition, it offers biomaterials, bone substitutes, membranes, biologics, and soft tissue management and oral healing products; digital solutions for dental labs, dentists, and centralized milling centers, as well as materials, third party systems, and guided surgery; surgical instruments comprising surgical and modular cassettes, guided instruments, implant maintenance products, bone block fixation sets, bonerings, titanium pin sets, and other cassettes; and edentulous, pro arch fixed, prosthetic, and mini implant solutions for edentulous patients. Further, it provides esthetic restorations that include ceramic implant monotypes, ceramic implants, abutments, biologics, and other solutions; and Emdogain for wound healing. Further, it offers systems Clear Correct aligners; and training and education services to its customers. The company provides its products to general dentists, specialists, and dental technicians and laboratories, as well as corporate customers, such as distributors, hospitals, universities, and dental service organizations in approximately 100 countries through a network of distribution subsidiaries and partners. Straumann Holding AG was founded in 1954 and is headquartered in Basel, Switzerland.",
    "website": "http://www.straumann.com",
    "zipcode": "4002"
  },
  "SAUHY": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Straumann Holding AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "STRAUMANN HOLDING AG",
    "state": null,
    "summary": "Straumann Holding AG provides tooth replacement and orthodontic solutions worldwide. It researches, develops, manufactures, and supplies dental implant systems, biomaterials, CADCAM prosthetics, digital equipment, software, clear aligner systems, and various materials for dental applications. The company offers dental implant systems for tissue and bone level; titanium, titanium alloy, ceramic, and mini dental implant systems; and guided and non-guided surgical instruments, as well as implant-borne prosthetics. It provides biomaterials, such as bone augmentation materials, membranes, fleeces, and sponges; ceramic healing and screw retained abutments; intraoral scanning solutions; 3D printers; milling machines; and prevention products. In addition, it offers biomaterials, bone substitutes, membranes, biologics, and soft tissue management and oral healing products; digital solutions for dental labs, dentists, and centralized milling centers, as well as materials, third party systems, and guided surgery; surgical instruments comprising surgical and modular cassettes, guided instruments, implant maintenance products, bone block fixation sets, bonerings, titanium pin sets, and other cassettes; and edentulous, pro arch fixed, prosthetic, and mini implant solutions for edentulous patients. Further, it provides esthetic restorations that include ceramic implant monotypes, ceramic implants, abutments, biologics, and other solutions; and Emdogain for wound healing. Further, it offers systems Clear Correct aligners; and training and education services to its customers. The company provides its products to general dentists, specialists, and dental technicians and laboratories, as well as corporate customers, such as distributors, hospitals, universities, and dental service organizations in approximately 100 countries through a network of distribution subsidiaries and partners. Straumann Holding AG was founded in 1954 and is headquartered in Basel, Switzerland.",
    "website": "http://www.straumann.com",
    "zipcode": "4002"
  },
  "SESI": {
    "city": "Plan-les-Ouates",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "SES Solar Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "SES SOLAR INC",
    "state": null,
    "summary": "SES Solar Inc. develops and delivers products in the field of photovoltaic energy in Switzerland. The company offers a range of photovoltaic products, such as solar tiles that comprise standard panels primarily for urban or rural areas, and flat or sloped roofs; and custom/architecturally integrated panels made of glass/glass tedlar, which are used for glazing, light admitting apertures in industrial and residential buildings, as well as for veranda roofs. It also handles project management services from design to completion, as well as provides monitoring (supervision), maintenance, and operation services. The company was founded in 2001 and is based in Plan-les-Ouates, Switzerland. As of November 23, 2010, SES Solar Inc. operates as a subsidiary of Flannel Management Sàrl.",
    "website": "http://www.societe-energie-solaire.com",
    "zipcode": "1228"
  },
  "SFZN.SW": {
    "city": "Zofingen",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Siegfried Holding AG",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SIEGFRIED N",
    "state": null,
    "summary": "Siegfried Holding AG engages in the life sciences business worldwide. The company develops and produces active pharmaceutical ingredients (APIs) and intermediates, as well as finished dosage forms, including solid oral dosage forms, and sterile and aseptic filling liquid dosage forms. It offers contract development and manufacturing services, including process and chemical development, analytical development, pilot manufacturing and scale up, and commercial manufacturing. The company also provides APIs and controlled substances focusing on anesthetics, pain/addiction treatment applications, and central nervous and respiratory diseases, as well as caffeine for human health and nutrition. In addition, it licenses oral solid and sterile products; assembles registration dossiers; and offers a common technical document for various products. The company was founded in 1873 and is headquartered in Zofingen, Switzerland.",
    "website": "http://www.siegfried.ch",
    "zipcode": "4800"
  },
  "SONVF": {
    "city": "Stäfa",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Sonova Holding AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SONOVA HOLDING AG",
    "state": null,
    "summary": "Sonova Holding AG designs, develops, manufactures, and distributes hearing systems for adults and children with hearing impairment. It operates through two segments, Hearing Instruments and Cochlear Implants segments. It offers wireless communication products, rechargeable hearing aids, and professional audiological care services. The company provides hearing instruments under the Phonak, Unitron, and Hansaton brand names; cochlear implants under the Advanced Bionics brand; and professional hearing care services under the AudioNova, Audium, AuditionSanté, Boots Hearingcare, Connect Hearing, Fiebing, Geers, Hansaton, Lapperre, Lindacher, Schoonenberg, Triton, and Vitakustik brands. Sonova Holding AG sells its products through wholesale companies and independent distributors; and provides professional audiological care services through a network of approximately 3,500 stores and clinics. It operates in the Americas, Europe, the Middle East, Africa, and the Asia/Pacific. The company was formerly known as Phonak Holding AG and changed its name to Sonova Holding AG in August 2007. Sonova Holding AG was founded in 1947 and is headquartered in Stäfa, Switzerland.",
    "website": "http://www.sonova.com",
    "zipcode": "8712"
  },
  "SONVY": {
    "city": "Stäfa",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Sonova Holding AG",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SONOVA HOLDING AG",
    "state": null,
    "summary": "Sonova Holding AG designs, develops, manufactures, and distributes hearing systems for adults and children with hearing impairment. It operates through two segments, Hearing Instruments and Cochlear Implants segments. It offers wireless communication products, rechargeable hearing aids, and professional audiological care services. The company provides hearing instruments under the Phonak, Unitron, and Hansaton brand names; cochlear implants under the Advanced Bionics brand; and professional hearing care services under the AudioNova, Audium, AuditionSanté, Boots Hearingcare, Connect Hearing, Fiebing, Geers, Hansaton, Lapperre, Lindacher, Schoonenberg, Triton, and Vitakustik brands. Sonova Holding AG sells its products through wholesale companies and independent distributors; and provides professional audiological care services through a network of approximately 3,500 stores and clinics. It operates in the Americas, Europe, the Middle East, Africa, and the Asia/Pacific. The company was formerly known as Phonak Holding AG and changed its name to Sonova Holding AG in August 2007. Sonova Holding AG was founded in 1947 and is headquartered in Stäfa, Switzerland.",
    "website": "http://www.sonova.com",
    "zipcode": "8712"
  },
  "SOON.SW": {
    "city": "Stäfa",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Sonova Holding AG",
    "market": "ch_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "SONOVA N",
    "state": null,
    "summary": "Sonova Holding AG designs, develops, manufactures, and distributes hearing systems for adults and children with hearing impairment. It operates through two segments, Hearing Instruments and Cochlear Implants segments. It offers wireless communication products, rechargeable hearing aids, and professional audiological care services. The company provides hearing instruments under the Phonak, Unitron, and Hansaton brand names; cochlear implants under the Advanced Bionics brand; and professional hearing care services under the AudioNova, Audium, AuditionSanté, Boots Hearingcare, Connect Hearing, Fiebing, Geers, Hansaton, Lapperre, Lindacher, Schoonenberg, Triton, and Vitakustik brands. Sonova Holding AG sells its products through wholesale companies and independent distributors; and provides professional audiological care services through a network of approximately 3,500 stores and clinics. It operates in the Americas, Europe, the Middle East, Africa, and the Asia/Pacific. The company was formerly known as Phonak Holding AG and changed its name to Sonova Holding AG in August 2007. Sonova Holding AG was founded in 1947 and is headquartered in Stäfa, Switzerland.",
    "website": "http://www.sonova.com",
    "zipcode": "8712"
  },
  "SPHDF": {
    "city": "Pratteln",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Santhera Pharmaceuticals Holding AG",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SANTHERA PHARMACEUTICALS HOLDIN",
    "state": null,
    "summary": "Santhera Pharmaceuticals Holding AG, a specialty pharmaceutical company, together with its subsidiaries, develops and commercializes medicines for rare neuromuscular and pulmonary diseases with high unmet medical need in the European Union and internationally. It is developing Duchenne muscular dystrophy (DMD) product portfolio to treat patients irrespective of causative mutations, disease stage, or age. The company's late stage drug candidate include vamorolone, which is being developed as treatments for DMD. Its clinical stage pipeline also comprises lonodelestat (POL6014) to treat cystic fibrosis and other neutrophilic pulmonary diseases, as well as omigapil and an exploratory gene therapy approach targeting congenital muscular dystrophies. The company also out-licenses ex-North American rights to its approved product, Raxone (idebenone), for the treatment of Leber's hereditary optic neuropathy. It has collaboration agreement with Cold Spring Harbor Laboratory to investigate the potential of lonodelestat (POL6014), a potent inhibitor of human neutrophil elastase, as a therapeutic intervention for COVID-19-related acute respiratory distress syndrome. Santhera Pharmaceuticals Holding AG is headquartered in Pratteln, Switzerland.",
    "website": "http://www.santhera.com",
    "zipcode": "4133"
  },
  "STMN.MX": {
    "city": "Geneva",
    "country": "Switzerland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Medical Instruments & Supplies",
    "long_name": "STMicroelectronics N.V.",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "STMICROELECTRONICS",
    "state": null,
    "summary": "STMicroelectronics N.V., together with its subsidiaries, designs, develops, manufactures, and markets semiconductor products in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. It operates through Automotive and Discrete Group; Analog, MEMS and Sensors Group; and Microcontrollers and Digital ICs Group segments. The Automotive and Discrete Group segment offers automotive integrated circuits (ICs); and discrete and power transistor products. The Analog, MEMS and Sensors Group segment provides industrial application-specific integrated circuits (ASICs) and application-specific standard products (ASSPs); general purpose analog products; custom analog ICs; wireless charging solutions; galvanic isolated gate drivers; low and high voltage amplifiers, comparators, and current-sense amplifiers; MasterGaN, a solution that integrates a silicon driver and GaN power transistors in a single package; wireline and wireless connectivity ICs; touch screen controllers; micro-electro-mechanical systems (MEMS) products, including sensors or actuators; and optical sensing solutions. The Microcontrollers and Digital ICs Group segment offers general purpose and secure microcontrollers; radio frequency (RF) and electrically erasable programmable read-only memories; and RF, digital, and mixed-signal ASICs. It also provides assembly and other services. The company sells its products through distributors and retailers, as well as through sales representatives. STMicroelectronics N.V. was incorporated in 1987 and is headquartered in Geneva, Switzerland.",
    "website": "http://www.st.com",
    "zipcode": null
  },
  "STMN.SW": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Straumann Holding AG",
    "market": "ch_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "STRAUMANN N",
    "state": null,
    "summary": "Straumann Holding AG provides tooth replacement and orthodontic solutions worldwide. It researches, develops, manufactures, and supplies dental implant systems, biomaterials, CADCAM prosthetics, digital equipment, software, clear aligner systems, and various materials for dental applications. The company offers dental implant systems for tissue and bone level; titanium, titanium alloy, ceramic, and mini dental implant systems; and guided and non-guided surgical instruments, as well as implant-borne prosthetics. It provides biomaterials, such as bone augmentation materials, membranes, fleeces, and sponges; ceramic healing and screw retained abutments; intraoral scanning solutions; 3D printers; milling machines; and prevention products. In addition, it offers biomaterials, bone substitutes, membranes, biologics, and soft tissue management and oral healing products; digital solutions for dental labs, dentists, and centralized milling centers, as well as materials, third party systems, and guided surgery; surgical instruments comprising surgical and modular cassettes, guided instruments, implant maintenance products, bone block fixation sets, bonerings, titanium pin sets, and other cassettes; and edentulous, pro arch fixed, prosthetic, and mini implant solutions for edentulous patients. Further, it provides esthetic restorations that include ceramic implant monotypes, ceramic implants, abutments, biologics, and other solutions; and Emdogain for wound healing. Further, it offers systems Clear Correct aligners; and training and education services to its customers. The company provides its products to general dentists, specialists, and dental technicians and laboratories, as well as corporate customers, such as distributors, hospitals, universities, and dental service organizations in approximately 100 countries through a network of distribution subsidiaries and partners. Straumann Holding AG was founded in 1954 and is headquartered in Basel, Switzerland.",
    "website": "http://www.straumann.com",
    "zipcode": "4002"
  },
  "TECN.SW": {
    "city": "Männedorf",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Tecan Group Ltd.",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "TECAN GROUP AG N",
    "state": null,
    "summary": "Tecan Group Ltd. provides laboratory instruments and solutions for pharmaceutical and biotechnology companies, university research departments, and forensic and diagnostic laboratories. It operates through Life Sciences Business and Partnering Business segments. The company develops, produces, markets, and supports automated workflow solutions, including laboratory instruments, software packages, application knowhow, services, consumables, and spare parts; bioanalytical instruments, such as microplate readers and washers; and consulting, and service and consumables for genomics, protein analysis, and cell and tissue analysis. It also develops and manufactures laboratory instrument manufacturers with essential components comprising precision pumps, valves, robotic arms, and developer software for life science research, diagnostics, and various other industries; platform-based automation solutions for various molecular diagnostic tests; and dedicated automation solutions. The company operates in Switzerland and Other European countries, North America, Asia, and internationally. Tecan Group Ltd. was founded in 1980 and is headquartered in Männedorf, Switzerland.",
    "website": "http://www.tecan.com",
    "zipcode": "8708"
  },
  "U4W.F": {
    "city": "Eysins",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Diagnostics & Research",
    "long_name": "Quotient Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "QUOTIENT LTD",
    "state": null,
    "summary": "Quotient Limited, a commercial-stage diagnostics company, develops, manufactures, and sells products for the global transfusion diagnostics market in the United States, France, Japan, and internationally. The company is developing MosaiQ, a proprietary technology platform, which provides tests for immunohematology and serological disease screening. Its conventional reagent products for blood grouping include antisera products that are used to identify blood group antigens; reagent red blood cells, which enable the identification of blood group antibodies; whole blood control products for use as daily quality assurance tests; and ancillary products that are used to support blood grouping. The company is also developing microarray-based SARS-CoV-2 antibody test for use on the MosaiQ platform for COVID-19. It sells its products to hospitals, donor collection agencies, independent testing laboratories, original equipment manufacturers, and blood banking operation and other diagnostics companies. Quotient Limited was founded in 2007 and is headquartered in Eysins, Switzerland.",
    "website": "http://www.quotientbd.com",
    "zipcode": "1262"
  },
  "VBSN.SW": {
    "city": "Neuhausen am Rheinfall",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "IVF Hartmann Holding AG",
    "market": "ch_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "IVF HARTMANN N",
    "state": null,
    "summary": "IVF Hartmann Holding AG provides medical consumer goods in Switzerland and internationally. The company offers surgical disposable instruments, blankets, clothing and gloves, disinfection and hygiene products, wound management and hydrotherapy services, incontinence management, and first aid products, as well as various courses. It serves private doctors; outpatient medicine and care; hospitals and clinics; pharmacies and drugstores; nursing homes; and medical and food retailers, as well as industrial customers. The company was formerly known as IVF and changed its name to IVF Hartmann Holding AG in 1993. The company was founded in 1874 and is headquartered in Neuhausen am Rheinfall, Switzerland.",
    "website": "http://www.ivf.hartmann.info",
    "zipcode": "8212"
  },
  "VECT": {
    "city": "Basel",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "VectivBio Holding AG",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "VectivBio Holding AG",
    "state": null,
    "summary": "VectivBio Holding AG, a clinical stage biopharmaceutical company, focuses on the discovery, development, and commercialization of treatments for rare conditions. It develops Apraglutide, a long-acting synthetic peptide analog of glucagon-like peptide-2 that is in Phase III clinical trial for the treatment of patients with short bowel syndrome-intestinal failure (SBS-IF), as well as for SBS-IF in patients with colon-in-continuity anatomy. The company was incorporated in 2019 and is headquartered in Basel, Switzerland.",
    "website": "http://vectivbio.com",
    "zipcode": "4051"
  },
  "VIFN.SW": {
    "city": "Sankt Gallen",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "long_name": "Vifor Pharma AG",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "VIFOR N",
    "state": null,
    "summary": "Vifor Pharma AG, a pharmaceutical company, focuses on the development, manufacture, and commercialization of pharmaceutical products in Switzerland, rest of Europe, the United States, and internationally. The company offers Ferinject/Injectafer, a solution of ferric carboxymaltose used for the treatment of iron deficiency and iron deficiency anemia; Maltofer, an oral iron polymaltose complex for infants, children, adolescents, and pregnant woman with iron deficiency; and Mircera, a long-acting erythropoiesis-stimulating agent (ESA) to treat symptomatic anemia associated with the chronic kidney disease (CKD). It also provides Retacrit, a short-acting ESA; Venofer, an intravenous iron sucrose used in the intravenous treatment of iron deficiency; and Velphoro, a non-calcium, iron-based chewable phosphate binder for the treatment of hyperphosphatemia in adults with CKD undergoing dialysis. In addition, the company offers Rayaldee, an orally administered, extended release formulation of calcifediol for the treatment of secondary hyperparathyroidism in patients with CKD; Veltassa for the treatment of hyperkalaemia in CKD and chronic heart failure patients; and Invokana to treat diabetic kidney disease. Further, it developing Vadadustat, an investigational oral hypoxia-inducible factor prolyl hydroxylase inhibitor for the treatment of anemia due to chronic kidney disease; Avacopan, an orally-administered, highly selective inhibitor of C5aR1 for the treatment of orphan and rare renal diseases; ANG-3777 for the treatment of delayed graft function and cardiac surgery-associated acute kidney injury; Difelikefalin for the treatment for chronic kidney disease-associated pruritus; and VIT-2763 to treat beta-thalassemia. Vifor Pharma AG has a strategic partnership with Fresenius Kabi. The company was formerly known as Galenica AG and changed its name to Vifor Pharma AG in April 2017. Vifor Pharma AG was founded in 1872 and is headquartered in Sankt Gallen, Switzerland.",
    "website": "http://www.viforpharma.com",
    "zipcode": "9014"
  },
  "VNTA": {
    "city": "Butschwil",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Ventana Biotech, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "VENTANA BIOTECH INC",
    "state": null,
    "summary": "Ventana Biotech, Inc., a development stage biotech company, identifies, evaluates, acquires, develops, and partners commercialization of intellectual property in the area of drug candidates for personalized medicine. The company focuses in the areas of anti-obesity and related illnesses. The company holds rights for the formula for a medicament containing chewing gum with a composition of the extract of hoodia gordonii and 2-hydroxyoleic acid for the treatment of obesity, hypertension, and other metabolic disorders. The company develops appetite suppressant chewing gums, including the low dosage product for the over-the-counter market and the high dosage product for distribution by pharmacists. It intends to market low dosage product though drug and health food stores. The company was formerly known as Personalica, Inc. and changed its name to Ventana Biotech, Inc. in October 2008. Ventana Biotech, Inc. was founded in 1989 and is based in Butschwil, Switzerland.",
    "website": null,
    "zipcode": "9606"
  },
  "XLS.F": {
    "city": "Zürich",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Xlife Sciences AG",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "XLIFE SCIENCES AG  SF 1",
    "state": null,
    "summary": "Xlife Sciences AG focuses on the development of life sciences technologies. The company's projects and pipeline include biotech/therapies and technology platforms for antibody therapy, including obesity, acute myeloid leukemia, and acute lymphocytic leukemia; nanovesikel therapy comprising arthritis, MS, and ALS; painkiller solution; screening technology of antibodies; and modification of antibodies and breakdown of polygeny (genetics). Its projects and pipeline also include medical technology and artificial intelligence comprising 3D bioprinting for life; medical technology comprising reprocessing of instruments of surgical robots; medical devices for the early detection of dementia and Parkinson's disease; development of bile duct implants; and analysis software (AI) for the diagnosis/evaluation of X-ray and MRI images for early detection of prostate cancer. The company is headquartered in Zurich, Switzerland.",
    "website": "http://www.xlifesciences.ch",
    "zipcode": "8008"
  },
  "XLS.MU": {
    "city": "Zürich",
    "country": "Switzerland",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Biotechnology",
    "long_name": "Xlife Sciences AG",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "XLIFE SCIENCES AG  SF 1",
    "state": null,
    "summary": "Xlife Sciences AG focuses on the development of life sciences technologies. The company's projects and pipeline include biotech/therapies and technology platforms for antibody therapy, including obesity, acute myeloid leukemia, and acute lymphocytic leukemia; nanovesikel therapy comprising arthritis, MS, and ALS; painkiller solution; screening technology of antibodies; and modification of antibodies and breakdown of polygeny (genetics). Its projects and pipeline also include medical technology and artificial intelligence comprising 3D bioprinting for life; medical technology comprising reprocessing of instruments of surgical robots; medical devices for the early detection of dementia and Parkinson's disease; development of bile duct implants; and analysis software (AI) for the diagnosis/evaluation of X-ray and MRI images for early detection of prostate cancer. The company is headquartered in Zurich, Switzerland.",
    "website": "http://www.xlifesciences.ch",
    "zipcode": "8008"
  },
  "YPSN.SW": {
    "city": "Burgdorf",
    "country": "Switzerland",
    "currency": "CHF",
    "exchange": "EBS",
    "industry": "Medical Instruments & Supplies",
    "long_name": "Ypsomed Holding AG",
    "market": "ch_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "YPSOMED HLDG",
    "state": null,
    "summary": "Ypsomed Holding AG, together with its subsidiaries, develops, manufactures, and sells injection and infusion systems for pharmaceutical and biotechnology companies. The company operates through Ypsomed Delivery Systems and Ypsomed Diabetes Care segments. The Ypsomed Delivery Systems segment provides various injection systems, such as pen injectors, auto injectors, patch injectors, and wearable injectors, as well as other smart devices. This segment offers its products under the YDS brand. The Ypsomed Diabetes Care segment sells and trades in insulin pumps, infusion sets, pen needles, blood glucose monitoring systems, accessories, and other day-to-day items for diabetics. This segment offers its products under the mylife brand name. The company offers precision turned parts; and contract manufacturing and other services. It markets its products through biotechnology and pharmaceutical partners, as well as through its own distribution network and independent distributors. The company operates in Switzerland, other European countries, North America, and internationally. Ypsomed Holding AG was founded in 1984 and is headquartered in Burgdorf, Switzerland.",
    "website": "http://www.ypsomed.com",
    "zipcode": "3401"
  },
  "ZRSEF": {
    "city": "Frauenfeld",
    "country": "Switzerland",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Pharmaceutical Retailers",
    "long_name": "Zur Rose Group AG",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "ZUR ROSE GROUP AG",
    "state": null,
    "summary": "Zur Rose Group AG operates an e-commerce pharmacy and a wholesale business for medical and pharmaceutical products under the Zur Rose and DocMorris brands in Germany, Switzerland, and rest of Europe. It offers consumer health, beauty, and personal care products. The company also provides medicines management services. It operates stationary pharmacy shops. The company sells its products directly to physicians, online mail-order pharmacies, and private individuals. The company was formerly known as Zur Rose AG and changed its name to Zur Rose Group AG in May 2015. Zur Rose Group AG was founded in 1993 and is headquartered in Frauenfeld, Switzerland.",
    "website": "http://www.zurrosegroup.com",
    "zipcode": "8500"
  }
}
