{
    "AGGG": {
        "short_name": "ANTILIA GROUP CORP",
        "long_name": "Antilia Group, Corp.",
        "summary": "Antilia Group, Corp. engages in the development of applications (apps) and games. It develops Android and iOS apps and games. The company was founded in 2016 and is based in Sosua, Dominican Republic. Antilia Group, Corp. operates as a subsidiary of Greenwich Holdings Ltd.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Sosua"
    },
    "AHAD": {
        "short_name": "ALPHACOM HOLDINGS INC",
        "long_name": "Alphacom Holdings, Inc.",
        "summary": "Alphacom Holdings, Inc., an exploration stage mining company, engages in the acquisition, exploration, and development of mineral properties. It holds nine claims in the Mitu Gold Mine in Departamento del Vaupes, Colombia. The company was founded in 2013 and is based in Puerto Plata, Dominican Republic.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Puerto Plata"
    },
    "AVRN": {
        "short_name": "AVRA INC",
        "long_name": "Avra Inc.",
        "summary": "Avra Inc., a development stage company, focuses on the provision of solutions in the cryptocurrency and digital currency markets worldwide. It primarily focuses on offering payment solutions to businesses. The company also provides AvraSecure, a range of server security, hosting, and management services that provide managed and co-managed security solutions to meet the security and infrastructure needs of organizations. In addition, it markets and distributes Smart TV boxes to home consumers. Avra Inc. was founded in 2010 and is based in Santo Domingo, the Dominican Republic.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Santo Domingo"
    },
    "CNCN": {
        "short_name": "CHUN CAN CAPITAL GROUP",
        "long_name": "Chun Can Capital Group",
        "summary": "Chun Can Capital Group does not have significant operations. It intends to achieve long-term growth potential through a combination with a business. Previously, the company was engaged in semiconductor packaging and manufacturing; designing, manufacturing, and installing automated assembly line for flat panel displays; manufacturing and testing PCB related equipment based on customers' specification; and customer relationship management solution and consulting, call-center operation, and database marketing. The company was formerly known as Cintel Corp. Chun Can Capital Group was incorporated in 1996 and is based in Santo Domingo Este, Dominican Republic.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Santo Domingo Este"
    },
    "MEPW": {
        "short_name": "ME RENEWABLE POWER CORP",
        "long_name": "ME Renewable Power Corporation",
        "summary": "ME Renewable Power Corporation does not have significant operations. It seeks to consummate a merger or acquisition. The company was formerly known as Jarex Solutions Corp. and changed its name to ME Renewable Power Corporation in May 2016. The company was founded in 2014 and is based in Las Charcas, Dominican Republic. ME Renewable Power Corporation is a subsidiary of Microenergy Asia Pacific Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Las Charcas"
    },
    "SANP": {
        "short_name": "SANTO MINING CORP",
        "long_name": "Santo Mining Corporation",
        "summary": "Santo Mining Corporation is engaged in the acquisition, exploration, and development of gold and other precious mineral resources in the Dominican Republic. It has claims in the Hispaniola Gold-Copper Back-Arc area. The company was formerly known as Santo Pita Corp. and changed its name to Santo Mining Corp. in March 2012. Santo Mining Corporation was founded in 2009 and is headquartered in Santo Domingo, the Dominican Republic.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Santo Domingo"
    },
    "TTSI": {
        "short_name": "TACTICAL SERVICES INC",
        "long_name": "Tactical Services, Inc.",
        "summary": "Tactical Services, Inc., a development stage company, focuses on providing TVs streaming advertisements for the customers lining up on the outside of the nightclubs in the United states. It focuses on showcasing pictures of club scenes, special events, deals on drink specials, and advertisements from local businesses and other companies. The company intends to sell advertisements for local restaurants, cigarette companies, alcohol companies, clothing companies, ads for sports and entertainment events, etc. Tactical Services, Inc. was founded in 2012 and is based in Puerto Plata, Dominican Republic.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Dominican Republic",
        "city": "Puerto Plata"
    }
}