{
    "EXO1N.MX": {
        "short_name": "EXOR NV",
        "long_name": "Exor N.V.",
        "summary": "Exor N.V., together with its subsidiaries, engages in the reinsurance, luxury goods, automotive, agricultural equipment, construction equipment, commercial vehicles, and professional football businesses. The company reinsures agriculture, aviation/space, casualty, catastrophe, energy, engineering, financial, marine, motor, multiline, and property risks, as well as offers mortality, longevity, accident and health, and alternative risk products. It also provides vehicles for the mass-market under the Chrysler, Dodge, Fiat, Fiat Professional, Jeep, Lancia, and Ram brands, as well as the SRT performance vehicles; luxury vehicles under the Maserati brand; related service parts and accessories, as well as service contracts under the Mopar brand for the mass-market; and retail and dealer financing, leasing, and rental services. In addition, the company operates in the components and production systems sectors under the Teksid and Comau brands; designs, engineers, produces, and sells luxury performance sports cars under the Ferrari brand; and manages professional football teams. Further, it designs, produces, markets, sells, and finances agricultural and construction equipment; trucks, commercial vehicles, and buses; and firefighting, defense, and other vehicles; and engines, axles, and transmissions solutions for vehicles, as well as engines for marine and power generation applications. Additionally, the company publishes The Economist newspaper; and offers magazines, and conference and electronic services. It operates in the Netherlands, the United States, Brazil, Canada, Poland, Serbia, Turkey, Mexico, Argentina, the Czech Republic, India, China, Australia, and South Africa. The company is headquartered in Amsterdam, the Netherlands. Exor N.V. is a subsidiary of Giovanni Agnelli B.V.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1082 MS",
        "website": "http://www.exor.com",
        "full_time_employees": 263284
    }
}