{
  "A9U.SG": {
    "city": "Centurion",
    "country": "South Africa",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Farm Products",
    "long_name": "Astral Foods Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "ASTRAL FOODS LTD. Registered Sh",
    "state": null,
    "summary": "Astral Foods Limited operates as an integrated poultry producer in South Africa and internationally. It operates through three segments: Poultry, Feed, and Other Africa. The company engages in the breeding operations; sale of day-old chicks and hatching eggs; broiler production; abattoirs; and processing, marketing, sale, and distribution of poultry products. It also produces feed products for farmed animal species; and provides laboratory analytical services to the animal feed industry. The company offers its products under the Ross 308, Meadow, National Chicks, CAL, Goldi, County Fair, Festive, Mountain Valley, SupaStar, TigerChicks, Tiger Animal Feeds, Mozpintos, and National Chicks Swaziland brands. Astral Foods Limited was founded in 2001 and is based in Centurion, South Africa.",
    "website": "http://www.astralfoods.com",
    "zipcode": "0157"
  },
  "ADH.JO": {
    "city": "Sandton",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Education & Training Services",
    "long_name": "ADvTECH Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "ADvTECH Ltd",
    "state": null,
    "summary": "ADvTECH Limited provides education, training, and staff placement services in South Africa and other African countries. It operates through three divisions: Schools, Tertiary, and Resourcing. The Schools division provides pre-primary, primary, and secondary education services. The Tertiary division offers education in diploma, degree, and postgraduate levels through face-to-face, online, and distance learning. The Resourcing division provides placement solutions in the areas of IT, finance, and engineering. The company was founded in 1978 and is based in Sandton, South Africa.",
    "website": "http://www.advtech.co.za",
    "zipcode": "2196"
  },
  "AHL.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "AH-Vest Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "AH-Vest Limited",
    "state": null,
    "summary": "AH-Vest Limited manufactures and sells food products primarily in South Africa. The company offers tomato sauces and other value added products. It offers products under All Joy brand. The company was founded in 1988 and is based in Johannesburg, South Africa. AH-Vest Limited operates as a subsidiary of Eastern Trading Co (Pty) Ltd.",
    "website": "http://www.alljoy.co.za",
    "zipcode": "1872"
  },
  "ARL.JO": {
    "city": "Centurion",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Farm Products",
    "long_name": "Astral Foods Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Astral Foods Ltd",
    "state": null,
    "summary": "Astral Foods Limited operates as an integrated poultry producer in South Africa and internationally. It operates through three segments: Poultry, Feed, and Other Africa. The company engages in the breeding operations; sale of day-old chicks and hatching eggs; broiler production; abattoirs; and processing, marketing, sale, and distribution of poultry products. It also produces feed products for farmed animal species; and provides laboratory analytical services to the animal feed industry. The company offers its products under the Ross 308, Meadow, National Chicks, CAL, Goldi, County Fair, Festive, Mountain Valley, SupaStar, TigerChicks, Tiger Animal Feeds, Mozpintos, and National Chicks Swaziland brands. Astral Foods Limited was founded in 2001 and is based in Centurion, South Africa.",
    "website": "http://www.astralfoods.com",
    "zipcode": "0157"
  },
  "AVI.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "AVI Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "AVI Ltd",
    "state": null,
    "summary": "AVI Limited, together with its subsidiaries, manufactures, processes, markets, and distributes branded consumer products in the food, beverage, footwear, apparel, and cosmetics categories in South Africa and internationally. It operates through Entyce Beverages, Snackworks, I&J, Personal Care, and Footwear & Apparel segments. The company provides hot beverages, sweet and savoury biscuits and snacks, frozen convenience foods, out-of-home ranges, personal care products, cosmetics, shoes, accessories, and fashion apparels. It offers beverages under the Five Roses, Freshpak, Trinco, Lavazza, Ciro, Douwe Egberts, House of Coffees, Frisco, Koffiehuis, and Ellis Brown brands; biscuits and snacks under the Bakers, Willards, ProVita, and Baker Street brands; frozen foods under the I&J brand; and personal care products under the Yardley and Lenthéric brands. The company also provides footwear and apparel under the Spitz, Carvela, Kurt Geiger, Lacoste, Gant, Tosoni, GX&Co, and Green Cross brands. AVI Limited is based in Johannesburg, South Africa.",
    "website": "http://www.avi.co.za",
    "zipcode": "2196"
  },
  "BID.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Food Distribution",
    "long_name": "Bid Corporation Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "BID Corporation Ltd",
    "state": null,
    "summary": "Bid Corporation Limited provides foodservice solutions in South Africa and internationally. The company distributes fresh ingredients, including fish, seafood, meat, produce, dairy products, and ambient goods for the hospitality, institutional, catering, and retail sectors. It also provides foodservice and beverage distribution services for the HoReCa sector; and develops e-commerce solutions. In addition, the company manufactures and distributes meat, poultry, dairy, and general food ingredients, as well as baking ingredients and equipment; and offers a multi-temperature foodservice for various ambient, and chilled and frozen food products. Further, it distributes specialty products for the western styled food market; and frozen, chilled, and ambient local products for the independent street market, as well as offers various catering equipment and non-food essentials. Bid Corporation Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
    "website": "http://www.bidcorpgroup.com",
    "zipcode": "2196"
  },
  "CKS.JO": {
    "city": "Mount Edgecombe",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Farm Products",
    "long_name": "Crookes Brothers Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Crookes Brothers Ltd",
    "state": null,
    "summary": "Crookes Brothers Limited, together with its subsidiaries, produces agricultural products. The company offers sugar cane, bananas, deciduous fruits, and macadamias. It is also involved in the development and sale of commercial, residential, and industrial real estate properties. In addition, the company engages in the sale of grains and nursery plants, and rental of leased buildings, as well as tourism business. It has operations in the KwaZulu-Natal, Mpumalanga, and Western Cape provinces of South Africa, as well as in Swaziland, Zambia, and Mozambique. The company was founded in 1860 and is headquartered in Mount Edgecombe, South Africa.",
    "website": "http://www.cbl.co.za",
    "zipcode": "4300"
  },
  "COH.JO": {
    "city": "Durbanville",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Education & Training Services",
    "long_name": "Curro Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Curro Holdings Limited",
    "state": null,
    "summary": "Curro Holdings Limited develops, acquires, and manages independent schools in South Africa, Namibia, and Botswana. The company operates through Curroa and Meridian segments. It operates nursery, primary, and high schools offering balanced academics, sports, and culture. The company also operates Curro Academy and Meridian schools, which accommodate learners from age five to grade 12; Curro Castle nursery schools; Curro schools that accommodate learners from age three to grade 12; and Curro Select schools that accommodate learners from age of three months to grade 12. The company operates 76 campuses with approximately 62,689 learners. The company was founded in 1998 and is based in Durbanville, South Africa. Curro Holdings Limited is a subsidiary of PSG Financial Services Limited.",
    "website": "http://www.curro.co.za",
    "zipcode": "7550"
  },
  "DGH.JO": {
    "city": "Stellenbosch",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Beverages - Wineries & Distilleries",
    "long_name": "Distell Group Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Distell Group Hldgs Ltd",
    "state": null,
    "summary": "Distell Group Holdings Limited, an investment holding company, produces and markets wines, spirits, ciders, and other ready-to-drink beverages worldwide. The company offers its products primarily under the Alto, Scottish Leader, Black Bottle, Bunnahabhain, Tobermory, Deanston, Ledaig, Cruz Vodka, Kibao, Kingfisher, Caprice Wines, Hunter's Choice, Altar Wines, and Yatta Juice brands. It also engages in the farming business; and provision of investment services. The company was founded in 1925 and is headquartered in Stellenbosch, South Africa. Distell Group Holdings Limited is a subsidiary of Remgro Limited.",
    "website": "http://www.distell.co.za",
    "zipcode": "7600"
  },
  "DSTZF": {
    "city": "Stellenbosch",
    "country": "South Africa",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Beverages - Wineries & Distilleries",
    "long_name": "Distell Group Holdings Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "DISTELL GROUP HOLDINGS LTD",
    "state": null,
    "summary": "Distell Group Holdings Limited, an investment holding company, produces and markets wines, spirits, ciders, and other ready-to-drink beverages worldwide. The company offers its products primarily under the Alto, Scottish Leader, Black Bottle, Bunnahabhain, Tobermory, Deanston, Ledaig, Cruz Vodka, Kibao, Kingfisher, Caprice Wines, Hunter's Choice, Altar Wines, and Yatta Juice brands. It also engages in the farming business; and provision of investment services. The company was founded in 1925 and is headquartered in Stellenbosch, South Africa. Distell Group Holdings Limited is a subsidiary of Remgro Limited.",
    "website": "http://www.distell.co.za",
    "zipcode": "7600"
  },
  "ILE.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Household & Personal Products",
    "long_name": "Imbalie Beauty Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Imbalie Beauty Limited",
    "state": null,
    "summary": "Imbalie Beauty Limited markets and distributes own and independent health and beauty products in South Africa. The company's salon brands include Placecol Skin Care Clinic, Dream Nails Beauty, and Perfect 10 Nail & Body Studio. Its distribution network consists of 100 owned and franchised beauty salons, independent beauty salons, and pharmacies. The company was formerly known as Skinwell Holdings Limited. Imbalie Beauty Limited was founded in 2003 and is based in Johannesburg, South Africa.",
    "website": "http://www.imbaliebeauty.co.za",
    "zipcode": "2191"
  },
  "KAL.JO": {
    "city": "Paarl",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Farm Products",
    "long_name": "Kaap Agri Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Kaap Agri Limited",
    "state": null,
    "summary": "Kaap Agri Limited trades in agricultural, fuel, and related retail markets in South Africa and Namibia. It operates through Trade, Retail Fuel & Convenience, Grain Services, and Manufacturing segments. The Trade segment offers production inputs, mechanization equipment and services, and other goods to agricultural producers, as well as the general public. The Retail Fuel & Convenience segment provides a retail fuel offering to a range of customers, including convenience store and quick service restaurant outlets. The Grain Services segment sells grain products; and provides a range of services, including storage and handling of grain products. The Manufacturing segment manufactures and sells dripper pipes and other irrigation equipment; food grade plastic bulk bins for the agricultural market; and distributes other irrigation parts. It operates under the Agrimark, Liquormark, Pakmark, Kaap Agri, Wesgraan, Expressmark, the Fuel Company, and Tego brands. Kaap Agri Limited was founded in 1912 and is based in Paarl, South Africa.",
    "website": "http://www.kaapagri.co.za",
    "zipcode": "7646"
  },
  "LBR.JO": {
    "city": "Johannesburg",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "Libstar Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Libstar Holdings Ltd",
    "state": null,
    "summary": "Libstar Holdings Limited manufactures, imports, exports, and supplies various food and beverage, household, and personal care products in South Africa and internationally. It offers dairy products, such as cheeses, yoghurts, milk, butters, dips, spreads, and creams and sauces; meat and chicken products; mushrooms; prepared meals; natural and flavored waters, carbonated soft drinks, and bar mixes; disposable paper cups; paper and plastic containers and polystyrene trays; and cutlery and accessories. The company also provides chutneys, table sauces, vinegars, tomato pastes, salad dressings, and mayonnaise and marinades; salt, pepper, herbs and spices, and curry powders and seasoning mixes; pastas and noodles; pasta sauces and cook-in-sauces; soups, canned fruit, vegetables, legumes, and antipasti; honey, jams, and peanut and nut butters; and teas. In addition, it offers cereals, nuts, snack bars, and confectionery products; baking products and aids; cotton wool and cotton buds, cosmetic facial pads, beauty soaps, and bath additions; and laundry detergents, fabric softeners, and related products. The company sells consumer packaged goods to customers in the retail, food service, industrial, and export channels. Libstar Holdings Limited was founded in 2005 and is based in Johannesburg, South Africa.",
    "website": "http://www.libstar.co.za",
    "zipcode": "2196"
  },
  "LXU.F": {
    "city": "Tongaat",
    "country": "South Africa",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Confectioners",
    "long_name": "Tongaat Hulett Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "TONGAAT-HULETT LTD  RC 1",
    "state": null,
    "summary": "Tongaat Hulett Limited operates as an agriculture and agri-processing company in Zimbabwe, Mozambique, South Africa, Other SADC, North America, Europe and Middle East, and the Asia-Pacific. It produces and sells a range of refined sugarcane and maize based carbohydrate products; sweeteners; energy and supplementary feeds to the livestock farming community under the Voermol brand using bagasse and molasses; and corn starch, glucose, and other related products under the Amryal, Hydex, and Vaalgold Gluten 60 brands. The company also provides white and brown sugar products under the Huletts, SunSweet, and Blue Crystal brands. In addition, it engages in the land conversion and development activities. Further, the company is involved in the production of ethanol; and generation of renewable electricity from bagasse. Tongaat Hulett Limited was founded in 1875 and is based in Tongaat, South Africa.",
    "website": "http://www.tongaat.com",
    "zipcode": "4400"
  },
  "NUT.JO": {
    "city": "Durban",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "Nutritional Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Nutritional Holdings Ltd",
    "state": null,
    "summary": "Nutritional Holdings Limited, an investment holding company, manufactures, markets, and sells staple dry foods primarily for the mass feeding market in South Africa. The company operates through Foods and Services segments. It also provides cannabis infusions, oils, extracts, and related edibles, as well as contract manufacturing services. The company is based in Durban, South Africa. Nutritional Holdings Limited is a subsidiary of Empire Cannabis Holdings Limited.",
    "website": "http://www.nutritionalholdingssa.com",
    "zipcode": "4319"
  },
  "O1F.MU": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Packaged Foods",
    "long_name": "Oceana Group Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "OCEANA GRP  RC-,001",
    "state": null,
    "summary": "Oceana Group Limited operates as a fishing company in Africa, Asia, Europe, the United States, Australia, the Far East, and internationally. It engages in catching, procuring, processing, marketing, and distributing canned fish, fishmeal, fish oil, pilchard, anchovy, redeye herring, gulf menhaden, tuna, horse mackerel, hake, lobster, and squid; and mid-water, deep-sea, and inshore fishing for pelagic fish. The company also provides refrigerated warehouse facilities and logistical support services. It offers its products under the Lucky Star, Glenryck, Lucky Pet, and Daybrook brands. The company was incorporated in 1918 and is headquartered in Cape Town, South Africa.",
    "website": "http://www.oceana.co.za",
    "zipcode": "8001"
  },
  "OCE.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "Oceana Group Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Oceana Group Ltd",
    "state": null,
    "summary": "Oceana Group Limited operates as a fishing company in Africa, Asia, Europe, the United States, Australia, the Far East, and internationally. It engages in catching, procuring, processing, marketing, and distributing canned fish, fishmeal, fish oil, pilchard, anchovy, redeye herring, gulf menhaden, tuna, horse mackerel, hake, lobster, and squid; and mid-water, deep-sea, and inshore fishing for pelagic fish. The company also provides refrigerated warehouse facilities and logistical support services. It offers its products under the Lucky Star, Glenryck, Lucky Pet, and Daybrook brands. The company was incorporated in 1918 and is headquartered in Cape Town, South Africa.",
    "website": "http://www.oceana.co.za",
    "zipcode": "8001"
  },
  "OCGPF": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Oceana Group Limited",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "OCEANA GROUP",
    "state": null,
    "summary": "Oceana Group Limited operates as a fishing company in Africa, Asia, Europe, the United States, Australia, the Far East, and internationally. It engages in catching, procuring, processing, marketing, and distributing canned fish, fishmeal, fish oil, pilchard, anchovy, redeye herring, gulf menhaden, tuna, horse mackerel, hake, lobster, and squid; and mid-water, deep-sea, and inshore fishing for pelagic fish. The company also provides refrigerated warehouse facilities and logistical support services. It offers its products under the Lucky Star, Glenryck, Lucky Pet, and Daybrook brands. The company was incorporated in 1918 and is headquartered in Cape Town, South Africa.",
    "website": "http://www.oceana.co.za",
    "zipcode": "8001"
  },
  "PFB.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "Premier Fishing & Brands Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Premier Fishing Brands Ltd",
    "state": null,
    "summary": "Premier Fishing & Brands Limited, an integrated food and fishing company, engages in harvesting, processing, marketing, sale, and distribution of marine resources in South Africa, the United States, the Far East, and Europe. The company operates through Fishing, Aquaculture, and Services segments. Its products include pilchards and anchovy, west coast rock lobster, south coast rock lobster, abalone, squid, and hake. The company is also involved in the abalone farming, as well as manufactures fertilizer products, such as organic liquid fertilizer. In addition, it provides processing and marketing, and cold storage services. The company offers its products under the South Atlantic Lobster and Sea Diamond brands. The company was formerly known as Premier Food and Fishing Limited and changed its name to Premier Fishing & Brands Limited in October 2017. Premier Fishing & Brands Limited was founded in 1952 and is headquartered in Cape Town, South Africa.",
    "website": "http://premierfishing.co.za",
    "zipcode": "8001"
  },
  "QFH.JO": {
    "city": "Wellington",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Farm Products",
    "long_name": "Quantum Foods Holdings Ltd",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Quantum Foods Hldgs Ltd",
    "state": null,
    "summary": "Quantum Foods Holdings Ltd engages in the feed and poultry business in South African and rest of African markets. The company operates through Eggs, Farming, and Animal Feeds segments. It produces and distributes eggs; and sells layer parent stock, hatching eggs, day-old pullets, and point-of-lay hens under the Bergvlei Chicks brand. The company also supplies livestock to abattoirs; produces day-old commercial broiler chicks from hatcheries; and produces and sells various feeds, including broiler, layer, dairy, sheep, cattle, ostrich, and pig feeds under the Nova Feeds brand. In addition, it sells its products under the Bellevue Chicks, Safe Eggs, Nulaid, Quantum, Mega Eggs, and Galovos brand names. The company was incorporated in 2013 and is headquartered in Wellington, South Africa.",
    "website": "http://quantumfoods.co.za",
    "zipcode": "7655"
  },
  "RCL.JO": {
    "city": "Durban",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "RCL Foods Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "RCL Foods Limited",
    "state": null,
    "summary": "RCL Foods Limited, through its subsidiaries, engages in the food business in South Africa and other African countries. The company operates through Food and Logistics divisions. It provides grocery products, pies, beverages, flour, mill bake products and specialty baking products, chicken products, sugar, and animal feed products. The company sells its products primarily under the Nola, Number 1, Selati, Bobtail, Catmor, Ouma, Rainbow Simply Chicken, Monati, Canine Cuisine, and EPOL brand names. RCL Foods Limited also provides sales, supply chain intelligence, warehousing, distribution, import/export, and credit management solutions. The company was formerly known as Rainbow Chicken Limited and changed its name to RCL Foods Limited in August 2013. The company was founded in 1960 and is headquartered in Durban, South Africa. RCL Foods Limited is a subsidiary of Remgro Limited.",
    "website": "http://www.rclfoods.com",
    "zipcode": "3629"
  },
  "RFG.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "RFG Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "RFG Holdings Limited",
    "state": null,
    "summary": "RFG Holdings Limited manufactures and markets convenience meal solutions in South Africa and the Kingdom of Eswatini. The company operates through Regional and International segments. It offers canned fruits, jams, vegetables, meat products, fruit juices, fruit purees and concentrates, dry packed foods, fresh and frozen ready meals, pies, pastries, bakery, salads, canned pineapple, tomato paste, canned tomatoes, vegetable puree, citrus fruit products, custards, spices, and gravy and cook-in sauces. In addition, the company provides jelly, crispy coatings, vegetable protein, curries, breyanis, soya, infant meals, and dairy products, as well as a range of food/household ingredients. It provides its products under the Rhodes, Bull Brand, Bisto, Hinds, Pakco, Hazeldene, Woza Woza, Buffalo, Magpie, Gold Dish, Wilde, Zing, Trout Hall, Trotters, Southern Coating, Wild Fruit Juice, and Rhodes Squish brands. The company was formerly known as Rhodes Food Group Holdings Limited and changed its name to RFG Holdings Limited in April 2020. RFG Holdings Limited was founded in 1897 and is headquartered in Cape Town, South Africa.",
    "website": "http://www.rfg.com",
    "zipcode": "7680"
  },
  "SDO.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Education & Training Services",
    "long_name": "Stadio Holdings Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Stadio Holdings Limited",
    "state": null,
    "summary": "Stadio Holdings Limited, an investment holding company, provides higher education services in South Africa. It offers undergraduate programs, including higher certificates, diplomas, and degrees; and post-graduate programs comprising honors and masters degrees, and doctorate. The company provides teacher education for pre-school and primary school teachers; postgraduate accounting education services; higher certificates and master degrees in accounting program; and higher education qualifications for management, commerce, banking, financial planning and insurance, and public management; and higher education through distance learning focused on the leadership in management, business and commerce, and law and policing. As of December 31, 2020, it owned 6 registered higher education institutions. The company was incorporated in 2016 and is based in Cape Town, South Africa. Stadio Holdings Limited is a subsidiary of PSG Alpha Investments Proprietary Limited.",
    "website": "http://stadio.co.za",
    "zipcode": "7550"
  },
  "SGPPF": {
    "city": "Pinetown",
    "country": "South Africa",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Food Distribution",
    "long_name": "The SPAR Group Ltd",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "SPAR GROUP LIMITED",
    "state": null,
    "summary": "The SPAR Group Ltd engages in the wholesale and distribution of goods and services to SPAR grocery stores and various other branded group retail outlets in Southern Africa, Ireland, Switzerland, and Poland. The company offers fresh produce, in-store bakery, butchery, deli, ready-to-eat meals, home-meal replacements, groceries, general merchandise, baked foods, liquor products, Building and hardware products, dispensary and health-related products, confectionery, health and beauty, frozen foods, catering products, wines, and non-food items. It operates 4,357 stores. The SPAR Group Ltd was founded in 1932 and is headquartered in Pinetown, South Africa.",
    "website": "http://www.spar.co.za",
    "zipcode": "3610"
  },
  "SHG.JO": {
    "city": "Cape Town",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Farm Products",
    "long_name": "Sea Harvest Group Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Sea Harvest Group Ltd",
    "state": null,
    "summary": "Sea Harvest Group Limited engages in the fishing and food business serving retail and foodservice customers. The company operates through four segments: South African Fishing, Australia, Aquaculture, and Cape Harvest Foods. Its activities include the fishing of cape hake, and shark bay king and tiger prawns, as well as horse and Spanish mackerel, pilchards, anchovies, tuna, scallops, crabs, and a variety of farmed species; processing of the catch into frozen and chilled seafood; and marketing of products. The company owns and operates a fleet of 34 vessels, which include single and twin fresh fish trawlers, factory freezer trawlers, and access to in-shore trawlers that catch and process cape hake and other species, as well as by-catch species. It also has 12 prawn vessels, which catch and process prawns, scallops, crabs, and related by-catch species. The company distributes various chilled and frozen food products through its distribution network; and to local supermarket chains in South Africa, as well as supplies its products to 30 countries worldwide. It also imports and distributes frozen seafood to the catering and hospitality industry. In addition, the company engages in the aquaculture business, as wells as provides abalone, mussels, oysters, and trout farming services. Further, it is involved in the production, distribution, marketing, and sale of value-added dairy products to the South African retail, wholesale, foodservice, and food ingredients markets. The company was formerly known as Sea Harvest Holdings Proprietary Limited and changed its name to Sea Harvest Group Limited in February 2017. Sea Harvest Group Limited was founded in 1964 and is headquartered in Cape Town, South Africa. Sea Harvest Group Limited is a subsidiary of Brimco Proprietary Limited.",
    "website": "http://www.seaharvestgroup.co.za",
    "zipcode": "7925"
  },
  "SPP.JO": {
    "city": "Pinetown",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Food Distribution",
    "long_name": "The SPAR Group Ltd",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "The Spar Group Ltd",
    "state": null,
    "summary": "The SPAR Group Ltd engages in the wholesale and distribution of goods and services to SPAR grocery stores and various other branded group retail outlets in Southern Africa, Ireland, Switzerland, and Poland. The company offers fresh produce, in-store bakery, butchery, deli, ready-to-eat meals, home-meal replacements, groceries, general merchandise, baked foods, liquor products, Building and hardware products, dispensary and health-related products, confectionery, health and beauty, frozen foods, catering products, wines, and non-food items. It operates 4,357 stores. The SPAR Group Ltd was founded in 1932 and is headquartered in Pinetown, South Africa.",
    "website": "http://www.spar.co.za",
    "zipcode": "3610"
  },
  "TBLMF": {
    "city": "Bryanston",
    "country": "South Africa",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Tiger Brands Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "TIGER BRANDS",
    "state": null,
    "summary": "Tiger Brands Limited engages in the manufacture, marketing, and distribution of fast-moving consumer goods primarily in South Africa. The company offers baby care products under the Purity brand; bakeries under the Albany and Tinkies brands; and culinary fruit veg products under the Crosse & Blackwell, Benny, All Gold, Spray and Cook, Ice Cap, KOO, Colman's, Black Cat, Mrs H.S. Ball's Chutney, and Hugo's brands. It also provides home care products under the Airoma, Bio Classic, Bio Crystal, Doom, Jeyes, and Peaceful Sleep brands; milling products under the Golden Cloud and Ace brands; rice pasta under the Fatti's and Moni's, Cresta, Tastic, and Aunt Caroline brands; and superfoods under the Ace, Jungle, King Korn, and Morvite brands. In addition, the company provides personal care products under the Dolly Varden, Kair, gill, Lemon Lite, No Hair, Perfect Touch, Protein Feed, Status, and Ingram's brands; and snacks, treats, and beverages under the Beacon, Maynards, Hall's, Sparkles, All Sorts, Oros, Jelly Tots, Toff-O-Luxe, Fizz Pop, Smoothies, Rose's, and Energade brands. Further, it provides out of home solutions and product offerings in various pack formats to franchised restaurant groups, hotel groups, catering groups, airlines, institutions, independent restaurants and coffee shops, independent hotels, game reserves, lodges, and bed and breakfast establishments; and product solutions for the establishment cleaning, pest control, and room air refreshing. The company also exports its products to approximately 25 countries in Africa. Tiger Brands Limited was founded in 1920 and is headquartered in Bryanston, South Africa.",
    "website": "http://www.tigerbrands.com",
    "zipcode": "2196"
  },
  "TBLMY": {
    "city": "Bryanston",
    "country": "South Africa",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Tiger Brands Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "TIGER BRANDS",
    "state": null,
    "summary": "Tiger Brands Limited engages in the manufacture, marketing, and distribution of fast-moving consumer goods primarily in South Africa. The company offers baby care products under the Purity brand; bakeries under the Albany and Tinkies brands; and culinary fruit veg products under the Crosse & Blackwell, Benny, All Gold, Spray and Cook, Ice Cap, KOO, Colman's, Black Cat, Mrs H.S. Ball's Chutney, and Hugo's brands. It also provides home care products under the Airoma, Bio Classic, Bio Crystal, Doom, Jeyes, and Peaceful Sleep brands; milling products under the Golden Cloud and Ace brands; rice pasta under the Fatti's and Moni's, Cresta, Tastic, and Aunt Caroline brands; and superfoods under the Ace, Jungle, King Korn, and Morvite brands. In addition, the company provides personal care products under the Dolly Varden, Kair, gill, Lemon Lite, No Hair, Perfect Touch, Protein Feed, Status, and Ingram's brands; and snacks, treats, and beverages under the Beacon, Maynards, Hall's, Sparkles, All Sorts, Oros, Jelly Tots, Toff-O-Luxe, Fizz Pop, Smoothies, Rose's, and Energade brands. Further, it provides out of home solutions and product offerings in various pack formats to franchised restaurant groups, hotel groups, catering groups, airlines, institutions, independent restaurants and coffee shops, independent hotels, game reserves, lodges, and bed and breakfast establishments; and product solutions for the establishment cleaning, pest control, and room air refreshing. The company also exports its products to approximately 25 countries in Africa. Tiger Brands Limited was founded in 1920 and is headquartered in Bryanston, South Africa.",
    "website": "http://www.tigerbrands.com",
    "zipcode": "2196"
  },
  "TBS.JO": {
    "city": "Bryanston",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Packaged Foods",
    "long_name": "Tiger Brands Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Tiger Brands Ltd",
    "state": null,
    "summary": "Tiger Brands Limited engages in the manufacture, marketing, and distribution of fast-moving consumer goods primarily in South Africa. The company offers baby care products under the Purity brand; bakeries under the Albany and Tinkies brands; and culinary fruit veg products under the Crosse & Blackwell, Benny, All Gold, Spray and Cook, Ice Cap, KOO, Colman's, Black Cat, Mrs H.S. Ball's Chutney, and Hugo's brands. It also provides home care products under the Airoma, Bio Classic, Bio Crystal, Doom, Jeyes, and Peaceful Sleep brands; milling products under the Golden Cloud and Ace brands; rice pasta under the Fatti's and Moni's, Cresta, Tastic, and Aunt Caroline brands; and superfoods under the Ace, Jungle, King Korn, and Morvite brands. In addition, the company provides personal care products under the Dolly Varden, Kair, gill, Lemon Lite, No Hair, Perfect Touch, Protein Feed, Status, and Ingram's brands; and snacks, treats, and beverages under the Beacon, Maynards, Hall's, Sparkles, All Sorts, Oros, Jelly Tots, Toff-O-Luxe, Fizz Pop, Smoothies, Rose's, and Energade brands. Further, it provides out of home solutions and product offerings in various pack formats to franchised restaurant groups, hotel groups, catering groups, airlines, institutions, independent restaurants and coffee shops, independent hotels, game reserves, lodges, and bed and breakfast establishments; and product solutions for the establishment cleaning, pest control, and room air refreshing. The company also exports its products to approximately 25 countries in Africa. Tiger Brands Limited was founded in 1920 and is headquartered in Bryanston, South Africa.",
    "website": "http://www.tigerbrands.com",
    "zipcode": "2196"
  },
  "TON.JO": {
    "city": "Tongaat",
    "country": "South Africa",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Confectioners",
    "long_name": "Tongaat Hulett Limited",
    "market": "za_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Tongaat Hulett Ltd",
    "state": null,
    "summary": "Tongaat Hulett Limited operates as an agriculture and agri-processing company in Zimbabwe, Mozambique, South Africa, Other SADC, North America, Europe and Middle East, and the Asia-Pacific. It produces and sells a range of refined sugarcane and maize based carbohydrate products; sweeteners; energy and supplementary feeds to the livestock farming community under the Voermol brand using bagasse and molasses; and corn starch, glucose, and other related products under the Amryal, Hydex, and Vaalgold Gluten 60 brands. The company also provides white and brown sugar products under the Huletts, SunSweet, and Blue Crystal brands. In addition, it engages in the land conversion and development activities. Further, the company is involved in the production of ethanol; and generation of renewable electricity from bagasse. Tongaat Hulett Limited was founded in 1875 and is based in Tongaat, South Africa.",
    "website": "http://www.tongaat.com",
    "zipcode": "4400"
  },
  "UG5A.F": {
    "city": "Bryanston",
    "country": "South Africa",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Tiger Brands Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "TIGER BRANDS  RC-,10",
    "state": null,
    "summary": "Tiger Brands Limited engages in the manufacture, marketing, and distribution of fast-moving consumer goods primarily in South Africa. The company offers baby care products under the Purity brand; bakeries under the Albany and Tinkies brands; and culinary fruit veg products under the Crosse & Blackwell, Benny, All Gold, Spray and Cook, Ice Cap, KOO, Colman's, Black Cat, Mrs H.S. Ball's Chutney, and Hugo's brands. It also provides home care products under the Airoma, Bio Classic, Bio Crystal, Doom, Jeyes, and Peaceful Sleep brands; milling products under the Golden Cloud and Ace brands; rice pasta under the Fatti's and Moni's, Cresta, Tastic, and Aunt Caroline brands; and superfoods under the Ace, Jungle, King Korn, and Morvite brands. In addition, the company provides personal care products under the Dolly Varden, Kair, gill, Lemon Lite, No Hair, Perfect Touch, Protein Feed, Status, and Ingram's brands; and snacks, treats, and beverages under the Beacon, Maynards, Hall's, Sparkles, All Sorts, Oros, Jelly Tots, Toff-O-Luxe, Fizz Pop, Smoothies, Rose's, and Energade brands. Further, it provides out of home solutions and product offerings in various pack formats to franchised restaurant groups, hotel groups, catering groups, airlines, institutions, independent restaurants and coffee shops, independent hotels, game reserves, lodges, and bed and breakfast establishments; and product solutions for the establishment cleaning, pest control, and room air refreshing. The company also exports its products to approximately 25 countries in Africa. Tiger Brands Limited was founded in 1920 and is headquartered in Bryanston, South Africa.",
    "website": "http://www.tigerbrands.com",
    "zipcode": "2196"
  }
}
