{"ADH.JO": {"short_name": "ADvTECH Ltd", "long_name": "ADvTECH Limited", "summary": "ADvTECH Limited provides education, training, and staff placement services in South Africa and internationally. It operates through three divisions: Schools, Tertiary, and Resourcing. The Schools division provides pre-primary, primary, and secondary education services. The Tertiary division offers education in diploma, degree, and postgraduate levels through face-to-face and distance learning. The Resourcing division provides staffing solutions in the areas of network engineering, accounting and finance, payroll and compliance, mining, oil and gas, banking, engineering, IT, supply chain, and freight. The company was founded 1978 and is based in Sandton, South Africa.", "currency": "ZAc", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Sandton"}, "COH.JO": {"short_name": "Curro Holdings Limited", "long_name": "Curro Holdings Limited", "summary": "Curro Holdings Limited develops, acquires, and manages independent schools in South Africa, Namibia, and Botswana. The company operates through Curro, Meridian, and Stadio segments. It operates nursery, primary, and high schools offering balanced academics, sports, and culture. The company also operates Curro Academy and Meridian schools, which accommodate learners from age 5 to grade 12; Curro Castle nursery schools; Curro schools that accommodate learners from age 3 to grade 12; and Curro Select schools that accommodate learners from age of 3 months to grade 12. In addition, it focuses on tertiary education. The company operates 68 campuses with approximately 57,000 learners. The company was founded in 1998 and is headquartered in Durbanville, South Africa. Curro Holdings Limited is a subsidiary of PSG Financial Services Ltd.", "currency": "ZAc", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Durbanville"}, "SDO.JO": {"short_name": "Stadio Holdings Limited", "long_name": "Stadio Holdings Limited", "summary": "Stadio Holdings Limited acquires, invests in, and develops higher education institutions in South Africa. It offers undergraduate programs, including higher certificates, diplomas, and degrees; and post-graduate programs comprising honors and masters degrees, and doctorate. The company provides teacher education for pre-school and primary school teachers; qualifications in fashion design, media, and retail; postgraduate accounting education services; higher certificates and master degrees principally focused on the film, television, and live performance industry; and education qualifications for management, commerce, banking, financial planning and insurance, and public management; and higher education through distance learning focused on the leadership in management, business and commerce, and law and policing. As of December 31, 2019, it had enrolled 31,869 students; owned 6 registered higher education institutions; and has 93 accredited qualifications and 28 qualifications in the process of development/accreditation. The company was incorporated in 2016 and is based in Cape Town, South Africa. Stadio Holdings Limited is a subsidiary of PSG Alpha Investments Proprietary Limited.", "currency": "ZAc", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Cape Town"}}