{"CKS.JO": {"short_name": "Crookes Brothers Ltd", "long_name": "Crookes Brothers Limited", "summary": "Crookes Brothers Limited, together with its subsidiaries, produces agricultural products. The company offers sugar cane, bananas, deciduous fruits, and macadamias. It is also involved in the development and sale of commercial, residential, and industrial real estate properties. In addition, the company engages in the sale of grains and nursery plants, and rental of leased buildings, as well as tourism business. It has operations in the KwaZulu-Natal, Mpumalanga, and Western Cape provinces of South Africa, as well as in Swaziland, Zambia, and Mozambique. The company was founded in 1860 and is headquartered in Mount Edgecombe, South Africa.", "currency": "ZAc", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Mount Edgecombe"}, "KAL.JO": {"short_name": "Kaap Agri Limited", "long_name": "Kaap Agri Limited", "summary": "Kaap Agri Limited trades in agricultural, fuel, and related retail markets in South Africa and Namibia. It operates through Trade, Retail Fuel & Convenience, Grain Services, and Manufacturing segments. The Trade segment offers production inputs, mechanization equipment and services, and other goods to agricultural producers, as well as the general public. The Retail Fuel & Convenience segment provides a retail fuel offering to a range of customers, including convenience store and quick service restaurant outlets. The Grain Services segment sells grain products; and provides a range of services, including storage and handling of grain products. The Manufacturing segment manufactures and sells dripper pipes and other irrigation equipment; food grade plastic bulk bins for the agricultural market; and distributes other irrigation parts. It operates under the Agrimark, Liquormark, Pakmark, Kaap Agri, Wesgraan, Expressmark, the Fuel Company, and Tego brands. Kaap Agri Limited was founded in 1912 and is based in Paarl, South Africa.", "currency": "ZAc", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Paarl"}, "QFH.JO": {"short_name": "Quantum Foods Hldgs Ltd", "long_name": "Quantum Foods Holdings Ltd", "summary": "Quantum Foods Holdings Ltd engages in the feed and poultry business in South African and rest of African markets. The company operates through Eggs, Farming, and Animal Feeds segments. It produces and distributes eggs; and sells layer parent stock, hatching eggs, day-old pullets, and point-of-lay hens under the Bergvlei Chicks brand. The company also supplies livestock to abattoirs; produces day-old commercial broiler chicks from hatcheries; and produces and sells various feeds, including broiler, layer, dairy, sheep, cattle, ostrich, and pig feeds under the Nova Feeds brand. In addition, it sells its products under the Bellevue Chicks, Safe Eggs, Nulaid, Quantum, Mega Eggs, and Galovos brand names. The company was incorporated in 2013 and is headquartered in Wellington, South Africa.", "currency": "ZAc", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "JNB", "market": "za_market", "country": "South Africa", "city": "Wellington"}}