{"HWG.L": {"short_name": "HARWORTH GROUP PLC ORD 10P", "long_name": "Harworth Group plc", "summary": "Harworth Group plc operates as a brownfield land developer and property regeneration company in the North of England and the Midlands. The company operates in two segments, Income Generation and Capital Growth. The Income Generation segment focuses on generating rental returns from the business space portfolio; rental returns and royalties from energy generation, environmental technologies, and the agricultural portfolio; and income generating streams from recycled aggregates and secondary coal products. The Capital Growth segment develops a portfolio of properties, including planning and development activity, value engineering, proactive asset management, and strategic land acquisitions. Its portfolio includes properties at varying stages of completion across various sectors, including mixed-use, industrial, and retail, as well as residential properties. The company was formerly known as Coalfield Resources plc and changed its name to Harworth Group plc in March 2015. Harworth Group plc was incorporated in 1991 and is headquartered in Rotherham, the United Kingdom.", "currency": "GBp", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Rotherham"}, "INL.L": {"short_name": "INLAND HOMES PLC ORD 10P", "long_name": "Inland Homes plc", "summary": "Inland Homes plc operates as a real estate development company in the United Kingdom. It develops brownfield sites for residential and mixed use projects. The company is also involved in the provision of finance; construction of homes; letting or operating of real estate properties. It holds a land portfolio of 7,796 plots in the south and south-east of England, 2,170 residential plots spread across 405 acres as well as has 892 homes under construction. The company was formerly known as Inland PLC and changed its name to Inland Homes plc in November 2011. Inland Homes plc was founded in 2005 and is headquartered in Beaconsfield, the United Kingdom.", "currency": "GBp", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Beaconsfield"}, "INLZ.L": {"short_name": "INLAND ZDP PLC ZDP 10P", "long_name": "Inland ZDP Plc", "summary": "Inland ZDP Plc issues zero dividend preference shares (ZDP). It lends the proceeds received from all the ZDP share issues to Inland Homes 2013 Limited. The company was incorporated in 2012 and is based in Beaconsfield, the United Kingdom. Inland ZDP Plc is a subsidiary of Inland Homes 2013 Limited.", "currency": "GBp", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Beaconsfield"}, "OHG.L": {"short_name": "ONE HERITAGE GROUP PLC ORD 1P", "long_name": "One Heritage Group PLC", "summary": "One Heritage Group PLC operates as a property development and investment management company that focuses on the residential sectors primarily in the North West rental market. The company undertakes the development and re-development of new and existing buildings to create self-contained residential apartments; and refurbishment of existing residential properties to create co-living accommodation. It also provides letting, and property and facilities management, as well as residential letting and ancillary property services. The company was incorporated in 2020 and is based in Manchester, the United Kingdom.", "currency": "GBp", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Manchester"}, "PRDL": {"short_name": "PROFITABLE DEVS IN", "long_name": "Profitable Developments, Inc.", "summary": "Profitable Developments, Inc. operates as a property development company. It is involved in the acquisition of financially distressed properties; the short and long term rental of properties; and the development of commercial property upon land, which was sold due to financial distress. The company was formerly known as Stratton Holdings, Inc. and changed its name to Profitable Developments, Inc. in December 2012. Profitable Developments, Inc. was founded in 1998 and is headquartered in Market Bosworth, the United Kingdom.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Market Bosworth"}, "SMP.L": {"short_name": "ST.MODWEN PROPERTIES PLC ORD 10", "long_name": "St. Modwen Properties PLC", "summary": "St. Modwen Properties PLC invests in, develops, operates, and manages residential and commercial properties in the United Kingdom. It operates through Industrial & Logistics; St. Modwen Homes; and Strategic Land & Regeneration segments. The company is also involved in industrial and logistics; housebuilding; and strategic land and regeneration project activities. St. Modwen Properties PLC was founded in 1986 and is headquartered in Birmingham, the United Kingdom.", "currency": "GBp", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Birmingham"}, "TRAF.L": {"short_name": "TRAFALGAR PROPERTY GROUP PLC OR", "long_name": "Trafalgar Property Group plc", "summary": "Trafalgar Property Group plc, through its subsidiaries, engages in home building and property development businesses in the United Kingdom. The company undertakes residential property and assisted living projects. It is also involved in renting of residential property. The company was formerly known as Trafalgar New Homes Plc and changed its name to Trafalgar Property Group plc in March 2018. Trafalgar Property Group plc was incorporated in 2001 and is based in Edenbridge, the United Kingdom.", "currency": "GBp", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Edenbridge"}, "UK6A.F": {"short_name": "HARWORTH GROUP PLC LS-,10", "long_name": "Harworth Group plc", "summary": "Harworth Group plc operates as a brownfield land developer and property regeneration company in the North of England and the Midlands. The company operates in two segments, Income Generation and Capital Growth. The Income Generation segment focuses on generating rental returns from the business space portfolio; rental returns and royalties from energy generation, environmental technologies, and the agricultural portfolio; and income generating streams from recycled aggregates and secondary coal products. The Capital Growth segment develops a portfolio of properties, including planning and development activity, value engineering, proactive asset management, and strategic land acquisitions. Its portfolio includes properties at varying stages of completion across various sectors, including mixed-use, industrial, and retail, as well as residential properties. The company was formerly known as Coalfield Resources plc and changed its name to Harworth Group plc in March 2015. Harworth Group plc was incorporated in 1991 and is headquartered in Rotherham, the United Kingdom.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Rotherham"}}