{
    "BOOT.L": {
        "short_name": "BOOT (HENRY) PLC ORD 10P",
        "long_name": "Henry Boot PLC",
        "summary": "Henry Boot PLC engages in the property investment and development activities in the United Kingdom. It operates through three segments: Property Investment and Development, Land Promotion, and Construction. The company develops commercial properties and family homes. It is also involved in acquiring, promoting, developing, and trading in land. In addition, the company engages in the construction and civil engineering activities; hires and sells construction equipment; and operates and maintains A69 trunk road between Carlisle and Newcastle upon Tyne. As of December 31, 2020, it had land interests in 16,607 acres. Henry Boot PLC was founded in 1886 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Sheffield",
        "zipcode": "S11 9PD",
        "website": "http://www.henryboot.co.uk",
        "market_cap": 367662368
    },
    "CIC.L": {
        "short_name": "CONYGAR INVESTMENT COMPANY PLC ",
        "long_name": "The Conygar Investment Company PLC",
        "summary": "The Conygar Investment Company PLC (Â\u0093ConygarÂ\u0094) is an AIM quoted property investment and development group dealing primarily in UK property. The group aims to invest in property assets where we can add significant value using our property management, development and transaction structuring skills.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1W 6AN",
        "website": "http://www.conygar.com",
        "market_cap": 65409504
    },
    "DKE.L": {
        "short_name": "DUKEMOUNT CAPITAL PLC ORD GBP0.",
        "long_name": "Dukemount Capital Plc",
        "summary": "Dukemount Capital Plc, formerly known as Black Eagle Capital PLC, is a real estate investment firm. Previously, it operated  as a venture capital firm specializing in seed investments. Dukemount Capital Plc is based in London, United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1Y 6LX",
        "website": "http://dukemountcapitalplc.com",
        "market_cap": 1997328
    },
    "UAI.L": {
        "short_name": "U AND I GROUP PLC ORD 50P",
        "long_name": "U and I Group PLC",
        "summary": "U and I Group PLC, an investment holding company, develops, invests in, and trades real estate properties in the United Kingdom. The company operates through two divisions, Investment, and Development and Trading. Its property portfolio includes mixed-use regeneration projects, office buildings, residential and retail units, shopping centers, and commercial spaces. The company was formerly known as Development Securities PLC and changed its name to U and I Group PLC in October 2015. U and I Group PLC was incorporated in 1980 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SW1P 1DZ",
        "website": "http://www.uandiplc.com",
        "market_cap": 119160400
    },
    "WSP.L": {
        "short_name": "WYNNSTAY PROPERTIES PLC ORD 25P",
        "long_name": "Wynnstay Properties Plc",
        "summary": "Wynnstay Properties Plc engages in the investment, development, and management of properties in the United Kingdom. The company owns and manages office, retail, warehouse, and industrial properties in Southern England. Wynnstay Properties Plc was incorporated in 1886 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "WC1H 9BB",
        "website": "http://www.wynnstayproperties.co.uk",
        "market_cap": 17896692
    }
}