{
  "ESP.L": {
    "city": "London",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "REIT - Residential",
    "long_name": "Empiric Student Property plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "EMPIRIC STUDENT PROPERTY PLC OR",
    "state": null,
    "summary": "Empiric Student Property plc is a leading provider and operator of modern, predominantly direct-let, premium student accommodation located in high-demand university towns and cities across the UK. Investing in both operating and development assets, Empiric is a fully integrated operational student property business focused on premium studio-led accommodation managed through its Hello Student® operating platform, that is attractive to affluent growing student segments. The Company, an internally managed real estate investment trust (\"REIT\") incorporated in England and Wales, listed on the premium listing segment of the Official List of the Financial Conduct Authority and was admitted to trading on the main market for listed securities of the London Stock Exchange in June 2014.",
    "website": "http://www.empiric.co.uk",
    "zipcode": "W1C 1BQ"
  },
  "SGM.L": {
    "city": "Edinburgh",
    "country": "United Kingdom",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "REIT - Residential",
    "long_name": "Sigma Capital Group plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Real Estate",
    "short_name": "SIGMA CAPITAL GROUP PLC ORD 1P",
    "state": null,
    "summary": "Sigma Capital Group plc, together with its subsidiaries, focuses on the private rented sector in the United Kingdom. It also engages in the urban regeneration and property asset management activities. Sigma Capital Group plc has strategic relationship with Countryside Properties plc. The company was founded in 1996 and is headquartered in Edinburgh, the United Kingdom.",
    "website": "http://www.sigmacapital.co.uk",
    "zipcode": "EH2 4QG"
  }
}
