{"8033.HK": {"short_name": "VODATEL NETWORK", "long_name": "Vodatel Networks Holdings Limited", "summary": "Vodatel Networks Holdings Limited, an investment holding company, primarily engages in the design, sale, and implementation of network and systems infrastructure in Mainland China, Hong Kong, and Macau. It offers customer data automation, customization and integration, and technical support services; and IT and surveillance solutions for the public sectors, as well as the telecommunications, gaming, and hospitality sectors. The company engages in the research and development of software, and provision of related software consultancy services; and provision of wireless data communications and Internet related products and services. It offers computer software, hardware, and system integration services; cyber security, cloud security, and Internet of Things security solutions; cloud data center automation solutions; multi-cloud solutions for smart city; comprehensive enterprise solutions; and network management systems. The company sells data networking systems and provides related engineering services; and provides warehouse services. Vodatel Networks Holdings Limited is headquartered in Taipa, Macau.", "currency": "HKD", "sector": "Technology", "industry": "Information Technology Services", "exchange": "HKG", "market": "hk_market", "country": "Macau", "city": "Taipa"}, "DSWL": {"short_name": "Deswell Industries, Inc.", "long_name": "Deswell Industries, Inc.", "summary": "Deswell Industries, Inc. manufactures and sells injection-molded plastic parts and components, electronic products and subassemblies, and metallic molds and accessory parts for original equipment manufacturers and contract manufacturers. It operates in two segments, Plastic Injection Molding and Electronic Products Assembling. The company produces a range of plastic parts and components that are used in the manufacture of consumer and industrial products, which include plastic components for electronic entertainment products, power tools, accessories, and outdoor equipment; cases for flashlights, telephones, paging machines, projectors, and alarm clocks; toner cartridges and cases for photocopy and printer machines; and parts for electrical products, such as air-conditioning and ventilators, as well as parts for audio equipment, and cases and key tops for personal organizers and remote controls; double injection caps and baby products; parts for medical products comprising apparatus for blood tests; laser key caps; and automobile components. It also provides electronic products that consist of audio equipment, including digital and analogue mixing consoles, amplifiers, signal processors, audio interfaces, network audio equipment, and speaker enclosures; consumer audio products, such as multi-channel receivers-amplifiers, and wired and wireless audio streaming products; printed circuit board assemblies; and telecommunication products comprising VoIP keysets for business communications. The company sells its products primarily in China, the United States, the United Kingdom, Norway, Holland, Hong Kong, and Canada. Deswell Industries, Inc. was founded in 1987 and is based in Macau.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "Macau", "city": "Macau"}, "DW2.F": {"short_name": "DESWELL INDS INC.  DL-,01", "long_name": "Deswell Industries, Inc.", "summary": "Deswell Industries, Inc. manufactures and sells injection-molded plastic parts and components, electronic products and subassemblies, and metallic molds and accessory parts for original equipment manufacturers and contract manufacturers. It operates in two segments, Plastic Injection Molding and Electronic Products Assembling. The company produces a range of plastic parts and components that are used in the manufacture of consumer and industrial products, which include plastic components for electronic entertainment products, power tools, accessories, and outdoor equipment; cases for flashlights, telephones, paging machines, projectors, and alarm clocks; toner cartridges and cases for photocopy and printer machines; and parts for electrical products, such as air-conditioning and ventilators, as well as parts for audio equipment, and cases and key tops for personal organizers and remote controls; double injection caps and baby products; parts for medical products comprising apparatus for blood tests; laser key caps; and automobile components. It also provides electronic products that consist of audio equipment, including digital and analogue mixing consoles, amplifiers, signal processors, audio interfaces, network audio equipment, and speaker enclosures; consumer audio products, such as multi-channel receivers-amplifiers, and wired and wireless audio streaming products; printed circuit board assemblies; and telecommunication products comprising VoIP keysets for business communications. The company sells its products primarily in China, the United States, the United Kingdom, Norway, Holland, Hong Kong, and Canada. Deswell Industries, Inc. was founded in 1987 and is based in Macau.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Macau", "city": "Macau"}}