{
    "697.F": {
        "short_name": "ZAKLAD.CHEMIC.POLICE ZY10",
        "long_name": "Grupa Azoty Zaklady Chemiczne Police S.A.",
        "summary": "Grupa Azoty Zaklady Chemiczne Police S.A. manufactures and sells mineral fertilizers in Poland, Germany, South America, rest of Europe, and internationally. It provides compound fertilizers, such as nitrogen, phosphorus, and potassium fertilizers under the POLIFOSKA and POLIDAP brand; nitrogen-based fertilizers; and phosphoric and sulfuric acids. The company also offers urea solutions to reduce nitrogen oxide emissions from diesel engines and used as a reducing agent in vehicle emissions control technologies under the NOXy and Pulnox name, as well as liquid ammonia. In addition, it provides pigments comprising titanium white products, including iron sulfate and hydrolytic acid under the TYTANPOL brand, which is used in production of paints and varnishes, printing inks, and plastics, as well as paper and laminates. Further, the company produces electricity, hot steam, and heating water, as well as fly ash. Additionally, it offers design services for construction, assembly, mechanical, electrical, automation and measurement, technological, and chemical industries; printing and binding services; logistics, transport, plant and equipment, and workshop services; and sea port operation, port construction, property management, research and development, sea and inland shipping, and coastal water transportation services. The company also engages in the provision of overhauls and services for mechanical and construction industries; project execution, technical, and engineering activities in automation and power engineering; repairing of instrumentation and control equipment, and power generation plant and equipment; and plant engineering in process control and visualization systems. In addition, the company is involved in wastewater disposal, waste storage, laboratory, property rental, and other activities. The company is based in Police, Poland. Grupa Azoty Zaklady Chemiczne Police S.A. is a subsidiary of Grupa Azoty S.A.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Police",
        "zipcode": "72-010",
        "website": "http://zchpolice.grupaazoty.com/en.html",
        "market_cap": "Small Cap"
    }
}