{
    "A1T.F": {
        "short_name": "AS TALLINNA VESI A EO 0,6",
        "long_name": "AS Tallinna Vesi",
        "summary": "AS Tallinna Vesi, a water utility company, collects, treats, and distributes water for private houses, apartment associations, and commercial customers in Estonia. It principally operates the Ã\u009clemiste water treatment and Paljassaare wastewater treatment plants. The company offers drinking water and wastewater disposal services to approximately 24,600 private customers and businesses, and 470,000 end consumers in Tallinn, as well as to various neighboring municipalities of Tallinn. Its public water supply system comprises approximately 1,200 kilometers of water pipes, 22 water pumping stations, 46 ground water pumping stations, and 92 boreholes; and public sewerage system consist of 1,185 kilometers of wastewater networks, 507 kilometers of storm water networks, and 177 sewage and storm water pumping stations. The company also offers owner supervision and project management services; design work; water and wastewater services; laboratory services; and transportation and road construction services, as well as undertakes pipe construction works. AS Tallinna Vesi was founded in 1967 and is headquartered in Tallinn, Estonia. As of March 31, 2021, AS Tallinna Vesi operates as a subsidiary of City of Tallinn.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10614",
        "website": "http://www.tallinnavesi.ee",
        "full_time_employees": 319
    },
    "ARC1T.TL": {
        "short_name": "Arco Vara",
        "long_name": "Arco Vara AS",
        "summary": "Arco Vara AS, together with its subsidiaries, engages in the real estate development and services related to real estate in Estonia, Latvia, and Bulgaria. It is involved in the development, construction, and sale of residential and non-residential buildings; rental and operation of own or leased real estate properties; and management of real estate properties. Arco Vara AS was founded in 1992 and is based in Tallinn, Estonia. As of February 12, 2021, Arco Vara AS operates as a subsidiary of OÃ\u009c Alarmo Kapital.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10145",
        "website": "http://www.arcovara.com/et/",
        "full_time_employees": 11
    },
    "ASU.F": {
        "short_name": "AS LHV GROUP  EO 1",
        "long_name": "AS LHV Group",
        "summary": "AS LHV Group, through its subsidiaries, provides banking, security brokerage, financial advisory, finance lease, and other lending services to private and business clients in Estonia. It operates through three segments: Retail Banking, Financial Intermediates, and Corporate Banking segments. The company offers demand and fixed-term deposits; pension investment and securities accounts; home and private, consumer, car, home repair, furnishing, health and beauty, student, micro, working capital, investment, margin, and apartment association loans; and overdrafts, leasing, hire-purchase, guarantees, letters of credit, documentary collection, and factoring services, as well as financing the acquisition of a company. It also provides settlement, institutional brokerage, pension, investment fund, and payment and investment services; banking cards; and investment advice, as well as mobile banking and ATM services. The company was founded in 1999 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10145",
        "website": "http://www.lhv.ee",
        "full_time_employees": 518
    },
    "AV1.F": {
        "short_name": "ARCO VARA AS  EO 0,70",
        "long_name": "Arco Vara AS",
        "summary": "Arco Vara AS, together with its subsidiaries, engages in the real estate development and services related to real estate in Estonia, Latvia, and Bulgaria. It is involved in the development, construction, and sale of residential and non-residential buildings; rental and operation of own or leased real estate properties; and management of real estate properties. Arco Vara AS was founded in 1992 and is based in Tallinn, Estonia. As of February 12, 2021, Arco Vara AS operates as a subsidiary of OÃ\u009c Alarmo Kapital.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10145",
        "website": "http://www.arcovara.com/et/",
        "full_time_employees": 11
    },
    "BLT1T.TL": {
        "short_name": "Baltika",
        "long_name": "AS Baltika",
        "summary": "AS Baltika, together with its subsidiaries, operates as a fashion retailer. It operates through Retail, E-commerce, and All Other segments. The company engages in the design, development, production, and sales arrangement of the fashion brands of clothing; and the provision of materials and sewing services. It develops and operates fashion brands, including Monton, Baltman, and Ivo Nikkolo. The company sells its products through retail and e-commerce channel, and other sales channels, including wholesale, franchise, and consignation. As of December 31, 2020, it had 61 Baltika's retail-stores in Estonia, Latvia, Lithuania, and Finland. AS Baltika was founded in 1928 and is headquartered in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11415",
        "website": "http://www.baltikagroup.com",
        "full_time_employees": 247
    },
    "CPA1T.TL": {
        "short_name": "Coop Pank",
        "long_name": "Coop Pank AS",
        "summary": "Coop Pank AS, together with its subsidiaries, provides banking and financing solutions to private and business clients in Estonia. It operates through Corporate Banking, Retail Banking, Consumer Financing, Leasing, and Other segments. The company provides banking plans; saving accounts and deposits; small, car, home renovation, travel, home, refinancing, mortgage, working capital, investment, seasonal work, and apartment association loans; and payment, overdraft, guarantee, settlement, factoring, and leasing services, as well as debit and credit cards. It also provides Internet and mobile banking services; and real estate management services, as well as motor, comprehensive, travel, and home insurance; and small and medium business property, construction machinery, and other equipment insurance services. The company was formerly known as AS Eesti Krediidipank. Coop Pank AS was incorporated in 1992 and is based in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "15014",
        "website": "http://www.cooppank.ee",
        "full_time_employees": 289
    },
    "DYC.F": {
        "short_name": "AS EKSPRESS GRUPP EO 0,60",
        "long_name": "AS Ekspress Grupp",
        "summary": "AS Ekspress Grupp provides digital content and advertising solutions. It operates through two segments, Media and Printing Services. The Media segment is involved in managing online news and classified portals; selling advertising banners, and other advertising space and products through its own portals; selling advertising space in newspapers and magazines; and publishing newspapers, magazines, customer, books, and advertising fliers, as well as sale of digital outdoor advertising. This segment also operates electronic ticket sales platform, and ticket sales sites, as well as production studio for content creation.The Printing Services segment offers printing and related services. This segment engages in the printing of magazines, newspapers, advertising materials, product and service catalogues, yearbooks, paperback books, and other publications. It operates in the Estonia, Scandinavia, Lithuania, Latvia, rest of Europe, and internationally. The company was founded in 1989 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10151",
        "website": "http://www.egrupp.ee",
        "full_time_employees": 1590
    },
    "EEG1T.TL": {
        "short_name": "Ekspress Grupp",
        "long_name": "AS Ekspress Grupp",
        "summary": "AS Ekspress Grupp provides digital content and advertising solutions. It operates through two segments, Media and Printing Services. The Media segment is involved in managing online news and classified portals; selling advertising banners, and other advertising space and products through its own portals; selling advertising space in newspapers and magazines; and publishing newspapers, magazines, customer, books, and advertising fliers, as well as sale of digital outdoor advertising. This segment also operates electronic ticket sales platform, and ticket sales sites, as well as production studio for content creation.The Printing Services segment offers printing and related services. This segment engages in the printing of magazines, newspapers, advertising materials, product and service catalogues, yearbooks, paperback books, and other publications. It operates in the Estonia, Scandinavia, Lithuania, Latvia, rest of Europe, and internationally. The company was founded in 1989 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10151",
        "website": "http://www.egrupp.ee",
        "full_time_employees": 1590
    },
    "EFT1T.TL": {
        "short_name": "EfTEN Real Estate Fund III shar",
        "long_name": "EfTEN Real Estate Fund III AS",
        "summary": "EfTEN Real Estate Fund III AS specializes in real estate investments. The fund seeks to invest in large-scale commercial real estate projects. The fund term is of 10 years, divided into three years of investments and seven years for holding and exit.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "full_time_employees": null
    },
    "FQE.F": {
        "short_name": "SILVANO FASHION GR.EO 0,1",
        "long_name": "AS Silvano Fashion Group",
        "summary": "AS Silvano Fashion Group designs, manufactures, distributes, and retails women's lingerie. The company sells its lingerie, beachwear, and underwear products under the Milavitsa, Lauma Lingerie, Alisee, Aveline, Laumelle, and Hidalgo brands through wholesale channel and franchised sales, as well as through Milavitsa and Lauma Lingerie retail stores. It also offers logistics services. As of December 31, 2019, the company had 666 branded stores, including 628 Milavitsa and 38 Lauma Lingerie stores, which include 556 franchise and 86 Group 110 operated retail stores in Russia, Belarus, Ukraine, the Baltics, and internationally. AS Silvano Fashion Group was founded in 1908 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10613",
        "website": "http://www.silvanofashion.com",
        "full_time_employees": 1744
    },
    "HAE1T.TL": {
        "short_name": "Harju Elekter",
        "long_name": "AS Harju Elekter",
        "summary": "AS Harju Elekter develops, produces, and sells electric and automation solutions in Estonia, Finland, Sweden, Lithuania, and internationally. It operates through three segments: Production, Real estate, Other Activities. The company manufactures and sells electricity distribution and control equipment; electrical equipment for the electricity distribution, industrial, and construction sectors; sheet metal products and solutions for the power energy and electronics sectors; multidrive, MCC, and electricity distribution systems for engineering applications; industrial automation devices and substations; medium- and low-voltage electric power generation and distribution equipment; and electricity switching and conversion equipment, as well as automatic and control boards. It also offers technical buildings for the infrastructure, construction, and renewable energy sectors; and electrical installation services for shipbuilding. In addition, the company provides industrial property development, maintenance and leasing, and intermediation services; management services; and project management services for installation works. Further, it operates stores in Tallinn and Tartu, which sell products for electrical installation work to retail customers, and small and medium sized electrical installation companies; and sells electrical materials and equipment. The company serves electricity distribution network, infrastructure, industrial, and maritime companies. AS Harju Elekter was founded in 1968 and is headquartered in Keila, Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Keila",
        "zipcode": "76606",
        "website": "http://www.harjuelekter.com",
        "full_time_employees": 793
    },
    "HD8.F": {
        "short_name": "AS HARJU ELEKTER  EO 0,63",
        "long_name": "AS Harju Elekter",
        "summary": "AS Harju Elekter develops, produces, and sells electric and automation solutions in Estonia, Finland, Sweden, Lithuania, and internationally. It operates through three segments: Production, Real estate, Other Activities. The company manufactures and sells electricity distribution and control equipment; electrical equipment for the electricity distribution, industrial, and construction sectors; sheet metal products and solutions for the power energy and electronics sectors; multidrive, MCC, and electricity distribution systems for engineering applications; industrial automation devices and substations; medium- and low-voltage electric power generation and distribution equipment; and electricity switching and conversion equipment, as well as automatic and control boards. It also offers technical buildings for the infrastructure, construction, and renewable energy sectors; and electrical installation services for shipbuilding. In addition, the company provides industrial property development, maintenance and leasing, and intermediation services; management services; and project management services for installation works. Further, it operates stores in Tallinn and Tartu, which sell products for electrical installation work to retail customers, and small and medium sized electrical installation companies; and sells electrical materials and equipment. The company serves electricity distribution network, infrastructure, industrial, and maritime companies. AS Harju Elekter was founded in 1968 and is headquartered in Keila, Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Keila",
        "zipcode": "76606",
        "website": "http://www.harjuelekter.com",
        "full_time_employees": 793
    },
    "LHV1T.TL": {
        "short_name": "LHV Group",
        "long_name": "AS LHV Group",
        "summary": "AS LHV Group, through its subsidiaries, provides banking, security brokerage, financial advisory, finance lease, and other lending services to private and business clients in Estonia. It operates through three segments: Retail Banking, Financial Intermediates, and Corporate Banking segments. The company offers demand and fixed-term deposits; pension investment and securities accounts; home and private, consumer, car, home repair, furnishing, health and beauty, student, micro, working capital, investment, margin, and apartment association loans; and overdrafts, leasing, hire-purchase, guarantees, letters of credit, documentary collection, and factoring services, as well as financing the acquisition of a company. It also provides settlement, institutional brokerage, pension, investment fund, and payment and investment services; banking cards; and investment advice, as well as mobile banking and ATM services. The company was founded in 1999 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10145",
        "website": "http://www.lhv.ee",
        "full_time_employees": 518
    },
    "MKS.F": {
        "short_name": "MERKO EHITUS (ASUT.) O.N.",
        "long_name": "AS Merko Ehitus",
        "summary": "AS Merko Ehitus, through its subsidiaries, engages in the construction and real estate development activities in the Republic of Estonia, Latvia, Lithuania, Norway, and Finland. It operates through Construction Service and Real Estate Development segments. The company constructs various buildings, including commercial and office buildings, retail and entertainment centers, hotels, and spas, as well as public buildings, dwellings, and specific industrial buildings. It also designs and constructs various infrastructure facilities, such as port, waste handling, and road infrastructure, including bridges, tunnels, overpasses, and roads; environment protection facilities; drinking water and waste water treatment facilities; water and sewerage mains; and other engineering and technical sites. In addition, the company provides electrical construction services comprising medium and high voltage substation, and cable line engineering configuration and construction; road maintenance and repair services; and machinery repair services. Further, it undertakes supervision of excavation works and condition of roads; and concrete works that include buildings and infrastructure constructed of prefabricated or concrete panels. Additionally, the company develops apartment projects, long-term real estate investments, and real estate projects for business purposes; and maintains and leases real estate properties. The company was founded in 1990 and is based in Tallinn, the Republic of Estonia. AS Merko Ehitus is a subsidiary of AS Riverito.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11314",
        "website": "http://group.merko.ee",
        "full_time_employees": 592
    },
    "MRK1T.TL": {
        "short_name": "Merko Ehitus",
        "long_name": "AS Merko Ehitus",
        "summary": "AS Merko Ehitus, through its subsidiaries, engages in the construction and real estate development activities in the Republic of Estonia, Latvia, Lithuania, Norway, and Finland. It operates through Construction Service and Real Estate Development segments. The company constructs various buildings, including commercial and office buildings, retail and entertainment centers, hotels, and spas, as well as public buildings, dwellings, and specific industrial buildings. It also designs and constructs various infrastructure facilities, such as port, waste handling, and road infrastructure, including bridges, tunnels, overpasses, and roads; environment protection facilities; drinking water and waste water treatment facilities; water and sewerage mains; and other engineering and technical sites. In addition, the company provides electrical construction services comprising medium and high voltage substation, and cable line engineering configuration and construction; road maintenance and repair services; and machinery repair services. Further, it undertakes supervision of excavation works and condition of roads; and concrete works that include buildings and infrastructure constructed of prefabricated or concrete panels. Additionally, the company develops apartment projects, long-term real estate investments, and real estate projects for business purposes; and maintains and leases real estate properties. The company was founded in 1990 and is based in Tallinn, the Republic of Estonia. AS Merko Ehitus is a subsidiary of AS Riverito.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11314",
        "website": "http://group.merko.ee",
        "full_time_employees": 592
    },
    "NCN1T.TL": {
        "short_name": "Nordecon",
        "long_name": "Nordecon AS",
        "summary": "Nordecon AS operates as a construction company in Estonia, Sweden, Finland, and Ukraine. It is involved in the general contracting and project management of buildings and infrastructure construction. The company engages in building office and industrial buildings, warehouses, non-residential buildings, and apartment buildings, as well as various storage facilities and tanks for agricultural purposes; and the design and preparation of concrete works, including complete loadbearing structure and basement solutions, concrete floors, frameworks, roofs, and ceilings. It also provides general contracting and project management services in the field of civil engineering works, including road construction and maintenance, engineering and environmental construction, rental of building equipment, and production of road construction materials, as well as rents, sells, and maintains road construction and earthworks machines. In addition, the company engages in designing and building concrete works, including bridges, overpasses, viaducts, tunnels, basements, and reinforced concrete frameworks for buildings, as well as railway base structures and erections; and building ports, berths, breakwaters, and bank protections, as well as in the construction of utility, water, and other civil engineering projects. Further, it is involved in traffic management operations; geodetic surveys; and coordination and development of the work of the construction material quarries. The company was formerly known as Nordecon International AS and changed its name to Nordecon AS in January 2011. Nordecon AS was founded in 1989 and is based in Tallinn, Estonia. Nordecon AS is a subsidiary of AS Nordic Contractors.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10133",
        "website": "http://www.nordecon.com",
        "full_time_employees": 708
    },
    "PKG1T.TL": {
        "short_name": "Pro Kapital Grupp",
        "long_name": "AS Pro Kapital Grupp",
        "summary": "AS Pro Kapital Grupp, a real estate development company, develops, manages, purchases, and sells large-scale commercial and residential real estate properties in Estonia, Latvia, and Lithuania. The company develops and sells apartments in residential real estate properties; develops and leases retail and office premises, as well as develops shopping and entertainment centers in Tallinn; and provides maintenance and other services. It also operates a hotel in Germany. AS Pro Kapital Grupp was founded in 1994 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11316",
        "website": "http://www.prokapital.com",
        "full_time_employees": 84
    },
    "PRF1T.TL": {
        "short_name": "PRFoods",
        "long_name": "AS PRFoods",
        "summary": "AS PRFoods, together with its subsidiaries, engages in farming, producing, processing, and selling fish and fish products primarily in Finland, Sweden, Estonia, and the United Kingdom. Its principal products are salmon and rainbow trout. The company offers its products primarily under the John Ross Jr (Aberdeen) and Coln Valley Smokery brands, as well as Heimon Gourmet, Saaristomeren, and Fishk trademarks. The company was formerly known as AS Premia Foods and changed its name to AS PRFoods in November 2014. AS PRFoods was founded in 2008 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "11314",
        "website": "http://www.prfoods.ee",
        "full_time_employees": 287
    },
    "SFG1T.TL": {
        "short_name": "Silvano Fashion Group",
        "long_name": "AS Silvano Fashion Group",
        "summary": "AS Silvano Fashion Group designs, manufactures, distributes, and retails women's lingerie. The company sells its lingerie, beachwear, and underwear products under the Milavitsa, Lauma Lingerie, Alisee, Aveline, Laumelle, and Hidalgo brands through wholesale channel and franchised sales, as well as through Milavitsa and Lauma Lingerie retail stores. It also offers logistics services. As of December 31, 2019, the company had 666 branded stores, including 628 Milavitsa and 38 Lauma Lingerie stores, which include 556 franchise and 86 Group 110 operated retail stores in Russia, Belarus, Ukraine, the Baltics, and internationally. AS Silvano Fashion Group was founded in 1908 and is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10613",
        "website": "http://www.silvanofashion.com",
        "full_time_employees": 1744
    },
    "SKN1T.TL": {
        "short_name": "Nordic Fibreboard",
        "long_name": "Nordic Fibreboard AS",
        "summary": "Nordic Fibreboard AS, a timber processing company, produces and sells fiberboard products. The company operates through Fibreboard Manufacturing and Sale, Furniture Retail Sale, and Real Estate Management segments. It offers insulation boards, wind barrier boards, roof boards, and underlays under the ISOPLAAT trademark, as well as interior panels, including ceiling and wall panels under the Isotex name for construction and renovation of buildings; and industrial boards. The company is also involved in the operation a chain of furniture stores in Latvia and Lithuania; and rental and property development business. It markets its products in the Nordic countries, Russia, and the Baltics. The company was formerly known as Skano Group AS and changed its name to Nordic Fibreboard AS in December 2019. Nordic Fibreboard AS is headquartered in PÃ¤rnu, Estonia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "PÃ¤rnu",
        "zipcode": "80042",
        "website": "http://www.nordicfibreboard.com",
        "full_time_employees": 97
    },
    "T5N.F": {
        "short_name": "AS TALLINK GRUPP  O.N.",
        "long_name": "AS Tallink Grupp",
        "summary": "AS Tallink Grupp, together with its subsidiaries, provides marine passenger and cargo transportation services in the Baltic Sea. The company operates through Estonia-Finland Routes, Estonia-Sweden Routes, Latvia-Sweden Route, Finland-Sweden Routes, and Other segments. It offers mini-cruise and passenger transportation, and ro-ro cargo services, as well as travel packages. The company provides its services on various routes under the Tallink and Silja Line brands. AS Tallink Grupp operates a fleet of 15 vessels that include cruise ferries, high-speed ro-pax ferries, and ro-ro cargo vessels. The company also operates three hotels in Tallinn and one hotel in Riga. In addition, the company sells beauty products; and offers stevedoring, vehicles leasing, catering, technical ship management and crewing, and process agent services, as well as provides entertainment on ships. AS Tallink Grupp was founded in 1989 and is based in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10111",
        "website": "http://www.tallink.com",
        "full_time_employees": 3953
    },
    "TAL1T.TL": {
        "short_name": "Tallink Grupp",
        "long_name": "AS Tallink Grupp",
        "summary": "AS Tallink Grupp, together with its subsidiaries, provides marine passenger and cargo transportation services in the Baltic Sea. The company operates through Estonia-Finland Routes, Estonia-Sweden Routes, Latvia-Sweden Route, Finland-Sweden Routes, and Other segments. It offers mini-cruise and passenger transportation, and ro-ro cargo services, as well as travel packages. The company provides its services on various routes under the Tallink and Silja Line brands. AS Tallink Grupp operates a fleet of 15 vessels that include cruise ferries, high-speed ro-pax ferries, and ro-ro cargo vessels. The company also operates three hotels in Tallinn and one hotel in Riga. In addition, the company sells beauty products; and offers stevedoring, vehicles leasing, catering, technical ship management and crewing, and process agent services, as well as provides entertainment on ships. AS Tallink Grupp was founded in 1989 and is based in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10111",
        "website": "http://www.tallink.com",
        "full_time_employees": 3953
    },
    "TKM1T.TL": {
        "short_name": "Tallinna Kaubamaja Grupp",
        "long_name": "Tallinna Kaubamaja Grupp AS",
        "summary": "Tallinna Kaubamaja Grupp AS, together with its subsidiaries, owns and operates supermarkets and department stores in Estonia. The company operates through Supermarkets, Department Stores, Car Trade, Footwear Trade, and Real Estate segments. It is involved in the beauty products trading, security services, car trading, and footwear trading activities; sale of fashion items, food products, home items, and beauty and children's products through its department stores; provision of takeaway food, salads, desserts, sandwiches, confectionery and baked products, and catering products under Selveri KÃ¶Ã¶k and Gurmee Catering brands for retail companies and other food industries, as well as catering and party organization services; and sale of catering products through an online store. The company also retails and wholesales beauty products and toiletries under I.L.U. brand in Tallinn, Tartu, and PÃ¤rnu; retails shoes under ABC King and Shu brands; retails and distributes KIA, OPEL, Cadillac, SAAB, Corvette, Hummer, and Peugeot vehicles; plans, installs, and maintains security equipment; and develops, administers, and rents/leases a shopping center, Selver stores, commercial premises, and business buildings. It operates through a network of 112 stores, which include 54 Selver stores, 9 Selver ABC stores, 7 Comarket stores, 2 Delice stores, the Solaris grocery store, and a cafÃ©, as well as e-Selver, the mobile store. The company was formerly known as Tallinna Kaubamaja AS and changed its name to Tallinna Kaubamaja Grupp AS in April 2015. The company was founded in 1960 and is based in Tallinn, Estonia. Tallinna Kaubamaja Grupp AS is a subsidiary of OÃ\u009c NG Investeeringud.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10143",
        "website": "http://www.tkmgroup.ee",
        "full_time_employees": 4900
    },
    "TPD1T.TL": {
        "short_name": "Trigon Property Development",
        "long_name": "AS Trigon Property Development",
        "summary": "AS Trigon Property Development operates as a real estate development company. It owns a real estate development project comprising 21 hectare area located in the City of PÃ¤rnu, Estonia, as well as rents land. The company was formerly known as AS Viisnurk and changed its name to AS Trigon Property Development in September 2007. AS Trigon Property Development is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10141",
        "website": "http://www.trigonproperty.com",
        "full_time_employees": null
    },
    "TSM1T.TL": {
        "short_name": "Tallinna Sadam",
        "long_name": "AS Tallinna Sadam",
        "summary": "AS Tallinna Sadam provides port services as a landlord type of port in the Republic of Estonia. The company operates through Passenger Harbours, Cargo Harbours, Ferry, and Other segments. It owns, administers, and develops berths, port basins, and the surrounding areas; ensures safe navigation in port waters; and organizes vessel traffic in port basins, as well as leases land to cargo operators. The company owns and operates the Old City Harbor, a passenger harbor and the Old City Marina for recreational vessels located in the center of Tallinn; the cargo harbor in Muuga; the cargo harbor in Paldiski; and the harbor in Saaremaa for receiving cruise ships, pleasure crafts, and cargo vessels. It also offers icebreaking and other offshore support services; and sells electricity and network services, as well as provides ferry services between Estonia's mainland and biggest islands. AS Tallinna Sadam was incorporated in 1996 and is headquartered in Tallinn, the Republic of Estonia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "15051",
        "website": "http://www.ts.ee",
        "full_time_employees": 481
    },
    "TVEAT.TL": {
        "short_name": "Tallinna Vesi",
        "long_name": "AS Tallinna Vesi",
        "summary": "AS Tallinna Vesi, a water utility company, collects, treats, and distributes water for private houses, apartment associations, and commercial customers in Estonia. It principally operates the Ã\u009clemiste water treatment and Paljassaare wastewater treatment plants. The company offers drinking water and wastewater disposal services to approximately 24,600 private customers and businesses, and 470,000 end consumers in Tallinn, as well as to various neighboring municipalities of Tallinn. Its public water supply system comprises approximately 1,200 kilometers of water pipes, 22 water pumping stations, 46 ground water pumping stations, and 92 boreholes; and public sewerage system consist of 1,185 kilometers of wastewater networks, 507 kilometers of storm water networks, and 177 sewage and storm water pumping stations. The company also offers owner supervision and project management services; design work; water and wastewater services; laboratory services; and transportation and road construction services, as well as undertakes pipe construction works. AS Tallinna Vesi was founded in 1967 and is headquartered in Tallinn, Estonia. As of March 31, 2021, AS Tallinna Vesi operates as a subsidiary of City of Tallinn.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "TAL",
        "market": "tl_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10614",
        "website": "http://www.tallinnavesi.ee",
        "full_time_employees": 319
    },
    "UE8.F": {
        "short_name": "TALLINNA KAUBAM.GP EO-,40",
        "long_name": "Tallinna Kaubamaja Grupp AS",
        "summary": "Tallinna Kaubamaja Grupp AS, together with its subsidiaries, owns and operates supermarkets and department stores in Estonia. The company operates through Supermarkets, Department Stores, Car Trade, Footwear Trade, and Real Estate segments. It is involved in the beauty products trading, security services, car trading, and footwear trading activities; sale of fashion items, food products, home items, and beauty and children's products through its department stores; provision of takeaway food, salads, desserts, sandwiches, confectionery and baked products, and catering products under Selveri KÃ¶Ã¶k and Gurmee Catering brands for retail companies and other food industries, as well as catering and party organization services; and sale of catering products through an online store. The company also retails and wholesales beauty products and toiletries under I.L.U. brand in Tallinn, Tartu, and PÃ¤rnu; retails shoes under ABC King and Shu brands; retails and distributes KIA, OPEL, Cadillac, SAAB, Corvette, Hummer, and Peugeot vehicles; plans, installs, and maintains security equipment; and develops, administers, and rents/leases a shopping center, Selver stores, commercial premises, and business buildings. It operates through a network of 112 stores, which include 54 Selver stores, 9 Selver ABC stores, 7 Comarket stores, 2 Delice stores, the Solaris grocery store, and a cafÃ©, as well as e-Selver, the mobile store. The company was formerly known as Tallinna Kaubamaja AS and changed its name to Tallinna Kaubamaja Grupp AS in April 2015. The company was founded in 1960 and is based in Tallinn, Estonia. Tallinna Kaubamaja Grupp AS is a subsidiary of OÃ\u009c NG Investeeringud.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10143",
        "website": "http://www.tkmgroup.ee",
        "full_time_employees": 4900
    },
    "UG4.SG": {
        "short_name": "AS Trigon Property DevelopmentR",
        "long_name": "AS Trigon Property Development",
        "summary": "AS Trigon Property Development operates as a real estate development company. It owns a real estate development project comprising 21 hectare area located in the City of PÃ¤rnu, Estonia, as well as rents land. The company was formerly known as AS Viisnurk and changed its name to AS Trigon Property Development in September 2007. AS Trigon Property Development is based in Tallinn, Estonia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Estonia",
        "state": null,
        "city": "Tallinn",
        "zipcode": "10141",
        "website": "http://www.trigonproperty.com",
        "full_time_employees": null
    }
}