{
  "000612.SZ": {
    "city": "Jiaozuo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "JiaoZuo WanFang Aluminum Manufacturing Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIAOZUO WANFANG AL",
    "state": null,
    "summary": "JiaoZuo WanFang Aluminum Manufacturing Co., Ltd engages in the smelting and processing of aluminum products in China. The company primarily provides electrolytic aluminum products. It is also involved in the generation and distribution of thermal power; distribution of non-ferrous metals; and production and distribution of coal. The company is based in Jiaozuo, China.",
    "website": "http://www.jzwfly.com.cn",
    "zipcode": "454172"
  },
  "000807.SZ": {
    "city": "Kunming",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Yunnan Aluminium Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "YUNNAN ALUMINIUM",
    "state": null,
    "summary": "Yunnan Aluminium Co., Ltd. manufactures and sells aluminum and carbon products in China. Its products include aluminum foils and strips, electrical round aluminum poles, cast aluminum alloys, aluminum ingots, aluminum carbon products, and alumina. The company was formerly known as Yunnan Aluminum Plant. Yunnan Aluminium Co., Ltd. was founded in 1970 and is headquartered in Kunming, China.",
    "website": "http://www.ylgf.com",
    "zipcode": "650502"
  },
  "002082.SZ": {
    "city": "Huzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Wanbangde Pharmaceutical Holding Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "WANBANGDE PHARMACE",
    "state": null,
    "summary": "Wanbangde Pharmaceutical Holding Group Co., Ltd., an aluminum company, produces and sells aluminum profiles, aluminum decorative sheets, PS aluminum plates, aluminum alloy templates, sliding doors, etc. in China. It also sells its products in Europe, the United States, the Middle East, Africa Southeastern Asia, etc. The company was formerly known as Wanbangde New Building Materials Co., Ltd. and changed its name to Wanbangde Pharmaceutical Holding Group Co., Ltd. in April 2020. Wanbangde Pharmaceutical Holding Group Co., Ltd. was founded in 1985 and is based in Huzhou, China.",
    "website": "http://www.wepon.com.cn",
    "zipcode": "313008"
  },
  "002101.SZ": {
    "city": "Zhaoqing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Guangdong Hongtu Technology (Holdings) Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG HONGTU T",
    "state": null,
    "summary": "Guangdong Hongtu Technology (Holdings) Co., Ltd., together with its subsidiaries, manufactures and sells precision aluminum alloy die-casting parts in China. The company also researches, develops, produces, and sells anti-ballistic transport, military police, civilian bulletproof, recreational, ambulances, inspection, disabled and engineering, and other vehicles. In addition, it produces and sells interior and exterior trims, such as automobile signs, radiator grilles, and air conditioning vents, as well as engages in the investment business. Guangdong Hongtu Technology (Holdings) Co., Ltd. was founded in 2000 and is headquartered in Zhaoqing, China.",
    "website": "http://www.ght-china.com",
    "zipcode": "526108"
  },
  "002160.SZ": {
    "city": "Changshu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Jiangsu Alcha Aluminium Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU ALCHA ALU",
    "state": null,
    "summary": "Jiangsu Alcha Aluminium Group Co., Ltd. engages in the research and development, production, processing, and sale of aluminum foils, coated aluminum foils for air conditioner, and aluminum strips and plates in China. Its primary products include fin stock for air conditioner, aluminum non-clad and clad materials for heat exchanger of automobile, PS sheet and plates, blind stock, aluminum alloy sheets, etc., as well as alloy foils for automotive parts. The company also exports its products to approximately 30 countries. The company was formerly known as Jiangsu Alcha Aluminium Co.,Ltd. and changed its name to Jiangsu Alcha Aluminium Group Co., Ltd. in May 2019. Jiangsu Alcha Aluminium Group Co., Ltd. was founded in 1987 and is based in Changshu, China.",
    "website": "http://www.alcha.com",
    "zipcode": null
  },
  "002182.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Nanjing Yunhai Special Metals Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "NANJING YUNHAI SPE",
    "state": null,
    "summary": "Nanjing Yunhai Special Metals Co., Ltd. engages in mining and non-ferrous metal smelting and processing in China and internationally. It offers magnesium, aluminum, strontium, and other raw materials that are used in transportation, 3C electronics, and aerospace industries. The company's products include magnesium grains and rods, magnesium alloy ingots and extrusion sheets, and aluminum alloy ingots and billets. It also provides strontium metal and master alloy products; and die casting and extrusion products, as well as micro channel flat tubes. The company was founded in 1993 and is based in Nanjing, China.",
    "website": "http://www.rsm.com.cn",
    "zipcode": null
  },
  "002333.SZ": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "ZYF Lopsking Aluminum Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SUZHOU LOPSKING AL",
    "state": null,
    "summary": "ZYF Lopsking Aluminum Co., Ltd. engages in the research and development, production, and sale of aluminum alloy profiles in China and internationally. The company offers aluminum doors and windows, apparel, industrial profiles, special alloy profiles, curtain walls, energy-saving curtains, accessories, and project cases, as well as aluminum alloy casting rods and other products. Its products are applied in construction, cycles, photovoltaic solar energy, LED lighting, elevator decoration, rail transportation, machinery and chemical industry, electronics, aerospace, automotive, indoor and outdoor furniture, heat exchange systems, and other fields. The company was formerly known as Suzhou Lopsking Aluminum Co., Ltd. and changed its name to ZYF Lopsking Aluminum Co., Ltd. in December 2020. ZYF Lopsking Aluminum Co., Ltd. was founded in 1993 and is based in Suzhou, China.",
    "website": "http://www.lpsk.com.cn",
    "zipcode": "215131"
  },
  "002379.SZ": {
    "city": "Binzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Shandong Hongchuang Aluminum Industry Holding Company Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG HONGCHUAN",
    "state": null,
    "summary": "Shandong Hongchuang Aluminum Industry Holding Company Limited develops, manufactures, and sells aluminum finishing products in China. The company offers aluminum plates, strips, and foils. It provides container aluminum foils for packing boxes; household aluminum foils that are used in food packing; flexible packaging foils for food packaging after lamination; and beer sealing aluminum foils. The company also offers fin-stock aluminum foils for use in air conditioners; and pharmaceutical aluminum foils, which are used in pharmaceutical packing, including ptp flexible pharmaceutical packing. It also exports its products to Europe, North America, Australia, the Middle East, Southeast Asia, and internationally. The company was formerly known as Loften Environmental Technology Co., Ltd. and changed its name to Shandong Hongchuang Aluminum Industry Holding Company Limited in May 2017. Shandong Hongchuang Aluminum Industry Holding Company Limited was founded in 2000 and is based in Binzhou, China.",
    "website": "http://www.hongchuangholding.com/en/index.aspx",
    "zipcode": "256500"
  },
  "002501.SZ": {
    "city": "Liaoyuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Jilin Liyuan Precision Manufacturing Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JILIN LIYUAN PRECI",
    "state": null,
    "summary": "Jilin Liyuan Precision Manufacturing Co., Ltd. manufactures and sells industrial and architectural aluminum profiles, special profiles, mechanical machining and assembling aluminum alloy parts, and railcar engine and body manufacturing parts in China. It also exports its products to 18 countries and regions. The company was formerly known as Jilin Liyuan Aluminum Co., Ltd. and changed its name to Jilin Liyuan Precision Manufacturing Co., Ltd. in November 2013. Jilin Liyuan Precision Manufacturing Co., Ltd. was founded in 2000 and is based in Liaoyuan, China.",
    "website": "http://www.liyuanlvye.com",
    "zipcode": "136200"
  },
  "002547.SZ": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Suzhou Chunxing Precision Mechanical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SUZHOU CHUNXING PR",
    "state": null,
    "summary": "Suzhou Chunxing Precision Mechanical Co., Ltd. produces and sells precise aluminum structure parts for telecom, automobile, industrial, medical, and consumer markets in China and internationally. It offers die casting products, such as filter bodies, robot housings, and heat sinks; sheet metal stampings, including adapting pieces, automobile seat frames, back DVD frames, automobile front seat frames, and automobile back seats; and automobile parts comprising handbrake connecting links, automobile cooling system bodies, seat belt reels, and wiper engine housings. The company was founded in 2001 and is based in Suzhou, China.",
    "website": "http://www.chunxing-group.com",
    "zipcode": null
  },
  "002578.SZ": {
    "city": "Nanan City",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Fujian Minfa Aluminium Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "FUJIAN MINFA ALUMI",
    "state": null,
    "summary": "Fujian Minfa Aluminium Co.,Ltd. processes and sells aluminum alloy extruded profiles for architecture and industry fields in the People's Republic of China. The company offers sliding, casement, and insulated windows and doors; railings and shutters; and curtain wall building profiles. It also provides industrial materials, including luggage, decorating, and stationery materials; opening, corner, and table top pipes; sliding pulleys, ladder materials, and fire hydrants; radiating fins; aluminum building formwork systems; aluminum panels; and color cards. The company also exports its products to approximately 40 countries. Fujian Minfa Aluminium Co.,Ltd. was founded in 1993 and is based in Nanan City, the People's Republic of China.",
    "website": "http://www.minfa.com",
    "zipcode": "362300"
  },
  "002824.SZ": {
    "city": "Zhongshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Guangdong Hoshion Aluminium Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG HOSHIONA",
    "state": null,
    "summary": "Guangdong Hoshion Aluminium Co., Ltd. researches, develops, produces, and sells industrial aluminum profiles. The company offers consumer electronics, such as OPC and driven rollers for copier printers; power bank housing products; extrusion profiles for mobile phones; aluminum for TV frames; electronic products extrusion materials; arm of computer hard disc; seamless pipes for lens; and photographic equipment. It also provides automobile anti-collision beams; automobile slide rail for skylight; high precision large sectional rectangle pipes; colied pipesinner thread pipes; and forging parts. In addition, the company offers seamless pipes for baseball bars; kitchen and bathroom components; aluminum used baby trolley; aluminum for bicycle; extrusion profiles for flashlight and vacuum products; aluminum used lighting and snow shoes; electric heating tubes; and conditioner frames. Guangdong Hoshion Aluminium Co., Ltd. was founded in 2005 and is based in Zhongshan, China.",
    "website": "http://www.hoshion.com",
    "zipcode": "528463"
  },
  "002988.SZ": {
    "city": "Qingyuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Guangdong Haomei New Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG HAOMEI N",
    "state": null,
    "summary": "Guangdong Haomei New Material Co., Ltd. manufactures and sells aluminum profiles in China. The company offers aluminum alloy doors and windows systems, as well as lightweight materials. Its aluminum profiles are used in buildings, rail transits, machineries, and electronic appliances. The company provides industrial profiles that are used in telecommunications, LED, machineries, automobile, computers, shipping, aviation and aerospace, rail transit, and durables; and construction profiles. It exports products to the United States, Germany, Canada, the United Kingdom, Switzerland, Singapore, Brunei, and Italy. Guangdong Haomei New Material Co., Ltd. was founded in 1990 and is based in Qingyuan, China.",
    "website": "http://www.haomei-alu.com",
    "zipcode": "511540"
  },
  "002996.SZ": {
    "city": "Chongqing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Chongqing Shunbo Aluminum Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CHONGQING SHUNBO A",
    "state": null,
    "summary": "Chongqing Shunbo Aluminum Co.,Ltd. produces and sells secondary aluminum alloy ingots in China. Its products are used in automobile, motorcycle, mechanical equipment, communication equipment, electronic appliance, hardware product production in lighting, and other industries. The company was founded in 2003 and is based in Chongqing, China.",
    "website": "http://www.soonbest.com",
    "zipcode": null
  },
  "003038.SZ": {
    "city": "Tianchang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Anhui Xinbo Aluminum Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ANHUI XINBO ALUMIN",
    "state": null,
    "summary": "Anhui Xinbo Aluminum Co., Ltd. manufactures and sells aluminum alloy profiles. It offers aluminum products in the areas of rail, new energy photovoltaic, car lightweight, electronic appliances, medical and electrical appliances, energy-efficient buildings, system doors and windows, and other fields. The company was founded in 2013 and is based in Tianchang, China.",
    "website": "http://xinbogf.com",
    "zipcode": "239304"
  },
  "0098.HK": {
    "city": "Foshan",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Aluminum",
    "long_name": "Xingfa Aluminium Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XINGFA ALUM",
    "state": null,
    "summary": "Xingfa Aluminium Holdings Limited, an investment holding company, manufactures, sells, and trades in aluminum profiles that are applied as construction and industrial materials in the People's Republic of China and Hong Kong. The company operates through Industrial Aluminum Profiles, Construction Aluminum Profiles, Property Development, and All Other segments. It offers aluminum alloy profile products, including heat sink profiles, rigid suspension conductive converge-wires, motor casing profiles, and alloys; aluminum profiles for elevators and refrigerated container; hollow profiles and bar materials for aerospace; plate profiles for subway carriage; cylindrical casing aluminum profiles for light products; light tube outer shells; stiffened plate profiles for shipping; and laptop outer shells. The company also manufactures and sells aluminum profiles with surface finishing, including anodic oxidation, electrophoresis coating, powder coating, and PVDF coating aluminum profiles, which are used in architecture decoration. In addition, it provides door and window systems, and building curtain wall systems; and lifting and fixed windows, railing aluminum alloy profiles, angel pipes, and flat tubes. Further, the company engages in the development and sale of office premises and residential properties; and management of properties. Additionally, it manufactures and sells precision and architecture products, as well as environment protection products; and aluminum panels, moulds, and spare parts. The company also exports its products to Australia and Vietnam. Xingfa Aluminium Holdings Limited was founded in 1984 and is headquartered in Foshan, the People's Republic of China.",
    "website": "http://www.xingfa.com",
    "zipcode": "528137"
  },
  "0CZ.F": {
    "city": "Liaoyang",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aluminum",
    "long_name": "China Zhongwang Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA ZHONGWANG HLDG HK-1",
    "state": null,
    "summary": "China Zhongwang Holdings Limited, through its subsidiaries, develops, manufactures, and sells aluminum extruded products in the People's Republic of China, Germany, the United States, and internationally. It operates through Aluminium Alloy Formworks, Aluminium Extrusion Products for Industrial Markets, Aluminium Further-Fabricated Products, Aluminium Extrusion Products for Construction Markets, Aluminium Flat-Rolled Products, and Leasing of Aluminium Alloy Formworks segments. The company offers high precision, large-section, and value-added industrial aluminum extrusion products for use in ecological construction, transportation, machinery and equipment, and electric power engineering sectors; and aluminum flat rolled products. It is also involved in the manufacture of machinery, and special vehicle and parts; trading of aluminum ingots, rods, and other materials; and manufacture of aluminum extrusion molds, alloy formworks, vehicle compartments, furniture, and vessels, as well as provision of investment consulting services. The company was founded in 1993 and is headquartered in Liaoyang, the People's Republic of China. China Zhongwang Holdings Limited is a subsidiary of Zhongwang International Group Limited.",
    "website": "http://www.zhongwang.com",
    "zipcode": "111003"
  },
  "1333.HK": {
    "city": "Liaoyang",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Aluminum",
    "long_name": "China Zhongwang Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA ZHONGWANG",
    "state": null,
    "summary": "China Zhongwang Holdings Limited, through its subsidiaries, develops, manufactures, and sells aluminum extruded products in the People's Republic of China, Germany, the United States, and internationally. It operates through Aluminium Alloy Formworks, Aluminium Extrusion Products for Industrial Markets, Aluminium Further-Fabricated Products, Aluminium Extrusion Products for Construction Markets, Aluminium Flat-Rolled Products, and Leasing of Aluminium Alloy Formworks segments. The company offers high precision, large-section, and value-added industrial aluminum extrusion products for use in ecological construction, transportation, machinery and equipment, and electric power engineering sectors; and aluminum flat rolled products. It is also involved in the manufacture of machinery, and special vehicle and parts; trading of aluminum ingots, rods, and other materials; and manufacture of aluminum extrusion molds, alloy formworks, vehicle compartments, furniture, and vessels, as well as provision of investment consulting services. The company was founded in 1993 and is headquartered in Liaoyang, the People's Republic of China. China Zhongwang Holdings Limited is a subsidiary of Zhongwang International Group Limited.",
    "website": "http://www.zhongwang.com",
    "zipcode": "111003"
  },
  "1378.HK": {
    "city": "Zouping",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Aluminum",
    "long_name": "China Hongqiao Group Limited",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "CHINAHONGQIAO",
    "state": null,
    "summary": "China Hongqiao Group Limited, an investment holding company, manufactures and sells aluminum products in the People's Republic of China and Indonesia. The company's products include molten aluminum alloys, aluminum alloy ingots, aluminum busbars, and aluminum alloy processing products. It also engages in the research, development, and trading of bauxite; production and sale of electricity; and provision of financial leasing services. The company was founded in 1994 and is headquartered in Zouping, the People's Republic of China. China Hongqiao Group Limited is a subsidiary of China Hongqiao Holdings Limited.",
    "website": "http://www.hongqiaochina.com",
    "zipcode": "256200"
  },
  "300337.SZ": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Yinbang Clad Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "YINBANG CLAD MATER",
    "state": null,
    "summary": "Yinbang Clad Material Co., Ltd. researches, develops, produces, and sells aluminum clad and multi-metal clad materials in China and internationally. Its aluminum clad materials are used in heat exchangers for automotive and off-highway-vehicles; air conditioning; and energy industry. The company also provides multi-layer clad products, including aluminum steel, aluminum stainless steel, aluminum copper, aluminum titanium, copper steel, and steel stainless steel products for use in heat exchangers, air-cooled power stations, car components, domestic appliances, cookware, telecommunication equipment, marine engineering, aerospace and aviation, and machinery and metallurgy. In addition, it offers aluminum clad plates for use in defense and military projects; develops and manufactures special equipment for the military; and develops military special vehicles and equipment products. Further, the company provides 3D printing services; produces titanium alloy powder and parts for aerospace purposes; and manufactures turbine blades molds. Yinbang Clad Material Co., Ltd. was founded in 1988 and is based in Wuxi, China.",
    "website": "http://www.cn-yinbang.com",
    "zipcode": "214145"
  },
  "300428.SZ": {
    "city": "Baoding",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Hebei Sitong New Metal Material Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "LIZHONG SITONG LIG",
    "state": null,
    "summary": "Hebei Sitong New Metal Material Co., Ltd engages in the research, development, manufacture, and sale of aluminum based functional master alloys in China. The company offers aluminum, magnesium, zinc, and copper based master alloys in coiled rod, cut rod, waffle ingot, cast cut bar, button, and compact forms. Its products are used in aluminum alloy sheet, strip, foil, alloy tube, bar/billet, profile, and wire applications, as well as in aluminum alloy castings. The company also exports its products to approximately 40 countries worldwide. Hebei Sitong New Metal Material Co., Ltd was founded in 1998 and is based in Baoding, China.",
    "website": "http://www.stnm.com.cn",
    "zipcode": "071000"
  },
  "300489.SZ": {
    "city": "Harbin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Harbin ZhongFei New Technology CO.,LTD.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HARBIN ZHONGFEI NE",
    "state": null,
    "summary": "Harbin ZhongFei New Technology CO.,LTD., together with its subsidiary, provides aluminum products in China. The company offers aluminum alloy forgings, extrusions, and machine parts. It is also involved in the production and sale of mechanical equipment and instrumentation; mechanical processing activities, as well as offers technical services. In addition, the company offers extrusion bars, pipes, small diameter bars, profiles, shaped tubes, and ingots; and heat treatment furnaces, vacuum brazing furnaces, and tension stretching machines. Its aluminum products are used in nuclear energy, aviation, military, electronic, machinery, and equipment manufacturing industries. The company was formerly known as Harbin ZhongFei New Technology Ltd. and changed its name to Harbin ZhongFei New Technology CO.,LTD. in November 2010. Harbin ZhongFei New Technology CO.,LTD. was founded in 2006 and is based in Harbin, China.",
    "website": "http://www.zfgf.cc",
    "zipcode": null
  },
  "300828.SZ": {
    "city": "Tianjin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Aluminum",
    "long_name": "Tianjin Ruixin Technology Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TIANJIN RUIXIN TEC",
    "state": null,
    "summary": "Tianjin Ruixin Technology Co.,Ltd engages in the extrusion of aluminum alloy profiles. It processes aluminum alloy parts. The company's products and operations include pressing, heat transmission heatsink, communication heatsink, standard heatsink, aluminum precision parts, GPS heatsink, electromagnetic shielding shell, high finned heatsink, battery power supply heatsink, medium voltage drive heatsink, moto housing, heatsink samples, pump body, industrial profile, TV station heatsink, filter housing, LED heatsink, inserted fins assembly heatsink, train traction heatsink, and actuator housing. Its products are used in various applications, such as medical equipment, safety material of automobile light weight, and products of fluid control. The company was formerly known as Tianjin Ruixinchang Light Alloy Co., Ltd. and changed its name to Tianjin Ruixin Technology Co.,Ltd in November, 2017. Tianjin Ruixin Technology Co.,Ltd was founded in 2004 and is based in Tianjin, China.",
    "website": "http://www.ruixin-eht.com",
    "zipcode": "300384"
  },
  "600219.SS": {
    "city": "Longkou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Shandong Nanshan Aluminium Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG NANSHAN ALUMINUM CO LT",
    "state": null,
    "summary": "Shandong Nanshan Aluminium Co., Ltd. manufactures and sells aluminum profiles worldwide. It offers construction and industrial profile series of products, such as alumina, electrolytic aluminum, aluminum, aluminum foils, aviation materials, other terminal products that are used in aerospace, ships, trains, electric power, automobile, container, etc. The company was formerly known as Shandong Nanshan Industrial Co., Ltd. and changed its name to Shandong Nanshan Aluminium Co., Ltd. in March 2006. Shandong Nanshan Aluminium Co., Ltd. was founded in 1993 and is based in Longkou, China.",
    "website": "http://www.nanshanalu.com",
    "zipcode": "265706"
  },
  "600595.SS": {
    "city": "Gongyi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Henan Zhongfu Industrial Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HENAN ZHONGFU INDUSTRIAL CO LTD",
    "state": null,
    "summary": "Henan Zhongfu Industrial Co.,Ltd processes, manufactures, and sells electrolytic aluminum and aluminum products in China. It offers plates and coils, including double zero foils, auto sheets, and can stocks, as well as high end CTP base, other high performance, and anodizing plates. The company also provides billets for use in the electronics and rail transport applications, as well as industrial, architectural, and auto profiles; and wire rods consisting of rivet, conductor, extruded tube, steel plant deoxidation, and wires and cable use rods. In addition, it is involved in the power generation, as well as coal production activities. The company was founded in 1993 and is based in Gongyi, China. Henan Zhongfu Industrial Co.,Ltd operates as a subsidiary of Henan Yulian Energy Group CO., LTD.",
    "website": "http://www.zfmetals.com",
    "zipcode": "451200"
  },
  "600768.SS": {
    "city": "Ningbo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Ningbo Fubang Jingye Group Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NINGBO FUBANG JINGYE GROUP CO",
    "state": null,
    "summary": "Ningbo Fubang Jingye Group Co., Ltd produces, processes, and sells industrial aluminum profiles in China. It also trades in aluminum casting rods. The company was formerly known as Ningbo Huatong Transportation Co., Ltd. The company is based in Ningbo, China.",
    "website": "http://www.600768.com.cn",
    "zipcode": null
  },
  "600888.SS": {
    "city": "Urumqi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Xinjiang Joinworld Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XINJIANG JOINWORLD CO",
    "state": null,
    "summary": "Xinjiang Joinworld Co., Ltd. engages in the production and sale of aluminum and aluminum products in China and internationally. It also provides electronic aluminum foil, electrode foil, and other electronic component raw materials, as well as aluminum alloys. The company's aluminum is used in electronic aluminum foil, electronic conductive needle wire, alumina powder, aviation aluminum alloy, and target materials, as well as other fields of electronics, aerospace, and integrated circuits; electronic aluminum foil is used for the production of electrode foil; electrode foil is used for the production of aluminum electrolytic capacitors; and aluminum alloy is used in electronic consumer products, energy-saving wires, automobile engines, automobile decoration, architectural decoration and other electronics, electricity, transportation, and construction related field. In addition, the company manufactures and sells electronic materials. Xinjiang Joinworld Co., Ltd. was founded in 1958 and is based in Urumqi, China.",
    "website": "http://www.joinworld.com",
    "zipcode": "830013"
  },
  "601388.SS": {
    "city": "Taicang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Yechiu Metal Recycling (China) Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "YECHIU METAL RECYCLING (CHINA) ",
    "state": null,
    "summary": "Yechiu Metal Recycling (China) Ltd. engages in aluminum recycling business in Asia and the United States. It produces and sells aluminum alloy ingots for use in automotive, power tool, telecommunication, hardware, and home appliance industries. The company was formerly known as Ye Chiu Metal Taicang Co., Ltd. and changed its name to Yechiu Metal Recycling (China) Ltd. in 2009. Yechiu Metal Recycling (China) Ltd. was founded in 2001 and is based in Taicang, China.",
    "website": "http://www.yechiu.com",
    "zipcode": null
  },
  "601677.SS": {
    "city": "Zhengzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Henan Mingtai Al.Industrial Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HENAN MINGTAI AL INDUSTRIAL CO ",
    "state": null,
    "summary": "Henan Mingtai Al.Industrial Co.,Ltd. produces and sells aluminum products in China. It offers aluminum sheets, coils, checker plates, and foils. The company's products are used in high-speed rail train, Inter-city rail, aerospace, automobile manufacturing, architectural decoration, shipbuilding, packaging, electronic appliances, printing, and other industries. It also exports its products to approximately 100 countries worldwide. The company was founded in 1997 and is based in Gongyi, China.",
    "website": "http://www.mingtai-al.com",
    "zipcode": null
  },
  "601702.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Shanghai Huafon Aluminium Corporation",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI HUAFON ALUMINIUM CORPO",
    "state": null,
    "summary": "Shanghai Huafon Aluminium Corporation operates as an aluminium heat transfer material processing and supplying company in China. It offers brazed heat exchangers materials, such as water tanks, heaters, and air coolers; condensers; and evaporators, heaters, and oil coolers. The company also provides other industrial materials, including car radiators with aluminum foils, decorative aluminum foils, aluminum pull ring materials, aluminum can materials, hot rolled coils, fin materials for power station, and construction machinery brazing sheets. Its alloyed materials are used in the automobile and construction machinery and equipment cooling systems, power station cooling systems, micro-channel coolers, and various kinds of commercial and residential air-conditioners; and aluminum products used in transportation construction, food packaging, electronics information, and other fields. The company serves auto cooling system manufacturers, air-cooled power plant equipment manufacturers, and micro-channel heat exchanger for domestic air conditioning manufacturers. Shanghai Huafon Aluminium Corporation is based in Shanghai, China.",
    "website": "http://www.huafonal.com",
    "zipcode": null
  },
  "603876.SS": {
    "city": "Zhenjiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Jiangsu Dingsheng New Material Joint-Stock Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU DINGSHENG NEW MATERIAL ",
    "state": null,
    "summary": "Jiangsu Dingsheng New Material Joint-Stock Co.,Ltd manufactures and sells aluminum products. The company's products include aluminum plates, sheets, strips, foils, and coating materials, as well as processed products, such as aluminum oxide boards, cable foils, air conditioner foils, decorative building material aluminum foils, air conditioner refrigerator evaporators, condensers, and others. It serves household appliance, electronic communication, transportation, medicine, packaging, printing, chemical, building material, decoration, and other industries. The company was formerly known as Zhenjiang Dingsheng Aluminum Industry Co., Ltd. Jiangsu Dingsheng New Material Joint-Stock Co.,Ltd was founded in 2003 and is based in Zhenjiang, China.",
    "website": "http://www.dingshengxincai.com",
    "zipcode": "212141"
  },
  "603937.SS": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Jiangsu Lidao New Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU LIDAO NEW MATERIAL CO L",
    "state": null,
    "summary": "Jiangsu Lidao New Materials Co., Ltd. researches, develops, produces, and sells aluminum products in China and internationally. It offers aluminum magnesium and manganese roofing materials, color coated aluminum, and coated aluminum plates, as well as coated, embossed, and hammer aluminum rolls for use in various fields comprising construction, electronic appliances, lighting, furniture, bags, cans, and other materials. The company was founded in 2004 and is based in Changzhou, China.",
    "website": "http://www.jsldxcl.com",
    "zipcode": "213000"
  },
  "603978.SS": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Aluminum",
    "long_name": "Shenzhen SunXing Light Alloys Materials Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHENZHENSUNXING LIGHT ALLOYS MA",
    "state": null,
    "summary": "Shenzhen SunXing Light Alloys Materials Co.,Ltd. develops, produces, and sells light alloy materials in China. It offers aluminum and magnesium alloy materials for use in various fields, such as military, aerospace, navigation, and rail transit. The company was founded in 1992 and is based in Shenzhen, China.",
    "website": "http://www.stalloys.com",
    "zipcode": "51810-6"
  },
  "ACH": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "Aluminum Corporation of China L",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "ACH.BA": {
    "city": "Beijing",
    "country": "China",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "ar_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMINUM CORP CHN.",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "ACHN.MX": {
    "city": "Beijing",
    "country": "China",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMINUM CORP OF CHINA(CHALCO)",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "ALMMF": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMINUM CORP OF CHINA(CHALCO)",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "AOC.F": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMINUM CORP. CHINA YC 1",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "AOC.VI": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMINUM CORP OF CHINA LTD-H",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "AOCA.F": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aluminum",
    "long_name": "Aluminum Corporation of China Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "ALUMINUM CORP.OF ADR/25",
    "state": null,
    "summary": "Aluminum Corporation of China Limited, together with its subsidiaries, manufactures and sells alumina, primary aluminum, and energy products in the People's Republic of China. The company operates through Alumina, Primary Aluminum, Trading, and Energy segments. The Alumina segment mines for and purchases bauxite and other raw materials; and produces and sells alumina, as well as refined alumina. The Primary Aluminum segment procures alumina and other raw materials, supplemental materials, and electrical power; and produces and sells aluminum and aluminum-related products, such as carbon, aluminum alloy, and other electrolytic aluminum products. The Trading segment trades in alumina, primary aluminum, aluminum fabrication products, other non-ferrous metal products, coal products, raw and supplemental materials; and provides logistics and transport services to external customers. The Energy segment engages in coal mining; and generates and sells electricity using thermal power, wind power, and solar power sources to regional power grid corporations, as well as manufactures power related equipment. The company also acquires, manufactures, and distributes bauxite mines and limestone ore; and provides engineering project management, and research and development services. Aluminum Corporation of China Limited was incorporated in 2001 and is headquartered in Beijing, the People's Republic of China.",
    "website": "http://www.chalco.com.cn",
    "zipcode": "100082"
  },
  "H0Q.F": {
    "city": "Zouping",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aluminum",
    "long_name": "China Hongqiao Group Limited",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA HONGQIAO GROUP LTD",
    "state": null,
    "summary": "China Hongqiao Group Limited, an investment holding company, manufactures and sells aluminum products in the People's Republic of China and Indonesia. The company's products include molten aluminum alloys, aluminum alloy ingots, aluminum busbars, and aluminum alloy processing products. It also engages in the research, development, and trading of bauxite; production and sale of electricity; and provision of financial leasing services. The company was founded in 1994 and is headquartered in Zouping, the People's Republic of China. China Hongqiao Group Limited is a subsidiary of China Hongqiao Holdings Limited.",
    "website": "http://www.hongqiaochina.com",
    "zipcode": "256200"
  }
}
