{
  "000510.SZ": {
    "city": "Deyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Sichuan Xinjinlu Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SICHUAN XINJINLU G",
    "state": null,
    "summary": "Sichuan Xinjinlu Group Co., Ltd. produces and sells chlor-alkali chemicals and plastic products for industrial use in China. The company primarily offers polyvinyl chloride (PVC) resin, caustic soda, liquid chlorine, hydrochloric acid, interior wall decoration material, calendar leather, automotive interior leather and films, decorative film, and others. It also provides sodium alkali and potash, potassium hydroxide, special PVC resin, sodium hypochlorite, sodium hydroxide, and calcium carbide; and chemical design, warehousing, and other services. The company was formerly known as Sichuan Jinlu Group Co., Ltd. Sichuan Xinjinlu Group Co., Ltd. is based in Deyang, China.",
    "website": "http://www.jinlugroup.cn",
    "zipcode": null
  },
  "000545.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Gpro Titanium Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GPRO TITANIUM INDU",
    "state": null,
    "summary": "Gpro Titanium Industry Co., Ltd. manufactures and sells titanium powder in China. Its products are used in coating, papermaking, chemical fiber, ink, plastic tube, film, rubber, and leather, cosmetic, and other fields. The company also exports its products to Southeast Asia, Africa, the United States, and other countries and regions. The company was formerly known as Jilin Gpro Titanium Industry Co., Ltd. and changed its name to Gpro Titanium Industry Co., Ltd. in March 2017. Gpro Titanium Industry Co., Ltd. was founded in 1957 and is based in Nanjing, China.",
    "website": "http://www.nthcl.com",
    "zipcode": "210047"
  },
  "000615.SZ": {
    "city": "Xiangyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Aoyuan Beauty Valley Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "AOYUAN BEAUTY VALL",
    "state": null,
    "summary": "Aoyuan Beauty Valley Technology Co., Ltd. engages in the investment, development, and operation of real estate properties in China. The company is involved in research and development, and manufacture of bio-based fiber and material series products; and the investment, construction, and operation of the theme town and the idyllic complex. It also acts as a general contractor for building construction. The company was formerly known as Kinghand Industrial Investment Group Co.,Ltd. and changed its name to Aoyuan Beauty Valley Technology Co., Ltd. in November 2020. Aoyuan Beauty Valley Technology Co., Ltd. was founded in 1996 and is based in Xiangyang, China.",
    "website": "http://www.000615.com.cn",
    "zipcode": "441133"
  },
  "000635.SZ": {
    "city": "Shizuishan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Ningxia Yinglite Chemicals Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "N/YINGLIGHT CHEMIC",
    "state": null,
    "summary": "Ningxia Yinglite Chemicals Co., Ltd produces and sells chlor-alkali, lime nitrogen, and dicyandiamide products in China. It provides polyvinyl chloride, paste resin, calcium carbide, lime nitrogen, caustic soda, and corn starch glucose and l-lactic acid. The company is also involved in the production and sale of electricity and heat; production of PVC; and foreign investment and trade activities. In addition, it offers catering and accommodation services. Ningxia Yinglite Chemicals Co., Ltd was founded in 1996 and is headquartered in Shizuishan, China. Ningxia Yinglite Chemicals Co., Ltd is a subsidiary of Guodian Younglight Energy Chemical Group Co., Ltd.",
    "website": "http://www.yinglitechem.com",
    "zipcode": "753202"
  },
  "000637.SZ": {
    "city": "Maoming",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Maoming Petro-Chemical Shihua Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "MAOMING PETRO-CHEM",
    "state": null,
    "summary": "Maoming Petro-Chemical Shihua Co., Ltd manufactures and sells petrochemicals in the People's Republic of China. It offers polypropylene resin powders, secondary butyl acetate, methyl tert-butyl ether, ethanolamine, industrial and light white oil, ethylene, butane, propane, industrial hexane, cyclopentane, carbon, liquefied petroleum gas, and plastic products. The company was founded in 1988 and is based in Maoming, the People's Republic of China.",
    "website": "http://www.mhsh0637.com.cn",
    "zipcode": "525000"
  },
  "000707.SZ": {
    "city": "Xiaogan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hubei Shuanghuan Science and Technology Stock Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "HUBEI SHUANG SCI",
    "state": null,
    "summary": "Hubei Shuanghuan Science and Technology Stock Co.,Ltd primarily produces and sells heavy soda ash in China. Its heavy soda ash is used in manufacturing float glass. The company also provides light soda ash for manufacturing food, smelting, daily cleaning, and flat glass products; agricultural ammonium chloride; and industrial anhydrous sodium sulfate for use in vinylon, saponin, bleaching dyeing, synthetic lotion, glass, paper, leather, oil and gas pipeline anti-corrosion, metal smelting, surface treatment, fillers, and other industries. In addition, it develops and sells real estate properties; offers ammonia, liquid argon, sulfur, oxygen, fly ash, sulfuric acid, liquefied natural gas, and nitrogen; leases real estate properties; provides information consultation services; and produces and sells steam. The company also exports its products. Hubei Shuanghuan Science and Technology Stock Co.,Ltd is based in Xiaogan, China.",
    "website": "http://www.hbshkj.cn",
    "zipcode": "432407"
  },
  "000782.SZ": {
    "city": "Jiangmen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Guangdong Xinhui Meida Nylon Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG XINHUI M",
    "state": null,
    "summary": "Guangdong Xinhui Meida Nylon Co., Ltd. engages in the manufacture and sale of nylon products in China. It offers nylon-6 chips and composite materials, multi-filaments, texturing yarns, polyamide and nylon fibers, and chemical knitting fabrics. The company was founded in 1984 and is based in Jiangmen, China.",
    "website": "http://www.meidanylon.com",
    "zipcode": "529100"
  },
  "000818.SZ": {
    "city": "Huludao",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hangjin Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HANGJIN TECHNOLOGY",
    "state": null,
    "summary": "Hangjin Technology Co., Ltd. manufactures and sells chemicals in China. Its products include caustic soda, polyvinyl chloride, propylene oxide, polyether, chlorinated benzene, chlor-alkali, propylene oxide polyether, and other products. The company was formerly known as Fangda Jinhua Chemical Technology Co.,Ltd and changed its name to Hangjin Technology Co., Ltd. in April 2018. Hangjin Technology Co., Ltd. was founded in 1939 and is based in Huludao, China.",
    "website": "http://www.hangjintechnology.com",
    "zipcode": null
  },
  "000819.SZ": {
    "city": "Yueyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Yueyang Xingchang Petro-Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "YUEYANG XINGCHANG",
    "state": null,
    "summary": "Yueyang Xingchang Petro-Chemical Co., Ltd. manufactures and sells chemical products in China. Its products include isobutene, non-woven propylene, polypropylene resin powder, propylene, methyl tert-butyl ether, industrial methanol, propane, industrial hydrogen, liquefied petroleum gas, and plastic woven bags. The company was founded in 1990 and is based in Yueyang, China.",
    "website": "http://www.yyxc0819.com",
    "zipcode": "414000"
  },
  "000822.SZ": {
    "city": "Weifang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shandong Haihua Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG HAIHUA CO",
    "state": null,
    "summary": "Shandong Haihua Co.,Ltd, together with its subsidiaries, manufactures and sells chemical products in China. Its products include soda ash, industry salt, bromide, calcium chloride, potassium sulfate, magnesium chloride, and other products. The company's products are used in light, chemical, metallurgy, building material, medical, and other industries. It also exports its products to approximately 40 countries. Shandong Haihua Co.,Ltd was founded in 1998 and is based in Weifang, China.",
    "website": "http://www.chinahaihua.com",
    "zipcode": null
  },
  "000859.SZ": {
    "city": "Hefei",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Anhui Guofeng Plastic Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ANHUI GUOFENG PLAS",
    "state": null,
    "summary": "Anhui Guofeng Plastic Industry Co., Ltd. manufactures and sells plastic products in China and Europe. It offers plastic films, wood plastic materials, and composite films, as well as engineering plastics and sapphire products. The company was founded in 1998 and is based in Hefei, China.",
    "website": "http://www.guofeng.com",
    "zipcode": "230088"
  },
  "000936.SZ": {
    "city": "Jiangyin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Jiangsu Huaxicun Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU HUAXICUN",
    "state": null,
    "summary": "Jiangsu Huaxicun Co., Ltd. manufactures and sells chemical fiber in China and internationally. It also provides asset management, investment consulting, merger and acquisition, and private equity and corporate shares trust investment services. In addition, the company is involved in banking business. It also operates approximately 170 branches in Shanghai, Zhejiang, Jiangsu, Fujian, Guangdong, Chongqing, Sichuan, Jiangxi, and Yunnan provinces. The company was founded in 1999 and is based in Jiangyin, China.",
    "website": "http://www.jshuaxicun.com",
    "zipcode": "214420"
  },
  "000949.SZ": {
    "city": "Xinxiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Xinxiang Chemical Fiber Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XINXIANG CHEMICAL",
    "state": null,
    "summary": "Xinxiang Chemical Fiber Co., Ltd. manufactures and distributes textile raw materials in China and internationally. Its products include cellulose filament and spandex yarns; and photochromic, thermochromic, intellectualized thermoregulation, bamboo, protein, and aloe fibers. The company exports its products to approximately 30 countries and regions, such as Germany, Italy, Japan, South Korea, and India. Xinxiang Chemical Fiber Co., Ltd. is based in Xinxiang, China. Xinxiang Chemical Fiber Co., Ltd. is a subsidiary of Xinxiang Bailu Investment Group Co., Ltd.",
    "website": "http://www.bailu.com",
    "zipcode": "453006"
  },
  "000973.SZ": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "FSPG Hi-Tech CO., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "FSPG HI-TECH C",
    "state": null,
    "summary": "FSPG Hi-Tech CO., Ltd. manufactures and sells plastic materials in China. The company offers packaging materials, including BOPA, BOPP drinking straw and cigarette packaging materials, and laminated AL films; electric and optical materials, such as BOPP capacitor and polarizer films; and construction materials comprising woven fabrics and PE-Xc pipes. It also provides personal healthcare and clothing materials that include EasyTex breathable membranes and PE casting embossed films; advertisement and labeling materials, which comprise PVC film for graphics use. FSPG Hi-Tech CO., Ltd. is based in Foshan, China.",
    "website": "http://www.foshan-plastic.com",
    "zipcode": "528000"
  },
  "000985.SZ": {
    "city": "Daqing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Daqing Huake Company Limited",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "DAQING HUAKE CO. L",
    "state": null,
    "summary": "Daqing Huake Company Limited develops, produces, and sells petrochemicals and fine chemicals primarily in China. The company offers chemical products, including heavy aromatics, crude isopentene, crude isoprene, industrial acetonitrile, industrial dicyclopentadiene, light aromatics, ethylene tar, crude pentadiene, hydrogenated pentene, light colour petroleum resins, and intermittent liquid phase bulk polypropylene powder. It also provides plastic products, such as polypropylene woven bag coating special materials and polyethylene insulation for communication cables, as well as medical and health products. The company also exports its products to approximately 20 countries and regions, such as Europe, Southeast Asia, and North America. Daqing Huake Company Limited was founded in 1998 and is based in Daqing, China.",
    "website": "http://www.huake.com",
    "zipcode": "163316"
  },
  "002054.SZ": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Dymatic Chemicals,Inc.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "DYMATIC CHEMICALS",
    "state": null,
    "summary": "Dymatic Chemicals,Inc. produces and markets textile auxiliaries and other fine chemicals in China. It offers pretreatment agents, dyeing auxiliaries, finishing agents, printing chemicals, specialty chemicals, cyclopentane, and innofarm products. The company was founded in 1989 and is based in Foshan, China.",
    "website": "http://www.dymatic.com",
    "zipcode": "528305"
  },
  "002080.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Sinoma Science & Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SINOMA SCIENCE & T",
    "state": null,
    "summary": "Sinoma Science & Technology Co., Ltd. manufactures and sells specialty fibers and composite materials in China and internationally. The company offers special fibers and composites, including glass fibers, three-dimensional fabrics, phenolic resins, composite molds, power composite materials, rail transportation composite materials, and automobile composite materials used in the aerospace, ship, track transportation, automobile, infrastructure construction, electricity, chemical corrosion, and other fields. It also provides lithium battery separators for lithium batteries and lithium battery materials; high-pressure gas cylinders, such as vehicle control CNG cylinders, automotive steel deep drawing CNG cylinders, tube bundles and hydrogen cylinders, etc.; composite wind power blades; filtration and separation materials used in the cement, steel, carbon black, electricity, and other industries; and engineering technology and equipment used in the defense, military, environmental protection, agriculture, plastics, rubber, high-voltage cable, and other industries. In addition, the company exports its products. The company is headquartered in Beijing, China.",
    "website": "http://www.sinomatech.com",
    "zipcode": "100097"
  },
  "002088.SZ": {
    "city": "Zibo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Luyang Energy-Saving Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "LUYANG ENERGY-SAVI",
    "state": null,
    "summary": "Luyang Energy-Saving Materials Co., Ltd. produces and sells refractory and insulation materials in China and internationally. It offers ceramic fiber products, including Hp blankets, boards, unshaped products, papers, modules, anchors, folding blocks, textiles, blankets with aluminum foil, fire controller roller shutters, bulks, and felts; and bio-soluble fiber products. The company also provides alumina fiber bulks, blankets, strips, veneer modules, multi modules, felts, and boards; insulating firebricks and refractory mortars; and roofing thermal insulations. In addition, it offers SCR ceramic fiber papers, microporous hard and soft boards, ceramic fiber thin boards, biowool marine blankets, and ceramic fiber inorganic boards. The company was formerly known as Shandong Luyang Share Co., Ltd. and changed its name to Luyang Energy-Saving Materials Co., Ltd. in September 2015. Luyang Energy-Saving Materials Co., Ltd. was founded in 1984 and is based in Zibo, China.",
    "website": "http://www.luyangwool.com",
    "zipcode": null
  },
  "002092.SZ": {
    "city": "Ürümqi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Xinjiang Zhongtai Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "XINJ ZHONGTAI CHEM",
    "state": null,
    "summary": "Xinjiang Zhongtai Chemical Co., Ltd. manufactures and sells chemicals under the Feng brand name in China. It offers polyvinyl chloride resins for processing and production of polyvinyl chloride boardy products, soft products, paints, and adhesive agents; and ion exchange membrane caustic soda for use in various industries, such as artificial fiber, textile, dyestuff, chemicals for daily use, petroleum and petrochemical, organic synthesis, pharmacy, chemical fertilizer, paper making, plastic, and water treatment industries. The company also provides chlor-alkali, crude salt, calcium carbide, and coke products. It also exports its products in Central Asia, Russia, South Asia, South America, and Africa. The company was founded in 2011 and is based in Ürümqi, China.",
    "website": "http://www.zthx.com",
    "zipcode": "830026"
  },
  "002096.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hunan Nanling Industrial Explosive Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUNAN NANLING INDU",
    "state": null,
    "summary": "Hunan Nanling Industrial Explosive Materials Co., Ltd. develops, produces, and sells civil explosive equipment and chemical products. Its products include permissible emulsion explosives for secondary coal mines; rock emulsion explosives; permissible emulsion explosives for tertiary coal mines; expanded ammonium nitrate explosives for primary coal mines; electronic detonators; and plastic detonators. The company was founded in 2001 and is based in Changsha, China.",
    "website": "http://www.hnnlmb.com",
    "zipcode": "410013"
  },
  "002109.SZ": {
    "city": "Xingping",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shaanxi Xinghua Chemistry Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHAANXI XINGHUA CH",
    "state": null,
    "summary": "Shaanxi Xinghua Chemistry Co.,Ltd produces and sells ammonium nitrate products primarily in China. The company also offers methanol, synthetic ammonia, sulfur, liquid oxygen, liquid argon and nitrogen, monomethylamine, dimethylamine, trimethylamine, dimethylformamide, and ammonium sulfate. Its products are used in the civil explosion and compound fertilizer industries. The company was founded in 1997 and is based in Xingping, China.",
    "website": "http://www.snxhchem.com",
    "zipcode": null
  },
  "002125.SZ": {
    "city": "Xiangtan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Xiangtan Electrochemical Scientific Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XIANGTAN ELECTROCH",
    "state": null,
    "summary": "Xiangtan Electrochemical Scientific Ltd. produces and sells electrolytic manganese dioxide (EMD) and new energy battery materials. The company offers C-Zn grade, alkaline grade, primary Li-MnO2 grade, and secondary Li-Mo grade EMD products. It also engages in urban sewage and industrial wastewater treatment activities, as well as provides related technical services. In addition, the company trades in ferromanganese alloys, electrolytic manganese metal, primary and secondary battery materials, manganese dioxide, manganese tetroxide, catalyst, discharge manganese, manganese carbonate ore, oxidized manganese ore, fund tray trading, etc. It also exports its products to approximately 20 countries, including the United States, Japan, the European Union, Southeast Asia, and internationally. Xiangtan Electrochemical Scientific Ltd. was founded in 1958 and is based in Xiangtan, China.",
    "website": "http://www.chinaemd.com",
    "zipcode": "411100"
  },
  "002136.SZ": {
    "city": "Tongling",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Anhui Annada Titanium Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ANHUI ANNADA TITAN",
    "state": null,
    "summary": "Anhui Annada Titanium Industry Co., Ltd. manufactures and sells titanium dioxide in China. The company offers rutile type, anatase type, green paint grade, and widely-used type titanium dioxide products under the Annada brand name. Its products are used in coatings, plastics, rubber, ink, paper, chemical fiber, ceramics, and other industries. The company was founded in 1987 and is based in Tongling, China.",
    "website": "http://www.andty.com",
    "zipcode": "244024"
  },
  "002145.SZ": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "CNNC Hua Yuan Titanium Dioxide Co., Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "CNNC HUA YUAN TITA",
    "state": null,
    "summary": "CNNC Hua Yuan Titanium Dioxide Co., Ltd engages in the production, marketing, and service of titanium dioxide powder in China and internationally. Its products are used in the coating, printing ink, décor paper/laminate, and plastic industries. The company was founded in 1989 and is headquartered in Wuxi, China.",
    "website": "http://www.sinotio2.com",
    "zipcode": "214194"
  },
  "002165.SZ": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hongbaoli Group Corporation, Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HONGBAOLI GROUP CO",
    "state": null,
    "summary": "Hongbaoli Group Corporation, Ltd. researches, develops, produces, and sells polyether and isopropanol products in China. The company offers polyether polyol for use in refrigerator insulation, spray foam, building board, and pipe insulation materials; polyurethane exterior insulation board for use in exterior wall insulation/internal insulation/self-heat insulation, and other wall insulation; and isopropanolamine for use in surfactants, pharmaceutical and pesticide intermediates, metalworking fluids, and oil and natural gas applications. It also provides propylene oxide for use in polyether polyols, propylene glycol and ether, lubricant synthesis, surfactants, detergents, and insecticides; dicumyl peroxide for use in rubber vulcanizing agents, cable crosslinkers, shoe material initiators, flame retardant additives, etc.; and lithium battery material. In addition, the company offers supply chain finance. It serves the home appliances, construction, flexible packaging, transportation, shoes, medical, electronics, and other industries. Hongbaoli Group Corporation, Ltd. also exports its products to approximately 50 countries and regions. The company was formerly known as Nanjing Hongbaoli Corporation, Ltd. and changed its name to Hongbaoli Group Corporation, Ltd. in May 2015. Hongbaoli Group Corporation, Ltd. was founded in 1994 and is based in Nanjing, China.",
    "website": "http://www.hongbaoli.com",
    "zipcode": "211300"
  },
  "002167.SZ": {
    "city": "Shantou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Guangdong Orient Zirconic Ind Sci & Tech Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG ORIENT Z",
    "state": null,
    "summary": "Guangdong Orient Zirconic Ind Sci & Tech Co., Ltd. produces and sells zirconic products. The company offers zirconium dioxide, zirconium oxychloride, stabilized zirconia, zirconia ceramic structure, zirconium silicate, fused zirconia, zirconium sponge, and ceramic knife, as well as structural parts, such as zirconium ceramic parts, cutting blades, ceramic plates/precision gauges, ceramic plungers, and various parts. Its products are used in various applications and fields, including nuclear energy, special ceramics, biological ceramics, optical communication devices, solid-fuel battery, weapons, and aerospace fields, electronic ceramics, imitation jewel, ceramic glaze color, high fireproofing, and various new materials and industries. The company was founded in 1995 and is headquartered in Shantou, China.",
    "website": "http://www.orientzr.com",
    "zipcode": null
  },
  "002172.SZ": {
    "city": "Zhangjiagang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Jiangsu Aoyang Health Industry Co.ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU AOYANG HEA",
    "state": null,
    "summary": "Jiangsu Aoyang Health Industry Co.ltd. produces and sells chemical fibers in China and internationally. It offers various functional fibers, such as black and flame-retardant fibers, and long bundle wire, as well as conventional viscose fibers. The company also operates hospitals, rehabilitation centers, and pharmaceutical retail chains. In addition, it offers health management, pharmaceutical logistics, and teleconsultation services, as well as distributes pharmaceutical products. The company was formerly known as Jiangsu Aoyang Technology Corporation Limited. and changed its name to Jiangsu Aoyang Health Industry Co.ltd. in September 2018. Jiangsu Aoyang Health Industry Co.ltd. was founded in 2001 and is based in Zhangjiagang, China.",
    "website": "http://www.ayjk.cn",
    "zipcode": "215618"
  },
  "002192.SZ": {
    "city": "Guangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "YOUNGY Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "YOUNGY CO LTD",
    "state": null,
    "summary": "YOUNGY Co.,Ltd. provides energy saving and environmentally-friendly materials. It produces lithium concentrate, industrial and battery grade lithium carbonate, and lithium hydroxide monohydrate; lithium battery system; lithium salts; and lithium battery equipment, such as polymer battery automatic packaging, fixture forming, automatic air extractor, automatic liquid injection, automatic winding and ear welding, and automatic grouping machines. The company was formerly known as Luxiang Co., Ltd. and changed its name to YOUNGY Co.,Ltd. in August 2015. YOUNGY Co.,Ltd. was founded in 1998 and is based in Guangzhou, China.",
    "website": "http://www.luxiang.cn",
    "zipcode": "510623"
  },
  "002206.SZ": {
    "city": "Haining",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zhejiang Hailide New Material Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG HAILIDE N",
    "state": null,
    "summary": "Zhejiang Hailide New Material Co., Ltd. manufactures and sells industrial polyester yarns, plastic materials, and tire cord fabrics in China and internationally. The company's products include industrial polyester filament yarns; digital printing, coating, and decorative materials; and PET tire cord fabrics. Zhejiang Hailide New Material Co., Ltd. was founded in 2001 and is based in Haining, China.",
    "website": "http://www.halead.com",
    "zipcode": null
  },
  "002211.SZ": {
    "city": "Yangzhong",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shanghai Hongda New Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI HONGDA NE",
    "state": null,
    "summary": "Shanghai Hongda New Material Co., Ltd. manufactures and sells silicone rubber products in China. The company's products include low-grade miscellaneous, die, high-grade sealing key, extrusion wire, flame retardant extrusion wire, heat-resistant extruded wire, cable joint, standard extrusion, ordinary vapor and nipple, high-grade nipple, swimming cap, high temperature resistant, flame retardant, car accessory, paper feeding rubber roller, gas phase rubber roller, general rubber roller, insulating, and water vapor resistant glue products; and ordinary molding adhesive, high-grade molded products, high resistance and tear gas, high temperature resistant steam adhesive, general molded products, low compression set, and conductive plastic products. Its products are used in various keyboard keys; wires and cables insulation; power, electricity, and household appliances sealing's; transportation insulation, moisture, weather resistance, and aging products; food, medical care, hygienic non-toxic, high temperature resistant, and physiologically inert; and high temperature resistant parts in the automotive field. The company was formerly known as Jiangsu Hongda New Material Co., Ltd. Shanghai Hongda New Material Co., Ltd. was founded in 1992 and is based in Yangzhong, China.",
    "website": "http://www.hongda-chemical.com",
    "zipcode": "212200"
  },
  "002217.SZ": {
    "city": "Zibo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Holitech Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HOLITECH TECHNOLOG",
    "state": null,
    "summary": "Holitech Technology Co., Ltd. produces and sells components for smart terminals in China. It offers liquid crystal display modules, touch control modules, camera and fingerprint identification modules, cover glasses, RFPCB and flexible printed circuit boards, electronic paper eco-chain modules, backlight modules, and 5G materials, as well as components of wireless charging modules. The products are used in various fields, such as communication equipment, consumer electronics, household appliance, office equipment, digital products, automotive electronics and electric vehicles, finance, industrial control, medical device, smart wearable equipment, smart retail and smart home products. The company was formerly known as Shandong Liaherd Chemical Industry Co., Ltd. and changed its name to Holitech Technology Co., Ltd. in May 2014. Holitech Technology Co., Ltd. was founded in 2004 and is based in Zibo, China.",
    "website": "http://www.holitech.net",
    "zipcode": "256120"
  },
  "002250.SZ": {
    "city": "Taizhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Lianhe Chemical Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "LIANHE CHEMICAL TE",
    "state": null,
    "summary": "Lianhe Chemical Technology Co., Ltd. develops, produces, markets, and sells chemical products in China. It offers crop protection products, performance chemicals, and pharmaceuticals. The company also provides a range of engineering services and equipment manufacturing services. Lianhe Chemical Technology Co., Ltd. was founded in 1985 and is headquartered in Taizhou, China.",
    "website": "http://www.lianhetech.com",
    "zipcode": null
  },
  "002254.SZ": {
    "city": "Yantai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Yantai Tayho Advanced Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "YANTAI TAYHO ADVAN",
    "state": null,
    "summary": "Yantai Tayho Advanced Materials Co., Ltd. engages in the research and development, production, and sale of high-tech fibers in China. The company offers Newstar Spandex, a polyurethane elastic fiber that is used in underwear, socks, tights, sportswear, swimwear, laces, and suits, as well as in medical and hygiene textiles, and automotive interiors. It also provides Newstar Meta-aramid, an aromatic polyamide fiber, which is used in aerospace, high-speed trains, firefighter apparels, training uniforms, work wear, environmental protection, industrial high-temperature materials, automobile hoses, senior sound dampers, electrical insulation, and other areas. In addition, the company offers Taparan Para-aramid fibers for use in various applications, including rubber tube structures, strengthening fabrics, tire cords, packing, sealing, optical cable reinforcement, etc.; Tametar anti-static fibers for use in 3T fabric, industrial filtration, and anti-static fabric applications; and Metastar Aramid papers. The company was formerly known as Yantai Spandex Co., Ltd. and changed its name to Yantai Tayho Advanced Materials Co., Ltd. in September 2011. Yantai Tayho Advanced Materials Co., Ltd. was incorporated in 1993 and is based in Yantai, China.",
    "website": "http://www.tayho.com.cn",
    "zipcode": "264006"
  },
  "002290.SZ": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Suzhou Hesheng Special Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SUZHOU HESHENG SPE",
    "state": null,
    "summary": "Suzhou Hesheng Special Material Co., Ltd. produces and sells composite materials for household appliances in China and internationally. The company offers polyethylene terephthalate composite materials for use in appliances, including refrigerators, water heaters, air conditioners, microwave ovens, washing machines, range hoods, etc.; and decorative products, such as yacht and train interiors. It also provides VCM and PCM composite materials. Suzhou Hesheng Special Material Co., Ltd. is based in Suzhou, China.",
    "website": "http://www.szhssm.com.cn",
    "zipcode": "215121"
  },
  "002297.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hunan Boyun New Materials Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUNAN BOYUN NEW MA",
    "state": null,
    "summary": "Hunan Boyun New Materials Co.,Ltd researches, develops, produces, and sells powder metallurgy composite materials in China. The company offers carbon/carbon composite and powder metallurgy products for use in aviation, aerospace, railway, automotive, metallurgy, chemical, shipbuilding, and construction machinery and other fields. It also provides powder metallurgy equipment. The company also exports its products to Southeast Asia, Russia, and other CIS countries. Hunan Boyun New Materials Co.,Ltd is based in Changsha, China.",
    "website": "http://www.hnboyun.com.cn",
    "zipcode": "410205"
  },
  "002324.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shanghai Pret Composites Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI PRET COMP",
    "state": null,
    "summary": "Shanghai PRET Composites Co., Ltd. researches, develops, produces, and sells modified plastic products primarily for automobiles in China. The company offers toughened, reinforced, and filling modified polypropylene; high impact-resisting, medium heat-resisting and impact-resisting, high heat-resisting, low-gloss, electroplating grade, and blow molding grade acrylonitrile-butadiene-styrene (ABS); and weather resistance, low-gloss, conventional, electroplating, and high-flow polycarbonate and ABS, as well as liquid crystal polymers and other materials. It also serves communication, engineering, electrical, and other industries. The company was founded in 1993 and is based in Shanghai, China.",
    "website": "http://www.pret.com.cn",
    "zipcode": "201707"
  },
  "002326.SZ": {
    "city": "Linhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zhejiang Yongtai Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG YONGTAI T",
    "state": null,
    "summary": "Zhejiang Yongtai Technology Co.,Ltd. engages in the research and development, manufacture, and sale of fluorinated aromatic chemicals in China. It offers intermediates of cardiovascular, anti-diabetes, nervous system, anti-infection, and anti-virus pharmaceuticals, as well as pharmaceutical raw materials and preparations; agrochemical products, such as fluorinated intermediates of herbicides, fungicides, and insecticides; and electric chemical products, which include fluorinated monocrystal intermediates, lithium hexafluorophospate, and lithium bisimide for lithium batteries, as well as monocrystals and color filters for tablet display, etc. The company also provides APIs; and engages in the wholesale and retail of pesticide formulations. It serves chemical sub-industries, such as liquid crystals, pharmaceuticals, agrochemicals, etc. The company also sells its products to the United States, the European Union, Japan, and India. Zhejiang Yongtai Technology Co.,Ltd. was founded in 1999 and is headquartered in Linhai, China.",
    "website": "http://www.yongtaitech.com",
    "zipcode": "3107016"
  },
  "002411.SZ": {
    "city": "Nantong",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "YanAn Bicon Pharmaceutical Listed Company",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "YANAN BICON PHARMA",
    "state": null,
    "summary": "YanAn Bicon Pharmaceutical Listed Company researches and develops, produces, and sells pharmaceutical intermediates, pesticide intermediates, and new energy and materials products in China. It offers medical products under the Weizheng and DoctorBaby brands. The company also provides lithium hexafluorophate, a material of lithium battery electrolytes for use in anti-cutting gloves, and military and defense equipment, as well as aerospace composites, ocean vessels, naval vessel ropes, deep-sea fishing trawls, deep-sea anti-wave cages, sports equipment supplies, construction engineering reinforcements, and other high performance composites. In addition, it offers drug intermediates, such as 7-ADCA; trichloropyridin-2-Ol sodium; 5,5-dimethylhydantoin; and benzaldehyde. The company was formerly known as JiangSu Bicon Pharmaceutical Listed Company and changed its name to YanAn Bicon Pharmaceutical Listed Company in October 2018. YanAn Bicon Pharmaceutical Listed Company was founded in 2007 and is based in Nantong, China.",
    "website": "http://www.jjjkj.com.cn",
    "zipcode": null
  },
  "002440.SZ": {
    "city": "Shangyu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zhejiang Runtu Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG RUNTU CO.",
    "state": null,
    "summary": "Zhejiang Runtu Co., Ltd. produces and sells dyes in China. It provides approximately 300 types of chemicals in dye, pigment, and additive categories. The company offers disperse, reactive, direct, blend, cationic, and vat dyes; and chemical intermediate products, textile auxiliaries, sodium hydrosulfite, sulfuric acid, and chlorinate alkali. It provides its products under the RUNTU, LONGYU, DRAGONPERS, RUIHUAZOL, and JIACHEN brand names. The company also exports its products. The company was founded in 1986 and is based in Shangyu, China.",
    "website": "http://www.runtuchem.com",
    "zipcode": "312300"
  },
  "002453.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Great Chinasoft Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GREAT CHINASOFT TE",
    "state": null,
    "summary": "Great Chinasoft Technology Co.,Ltd. operates as a financial technology company. It offers next generation banking solutions, intelligent product fusion solutions, enterprise mobility solutions, and open solutions. The company was formerly known as Suzhou Tianma Specialty Chemicals Co., Ltd. and changed its name to Great Chinasoft Technology Co.,Ltd. in June 2018. Great Chinasoft Technology Co.,Ltd. was founded in 1993 and is headquartered in Beijing, China.",
    "website": "http://www.gcstgroup.com",
    "zipcode": null
  },
  "002460.SZ": {
    "city": "Xinyu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Ganfeng Lithium Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "GANFENG LITHIUM CO",
    "state": null,
    "summary": "Ganfeng Lithium Co., Ltd. manufactures and sells lithium products in Mainland China, Hong Kong, rest of Asia, the European Union, North America, and internationally. It operates through three segments: Lithium Metal and Compound, Lithium Battery, and Lithium Ore Resource and Others. The company has interests in the Mount Marion mine located in Australia; Cauchari-Olaroz project situated in Jujuy Province, Northwest Argentina; Mariana project located in the Andes Mountains in Salta Province, Argentina; Sonora project situated in Mexico; Pilbara Pilgangoora lithium-tantalum project located in Western Australia; Ningdu Heyuan mine situated in Ningdu County, Ganzhou City, Jiangxi Province; and Avalonia project located in Ireland. It offers battery grade lithium carbonate, battery-grade lithium hydroxide, lithium chloride, butyl lithium, and lithium fluoride; lithium metals in the form of ingots, foils, rods, particles, alloy powder; polymer lithium battery; and lithium-ion motive power batteries, energy storage batteries, and consumer batteries, as well as copper lithium or lithium aluminum alloy foil. The company also explores for and sells lithium ores; and provides lithium battery recycling solutions. Its products are used in the manufacturing of electric vehicles, portable electronics, chemicals, and pharmaceuticals, as well as used by battery cathode materials manufacturers, battery suppliers, and automobile original equipment manufacturers. Ganfeng Lithium Co., Ltd. was founded in 2000 and is based in Xinyu, China.",
    "website": "http://www.ganfenglithium.com",
    "zipcode": "338000"
  },
  "002476.SZ": {
    "city": "Dongying",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shandong Polymer Biochemicals Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG POLYMER B",
    "state": null,
    "summary": "Shandong Polymer Biochemicals Co., Ltd., together with its subsidiaries, produces and sells oilfield chemicals in China and internationally. The company offers monomers, surfactants, and polymers. It is also involved in oil and gas engineering technology services; oil and gas exploration and development; and environmental water treatment businesses. The company was founded in 1996 and is based in Dongying, China.",
    "website": "http://www.slcapam.com",
    "zipcode": "257081"
  },
  "002493.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Rongsheng Petrochemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "RONGSHENG PETRO CH",
    "state": null,
    "summary": "Rongsheng Petrochemical Co., Ltd. produces, markets, and sells petrochemicals, chemical fibers, and other related products in China and internationally. It offers synthetic fibers and films, including fiber and film grade polyester chips, bottle grade polyester chips, polyester pre-oriented yarns, draw textured yarns, fully drawn yarns, and PET films; synthetic raw materials, such as purified terephthalic acids, ethylene oxides, triethylene glycol, diethylene glycol, ethylene glycol, and P-xylene; and synthetic resins comprising ethylene-vinyl acetate copolymers, high density polyethylene, low-density polyethylene, and polypropylene. The company also provides olefins consisting of butene-1, hexene-1, butadiene, propylene, and ethylene; aromatics and phenols, including cumene, acetone, phenol, styrene, ethylbenzene, xylene, mixed aromatics, methylbenzene, and purified petroleum benzine; and acrylonitrile and special chemical products, such as dimethyl carbonate, methyl methacrylate, polycarbonate, bisphenol A, acetonitrile, and acrylonitrile. In addition, it offers intermediate and chemical raw materials comprising iso-butane, n-butane, petroleum cokes, liquid argons, liquid ammonia, methanol, liquid petroleum gas, isooctane, methyl tert-butyl ether, industrial hexane, pentane foamer, industrial aromatic hydrocarbons, high-flash aromatic naphthas, ethylene bottom oils, splitting decomposition C9 and C5, and sulphur; and oil products, such as jet fuels, diesel, and gasoline. The company was formerly known as Rongsheng Chemical Fiber Group Co., Ltd. and changed its name to Rongsheng Petrochemical Co., Ltd. in September 2007. The company was founded in 1995 and is based in Hangzhou, China. Rongsheng Petrochemical Co., Ltd. is a subsidiary of Zhejiang Rongsheng Holding Group Co., Ltd.",
    "website": "http://www.cnrspc.com",
    "zipcode": "311247"
  },
  "002549.SZ": {
    "city": "Yueyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hunan Kaimeite Gases Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUNAN KAIMEITE GAS",
    "state": null,
    "summary": "Hunan Kaimeite Gases Co., Ltd. produces and sells industrial gases in China. It engages in the research, development, production, and sale of dry ice, liquid additive, liquid carbon dioxide, methane, oxygen, nitrogen, hydrogen, argon, helium, and other industrial gases that are widely used in beverage, metallurgy, food, tobacco, petroleum, agriculture, chemical, electronics, and other fields. The company was founded in 1991 and is based in Yueyang, China.",
    "website": "http://www.china-kmt.com",
    "zipcode": "414003"
  },
  "002584.SZ": {
    "city": "Shantou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Xilong Scientific Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XILONG SCIENTIFIC",
    "state": null,
    "summary": "Xilong Scientific Co., Ltd. researches and develops, manufactures, and sells chemical reagents in China. The company offers chemical reagents, PCB reagents, high purity reagents, food additives, active pharmaceutical and chemical materials, and lab glassware products. It also exports its products. The company was formerly known as Xilong Chemical Co., Ltd. and changed its name to Xilong Scientific Co., Ltd. in December 2015. Xilong Scientific Co., Ltd. was founded in 1983 and is based in Shantou, China.",
    "website": "http://www.xlhg.com.cn",
    "zipcode": "510663"
  },
  "002597.SZ": {
    "city": "Chuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Anhui Jinhe Industrial Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "ANHUI JINHE INDUST",
    "state": null,
    "summary": "Anhui Jinhe Industrial Co., Ltd. engages in the research, development, production, and sale of fine and basic chemical products. Its products include acesulfame potassium, maltol, ethyl maltol, methyl cyclopentenolone, and sucralose; and basic chemical products, such as liquid ammonia, nitric acid, sulfuric acid, formaldehyde, melamine, pentaerythritol, diketene, neopentyl glycol, and pharmaceutical intermediates. The company's products are used in food, beverage, tobacco, brewery, cosmetics, and pharmaceuticals industries. Anhui Jinhe Industrial Co., Ltd. is based in Chuzhou, the People's Republic of China.",
    "website": "http://www.lajingda.com",
    "zipcode": "239200"
  },
  "002637.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zanyu Technology Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG ZANYU TEC",
    "state": null,
    "summary": "Zanyu Technology Group Co., Ltd., together with its subsidiaries, engages in the research and development, manufacture, and sale of surfactants and oleo chemicals in China and internationally. The company offers stearic acid glycol ester, disodium laureth sulfosuccinate, fatty acid methyl ester sulfonic acid, alkylbenzene sulfonic acid, sodium linear alpha olefin sulfonate, sodium and ammonium lauryl sulfate, sodium and ammonium lauryl ether sulfate, and cocamidopropyl and dodecyl dimethyl betaine. It also provides coco fatty diethanol amide, cocofatty acid monoethanol amide, synthetic leather fatliquoring agents, sulphonated oil SHO and SS, condensed phospholipin, POE fatty acid monoethanol amide ether, leather degreasing agents, and guar hydroxy propyl dimethyl. In addition, it offers third-party testing services on food safety, environment, occupational health, and others. The company was formerly known as Zhejiang Zanyu Technology Co., Ltd. and changed its name to Zanyu Technology Group Co., Ltd. in November 2016. Zanyu Technology Group Co., Ltd. was founded in 1965 and is headquartered in Hangzhou, China.",
    "website": "http://www.zzytech.com",
    "zipcode": "310030"
  },
  "002643.SZ": {
    "city": "Yantai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Valiant Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "VALIANT CO LTD",
    "state": null,
    "summary": "Valiant Co., Ltd. produces and sells chemical materials in China and internationally. It offers liquid crystal singles, which include alkenes, biphenyl, cyclohexane benzene, esters, and other fluoro-containing compounds; and liquid crystal intermediates comprising phenol, cyclohexanone, benzoic acids, cyclohexane acids, and halogenated aromatics structures, as well as PI monomers, PR monomers, organic light-emitting diode materials, and other fine chemicals. The company also provides molecular sieve, a material for use in the petroleum industry; and health-care materials, such as APIs and intermediates; and customized products. In addition, it offers LCD intermediates, OPC materials, and polyimide intermediates; and life sciences, fine chemicals, and diagnostics products. The company was formerly known as Yantai Valiant Fine Chemicals Co., Ltd. and changed its name to Valiant Co., Ltd. in May 2015. Valiant Co., Ltd. was founded in 1992 and is headquartered in Yantai, China.",
    "website": "http://www.valiant-cn.com",
    "zipcode": "264006"
  },
  "002675.SZ": {
    "city": "Yantai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Yantai Dongcheng Pharmaceutical Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "YANTAI DONGCHENG B",
    "state": null,
    "summary": "Yantai Dongcheng Pharmaceutical Group Co.,Ltd., together with its subsidiaries, engages in the manufacture and sale of biochemical API products in China. It offers heparin, chondroitin sulphate, and glucosamine series products, as well as marine collagen, hyaluronic acid, heparinoid, and cytochrome C for use in the therapeutic areas of cardiovascular, oncology, orthopaedics, anti-infection, etc. The company also exports its products to approximately 50 countries and regions, including the United States, Germany, Austria, Japan, etc. Yantai Dongcheng Pharmaceutical Group Co.,Ltd. was founded in 1998 and is based in Yantai, China.",
    "website": "http://www.dcb-group.com",
    "zipcode": "264006"
  },
  "002748.SZ": {
    "city": "Leping",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Jiangxi Selon Industrial Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGXI SELON INDU",
    "state": null,
    "summary": "Jiangxi Selon Industrial Co., Ltd. researches, develops, produces, markets, and sells fine chemicals in China, Hong Kong, Macao, and Taiwan. It offers AC foaming agents, thionyl chloride, chlor-alkali, and other chemical products, as well as industrial sodium hydroxide, liquid chlorine, synthetic hydrochloric acid, and aqueous ammonia. The company also exports its products to approximately 10 countries, including Southeast Asia, South Korea, Turkey, Italy, the United States, etc. Jiangxi Selon Industrial Co., Ltd. was founded in 2003 and is based in Leping, China.",
    "website": "http://www.chinaselon.com.cn",
    "zipcode": "333314"
  },
  "002802.SZ": {
    "city": "Wuxi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Wuxi Honghui New Materials Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "WUXI HONGHUI NEW M",
    "state": null,
    "summary": "Wuxi Honghui New Materials Technology Co., Ltd. engages in the research and development, manufacture, and sale of copolymer and terpolymer resins of vinyl chloride and vinyl acetate, vinyl chloride terpolymer emulsion, and other modified water-based series worldwide. It offers vinyl copolymer, carboxyl modifed vinyl terpolymer, ester-soluble vinyl copolymer, and hydroxyl modified vinyl terpolymer resins; acrylic emulsion, water-based acrylic resins, epoxy emulsion, vinyl chloride copolymer emulsion, and epoxy hardener resins; and PVC functional modifier resins. The company's products are used in inks, coatings, plastic processing, magnetic record materials, adhesion, etc. The company was founded in 2001 and is based in Wuxi, China.",
    "website": "http://www.wuxihonghui.com",
    "zipcode": null
  },
  "002805.SZ": {
    "city": "Zaozhuang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shandong Fengyuan Chemical Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG FENGYUAN",
    "state": null,
    "summary": "Shandong Fengyuan Chemical Co.,Ltd. develops, produces, and sells industrial oxalic acid, refined oxalic acid, and oxalate products in China and internationally. It also provides industrial sodium nitrate, nitric acid, electronic grade oxalic acid, potassium tetrasodium oxalate, potassium oxalate, and lithium iron phosphate. Shandong Fengyuan Chemical Co.,Ltd. was founded in 2000 and is based in Zaozhuang, China.",
    "website": "http://www.fengyuanhuaxue.com",
    "zipcode": "277400"
  },
  "002895.SZ": {
    "city": "Fuquan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Guizhou Chanhen Chemical Corporation",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUIZHOU CHANHEN CH",
    "state": null,
    "summary": "Guizhou Chanhen Chemical Corporation produces and markets phosphate products in China. The company offers industrial grade and food grade phosphoric acids, monocalcium phosphate feed additives, phosphorus gypsum building materials, and fire protective ammonium phosphate and polyphosphate products. It also provides fertilizers, such as ammonium polyphosphate, customized specification, ammonium phosphate, monoammonium phosphate, and monopotassium phosphate products. The company was founded in 2002 and is based in Fuquan, China.",
    "website": "http://www.chanphos.com",
    "zipcode": null
  },
  "002971.SZ": {
    "city": "Yichang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hubei Heyuan Gas Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUBEI HEYUAN GAS C",
    "state": null,
    "summary": "Hubei Heyuan Gas Co.,Ltd. engages in the gas production and sale, and industrial tail gas recovery and purification businesses in China. The company offers medical oxygen, industrial oxygen, food nitrogen, industrial nitrogen, argon, hydrogen, helium, mixed gas, natural gas, carbon dioxide, acetylene, propane, and other liquid, and gaseous products. Its products are used in chemical, food, energy, lighting, home appliance, steel, machinery, agriculture, photovoltaic, telecommunication, electronic, and medical industries. The company was founded in 2003 and is headquartered in Yichang, China.",
    "website": "http://www.hbhy-gas.com",
    "zipcode": null
  },
  "002986.SZ": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Hunan Yussen Energy Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUNAN YUSSEN ENERG",
    "state": null,
    "summary": "Hunan Yussen Energy Technology Co., Ltd., a petrochemical company, manufactures and sells acetate solvents in China. It offers sec-butyl acetate, MTBE, and isooctane products. The company was founded in 2009 and is based in Changsha, China.",
    "website": "http://www.yussen.com.cn",
    "zipcode": "410000"
  },
  "003017.SZ": {
    "city": "Jiande",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zhejiang Dayang Biology Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG DAYANG BI",
    "state": null,
    "summary": "Zhejiang Dayang Biology Technology Co.,Ltd. engages in research and development, production, and sale of biological products, agricultural chemicals, and chemical in China and internationally. The company's products include food additive potassium carbonate, potassium carbonate, food additive potassium bicarbonate, potassium bicarbonate, agricultural grade ammonium chloride, and industrial grade ammonium chloride. It also offers chemical products, such as 2-chloro-6-fiuorobenzaldehyde, 2-chloro-6-fluorobenzyl chloride, and anisole products; veterinary APIs, including amprolium HCL; and veterinary drug premixes comprising enramycin premixes. The company was founded in 1976 and is based in Jiande, China.",
    "website": "http://www.dyhg.com",
    "zipcode": "311616"
  },
  "003022.SZ": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Levima Advanced Materials Corporation",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "LEVIMA ADVANCED MA",
    "state": null,
    "summary": "Levima Advanced Materials Corporation engages in the research and development, manufacture, and sale of advanced materials and specialty chemicals. It offers high-end EVA copolymers, customized polypropylene materials, ethylene oxide, ethylene oxide derivatives, etc., as well as polycarboxylate water reducers and nonionic surfactants. The company's products are used in plastics, photovoltaic, cables, household chemicals, textiles, building construction, roads and bridges, leather, painting, and other fields. It sells its products to China, the United States, Europe, Africa, Southeast Asia, etc. The company also provides pre-sale, technical support, logistics, and after-sales services. Levima Advanced Materials Corporation is based in Beijing, China.",
    "website": "http://www.levima.cn",
    "zipcode": "100190"
  },
  "0609.HK": {
    "city": "Weifang",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Chemicals",
    "long_name": "Tiande Chemical Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "TIANDE CHEMICAL",
    "state": null,
    "summary": "Tiande Chemical Holdings Limited, an investment holding company, engages in the research, development, manufacture, sale, and distribution of fine chemical products in the People's Republic of China, India, the United States, Spain, Taiwan, and internationally. Its principal products include sodium cyanide, cyanoacetic acid and cyanoacetates, malonates, diethyl ethoxymethylenemalonate, EDTA acids and salts, mono chloroacetic acid and derivatives, ethanol, tert-butanol, cyanoacrylate monomers, and related by-products. The company also engages in the research and development, manufacture, and sale of medical instrument products; and manufacture and sale of adhesive products. Its products are used in synthesis of pharmaceutical products, pesticides, adhesive products, sealants, essences, aromatics, etc. The company was founded in 1997 and is headquartered in Weifang, the People's Republic of China. Tiande Chemical Holdings Limited is a subsidiary of Cheerhill Group Limited.",
    "website": "http://www.tdchem.com",
    "zipcode": "261061"
  },
  "0954.HK": {
    "city": "Changzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Chemicals",
    "long_name": "Changmao Biochemical Engineering Company Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "CHANGMAO BIO",
    "state": null,
    "summary": "Changmao Biochemical Engineering Company Limited, together with its subsidiaries, produces and sells organic acids for food additive, chemical, and pharmaceutical industries in Mainland China, Europe, the Asia Pacific, the United States, and internationally. Its products include fumaric acid, maleic acid, L-malic acid, D-malic acid, DL-malic acid, L(+)-tartaric acid, D(-)-tartaric acid, DL-tartaric acid, L-aspartic acid, and aspartame used as food additives, pharmaceutical adjuvant, and active pharmaceutical ingredient, etc. The company is also involved in the research and development of medicine and nutraceutical products; production and sale of food additives; trading of organic acids; and property holding activities. Changmao Biochemical Engineering Company Limited was founded in 1992 and is headquartered in Changzhou, the People's Republic of China.",
    "website": "http://www.cmbec.com.hk",
    "zipcode": "213034"
  },
  "1772.HK": {
    "city": "Xinyu",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Chemicals",
    "long_name": "Ganfeng Lithium Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "GANFENGLITHIUM",
    "state": null,
    "summary": "Ganfeng Lithium Co., Ltd. manufactures and sells lithium products in Mainland China, Hong Kong, rest of Asia, the European Union, North America, and internationally. It operates through three segments: Lithium Metal and Compound, Lithium Battery, and Lithium Ore Resource and Others. The company has interests in the Mount Marion mine located in Australia; Cauchari-Olaroz project situated in Jujuy Province, Northwest Argentina; Mariana project located in the Andes Mountains in Salta Province, Argentina; Sonora project situated in Mexico; Pilbara Pilgangoora lithium-tantalum project located in Western Australia; Ningdu Heyuan mine situated in Ningdu County, Ganzhou City, Jiangxi Province; and Avalonia project located in Ireland. It offers battery grade lithium carbonate, battery-grade lithium hydroxide, lithium chloride, butyl lithium, and lithium fluoride; lithium metals in the form of ingots, foils, rods, particles, alloy powder; polymer lithium battery; and lithium-ion motive power batteries, energy storage batteries, and consumer batteries, as well as copper lithium or lithium aluminum alloy foil. The company also explores for and sells lithium ores; and provides lithium battery recycling solutions. Its products are used in the manufacturing of electric vehicles, portable electronics, chemicals, and pharmaceuticals, as well as used by battery cathode materials manufacturers, battery suppliers, and automobile original equipment manufacturers. Ganfeng Lithium Co., Ltd. was founded in 2000 and is based in Xinyu, China.",
    "website": "http://www.ganfenglithium.com",
    "zipcode": "338000"
  },
  "1907.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Chemicals",
    "long_name": "China Risun Group Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA RISUN GP",
    "state": null,
    "summary": "China Risun Group Limited, together with its subsidiaries, produces, sells, and distributes coke, coking chemicals, and refined chemicals in the People's Republic of China. The company operates through four segments: Coke and Coking Chemicals Manufacturing, Refined Chemicals Manufacturing, Operation Management, and Trading. Its coking and refined chemical products include benzene, industrial naphthalene phthalic anhydride, coke oven gas methanol, coal-tar pitch, caprolactam, anthracene oil, xylene, cyclohexane, and carbon black oil. The company also offers operation management service to the third-party coke and chemical companies, as well as training on safety management and operational skills services. In addition, it trades in coal, coke, and refined chemical products; purchases and sells coal, coke, and coking by-products; and offers information technology service. The company serves iron and steel, non-ferrous metals, and coking and chemical industries. It also exports its products. The company was formerly known as China Risun Coal Chemicals Group Limited and changed its name to China Risun Group Limited in July 2018. China Risun Group Limited was founded in 1995 and is headquartered in Beijing, China.",
    "website": "http://www.risun.com",
    "zipcode": "100070"
  },
  "300121.SZ": {
    "city": "Liaocheng",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shandong Yanggu Huatai Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG YANGGU HU",
    "state": null,
    "summary": "Shandong Yanggu Huatai Chemical Co., Ltd. operates in the rubber chemicals industry in China. Its products include standard rubber chemicals, including retarders, accelerators, anti-reversion curing accelerators, insoluble sulfurs, and sulfur donors; and pre-dispersed rubber chemicals, such as retarders, curatives, accelerators, blowing agents, metal oxides, curing activators, antioxidants, and bonding systems for rubber to cord adhesion. The company also provides processing promoters comprising chemical peptizers, zinc soap processing aids, homogenizing and dispersing resins, smell free reclaim agents, zinc free processing aids, and resorcinol-formaldehyde resins; rubber protection waxes and anti-ozonants, including micro-waxes; and release agents for the rubber industry, such as batch off release agents for sheets, and water based inside and outside paints. In addition, it produces and sells rubber anti-scorcher CTP, rubber accelerator NS, rubber accelerator CBS, rubber accelerator M, and other rubber chemicals; and imports and exports rubber chemicals. Shandong Yanggu Huatai Chemical Co., Ltd. was founded in 1994 and is based in Liaocheng, China.",
    "website": "http://en.yghuatai.com",
    "zipcode": "252300"
  },
  "300169.SZ": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Changzhou Tiansheng New Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CHANGZHOU TIANSHEN",
    "state": null,
    "summary": "Changzhou Tiansheng New Materials Co., Ltd., together with its subsidiaries, researches, develops, produces, and sells polymer foam materials in China. It offers structural foam materials primarily for use in wind power generation, railway transportation, yacht, aerospace, energy-efficient buildings, and other industries; and soft foam materials, such as plastic and rubber material for use in various industries, including electronics, home appliances, automobiles, sports and leisure, and other industries. The company also provides products by post-processing of soft foam materials for use in mobile phones, air-conditioners, televisions, automobile parts, and plastic floors, as well as fan blades, cabin covers, train carriages, hull materials, aircraft materials, insulating curtain walls, and other areas. In addition, the company offers sound barrier materials; supporting tapes and protective films; PVC structural foam material for recreational vehicles; and porcelain coatings for use in building curtain walls and rail transit fields. Changzhou Tiansheng New Materials Co., Ltd. was founded in 1998 and is based in Changzhou, China.",
    "website": "http://www.tschina.com",
    "zipcode": "213028"
  },
  "300180.SZ": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Huafon Microfibre (Shanghai) Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUAFON MICROFIBRE",
    "state": null,
    "summary": "Huafon Microfibre (Shanghai) Co., Ltd. develops, manufactures, markets, and sells microfiber leather in China. It offers microfiber base, a non-woven microfiber fabric; microfiber leather; and microfiber suede. The company's products are used in leather sports shoes, casual shoes, labor protective gloves, motor function of the protective gears, balls, high-end cleaning products, sofas, furniture, and wall decors, as well as cars, trains, aircraft seats, and other fields. The company was founded in 2002 and is based in Shanghai, China. Huafon Microfibre (Shanghai) Co., Ltd. is a subsidiary of Huafon Group Co., Ltd.",
    "website": "http://microfibre.huafeng.com",
    "zipcode": "201508"
  },
  "300196.SZ": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Jiangsu Changhai Composite Materials Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU CHANGHAI C",
    "state": null,
    "summary": "Jiangsu Changhai Composite Materials Co., Ltd engages in the scientific research, development, production, sale, and service of fiberglass-based composite materials. It offers reinforcements, including printed circuit board tissues; assembled, panel, SMC, and woven rovings; rovings for chopped strand mats and pultrusion; fiberglass wet chopped strands; coated tissue for polyurethane foams; woven meshes; chopping rovings for headliners; light weight chopped strand mats; and chopped strand mats. The company also provides non-woven technologies, such as coated tissues for gypsum sheathing; battery separator, wall covering, carpet tiles, pipe, and roofing tissues; and surfacing veils, as well as batter separators. In addition, it offers chemical products comprising hydroxyproyl methacrylate, hydroxyethyl methacrylate, hydroxypropyl acrylate, and hydroxyethyl acrylate. The company provides its products for various applications in automobile manufacturing, yachts, private facilities, storage tanks, pipeline coatings, cooling towers, architectural decoration, and others. It sells its products in approximately 30 countries and regions, including China, North America, South America, Europe, the Middle East, the Southeast Asia, the Oceania, Africa, and others. Jiangsu Changhai Composite Materials Co., Ltd was founded in 2000 and is based in Changzhou, China.",
    "website": "http://www.changhaigfrp.com",
    "zipcode": null
  },
  "300233.SZ": {
    "city": "Zibo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shandong Jincheng Pharmaceutical Group Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONGJINCHENG P",
    "state": null,
    "summary": "Shandong Jincheng Pharmaceutical Group Co., Ltd, together with its subsidiaries, engages in the research and development, production, and sale of III, IV Cephalosporin intermediates in the People's Republic of China. It offers characteristic bulk drugs, pharmaceutical intermediates, and fine chemicals. The company was formerly known as Shandong Jincheng Pharmaceutical Co., Ltd. and changed its name to Shandong Jincheng Pharmaceutical Group Co., Ltd in May 2017. Shandong Jincheng Pharmaceutical Group Co., Ltd was founded in 2004 and is based in Zibo, the People's Republic of China.",
    "website": "http://www.jinchengpharm.com",
    "zipcode": null
  },
  "300343.SZ": {
    "city": "Zibo",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Lecron Industrial Development Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "LECRON INDUSTRIAL",
    "state": null,
    "summary": "Lecron Industrial Development Group Co., Ltd. manufactures and sells chemical products. The company's products include monomer polyether polyol, system polyol for polyurethane foam, polyurethane prepolymer for elastomer, polyurea waterproof and anti-corrosion materials, medical intermediate, the third generation polycarboxylic acid water reducer monomer, surfactant, high boiling point solvent, polyurethane fireproof insulation panel, etc. Its products are used in various applications, including construction thermal insulation, pre-insulated pipes, sandwich panels, solar water heaters, household appliances, and automobiles. The company was formerly known as Lecron Internet Media Industry Co., Ltd. and changed its name to Lecron Industrial Development Group Co., Ltd. in July 2019. Lecron Industrial Development Group Co., Ltd. was founded in 2003 and is based in Zibo, China.",
    "website": "http://www.lecron.cn",
    "zipcode": "255000"
  },
  "300405.SZ": {
    "city": "Liaoyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Liaoning Kelong Fine Chemical,Inc.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "LIAONING KELONG FI",
    "state": null,
    "summary": "Liaoning Kelong Fine Chemical, Inc. manufactures and sells fine chemicals worldwide. The company offers polycarboxylate concrete admixture products, including polycarboxylate-based superplasticizers, slump retaining agents, and slump and water retaining admixtures, as well as polycarboxylate-based superplasticizers in powder forms; and polycarboxylate macro monomer products comprising polyether monomers, polyoxyethylene monoallyl ethers, and methoxy polyethylene glycol methacrylate. It also provides glycol ether products consisting of 2-phenoxyethanol and 1-phenoxy-2-propanol; and auxiliaries of textiles, such as hydrogen peroxide stabilizers, hydrophilic modifiers for amino silicon oils, and synthetic fiber hydrophilic finishing agents. In addition, the company offers polyethylene glycol monomethyl ether, hydrophilic polyester copolymer, castor oil ethoxylate, phosphate ester, polyoxyalkylene glycol/polyether, hydrophilic amino silicone oil, polyethylene glycol, sorbitan oleate and laurate, sorbitan stearate and trioleate, fatty alcohol and nonyl phenol ethoxylate, isotridecanol ethoxylate, and polyglycol glycidic ether condensation products; polyoxyethylene sorbitan monooleate, monolaurate, monostearate, and trioleate; and polyethylene glycol monooleate, monolaurate, and monostearate. Its polycarboxylate superplasticizers, cutting fluids, paint additives, and concrete admixtures are used in various areas, such as daily chemicals, pharmacy, textile printing, etc. The company was founded in 1988 and is based in Liaoyang, China.",
    "website": "http://www.kelongchem.com",
    "zipcode": null
  },
  "300481.SZ": {
    "city": "Puyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Puyang Huicheng Electronic Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "PUYANG HUICHENG EL",
    "state": null,
    "summary": "Puyang Huicheng Electronic Material Co., Ltd. engages in the research, production, and trade of acid anhydrides and other functional material intermediates in China. The company's acid anhydride products include tetrahydrophthalic, hexahydrophthalic, methyltrahydrophthalic, methylhexahydrophthalic, nadic, methyl nadic, and other anhydrides. It also offers esters, acids, amines, and other products. The company's products are used in painting and dye, plastic, military and electric power, and electronic information industries, as well as in medicines, pesticides, paints, fuels, petrochemicals, and other materials. It also exports its products to Europe, the United States, and Southeast Asia. The company was formerly known as Puyang Huicheng Chemical Co., Ltd. and changed its name to Puyang Huicheng Electronic Material Co., Ltd. in August 2011. Puyang Huicheng Electronic Material Co., Ltd. was founded in 2002 and is based in Puyang, China.",
    "website": "http://www.huichengchem.com",
    "zipcode": "457001"
  },
  "300487.SZ": {
    "city": "Xi'an",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Sunresin New Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SUNRESIN NEW MATER",
    "state": null,
    "summary": "Sunresin New Materials Co., Ltd. engages in the research and development, manufacture, and sale of specialty resins in China and internationally. The company offers ion exchange, chelating, solid phase synthesis, adsorbent, and chromatography resins; and SEPSOLUT equipment and enzyme carriers. Its products are used in food and beverage, pharmaceutical, herbal extraction, enzyme immobilization, chromatography media, membrane caustic soda, solid-phase peptide synthesis, hydrometallurgy, mining, biodiesel purification, waste water and reuse, aquarium treatment, industrial and municipal water treatment chemicals, and SEPSOLUT ion exchange system and solutions. Sunresin New Materials Co., Ltd. is headquartered in Xi'an, China.",
    "website": "http://www.sunresin.com",
    "zipcode": "710076"
  },
  "300610.SZ": {
    "city": "Baoying",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Yangzhou Chenhua New Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "YANGZHOU CHENHUA N",
    "state": null,
    "summary": "Yangzhou Chenhua New Material Co., Ltd. engages in the research, production, and sale of chemicals in China. The company's products include organophosphorus flame retardants; alkyl polyglucoside, polyether, amine-terminated polyether, and silicone oil; high temperature vulcanized silicone rubber and room temperature vulcanized silicone rubber; and waterborne polyurethane resins, rare earth organic red fluorescence materials, amino alcohol, and polyether amine. The company was founded in 1995 and is headquartered in Baoying, China.",
    "website": "http://www.chenhua.cc",
    "zipcode": "225803"
  },
  "300637.SZ": {
    "city": "Shangyu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zhejiang Yangfan New Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG YANGFAN N",
    "state": null,
    "summary": "Zhejiang Yangfan New Materials Co., Ltd. engages in the research and development, production, and sale of UV curing products, and sulfur-containing fine chemicals and related new materials worldwide. It offers thiophenol, phenyl sulfide, thioanisole, thiofuran, pyridine and aniline, sulfone and sulfoxide, and other intermediates; and photoinitiators. Zhejiang Yangfan New Materials Co., Ltd. was founded in 2002 and is based in Shangyu, China.",
    "website": "http://www.zjyfxc.com",
    "zipcode": null
  },
  "300641.SZ": {
    "city": "Zhenjiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Jiangsu Zhengdan Chemical Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU ZHENGDAN C",
    "state": null,
    "summary": "Jiangsu Zhengdan Chemical Industry Co., Ltd. researches, develops, manufactures, and sells environmental protection materials and fine chemicals in China. Its products include vinyltoluene, a mixture of m-methylstyrene and p-methylstyrene, which is used as a replacement of styrene monomer for the manufacture of unsaturated polyester resin, modified alkyd resin, vinyl resin, and others; and high-flash aromatic naphthas that is used as a solvent and diluent of environment-friendly coating and paint, as well as ingredient of printing ink, extractant for production of hydrogen peroxide, solvent for baking coating, emulsion of insecticide, solvent for rubber resin, etc. The company's products also comprise trimellitic anhydride, which is primarily used to produce plasticizers, such as trioctyl trimellitate (TOTM), polyester resin for powder coating, polyamide-imide resin for insulating varnish, water-soluble alkyd resin coating, epoxy curing agent, lubricant, etc.; TOTM, a heatproof and durable plasticizer, which is applied to vinyl chloride copolymer, nitrocellulose, ethyl cellulose and polymethyl methacrylate, etc.; and Pseudocumene that is used for synthesis of trimellitic anhydride, resin, dyes, and vitamin E, as well as solvent for paint. Jiangsu Zhengdan Chemical Industry Co., Ltd. was founded in 2007 and is based in Zhenjiang, China.",
    "website": "http://www.zhengdanchem.com",
    "zipcode": "212132"
  },
  "300699.SZ": {
    "city": "Weihai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Weihai Guangwei Composites Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "WEIHAI GUANGWEI CO",
    "state": null,
    "summary": "Weihai Guangwei Composites Co., Ltd. researches, develops, produces, and sells composites in China. It offers carbon fiber, fabric, and prepreg products; glass fiber preg; carbon fiber composite products; and other products. It also provides precision mechanism. The company's products are used in the defense and military sectors, such as aerospace, electronic communications, weapons, and other fields; and civil sector, including wind turbine blades, rail transit, nuclear power equipment, shipbuilding, major infrastructure construction, automotive parts and components, medical equipment, high-end sports and leisure goods, and other fields. The company was founded in 1992 and is based in Weihai, China.",
    "website": "http://www.gwcfc.com",
    "zipcode": "264200"
  },
  "300716.SZ": {
    "city": "Dongguan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Guangdong Guoli Sci & Tech Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG GUOLI SC",
    "state": null,
    "summary": "Guangdong Guoli Sci & Tech Co., Ltd. researches, develops, produces, sells, and services polymer materials and products in China and internationally. The company offers EVA/TPR environmental protection materials and products, modified engineering plastics, flying woven products and finished shoes, smart electronic products, and new energy vehicle new materials, as well as RB rubber and plastic materials and their products. Its products are used in sports, casual shoes, sports equipment, electronic accessories, household appliances, auto parts, smart home, intelligent education, and other fields. The company was founded in 2002 and is based in Dongguan, China.",
    "website": "http://www.guoligroup.com.cn",
    "zipcode": null
  },
  "300737.SZ": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Keshun Waterproof Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "KESHUN WATERPROOF",
    "state": null,
    "summary": "Keshun Waterproof Technology Co., Ltd. manufactures and sells waterproof coatings, bitumen membranes, adhesives, and other chemical products for building and infrastructure applications in China. The company offers synthetic polymer, self-adhesive bitumen, and torch-applied bitumen membranes; modified bitumen, polyurethane and polyuria, acrylic waterproof, and cementitious waterproof coatings, as well as waterproof materials; HDPE drainage boards; metal roofs; and waterproof systems for construction purposes. It also provides waterproof coatings, ceramic adhesive, tile grouts, water resistance putties, and other auxiliary materials and solutions for household purposes, as well as repair solutions. The company also exports its products to Singapore, Malaysia, Australia, Philippines, the Americas, etc. Keshun Waterproof Technology Co., Ltd. was founded in 1996 and is based in Foshan, China.",
    "website": "http://www.keshun.com.cn",
    "zipcode": null
  },
  "300769.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shenzhen Dynanonic Co., Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SHENZHEN DYNANONIC",
    "state": null,
    "summary": "Shenzhen Dynanonic Co., Ltd. engages in the research and development, production, and sale of nano materials in China. It offers nano-lithium iron phosphate, carbon nanotube conductive liquid, carbon nanotube, and bag graphene. The company was founded in 2007 and is headquartered in Shenzhen, China.",
    "website": "http://www.dynanonic.com",
    "zipcode": "518055"
  },
  "300777.SZ": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Sinofibers Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SINOFIBERS TECHNOL",
    "state": null,
    "summary": "Sinofibers Technology Co.,Ltd. manufactures carbon fiber. The company manufactures and sells polyacrylonitrile fibers, textile products, and other related products. The company was founded in 2008 and is headquartered in Changzhou, China.",
    "website": null,
    "zipcode": "213127"
  },
  "300796.SZ": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shaoxing BSM Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "BSM CHEMICAL CO LT",
    "state": null,
    "summary": "Shaoxing BSM Chemical Co., Ltd. engages in the research and development, and production of pesticide and medical intermediates worldwide. It offers mononitroxylene isomers and dimethylaniline series reduction products, such as 4-nitro-o-xylene, N-(1-ethylpropyl) -3,4-dimethylaniline, etc. The company is based in Hangzhou, China.",
    "website": "http://www.bsmchem.com",
    "zipcode": "201900"
  },
  "300801.SZ": {
    "city": "Zaozhuang City",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Shandong Taihe Water Treatment Technologies Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG TAIHE WAT",
    "state": null,
    "summary": "Shandong Taihe Water Treatment Technologies Co., Ltd. engages in the research and development, production, and sale of water treatment chemicals. Its products include phosphonates antiscalants, corrosion inhibitors, and chelating agents; salts of phosphonates; polycarboxylic and biodegradable antiscalants and dispersants; biocide and algicide; built scale and corrosion inhibitors and pretreatment filming agents; corrosion inhibitors; oxygen scavengers; reverse osmosis chemicals; and other products. These products are used in the applications, such as industrial circulating cooling water system in electricity, metallurgy, petrochemical industries, etc.; reverse osmosis system in seawater desalination, pure water production, etc.; and oil extraction, household, textile and dyeing, paper and pulp, ceramic, coating, electronic cleaning, sugar making, aquaculture, agriculture etc. The company is based in Zaozhuang, China.",
    "website": "http://www.thwater.net",
    "zipcode": null
  },
  "300829.SZ": {
    "city": "Zhoukou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Henan Jindan Lactic Acid Technology Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HENAN JINDAN LACTI",
    "state": null,
    "summary": "Henan Jindan Lactic Acid Technology Co., Ltd produces and sells lactic acid and lactate products in China. The company offers lactic acid, calcium lactate, sodium lactate, potassium lactate, ferrous lactate, lactic acid powder, ethyl lactate, magnesium lactate, zinc lactate, buffered lactic acid, sodium lactate and sodium di-acetate blend, and sodium lactate and potassium. It exports its products to Europe, North America, South America, Oceania, Southeast Asia, and other countries and regions. The company was founded in 1984 and is based in Zhoukou, China.",
    "website": "http://www.jindanlactic.com",
    "zipcode": "477150"
  },
  "300886.SZ": {
    "city": "Qianshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Anhui Hyea Aromas Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ANHUI HYEA AROMAS",
    "state": null,
    "summary": "Anhui Hyea Aromas Co., Ltd. engages in the research and development, production, and sale of fine chemicals. It offers aroma lactones, such as gamma-hexalactone, gamma-heptalactone, gamma-octalactone, gamma-decalactone, gamma-dodecalactone, gamma-undecalactone, gamma-nonalactone, delta-decalactone, delta-dodecalactone, 2-nonanone, gamma-valerolactone, octanolactone, and undecanoic delta-lactone. The company was founded in 2002 and is based in Qianshan, China.",
    "website": "http://www.anhuihuaye.com",
    "zipcode": "246300"
  },
  "300910.SZ": {
    "city": "Xinxiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Xinxiang Richful Lube Additive Co., Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "XINXIANG RICHFUL L",
    "state": null,
    "summary": "Xinxiang Richful Lube Additive Co., Ltd engages in the development, production, and sale of papermaking chemicals and lubricant additives in China. It offers single agent detergent, dispersant, ZDDP, and high temperature antioxidant series of products. The company also exports its products to the United States, Europe, South America, Southeast Asia, the Middle East, and other countries and regions under the Richful brand. Xinxiang Richful Lube Additive Co., Ltd was founded in 1996 and is based in Xinxiang, China.",
    "website": "http://www.sinoruifeng.com",
    "zipcode": null
  },
  "300920.SZ": {
    "city": "Huzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Zhejiang Runyang New Material Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG RUNYANG N",
    "state": null,
    "summary": "Zhejiang Runyang New Material Technology Co., Ltd. engages in the research and development, production, and sale of irradiation crosslinked polyolefin products in China, the United States, Canada, Japan, Germany, the United Kingdom, and internationally. The company offers polyethylene foams in the categories, such as WPCs and SPCs, coiled materials, and folds. Its products are used in application fields, including architecture, automobile, medical, processing craft, electronic field, mother and baby, and sports goods. The company was founded in 2012 and is based in Huzhou, China.",
    "website": "http://www.zj-runyang.com",
    "zipcode": null
  },
  "300927.SZ": {
    "city": "Nantong",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Chemicals",
    "long_name": "Nantong JiangTian Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "NANTONG JIANGTIAN",
    "state": null,
    "summary": "Nantong JiangTian Chemical Co., Ltd. manufactures and sells chemical products in China and internationally. It primarily offers paraformaldehyde; formaldehyde; methyl chloride; ethylene glycol hemiacetal; 1,3,5-triacryloylhexahydro-1,3,5-triazine; and other chemical products. The company was founded in 1999 and is based in Nantong, China.",
    "website": "http://www.ntjtc.com",
    "zipcode": "226009"
  },
  "39EA.F": {
    "city": "Xinyu",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Chemicals",
    "long_name": "Ganfeng Lithium Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "GANFENG LITHIUM  H HD1",
    "state": null,
    "summary": "Ganfeng Lithium Co., Ltd. manufactures and sells lithium products in Mainland China, Hong Kong, rest of Asia, the European Union, North America, and internationally. It operates through three segments: Lithium Metal and Compound, Lithium Battery, and Lithium Ore Resource and Others. The company has interests in the Mount Marion mine located in Australia; Cauchari-Olaroz project situated in Jujuy Province, Northwest Argentina; Mariana project located in the Andes Mountains in Salta Province, Argentina; Sonora project situated in Mexico; Pilbara Pilgangoora lithium-tantalum project located in Western Australia; Ningdu Heyuan mine situated in Ningdu County, Ganzhou City, Jiangxi Province; and Avalonia project located in Ireland. It offers battery grade lithium carbonate, battery-grade lithium hydroxide, lithium chloride, butyl lithium, and lithium fluoride; lithium metals in the form of ingots, foils, rods, particles, alloy powder; polymer lithium battery; and lithium-ion motive power batteries, energy storage batteries, and consumer batteries, as well as copper lithium or lithium aluminum alloy foil. The company also explores for and sells lithium ores; and provides lithium battery recycling solutions. Its products are used in the manufacturing of electric vehicles, portable electronics, chemicals, and pharmaceuticals, as well as used by battery cathode materials manufacturers, battery suppliers, and automobile original equipment manufacturers. Ganfeng Lithium Co., Ltd. was founded in 2000 and is based in Xinyu, China.",
    "website": "http://www.ganfenglithium.com",
    "zipcode": "338000"
  },
  "39EA.SG": {
    "city": "Xinyu",
    "country": "China",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Chemicals",
    "long_name": "Ganfeng Lithium Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "Ganfeng Lithium Co. Ltd. Regist",
    "state": null,
    "summary": "Ganfeng Lithium Co., Ltd. manufactures and sells lithium products in Mainland China, Hong Kong, rest of Asia, the European Union, North America, and internationally. It operates through three segments: Lithium Metal and Compound, Lithium Battery, and Lithium Ore Resource and Others. The company has interests in the Mount Marion mine located in Australia; Cauchari-Olaroz project situated in Jujuy Province, Northwest Argentina; Mariana project located in the Andes Mountains in Salta Province, Argentina; Sonora project situated in Mexico; Pilbara Pilgangoora lithium-tantalum project located in Western Australia; Ningdu Heyuan mine situated in Ningdu County, Ganzhou City, Jiangxi Province; and Avalonia project located in Ireland. It offers battery grade lithium carbonate, battery-grade lithium hydroxide, lithium chloride, butyl lithium, and lithium fluoride; lithium metals in the form of ingots, foils, rods, particles, alloy powder; polymer lithium battery; and lithium-ion motive power batteries, energy storage batteries, and consumer batteries, as well as copper lithium or lithium aluminum alloy foil. The company also explores for and sells lithium ores; and provides lithium battery recycling solutions. Its products are used in the manufacturing of electric vehicles, portable electronics, chemicals, and pharmaceuticals, as well as used by battery cathode materials manufacturers, battery suppliers, and automobile original equipment manufacturers. Ganfeng Lithium Co., Ltd. was founded in 2000 and is based in Xinyu, China.",
    "website": "http://www.ganfenglithium.com",
    "zipcode": "338000"
  },
  "45Y.F": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Chemicals",
    "long_name": "China Risun Group Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA RISUN GROUP  HD-,10",
    "state": null,
    "summary": "China Risun Group Limited, together with its subsidiaries, produces, sells, and distributes coke, coking chemicals, and refined chemicals in the People's Republic of China. The company operates through four segments: Coke and Coking Chemicals Manufacturing, Refined Chemicals Manufacturing, Operation Management, and Trading. Its coking and refined chemical products include benzene, industrial naphthalene phthalic anhydride, coke oven gas methanol, coal-tar pitch, caprolactam, anthracene oil, xylene, cyclohexane, and carbon black oil. The company also offers operation management service to the third-party coke and chemical companies, as well as training on safety management and operational skills services. In addition, it trades in coal, coke, and refined chemical products; purchases and sells coal, coke, and coking by-products; and offers information technology service. The company serves iron and steel, non-ferrous metals, and coking and chemical industries. It also exports its products. The company was formerly known as China Risun Coal Chemicals Group Limited and changed its name to China Risun Group Limited in July 2018. China Risun Group Limited was founded in 1995 and is headquartered in Beijing, China.",
    "website": "http://www.risun.com",
    "zipcode": "100070"
  },
  "600063.SS": {
    "city": "Chaohu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Anhui Wanwei Updated High-Tech Material Industry Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ANHUI WANWEI UPDATED HIGH-TECH ",
    "state": null,
    "summary": "Anhui Wanwei Updated High-Tech Material Industry Co.,Ltd provides chemicals, fibers, and new and building materials. The company offers polyvinyl alcohol (PVA), high-strength and high-modulus PVA fibers, PVA water-soluble fibers, PVB resins, PVA optical films, redispersible latex powder, vinyl acetate, VAE emulsion, alcohol, polyester chips, methyl acetate, cement clinker, and cement, as well as other PVA-related derivative, intermediate, and by-products. Its products are used primarily in textile, food, medicine, construction, wood processing, papermaking, printing, agriculture, metallurgy, electronics, environmental protection, and other industries. The company was founded in 1997 and is based in Chaohu, China.",
    "website": "http://www.wwgf.com.cn",
    "zipcode": "238002"
  },
  "600075.SS": {
    "city": "Shihezi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Xinjiang Tianye Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XINJIANG TIANYE CO. LTD",
    "state": null,
    "summary": "Xinjiang Tianye Co., Ltd. manufactures and sells chemical products in China and internationally. It offers various chemical products, such as ethylene glycol, butanediol, PVC resins, PVC paste resins, and caustic soda; and water savings products, including pressure compensating driplines, drip tapes with side flippers, agriculture unplasticized polyvinyl chloride (U-PVC) pipes, and PE hoses modified with nano materials. The company also provides cement products comprising silicate cement clinker, special cement, and general Portland cement products; plastic products, such as U-PVC plastic windows; PVC wood plastic building templates; polyethylene blow molding agricultural mulching films; and unplasticized polyvinyl chloride profiles for door and windows. In addition, it offers tomato paste; and package products, which include heavy packaging films, jumbo bags, and cement bags. Further, the company is involved in calcium carbide, thermoelectricity, mining, building materials, foreign trade, construction, real estate, and other businesses. Xinjiang Tianye Co., Ltd. was founded in 1996 and is based in Shihezi, China.",
    "website": "http://www.xj-tianye.com",
    "zipcode": null
  },
  "600078.SS": {
    "city": "Jiangyin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiangsu ChengXing Phosph-Chemicals Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU CHENGXING PHOSPH-CHEMIC",
    "state": null,
    "summary": "Jiangsu ChengXing Phosph-Chemicals Co., Ltd. produces, distributes, and sells fine phosphorous chemicals in China. The company offers dental, food, and technical grades phosphorous chemicals, such as dicalcium phosphate, dipotassium phosphate, disodium dihydrogen pyrophosphate, disodium phosphate dihydrate, monosodium phosphate monohydrate, phosphoric acid, potassium pyrophosphate, sodium hexametaphosphate, sodium pyrophosphate, sodium tripolyphosphate, tricalcium phosphate, and trisodium phosphate. It also provides petrochemicals. The company was founded in 1984 and is based in Jiangyin, China.",
    "website": "http://www.phosphatechina.com",
    "zipcode": "214400"
  },
  "600091.SS": {
    "city": "Baotou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Baotou Tomorrow Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "BAOTOU TOMORROW TECHNOLOGY CO L",
    "state": null,
    "summary": "Baotou Tomorrow Technology Co., Ltd. produces and sells chemical products and hardware primarily in Inner Mongolia autonomous region, China. It also develops software and provides related technical services. The company is involved in the exploitation and processing of coal; and energy industry investment and property development businesses. Baotou Tomorrow Technology Co., Ltd. was founded in 1997 and is based in Baotou, China.",
    "website": "http://www.tomotech.com",
    "zipcode": "014030"
  },
  "600135.SS": {
    "city": "Baoding",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Lucky Film Company,Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "LUCKY FILM CO",
    "state": null,
    "summary": "Lucky Film Company,Limited manufactures and sells digital photo papers in China. It also offers printing photo papers, printing photographic papers, double-sided beauty DF-1 products, wing color SA-60 papers, and sanlay series products; new energy products; solar battery backplanes; new material products; transparent conductive films; and color paper wash kit, color film wash kit, radiographic film wash kit, black and white film/paper wash kit, and photo processing chemicals. In addition, the company provides inkjet printing papers, photo crystal glue, image materials, and photovoltaic materials; and emulsion preparation, color photo paper coating, color paper finishing packaging products, rinsing process kit, and optical film coating products. Lucky Film Company,Limited was founded in 1998 and is based in Baoding, China.",
    "website": "http://gufen.luckyfilm.com.cn",
    "zipcode": "071054"
  },
  "600141.SS": {
    "city": "Yichang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Hubei Xingfa Chemicals Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HUBEI XINGFA CHEMICALS GROUP CO",
    "state": null,
    "summary": "Hubei Xingfa Chemicals Group Co., Ltd. develops, produces, and sells phosphoric products and fine chemicals in Asia, Europe, the Americas, and Africa. It offers phosphoric products, such as dicalcium phosphate, phosphoric acid, sodium tripolyphosphate and hexametaphosphate, monosodium phosphate, trisodium phosphate and disodium phosphate food grade, sodium hypophosphite, sodium monofluorophosphate, sodium monofluorophosphate toothpaste grade, tetrapotassium pyrophosphate, tetrasodium pyrophosphate, sodium trimetaphosphate, sodium acid pyrophosphate, trisodium acid pyrophosphate, monopotassium phosphate, dipotassium and tricalcium phosphate, tetrakis hydroxymethyl phosphonium sulfate, tetrakis hydroxymethyl phosphonium sulfate-urea, tetrakis hydroxymethyl phosphonium chloride, tetrakis hydroxymethyl phosphonium chloride-urea, triethylphosphate, TRIS(1-chloro-2-propyl) phosphate, and TRIS(hydroxymethyl) phosphine oxide. The company also provides pesticides; organosilicone; fertilizers; and electronic chemicals, including phosphoric and sulfuric acids EL grade, etchants, strippers, developers, and dimethyl sulfoxide. In addition, it offers basic chemicals comprising glycine, calcium and sodium hypochlorite, anhydrous calcium chloride, sodium hydroxide, phosphoric acid, phosphorus pentasulphide, yellow phosphorus, methylal, methyl chloride, phosphorus oxychloride, phosphorus trichloride, sodium hydroxide, calcium chloride dihydrate, liquid chlorine, hydrochloric and phosphorous acid, dimethyl sulfoxide, dimethyl sulfone, phosphate rocks, methyl disulfide, sodium methyl mercaptide, sodium fluorosilicate, ferrophosphorus, and dimethyl dichlorosilance. Hubei Xingfa Chemicals Group Co., Ltd. was founded in 1994 and is headquartered in Yichang, China.",
    "website": "http://www.xingfagroup.com",
    "zipcode": "443711"
  },
  "600146.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shangying Global Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGYING GLOBAL CO LTD",
    "state": null,
    "summary": "Shangying Global Co., Ltd. engages in the research and development, design, production, and sale of rigid foamed plastic panels, profiled materials, and building decoration materials in China. It also offers women's apparel. The company was formerly known as Ningxia Dayuan Chemical Co., Ltd. and changed its name to Shangying Global Co., Ltd. in August 2015. The company was founded in 1996 and is based in Shanghai, China.",
    "website": "http://www.600146.net",
    "zipcode": "200235"
  },
  "600160.SS": {
    "city": "Quzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Zhejiang Juhua Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG JUHUA CO LTD.",
    "state": null,
    "summary": "Zhejiang Juhua Co., Ltd., together with its subsidiaries, manufactures and sells fluorine chemicals products under the Juhua brand in China. Its products include ODS substitutes, fluoropolymers, fluorine-containing fine chemicals, methane chlorides, inorganic fluorochemicals, macro molecular materials, organic chemicals, fine chemicals, inorganic chemical materials, and caprolactam. The company was founded in 1998 and is based in Quzhou, China.",
    "website": "http://www.jhgf.com.cn",
    "zipcode": "324004"
  },
  "600281.SS": {
    "city": "Taiyuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Taiyuan Chemical Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TAIYUAN CHEMICAL INDUSTRIAL",
    "state": null,
    "summary": "Taiyuan Chemical Industry Co., Ltd., together with its subsidiaries, researches, develops, produces, and sells chemical products and raw materials, chemical fertilizers, coke, bio-chemical products, and fine chemicals. It also processes and sells precious metals, clothes, ready-mixed commercial concrete, and chemical products; manufactures machinery; and produces industrial water. The company is also involved in the information consultation; wholesale and retail of metal materials, steel, building materials, instruments, hardware and electrical equipment, and magnetic stainless-steel products; and anti-corrosion, thermal insulation, demolition, and installation of chemical equipment pipelines. In addition, it engages in the import, export, recycling, utilization, processing, and sale of precious metal series catalysts, catalytic nets, and rare earth high magnetic materials, as well as goods and technology and construction business. Further, the company sells electricity and offers related ancillary services. The company was founded in 1999 and is based in Taiyuan, China.",
    "website": "http://www.th600281.cn",
    "zipcode": "030021"
  },
  "600299.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Bluestar Adisseo Company",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "BLUESTAR ADISSEO COMPANY",
    "state": null,
    "summary": "Bluestar Adisseo Company engages in the research, development, production, and sale of feed additives for animal nutrition worldwide. The company's products include Rhodimet, a methionine solution for monogastric animals that is available in solid and liquid forms, such as Rhodimet NP99 and Rhodimet AT88; nutrition solutions comprising Smartamine and MetaSmart for amino acid balancing in lactating dairy cow ration formulation, as well as for dairy cows and other ruminants; and Microvit, a range of vitamins for the feed industry. It also offers Rovabio, a range of enzyme preparations that enhance the digestibility of raw materials from vegetal origin for animals, poultry, and hogs; and Selisseo 2% Se, a source of organic selenium that is based on seleno-hydroxy-methionine for use in animal feed. In addition, the company provides AdiSodium, a source of chloride-free sodium that offers a solution for dietary electrolyte balance in monogastric feeds and supplies sulphur in assimilated form to ruminant feeds; and Alterion for enhancing the animal intestinal micro ecological environment and the production performance of animal. Further, it offers PNE, a service based on NIR technology to predict the nutritional quality of the raw materials used in feed; DiM, a service and assistance program for Rhodimet AT88 applications; and E-lab, a web service that allows customers to post analytical requests and identify samples prior to shipping them to Adisseo laboratory. The company was founded in 1939 and is based in Beijing, China. Bluestar Adisseo Company is a subsidiary of China National Bluestar (Group) Co., Ltd.",
    "website": "http://www.bluestar-adisseo.com",
    "zipcode": "100029"
  },
  "600301.SS": {
    "city": "Nanning",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Nanning Chemical Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "NANNING CHEMICAL INDUSTRY CO",
    "state": null,
    "summary": "Nanning Chemical Industry Co., Ltd. manufactures and sells chlor-alkali chemical products in China. It also provides trichloroisocyanuric acid, industrial nitrogen gas, industrial oxygen, trichlorfon powder, polyvinyl chloride resin powder, hydrochloric acid, sodium hypochlorite solution, and liquid sodium hydroxide, as well as liquid chlorine for industrial use. In addition, the company offers caustic soda, chlorinated paraffin, hydrogen chloride, cement, food additives, aluminum foil, calcium carbide, pesticides, and other products. Further, it exports its products. The company was founded in 1998 and is based in Nanning, China.",
    "website": "http://www.nh.com.cn",
    "zipcode": "530031"
  },
  "600309.SS": {
    "city": "Yantai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Wanhua Chemical Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "WANHUA CHEMICAL GROUP CO LTD",
    "state": null,
    "summary": "Wanhua Chemical Group Co., Ltd. engages in the research and development, production, and sale of polyurethane series products, petrochemical products, and fine chemicals and new materials worldwide. The company offers polyols, thermoplastic elastomers, petrochemicals, water based resins, isocyanates, specialty amines, thickeners, formulated polyols, function materials, and tert-butyl alcohol; and neopentyl glycol, polyurethane catalyst, propylene for polymerization, polycarbonate, and hydroxyfunctional polyacrylic dispersions, as well as methyl isobutyl ketone, IP, and CDT products. Its products are used in various applications, including appliances/cold chain, elastomers, electronics, clothing/footwear, industrial mechanical, furniture/bedding, building/construction, sealants, automotive and transportation, coatings, sports/leisure, adhesives, home and personal care, and others. The company was formerly known as Yantai Wanhua Polyurethanes Co., Ltd. and changed its name to Wanhua Chemical Group Co., Ltd. in June 2013. Wanhua Chemical Group Co., Ltd. was founded in 1998 and is headquartered in Yantai, China.",
    "website": "http://www.whchem.com",
    "zipcode": "264006"
  },
  "600319.SS": {
    "city": "Weifang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Weifang Yaxing Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "WEIFANG YAXING CHEMICAL",
    "state": null,
    "summary": "Weifang Yaxing Chemical Co., Ltd. engages in the research and development, production, operation, import, and sale of chemical materials in China and internationally. It offers chlorinated polyethylene CPE, azodicarbonamide foaming agent, industrial hydrazine hydrate, sodium hydroxide, liquid chlorine, and hydrochloric acid. The company was founded in 1994 and is headquartered in Weifang, China.",
    "website": "http://www.chinayaxing.com",
    "zipcode": null
  },
  "600328.SS": {
    "city": "Alxa Zuoqi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "CNSIG Inner Mongolia Chemical Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CNSIG INNER MONGOLIA CHEMICAL I",
    "state": null,
    "summary": "CNSIG Inner Mongolia Chemical Industry Co., Ltd. produces and sells salt, salt chemical, and bio-pharmacy products primarily in China. The company offers salt products, such as wash and vacuum iodic, remove-calcium wash, secondary, and original big salt; and chemical products, including sodium metal, sodium chlorate, sodium methoxide, soda ash, and trichloroisocyanuric acid. Its products also cover coal, limestone, and other resources. The company also exports its products to the European Union, the United States, Japan, Australia, Brazil, Southeast Asia, and other countries and regions. The company was formerly known as Inner Mongolia Lantai Industrial Co., Ltd. CNSIG Inner Mongolia Chemical Industry Co., Ltd. was founded in 1998 and is headquartered in Alxa Zuoqi, China.",
    "website": "http://www.lantaicn.com",
    "zipcode": "750336"
  },
  "600352.SS": {
    "city": "Shaoxing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Zhejiang Longsheng Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG LONGSHENG GROUP CO",
    "state": null,
    "summary": "Zhejiang Longsheng Group Co., Ltd. primarily engages in the chemical business. The company operates through Chemicals, Real Estate, Autoparts, Financial Investment, etc. segments. Its chemical products comprise textile chemicals, including disperse and reactive dyes; fine chemical intermediates; construction chemicals; and inorganic chemicals. The company also develops, produces, and sells auto parts, such as sideplate, plate, window front shield plate, engine frontboard and sideboard, longeron back end, front and rear wheel swell, front floor, back floor front component, and back floor foreplate and backplate products. In addition, it offers middle and front door, front shroud, back door, and rear side inner plates; and front shroud, back door, and middle and front door shell plates, as well as headers. Further, the company is involved in the provision of logistics services; sale of steel products; development of real estate properties; and finance and stock right investment business. It sells its products to approximately 50 countries and regions. The company was founded in 1970 and is based in Shaoxing, the People's Republic of China.",
    "website": "http://www.longsheng.com",
    "zipcode": "312368"
  },
  "600367.SS": {
    "city": "Anshun",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Guizhou RedStar Developing Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "GUIZHOU REDSTAR DEVELOPING",
    "state": null,
    "summary": "Guizhou RedStar Developing Co.,Ltd. develops, manufactures, and sells electronic magnetic materials, rubber plastics additives, and green plant extracts in the People's Republic of China. Its principal products comprise barium carbonate, strontium carbonate, electrolytic manganese dioxide, insoluble sulfur, thiourea, sulfur, sulfuric acid, barium, strontium nitrate, strontium chloride, manganese salt, marigold, etc. The company's barium carbonate and strontium carbonate are used as raw materials for the production of television picture tubes, computer monitors, industrial monitors, and electronic components, as well as serve electronic information, chemical, light, metallurgy, and ceramics industries. Its barium and strontium salt products serve glass companies. The company also exports its products to Asia, Europe, the Americas, and internationally. Guizhou RedStar Developing Co.,Ltd. is based in Anshun, the People's Republic of China.",
    "website": "http://www.hxfz.com.cn",
    "zipcode": "561206"
  },
  "600378.SS": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Haohua Chemical Science & Technology Corp., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HAOHUA CHEMICAL SCIENCE&TECHNOL",
    "state": null,
    "summary": "Haohua Chemical Science & Technology Corp., Ltd. researches, develops, produces, supplies, and sells fluorine materials, special gases, special rubber, plastic products, and fine chemicals in China and internationally. The company offers fluoropolymers and fluorinated fine chemical products, including polytetrafluoroethylene resin, fluororubber and fluorine compound rubber, tetrafluoropropanol, perfluoropropylene, tetrafluoroethylene monomer, etc. used in electronic communications, aerospace, petrochemical, automotive, textile, and other industries. It also provides special gases, such as nitrogen trifluoride, sulfur hexafluoride, green nitrous oxide, hydrogen selenide, hydrogen sulfide, etc. for semiconductor integrated circuits, power equipment manufacturing, LED, fiber optic cable, solar photovoltaic, medical health, environmental protection monitoring, and other industries. In addition, the company offers special rubber products and polyurethane materials; rubber sealing products and profiles, rubber hoses, tape products, aviation tires, aviation plexiglass, etc.; rubber seals for water expansion, supply, and drainage pipes and cement roof pipes, etc.; and selected and modified composite, and casting system materials. Further, it provides coatings, catalysts, chemical propellants, raw materials, etc.; marine coatings, functional coatings for aerospace, and industrial anti-corrosion coatings; aircraft engine oil pipes, air pipes, shells, and blades; air-drying repair paints, and temperature indicating and transparent coatings, as well as coatings for aircraft fuel tanks, aircraft interior and exterior skins, and structural parts; and natural gas conversion and fuel cell catalysts, as well as offers technical services. The company was formerly known as Sichuan Tianyi Science & Technology Co., Ltd. and changed its name to Haohua Chemical Science & Technology Corp., Ltd. in June 2019. Haohua Chemical Science & Technology Corp., Ltd. is based in Chengdu, China.",
    "website": "http://www.hhkj.chemchina.com",
    "zipcode": "610041"
  },
  "600458.SS": {
    "city": "Zhuzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Zhuzhou Times New Material Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHUZHOU TIMES NEW MATERIALS TEC",
    "state": null,
    "summary": "Zhuzhou Times New Material Technology CO., LTD. develops, produces, and sells NVH components and polymer composite materials for the railway, automotive, construction, and wind power industries in China and internationally. The company offers railway products, such as primary suspension systems, secondary suspension systems, bushings, anti-roll bars, base plates, link systems, rubber layer springs, and draft gears; and automotive products, including lightweight products, chassis plastic structural components, body accessories, engine compartment plastic components, acoustic products, and AVS products. It also provides bridge and building bearings comprising rubber seismic mitigation and absorption series, high damping rubber bearings, vibration isolation rubber bearings, seismic isolation bearings for building, special bearing series, steel structure and engineering maintenance products, hyperboloid steel bearings, damper series, pot rubber bearings, waterstops, spherical steel bearings, and expansion joints; and wind power products consisting of blades and damping series. In addition, the company offers engineering plastic products, including new products, modified engineering plastic products, and engineering plastics; and insulating materials, such as mica products, laminated products, film products, magnetic wires, and insulating paints. Its products are used in various fields, such as railway and urban transportation, commercial vehicles, and passenger cars, as well as wind power, bridge and building constructions, engineering machinery, etc. The company was formerly known as Zhuzhou Times Rubber & Plastics CO., LTD. and changed its name to Zhuzhou Times New Material Technology CO., LTD. in November 2001. Zhuzhou Times New Material Technology CO., LTD. was founded in 1984 and is based in Zhuzhou, China.",
    "website": "http://www.zz-tmt.com",
    "zipcode": "412007"
  },
  "600490.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Pengxin International Mining Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "PENGXIN INTERNATIONAL MINING CO",
    "state": null,
    "summary": "Pengxin International Mining Co.,Ltd engages in mining, processing, smelting, and selling copper ores primarily in the Democratic Republic of Congo. It produces high purity cathode copper that is used in the fields of wires and cables, electronics, copper material processing, mechanical manufacturing, and copper alloy forging. The company also trades in copper, aluminum, nickel, silver, and other non-ferrous metals, as well as precious metals with a range of large and medium-sized trading companies. In addition, it provides corporate financing and foreign investment services; and engages in the investment, development, construction, and post-investment management of upstream mining resources and materials related to the new energy materials industry chain. The company was formerly known as Shanghai Synica Co., LTD and changed its name to Pengxin International Mining Co.,Ltd in July 2013. Pengxin International Mining Co.,Ltd was founded in 2000 and is headquartered in Shanghai, China.",
    "website": "http://www.pengxinzy.com.cn",
    "zipcode": null
  },
  "600527.SS": {
    "city": "Suzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiangsu Jiangnan High Polymer Fiber Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU JIANGNAN HIGH POLYMER F",
    "state": null,
    "summary": "Jiangsu Jiangnan High Polymer Fiber Co.,Ltd produces and sells composite short-fiber and polyester tops in China and internationally. The company offers aotelun, fleck, PTT, bump, and black polyester tops. It also provides colored polyester tops, PTT polyester tops, fleck tops, etc. The company's products are primarily used in sanitary materials, specialty papers, high-grade leather, woolen textiles, etc. The company was founded in 1984 and is based in Suzhou, China.",
    "website": "http://www.jngx.cn",
    "zipcode": "215143"
  },
  "600589.SS": {
    "city": "Jieyang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Guangdong Rongtai Industry Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG RONGTAI IND CO",
    "state": null,
    "summary": "Guangdong Rongtai Industry Co.,Ltd produces and sells chemical materials and their products primarily in China. The company offers amino polymer compounds to produce tableware, kitchenware, aviation ware, electronic, electric, and computer accessories; LG bright resin powder; and phthalic anhydride for use in plastic plasticizer, paint, dope, medicament, and resin industries. It also provides dioctyl phthalate, a material to produce films, leatheroid, electrical wires, cables, mart-made boards, molding compounds, and plastic pastes, as well as used as softener of synthetic rubber; and dibutyl phthalate used as a plasticizer of cellulose resin and PVC, nitric acid-cellulose dope, and plasticizer and softener of natural and synthetic rubber. In addition, the company offers formaldehyde to produce plienolic and urea formaldehyde resins, urotropine, pentaerythritol, synthetic fibers, engineering plastics formaldehyde polymers, resin dyes, triliydoxy-methylpropane, and explosives, as well as used as materials for producing antiseptics, disinfectants, reductants, tanning agents, and finishing agents. Further, it provides urotropine, which is used as a curing agent for producing resin and plastics; catalyst for producing amino-plastics, rubber accelerator, and anti-condensation agent for textiles, as well as used in manufacturing medicines, fungicides, insecticides, explosives, etc.; and fumaric acid to produce polyester resin and alkyd, as well as for use in oil paints, dyes, paper sizing, and seasoning of alcohol and beverage. The company was founded in 1997 and is based in Jieyang, China.",
    "website": "http://www.gdrongtai.cn",
    "zipcode": "522000"
  },
  "600618.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shanghai Chlor-Alkali Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI CHLOR-ALKALI CHEMICAL ",
    "state": null,
    "summary": "Shanghai Chlor-Alkali Chemical Co., Ltd. manufactures and sells chemical products. It offers caustic soda, polyvinyl chloride, hydrochloride, vinyl chloride, chlorine, fluorine, and other products under the Shen Feng brand name. The company sells its products in China, Southeast Asia, Japan, Korea, Australia, South Africa, Europe, and the Americas. Shanghai Chlor-Alkali Chemical Co., Ltd. was founded in 1992 and is based in Shanghai, China. Shanghai Chlor-Alkali Chemical Co., Ltd. is a subsidiary of Shanghai Huayi (Group) Company Ltd.",
    "website": "http://www.scacc.com",
    "zipcode": "200241"
  },
  "600623.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shanghai Huayi Group Corporation Limited",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI HUAYI GROUP CO LTD",
    "state": null,
    "summary": "Shanghai Huayi Group Corporation Limited operates as a chemical company in China and internationally. The company offers methanol, acetic acid, carbon monoxide, syngas and sulfuric acid, air separation products, etc. for the chemical, pharmaceutical, and other industries. It also provides support services for water, electricity, steam, and other public works, as well as special railway lines and dangerous chemical goods terminals; and dangerous chemical goods transport vehicles and other logistics facilities. In addition, the company offers caustic soda and PVC products under the Shenfeng brand; all-steel radial truck, all steel radial light truck, passenger, full-steel radial truck, and semi-steel radial tires; and acrylic, ice crystal acrylic acid, butyl acrylate, ethyl acrylate, isooctyl acrylate, hydroxyethyl acrylate, and other products under the Yaxing brand for use in the coatings, chemical fiber, textile, light, and other industries. Further, it researches, develops, and produces various fluorine-containing chemicals, including fluoropolymer and fluorine fine chemicals; fluorine refrigerants, such as PTFE in polyfluoroethylene, polyperfluoroethylene propylene, polyvinylidene fluoride, and fusible polytetrafluoroethylene; RTC resins for coatings, chlorotrifluoroethylene resins, and powder coating resins; fluorine rubber comprising fluororubber, 246 type fluororubber, tetrapropylene fluoride rubber, fluorosilicone rubber, etc.; various surfactants, chemical and pharmaceutical intermediates, other auxiliaries, etc.; and general-grade, sheet-grade, and alloy body ABS resins. Additionally, the company offers paint and dyes under the Flying Tiger, Bright, Eyes, One Product, Lion Head, and Aircraft brands; and engages in the logistics, engineering, real estate, investment, and finance businesses. The company was formerly known as Double Coin Holdings Ltd. Shanghai Huayi Group Corporation Limited is based in Shanghai, China.",
    "website": "http://www.shhuayi.com",
    "zipcode": "200040"
  },
  "600636.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "China Reform Culture Holdings Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA REFORM CULTURE HOLDINGS C",
    "state": null,
    "summary": "China Reform Culture Holdings Co., Ltd. engages in the research and development, manufacture, and marketing of fluoropolymers, fluorocarbons, and fluorine-containing fine chemicals in China. The company's products include polytetrafluoroethylene micropowders, PTFE fine powder resins, PTFE dispersions, PTFE molding powder resins, pelletized free-flow PTFE resins, molding PTFE fine cut granular resins, PTFE presintered resins, and perfluorinated ethylene-propylene copolymers. It also offers fluorinated ethylene propylene dispersions, fluorinated ethylene propylene dispersions and copolymers, polyvinylidene fluoride resins, fluoroelastomers, fluoroelastomer compounds and precompounds, and fluorosilicone elastomers. The company is based in Beijing, China.",
    "website": "http://www.crhc-culture.com",
    "zipcode": null
  },
  "600691.SS": {
    "city": "Taiyuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Yangmei Chemical Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "YANGMEI CHEMICAL CO LTD",
    "state": null,
    "summary": "Yangmei Chemical Co.,Ltd. operates in the chemical industry in China. The company's products include agricultural chemicals, methanol, compound fertilizer, melamine, diaphragm caustic soda, ion-exchange membrane caustic soda, polyvinyl chloride, liquid chlorine, isobutyraldehyde, octanol, and hydrogen peroxide. It also manufactures chemical machinery; and trades in chemical products. The company was formerly known as Dongxin Electrical Carbon Co Ltd and changed its name to Yangmei Chemical Co.,Ltd. in April 2013. Yangmei Chemical Co.,Ltd. is based in Taiyuan, China.",
    "website": "http://www.ymhg.com.cn",
    "zipcode": "030006"
  },
  "600722.SS": {
    "city": "Cangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "HeBei Jinniu Chemical Industry Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HEBEI JINNIU CHEMICAL INDUSTRY ",
    "state": null,
    "summary": "HeBei Jinniu Chemical Industry Co.,Ltd, together with its subsidiaries, produces and sells methanol products for chemical companies in China. It also provides caustic soda, hydrochloric acid, liquid chlorine, and polyvinyl chloride resin, as well as cement products. The company was formerly known as Changzhou Chemical Industry Co., Ltd and changed its name HeBei Jinniu Chemical Industry Co.,Ltd in May 2008. HeBei Jinniu Chemical Industry Co.,Ltd was founded in 1994 and is based in Cangzhou, China.",
    "website": "http://www.hbjnhg.com",
    "zipcode": "061000"
  },
  "600725.SS": {
    "city": "Qujing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Yunnan Yunwei Company Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "YUNNAN YUNWEI CO",
    "state": null,
    "summary": "Yunnan Yunwei Company Limited engages in trading and selling coal coking, aluminum, and steel products in China. Yunnan Yunwei Company Limited was founded in 1995 and is based in Qujing, China.",
    "website": "http://www.ywgf.cn",
    "zipcode": null
  },
  "600746.SS": {
    "city": "Zhenjiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiangsu SOPO Chemical Co. Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU SOPO CHEMICAL INDUSTRY ",
    "state": null,
    "summary": "Jiangsu SOPO Chemical Co. Ltd. manufactures and sells chemical products in China and internationally. It offers industrial glacial acetic acid products that are used in plastic, rubber, printing, and other related industries; and ethyl acetate, an organic chemical raw material used in paints, adhesives, ethyl celluloses, artificial leathers, linoleum colorants, artificial fibers, and other related products, as well as used as an adhesive agent for printing inks and as a process solvent for organic chemical synthesis. The company also provides methanol products, which are used in chemicals, plastics, and other related fields; and ADC foaming agents that are used in frothing of EVA, PE, natural rubber, PVC + NBR blend, etc. In addition, it offers sulfuric acid products, which are used in chemical, pharmaceutical, oil refining, and other related industries. The company was founded in 1996 and is headquartered in Zhenjiang, China.",
    "website": "http://www.sopo.com.cn",
    "zipcode": "212006"
  },
  "600844.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Danhua Chemical Technology Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "DANHUA CHEMICAL TECHNOLOGY CO. ",
    "state": null,
    "summary": "Danhua Chemical Technology Co.,Ltd manufactures and sells various chemical products in China. The company offers ethylene glycol for use in the production of polyester fibers, films, packaging resins, antifreeze, and low melting point explosives, as well as auxiliary agents for the dye industry and lubricants for tobacco, cosmetics, and other applications. It also provides oxalic acid for use as an intermediate or reagent in the synthesis of chemicals, including starch hydrolysis to produce pure dextrin and glucose, oxalate reagents, synthetic oxalates, oxalates, etc. for the chemical industry; in the manufacture of chlortetracycline, vitamin B2, and streptomycin for the pharmaceutical industry; in the textile printing and dyeing industry for cotton, wool, and coal dyes, as well as leather tanning and bleaching, and plywood bleaching; and in the metallurgical industry to refine high-purity nickel, rare earth, and other metals, as well as manufacture of carbon rods. In addition, the company offers catalyst products, such as dehydrogenation, synthetic, and hydrogenation catalyst, as well as acetic anhydride. Danhua Chemical Technology Co.,Ltd was founded in 1993 and is based in Shanghai, China.",
    "website": "http://www.600844.com",
    "zipcode": "201103"
  },
  "600929.SS": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Snowsky Salt Industry Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SNOWSKY SALT INDUSTRY GROUP CO ",
    "state": null,
    "summary": "Snowsky Salt Industry Group Co., Ltd. produces and sells salt and salt chemicals. The company offers daily, alkali, industrial, and cooking salt, as well as thenardite. It operates through 98 registered trademarks. The company was formerly known as Hunan Salt Industry Co., Ltd. The company was founded in 2011 and is based in Changsha, China. Snowsky Salt Industry Group Co., Ltd. is a subsidiary of Hunan Province Light Industry & Salt Industry Group Co. Ltd.",
    "website": "http://www.hnsc.cc",
    "zipcode": null
  },
  "600989.SS": {
    "city": "Yinchuan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Ningxia Baofeng Energy Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "NINGXIA BAOFENG ENERGY GROUP CO",
    "state": null,
    "summary": "Ningxia Baofeng Energy Group Co., Ltd. produces and sells coal chemicals which includes tar, thiamine, and benzol. The company also mines and produces coal products and other chemical products, which include methanol and olefin. It offers real estate sales. Ningxia Baofeng Energy Group Co., Ltd. was formerly known as Ningxia Baofeng Energy Co., Ltd. and changed its name to Ningxia Baofeng Energy Group Co., Ltd. in January 2014. The company was founded in 2005 and is based in Yinchuan, China.",
    "website": "http://www.baofengenergy.com",
    "zipcode": null
  },
  "601015.SS": {
    "city": "Hancheng",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shaanxi Heimao Coking Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SHAANXI HEIMAO COKING CO LTD",
    "state": null,
    "summary": "Shaanxi Heimao Coking Co., Ltd. operates as a coking company. It offers coke, methanol, crude benzene, coal tar, synthetic ammonia, and fly ash autoclaved bricks. The company exports its products to North China, East China, South China, Central China, and Shaanxi. Shaanxi Heimao Coking Co., Ltd. was founded in 2003 and is based in Hancheng, China.",
    "website": "http://www.heimaocoking.com",
    "zipcode": "714000"
  },
  "601216.SS": {
    "city": "Wuhai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Inner Mongolia Junzheng Energy & Chemical Group Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "INNER MONGOLIA JUNZHENG ENERGY ",
    "state": null,
    "summary": "Inner Mongolia Junzheng Energy & Chemical Group Co.,Ltd. engages in the production of chemical products and chemical raw materials in China. The company offers polyvinyl chloride resins, caustic soda, calcium carbide, hydrochloric acid, liquid chlorine, acetylene polyvinyl chloride, cement clinker, etc. It is also involved in the power generation, limestone mining, quick lime firing, ferrosilicon smelting, and other activities. In addition, the company engages in chemical logistics and transportation activities, such as shipping of energy and chemical products, container tanks, and storage terminal and other businesses. The company was formerly known as Inner Mongolia Junzheng Energy & Chemical Industry Co., Ltd. Inner Mongolia Junzheng Energy & Chemical Group Co.,Ltd. was founded in 2003 and is headquartered in Wuhai, China.",
    "website": "http://www.junzhenggroup.com",
    "zipcode": "016040"
  },
  "603002.SS": {
    "city": "Guangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Epoxy Base Electronic Material Corporation Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "EPOXY BASE ELECTRONIC MATERIAL ",
    "state": null,
    "summary": "Epoxy Base Electronic Material Corporation Limited produces and sells electronic grade epoxy resins worldwide. The company offers wind blade and liquid type epoxy resins, and specialized and modified type epoxy resins, as well as specialized resins for copper clad laminate, powder coating, and can coating. It also provides professional technical after-sale services. The company was formerly known as Guangzhou Epoxy Base Electronic Material Corp. and changed its name to Epoxy Base Electronic Material Corporation Limited in March 2008. Epoxy Base Electronic Material Corporation Limited was founded in 1994 and is headquartered in Guangzhou, China.",
    "website": "http://www.graceepoxy.com/en",
    "zipcode": "510530"
  },
  "603026.SS": {
    "city": "Dongying",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shandong Shida Shenghua Chemical Group Company Limited",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SHANDONG SHIDA SHENGHUA CHEMICA",
    "state": null,
    "summary": "Shandong Shida Shenghua Chemical Group Company Limited engages in the production and sale of chemical products in China. Its products include methyl tert-butyl ether, propylene oxide, dimethyl carbonate, propylene carbonate, ethylene carbonate, ethyl methyl carbonate and other carbonate products, lithium hexafluorophosphate, and other products. Shandong Shida Shenghua Chemical Group Company Limited was founded in 2002 and is headquartered in Dongying, China.",
    "website": "http://www.sinodmc.com",
    "zipcode": "257503"
  },
  "603067.SS": {
    "city": "Huangshi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Hubei Zhenhua Chemical Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HUBEI ZHENHUA CHEMICAL CO LTD",
    "state": null,
    "summary": "Hubei Zhenhua Chemical Co.,Ltd. engages in the research, development, production, and marketing of chromium salts in China. The company offers sodium bichromate and dichromate, chromic acid anhydride, crystal chromic acid anhydride, liquid chromic anhydride, chrome oxide green, chromic trioxide, potassium dichromate, basic chrome sulphate, vitamin K3, sodium sulphate, aluminium hydroxide, etc. It also exports its products to Europe, the United States, Africa, and Southeast Asia. The company was formerly known as Huanghsi Zhenhua Chemical Industry Co., Ltd. Hubei Zhenhua Chemical Co.,Ltd. was founded in 1967 and is based in Huangshi, China.",
    "website": "http://www.hszhenhua.com",
    "zipcode": "435001"
  },
  "603077.SS": {
    "city": "Chengdu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Sichuan Hebang Biotechnology Corporation Limited",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SICHUAN HEBANG BIOTECHNOLOGY CO",
    "state": null,
    "summary": "Sichuan Hebang Biotechnology Corporation Limited provides food, fertilizer, industrial mineral, and other products. The company was formerly known as SichuanHebang Biotechnology Co.,Ltd. and changed its name to Sichuan Hebang Biotechnology Corporation Limited in April 2021. Sichuan Hebang Biotechnology Corporation Limited was founded in 2002 and is based in Chengdu, China.",
    "website": "http://www.hebang.cn",
    "zipcode": null
  },
  "603113.SS": {
    "city": "Dezhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jinneng Science & Technology Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "JINNENG SCIENCE AND TECHNOLOGY ",
    "state": null,
    "summary": "Jinneng Science & Technology Co., Ltd. is an energy-focused industrial company, produces and distributes fine chemical and coal chemical products in China. The company offers coke, carbon black, silica dioxide, technical naphthalene, pitch, para cresol, sorbic acid, and potassium sorbate, as well as methanol and pure benzene. Its products are used in various industrial applications, including tire manufacturing, as well as iron, steel, pharmaceutical, and food production. The company also exports its products to Europe, North America, and Asia. Jinneng Science & Technology Co., Ltd. was founded in 1998 and is based in Dezhou, China.",
    "website": "http://www.jin-neng.com",
    "zipcode": "251100"
  },
  "603155.SS": {
    "city": "Suqian",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Xinyaqiang Silicon Chemistry Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "XINYAQIANG SILICON CHEMISTRY CO",
    "state": null,
    "summary": "Xinyaqiang Silicon Chemistry Co.,Ltd manufactures and sells organic silicon methylsilane and phenyl products. It offers hexamethyldisiloxane, iodotrimethylsilane, chlorotrimethylsilane, hexamethyldisilane, diethoxydimethylsilane, dimethoxydimethylsilane, phenyltrichlorosilane, dichlorodiphenylsilane, dichlorodimethylsilane, trimethylethoxysilane, methyltrimethoxysilane, and methyltriethoxysilane; 1,3-divinyltetramethyldisilazane; 1,3-diethenyl-1,1,3,3-tetramethyldisiloxane; N,1,1,1-tetramethyl-N-(trimethylsilyl)silylamine; 1,1,1,3,3,3-hexamethyldisilazane; and 1,3-Bis(trimethylsilyl)urea. The company was founded in 2009 and is based in Suqian, China.",
    "website": "http://www.newasiaman.com",
    "zipcode": "223809"
  },
  "603188.SS": {
    "city": "Changzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiangsu Yabang Dyestuff Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGSU YABANG DYESTUFF CO LTD",
    "state": null,
    "summary": "Jiangsu Yabang Dyestuff Co., Ltd., together with its subsidiaries, engages in the research, development, production, and sale of dyes and dye intermediates in China. It offers disperse, vat, and solvent dyes; and benzoic acid, benzoyl chloride, triclosan, benzaldehyde, hydrochloric acid, (o-) chlorobenzaldehyde, and (ortho) chlorobenzonitrile. The company also provides sulfuric and chlorosulfonic acids; and operates and disposes hazardous solid wastes, as well as develops and produces combined heat and power products. In addition, it engages in the production of steam, as well as wastewater treatment business; import and export business; and energy supply business. The company also exports its products. Jiangsu Yabang Dyestuff Co., Ltd. was founded in 2006 and is based in Changzhou, China.",
    "website": "http://www.yabangdyes.com",
    "zipcode": "213163"
  },
  "603225.SS": {
    "city": "Tongxiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Xinfengming Group Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "XINFENGMING GROUP CO LTD",
    "state": null,
    "summary": "Xinfengming Group Co., Ltd. manufactures and sells polyester yarns in China, Turkey, Egypt, Vietnam, South Korea, Pakistan, Spain, Italy, and internationally. It provides moisture absorption and sweat discharging, warm hollow, fire proof, bamboo charcoal, lat, and antibacterial fibers. The company was founded in 2000 and is headquartered in Tongxiang, China.",
    "website": "http://www.xfmgroup.com",
    "zipcode": "314513"
  },
  "603260.SS": {
    "city": "Pinghu",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Hoshine Silicon Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "HOSHINE SILICON INDUSTRY CO LTD",
    "state": null,
    "summary": "Hoshine Silicon Industry Co., Ltd. produces and sells silicon-based materials in China and internationally. It offers silicon metals and metal powders; and silicone monomer, intermediate, rubber RTV and HTV, sealant, fluid, and fumed silica, as well as graphite carbon electrode. The company was founded in 2005 and is based in Pinghu, China.",
    "website": "http://www.hoshinesilicon.com",
    "zipcode": "314201"
  },
  "603299.SS": {
    "city": "Huai'an",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiang Su Suyan Jingshen Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANG SU SUYAN JINGSHEN CO LTD",
    "state": null,
    "summary": "Jiang Su Suyan Jingshen Co.,Ltd. engages in the research, production, distribution, and sale of salt and salt chemicals in Southeast Asia. It offers industrial and edible salts, calcined soda, sodium sulfate, calcium chloride, and other products under the Huai and Jingshen brands. The company was formerly known as Jiangsu Jingshen Salt & Chemical Industry Co., Ltd. and changed its name to Jiang Su Suyan Jingshen Co.,Ltd. in January 2019. Jiang Su Suyan Jingshen Co.,Ltd. was founded in 2009 and is headquartered in Huai'an, China.",
    "website": "http://www.jsjsyh.com",
    "zipcode": "223220"
  },
  "603379.SS": {
    "city": "Jinhua",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Zhejiang Sanmei Chemical Industry Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG SANMEI CHEMICAL INDUST",
    "state": null,
    "summary": "Zhejiang Sanmei Chemical Industry Co., Ltd. provides foaming agents/hydrofluoric acid, fluorinated refrigerant, ODS substitute products, fluoride salt, and calcium sulfate. The company is based in Jinhua, China.",
    "website": "http://www.sanmeichem.com",
    "zipcode": "321200"
  },
  "603585.SS": {
    "city": "Jiangyin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Suli Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SULI CO LTD",
    "state": null,
    "summary": "Suli Co., Ltd. researches, produces, and sells agrochemicals, flame retardants, and other fine chemicals. The company offers chlorothalonil, azoxystrobin, fluazinam, cymoxanil, diflubenzuron, and boscalid technical products; pesticide formulations; and decabromodiphenyl ethane. It also provides brominated, environment-friendly, and halogen-free flame retardants; and intermediates, including trichloroacetonitrile, tetrachlorophthalonitrile, pentachloropyridine, pentachlorobenzonitrile, isophthalodinitrile, and hydrobromic acid, as well as 1,2-diphenylethane and 1,2-dibromoethane. In addition, the company offers industry biocides, such as Longee 985CHL, 550CCD, 550CC, and 500CHL; and ferric chloride solution for use in water treatment. It sells its products under the Suli brand name for use in agricultural production, and plastics and building materials industries, etc. in China, European Union, North America, Africa, South America, Southeast Asia, Japan, and other countries. Suli Co., Ltd. is based in Jiangyin, China.",
    "website": "http://www.suli.com",
    "zipcode": "214444"
  },
  "603612.SS": {
    "city": "Linyi",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Sunstone Development Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SUNSTONE DEVELOPMENT CO LTD",
    "state": null,
    "summary": "Sunstone Development Co., Ltd. engages in the research and development, production, and marketing of prebaked carbon anodes for the aluminum industry in China and internationally. It is involved in the import and export of petroleum coke, as well as exports anodes. Sunstone Development Co., Ltd. was founded in 2003 and is based in Linyi, China.",
    "website": "http://www.sun-stone.com",
    "zipcode": "251500"
  },
  "603681.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shanghai Yongguan Adhesive Products Corp., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI YONGGUAN ADHESIVE PROD",
    "state": null,
    "summary": "Shanghai Yongguan Adhesive Products Corp., Ltd. engages in the production and sale of adhesive products in China and internationally. The company offers cloth duct, masking, BOPP, PVC, double sided, wire harness, aluminum foil, kraft paper, anti-slip, fiberglass and fiberglass mesh, warning, butyl, cellophane, lint roller cleaning tape, all weather, and stationery tapes; and BOPP dispenser, lint roller for clothes and householding, and related packaging adhesives, as well as pre-taped masking and stretch films. Its products are used in civil, industrial, medical, construction, household, packaging, stationery, automobile manufacturing, electronic appliances, aviation, shipping, high-speed rail, and other applications. The company was founded in 2002 and is based in Shanghai, China.",
    "website": "http://www.ygtape.com",
    "zipcode": "201713"
  },
  "603725.SS": {
    "city": "Foshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Guangdong Tianan New Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "GUANGDONG TIANAN NEW MATERIAL C",
    "state": null,
    "summary": "Guangdong Tianan New Material Co., Ltd. develops, manufactures, and sells PVC/PPF and TPO/PPF automotive interior materials, and PVC and PP decorative materials. The company offers instrument panels, door and side panels, and seating and other products for the automotive industry. It also provides building and home furnishing products, including laminated films, vacuum and membrane films, wrappings, stretch ceiling films, edge bandings, and flame resistant films; calendered films, such as automotive decorative, laminator, label, static, and stretch ceiling films, as well as medical membranes; and synthetical leather for furniture, shoes, and fashion handbags, as well as case and other decorative leather products. The company was founded in 2000 and is based in Foshan, China.",
    "website": "http://www.tianantech.com",
    "zipcode": "528061"
  },
  "603931.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Hangzhou Greenda Electronic Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "HANGZHOU GREENDA ELECTRONIC MAT",
    "state": null,
    "summary": "Hangzhou Greenda Electronic Materials Co., Ltd. engages in the research and development, production, and servicing of high-purity electronic chemicals worldwide. It offers electronic chemical products for TFT-LCD, IC, PV, and other industries. The company was founded in 2001 and is based in Hangzhou, China.",
    "website": "http://www.greendachem.com/en",
    "zipcode": "310051"
  },
  "603938.SS": {
    "city": "Tangshan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Tangshan Sunfar Silicon Industries Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TANGSHAN SUNFAR SILICON INDUSTR",
    "state": null,
    "summary": "Tangshan Sunfar Silicon Industries Co.,Ltd. produces and sells trichlorosilane, potassium hydroxide, potassium sulfate, and silicon tetrachloride products in China. It also exports its products to South Africa, India, Malaysia, Indonesia, Taiwan, South Korea, Australia, etc. The company was founded in 2006 and is based in Tangshan, China.",
    "website": "http://www.tssunfar.com",
    "zipcode": null
  },
  "603948.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Zhejiang Jianye Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "ZHEJIANG JIANYE CHEMICAL CO LTD",
    "state": null,
    "summary": "Zhejiang Jianye Chemical Co., Ltd. manufactures and sells chemical products in China. The company offers low carbon fatty amines, plasticizers, acetates, liquid sulfur dioxide, etc. It also exports its products worldwide. The company is based in Hangzhou, China.",
    "website": "http://www.chinaorganicchem.com",
    "zipcode": "311604"
  },
  "605366.SS": {
    "city": "Jingdezhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiangxi Hungpai New Material Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANGXI HUNGPAI NEW MATERIAL CO",
    "state": null,
    "summary": "Jiangxi Hungpai New Material Co., Ltd. manufactures and sells silane coupling agent and rubber additives worldwide. It also offers anti-reversion agents, antioxidant agents, manufacturing additive agents, prevent blooming agents, raw chemical materials, silicone products series, fumed silica, and anti-adherent agent. Its products are used in green tires, semiconductor, solar, and rubber products industries. The company serves tire manufacturers and international brands. Jiangxi Hungpai New Material Co., Ltd. is based in Jingdezhen, China.",
    "website": "http://www.hungpai.net",
    "zipcode": "333399"
  },
  "605399.SS": {
    "city": "Nanjing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Jiang Xi Chenguang New Materials Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "JIANG XI CHENGUANG NEW MATERIAL",
    "state": null,
    "summary": "Jiang Xi Chenguang New Materials Co.,Ltd., together with its subsidiaries, operates as a silane coupling agent manufacturer in China. The company engages in the research and development, manufacture, and sales of coupling agent, coupling agent monomer, coupling agent intermediate, and other coupling agent series products. Its products include hydrosilane, vinylsilane, chloropropylsilane, alkylsilane, orthosilicate, aminosilane, epoxysilane, methacrylsilane, and sulfursil. The company serves clients from various industries, including new energy, new materials, aerospace, engineering plastics, paints and coatings, glass fiber, textile, automobile and electronic products, etc. Jiang Xi Chenguang New Materials Co.,Ltd. was founded in 2001 and is based in Nanjing, China.",
    "website": "http://www.cgsilane.com",
    "zipcode": "210019"
  },
  "688199.SS": {
    "city": "Tianjin",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Tianjin Jiuri New Materials Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Basic Materials",
    "short_name": "TIANJIN JIURI NEW MATERIALS CO ",
    "state": null,
    "summary": "Tianjin Jiuri New Materials Co., Ltd. engages in the research, development, manufacture, and sale of photoinitiators and pharmaceutical intermediates. It offers UV photoinitiators, such as free radical type, polymeric type, cationic type, and inhibitor photoinitiators. The company also provides reactive monomers, oligomers, and reactive amine synergists; fine chemicals; and UV absorbers. In addition, it offers solutions, such as low-odor, non-yellowing, benzene-free, polymeric, low emission, and water-based UV formulations, as well as through-curing formulations. The company was founded in 1998 and is based in Tianjin, China.",
    "website": "http://www.jiuri.cc",
    "zipcode": "300384"
  },
  "8139.HK": {
    "city": "Changxing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Chemicals",
    "long_name": "Zhejiang Chang'an Renheng Technology Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "CHANGAN RH",
    "state": null,
    "summary": "Zhejiang Chang'an Renheng Technology Co., Ltd., together with its subsidiaries, develops, produces, and sells bentonite fine chemicals in the People's Republic of China. It offers papermaking chemicals; inorganic gels; bentonite products for metallurgy pellets; quality calcium-bentonite products; organic bentonite products; and other chemicals, such as flocculating agents that are primarily used in the coating preparation industry. The company is also involved in the mining and processing of clay; and wholesale and retail of chemicals and equipment. The company was formerly known as Changxing Renheng Fine Bentonite Co., Ltd. and changed its name to Zhejiang Chang'an Renheng Technology Co., Ltd. in December 2008. Zhejiang Chang'an Renheng Technology Co., Ltd. was founded in 2000 and is headquartered in Changxing, the People's Republic of China.",
    "website": "http://www.renheng.com",
    "zipcode": null
  },
  "900908.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shanghai Chlor-Alkali Chemical Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI CHLOR-ALKALI CHEMICAL ",
    "state": null,
    "summary": "Shanghai Chlor-Alkali Chemical Co., Ltd. manufactures and sells chemical products. It offers caustic soda, polyvinyl chloride, hydrochloride, vinyl chloride, chlorine, fluorine, and other products under the Shen Feng brand name. The company sells its products in China, Southeast Asia, Japan, Korea, Australia, South Africa, Europe, and the Americas. Shanghai Chlor-Alkali Chemical Co., Ltd. was founded in 1992 and is based in Shanghai, China. Shanghai Chlor-Alkali Chemical Co., Ltd. is a subsidiary of Shanghai Huayi (Group) Company Ltd.",
    "website": "http://www.scacc.com",
    "zipcode": "200241"
  },
  "900909.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Shanghai Huayi Group Corporation Limited",
    "market": "cn_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "SHANGHAI HUAYI GROUP CO LTD",
    "state": null,
    "summary": "Shanghai Huayi Group Corporation Limited operates as a chemical company in China and internationally. The company offers methanol, acetic acid, carbon monoxide, syngas and sulfuric acid, air separation products, etc. for the chemical, pharmaceutical, and other industries. It also provides support services for water, electricity, steam, and other public works, as well as special railway lines and dangerous chemical goods terminals; and dangerous chemical goods transport vehicles and other logistics facilities. In addition, the company offers caustic soda and PVC products under the Shenfeng brand; all-steel radial truck, all steel radial light truck, passenger, full-steel radial truck, and semi-steel radial tires; and acrylic, ice crystal acrylic acid, butyl acrylate, ethyl acrylate, isooctyl acrylate, hydroxyethyl acrylate, and other products under the Yaxing brand for use in the coatings, chemical fiber, textile, light, and other industries. Further, it researches, develops, and produces various fluorine-containing chemicals, including fluoropolymer and fluorine fine chemicals; fluorine refrigerants, such as PTFE in polyfluoroethylene, polyperfluoroethylene propylene, polyvinylidene fluoride, and fusible polytetrafluoroethylene; RTC resins for coatings, chlorotrifluoroethylene resins, and powder coating resins; fluorine rubber comprising fluororubber, 246 type fluororubber, tetrapropylene fluoride rubber, fluorosilicone rubber, etc.; various surfactants, chemical and pharmaceutical intermediates, other auxiliaries, etc.; and general-grade, sheet-grade, and alloy body ABS resins. Additionally, the company offers paint and dyes under the Flying Tiger, Bright, Eyes, One Product, Lion Head, and Aircraft brands; and engages in the logistics, engineering, real estate, investment, and finance businesses. The company was formerly known as Double Coin Holdings Ltd. Shanghai Huayi Group Corporation Limited is based in Shanghai, China.",
    "website": "http://www.shhuayi.com",
    "zipcode": "200040"
  },
  "900921.SS": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "SHH",
    "industry": "Chemicals",
    "long_name": "Danhua Chemical Technology Co.,Ltd",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Basic Materials",
    "short_name": "DANHUA CHEMICAL TECHNOLOGY CO. ",
    "state": null,
    "summary": "Danhua Chemical Technology Co.,Ltd manufactures and sells various chemical products in China. The company offers ethylene glycol for use in the production of polyester fibers, films, packaging resins, antifreeze, and low melting point explosives, as well as auxiliary agents for the dye industry and lubricants for tobacco, cosmetics, and other applications. It also provides oxalic acid for use as an intermediate or reagent in the synthesis of chemicals, including starch hydrolysis to produce pure dextrin and glucose, oxalate reagents, synthetic oxalates, oxalates, etc. for the chemical industry; in the manufacture of chlortetracycline, vitamin B2, and streptomycin for the pharmaceutical industry; in the textile printing and dyeing industry for cotton, wool, and coal dyes, as well as leather tanning and bleaching, and plywood bleaching; and in the metallurgical industry to refine high-purity nickel, rare earth, and other metals, as well as manufacture of carbon rods. In addition, the company offers catalyst products, such as dehydrogenation, synthetic, and hydrogenation catalyst, as well as acetic anhydride. Danhua Chemical Technology Co.,Ltd was founded in 1993 and is based in Shanghai, China.",
    "website": "http://www.600844.com",
    "zipcode": "201103"
  },
  "9933.HK": {
    "city": "Nanjing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Chemicals",
    "long_name": "GHW International",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "GHW INTL",
    "state": null,
    "summary": "GHW International, an investment holding company, manufactures and sells chemical and pharmaceutical products in the People's Republic of China, Vietnam, rest of Asia, Europe, and internationally. It operates in four segments: Polyurethane Materials, Animal Nutrition Chemicals, Fine Chemicals, and Pharmaceutical Products and Intermediates. The Polyurethane Materials segment offers polymeric methylene diphenyl diisocyanate (MDI) and toluene diisocyanate, and polymer polyether for use in cushion foams, interior components, and other lightweight automotive parts. The Animal Nutrition Chemicals segment provides choline chloride and betaine used in feeds for poultry and livestock. The Fine Chemicals segment offers carboxylic acids, solvents, resins, and oleo chemicals used in the paint and synthesis of dyes, production of lubricants, emulsifiers, cosmetics, flavors and fragrances, and feed additives. The Pharmaceutical Products and Intermediates segment produces and sells isooctanoic acid and diethyl sulfate for use in paint drier, fungicide, preservative and pharmaceutical raw materials, synthesis of dyes, pesticides, and pharmaceutical intermediates; and iodine and iodine derivatives, and pharmaceutical products, such as cefpodoxime dispersible tablets. GHW International was founded in 1995 and is headquartered in Nanjing, the People's Republic of China.",
    "website": "http://www.goldenhighway.com",
    "zipcode": null
  },
  "BTX.SI": {
    "city": "Changsha",
    "country": "China",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Chemicals",
    "long_name": "Anchun International Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "Anchun Intl",
    "state": null,
    "summary": "Anchun International Holdings Ltd., an investment holding company, provides integrated chemical systems engineering and technology solutions for petrochemical and chemical industries in the People's Republic of China. The company operates through three segments: Catalyst Business; Chemical Systems and Components Business; and Chemical Engineering and Technology Engineering Services. The Catalyst Business segment manufactures various catalysts for use in the process of gas-making, ammonia synthesis, and methanol synthesis. The Chemical Systems and Components Business segment manufactures chemical equipment, including reactors, pressure vessels, and other auxiliary equipment. The Chemical Engineering and Technology Engineering Services segment provides chemical systems engineering and technology design services to produce ammonia and methanol related products, such as agriculture fertilizers and biodiesel for use in the agriculture and energy industries. Anchun International Holdings Ltd. was founded in 1993 and is headquartered in Changsha, the People's Republic of China.",
    "website": "http://www.anchun.com",
    "zipcode": "410205"
  },
  "CHCC": {
    "city": "Zibo",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Chemicals",
    "long_name": "China Chemical Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "CHINA CHEMICAL CORP",
    "state": null,
    "summary": "China Chemical Corp. engages in the design, development, manufacture, and commercialization of organic chemical materials primarily in the People's Republic of China. It offers maleic anhydride (MAH), an organic chemical used primarily in the production of unsaturated polyester and polyurethane resins; phthalic anhydride (PA), an organic chemical used primarily in the production of PVC for packaging, films, magnetic tapes, tires, pipes, hoses, containers, and other everyday products; and byproducts of MAH and PA. The company is based in Zibo, the People's Republic of China.",
    "website": null,
    "zipcode": "255330"
  },
  "GNENF": {
    "city": "Xinyu",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Chemicals",
    "long_name": "Ganfeng Lithium Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "GANFENG LITHIUM CO LTD",
    "state": null,
    "summary": "Ganfeng Lithium Co., Ltd. manufactures and sells lithium products in Mainland China, Hong Kong, rest of Asia, the European Union, North America, and internationally. It operates through three segments: Lithium Metal and Compound, Lithium Battery, and Lithium Ore Resource and Others. The company has interests in the Mount Marion mine located in Australia; Cauchari-Olaroz project situated in Jujuy Province, Northwest Argentina; Mariana project located in the Andes Mountains in Salta Province, Argentina; Sonora project situated in Mexico; Pilbara Pilgangoora lithium-tantalum project located in Western Australia; Ningdu Heyuan mine situated in Ningdu County, Ganzhou City, Jiangxi Province; and Avalonia project located in Ireland. It offers battery grade lithium carbonate, battery-grade lithium hydroxide, lithium chloride, butyl lithium, and lithium fluoride; lithium metals in the form of ingots, foils, rods, particles, alloy powder; polymer lithium battery; and lithium-ion motive power batteries, energy storage batteries, and consumer batteries, as well as copper lithium or lithium aluminum alloy foil. The company also explores for and sells lithium ores; and provides lithium battery recycling solutions. Its products are used in the manufacturing of electric vehicles, portable electronics, chemicals, and pharmaceuticals, as well as used by battery cathode materials manufacturers, battery suppliers, and automobile original equipment manufacturers. Ganfeng Lithium Co., Ltd. was founded in 2000 and is based in Xinyu, China.",
    "website": "http://www.ganfenglithium.com",
    "zipcode": "338000"
  },
  "GNENY": {
    "city": "Xinyu",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Chemicals",
    "long_name": "Ganfeng Lithium Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Basic Materials",
    "short_name": "GANFENG LITHIUM CO LTD UNSPON E",
    "state": null,
    "summary": "Ganfeng Lithium Co., Ltd. manufactures and sells lithium products in Mainland China, Hong Kong, rest of Asia, the European Union, North America, and internationally. It operates through three segments: Lithium Metal and Compound, Lithium Battery, and Lithium Ore Resource and Others. The company has interests in the Mount Marion mine located in Australia; Cauchari-Olaroz project situated in Jujuy Province, Northwest Argentina; Mariana project located in the Andes Mountains in Salta Province, Argentina; Sonora project situated in Mexico; Pilbara Pilgangoora lithium-tantalum project located in Western Australia; Ningdu Heyuan mine situated in Ningdu County, Ganzhou City, Jiangxi Province; and Avalonia project located in Ireland. It offers battery grade lithium carbonate, battery-grade lithium hydroxide, lithium chloride, butyl lithium, and lithium fluoride; lithium metals in the form of ingots, foils, rods, particles, alloy powder; polymer lithium battery; and lithium-ion motive power batteries, energy storage batteries, and consumer batteries, as well as copper lithium or lithium aluminum alloy foil. The company also explores for and sells lithium ores; and provides lithium battery recycling solutions. Its products are used in the manufacturing of electric vehicles, portable electronics, chemicals, and pharmaceuticals, as well as used by battery cathode materials manufacturers, battery suppliers, and automobile original equipment manufacturers. Ganfeng Lithium Co., Ltd. was founded in 2000 and is based in Xinyu, China.",
    "website": "http://www.ganfenglithium.com",
    "zipcode": "338000"
  },
  "LBTI": {
    "city": "XaiXi",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Chemicals",
    "long_name": "Lithium & Boron Technology, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "LITHIUM AND BORON TECHNOLOGY IN",
    "state": null,
    "summary": "Lithium & Boron Technology, Inc. manufactures and sells boric acid and related compounds for use in industrial and consumer applications in the People's Republic of China. The company was formerly known as SmartHeat Inc. and changed its name to Lithium & Boron Technology, Inc. in October 2019. Lithium & Boron Technology, Inc. was founded in 1954 and is based in XaiXi, the People's Republic of China.",
    "website": "http://www.lithiumborontech.com",
    "zipcode": "817000"
  },
  "MKD": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Chemicals",
    "long_name": "Molecular Data Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "Molecular Data Inc.",
    "state": null,
    "summary": "Molecular Data Inc., through its subsidiaries, operates in the chemical e-commerce business in the People's Republic of China. The company operates technology-driven platform that connects participants along the chemical value chain through its integrated solutions. It delivers e-commerce solutions, financial solutions, warehousing and logistics solutions, and software-as-a-service suites that are intended to solve pain points for participants in the traditional chemical industry. The company offers its e-commerce solutions through online platform that consists of molbase.com and molbase.cn websites; Moku Data Weixin account; Chemical Community app; and other ancillary platforms. The company was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
    "website": "http://www.molbase.cn",
    "zipcode": "201109"
  },
  "TC7.F": {
    "city": "Weifang",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Chemicals",
    "long_name": "Tiande Chemical Holdings Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "TIANDE CHEMIC.HLDG.HD-,01",
    "state": null,
    "summary": "Tiande Chemical Holdings Limited, an investment holding company, engages in the research, development, manufacture, sale, and distribution of fine chemical products in the People's Republic of China, India, the United States, Spain, Taiwan, and internationally. Its principal products include sodium cyanide, cyanoacetic acid and cyanoacetates, malonates, diethyl ethoxymethylenemalonate, EDTA acids and salts, mono chloroacetic acid and derivatives, ethanol, tert-butanol, cyanoacrylate monomers, and related by-products. The company also engages in the research and development, manufacture, and sale of medical instrument products; and manufacture and sale of adhesive products. Its products are used in synthesis of pharmaceutical products, pesticides, adhesive products, sealants, essences, aromatics, etc. The company was founded in 1997 and is headquartered in Weifang, the People's Republic of China. Tiande Chemical Holdings Limited is a subsidiary of Cheerhill Group Limited.",
    "website": "http://www.tdchem.com",
    "zipcode": "261061"
  }
}
