{
    "000655.SZ": {
        "short_name": "SHANDONG JINLING M",
        "long_name": "Shandong Jinling Mining Co., Ltd.",
        "summary": "Shandong Jinling Mining Co., Ltd. engages in the mining of iron ore. The company produces and sells iron, copper, and cobalt powder. It also offers single rope cages and YPC hydraulic hammers; and engages in machining, power generation, and goods export activities. The company is based in Zibo, China. Shandong Jinling Mining Co., Ltd. is a subsidiary of Shandong Jinling Iron Mine.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zibo",
        "zipcode": null,
        "website": "http://www.sdjlky.com",
        "full_time_employees": 2702
    },
    "2798.HK": {
        "short_name": "PER ENERGY",
        "long_name": "Perennial Energy Holdings Limited",
        "summary": "Perennial Energy Holdings Limited, an investment holding company, operates as a coal mining company in the People's Republic of China. The company principally engages in the exploration and mining of coking coal and coal refinery. It operates three underground coal mines comprising Hongguo Mine with a licensed area of 3.0225 sq. km; Baogushan Mine covering a licensed area of 2.4736 sq. km; and Xiejiahegou Mine with a licensed area of 1.0135 sq. km located in Panzhou City, Guizhou Province. The company was founded in 1990 and is headquartered in Liupanshui, China. Perennial Energy Holdings Limited is a subsidiary of Spring Snow Management Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Liupanshui",
        "zipcode": null,
        "website": "http://www.perennialenergy.hk",
        "full_time_employees": 2993
    },
    "600397.SS": {
        "short_name": "ANYUAN COAL INDUSTRY GROUP CO L",
        "long_name": "Anyuan Coal Industry Group Co., Ltd.",
        "summary": "Anyuan Coal Industry Group Co., Ltd. engages in the coal mining and operation business. The company offers coal products, including smelting refined, washed steam, blended, sieved blended, washed fine, lump, etc. for use in iron and steel, thermal power, and coking plants. It is also involved thermal and refined coal, and mining material trading business. The company was formerly known as Anyuan Industrial Co., Ltd. and changed its name to Anyuan Coal Industry Group Co., Ltd. in August 2012. Anyuan Coal Industry Group Co., Ltd. was founded in 1999 and is based in Nanchang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanchang",
        "zipcode": "330025",
        "website": "http://www.jxcgc.com",
        "full_time_employees": 9047
    },
    "600408.SS": {
        "short_name": "SHANXI ANTAI GROUP",
        "long_name": "Shanxi Antai Group Co., Ltd.",
        "summary": "Shanxi Antai Group Co., Ltd. manufactures and sells coke, cement, pig iron, coal tar, ammonium sulfate, and benzole in China. It also engages in coal washing activities; and production and sale of power. The company was founded in 1993 and is based in Jiexiu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiexiu",
        "zipcode": null,
        "website": "http://www.antaigroup.com",
        "full_time_employees": 2451
    },
    "600740.SS": {
        "short_name": "SHANXI COKING COAL GROUP CO LTD",
        "long_name": "Shanxi Coking Co., Ltd.",
        "summary": "Shanxi Coking Co., Ltd. engages in the production and sale of coke and coke products in China. It offers methanol, carbon black, ammonium sulfate, industrial naphthalene, modified asphalt, pure benzene, etc.; and metallurgical coke and by-products. The company was founded in 1996 and is headquartered in Linfen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Linfen",
        "zipcode": "041606",
        "website": "http://www.sxjh.com.cn",
        "full_time_employees": 6324
    },
    "600997.SS": {
        "short_name": "KAILUAN ENERGY CHEMICAL CO. LTD",
        "long_name": "Kailuan Energy Chemical Co.,Ltd.",
        "summary": "Kailuan Energy Chemical Co.,Ltd. engages in coal, coal chemical, and other businesses. It engages in coal mining, raw coal washing, and processing; and coking and coal chemical product production and sales activities. The company was formerly known as Kailuan Coal Co., Ltd. Kailuan Energy Chemical Co.,Ltd. was founded in 2001 and is based in Tangshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tangshan",
        "zipcode": "063018",
        "website": "http://www.kkcc.com.cn",
        "full_time_employees": 12483
    },
    "601011.SS": {
        "short_name": "BAOTAILONG NEW MATERIALS CO LTD",
        "long_name": "Baotailong New Materials Co., Ltd.",
        "summary": "Baotailong New Materials Co., Ltd. provides coal chemical, clean energy, new material, and other products in China. The company produces coal tar, coke, coarse benzene, ammonium sulfate, washing foams, graphite papers, methanol, LPG, liquid oxygen and nitrogen, hydrocarbon, asphalt harmony products, graphene oxide powder and slurry, and graphene electrothermal films, as well as needle coke and building blocks. It is also involved in power and heat supply activities. The company was formerly known as Qitaihe Baotailong Coal & Coal Chemicals Public Co., Ltd. and changed its name to Baotailong New Materials Co., Ltd. in June 2016. Baotailong New Materials Co., Ltd. was founded in 2003 and is based in Qitaihe, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qitaihe",
        "zipcode": null,
        "website": "http://www.btlgf.com",
        "full_time_employees": 2450
    },
    "6885.HK": {
        "short_name": "JINMA ENERGY",
        "long_name": "Henan Jinma Energy Company Limited",
        "summary": "Henan Jinma Energy Company Limited, together with its subsidiaries, operates in the coking chemical industry in the People's Republic of China. The company's Coke segment produces and sells coke. Its Coking by-products segment produces and sells ammonium sulphater. The company's Refined Chemicals segment processes and sells benzene based and coal tar-based chemicals. Its Energy Products segment is involved in processing and sale of coke oven crude gas into coal gas; and extraction of LNG (liquefied natural gas) from coal gas, as well as hydrogen. The company's Trading segment trades in coal, coke, LNG, refined oil, coal mining equipment, and nonferrous materials. Its Other Services segment provides railway related storage and logistics, water, catering, and fire prevention and management services. The company is also involved in the research and development of environmental protection technology; project investment and investment management; and provision of multimodal transportation, warehouse, and railway freight transportation services. Henan Jinma Energy Company Limited was founded in 2003 and is based in Jiyuan, China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiyuan",
        "zipcode": "459000",
        "website": "http://www.hnjmny.com",
        "full_time_employees": 1850
    },
    "PEZ.F": {
        "short_name": "PERENNIAL ENERGY  HD-,01",
        "long_name": "Perennial Energy Holdings Limited",
        "summary": "Perennial Energy Holdings Limited, an investment holding company, operates as a coal mining company in the People's Republic of China. The company principally engages in the exploration and mining of coking coal and coal refinery. It operates three underground coal mines comprising Hongguo Mine with a licensed area of 3.0225 sq. km; Baogushan Mine covering a licensed area of 2.4736 sq. km; and Xiejiahegou Mine with a licensed area of 1.0135 sq. km located in Panzhou City, Guizhou Province. The company was founded in 1990 and is headquartered in Liupanshui, China. Perennial Energy Holdings Limited is a subsidiary of Spring Snow Management Limited.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Coking Coal",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Liupanshui",
        "zipcode": null,
        "website": "http://www.perennialenergy.hk",
        "full_time_employees": 2993
    }
}