{
    "000565.SZ": {
        "short_name": "CHONGQING SANXIA P",
        "long_name": "Chongqing Sanxia Paints Co., Ltd",
        "summary": "Chongqing Sanxia Paints Co., Ltd manufactures and sells paints and coatings primarily in China. The company offers anti-corrosion, industrial, automotive, architectural, furniture, silicone, fluorocarbon, and other paints. The company's products are used in the aerospace, aviation, military, petroleum, petrochemical, wind power, nuclear power, and other projects, as well as in bridges. It primarily operates under the Sanxia brand name. Chongqing Sanxia Paints Co., Ltd. was formerly known as Chongqing Paint Factory. The company was founded in 1931 and is headquartered in Chongqing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "000703.SZ": {
        "short_name": "HENGYI PETROCHEMIC",
        "long_name": "Hengyi Petrochemical Co., Ltd.",
        "summary": "Hengyi Petrochemical Co., Ltd. produces and sells petrochemical products in China and internationally. Its products include gasoline, diesel oil, kerosene, etc.; and petrochemicals, such as paraxylene, benzene, purified terephthalic acid, and caprolactam; and chemical fiber products, including pre-oriented yarn, fully drawn yarn, draw-textured yarn, polyester staple fiber, polyester chips, and polyester bottle chips. The company's products are used in textile and garment, home textile, and industrial applications. The company was formerly known as Shi Ji Guang Hua Technology Company Limited and changed its name to Hengyi Petrochemical Co., Ltd. in May 2011. Hengyi Petrochemical Co., Ltd. was founded in 1989 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "000830.SZ": {
        "short_name": "LUXI CHEMICAL GP",
        "long_name": "Luxi Chemical Group Co., Ltd.",
        "summary": "Luxi Chemical Group Co., Ltd. manufactures and sells chemical and fertilizer products. It offers coal chemical, salt chemical, and fluorosilicone chemical products; chemical materials; and chemical fertilizers. The company was founded in 1998 and is based in Liaocheng, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Liaocheng"
    },
    "000831.SZ": {
        "short_name": "CHINA MINMETALS RA",
        "long_name": "China Minmetals Rare Earth Co., Ltd.",
        "summary": "China Minmetals Rare Earth Co., Ltd. produces and distributes rare earth oxides, rare earth metals, and rare earth processed products in China and internationally. The company offers lanthanum, cerium, neodymium, europium, gadolinium, terbium, dysprosium, holmium, erbium, lutetium, praseodymium, samarium, and yttrium oxides. It also provides rare earth techniques research and consulting services. The company was formerly known as Shanxi Guanlu Co., Ltd. and changed its name to China Minmetals Rare Earth Co., Ltd. in March 2013. China Minmetals Rare Earth Co., Ltd. was founded in 1998 and is based in Ganzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Ganzhou"
    },
    "000930.SZ": {
        "short_name": "COFCO BIOTECHNOLOG",
        "long_name": "COFCO Biotechnology Co., Ltd.",
        "summary": "COFCO Biotechnology Co., Ltd. produces and sells fuel ethanol, citric acid, and lactic acid in China. The company was formerly known as COFCO Biochemical (Anhui) Co., Ltd. and changed its name to COFCO Biotechnology Co., Ltd. in September 2019. COFCO Biotechnology Co., Ltd. was founded in 1998 and is based in Bengbu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Bengbu"
    },
    "002002.SZ": {
        "short_name": "HONGDA XINGYE CO L",
        "long_name": "Hongda Xingye Co., Ltd.",
        "summary": "Hongda Xingye Co., Ltd. manufactures and sells chemical products in China. The company produces Tianhu PVC, calcium carbide, caustic soda, sodium carbonate, concrete, liquid chlorine, chlorane, green desulfurizer, and other products; chlor-alkali products; and quicklime. It also engages in the mining, refining, and separation of rare earth elements. In addition, the company produces and sells refined rare earth powder, rare earth carbonate, and separated rare earth products, as well as sells refined iron powder. Further, it offers rare-earth-based chemicals and polymer-oriented rare earth promoters; soil conditioners; and pharmaceuticals packaging materials, landscaping materials, PVC eco-house, PVC boards and films, interior and exterior decoration materials, and PVC construction boards. Additionally, the company provides electronic spot trading, logistics, procurement, information, and technical services; and environmental modification engineering services, such as soil remediation, desulfuration, and denitration, as well as develops soil amelioration and environmental improvement technologies. It also engages in the installation of mechanical and electrical equipment; the production and installation of pressure vessels; and the production of electricity and non-standard equipment. The company was formerly known as Jiangsu Golden Material Technology Co., Ltd. and changed its name to Hongda Xingye Co., Ltd. in June 2013. Hongda Xingye Co., Ltd. was founded in 1995 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "002010.SZ": {
        "short_name": "TRANSFAR ZHILIAN C",
        "long_name": "Transfar Zhilian Co., Ltd.",
        "summary": "Transfar Zhilian Co., Ltd. produces and sells chemical products in northern, eastern, and southern China. It operates through Chemicals and Logistics segments. The company's products include dyeing additives, dyes, leather and chemical fiber oils, paint and construction chemicals, butadiene rubbers, fuels, and tires. It also provides transportation subcontracting, storage and logistic, hotel leasing, and logistical value-added services. In addition, the company engages in the joint development of highways and ports. The company was formerly known as Zhejiang Transfar Co.,Ltd. and changed its name to Transfar Zhilian Co., Ltd. in November 2016. Transfar Zhilian Co., Ltd. was founded in 2001 and is headquartered in Hangzhou, China. The company is a subsidiary of Transfar Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "002064.SZ": {
        "short_name": "HUAFON CHEMICAL CO",
        "long_name": "Huafon Chemical Co., Ltd.",
        "summary": "Huafon Chemical Co., Ltd. produces and sells spandex in China. It offers Qianxi spandex yarn, a PU elastic fiber for use in the fields of underwear, swimming suits, socks, jeans, leisure sportswear, medical bandage, fabric ribbon, diapers, etc. It is also involved in producing cyclohexanone, as well as other benzene related products; the import and export of textile products, such as spandex fiber; and dealing with power and heat cogeneration business. The company was formerly known as Zhejiang Huafeng Spandex Co., Ltd. and changed its name to Huafon Chemical Co., Ltd. in January 2021. Huafon Chemical Co., Ltd. was founded in 1999 and is based in Ruian, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Ruian"
    },
    "002163.SZ": {
        "short_name": "HAINAN DEVELOPMEN.",
        "long_name": "Hainan Development Holdings Nanhai Co., Ltd.",
        "summary": "Hainan Development Holdings Nanhai Co., Ltd. manufactures, sells, and installs specialty glass, aviation materials, and PV curtain walls in China and internationally. The company offers glass products, including silica sand, low-e energy efficient glass, ultra-clear TCO glass, glass substrates, aviation glass, high-speed train glass, fire-proof glass, etc.; low-e energy-saving sheet, low iron TCO sheet, low iron PV sheet, and special sheet glass products; special fabricated glass products, such as electronic and solar glass, as well as energy-saving and safety architectural glass products, such as laminated glass, insulated glass, tempered glass, ceramic frit glass, fire-rated glass, bullet-proof glass, etc.; and ultrathin, tinted, and low iron glass products. It also provides single/double silver low-e IGU, temperable low-e, heat reflective glass, flat/bent tempered/HS glass, flat/bent laminated glass, flat/bent IGU, ceramic frit glass, bullet-resistant glass, fire-rated glass, laminated glass, 3D heat curved glass etc. In addition, the company offers high precision electron, electric appliances, solar energy anti-reflective, and anti-glare glasses, as well as magic mirror glass for LCD screens, shield glass, AZO coating glass, coating glass, super flat strengthened glass, glass bases, glass for electronic scales and home electronic appliances, etc. Additionally, the company provides curtain wall, skylight, and cladding systems, as well as aluminum windows and doors. Further, it offers design, processing, construction, and maintenance services; and custom design and engineering, testing, material procurement, fabrication drawing, in-house fabrication, and overseas delivery. The company was formerly known as AVIC Sanxin Co., Ltd. and changed its name to Hainan Development Holdings Nanhai Co., Ltd. in June 2020. Hainan Development Holdings Nanhai Co., Ltd. was founded in 1995 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002226.SZ": {
        "short_name": "ANHUI JIANGNAN CHE",
        "long_name": "Anhui Jiangnan Chemical Industry Co., Ltd.",
        "summary": "Anhui Jiangnan Chemical Industry Co., Ltd. researches, produces, and sells explosives in China. The company offers explosives, including emulsion, powdery emulsion, expanded ammonium nitrate, and modified ammonium explosives; and on-site mixed explosives, such as porous ammonium, mixed emulsion, and heavy ammonium fry explosives. It also provides explosive products comprising source columns, detonating cords, and detonating tube detonators. In addition, the company offers engineering blasting services, which include mine, tunnel, earth and stone, and demolition blasting services; and blasting products, such as emulsifiers, polycrystalline diamonds, nano cerium oxide, and explosive compounds. Further, it develops, constructs, and operates wind farms and photovoltaic power plants. Anhui Jiangnan Chemical Industry Co., Ltd. was founded in 1985 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hefei"
    },
    "002319.SZ": {
        "short_name": "LETONG CHEMICAL CO",
        "long_name": "Letong Chemical Co.,LTD",
        "summary": "Letong Chemical Co.,LTD researches, develops, produces, and sells medium and high-end ink coatings in China. The company offers cigarette packing, UV, printing, PVC and aluminum foil, water-based, and anti-counterfeit specialty inks, as well as composite watches. It also provides powder, automotive, and plastic coatings; and printing spray solutions. The company also exports its products. Letong Chemical Co.,LTD was founded in 1996 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhuhai"
    },
    "002341.SZ": {
        "short_name": "SHENZHEN SELEN SCI",
        "long_name": "Shenzhen Selen Science & Technology Co., Ltd.",
        "summary": "Shenzhen Selen Science & Technology Co., Ltd. engages in the research, development, manufacture, and sale of new materials in China. The company also exports its products to Europe, the United States, South America, Southeast Asia, and internationally. It offers double-sided tapes, optical tapes, protective films, functional tapes, TAC products, graphite sheets, and aluminum-plastic composite films. The company also provides electronic/pharmaceutical/food industry clean-room engineering design, construction, and maintenance integrated solution; ultra clean products research, production, and sales integration services; and clean room products, such as clean-room apparels, clean-room consumables, purification apparatus, air filters, lithium battery package materials, and consumables. In addition, it offers personal care products, including regenerated cellulose long fiber non-woven fabrics; and plastic packages, plastic molds, and blowing molds for use in medical, medical apparatus and instruments, chemical, and other fields. The company serves information technology, consumer electronics, new energy, petroleum refinement, biopharmaceutical, food, daily chemical, automobile manufacturing, and aerospace. Shenzhen Selen Science & Technology Co.,Ltd. was founded in 2002 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002360.SZ": {
        "short_name": "SHANXI TOND CHEMIC",
        "long_name": "Shanxi Tond Chemical Co., Ltd.",
        "summary": "Shanxi Tond Chemical Co., Ltd. researches, produces, sells, imports, and exports civil explosives, silica products, and on-site mixed explosives in China. The company offers ammonium nitrate explosives, emulsified explosives, and ammonium fry; and white carbon black for ordinary rubber products, white carbon black for tires, carrier silica, silicone for silica rubber, silica aerosol, silica thickening and thixotropic agents, silica for coatings, inkjet silica, and silica matting agents. It also provides engineering blasting services. The company is based in Xinzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Xinzhou"
    },
    "002361.SZ": {
        "short_name": "ANHUI SHENJIAN NEW",
        "long_name": "Anhui Shenjian New Materials Co.,Ltd",
        "summary": "Anhui Shenjian New Materials Co.,Ltd engages in researching, producing, and selling saturated polyester resins for powder coatings in chemical materials field in China. The company offers hybrid polyester resins; outdoor polyester resins, including resins for TGIC and Primid powder coating; and PU resins. Anhui Shenjian New Materials Co.,Ltd is based in Wuhu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhu"
    },
    "002386.SZ": {
        "short_name": "YIBIN TIANYUAN GRO",
        "long_name": "Yibin Tianyuan Group Co., Ltd.",
        "summary": "Yibin Tianyuan Group Co., Ltd. produces and distributes chlor-alkali chemicals in China and internationally. Its products include chlorine products, such as ion exchange membrane method sodium hydroxide, liquid chlorine, synthetic industrial hydrochloric acid, trichloroethylene, tetrachloroethylene, artificial rutile, and industrial calcium chloride; PVC products comprising suspension polyvinyl chloride resins; and fine chemical products consisting of hydrazine hydrate and technical grade sodium tripolyphosphate. The company also comprise pipe fittings and plate products, such as PVC-O water supply pipes, PVC drains, PVC electrical bushings, PE gas pipes, PPR hot and cold water pipes, wood plastic products, and upscale ecological interior floor products; building materials, including Portland cement; and calcium carbide. The company is based in Yibin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yibin"
    },
    "002408.SZ": {
        "short_name": "ZIBO QIXIANG TENGD",
        "long_name": "Zibo Qixiang Tengda Chemical Co., Ltd",
        "summary": "Zibo Qixiang Tengda Chemical Co., Ltd. researches, develops, produces, and markets various chemical products in China. Its products include methyl ethyl ketone, isobutylene, maleic anhydride, disproportioated products, butadiene rubber, and carboxyl styrene butadiene latex, as well as tert-butanol and MTBE products. The company also exports its products to the United States, Japan, Canada, South Korea, and India. The company is based in Zibo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zibo"
    },
    "002442.SZ": {
        "short_name": "LONGXING CHEMICAL",
        "long_name": "Longxing Chemical Stock Co., Ltd.",
        "summary": "Longxing Chemical Stock Co., Ltd. produces and sells carbon black products under the Longxing brand in China. The company offers carbon black, precipitated silica, and polyvinylidene fluoride products. Its carbon black is used as reinforcing filler in all-steel, semi-steel radial tires, and inner tubes; used for auto parts, including sealing strips of doors and windows, oil tubes, dampers and brake pads, etc.; and serves as an ingredient in rubber, building materials, electronics, papers, plastics, color masterbatches, paints, fuels, chemical fibers, fiber coloring, printing ink, ink and papermaking, etc. The company also produces electricity, plastic woven products, and iron ore, as well as other products from coal tar deep processing. The company was formerly known as Hebei Longxing Chemical Stock Co., Ltd. and changed its name to Longxing Chemical Stock Co., Ltd. in January 2008. Longxing Chemical Stock Co., Ltd. was founded in 1994 and is based in Shahe, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shahe"
    },
    "002450.SZ": {
        "short_name": "KANGDE XIN GROUP C",
        "long_name": "Kangde Xin Composite Material Group Co., Ltd.",
        "summary": "Kangde Xin Composite Material Group Co., Ltd. engages in the research, development, production, and sales of advanced polymer materials in China and internationally. The company offers laminating film materials, including graphic products, cultural and creative design, image design, printing and packaging, eco laminating materials and laminating equipment, and electronic display products; and prisms, diffusers, cd-free QD films, blue-light transfer films, anti-blue light films, OLED tapes, and vehicle display materials. It also provides hard coating films, protective films, special adhesive tapes, and ITO films; optical insulation film products; carbon fiber decorative films, high performance PDLC films, and other products; materials for flexible displays; capacitive touch screens; and BOPET substrates, self-adhesive protective films, and optical film substrates. In addition, the company develops smart high definition glasses-free 3D display technology. The company was formerly known as Jiangsu Kangde Xin Composite Material Co., Ltd. and changed its name to Kangde Xin Composite Material Group Co., Ltd. in June 2016. Kangde Xin Composite Material Group Co., Ltd. was founded in 2001 and is based in Zhangjiagang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhangjiagang"
    },
    "002455.SZ": {
        "short_name": "JIANGSU BAICHUAN H",
        "long_name": "Jiangsu Baichuan High-Tech New Materials Co., Ltd",
        "summary": "Jiangsu Baichuan High-Tech New Materials Co., Ltd. produces and sells fine chemical products in China and internationally. Its products include acetates, acid anhydrides, plasticizer, polyatomic alcohols, insulating resins, and enamel wire paints, as well as propylene glycol ether and its esters. The company offers acetic ester products, such as n-butyl acetate, ethyl acetate, and propyl acetate; trimellitic anhydride and trioctyl trimellitate; trimethylolpropane, di-trimethylolpropane, and sodium formate; and glycol ether products, including propylene glycol monomethyl ether, propylene glycol monomethyl ether acetate, 2-methoxy-1-propanol, 2-methoxy-1-propanol acetate, and dipropylene glycol methyl ether. Its products have applications in various fields, such as paintings, cementing compounds, pharmaceutical and medical treatment, household appliances, carpentry furniture, finishing and decoration, toys for children, package printing, industrial equipment, road marking, etc. The company was formerly known as Wuxi Baichuan Chemical Industrial Co.,Ltd and changed its name to Jiangsu Baichuan High-Tech New Materials Co., Ltd. in March 2018. Jiangsu Baichuan High-Tech New Materials Co., Ltd. is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiangyin"
    },
    "002466.SZ": {
        "short_name": "TIANQI LITHIUM COR",
        "long_name": "Tianqi Lithium Corporation",
        "summary": "Tianqi Lithium Corporation, a new energy materials company, engages in the lithium resource investment, lithium concentrate extraction, and production of advanced lithium specialty compounds in Australia, Chile, and China. Its products include battery and industrial grade lithium carbonate and lithium hydroxide monohydrate, lithium chloride anhydrous, and lithium metal. The company was founded in 1995 and is based in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "002497.SZ": {
        "short_name": "SICHUAN YAHUA INDU",
        "long_name": "Sichuan Yahua Industrial Group Co., Ltd.",
        "summary": "Sichuan Yahua Industrial Group Co., Ltd., together with its subsidiaries, researches, produces, and sells civil explosive materials in China and internationally. It offers detonating equipment, including electronic, coal mine permissible millisecond electric, coal mine allowable instantaneous electric, and average delay electric detonators, as well as detonating tubes, plastic nonels, and ordinary detonating cords; and industrial explosives, such as rock expanded ammonium nitrate, rock emulsion, permissible emulsion, level 3 coal mine permissible emulsion, and powder emulsion explosives. The company also provides fine chemicals comprising powder composite oil phase, emulsion composite oil phase, emulsifierÂ\u00961, and emulsifying agent SÂ\u009680. In addition, it offers engineering blasting, transport of dangerous goods, and explosion working services, as well as lithium products and services consisting of lithium hydroxide monohydrate, clean lithium hydroxide monohydrate, lithium carbonate, and battery grade lithium carbonate. Its products are used in mining, hydraulic engineering, hydropower station, road construction, urban renewal, geological exploration, blasting processing, national defense, etc. The company was founded in 1952 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "002568.SZ": {
        "short_name": "SHANGHAI BAIRUN IN",
        "long_name": "Shanghai Bairun Investment Holding Group Co., Ltd.",
        "summary": "Shanghai Bairun Investment Holding Group Co., Ltd. engages in the research and development, production, sale, and service of flavors and fragrances under the brand Bairun in China. Its products are used in beverage, dairy, confectionary, bakery, ice cream, savory, oral care, and tobacco products. The company was formerly known as Shanghai Bairun Flavor & Fragrance Co., Ltd. and changed its name to Shanghai Bairun Investment Holding Group Co., Ltd. in December 2015. The company was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "002581.SZ": {
        "short_name": "SHANDONG SINOBIOWA",
        "long_name": "Shandong Sinobioway Biomedicine Co., Ltd.",
        "summary": "Shandong Sinobioway Biomedicine Co., Ltd. manufactures and supplies trimethyl orthoformate, triethyl orthoformate, trimethyl orthoacetate, phosphorous acid, ethyl formate, nerve growth factor, and alfaron in China. The company also provides NOBEX, a murine nerve growth factor for injection; Anferon, a human recombinant interferon alpha 2b injection; and Jaferon, a human recombinant interferon alpha 2b spray. In addition, it offers Healive, an inactivated hepatitis A vaccine; Bilive, a combined hepatitis A and B Vaccine; Panflu, a pandemic influenza vaccine; Anflu, a preservative-free influenza virus vaccine; Panflu.1, a Type A H1N1 influenza vaccine; etc. Further, the company exports its products to approximately 20 counties and regions in Europe and the United States. Shandong Sinobioway Biomedicine Co., Ltd. was founded in 2000 and is headquartered in Zibo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zibo"
    },
    "002591.SZ": {
        "short_name": "JIANGXI HENGDA HI-",
        "long_name": "Jiangxi Hengda Hi-Tech Co.,Ltd.",
        "summary": "Jiangxi Hengda Hi-Tech Co.,Ltd. researches, develops, produces, and sells anti-wear and anti-corrosion materials for industrial equipment in China. The company offers acoustic noise reduction and environmental protection, and garbage stove anti-corrosion equipment. It is also involved in software and game, PC-side applications, and mobile APP distribution business. In addition, the company provides technical engineering services to anti-wear and anti-corrosion materials. Its products are used in power, steel, cement, petrochemical, subway, airport, stadium, and other industries. The company was founded in 1993 and is headquartered in Nanchang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nanchang"
    },
    "002601.SZ": {
        "short_name": "LOMON BILLIONS GRO",
        "long_name": "Lomon Billions Group Co., Ltd.",
        "summary": "Lomon Billions Group Co., Ltd., an inorganic fine chemical company, manufactures and sells titanium dioxide pigments worldwide. The company offers titanium dioxide, zirconium, titanium sponge, sulfuric acid, and mineral products for use in indoor and outdoor paints, inks, plastics, paper, electronics, rubber, fibers, ceramics, enamels, cosmetics, pharmaceuticals, and sunscreen product applications. It provides its products under the Xuelian and Mang, as well as LOMON and BILLIONS brand names. The company was formerly known as Henan Billions Chemicals Co., Ltd. and changed its name to Lomon Billions Group Co., Ltd. in February 2017. Lomon Billions Group Co., Ltd. was founded in 1955 and is headquartered in Jiaozuo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiaozuo"
    },
    "002632.SZ": {
        "short_name": "DAOMING OPTICS&CHE",
        "long_name": "Daoming Optics&Chemical Co.,Ltd",
        "summary": "Daoming Optics&Chemical Co.,Ltd manufactures and sells reflective materials in China and internationally. The company offers reflective sheeting and fabrics, vehicle conspicuity tapes, vehicle number plates, and safety garments. It also provides personal and road safety products, finished products, safety vests, release papers, and glass beads. The company was founded in 2002 and is based in Yongkang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yongkang"
    },
    "002666.SZ": {
        "short_name": "GUANGDONG DELIAN G",
        "long_name": "Guangdong Delian Group Co., Ltd.",
        "summary": "Guangdong Delian Group Co., Ltd., together with its subsidiaries, engages in the automobile fine chemicals, automobile sales service, and automobile repair and maintenance businesses in China. It offers aftermarket products, such as motor oils, gearbox oils, power steering oils, coolant, and brake fluids, as well as car care products. The company was founded in 1984 and is headquartered in Foshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Foshan"
    },
    "002669.SZ": {
        "short_name": "SHANGHAI KANGDA NE",
        "long_name": "Shanghai Kangda New Materials Group Co., Ltd.",
        "summary": "Shanghai Kangda New Materials Group Co., Ltd. engages in the research and development, manufacture, and sale of adhesives and sealants in the People's Republic of China. It offers approximately 200 types of products, including epoxy adhesives, polyurethane adhesives, acrylate AB adhesives, cyanoacrylate adhesives, UV curing adhesives, silicon rubbers, anaerobic adhesives, butyl hot melt adhesives, industrial repair putty products, spray polyurea, and others. The company's products are primarily used in the fields of automotive assembly, engineering, plastic, maintenance and repair, loudspeaker assembling, wind and solar energy power plants, environmental packing, transportation, anti-corrosion, ports and mines, rubber conveyer belt repairing, elevator manufacturing, military equipment, mechanical equipment, electronic appliances, construction reinforcement, and others. In addition, it provides technical support and after-sale services. The company was formerly known as Shanghai KangDa New Materials Co., Ltd. and changed its name to Shanghai Kangda New Materials Group Co., Ltd. in September 2019. Shanghai Kangda New Materials Group Co., Ltd. was founded in 1988 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "002676.SZ": {
        "short_name": "GUANGDONG SUNWILL",
        "long_name": "Guangdong Sunwill Precising Plastic Co.,Ltd",
        "summary": "Guangdong Sunwill Precising Plastic Co.,Ltd designs, manufactures, and sells air conditioner fans and engineering plastics primarily in China. Its products include cross flow fans, axial fans, centrifugal fans, plastic housings, PVC tubes, plastic molds, and various kinds of modified engineering plastics. The company also offers plastic products comprising auto parts, pipe parts, electric appliances, mold displays, and other products; micro irrigation equipment, such as filters, micro and spray nozzles, drip stoppers, and emitters; and plastic injection and assembly, and after-sale services. In addition, it provides cross-flow, axial-flow, and centrifugal fan blades, as well as fan housings for household, business, and vehicle air conditioners and plastic car parts; and electric machines and materials, sanitary products, pipeline parts, metal products, electric products, and packaging materials. The company was founded in 1992 and is based in Foshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Foshan"
    },
    "002683.SZ": {
        "short_name": "GUANGDONG HONGDA B",
        "long_name": "Guangdong Hongda Blasting Co.,Ltd.",
        "summary": "Guangdong Hongda Blasting Co., Ltd. provides mine explosion integration services in China. It offers open-pit mine mining and stripping services, as well as undertakes underground mine plate construction and mining works. The company also researches and develops, produces, and manages civilian blasting equipment and technology, including emulsion explosives, ammonium nitrate explosives, industrial electric detonators, tube detonators, plastic detonating tube, and relay detonators. In addition, it provides engineering blasting services, such as chimney folding blasting and other blasting demolition services. The company was founded in 1988 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "002709.SZ": {
        "short_name": "GUANGZHOU TINCI MA",
        "long_name": "Guangzhou Tinci Materials Technology Co., Ltd.",
        "summary": "Guangzhou Tinci Materials Technology Co., Ltd. manufactures and markets lithium-ion battery materials in China. It offers electrolytes of li-ion battery, solvents, and lithium salts. The company was founded in 2000 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "002741.SZ": {
        "short_name": "GUANGDONG GUANGHUA",
        "long_name": "Guangdong Guanghua Sci-Tech Co., Ltd.",
        "summary": "Guangdong Guanghua Sci-Tech Co., Ltd. produces and sells electronic chemicals, chemical reagents, and other specialty chemicals in China. The company offers copper nitrate, copper carbonate basic, cupric pyrophosphate, copper oxide, copper chloride, copper sulfate pentahydrate, nickel carbonate basic, nickel acetate, nickel chloride hexahydrat, nickel sulfamate solution, nickel sulfate hexahydrate, tin sulfate, sodium stannate trihydrate, potassium stannate trihydrate, tin chloride dihydrate, tin methanesulfonate solution, cobalt sulfamate solution, cobalt sulfate, cobalt acetate, cobalt nitrate, cobalt chloride, and potassium pyrophosphate. It also provides nickel sulfate, manganese sulfate monohydrate, cobalt sulfate, ternary precursor, lithium iron phosphate, lithium manganese iron phosphate, and ironic phosphate; plating additives; pcb solutions; oxide/peroxidate, inorganic acid, etc.; salts of organic acids, hydrocarbon/ substituted hydrocarbons, alcohol/ phenol/ether/ketone, nitrile/amine/urea, etc.; and biochemical reagent, chromatographic reagent, pH and redox indicator, photochemistry and electrochemical analysis reagent, etc. The company serves printed circuit board, energy materials, auto parts, electronic components, medicine, chemical, bathroom hardware, research and development, and e-commerce industries. It exports its products to Southeast Asia, Europe, the United States, and internationally. The company was formerly known as Shantou Guanghua Chemical Factory Co.,Ltd. and changed its name to Guangdong Guanghua Sci-Tech Co., Ltd. in 2010. Guangdong Guanghua Sci-Tech Co., Ltd. was founded in 1980 and is headquartered in Shantou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shantou"
    },
    "002753.SZ": {
        "short_name": "SHANXI YONGDONG CH",
        "long_name": "Shanxi Yongdong Chemistry Industry Co., Ltd.",
        "summary": "Shanxi Yongdong Chemistry Industry Co., Ltd. manufactures and sells carbon black and fine chemical products in China. The company is based in Yuncheng, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yuncheng"
    },
    "002783.SZ": {
        "short_name": "HUBEI KAILONG CHEM",
        "long_name": "Hubei Kailong Chemical Group Co., Ltd.",
        "summary": "Hubei Kailong Chemical Group Co., Ltd. engages in the production and sale of explosive materials in China. The company offers civil explosive; nano-calcium carbonate; nitro compound fertilizers; ammonium nitrate; and paper plastic packaging products. It also engages in the engineering blasting business. Hubei Kailong Chemical Group Co., Ltd. was founded in 1967 and is based in Jingmen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jingmen"
    },
    "002809.SZ": {
        "short_name": "GUANGDONG REDWALLA",
        "long_name": "Guangdong Redwall New Materials Co., Ltd.",
        "summary": "Guangdong Redwall New Materials Co., Ltd. produces and sells concrete admixtures in China and internationally. It offers polycarboxylates, polycarboxylate superplasticizers, polynaphthalene sulfonate sodium salts, and polycarboxylate sodium salts. The company is headquartered in Huizhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Huizhou"
    },
    "002827.SZ": {
        "short_name": "TIBET GAOZHENG EXP",
        "long_name": "Tibet GaoZheng Explosive Co., Ltd.",
        "summary": "Tibet GaoZheng Explosive Co., Ltd. produces and sells civilian explosives in China. The company offers powdered emulsion explosives and emulsion gel explosives. It also engages in the transportation and distribution of dangerous goods, general cargo transportation and distribution, loading and unloading and transportation agents, cargo storage management, vehicle repair and maintenance, etc. The company was founded in 2014 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Lhasa"
    },
    "002838.SZ": {
        "short_name": "SHANDONG DAWN POLY",
        "long_name": "Shandong Dawn Polymer Co.,Ltd.",
        "summary": "Shandong Dawn Polymer Co.,Ltd. manufactures and sells modified plastics and thermoplastic elastomers. The company offers automobile material, flame retardant plastic, flame retardant reinforced plastic, glass fiber reinforced plastic, plastic alloy, high-melt woven plastic, filler masterbatch, color masterbatch, and special engineering plastic products. Its products are used in automobile, military, electronic, and aviation industry fields. The company also supplies FAW, DFM, CMCC, ISZU, Hair, Hisense, Joyoung, and home appliances manufacturer products. It has operations in China, Europe, East South of Asia, and South Africa. The company is based in Longkou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Longkou"
    },
    "002859.SZ": {
        "short_name": "ZHEJIANG JIEMEI EL",
        "long_name": "Zhejiang Jiemei Electronic And Technology Co., Ltd.",
        "summary": "Zhejiang Jiemei Electronic And Technology Co., Ltd. provides consumable materials of electronic components. Its principal products include un-punched paper tapes, pre-punched paper tapes, press pocket paper tapes, top and bottom tapes, embossed tapes and its covers, and release films. The company was founded in 2001 and is headquartered in Huzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Huzhou"
    },
    "002886.SZ": {
        "short_name": "SHENZHEN WOTE ADVA",
        "long_name": "Shenzhen WOTE Advanced Materials Co., Ltd",
        "summary": "Shenzhen WOTE Advanced Materials Co., Ltd. researches, develops, produces, sells, trades in, and services polymer materials and engineering plastic products in China and internationally. The company offers PES, PEEK, and LCP high temperature materials; aramid products; carbon-fiber reinforced materials; wear resistant lubricated materials; carbon black powder reinforced electronic conductive products; high gloss spray-free materials; nano-composite materials; and modified PPO, PC, and PC/ABS series materials. Shenzhen WOTE Advanced Materials Co., Ltd. was founded in 2001 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002909.SZ": {
        "short_name": "GUANGZHOU JOINTAS",
        "long_name": "Guangzhou Jointas Chemical Co., Ltd.",
        "summary": "Guangzhou Jointas Chemical Co., Ltd. produces and sells sealants and coatings in China. The company offers acetic silicone, door and window, structural, insulating glass, two-component, polyurethane, test, weather-proof, glass, and automobile/ship sealants, as well as sealants for construction and freight container applications. It also provides water-based latex and anti-corrosion paints, as well as asphalt undercoating products. The company was founded in 1988 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "002915.SZ": {
        "short_name": "ZHEJIANG ZHONGXIN",
        "long_name": "Zhejiang Zhongxin Fluoride Materials Co.,Ltd",
        "summary": "Zhejiang Zhongxin Fluoride Materials Co., Ltd engages in the research, manufacture, and sale of fluorine fine chemicals in China. The company offers fluorine-containing cyanobenzene, benzoic acid, phenol, phenylcarbinol, phenylamine, nitrobenzene, and fluorine-containing arene series products, as well as acetophenone, heterocyclic ring, and other series products. Its fluorine chemicals cover medical intermediates, pesticide intermediates, new materials, and electronic chemicals. The company also exports its products to Germany, Japan, and India. Zhejiang Zhongxin Fluoride Materials Co., Ltd was founded in 2000 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shaoxing"
    },
    "003002.SZ": {
        "short_name": "SHANXI HUHUA GROUP",
        "long_name": "Shanxi Huhua Group Co., Ltd.",
        "summary": "Shanxi Huhua Group Co., Ltd. engages in the research and development, production, and sale of civil explosive equipment in China. The company offers digital electronic, high-intensity detonating tube, seismic exploration, magnetic, industrial electric, detonating tube, and high precision extended body detonators; colloidal emulsion, modified ammonium fry, powder emulsion, and expanded ammonium nitrate explosives; and explosive devices. It also provides import and export, and blasting services. The company exports its products to 16 countries and regions, including Australia, South Africa, Chile, Indonesia, and Mongolia. Shanxi Huhua Group Co., Ltd. was founded in 1960 and is based in Changzhi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhi"
    },
    "003015.SZ": {
        "short_name": "JIANGSU RIJIU OPTO",
        "long_name": "Jiangsu Rijiu Optoelectronics Jointstock Co., Ltd",
        "summary": "Jiangsu Rijiu Optoelectronics Jointstock Co., Ltd. engages in the development, production, and sale of ITo film and optical hardened film products. It offers ISD, TSD, ISE, and TSE series products. The company was formerly known as Kunshan Rijiu New Energy Applied Materials Co., Ltd. and changed its name to Jiangsu Rijiu Optoelectronics Jointstock Co., Ltd in January 2015. Jiangsu Rijiu Optoelectronics Jointstock Co., Ltd. was founded in 2010 and is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Kunshan"
    },
    "003032.SZ": {
        "short_name": "JIANGSU CHUANZHIBO",
        "long_name": "Jiangsu Chuanzhi Podcast Education Technology Co., Ltd.",
        "summary": "Jiangsu Chuanzhi Podcast Education Technology Co., Ltd. provides IT training courses. It offers courses in the areas of JavaEE; HTML and JS+ front end; Big Data; Python and data analysis; UI/UE design; software testing; Linux cloud computing, operation, and maintenance development; UI/UE design; and E-commerce visual operation. The company was founded in 2006 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "0301.HK": {
        "short_name": "SANVO CHEMICALS",
        "long_name": "SANVO Fine Chemicals Group Limited",
        "summary": "SANVO Fine Chemicals Group Limited, an investment holding company, researches and develops, manufactures, and sells fine industrial chemical products in the People's Republic of China, Australia, and internationally. The company operates through three segments: Aerosols, Organic Silicone Adhesives, and Synthetic Adhesive. The Aerosols segment offers spray paints and automotive care products, including spray paints, carburetor cleaners, spray waxes, anti-rust spray lubricants, polyurethane foams, cleaning sprays, and spray refrigerants for automobile air-conditioners. The Organic Silicone Adhesives segment provides silicone-based adhesive. The Synthetic Adhesive segment engages in the sale of multi-purpose contact adhesives. Its products are used for hardware and building materials, and automotive maintenance applications. The company sells its products under the SANVO and FullTeam brand names. SANVO Fine Chemicals Group Limited was founded in 2002 and is headquartered in Zhongshan, the People's Republic of China. SANVO Fine Chemicals Group Limited is a subsidiary of Sanvo Fine Chemicals Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Zhongshan"
    },
    "0546.HK": {
        "short_name": "FUFENG GROUP",
        "long_name": "Fufeng Group Limited",
        "summary": "Fufeng Group Limited, an investment holding company, engages in the manufacture and sale of fermentation-based food additive, and biochemical and starch-based products in the People's Republic of China and internationally. It operates through Food Additives, Animal Nutrition, High-End Amino Acid, Colloid, and Other segments. The Food Additives segment manufactures and sells monosodium glutamate, starch sweeteners, glutamic acid, compound seasoning, and corn oil. The Animal Nutrition segment manufactures and sells corn refined products, threonine, and lysine. The High-End Amino Acid segment offers high-end amino acid products. The Colloid segment provides xanthan and gellan gum products. The Other segment offers fertilisers, synthetic ammonia, pharmaceuticals, and other products. It also engages in the manufacture and sale of autoclaved aerated concrete blocks, eubacteria material medicine, preparations and food additives, bricks, and other related products; research and development, promotion, and industrialization of new biological techniques and achievements; sale of cosmetics, biological products, and health food and other related products; and provision of logistics and equity investment services, as well as information services of biological techniques. Fufeng Group Limited was founded in 1999 and is based in Linyi, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Linyi"
    },
    "1337.TW": {
        "short_name": "ASIA PLASTIC RECYCLING HOLDING ",
        "long_name": "Asia Plastic Recycling Holding Limited",
        "summary": "Asia Plastic Recycling Holding Limited engages in the waste plastic scrap recycling business in China. It is involved in the research and development, manufacture, and sale of ethylene-vinyl acetate copolymer foam materials for use in footwear and luggage products, toys, sporting goods, building materials, automotive interior, and electronic accessories. The company is headquartered in Jinjiang, China.",
        "currency": "TWD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "China",
        "city": "Jinjiang"
    },
    "1440.HK": {
        "short_name": "DEYUN HOLDING",
        "long_name": "Deyun Holding Ltd.",
        "summary": "Deyun Holding Ltd., an investment holding company, engages in the manufacture of lace and provision of dyeing services in the People's Republic of China and Hong Kong. The company manufactures and sells lace for customers to produce branded lingerie and other products on order-by-order basis. It also offers dyeing services primarily to lace and swim wear manufacturers. The company also exports its products to other countries, including Thailand, Vietnam, and Latvia. In addition, it is involved in the lease of an investment property through operating lease. The company was founded in 2002 and is headquartered in Fuzhou, China. Deyun Holding Ltd. operates as a subsidiary of Deyong Investment Co., Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "1950.HK": {
        "short_name": "SUNLIGHT TECH H",
        "long_name": "Sunlight Technology Holdings Limited",
        "summary": "Sunlight Technology Holdings Limited engages in the research and development, manufacture, and sale of coating agents and synthetic resins in the People's Republic of China. It offers a range of faux leather chemical products, including colourants, such as colour paste and colour chips, finishes, additives, and synthetic resins for the manufacturing of PU leather and PVC leather. The company serves manufacturers of synthetic leather, trading entities, and distributors. Sunlight Technology Holdings Limited was founded in 2003 and is headquartered in Hangzhou, the People's Republic of China. Sunlight Technology Holdings Limited is a subsidiary of Sunlight Global Investment.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "1986.HK": {
        "short_name": "TSAKER CHEM",
        "long_name": "Tsaker Chemical Group Limited",
        "summary": "Tsaker Chemical Group Limited, an investment holding company, manufactures and sells fine chemicals. It operates through four segments: Dye and Agricultural Chemical Intermediates, Pigment Intermediates, Environmental Technology Consultancy Service, and Battery Materials. The Dye and Agricultural Chemical Intermediates segment produces dye intermediate products for use in the production of dye related products, as well as products for use in the production of agricultural chemicals. The Pigment Intermediates segment produces pigment intermediate products for use in the production of pigments. The Environmental Technology Consultancy Service segment engages in environmental protection activities. The Battery Materials segment manufactures and sells battery materials. The company operates in Mainland China, Indonesia, India, the United States, Germany, Brazil, Spain, Taiwan, Turkey, Japan, Italy, Korea, and internationally. Tsaker Chemical Group Limited was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2116.HK": {
        "short_name": "JS INNOV",
        "long_name": "Jiangsu Innovative Ecological New Materials Limited",
        "summary": "Jiangsu Innovative Ecological New Materials Limited, through its subsidiaries, develops, manufactures, and markets oil refining agents and fuel additives in China, Sudan, Chad, Niger, and Algeria. The company was founded in 2002 and is headquartered in Yixing, the People's Republic of China. Jiangsu Innovative Ecological New Materials Limited is a subsidiary of Innovative Green Holdings Limited.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Yixing"
    },
    "2198.HK": {
        "short_name": "CHINA SANJIANG",
        "long_name": "China Sanjiang Fine Chemicals Company Limited",
        "summary": "China Sanjiang Fine Chemicals Company Limited, an investment holding company, manufactures and supplies ethylene oxide and glycol, propylene, polypropylene, methyl tert-butyl ether (MTBE), and surfactants in the People's Republic of China. Its ethylene oxide is used as an intermediary component for the production of ethylene derivative products that include ethanolamines and glycol ethers, and a range of surfactants; ethylene glycol is used to produce other bio-organic chemical products that comprise mono ethylene glycol; propylene is used in the production of polypropylene, acrylonitrile, propylene oxide, acetone, etc.; polypropylene is a thermoplastic resin used in knitting, injection molding, film, fiber, and pipe products; MTBE, a gasoline additive used as an oxygenate to raise the octane number and used as a fuel component in fuel for gasoline engines; and surfactants are applied in various industries as scouring agents, moisturizing agents, emulsifiers, and solubilisers. The company also produces and supplies other chemical products, such as C4; crude pentene; and industrial gases, such as oxygen, nitrogen, and argon. In addition, it offers processing services for polypropylene, MTBE, and surfactants; and lease and storage services, as well as provides asset management services. Further, the company is involved in the construction and management of a pipe network at Jiaxing Port Chemical Industrial Park; manufacture and sale of alcohol ethoxylate, nonylphenols, textile auxiliaries, and polyethylene; and equipment rental. China Sanjiang Fine Chemicals Company Limited was incorporated in 2009 and is headquartered in Jiaxing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Jiaxing"
    },
    "300019.SZ": {
        "short_name": "CHENGDU GUIBAO SCI",
        "long_name": "Chengdu Guibao Science & Technology Co.,Ltd.",
        "summary": "Chengdu Guibao Science & Technology Co.,Ltd. engages in the research, development, manufacture, and sale of organic silicone sealants and silicone rubber strips in the People's Republic of China. It offers curtain wall, insulating glass, window and door, interior decoration, concrete joint, car light, solar module, and anti-corrosion sealants, as well as silicone gaskets; and silicone sealants for roads and bridges and other applications. The company is also involved in the research and development, manufacture, and sale of silane coupling agents. In addition, it provides investment management and related consultation services, as well as solutions for home furnishings, ornaments, and decorations; wholesales and retails silicone rubber products; and engages in the design, construction, and contracting of anti-corrosion system solutions. The company was founded in 1998 and is based in Chengdu, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "300037.SZ": {
        "short_name": "SHENZHEN CAPCHEM T",
        "long_name": "Shenzhen Capchem Technology Co., Ltd.",
        "summary": "Shenzhen Capchem Technology Co., Ltd. researches and develops, produces, sells, and services electronic and functional materials in China. It offers chemicals for lithium-ion batteries, super capacitors, high pure chemical reagents, cover discs, and semiconductors, as well as aluminum electrolytic, nuclear power, and photoelectric polymer materials. The company also exports its products to Japan, South Korea, the United States, Brazil, Europe, and other countries and regions. The company was formerly known as Shenzhen Capchem Chemicals Co., Ltd. and changed its name to Shenzhen Capchem Technology Co., Ltd. in 2008. Shenzhen Capchem Technology Co., Ltd. was founded in 2002 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300041.SZ": {
        "short_name": "HUBEI HUITIAN NEW",
        "long_name": "Hubei Huitian New Materials Co., Ltd.",
        "summary": "Hubei Huitian New Materials Co., Ltd. researches, develops, manufactures, and sells adhesives and sealants in China and internationally. It offers auto lamp silicone sealants, PU sealants, epoxy adhesives, polyurethane products, MS sealants, anaerobic thread locker products, RTV silicones, glue holding parts, and structure bonding products; RTV gasket maker products, economic glues, and acrylic structural adhesives; polyurethane sealants, silicone joint sealants, polyurethane waterproof coatings, and convex block platform filled polyurethane resins; civil, curtain wall, and hollow glass adhesives; and single unit and double unit PU products. The company also provides power supplier potting products, UV-curing adhesives for vacuum cleaners, single RTV silicones, heat resistant silicones, bonding sealants, PCB cover adhesives, high performance silicones, UV adhesives, HTV single silicones, PUR adhesives, low temperature epoxy products, SMT adhesives, COB encapsulation products, LED crystal-fixing products, adhesives for said electronic panels, adhesives for naked-eye 3D displays, LED lighting products, silicone greases, LED screen potting products, LED encapsulation products, medical metal and plastic bonding products, LCD tube feet seal products, LCD sealing products, FPC IC UV protection products, glass thinning and cutting adhesives, glass panel pattern products, PET transfer print products, and double unit acrylic products. Its products are used in the industrial, automobile, electronic, high-speed rail, architecture, flexible package, water treatment, and photovoltaic sectors. The company was formerly known as Hubei Huitian Adhesive Enterprise Co., Ltd. and changed its name to Hubei Huitian New Materials Co., Ltd. in April 2014. Hubei Huitian New Materials Co., Ltd. was founded in 1977 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300054.SZ": {
        "short_name": "HUBEI DINGLONG CO",
        "long_name": "Hubei Dinglong CO.,Ltd.",
        "summary": "Hubei Dinglong Co., Ltd. designs, develops, manufactures, and sells imaging materials for toner and ink products worldwide. It offers color chemical polymerized toners; solvent colorants for inkjets; and plastic colorants, including perinone and anthraquinones dyes. The company also provides charge control agents to control the tribo-charge of toner used in photocopier and laser printers; and charge control agent, pigment, wax, and resin dispersions, as well as latex materials. In addition, it offers organic pigments of carbazole dioxathion for use in coatings, plastic products, organic glasses, rubber products, textile printing, solvent inks, etc.; and color laser toner cartridges. The company was formerly known as Hubei Dinglong Chemical Co., Ltd and changed its name to Hubei Dinglong Co., Ltd. in September 2016. Hubei Dinglong Co., Ltd. was founded in 2000 and is headquartered in Wuhan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhan"
    },
    "300063.SZ": {
        "short_name": "GUANGDONG SKY DRAG",
        "long_name": "Guangdong Tloong Technology Group Co., Ltd.",
        "summary": "Guangdong Tloong Technology Group Co., Ltd. researches, develops, and sells various printing ink products in China and internationally. The company offers water-based printing inks for use in corrugated paper printing; HD printing for corrugated paper; pre-printing; and printing on SPE, DPE, PP, OPP, and aluminum foils. It also provides gravure printing inks for plastic surface printing on PE, BOPP, PET, NY, and CPP; and paper surface printing for coated and craft papers. In addition, the company offers offset printing inks and acrylic resins, as well as water-based, waterproof, pre-printing, and UV resigns. The company was formerly known as Guangdong Sky Dragon Printing Ink Group Co., Ltd. and changed its name to Guangdong Tloong Technology Group Co., Ltd. in November 2020. Guangdong Tloong Technology Group Co., Ltd. was founded in 1993 and is headquartered in Zhaoqing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhaoqing"
    },
    "300067.SZ": {
        "short_name": "SHANGHAI ANOKY GRO",
        "long_name": "Shanghai Anoky Group Co., Ltd.",
        "summary": "Shanghai Anoky Group Co., Ltd. provides dyeing and finishing solutions for textile fabrics and special needs in China and internationally. It produces and sells disperse dyes under the ANOCRON brand, reactive dyes under the ANOZOL brand, wool reactive dyes under the ANOFIX brand, acid dyes under the ANOSET brand, finishing auxiliaries under the ANOKE brand, and polyamide dyes under the ANOMEN brand. The company was formerly known as Shanghai ANOKY Textile Chem Co., Ltd. and changed its name to Shanghai Anoky Group Co., Ltd. in October 2014. Shanghai Anoky Group Co., Ltd. was founded in 1999 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300072.SZ": {
        "short_name": "BEIJING SANJU ENVI",
        "long_name": "Beijing Sanju Environmental Protection & New Materials Co., Ltd.",
        "summary": "Beijing Sanju Environmental Protection & New Materials Co., Ltd. engages in the research and development of sulfur removal agents and catalysts, other scavengers, and specialty catalysts in the People's Republic of China. Its products are used in petroleum refining and petrochemical, natural gas chemical, and coal chemical industries, as well as in oil field, biogas, iron and steel, and other fields. The company also provides technical consultation, and engineering and design services; and sulfur removal services. In addition, it produces desulfurizers and modular desulfurization packages. The company exports its products to the United States, India, the Middle East, North Africa, Southeast Asia, and other countries and regions. Beijing Sanju Environmental Protection & New Materials Co., Ltd. was founded in 1997 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300082.SZ": {
        "short_name": "LIAO NING OXIRANCH",
        "long_name": "Liaoning Oxiranchem,Inc.",
        "summary": "Liaoning Oxiranchem,Inc. researches, produces, and sells ethylene oxide derivative fine chemicals in China. It offers crystalline silicon cutting liquids for the photovoltaic industry; water reducing agents for cement; and polyethylene glycol for use in various applications in plastics, papermaking, paints, electroplating, pesticide, melt, and food processing industries. The company is based in Liaoyang, China. Liaoning Oxiranchem,Inc. is a subsidiary of Oxiranchem Holding Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Liaoyang"
    },
    "300088.SZ": {
        "short_name": "WUHU TOKEN SCIENCE",
        "long_name": "Wuhu Token Sciences Co., Ltd.",
        "summary": "Wuhu Token Sciences Co., Ltd. engages in the research and development, manufacturing, sale, and service of vacuum deposited thin film materials. It offers touch integrated flat displays, including transparent ITO conductive glass, touch sensor, TFT-LCD cell slimming, touch modules, TFT-LCD LCM, and touch integrated TFT-LCD display modules. Its products include coating, touch glass, glass processing, and glass thinning. Wuhu Token Sciences Co., Ltd. was founded in 2000 and is based in Wuhu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhu"
    },
    "300107.SZ": {
        "short_name": "HEBEI JIANXIN CHEM",
        "long_name": "Hebei Jianxin Chemical Co., Ltd.",
        "summary": "Hebei Jianxin Chemical Co., Ltd. researches and develops, manufactures, and sells dyes intermediates in China. It offers metanilic acid, aniline-2, 5-disulfonic acid monosodium salt, 3- diethylaminophenol, m-aminophenol, sulfanilic acid, ODB-1, ODB-2, R-04, EBA, BBA, MMD, DPA, DBSP, BON, and n-butyl bromide. The company also provides 3,3'-dinitrodiphenyl sulfone; 3,3'-diamino diphenyl sulphone; 4,4'-dichloro diphenyl sulphone; 4,4'-diamino diphenyl sulfone; and m-trihydroxybenzene. Its products are used as intermediates for dyes, medicine, fiber, pesticide, dyestuffs, and synthesizing health care products; OBA for paper; color formers for thermal and carbonless paper; and developer and sensitizer for thermal paper. The company's products are also used as alkylating agent, solvent, and extracting agent for rare elements and organic synthesis; materials for curing agents, epoxy resins, engineering plastics, dyestuffs, polysulfone amides, and other polymers; monomer for polysulfonamide fiber; and pharmaceutical and auxiliary intermediates. It also exports its products to Europe, the United States, Japan, Korea, Taiwan, and Hong Kong. The company is headquartered in Cangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Cangzhou"
    },
    "300192.SZ": {
        "short_name": "SUZHOU KINGSWOOD E",
        "long_name": "Suzhou Kingswood Education Technology Co., Ltd.",
        "summary": "Suzhou Kingswood Education Technology Co., Ltd. manufactures and sells printing inks in China. It offers LED UV Ink, Universal offset UV ink, and Web offset inks, as well as Speedy-ISO, Globy-ISO, Greentec, Pantone colors, U-POWER(GREENKING), Greenmax-BIO, and Shine sheetfed offset inks. The company also exports its products to approximately 80 countries. The company was formerly known as Suzhou Kingswood Printing Ink Co., Ltd. Suzhou Kingswood Education Technology Co., Ltd. was founded in 2003 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "300200.SZ": {
        "short_name": "BEIJING COMENS NEW",
        "long_name": "Beijing Comens New Materials Co.,Ltd.",
        "summary": "Beijing Comens New Materials Co.,Ltd. produces and sells polyurethane adhesives in the People's Republic of China. The company offers polyurethane adhesives for flexible packaging, transportation, building and energy saving, new energy, safety protection, waterborne industrial coating, laminating iron, and electronic and electrical applications. It also provides coatings, solar batteries, and other products. Beijing Comens New Materials Co.,Ltd. was founded in 1999 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300214.SZ": {
        "short_name": "SHANDONG RIKE CHEM",
        "long_name": "Shandong Rike Chemical Co.,LTD.",
        "summary": "Shandong Rike Chemical Co.,LTD. engages in the research and development, production, marketing, and servicing of PVC processing aids in China. The company offers acrylic and PVC impact modifiers, ACM resins, PVC foaming regulators, AMB and MBS impact modifiers, PMMA/ASA capstocks, and chlorinated polyethylene impact modifiers. Its processing aids include general, lubricating, SAN, HDT, and transparent processing aids. The company also provides lubricants, CPVC compounds, and processing aids for fittings, as well as ACM, a toughness modifier for profiles. It also exports its products to the United States, the European Union, Korea, Israel, Turkey, India, Ukraine, and Southeast Asia countries and regions. The company was founded in 2003 and is headquartered in Weifang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Weifang"
    },
    "300225.SZ": {
        "short_name": "SHANGHAI KINLITA C",
        "long_name": "Shanghai Kinlita Chemical Co., Ltd.",
        "summary": "Shanghai Kinlita Chemical Co., Ltd. researches, produces, sells, and services industrial coatings. The company offers automobile coatings, such as vehicle body and primer-topcoat in one electrophoretic coatings, automobile parts electrophoretic coatings, solvent type and water-based vehicle body finishing paints, automobile internal and external ornaments paints, and wheel hub coatings. It also provides agricultural machine coatings, including grey machine body and primer-topcoat in one electrophoretic coatings; and light industry coatings comprising common light industry, colorful light industry, and plumbing equipment white electrophoretic coatings. In addition, the company offers motorcycle coatings, which include common vehicle frame and high weather resistance vehicle frame electrophoretic coatings; and ceramics coatings, such as cooker, home appliance, and curtain wall ceramics coatings. Further, it provides construction machinery, railway locomotive, industrial corrosion resistance, and bus and mini bus coatings; and color plate coatings, including polyester, acrylic, epoxy, and water-based systems, as well as PVDF fluorocarbon coatings. The company was founded in 1993 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300243.SZ": {
        "short_name": "SHANDONG RUIFENG C",
        "long_name": "Shandong Ruifeng Chemical Co., Ltd.",
        "summary": "Shandong Ruifeng Chemical Co., Ltd. researches, develops, manufactures, and sells PVC additives in China. The company's principal products include acrylic impact modifiers, acrylic processing aids, impact modifiers MBS resins and medium, and ultra-high MW acrylic processing aids, impact modifier CPE, methyl tin mercaptides, PVC lubricants, epoxidized soybean oil products, PVC lubricating processing aids, PVC processing aids, pvc processing aid LS resin, CPE 135A and methyl tin stabilizers. Its products are used in rigid products, such as PVC window and door profiles, pipes, pipe fittings, sheets, foam pipes, foam sheets, wood-plastic composite films, etc. The company also exports its products to the rest of Asia, Europe, the United States, and other regions. Shandong Ruifeng Chemical Co., Ltd. was founded in 1994 and is based in Zibo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zibo"
    },
    "300285.SZ": {
        "short_name": "SHANDONG SINOCERA",
        "long_name": "Shandong Sinocera Functional Material Co., Ltd.",
        "summary": "Shandong Sinocera Functional Material Co., Ltd. engages in the manufacture and sale of ceramic products in the People's Republic of China. The company's products include electronic and structural ceramic materials, cerium zirconium mixed oxide, bioceramics, architectural ceramic materials, electronic metal pastes, ceramic inks, catalytic materials, etc. Its products are used in high-end industries, such as electronic information and telecommunication, biomedicine, architecture, automobile, industrial catalysis, solar photovoltaic, aeronautics and astronautics technologies, and new energy vehicles. The company was formerly known as Dongying Sinocera Functional Material Co., Ltd. and changed its name to Shandong Sinocera Functional Material Co., Ltd. in 2008. Shandong Sinocera Functional Material Co., Ltd. was founded in 2005 and is based in Dongying, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Dongying"
    },
    "300305.SZ": {
        "short_name": "JIANGSU YUXING FIL",
        "long_name": "Jiangsu Yuxing Film Technology Co., Ltd",
        "summary": "Jiangsu Yuxing Film Technology Co., Ltd manufactures and sells BoPET films in China. It offers PET films for solar cell backsheets, electrical insulation, sequins, printing, and heald and electronic applications, as well as optical films. The company's products and services are used in the fields of IT, LCD, solar cell module, textile industry, etc. Jiangsu Yuxing Film Technology Co., Ltd was founded in 2004 and is based in Changzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "300325.SZ": {
        "short_name": "JIANGSU DEWEI ADVA",
        "long_name": "Jiangsu Dewei Advanced Materials Co., Ltd.",
        "summary": "Jiangsu Dewei Advanced Materials Co., Ltd. engages in the research and development of macromolecular compounds in China. The company offers XLPE insulation compounds, such as chemical and silane cross linkable PE compounds, PE compounds for power cables, and low-smoke halogen-free PE compounds; conductor shielding compounds; and PVC and PE insulation compounds. It also provides PVC, low-smoke halogen-free, and thermoplastic elastomeric compounds; UL series compounds; and PVC insulation, jacketing, and special compounds. The company was formerly known as Suzhou Dewei Industrial Co., Ltd and changed its name to Jiangsu Dewei Advanced Materials Co., Ltd. in 2001. Jiangsu Dewei Advanced Materials Co., Ltd. was founded in 1995 and is based in Taicang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Taicang"
    },
    "300335.SZ": {
        "short_name": "GUANGZHOU DEVOTION",
        "long_name": "Guangzhou Devotion Thermal Technology Co., Ltd.",
        "summary": "Guangzhou Devotion Thermal Technology Co., Ltd. provides clean energy integrated services in China. The company offers clean energy products and services, such as heat, cold, and electricity to industrial and commercial users. It also manufactures industrial and commercial, and home wall-hung boilers. The company was founded in 1993 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "300340.SZ": {
        "short_name": "JIANGMEN KANHOO IN",
        "long_name": "Jiangmen Kanhoo Industry Co., Ltd",
        "summary": "Jiangmen Kanhoo Industry Co., Ltd manufactures and sells rare earth luminescent materials primarily in China. It offers lithium ion battery cathode materials, lithium-ion battery intelligent equipment, LED luminescent materials, catalytic materials, and agricultural light-converting materials. The company was founded in 1994 and is based in Jiangmen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiangmen"
    },
    "300395.SZ": {
        "short_name": "HUBEI FEILIHUA QUA",
        "long_name": "Hubei Feilihua Quartz Glass Co.,Ltd",
        "summary": "Hubei Feilihua Quartz Glass Co.,Ltd manufactures and sells quartz material and quartz fiber products worldwide. Its products are used in fields, such as aerospace, semiconductor, solar energy, optical fiber communication, optics, etc. The company was founded in 1966 and is based in Jingzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jingzhou"
    },
    "300398.SZ": {
        "short_name": "SHANGHAI PHICHEM M",
        "long_name": "Shanghai Phichem Material Co., Ltd.",
        "summary": "Shanghai Phichem Material Co., Ltd. develops, manufactures, and sells specialty chemicals and materials for various industries worldwide. The company offers primary and secondary coating materials for optical fibers; coating materials for buffered optical fibers; coloring inks for optical fibers and cables; matrix materials for optical fiber ribbons; and high- and low-refractive index coating materials for optical fibers. It also provides electronic materials, including conformal coating, etching chemicals, and PCB solder masks for printed wiring board fabrication, IC packaging, and integrated circuit manufacturing. In addition, the company offers raw materials, intermediate materials, single-component liquid crystals, and liquid-crystal mixtures, as well as release coating materials. Further, it provides specialty resins, intermediates, and additives. The company was founded in 2002 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300409.SZ": {
        "short_name": "GUANGDONG DOWSTONE",
        "long_name": "Guangdong Dowstone Technology Co., Ltd.",
        "summary": "Guangdong Dowstone Technology Co., Ltd. produces and sells ceramic products in China and internationally. The company offers ceramic ink, enamel glaze, once burning microcrystalline, full cast glaze, and other products. It also provides digital inkjet printing, metal glaze, full glazed, crystal throwing frit product, anti-slip effect glaze, dry grain, thin plate enhanced, pigment, frit glaze, finished glaze, printing effect glaze, and additive solutions. The company primarily serves ceramic products manufacturers. Guangdong Dowstone Technology Co., Ltd. is based in Foshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Foshan"
    },
    "300429.SZ": {
        "short_name": "CHANGZHOU TRONLY N",
        "long_name": "Changzhou Tronly New Electronic Materials Co., Ltd.",
        "summary": "Changzhou Tronly New Electronic Materials Co., Ltd. engages in the research, development, manufacture, and sale of photoresist chemical materials in China and internationally. It offers photointiators, photosensitizers, photo acid generators, and free radical photointiators. The company also provides resins, such as polymers, prepolymers, and monomers. Its products are used in advanced electronic materials, including printed circuit boards, liquid crystal displays, and semiconductors. Changzhou Tronly New Electronic Materials Co., Ltd. was founded in 1997 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "300437.SZ": {
        "short_name": "HENAN QING SHUI YU",
        "long_name": "Henan Qingshuiyuan Technology CO.,Ltd",
        "summary": "Henan Qingshuiyuan Technology CO.,Ltd manufactures and sells water treatment chemicals in primarily in China. The company offers phosphonate, phosphonate salts, phosphorous acid, polymer, corrosion inhibitor, bactericide, and algaecide chemicals. Its phosphonates and polymers are used in cooling and boiler water treatment, oil field water treatment, textile applications, pigment dispersant, pulp and paper bleaching, dairy cleaners, vehicle wash, cosmetics/shampoos, metal finishing, desalination operations, scale removal swimming pools, and others. The company also exports its products. Henan Qingshuiyuan Technology CO.,Ltd was founded in 1995 and is based in Jiyuan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiyuan"
    },
    "300446.SZ": {
        "short_name": "BAODING LUCKY INNO",
        "long_name": "Baoding Lucky Innovative Materials Co.,Ltd",
        "summary": "Baoding Lucky Innovative Materials Co.,Ltd engages in the research and development, production, and sale of magnetic products in China and internationally. It offers magnetic stripes, magnetic cards, magnetic recording papers, thermal magnetic paper tickers, hot stamping foils, and access systems. The company was formerly known as Baoding Lucky Magnetic Information Materials Co., Ltd. and changed its name to Baoding Lucky Innovative Materials Co., Ltd. in November 2010. Baoding Lucky Innovative Materials Co.,Ltd was founded in 1958 and is based in Baoding, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Baoding"
    },
    "300478.SZ": {
        "short_name": "HANGZHOU GAOXIN RU",
        "long_name": "Hangzhou Gaoxin Rubber & Plastic Materials Co., Ltd.",
        "summary": "Hangzhou Gaoxin Rubber & Plastic Materials Co., Ltd. researches, develops, produces, and sells polymer rubber and plastic materials in China. The company offers oil and weather and UV resistant, PVC anti-ant and rat resistant, PVC cold resistant, environmentally friendly soft PVC, high flame and ultra-high flame retardant, PVC low-smoke low halogen-free cable, flame retardant PVC cable, ordinary PVC cable, ethylene propylene rubber insulation, polyvinyl chloride nitrile composite elastomer, chlorinated polyethylene rubber sheathing material, polyethylene plastic, halogen-free low-smoke flame retardant olefin cable material, two-step silane cross-linked polyethylene insulation, and one-step silane cross-linked polyethylene insulation, as well as ethylene propylene rubber inner and outer materials for nuclear power materials. It serves customers in the fields of electric power, ships, rail transit, communication, electrical equipment, construction, new energy, and others. The company was formerly known as Hangzhou Gaoxin Insulation Materials Co., Ltd. Hangzhou Gaoxin Rubber & Plastic Materials Co., Ltd. was founded in 2004 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "300522.SZ": {
        "short_name": "SUZHOU SUNMUN TECH",
        "long_name": "Suzhou Sunmun Technology Co., Ltd.",
        "summary": "Suzhou Sunmun Technology Co., Ltd. engages in the research, production, and sale of water based colorants and computer toning integrated systems in the People's Republic of China. Its products include pigment printing paste, such as architectural pigment paste, water based industrial, and solvent based paste; textile fiber paste; latex paste; and SUA additives, as well as colorant used for coating, latex products, paper making, leather, textile, fiber, ink, etc. Suzhou Sunmun Technology Co., Ltd. was founded in 2001 and is headquartered in Kunshan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Kunshan"
    },
    "300530.SZ": {
        "short_name": "GUANGDONG DAZHI EN",
        "long_name": "Guangdong DaZhi Environmental Protection Technology Incorporated Company",
        "summary": "Guangdong DaZhi Environmental Protection Technology Incorporated Company engages in the research, production, sale, application, and servicing of surface engineering chemicals in China. It offers electroplating additives, intermediates, electronic chemicals, paint additives, polyethylene carbonate polyol, and other environmental chemicals. The company is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "300535.SZ": {
        "short_name": "SICHUAN DOWELL SCI",
        "long_name": "Sichuan Dowell Science and Technology Inc.",
        "summary": "Sichuan Dowell Science and Technology Inc. researches, develops, produces, and sells leather chemicals in China. The company offers tanning materials, leather functional additives, finishing materials, and colorants, industrial coating, waterborne wood paints; and wood adhesive, as well as provides intelligent device. It also exports its products to Southeast Asia, Europe, and other countries and regions. The company was founded in 2003 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "300537.SZ": {
        "short_name": "JIANGSU KUANGSHUNA",
        "long_name": "Jiangsu Kuangshun Photosensitivity New-Material Stock Co., Ltd.",
        "summary": "Jiangsu Kuangshun Photosensitivity New-Material Stock Co., Ltd. develops and produces photosensitive materials in China. It offers liquid photosensitive solder resist ink, UV-curable tag printing ink, heat curing marking ink, photosensitive circuit ink, UV curing acid resistant and anti-etching ink, water-based ink, and glass ink. The company is headquartered in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiangyin"
    },
    "300538.SZ": {
        "short_name": "SHENZHEN TONGYI IN",
        "long_name": "Shenzhen Tongyi Industry Co., Ltd.",
        "summary": "Shenzhen Tongyi Industry Co., Ltd. provides chemical and electronic materials solutions. It offers chemical and electronic materials for smart mobile terminals, smart home appliances, LED lighting, and other segments. The company's products include high performance mobile phone housing materials, LED materials, elastomer materials, injection automation and intelligent systems, and celanese materials. Shenzhen Tongyi Industry Co., Ltd. was founded in 2002 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300576.SZ": {
        "short_name": "SHENZHEN RONGDA PH",
        "long_name": "Shenzhen RongDa Photosensitive Science & Technology Co., Ltd.",
        "summary": "Shenzhen RongDa Photosensitive Science & Technology Co., Ltd. produces and sells photosensitive chemical materials in China. It offers PCB inks, positive photoresists, and special inks. The company was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300586.SZ": {
        "short_name": "MALION NEW MATERIA",
        "long_name": "Malion New Materials Co., Ltd.",
        "summary": "Malion New Materials Co., Ltd. engages in the research and development, manufacture, sale, and servicing of masterbatches in China and internationally. The company offers white, black, color, and additive masterbatches; and functional materials that are used in food packaging, medicine packaging, personal care, plastic tubing, engineering plastic, and plastic household products, as well as electric wires and cables, consumer products, auto plastic parts, agricultural production, etc. Malion New Materials Co., Ltd. was founded in 2000 and is headquartered in Shantou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shantou"
    },
    "300596.SZ": {
        "short_name": "RIANLON CORPORATIO",
        "long_name": "Rianlon Corporation",
        "summary": "Rianlon Corporation provides anti-aging additives and application technologies for polymeric materials industry worldwide. Its product portfolio includes primary and secondary antioxidants, UV absorbers and HALS, light stabilizers, and U-pack, which is customized blending formulation to provide anti-aging solution. The company provides its products for the use in automotive parts, coatings, construction materials, packaging, electronics, housewares, etc. Rianlon Corporation was founded in 1994 and is headquartered in Tianjin, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tianjin"
    },
    "300644.SZ": {
        "short_name": "NANJING JULONG SCI",
        "long_name": "Nanjing Julong Science&Technology Co.,LTD",
        "summary": "Nanjing Julong Science&Technology Co.,LTD manufactures and sells wood-plastic composites in China. It offers various modified plastics, including PA66, PA6, PP, LFT, PC, ABS, PBT, TPE, and other plastics. Its products are used in the fields of automobile, hi-speed railway, electronic appliance, tooling, equipment, sport, and recreation. The company was formerly known as Nanjing Julong Chemical Industrial Co., Ltd. and changed its name to Nanjing Julong Science& Technology Co.,LTD in September 2009. Nanjing Julong Science&Technology Co.,LTD was founded in 1999 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "300655.SZ": {
        "short_name": "SUZHOU CRYSTAL CLE",
        "long_name": "Suzhou Crystal Clear Chemical Co.,Ltd.",
        "summary": "Suzhou Crystal Clear Chemical Co.,Ltd. produces and sells ultra-pure chemical materials and other fine chemical products for the microelectronics industry in China. The company offers various chemicals, including ammonia, isopropyl alcohol, hydrogen peroxide, ammonium hydroxide, nitric acid, sulfuric acid, hydrofluoric acid, chlorhydric acid, ammonium fluoride, BOE, IPA, ethanol, methanol, butyl acetate, acetone, acetic acid, oxalic acid, sodium hydroxide, potassium hydroxide, and others. It also provides aluminum, poly-si, chromium, and ITO etches; etching liquid gold; mixed acids; stripping commodities; KOH developing solutions; tetramethylammonium hydroxide; nano fingerprint resistant fluids; liquid crystal display chemicals; solid thermal resistance to strong acid spray waxes; cleaning fluids; and supplementary reagents. The company' products are primarily used in VLSI, LED, TFT-LCD panel manufacturing processes, solar wafer etching, and cleaning applications. Suzhou Crystal Clear Chemical Co.,Ltd. was founded in 2001 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "300658.SZ": {
        "short_name": "XIAMEN YANJAN NEW",
        "long_name": "Xiamen Yanjan New Material Co., Ltd.",
        "summary": "Xiamen Yanjan New Material Co., Ltd. operates as a material supplier for disposable hygiene products in china. The company offers PE perforated films, 3D aperture non-woven, hot air through Non-woven, and ADL surge, which are primarily used in sanitary napkins, pads, and baby and adult diapers, as well as in medical treatment and food packaging industries. It also supplies raw materials for various hygiene products. The company also exports its products. Xiamen Yanjan New Material Co., Ltd. was founded in 2000 and is headquartered in Xiamen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Xiamen"
    },
    "300665.SZ": {
        "short_name": "ZHUZHOU FEILU HIGH",
        "long_name": "Zhuzhou Feilu High-Tech Materials Co., Ltd.",
        "summary": "Zhuzhou Feilu High-Tech Materials Co., Ltd. engages in the research and development, production, and sale of metal anti-corrosion and concrete protection products in China. It offers anti-corrosion coatings for high and medium grade metals; waterproof and anti-seepage coatings for concretes; water born paint products for industrial applications; and various protective materials for concrete interfaces. The company's products are used in building projects of railway equipment, engineering machinery, highway traffic equipment, high-speed railways, subways, intercity-rails, construction works of water conservancy, coal mines, salt fields, and other markets. Zhuzhou Feilu High-Tech Materials Co., Ltd. was founded in 1998 and is headquartered in Zhuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhuzhou"
    },
    "300717.SZ": {
        "short_name": "JIANGSU HUAXIN NEW",
        "long_name": "Jiangsu Huaxin New Material Co.,Ltd.",
        "summary": "Jiangsu Huaxin New Material Co.,Ltd. produces and supplies smart card base materials. Its products include PETG, PVC, PVC/ABS blend, bio-degradable PHA, and medical films; coated overlays; digital printing materials; and PET and PC card materials, as well as coated PVC for etching antennas. The company offers its products for use in various industries, including finance, transport, medical treatment, electronic information, social security, decoration, packaging, etc. It serves customers in China, Russia, Indonesia, India, Brazil, Spain, and internationally. The company was founded in 1999 and is headquartered in Xinyi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Xinyi"
    },
    "300721.SZ": {
        "short_name": "JIANGSU YIDA CHEMI",
        "long_name": "Jiangsu Yida Chemical Co., Ltd.",
        "summary": "Jiangsu Yida Chemical Co., Ltd. provides ethylene glycol ether and propylene glycol ether products, and their derivatives. It also offers ethyl glyme, propyl glyme, braking fluid, and polyethylene glycol products, as well as polyether products. The company was founded in 1996 and is based in Jiangyin, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Jiangyin"
    },
    "300727.SZ": {
        "short_name": "NINGBO RUNHE HIGH-",
        "long_name": "Ningbo Runhe High-Tech Materials Co., Ltd.",
        "summary": "Ningbo Runhe High-Tech Materials Co., Ltd. develops and manufactures various kinds of textile auxiliaries. It offers textile chemical series, such as multicomponent copolymerization epoxy silicone oil; and dyeing and finishing agent series, including block and modified silicone oil, emulsion, soft flake and ointment, wax emulsion, and pretreatment dyeing products. The company is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "300731.SZ": {
        "short_name": "SHENZHEN COTRAN NE",
        "long_name": "Shenzhen Cotran New Material Co.,Ltd.",
        "summary": "Shenzhen Cotran New Material Co.,Ltd. manufactures and provides waterproof and sealing insulation products and solutions in China. It offers PVC, butyl based, silicone based, and EPR based tapes; and silicone and EPDM cold shrink tubes and sleeves. The company provides its solution for telecommunication, power utilities, mining, automobile, and marine industries. Shenzhen Cotran New Material Co.,Ltd. was founded in 2008 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300741.SZ": {
        "short_name": "HUABAO FLAVOURS &",
        "long_name": "Huabao Flavours & Fragrances Co., Ltd.",
        "summary": "Huabao Flavours & Fragrances Co., Ltd. engages in the research and development, production, sale, and service of tobacco flavors, food flavors, daily chemical flavors, and food ingredients in China and internationally. Its food flavor products are used in dairy products, beverages, cold drinks, baking products, candies, roasted nuts, betel nuts, spices, instant noodles, meat products, snack foods, catering, and other fields; and food ingredient products are used in natural and healthy ingredients for food and beverages, health care, nourishment, and personal care products. The company offers its products under the Huabao, Peacock, Tianhong, Xideng, Huafang, Owada, Australian Huada, Amber, HEDON, H&K, and OWADA brands. The company was formerly known as Huabao Food Flavours & Fragrances (Shanghai) Co., Ltd. and changed its name to Huabao Flavours & Fragrances Co., Ltd. in 2016. The company was founded in 1996 and is based in Lhasa, China. Huabao Flavours & Fragrances Co., Ltd. is a subsidiary of Smart Sino International Investment Holding (China) Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Lhasa"
    },
    "300758.SZ": {
        "short_name": "ANSHAN HIFICHEM CO",
        "long_name": "Anshan Hifichem Co., Ltd.",
        "summary": "Anshan Hifichem Co., Ltd. manufactures and sells high performance organic pigments, solvent dyestuff, and intermediates in China. The company serves a range of customers in the ink, coating, and plastic industries, as well as in electronic products, paper-coloring, and seed coloring industries. Anshan Hifichem Co., Ltd. is headquartered in Anshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Anshan"
    },
    "300798.SZ": {
        "short_name": "JIANGSU JINJI INDU",
        "long_name": "JiangSu Jinji Industrial Co.,Ltd.",
        "summary": "JiangSu Jinji Industrial Co.,Ltd. engages in the research, production, and sale of reactive and disperse dyes, dye intermediates, and other products in China. The company was founded in 2003 and is based in Taixing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Taixing"
    },
    "300806.SZ": {
        "short_name": "JIANGSU SIDIKE NEW",
        "long_name": "Jiangsu Sidike New Materials Science & Technology Co., Ltd.",
        "summary": "Jiangsu Sidike New Materials Science & Technology Co., Ltd. manufactures and sells multifunctional coating composite material in China. It offers protective material, including computer and phone protective films; electronic grade adhesive materials, such as sided fixing and sided sealing material; functional coating material such as functional protective, conducting functional, insulation functional, shielding, and marked functional material; and film packaging material. The company was founded in 2006 and is based in Suqian, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Suqian"
    },
    "300811.SZ": {
        "short_name": "POCO HOLDING CO LT",
        "long_name": "POCO Holding Co., Ltd.",
        "summary": "POCO Holding Co., Ltd. develops, produces, and sells alloy soft magnetic powder, and alloy soft magnetic core and related inductance components for the downstream users of electricity electronic equipment. Its products are used in photovoltaic power generation, inverter air conditioner, UPS, energy vehicles, charging piles, and other areas. The company was founded in 2009 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300821.SZ": {
        "short_name": "SHANDONG DONGYUE O",
        "long_name": "Shandong Dongyue Organosilicon Materials Co., Ltd.",
        "summary": "Shandong Dongyue Organosilicon Materials Co., Ltd. engages in the research and development, production, and sale of silicone materials in China. Its principal products include silicone monomers, silicone intermediates, fumed silica, and silicone rubber, silicone oil, and other deep-processed products. The company also exports its products to Dubai, South Korea, Belgium, the United States, Italy, India, Malaysia, Turkey, and Taiwan. Shandong Dongyue Organosilicon Materials Co., Ltd. was founded in 2006 and is based in Zibo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zibo"
    },
    "300848.SZ": {
        "short_name": "MIRACLL CHEMICALS",
        "long_name": "Miracll Chemicals Co.,Ltd",
        "summary": "Miracll Chemicals Co.,Ltd, a material science company, researches, develops, manufactures, and sells thermoplastic polyurethane (TPU) elastomers and polyol specialty products. It offers polyester, polyether, and polycaprolactone based TPUs; expandable and expanded, and functional TPUs; and hot melt and solvent-based adhesive TPUs. The company provides its products for use in electronics, sports and leisure, automotive, medical, mechanical, and industrial applications. Miracll Chemicals Co.,Ltd was founded in 2009 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yantai"
    },
    "300890.SZ": {
        "short_name": "SHENZHEN XFH TECHN",
        "long_name": "Shenzhen XFH Technology Co.,Ltd",
        "summary": "Shenzhen XFH Technology Co.,Ltd engages in the research and development, production, and sale of lithium ion battery cathode materials. Its products are used in energy vehicles, portable power products, electric tools, electric bicycles, and storage power stations. The company is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "300891.SZ": {
        "short_name": "GUANGDONG HUIYUN T",
        "long_name": "Guangdong Huiyun Titanium Industry Co., Ltd.",
        "summary": "Guangdong Huiyun Titanium Industry Co., Ltd. engages in the research, development, production, and sale of titanium dioxide products. Its products include anatase and rutile titanium dioxide; titanium gypsum; ferrous sulfate heptahydrate; and industrial sulfuric acid. The company also exports its products to Portugal, Russia, Singapore, South Korea, Vietnam, Malaysia, and other places. The company was founded in 2003 and is based in Yunfu, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Yunfu"
    },
    "300905.SZ": {
        "short_name": "POLY PLASTIC MASTE",
        "long_name": "Poly Plastic Masterbatch (SuZhou) Co.,Ltd",
        "summary": "Poly Plastic Masterbatch (SuZhou) Co.,Ltd. engages in the research, development, production, and marketing of polyester terephthalate and nylon masterbatches, and functional masterbatches in China. The company was founded in 1995 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "300919.SZ": {
        "short_name": "CNGR ADVANCED MATE",
        "long_name": "CNGR Advanced Material Co.,Ltd.",
        "summary": "CNGR Advanced Material Co.,Ltd. engages in the research, development, processing, production, and sale of lithium battery cathode material precursors and new energy recycling materials in the fields of new materials and energy. The company's products include ternary precursors and cobalt tetroxide, which are used to produce ternary cathode materials and lithium cobalt oxide cathode materials. Its independent developments include 4.47V high voltage cobalt tetroxide and NCM811, which are used in 3C digital, EV, and energy storage industries. The company was founded in 2014 and is based in xxx. CNGR Advanced Material Co.,Ltd. is a subsidiary of Hunan CNGR Holding Group Co.,Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Tongren"
    },
    "300922.SZ": {
        "short_name": "QINHUANGDAO TIANQI",
        "long_name": "Qinhuangdao Tianqin Equipment Manufacturing Co.,Ltd.",
        "summary": "Qinhuangdao Tianqin Equipment Manufacturing Co.,Ltd. manufactures plastic raw materials. The company supplies military protection products. Qinhuangdao Tianqin Equipment Manufacturing Co.,Ltd. was founded in 1996 and is based in Qinhuangdao, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Qinhuangdao"
    },
    "300952.SZ": {
        "short_name": "JIANGSU HANVO SAFE",
        "long_name": "Jiangsu Hanvo Safety Product Co., Ltd.",
        "summary": "Jiangsu Hanvo Safety Product Co., Ltd. manufactures and markets safety gloves in China. It offers general purpose, cut resistant, breathable, waterproof, oilproof, thermal, oil/chemical resistant, impact, and kevlar gloves. The company also exports its products to Europe, the United States, Japan, and other developed countries. Jiangsu Hanvo Safety Product Co., Ltd. was founded in 2004 and is headquartered in Nantong, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nantong"
    },
    "600143.SS": {
        "short_name": "KINGFA SCI.&TECH. CO. LTD.",
        "long_name": "Kingfa Sci. & Tech. Co., Ltd.",
        "summary": "Kingfa Sci. & Tech. Co., Ltd. engages in the research, development, production, and sale of plastic products in worldwide. The company offers plastic compounds, special engineering plastics, fine chemical materials, biodegradable plastics, and wood-plastic materials, as well as carbon fibers and composite materials. Its products and materials are used in office supplies, transportation, appliance, information and communication, lighting, and electronic appliances sectors. Kingfa Sci. & Tech. Co., Ltd. was founded in 1993 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "600176.SS": {
        "short_name": "CHINA JUSHI CO LTD",
        "long_name": "China Jushi Co., Ltd.",
        "summary": "China Jushi Co., Ltd. manufactures and sells fiberglass and its fabrics. The company offers a range of reinforcement fiberglass products, including E-glass and C-glass rovings, chopped strands, powder and emulsion chopped strand mats, and woven rovings. Its products have applications in building materials, infrastructure, electronic and electrical, chemical anti-corrosion, aerospace, transportation, energy saving and environmental protection, and sports and leisure sectors. China Jushi Co., Ltd. serves customers in approximately 80 countries and regions, including North America, the Middle East, Europe, the Southeast Asia, and Africa. The company was formerly known as China Fiberglass Co., Ltd. and changed its name to China Jushi Co., Ltd. in March 2015. China Jushi Co., Ltd. is headquartered in Tongxiang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Tongxiang"
    },
    "600273.SS": {
        "short_name": "ZHEJIANG JIAHUA ENGY CHEMICAL I",
        "long_name": "Zhejiang Jiahua Energy Chemical Industry Co.,Ltd.",
        "summary": "Zhejiang Jiahua Energy Chemical Industry Co.,Ltd. manufactures and sells chemicals in China. The company offers a range of chlor-alkali products, including industrial sodium hydroxide, industrial liquid chlorine, sodium hypochlorite, hydrochloric acid, and hydrogen; range of sulfuric acid, including common sulfuric acid, fuming sulfuric acid, liquid SO3, AR acid, and chlorosulfonic acid; and hot supply products, such as steam and demineralized water products. It also provides ortho/para products comprising p-toluenesulfonyl isocyanate, tosyl chloride, refined tosyl chloride, p-toluenesulfonamide, o/p-toluenesulfonamide, dry and wet 4-methylsulfonyl-2-nitrotoluene, anhydrous p-toluene sulfonic acid, methyl p-tolyl sulfone, and tosyl chloride products, as well as fatty acid and alcohol, glycerin, adipic acid monomethyl ester, and triglyceride fatty acid. The company was formerly known as Huafang Textile Co., Ltd. and changed its name to Zhejiang Jiahua Energy Chemical Industry Co.,Ltd. in December 2014. Zhejiang Jiahua Energy Chemical Industry Co.,Ltd. was founded in 2003 and is based in Jiaxing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Jiaxing"
    },
    "600409.SS": {
        "short_name": "TANGSHAN SANYOU CHEMICAL INDUST",
        "long_name": "Tangshan Sanyou Chemical Industries Co.,Ltd",
        "summary": "Tangshan Sanyou Chemical Industries Co.,Ltd produces and sells chemical products. The company offers soda ash, adhesives, polyvinyl chloride resins, caustic soda, silicones, and salt products, as well as chemical fibers. It also exports its products to approximately 100 countries and regions in Asia, Africa, Europe, the United States, and Australia. The company was founded in 1999 and is based in Tangshan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Tangshan"
    },
    "600586.SS": {
        "short_name": "SHANDONG JINJING SCIENCE&TECHNO",
        "long_name": "Shandong Jinjing Science and Technology Stock Co., Ltd.",
        "summary": "Shandong Jinjing Science and Technology Stock Co., Ltd. produces and sells glass products. It offers ultra-white glass, offline coated glass, in-line coated glass, solar film glass, color glass, fire-proof glass, automotive glass, low-salt heavy glass soda ash, light soda ash, baking soda, baking soda detergent, etc. The company also export its products. Shandong Jinjing Science and Technology Stock Co., Ltd. was founded in 1999 and is based in Zibo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Zibo"
    },
    "600599.SS": {
        "short_name": "PANDA FINANCIAL HOLDING CORP LT",
        "long_name": "Panda Financial Holding Corp., Ltd.",
        "summary": "Panda Financial Holding Corp., Ltd. produces and sells fireworks in China. The company offers various fireworks and firecrackers for consuming and professional uses; and firework displays for events under the Panda Fireworks, Panda, Winda, Bright Star, and Liu-Flower brands. It also exports its products to the United States, Great Britain, Germany, Sweden, Holland, Norway, Finland, Italy, Poland, Lithuania, Romania, Estonia, Saudi Arabia, South Africa, etc. The company was formerly known as Panda Fireworks Group Co., Ltd. and changed its name to Panda Financial Holding Corp., Ltd. in April 2015. Panda Financial Holding Corp., Ltd. was founded in 1989 and is based in Liuyang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Liuyang"
    },
    "600810.SS": {
        "short_name": "SHEN MA INDUSTRY",
        "long_name": "Shenma Industrial Co., Ltd.",
        "summary": "Shenma Industrial Co., Ltd. manufactures and sells chemical and chemical fiber products in China and internationally. The company's principal products include nylon industrial yarns and cord fabrics; nylon salt and nylon slices; and dipped fabrics. Its main products also include automobile safety airbag wire, nylon resins and modified engineering plastics, adipic acid, 1,6-hexanediamine, cyclohexanol, cyclohexane, nitric acid, aramid fiber, chemical fiber canvas, paper and wood products, etc. The company is based in Pingdingshan, China. Shenma Industrial Co., Ltd. is a subsidiary of China Pingmei Shenma Energy Chemical Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Pingdingshan"
    },
    "600873.SS": {
        "short_name": "MEIHUA HOLDINGS GROUP CO LTD",
        "long_name": "MeiHua Holdings Group Co.,Ltd",
        "summary": "MeiHua Holdings Group Co.,Ltd provides amino acid nutrition and health solutions. It offers food additives, including, sodium glutamate, natamycin, disodium inosinate, xanthan gum, pullulan, disodium 5'-ribonucleotide, and trehalose; condiments; amino acid for feed comprising valine, L-lysine sulphate and HCL, L-threonine, L-tryptophane, corn gluten meal for feedstuffs, corn husk powder, corn fiber feed, and boutique MSG residue; pharmaceutical amino acids, such as L-glutamine, L-leucine, L-isoleucine, L-valine, vernine, and adenosine; colloids; fertilizers, including soil conditioners; and capsules comprising enteric, cellulose, gelatin, and pullulan capsules. The company was founded in 2002 and is headquartered in Langfang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Langfang"
    },
    "600884.SS": {
        "short_name": "NINGBO SHANSHAN CO. LTD",
        "long_name": "Ningbo Shanshan Co.,Ltd.",
        "summary": "Ningbo Shanshan Co.,Ltd. provides apparels and lithium battery materials in China and internationally. The company provides lithium-ion battery materials; lithium battery cathode materials, such as lithium cobalt oxide products, multi-material series products, lithium manganese oxide products, and ternary precursors; lithium battery anode material products, including artificial and natural graphite, mesophase carbon microbeads, and composite graphite; silicon-based anode materials; and lithium battery electrolyte products, as well as lithium-ion battery and capacitor packs. It is also involved in the provision of energy management services, such as energy storage and photovoltaic services; construction of charging piles; operation of new energy vehicles; and design, research, and development of energy buses and special-purpose vehicles. In addition, the company engages in the financial leasing and venture capital businesses. The company was founded in 1992 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "600985.SS": {
        "short_name": "HUAIBEI MINING HOLDINGS CO LTD",
        "long_name": "Huaibei Mining Holdings Co.,Ltd.",
        "summary": "Huaibei Mining Co., Ltd. primarily engages in coal mining, washing, processing, sales, and storage business. It also offers coal chemical products, including coking coal; and sells chemical raw materials. The company is based in Huaibei, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Huaibei"
    },
    "601678.SS": {
        "short_name": "BEFAR GROUP CO LTD",
        "long_name": "Befar Group Co.,Ltd",
        "summary": "Befar Group Co.,Ltd primarily produces and sells caustic soda and propylene oxide in China. The company offers 1,2-dichloropropane, tetrachloroethylene, pentafluoroethane, vinyl chloride, 3-chloropropene, hydrogen peroxide, polymer polyol, sodium hypochlorite, sodium sucfate, sulfate decahydrate, synthetic and chemical reagent hydrochloric acid, sodium hydroxide, sodium hydroxid caustic soda pearls and flakes, trichloroethylene, sodium hypochlorite, and dichloropropane. It also provides food additive hydrochloric acid and sodium hydroxide in liquid and solid forms; elastomer, adhesives, sealants, and coatings; and slow and high resilience, and rigid foam polyether polyol. In addition, the company supplies oil additives. Befar Group Co.,Ltd also exports its products to 100 countries and regions worldwide. The company was founded in 1968 and is based in Binzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Binzhou"
    },
    "601718.SS": {
        "short_name": "JIHUA GROUP CORPORATION LIMITED",
        "long_name": "Jihua Group Corporation Limited",
        "summary": "Jihua Group Corporation Limited manufactures and distributes military light industrial products in China and internationally. The company offers military police apparel and uniform, and occupational apparel; occupational footwear and shoes; textile Spinning and weaving, and dyeing and printing services; and protective equipment, such as bulletproof helmets and body armors. It is also involved in the research, development, manufacture, and sale of anesthesia machines, medical apparatus, training injury comprehensive therapy apparatus, breast mass comprehensive therapy apparatus, and medical transfer beds; development and production of filter materials and equipment; and research and development of new energy facilities. In addition, the company produces chemical agent-based integrated pharmaceuticals, including neurological and psychiatric agents, cerebrovascular and cardiovascular agents, endocrine agents, and antimicrobial and other agents; and drugs in the form of tablets, capsules, powder-injections, large volume injections, and other various forms. It primarily operates under the JH1912, JH ROYAL, 3502, Qiangren, Fulong, 3539, 3537, 3517, 3523, Lingshi, Shenxingtaibao, Cruiser, 3534, Kaihuang, Youyuan, and Qiwu brand names. The company is based in Beijing, China. Jihua Group Corporation Limited is a subsidiary of Xinxing Cathay International Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "603010.SS": {
        "short_name": "ZHEJIANG WANSHENG CO LTD",
        "long_name": "Zhejiang Wansheng Co., Ltd.",
        "summary": "Zhejiang Wansheng Co., Ltd. produces and sells organic phosphorus based flame retardants, special amines, and cardanol derived curing agents and diluents in China. It offers flame retardants for rigid foam, flexible foam, and engineering plastic; and specialty amines, amine catalysts, curing agents/diluents, special solvents, and other products. The company was formerly known as Zhejiang Wansheng Chemicals Co., Ltd. and changed its name to Zhejiang Wansheng Co., Ltd. in 2010. Zhejiang Wansheng Co., Ltd. was founded in 1995 and is headquartered in Linhai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Linhai"
    },
    "603020.SS": {
        "short_name": "APPLE FLAVOR & FRAGRANCE GROUP ",
        "long_name": "Apple Flavor & Fragrance Group Co.,Ltd.",
        "summary": "Apple Flavor & Fragrance Group Co.,Ltd. manufactures and sells flavors, fragrances, and food additives in China. The company offers food flavors, including dairy, ice cream, beverage, confectionery, savory, bakery, and snack related flavors; and fragrances for use in personal care, oral care, home care, and candle and air care products, as well as in perfumes. It also manufactures synthetic aroma chemicals; and natural extracts and fermentation natural products, as well as food ingredients. The company was founded in 1996 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603041.SS": {
        "short_name": "JIANGSU MAYSTA CHEMICAL CO LTD",
        "long_name": "Jiangsu Maysta Chemical Co., Ltd.",
        "summary": "Jiangsu Maysta Chemical Co., Ltd. engages in the research and development, production, and sale of organosilicon surfactants in China and internationally. The company offers PU foam stabilizers for rigid foams, slab stock foams, HR foams, shoe soles, OCF, and rigid foam and HR foam cell openers; and PU catalysts for rigid and flexible foams. Its products are used in various sectors, such as home appliances, furniture, architecture, automobiles, etc. The company was founded in 2000 and is headquartered in Nanjing, China. Jiangsu Maysta Chemical Co., Ltd. is a subsidiary of Foshan Shunde District Demei Chemical Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "603181.SS": {
        "short_name": "ZHEJIANG HUANGMA TECHNOLOGY CO ",
        "long_name": "Zhejiang Huangma Technology Co.,Ltd",
        "summary": "Zhejiang Huangma Technology Co.,Ltd, together with its subsidiaries, researches, manufactures, and sells surfactants and related products in China. It primarily offers PCE with polymer polyether plates, C4 derivative functional intermediates, modified silicone new materials with high performance polyether plates, and textile auxiliaries with green new surfactant plates. The company provides its products for use in lubricant and metalworking, coating and ink, agrochemical adjuvant, PCE, water treatment, specialty fiber, personal care, and composite material applications, as well as in silicones surfactants and textile auxiliaries. Zhejiang Huangma Technology Co.,Ltd was founded in 2003 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shaoxing"
    },
    "603192.SS": {
        "short_name": "SHANGHAI HUIDE SCIENCE AND TECH",
        "long_name": "Shanghai Huide Science & Technology Co.,Ltd",
        "summary": "Shanghai Huide Science & Technology Co., Ltd. engages in the research, production, sale, and service of polyurethane (PU) resin for synthetic leather and polyester polyol in China. The company offers polyurethane resins, including dry coating, dry adhesive, wet process, dry two-component, dry foam type, wet nubuck, high peel strength, hydrolyzing resis and high peel strength, cold-resistant and non-yellowing, etc. It also exports its products to the Southeast Asia, Europe, the United States, and internationally. The company was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603212.SS": {
        "short_name": "CYBRID TECHNOLOGIES INC",
        "long_name": "Cybrid Technologies Inc.",
        "summary": "Cybrid Technologies Inc. manufactures and sells thin film polymer functional materials in China. Its products include solar module backsheets, solar encapsulant films, insulation patches, repairing tapes, positioning tapes, C type high temperature products, single sided framing adhesive tapes, tapes for mobile graphite sheet heat dissipation, black shading PET double-sided tapes, protective films, tapes for speakers, dicing tapes, thin double side cotton tapes, insulation tapes, thermal conductive pads, electronic conductive tapes, and stiffener tapes. The company was founded in 2006 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "603227.SS": {
        "short_name": "XINJIANG XUEFENG S",
        "long_name": "Xinjiang Xuefeng Sci-Tech (Group) Co., Ltd.",
        "summary": "Xinjiang Xuefeng Sci-Tech (Group) Co., Ltd. engages in the research and development, production, and marketing civil explosives primarily for use in the field of infrastructure construction, economic construction, and mineral resources development. The company's products include emulsion and site mixed explosives; expanded ammonium nitrate explosives; detonating cords; and ordinary instantaneous electric, coal electric, and electronic detonators. It also offers blasting and armed escort services. The company also exports its products to Central Asia. Xinjiang Xuefeng Sci-Tech (Group) Co., Ltd. was founded in 1958 and is based in Ã\u009crÃ¼mqi, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Urumqi"
    },
    "603256.SS": {
        "short_name": "GRACE FABRIC TECHNOLOGY CO LTD",
        "long_name": "Grace Fabric Technology Co.,Ltd.",
        "summary": "Grace Fabric Technology Co.,Ltd. engages in the research and development, production, and sale of e-glass fabrics worldwide. The company offers middle and high grade e-glass fabric series. Its products are used in automotive structure parts, electrical insulation, high temperature insulation, building materials, aerospace, and sports equipment applications. The company was founded in 1998 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603330.SS": {
        "short_name": "SHANGHAI TIANYANG HOT MELT ADHE",
        "long_name": "Shanghai Tianyang Hot Melt Adhesives Co., Ltd.",
        "summary": "Shanghai Tianyang Hot Melt Adhesives Co., Ltd. manufactures and sells thermoplastic hot melt and reactive adhesive products in China and internationally. It offers copolyester and copolyamide powders; web, film, and PUR adhesives; modified polyamide materials; solar encapsulation films; and electronic adhesives. Its products are used in clothing and textile; automobile interior; electronic appliances; EVA encapsulation; reflective, shoe, and construction materials; industrial filtration; home decoration; printing packaging; interior decoration; and paint and other fields. The company was formerly known as Shanghai Sanren Chemical Co., Ltd. and changed its name to Shanghai Tianyang Hot Melt Adhesives Co., Ltd. in 2002. Shanghai Tianyang Hot Melt Adhesives Co., Ltd. was founded in 1993 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603378.SS": {
        "short_name": "ASIA CUANON TECHNOLOGY (SHANGHA",
        "long_name": "Asia Cuanon Technology (Shanghai) Co., Ltd.",
        "summary": "Asia Cuanon Technology (Shanghai) Co., Ltd. engages in the research and development, manufacture, and service of functional architectural coatings, thermal insulation decorative panels and materials, and fire insulation products in China. The company also provides paint engineering coatings, plasters, tile adhesives, and interior wall and external wall insulation products. Its products are used in real estate, residential community, hotel/office, and public construction projects. The company is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603601.SS": {
        "short_name": "CHONGQING ZAISHENG TECHNOLOGY C",
        "long_name": "Chongqing Zaisheng Technology Co., Ltd.",
        "summary": "Chongqing Zaisheng Technology Co., Ltd. researches, manufactures, and markets glass microfiber products for purification and energy-saving markets in China. It offers glass microfiber filter media, fiber glass vacuum insulation panel core materials, composite fiberglass filter papers, glass microfibers, AGM separators, glass microfiber air-laid mats, and glassfiber cryogenic insulation materials. The company also provides air-laid cotton blankets and inorganic spraying fiberglass products, as well as glass fiber filter paper derivative services. Chongqing Zaisheng Technology Co., Ltd. was founded in 1984 and is headquartered in Chongqing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "603659.SS": {
        "short_name": "SHANGHAI PUTAILAI NEW ENERGY TE",
        "long_name": "Shanghai Putailai New Energy Technology Co., Ltd.",
        "summary": "Shanghai Putailai New Energy Technology Co., Ltd., together with its subsidiaries, develops and sells materials of lithium-ion batteries and automated process equipment in China. It offers lithium-ion battery anode materials, coating separators, automated coating equipment, coated diaphragms, aluminum-plastic packaging films, and micro nano powders. The company was founded in 2012 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603663.SS": {
        "short_name": "SANXIANG ADVANCED MATERIALS CO ",
        "long_name": "Sanxiang Advanced Materials Co., Ltd.",
        "summary": "Sanxiang Advanced Materials Co., Ltd. manufactures and sells fused zirconia, cast modified materials, and single crystal fused aluminum materials. The company offers yttrium, calcium, magnesium, aluminum, and composite based stable zirconia; and zirconia of ceramic pigments, refractory materials, and high purity, as well as special zirconia. It also provides nodulized, nucleated, vermiculated, and calcium-silicon cored wires; rare earth and yttrium-based heavy rare-earth nodulizers; silicon barium, silicon strontium, silicon zirconium, high-aluminum cubic ferrosilicon, and long-acting and special-effect inoculants, as well as inoculant chips and others; and silica fumes. The company offers its products for use in aerospace, military refractory and abrasive materials, ceramic and glaze materials, nuclear grade zirconia materials, advanced ceramics, cast, high-end abrasives materials and tools, etc. It has operations in China, the United States, Brazil, Mexico, France, Germany, Italy, Spain, Turkey, Holland, Australia, Japan, South Korea, Iran, India, Thailand, Vietnam, Malaysia, Singapore, Taiwan, and internationally. The company was formerly known as Fujian Sanxiang Advanced Materials Co., Ltd. and changed its name to Sanxiang Advanced Materials Co., Ltd. in March 2012. Sanxiang Advanced Materials Co., Ltd. was founded in 1991 and is headquartered in Ningde, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ningde"
    },
    "603683.SS": {
        "short_name": "SHANGHAI SMITH ADHESIVE NEW MAT",
        "long_name": "Shanghai Smith Adhesive New Material Co., Ltd",
        "summary": "Shanghai Smith Adhesive New Material Co., Ltd manufactures and sells various adhesive tapes under the Ginnva brand in China. The company offers masking, duct, rice paper, electronics, foam, aluminum foil, and kraft paper tapes, as well as BOPP tapes, such as packing and stationery tapes. It serves various industries, including electronics, new materials, office supplies, packaging materials, and warning labels, as well as auto and hardware building industries. The company also exports its products to approximately 50 countries, such as Southeast Asia, the Middle East, Europe, South America, and Africa. Shanghai Smith Adhesive New Material Co., Ltd was founded in 2006 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603688.SS": {
        "short_name": "JIANGSU PACIFIC QUARTZ CO LTD",
        "long_name": "Jiangsu Pacific Quartz Co., Ltd",
        "summary": "Jiangsu Pacific Quartz Co., Ltd. engages in the research and development, manufacture, marketing, and sale of silicon quartz products in China and internationally. Its products include quartz tubing for lighting; high purity quartz sand; quartz crucibles; and quartz materials for lighting, photovoltaic, fiber optic, semiconductor industries, etc., as well as quartz rods, diffusion tubing with large outer diameter, and various quartz components. The company is based in Lianyungang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lianyungang"
    },
    "603722.SS": {
        "short_name": "WUXI ACRYL TECHNOLOGY CO LTD",
        "long_name": "Wuxi Acryl Technology Co., Ltd.",
        "summary": "Wuxi Acryl Technology Co., Ltd. produces and sells polyester, acrylic, polyurethane, high-performance epoxy, and special application resins in China. The company offers isobornyl acrylates and methacrylates, cycloaliphatic acrylates, and polyether amines. It also provides polymers for optical apparatus; and special composite materials. The company was founded in 1999 and is headquartered in Wuxi, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Wuxi"
    },
    "603737.SS": {
        "short_name": "SKSHU PAINT CO LTD",
        "long_name": "SKSHU Paint Co.,Ltd.",
        "summary": "SKSHU Paint Co.,Ltd. develops, produces, and sells paints under the 3trees brand in China. It offers decorative paints, such as interior paints; architectural coatings, including floor paints, granite paints, stone covers, texture paints, and rock chip paints; wood paints comprising ultraviolet, PU, and NC paints; and auxiliary materials consisting of adhesives, waterproof paints, and putty. The company was founded in 2007 and is headquartered in Putian, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Putian"
    },
    "603790.SS": {
        "short_name": "ARGUS (SHANGHAI) TEXITILE CHEMI",
        "long_name": "Argus (Shanghai) Textile Chemicals Co.,Ltd.",
        "summary": "Argus (Shanghai) Textile Chemicals Co.,Ltd. engages in the research and development, manufacture, and marketing of textile chemicals in China. The company offers dyes for cellulose, polyamide, wool, polyester, and silk; and pretreatment, dyeing, finishing, and printing auxiliaries, as well as enzyme, wool textile chemicals, and optical brightening agents. In addition, the company provides technical support and color services. The company also exports its products to Malaysia, the Philippines, Vietnam, Bangladesh, Pakistan, Turkey, etc. Argus (Shanghai) Textile Chemicals Co.,Ltd. is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603798.SS": {
        "short_name": "QINGDAO COPTON TECHNOLOGY CO LT",
        "long_name": "Qingdao Copton Technology Company Limited",
        "summary": "Qingdao Copton Technology Company Limited produces and sells lubricants and car care products in China. The company offers automotive lubricants, industrial lubricants, motorcycle lubricants, greases, antifreeze fluids, brake fluids, and other lubrications for vehicles and equipment; and automotive engine lubrication, fuel, transmission, gearbox, engine intake/exhaust, power steering, cooling, and air conditioning systems, as well as industrial equipment maintenance products. It provides lubricants under the Copton brand name and car care products under the Roab brand name. The company is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Qingdao"
    },
    "603822.SS": {
        "short_name": "ZHEJIANG JIAAO ENPROTECH STOCK ",
        "long_name": "Zhejiang Jiaao Enprotech Stock Co., Ltd",
        "summary": "Zhejiang Jiaao Enprotech Stock Co., Ltd engages in the research, production, and sale of plasticizers in China and internationally. It offers epoxy, fossil, and multifunctional composite products. The company provides its products for use in cables, artificial leather, flocking, light box membranes, plastic films and decking, outdoor water pipes, etc. Zhejiang Jiaao Enprotech Stock Co., Ltd was founded in 2003 and is based in Tongxiang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Tongxiang"
    },
    "603823.SS": {
        "short_name": "LILY GROUP CO LTD",
        "long_name": "Lily Group Co., Ltd.",
        "summary": "Lily Group Co., Ltd. manufactures and sells organic pigments in the People's Republic of China. It offers pigment for inks, coatings, pearlescent, and plastics; and coating and plastic color cards. The company was founded in 2010 and is based in Hangzhou, the People's Republic of China. Lily Group Co., Ltd. is a subsidiary of Lily Holding Co., Ltd.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "603826.SS": {
        "short_name": "FUJIAN KUNCAI MATERIAL TECHNOLO",
        "long_name": "Fujian Kuncai Material Technology Co., Ltd.",
        "summary": "Fujian Kuncai Material Technology Co., Ltd. develops and manufactures pearlescent pigments in China and internationally. It offers pigments for applications in automotive coatings, plastics, cosmetics, ink, fluorocarbon and industrial coatings, wallpapers, and 3c coatings. The company serves clients through a network of distributors and agents. Fujian Kuncai Material Technology Co., Ltd. was founded in 1999 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "603879.SS": {
        "short_name": "YONGYUE SCIENCE AND TECHNOLOGY ",
        "long_name": "Yongyue Science&Technology Co.,Ltd",
        "summary": "Yongyue Science&Technology Co.,Ltd engages in the research and development, production, and sale of synthetic resins in China. Its product includes unsaturated resins and polyurethane. The company was founded in 2011 and is based in Quanzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Quanzhou"
    },
    "603928.SS": {
        "short_name": "SUZHOU XINGYE MATERIALS TECHNOL",
        "long_name": "Suzhou Xingye Materials Technology Co.,Ltd.",
        "summary": "Suzhou Xingye Materials Technology Co.,Ltd. engages in the research, development, production, sale, and technical servicing of foundry functional new materials in China. It offers resins, including no-bake furan and phenolic urethane, ester and CO2 cured alkaline phenolic, cold box, easy-collapsible urethane no-bake, and acrylic resins, as well as sulfonic acid catalyst; and functional coatings, such as water-based/alcohol-based, high performance, flow, lost foam, metal mold, and special purpose coatings. The company also provides smelting material products; and feeder head products consisting of exothermic-insulating feeder sleeves, vertical cylinders, covering agents, neck downs, and boards, as well as breaker cores. In addition, it offers auxiliary materials, filter products, etc. The company's products are used in automobile, internal combustion engine and agricultural machinery, power generation, rail transportation and shipbuilding, engineering machinery, mining and heavy machinery, machine tools, cast pipes and valves, and other equipment manufacturing industries. Suzhou Xingye Materials Technology Co.,Ltd. was founded in 1996 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "603968.SS": {
        "short_name": "NANTONG ACETIC ACI",
        "long_name": "Nantong Acetic Acid Chemical Co., Ltd.",
        "summary": "Nantong Acetic Acid Chemical Co., Ltd. manufactures and sells food and feed additives, pharmaceutical and pesticide intermediates, dye and pigment intermediates, and organic chemical raw materials in China. Its food and feed additives include sorbic acid, potassium sorbate, dehydroacetic acid, sodium dehydroacetate, nicotinic acid, nicotinamide, and clopidol; pharmaceutical and pesticide intermediates comprise methyl acetoacetate, ethyl acetoacetate, 2-cyanopyridine, 3-cyanopyridine, and 4-cyanopyridine; and organic chemical raw materials consist of diketene, acetonitrile, and crotonaldehyde. The company's dye and pigment intermediates comprise acetoacetanilide, 2-methylacetoacetanilide, N-acetoacetyl-4-methylaniline, o-acetoacetaniside, p-acetoacetaniside, p-acetophenetidide, 2-chloroacetoacetanilide, 1-(p-tolyl)-3-methyl-5-pyrazolone, 1-phenyl-3-methyl-5-pyrazolone, 5-acetoacetlamino benzimdazolone, and naphthol AS-G; 2,4-dimethylacetoacetanilide; acetoacetic-2,5-dimethoxyanilide; 4-chloro-2,5-dimethoxyacetoacetanilide; and N,N'-(1,4-phenylene)bis(acetoacetamide). It also offers customized products, such as sodium acetate anhydrous, N-methylacetoacetamide, 2-isopropyl-4-methyl-6-pyrimidinone, 3-methyl-1-(4-sulfophenyl)-5-pyrazolone, 1-(3-sulfophenyl)-3-methyl-5-pyrazolone, 1-(3'-chlorophenyl)-3-methyl-5-pyrazolone, and 1-(2-chlorophenyl)-3-methyl-5-pyrazolone. The company also exports its products. Nantong Acetic Acid Chemical Co., Ltd. was founded in 1959 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nantong"
    },
    "603980.SS": {
        "short_name": "ZHEJIANG JIHUA GROUP CO LTD",
        "long_name": "Zhejiang Jihua Group Co., Ltd.",
        "summary": "Zhejiang Jihua Group Co., Ltd., together with its subsidiaries, operates in the dyestuff industry. The company produces and sells disperse, reactive, acid, direct, and vulcanizing dyes. It also provides dyestuff intermediates, H acid, synthetic-anthraquinone products, macromolecular materials, and polyurethane foams. In addition, the company offers organic silicon temperature resistant coating, fluorine-containing coating, and other products; sulfuric acid; and thermoelectric and other fundamental raw materials, as well as products for auxiliary, pharmaceutical, and financial industries. It also exports its products. The company is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "603991.SS": {
        "short_name": "SHENZHEN ORIGINAL ADVANCED COMP",
        "long_name": "Shanghai Original Advanced Compounds Co., Ltd",
        "summary": "Shanghai Original Advanced Compounds Co., Ltd engages in the research and development, production, and sale of cable materials. It offers polyolefin polymer compounds for optical cables and electrical equipment wires, and polymer compounds for power cables. The company was founded in 2004 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "605008.SS": {
        "short_name": "NINGBO CHANGHONG POLYMER SCIENT",
        "long_name": "Ningbo Changhong Polymer Scientific and Technical Inc.",
        "summary": "Ningbo Changhong Polymer Scientific and Technical Inc. produces styrene-butadiene-styrene and styrene-ethylene-butadiene-styrene products in China. Its products are used in various industrial fields, such as shoes materials, asphalt modification, plastic modification, adhesive agents, medicines, health products, waterproofing materials, construction materials, plastic runway and bicycle tire, etc. The company was founded in 2012 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "605166.SS": {
        "short_name": "HANGZHOU JUHESHUN NEW MATERIAL ",
        "long_name": "Hangzhou Juheshun New Material Co., Ltd.",
        "summary": "Hangzhou Juheshun New Material Co., Ltd. engages in the research and development, manufacture, and sale of nylon 6 chips. The company was founded in 2013 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "688021.SS": {
        "short_name": "AOFU ENVIRONMENTAL TECHNOLOGY C",
        "long_name": "Aofu Environmental Technology Co., Ltd.",
        "summary": "Aofu Environmental Technology Co., Ltd. manufactures and sells ceramic substrates worldwide. It offers SCR ceramic substrates, DPF ceramic substrates, and heat storage products. The company was founded in 2002 and is based in Dezhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Dezhou"
    },
    "688093.SS": {
        "short_name": "SUZHOU SHIHUA NEW MATERIAL TECH",
        "long_name": "Suzhou Shihua New Material Technology Co., Ltd.",
        "summary": "Suzhou Shihua New Material Technology Co., Ltd. designs, develops, and manufactures functional materials in China. It offers precision process materials, such as acrylic and silicone tapes; multiple function materials, including general bonding, ultra thin, embossed, thermal conductive, electrical conductive, removable, chemical resistance, shock absorption, and flame retardant tapes; and display module materials. The company's products are used in the consumer electronics, smart wearable devices, new energy vehicles, medical electronics, and other fields. Suzhou Shihua New Material Technology Co., Ltd was founded in 2010 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "688106.SS": {
        "short_name": "SUZHOU JINHONG GAS CO LTD",
        "long_name": "Suzhou Jinhong Gas Co., Ltd.",
        "summary": "Suzhou Jinhong Gas Co., Ltd. develops, produces, and sells conventional, special, and clean energy gas in China. Its products include natural gas, methane, boron trichloride, nitrogen trifluoride, sulfur hexafluoride, octafluorocyclobutane, hexafluoroethane, carbon tetrafluoride, hydrogen chloride, carbon monoxide, nitrous oxide, silane, high purity ammonia, dry ice, carbon dioxide, ammonia, nitrogen, argon, hydrogen, helium, acetylene, propane, and oxygen. Its products are used in electronic, light, optical fiber, semiconductor, and other industries. It also provides gas production facilities and clean piping design, construction, installation, operation, and tailor-made logistics support services. The company was founded in 1999 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Suzhou"
    },
    "688157.SS": {
        "short_name": "HUNAN SOKAN NEW MATERIALS CO LT",
        "long_name": "Hunan Sokan New Materials Co., Ltd.",
        "summary": "Hunan Sokan New Materials Co., Ltd. manufactures and sells coating materials for consumer electronics, automobiles, and other high-end consumer goods in China. The company offers a series of silicone feel paints, 3D glass photosensitive inks, PVD series of coatings, UV series of colored paints, and series of waterborne coatings technology and products. It also provides automotive anti fog resins and paints, as well as automotive parts PVD coating technology and products. The company was founded in 2009 and is based in Ningxiang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ningxiang"
    },
    "688299.SS": {
        "short_name": "NINGBO SOLARTRON TECHNOLOGY CO ",
        "long_name": "Ningbo Solartron Technology Co.,Ltd.",
        "summary": "Ningbo Solartron Technology Co.,Ltd. researches, develops, produces, and sells functional films in China and internationally. It offers reflective, back sheet base, optical base, and other high performance functional films for use in liquid crystal display, semiconductor lighting, new energy, semiconductor flexible circuit board, and other fields. The company was founded in 2010 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Ningbo"
    },
    "688300.SS": {
        "short_name": "NOVORAY CORPORATION",
        "long_name": "Novoray Corporation",
        "summary": "Novoray Corporation researches, develops, manufactures, and sells industrial powder materials for various applications worldwide. The company offers crystalline silica powder, fused silica powder, soft composite silica powder, round corner crystalline silica powder, spherical silica powder, spherical aluminum oxide powder, sub-micron spherical silica powder, and acicular powder. It serves electronic materials, electrical insulating materials, ceramics, precision casting, paints and coatings, silicon rubber, functional rubber, plastics, and building materials manufacturing industries worldwide. Novoray Corporation was founded in 1984 and is based in Lianyungang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lianyungang"
    },
    "688350.SS": {
        "short_name": "JIANGSU FEYMER TECHNOLOGY CO LT",
        "long_name": "Jiangsu Feymer Technology Co., Ltd.",
        "summary": "Jiangsu Feymer Technology Co., Ltd. produces and sells hydrophilic functional polymers in China. The company offers functional monomers; chemicals for water and sludge treatment, membrane, pulp and paper, mineral washing, textile printing and dyeing, and oil and gas production; and water treatment membrane products. Jiangsu Feymer Technology Co., Ltd. was founded in 2010 and is based in Zhangjiagang, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Zhangjiagang"
    },
    "688356.SS": {
        "short_name": "JENKEM TECHNOLOGY CO LTD",
        "long_name": "Jenkem Technology Co., Ltd.",
        "summary": "Jenkem Technology Co., Ltd. develops and manufactures polyethylene glycol derivative (PEG) products in China. The company offers branched, linear, double substituted, heterofunctional double substituted, multi-arm, multi-arm hetero functional double substituted, and monodisperse PEG products, as well as amino, sulfhydryl, and N-terminal pegylated PEG products. It also provides PEGylation services for proteins, peptides, oligonucleotides, and small molecules, as well as custom PEG synthesis of PEG derivatives. The company was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "688378.SS": {
        "short_name": "JILIN OLED MATERIAL TECH CO LTD",
        "long_name": "Jilin OLED Material Tech Co., Ltd.",
        "summary": "Jilin OLED Material Tech Co., Ltd. engages in the research and development, production, and sale of organic electroluminescent materials and equipment for the new display industry in China. It offers electronic functional materials; hole functional materials; light-emitting functional materials, such as fluorescent materials and phosphorescent materials; OLED intermediates; and other functional materials. The company also exports its products to Japan, South Korea, Europe, the United States, and other countries. Jilin OLED Material Tech Co., Ltd. was founded in 2005 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Changchun"
    },
    "688398.SS": {
        "short_name": "FUJIAN SUPERTECH ADVANCED MATER",
        "long_name": "Fujian Supertech Advanced Material Co., Ltd.",
        "summary": "Fujian Supertech Advanced Material Co., Ltd. engages in the research and development, production, and sale of vacuum insulation panels in China. Its vacuum insulation panels are used in refrigerators, freezers, refrigerated trucks and containers, water heaters, vending machines, ice storage tanks, and energy saving insulating materials. It also provides clod chain insulated boxes. Fujian Supertech Advanced Material Co., Ltd. was founded in 2007 and is based in Longyan, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Longyan"
    },
    "688585.SS": {
        "short_name": "SWANCOR ADVANCED MATERIALS CO L",
        "long_name": "Swancor Advanced Materials Co., Ltd.",
        "summary": "Swancor Advanced Materials Co., Ltd. produces and sells corrosion resistant resins and protection materials. The company was founded in 2000 and is base in Shanghai, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "688669.SS": {
        "short_name": "POLYROCKS CHEMICAL CO LTD",
        "long_name": "Polyrocks Chemical Co., Ltd",
        "summary": "Polyrocks Chemical Co., Ltd researches, produces, and distributes environmental halogen-free flame retardant plastics. It offers environmental halogen-free flame retardant thermoplastic plastics, wire and cable materials, other materials, and compound plastics. It also provides environmental flame-retarded resins, functional master batches, and elastomeric products, which includes household appliances, decorative lighting, wires and cables, OA communication, and electrical and electronics. The company was founded in 2007 and is based in Qingyuan City, China.",
        "currency": "CNY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Qingyuan City"
    },
    "8C9.F": {
        "short_name": "CN.SANJIANG F.CHEM.HD-,10",
        "long_name": "China Sanjiang Fine Chemicals Company Limited",
        "summary": "China Sanjiang Fine Chemicals Company Limited, an investment holding company, manufactures and supplies ethylene oxide and glycol, propylene, polypropylene, methyl tert-butyl ether (MTBE), and surfactants in the People's Republic of China. Its ethylene oxide is used as an intermediary component for the production of ethylene derivative products that include ethanolamines and glycol ethers, and a range of surfactants; ethylene glycol is used to produce other bio-organic chemical products that comprise mono ethylene glycol; propylene is used in the production of polypropylene, acrylonitrile, propylene oxide, acetone, etc.; polypropylene is a thermoplastic resin used in knitting, injection molding, film, fiber, and pipe products; MTBE, a gasoline additive used as an oxygenate to raise the octane number and used as a fuel component in fuel for gasoline engines; and surfactants are applied in various industries as scouring agents, moisturizing agents, emulsifiers, and solubilisers. The company also produces and supplies other chemical products, such as C4; crude pentene; and industrial gases, such as oxygen, nitrogen, and argon. In addition, it offers processing services for polypropylene, MTBE, and surfactants; and lease and storage services, as well as provides asset management services. Further, the company is involved in the construction and management of a pipe network at Jiaxing Port Chemical Industrial Park; manufacture and sale of alcohol ethoxylate, nonylphenols, textile auxiliaries, and polyethylene; and equipment rental. China Sanjiang Fine Chemicals Company Limited was incorporated in 2009 and is headquartered in Jiaxing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Jiaxing"
    },
    "9936.HK": {
        "short_name": "XIMEI RESOURCES",
        "long_name": "Ximei Resources Holding Limited",
        "summary": "Ximei Resources Holding Limited produces and sells tantalum- and niobium-based metallurgical products in the People's Republic of China, the United States, the European countries, and internationally. It offers tantalum pentoxide and niobium pentoxide, as well as potassium heptafluorotantalate; and tantalum powder, tantalum bars, niobium bars, and niobium powders. The company also provides services for processing tantalum ores and niobium ores supplied by its customers into pentoxide products and potassium heptafluorotantalate. Ximei Resources Holding Limited was founded in 2006 and is headquartered in Yingde, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Yingde"
    },
    "ACRB": {
        "short_name": "ASIA CARBON INDS INC",
        "long_name": "Asia Carbon Industries, Inc.",
        "summary": "Asia Carbon Industries, Inc., through its subsidiaries, engages in manufacturing and selling carbon black products in the People's Republic of China. The company offers N220, a hard carbon black, primarily used in the manufacturing of automobile tires; N330, a hard carbon black, which is used in manufacturing sides of automobile tires; and N660, a soft carbon black, used for the production of automobile tire inner tubes and hoses. It offers its products under the brand name of Great Double Star. Asia Carbon Industries, Inc. was founded in 2003 and is based in Taiyuan, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Taiyuan"
    },
    "BKK.SI": {
        "short_name": "Luxking",
        "long_name": "Luxking Group Holdings Limited",
        "summary": "Luxking Group Holdings Limited, an investment holding company, manufactures and markets pressure-sensitive adhesive tape products in the People's Republic of China, Hong Kong, and internationally. It manufactures and distributes adhesive tapes, such as stationary tapes, masking tapes, and double-sided tapes for industrial, commercial, and customer uses; and industrial specialty tapes for manufacturing and/or assembly processes, primarily used for mobile and electronic appliances. The company also provides biaxially oriented polypropylene films (BOPP) for packaging applications in food, pharmaceutical, medical, and electrical industries. In addition, it offers PET spacers for consumer electronics applications, such as home appliances, mobile phones, etc.; aluminum foil tapes that protects gas, exhaust, water, and oil pipes against corrosion, as well as is used for insulation applications; PVC double-sided tapes for bonding applications; and optical clear transfer tapes that are used in bonding of film and glass laminates in touch screen displays, mounting of transparent graphic overlays, and bonding of optical film/backlight module to LCDs. Further, the company provides comprise high performance double-sided tapes for mounting of metal or plastic name plates and in foam and film lamination; general purpose double-sided tapes for office and home applications; BOPP films used directly or coated with other materials for packaging purpose; and light shielding/reflecting double-sided tapes, which are used in mounting of LCD and backlight modules of handheld devices. Additionally, it engages in trading of BOPP films, polypropylene resins, general tapes, and industrial tapes. Luxking Group Holdings Limited was founded in 1995 and is headquartered in Zhongshan, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "city": "Zhongshan"
    },
    "CCGY": {
        "short_name": "CHINA CLEAN ENERGY INC",
        "long_name": "China Clean Energy Inc.",
        "summary": "China Clean Energy Inc., through its subsidiaries, engages in the development, manufacture, and distribution of biodiesel and specialty chemical products made from renewable resources. The company refines biodiesel from waste vegetable oils and waste grease. It also manufactures and sells various industrial chemical products, including polyamide hot-melt adhesives, printing inks, and alcohol and benzene-soluble polyamide resins, as well as various fatty acids, such as dimer, stearic, and monomer acids. The company sells its biodiesel products to service stations and power generating plants in the People's Republic of China; and specialty chemical products to companies in the People's Republic of China, Europe, the United States, and Asia. China Clean Energy Inc. was founded in 1995 and is headquartered in Fuqing, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Fuqing"
    },
    "CNEY": {
        "short_name": "CN Energy Group Inc.",
        "long_name": "CN Energy Group. Inc.",
        "summary": "CN Energy Group. Inc. manufactures and supplies wood-based activated carbon in China. Its product is primarily used in pharmaceutical and industrial manufacturing, water purification, environmental protection, and food and beverage production markets. The company also serves activated carbon wholesalers and companies engaging in the activated carbon deep processing business. In addition, it produces and supplies biomass electricity generated in the process of producing activated carbon to State Grid Heilongjiang Electric Power Company Limited. The company was founded in 2018 and is based in Lishui, China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Lishui"
    },
    "FFO1.F": {
        "short_name": "FUFENG GROUP LTD  HD -,10",
        "long_name": "Fufeng Group Limited",
        "summary": "Fufeng Group Limited, an investment holding company, engages in the manufacture and sale of fermentation-based food additive, and biochemical and starch-based products in the People's Republic of China and internationally. It operates through Food Additives, Animal Nutrition, High-End Amino Acid, Colloid, and Other segments. The Food Additives segment manufactures and sells monosodium glutamate, starch sweeteners, glutamic acid, compound seasoning, and corn oil. The Animal Nutrition segment manufactures and sells corn refined products, threonine, and lysine. The High-End Amino Acid segment offers high-end amino acid products. The Colloid segment provides xanthan and gellan gum products. The Other segment offers fertilisers, synthetic ammonia, pharmaceuticals, and other products. It also engages in the manufacture and sale of autoclaved aerated concrete blocks, eubacteria material medicine, preparations and food additives, bricks, and other related products; research and development, promotion, and industrialization of new biological techniques and achievements; sale of cosmetics, biological products, and health food and other related products; and provision of logistics and equity investment services, as well as information services of biological techniques. Fufeng Group Limited was founded in 1999 and is based in Linyi, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Linyi"
    },
    "FFO1.MU": {
        "short_name": "FUFENG GROUP LTD  HD -,10",
        "long_name": "Fufeng Group Limited",
        "summary": "Fufeng Group Limited, an investment holding company, engages in the manufacture and sale of fermentation-based food additive, and biochemical and starch-based products in the People's Republic of China and internationally. It operates through Food Additives, Animal Nutrition, High-End Amino Acid, Colloid, and Other segments. The Food Additives segment manufactures and sells monosodium glutamate, starch sweeteners, glutamic acid, compound seasoning, and corn oil. The Animal Nutrition segment manufactures and sells corn refined products, threonine, and lysine. The High-End Amino Acid segment offers high-end amino acid products. The Colloid segment provides xanthan and gellan gum products. The Other segment offers fertilisers, synthetic ammonia, pharmaceuticals, and other products. It also engages in the manufacture and sale of autoclaved aerated concrete blocks, eubacteria material medicine, preparations and food additives, bricks, and other related products; research and development, promotion, and industrialization of new biological techniques and achievements; sale of cosmetics, biological products, and health food and other related products; and provision of logistics and equity investment services, as well as information services of biological techniques. Fufeng Group Limited was founded in 1999 and is based in Linyi, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "city": "Linyi"
    },
    "GURE": {
        "short_name": "Gulf Resources, Inc.",
        "long_name": "Gulf Resources, Inc.",
        "summary": "Gulf Resources, Inc., through its subsidiaries, manufactures and trades bromine and crude salt, chemical products, and natural gas in the People's Republic of China. It provides bromine for use in brominated flame retardants, fumigants, water purification compounds, dyes, medicines, and disinfectants. The company also offers crude salt for use as a material in alkali and chlorine alkali production; and for use in the chemical, food and beverage, and other industries. In addition, it manufactures and sells chemical products for use in oil and gas field exploration, oil and gas distribution, oil field drilling, papermaking chemical agents, and inorganic chemicals, as well as materials that are used for human and animal antibiotics. The company is founded in 2006 and is based in Shouguang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shouguang"
    },
    "R29B.F": {
        "short_name": "GULF RES INC.  DL-,0005",
        "long_name": "Gulf Resources, Inc.",
        "summary": "Gulf Resources, Inc., through its subsidiaries, manufactures and trades bromine and crude salt, chemical products, and natural gas in the People's Republic of China. It provides bromine for use in brominated flame retardants, fumigants, water purification compounds, dyes, medicines, and disinfectants. The company also offers crude salt for use as a material in alkali and chlorine alkali production; and for use in the chemical, food and beverage, and other industries. In addition, it manufactures and sells chemical products for use in oil and gas field exploration, oil and gas distribution, oil field drilling, papermaking chemical agents, and inorganic chemicals, as well as materials that are used for human and animal antibiotics. The company is founded in 2006 and is based in Shouguang, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shouguang"
    }
}