{
    "03P.SG": {
        "short_name": "Thessaloniki Port Authority SAN",
        "long_name": "Thessaloniki Port Authority Societe Anonyme",
        "summary": "Thessaloniki Port Authority Societe Anonyme engages in the management and exploitation of the port of Thessaloniki located in Greece. It operates through four segments: Container Terminal, Conventional Cargo, Passenger Traffic, and Utilization of Facilities. The company provides conventional cargo handling services, including loading and unloading services, and SILO services; and containerized cargo handling services. It also offers ships anchoring, mooring, berthing, and other services; and services to passengers on coastal and cruise ships and in transit. In addition, it offers spaces for commercial and other uses; and operates car parking stations. The company primarily serves industries, shipping agents, container transportation companies, and freight transport companies. Thessaloniki Port Authority Societe Anonyme was established in 1999 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Thessaloniki"
    },
    "1GT.F": {
        "short_name": "GEK TERNA S.A.  EO 0,57",
        "long_name": "GEK TERNA Holdings, Real Estate, Construction S.A.",
        "summary": "GEK TERNA Holdings, Real Estate, Construction S.A., together with its subsidiaries, engages in the construction, energy, real estate, industrial, and concession businesses in Greece, the Balkans, the Middle East, Eastern Europe, the United States, and internationally. The company is involved in the construction of motorways, buildings, ports, and large energy projects; the financing, management, and commercial exploitation of concession projects, such as operation of car parking. It also constructs and operates wind farms, hydroelectric projects, pumping storage projects, hybrid stations, and photovoltaics, as well as the undertaking of integrated projects for waste management, biofuels, and other materials with an installed capacity of 1,363.7 MW; and trades in electric energy and natural gas. In addition, the company engages in the acquisition, development, and exploitation of real estate properties, including business centers, logistic centers, industrial parks, entertainment parks, residential properties, commercial properties, hotels, etc.; production of quarry products; and exploitation of magnesite products. Further, it operates Borovets Euphoria Club Hotel & Spa in Bulgaria; and owns two thermal power plants with a total installed capacity of 147 MW and 435 MW in Viotia, Greece. The company was formerly known as Ermis Real Estate Constructions Enterprises S.A. and changed its name to GEK TERNA Holdings, Real Estate, Construction S.A. in 2008. The company was founded in 1960 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "32A.F": {
        "short_name": "AEGEAN AIRLINES EO -,65",
        "long_name": "Aegean Airlines S.A.",
        "summary": "Aegean Airlines S.A., an airline company, provides public airline transportation services in Greece and internationally. It transports passengers and goods through scheduled and unscheduled flights; and offers aviation, technical support, and ground handling aircraft services. As of June 25, 2020, it operated a fleet of 65 aircraft, 53 jet aircraft, and 12 turboprop aircraft. Aegean Airlines S.A. was founded in 1988 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "AGZNF": {
        "short_name": "AEGEAN AIRLINES",
        "long_name": "Aegean Airlines S.A.",
        "summary": "Aegean Airlines S.A., an airline company, provides public airline transportation services in Greece and internationally. It transports passengers and goods through scheduled and unscheduled flights; and offers aviation, technical support, and ground handling aircraft services. As of June 25, 2020, it operated a fleet of 65 aircraft, 53 jet aircraft, and 12 turboprop aircraft. Aegean Airlines S.A. was founded in 1988 and is headquartered in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airlines",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "BSTN": {
        "short_name": "BOSTON CARRIERS INC",
        "long_name": "Boston Carriers, Inc.",
        "summary": "Boston Carriers, Inc., through its subsidiary, Poseidon Navigation Corp., owns and operates a dry bulk vessel that transport iron ore, coal, grains, steel products, cement, alumina, and other dry bulk cargoes worldwide. The company was formerly known as Integrated Inpatient Solutions, Inc. and changed its name to Boston Carriers, Inc. in March 2016. Boston Carriers, Inc. is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "CPLP": {
        "short_name": "Capital Product Partners L.P.",
        "long_name": "Capital Product Partners L.P.",
        "summary": "Capital Product Partners L.P., a shipping company, provides marine transportation services in Greece. Its vessels transports a range of dry cargoes and containerized goods under short-term voyage charters, and medium to long-term time and bareboat charters. As of April 26, 2021, the company owned 17 vessels, including thirteen Neo-Panamax container vessels, three Panamax container vessels, and one Capesize bulk carrier. Capital GP L.L.C. serves as the general partner of the company. The company was incorporated in 2007 and is headquartered in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "DAC": {
        "short_name": "Danaos Corporation",
        "long_name": "Danaos Corporation",
        "summary": "Danaos Corporation, together with its subsidiaries, owns and operates containerships in Australia, Asia, Europe, and the United States. The company offers seaborne transportation services, such as chartering its vessels to liner companies. As of February 28, 2021, it had a fleet of 65 containerships aggregating 403,793 twenty foot equivalent units in capacity. The company was formerly known as Danaos Holdings Limited and changed its name to Danaos Corporation in October 2005. Danaos Corporation was founded in 1972 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "DS2U.F": {
        "short_name": "PERFORMANCE SHIPP. NEW",
        "long_name": "Performance Shipping Inc.",
        "summary": "Performance Shipping Inc., through its subsidiaries, provides shipping transportation services through its ownership of tanker vessels worldwide. As of April 7, 2021, it owned and operated five Aframax tanker vessels with a combined carrying capacity of 546,094 dwt. The company was incorporated in 2010 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "DSX-PB": {
        "short_name": "Diana Shipping Inc. Perpetual P",
        "long_name": "Diana Shipping Inc.",
        "summary": "Diana Shipping Inc. provides shipping transportation services. The company transports a range of dry bulk cargoes, including commodities, such as iron ore, coal, grain, and other materials in shipping routes worldwide. As of March 11, 2021, it operated a fleet of 37 dry bulk vessels, including 4 Newcastlemax, 12 Capesize, 5 Post-Panamax, 5 Kamsarmax, and 11 Panamax), as well as one Panamax dry bulk vessel. The company was formerly known as Diana Shipping Investments Corp. and changed its name to Diana Shipping Inc. in February 2005. Diana Shipping Inc. was incorporated in 1999 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "DSX": {
        "short_name": "Diana Shipping inc.",
        "long_name": "Diana Shipping Inc.",
        "summary": "Diana Shipping Inc. provides shipping transportation services. The company transports a range of dry bulk cargoes, including commodities, such as iron ore, coal, grain, and other materials in shipping routes worldwide. As of March 11, 2021, it operated a fleet of 37 dry bulk vessels, including 4 Newcastlemax, 12 Capesize, 5 Post-Panamax, 5 Kamsarmax, and 11 Panamax), as well as one Panamax dry bulk vessel. The company was formerly known as Diana Shipping Investments Corp. and changed its name to Diana Shipping Inc. in February 2005. Diana Shipping Inc. was incorporated in 1999 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "DSZ.F": {
        "short_name": "DIANA SHIPPING INC.DL-,01",
        "long_name": "Diana Shipping Inc.",
        "summary": "Diana Shipping Inc. provides shipping transportation services. The company transports a range of dry bulk cargoes, including commodities, such as iron ore, coal, grain, and other materials in shipping routes worldwide. As of March 11, 2021, it operated a fleet of 37 dry bulk vessels, including 4 Newcastlemax, 12 Capesize, 5 Post-Panamax, 5 Kamsarmax, and 11 Panamax), as well as one Panamax dry bulk vessel. The company was formerly known as Diana Shipping Investments Corp. and changed its name to Diana Shipping Inc. in February 2005. Diana Shipping Inc. was incorporated in 1999 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "DVW1.F": {
        "short_name": "DANAOS CORP.  DL -,01",
        "long_name": "Danaos Corporation",
        "summary": "Danaos Corporation, together with its subsidiaries, owns and operates containerships in Australia, Asia, Europe, and the United States. The company offers seaborne transportation services, such as chartering its vessels to liner companies. As of February 28, 2021, it had a fleet of 65 containerships aggregating 403,793 twenty foot equivalent units in capacity. The company was formerly known as Danaos Holdings Limited and changed its name to Danaos Corporation in October 2005. Danaos Corporation was founded in 1972 and is based in Piraeus, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "EDRY": {
        "short_name": "EuroDry Ltd.",
        "long_name": "EuroDry Ltd.",
        "summary": "EuroDry Ltd., through its subsidiaries, provides ocean-going transportation services worldwide. The company owns and operates drybulk carriers that transport major bulks, such as iron ore, coal, and grains; and minor bulks comprising bauxite, phosphate, and fertilizers. As of March 31, 2020, it operated a fleet of seven drybulk vessels, including four Panamax drybulk carriers, one Ultramax drybulk carrier, and two Kamsarmax carriers with a cargo capacity of 528,931 deadweight tons. EuroDry Ltd. was founded in 2018 and is based in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "ELLKY": {
        "short_name": "ELLAKTOR SA",
        "long_name": "Ellaktor S.A.",
        "summary": "Ellaktor S.A., through its subsidiaries, engages in the construction and quarrying, real estate development and management, wind power, environment, and concession businesses. The company constructs bridges, motorways, metro projects, biological treatment plants, natural gas pipelines, refineries, shopping centers, casinos, tourist and hotel units, cultural centers, hospitals, airports, Olympic and athletic complexes, railway projects, tunnels, dams, port projects, energy production stations, electromechanical projects, etc.; and logistics, office, residential, industrial, and educational buildings. It is also involved in the waste management and energy production, which include design, construction, and operation of waste treatment plant, as well as offers alternative fuel production and biomass exploitation projects. In addition, the company develops, constructs, and operates wind farms; provides real estate development and services, which consists of retail parks, entertainment centers, residential complexes, exhibition centers, and offices and mixed use buildings; and provides consultancy and services to third parties. Ellaktor S.A. operates in Greece, other European countries, Gulf countries, the Americas, Africa, and Australia. The company was formerly known as ELLINIKI TECHNODOMIKI TEB SA and changed its name to Ellaktor S.A. in 2008. Ellaktor S.A. is based in Athens, Greece.  As per the transaction announced on January 8, 2021, Ellaktor S.A. operates as a subsidiary of Reggeborgh Invest B.V.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "ESEA": {
        "short_name": "Euroseas Ltd.",
        "long_name": "Euroseas Ltd.",
        "summary": "Euroseas Ltd. provides ocean-going transportation services worldwide. The company owns and operates containerships that transport dry and refrigerated containerized cargoes primarily, including manufactured products and perishables. As of April 15, 2020, its fleet consisted of 19 containerships. The company was founded in 2005 and is based in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "FREEF": {
        "short_name": "FREESEAS INC",
        "long_name": "FreeSeas Inc.",
        "summary": "FreeSeas Inc., a drybulk shipping company, engages in the transportation of drybulk cargoes. The company transports various drybulk commodities, including iron ore, grain, and coal, as well as bauxite, phosphate, fertilizers, steel products, cement, sugar, and rice. It owns and operates a handysize dry bulk carrier. As of April 20, 2018, it operated one handysize drybulk carrier with a capacity of approximately 30,838 deadweight tons. The company was formerly known as Adventure Holdings S.A. and changed its name to FreeSeas Inc. in April 2005. FreeSeas Inc. was founded in 2004 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "GASS": {
        "short_name": "StealthGas, Inc.",
        "long_name": "StealthGas Inc.",
        "summary": "StealthGas Inc., together with its subsidiaries, provides seaborne transportation services to liquefied petroleum gas (LPG) producers and users internationally. It also provides crude oil and product carriers chartered to oil producers, refiners, and commodities traders. The company's carriers carry various petroleum gas products in liquefied form, including propane, butane, butadiene, isopropane, propylene, and vinyl chloride monomer; and refined petroleum products, such as gasoline, diesel, fuel oil, and jet fuel, as well as edible oils and chemicals. As of April 1, 2021, it had a fleet of 50 vessels comprising 46 LPG carriers with a total capacity of 436,692 cubic meters; three medium range product carriers with a total capacity of 140,000 deadweight tons (dwt); and one Aframax crude oil tanker with a total capacity of 115,804 dwt. StealthGas Inc. was incorporated in 2004 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "GLBS": {
        "short_name": "Globus Maritime Limited",
        "long_name": "Globus Maritime Limited",
        "summary": "Globus Maritime Limited, an integrated dry bulk shipping company, provides marine transportation services worldwide. It owns, operates, and manages a fleet of dry bulk vessels that transport iron ore, coal, grain, steel products, cement, alumina, and other dry bulk cargoes. As of December 31, 2020, the company owned and operated six vessels with a total carrying capacity of 381,738 deadweight tonnage. It charters its vessels to operators, trading houses, shipping companies and producers, and government-owned entities. The company was incorporated in 2006 and is based in Athens, Greece. Globus Maritime Limited operates as a subsidiary of Firment Trading Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "HLL.F": {
        "short_name": "ELLAKTOR S.A.NAM. EO 1,03",
        "long_name": "Ellaktor S.A.",
        "summary": "Ellaktor S.A., through its subsidiaries, engages in the construction and quarrying, real estate development and management, wind power, environment, and concession businesses. The company constructs bridges, motorways, metro projects, biological treatment plants, natural gas pipelines, refineries, shopping centers, casinos, tourist and hotel units, cultural centers, hospitals, airports, Olympic and athletic complexes, railway projects, tunnels, dams, port projects, energy production stations, electromechanical projects, etc.; and logistics, office, residential, industrial, and educational buildings. It is also involved in the waste management and energy production, which include design, construction, and operation of waste treatment plant, as well as offers alternative fuel production and biomass exploitation projects. In addition, the company develops, constructs, and operates wind farms; provides real estate development and services, which consists of retail parks, entertainment centers, residential complexes, exhibition centers, and offices and mixed use buildings; and provides consultancy and services to third parties. Ellaktor S.A. operates in Greece, other European countries, Gulf countries, the Americas, Africa, and Australia. The company was formerly known as ELLINIKI TECHNODOMIKI TEB SA and changed its name to Ellaktor S.A. in 2008. Ellaktor S.A. is based in Athens, Greece.  As per the transaction announced on January 8, 2021, Ellaktor S.A. operates as a subsidiary of Reggeborgh Invest B.V.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "IJ6.SG": {
        "short_name": "Avax S.A. Namens-Aktien EO 0,30",
        "long_name": "Avax S.A.",
        "summary": "Avax S.A., together with its subsidiaries, operates as a construction company in Greece and internationally. It operates through four segments: Construction, Concessions, Energy, and Other Activities. The company constructs civil engineering projects, including airports, banks, buildings, education facilities, garages, hospitals, hotels, Olympic sports facilities, special projects, sports facilities, and other civil engineering projects. It also constructs energy and industrial projects, such as environmental plants; natural gas and petrochemical projects; and power plant projects; and infrastructure projects, such as bridges, harbors, railroads, roads, and other infrastructure projects. In addition, the company is involved in activities focusing on the residential development-urban and country/holiday homes and investing in commercial real estate; and vehicle technical inspection, and facility management services. The company was formerly known as J&P-AVAX S.A. and changed its name to Avax S.A. in April 2019. Avax S.A. was founded in 1986 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "MYH.F": {
        "short_name": "MYTILINEOS SA NAM.EO 0,97",
        "long_name": "Mytilineos S.A.",
        "summary": "Mytilineos S.A. operates in metallurgy, sustainable engineering solution, renewables and storage development, and power and gas sectors in Greece, European Union, and internationally. The company's principal business areas include production of electricity and natural gas; operation of industrial and renewable energy plants with a total installed capacity of 1,200 MW; trading of gas; production of alumina and aluminum, as well as bauxite; and production, processing, and trading of metals, which include aluminum alloys and derivative products. Its principal business areas also include development of solar PV and energy storage; contractor of specialized large-scale integrated turn-key projects; provision of environmental solutions for water, liquid, and solid waste; energy solutions; and construction of infrastructure projects, as well as provides range of project management, engineering, procurement, construction, and plant commissioning services. The company was formerly known as Mytilineos Holdings S.A. and changed its name to Mytilineos S.A. in July 2019. Mytilineos S.A. was founded in 1908 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "MYTHY": {
        "short_name": "MYTILINEOS S.A",
        "long_name": "Mytilineos S.A.",
        "summary": "Mytilineos S.A. operates in metallurgy, sustainable engineering solution, renewables and storage development, and power and gas sectors in Greece, European Union, and internationally. The company's principal business areas include production of electricity and natural gas; operation of industrial and renewable energy plants with a total installed capacity of 1,200 MW; trading of gas; production of alumina and aluminum, as well as bauxite; and production, processing, and trading of metals, which include aluminum alloys and derivative products. Its principal business areas also include development of solar PV and energy storage; contractor of specialized large-scale integrated turn-key projects; provision of environmental solutions for water, liquid, and solid waste; energy solutions; and construction of infrastructure projects, as well as provides range of project management, engineering, procurement, construction, and plant commissioning services. The company was formerly known as Mytilineos Holdings S.A. and changed its name to Mytilineos S.A. in July 2019. Mytilineos S.A. was founded in 1908 and is headquartered in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "OET.OL": {
        "short_name": "OKEANIS ECO TANKER",
        "long_name": "Okeanis Eco Tankers Corp.",
        "summary": "Okeanis Eco Tankers Corp. owns, charters out, and operates tanker vessels. The company also offers commercial shipping services. As of February 12, 2021, its fleet comprised 17 vessels, including three Aframax/LR2 vessels, six Suezmax vessels, and eight VLCC vessels. The company was incorporated in 2018 and is based in Piraeus, Greece.",
        "currency": "NOK",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "OKENF": {
        "short_name": "OKEANIS ECO TANKERS CORP",
        "long_name": "Okeanis Eco Tankers Corp.",
        "summary": "Okeanis Eco Tankers Corp. owns, charters out, and operates tanker vessels. The company also offers commercial shipping services. As of February 12, 2021, its fleet comprised 17 vessels, including three Aframax/LR2 vessels, six Suezmax vessels, and eight VLCC vessels. The company was incorporated in 2018 and is based in Piraeus, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "PRGNF": {
        "short_name": "PARAGON SHIPPING INC",
        "long_name": "Paragon Shipping Inc.",
        "summary": "Paragon Shipping Inc. provides shipping transportation services worldwide. It engages in the ocean transportation of drybulk cargoes, including commodities, such as iron ore, coal, grain, and other materials. Paragon Shipping Inc. was founded in 2006 and is based in Voula, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Voula"
    },
    "PSHG": {
        "short_name": "Performance Shipping Inc.",
        "long_name": "Performance Shipping Inc.",
        "summary": "Performance Shipping Inc., through its subsidiaries, provides shipping transportation services through its ownership of tanker vessels worldwide. As of April 7, 2021, it owned and operated five Aframax tanker vessels with a combined carrying capacity of 546,094 dwt. The company was incorporated in 2010 and is based in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "PXS": {
        "short_name": "Pyxis Tankers Inc.",
        "long_name": "Pyxis Tankers Inc.",
        "summary": "Pyxis Tankers Inc. operates as a maritime transportation company with a focus on the tanker sector in the United States. Its fleet transports refined petroleum products, such as naphtha, gasoline, jet fuel, kerosene, diesel, and fuel oil, as well as other liquid bulk items, including vegetable oils and organic chemicals. As of April 12, 2021, the company operated a fleet of five tankers. Pyxis Tankers Inc. was incorporated in 2015 and is based in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "PXSAP": {
        "short_name": "Pyxis Tankers Inc. - 7.75% Seri",
        "long_name": "Pyxis Tankers Inc.",
        "summary": "Pyxis Tankers Inc. operates as a maritime transportation company with a focus on the tanker sector in the United States. Its fleet transports refined petroleum products, such as naphtha, gasoline, jet fuel, kerosene, diesel, and fuel oil, as well as other liquid bulk items, including vegetable oils and organic chemicals. As of April 12, 2021, the company operated a fleet of five tankers. Pyxis Tankers Inc. was incorporated in 2015 and is based in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "PZE.SG": {
        "short_name": "Piraeus Port Authority Namens-A",
        "long_name": "Piraeus Port Authority S.A.",
        "summary": "Piraeus Port Authority S.A. provides port services at the port of Piraeus, Greece. The company operates through Container Terminal, Handling Car, Coasting, Cruise, Ship Repairing, and Other segments. It offers anchoring services of vessels, cargo handling, loading, and unloading services, as well as goods storage and car transportation services. The company is also involved in maintenance of port facilities. In addition, it offers port services, including water, electricity, space management, merchandise management, and telephone connection to ships; and services to travelers, as well as rents space to third parties. The company was founded in 1930 and is based in Piraeus, Greece. Piraeus Port Authority S.A. is a subsidiary of COSCO SHIPPING (Hong Kong) Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Piraeus"
    },
    "RHSR.F": {
        "short_name": "SEANERGY MARITIME HLDGS",
        "long_name": "Seanergy Maritime Holdings Corp.",
        "summary": "Seanergy Maritime Holdings Corp., an international shipping company, engages in the seaborne transportation of dry bulk commodities primarily iron ore and coal worldwide. As of February 19, 2021, it operated a fleet of 11 Capesize vessels with a cargo-carrying capacity of approximately 1,926,117 deadweight ton and an average age of approximately 12 years. Seanergy Maritime Holdings Corp.is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "S6W.F": {
        "short_name": "STEALTHGAS INC.",
        "long_name": "StealthGas Inc.",
        "summary": "StealthGas Inc., together with its subsidiaries, provides seaborne transportation services to liquefied petroleum gas (LPG) producers and users internationally. It also provides crude oil and product carriers chartered to oil producers, refiners, and commodities traders. The company's carriers carry various petroleum gas products in liquefied form, including propane, butane, butadiene, isopropane, propylene, and vinyl chloride monomer; and refined petroleum products, such as gasoline, diesel, fuel oil, and jet fuel, as well as edible oils and chemicals. As of April 1, 2021, it had a fleet of 50 vessels comprising 46 LPG carriers with a total capacity of 436,692 cubic meters; three medium range product carriers with a total capacity of 140,000 deadweight tons (dwt); and one Aframax crude oil tanker with a total capacity of 115,804 dwt. StealthGas Inc. was incorporated in 2004 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "SBLK": {
        "short_name": "Star Bulk Carriers Corp.",
        "long_name": "Star Bulk Carriers Corp.",
        "summary": "Star Bulk Carriers Corp., a shipping company, engages in the ocean transportation of dry bulk cargoes worldwide. The company's vessels transport a range of major bulks, including iron ores, coal, and grains, as well as minor bulks, such as bauxite, fertilizers, and steel products. As of March 16, 2021, it had a fleet of 128 vessels with an aggregate capacity of approximately 14.1 million deadweight tons, including 17 Newcastlemax, 22 Capesize, 2 Mini Capesize, 7 Post Panamax, 41 Kamsarmax, 2 Panamax, 20 Ultramax, and 17 Supramax vessels. The company also provides vessel management services. Star Bulk Carriers Corp. was incorporated in 2006 and is based in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "SHIP": {
        "short_name": "Seanergy Maritime Holdings Corp",
        "long_name": "Seanergy Maritime Holdings Corp.",
        "summary": "Seanergy Maritime Holdings Corp., an international shipping company, engages in the seaborne transportation of dry bulk commodities primarily iron ore and coal worldwide. As of February 19, 2021, it operated a fleet of 11 Capesize vessels with a cargo-carrying capacity of approximately 1,926,117 deadweight ton and an average age of approximately 12 years. Seanergy Maritime Holdings Corp.is headquartered in Athens, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    },
    "TEUCF": {
        "short_name": "BOX SHIPS INC",
        "long_name": "Box Ships Inc.",
        "summary": "Box Ships Inc. provides commercial management services to shipping companies worldwide. The company was founded in 2010 and is based in Voula, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Voula"
    },
    "TEUFF": {
        "short_name": "BOX SHIPS INC",
        "long_name": "Box Ships Inc.",
        "summary": "Box Ships Inc. provides commercial management services to shipping companies worldwide. The company was founded in 2010 and is based in Voula, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Voula"
    },
    "TOPS": {
        "short_name": "TOP Ships Inc.",
        "long_name": "Top Ships Inc.",
        "summary": "Top Ships Inc. owns and operates tanker vessels worldwide. The company's medium range tanker vessels transport crude oil, petroleum products, and bulk liquid chemicals. As of December 31, 2019, it had a fleet with a total capacity of 714,000 deadweight tonnes (dwt) consisting of eight 50,000 dwt product/chemical tankers, such as the M/T Stenaweco Energy, M/T Stenaweco Evolution, M/T Nord Valiant, M/T Stenaweco Excellence, the M/T Eco California, the M/T Eco Marina Del Ray, The M/T Eco Los Angeles, and the M/T Eco City of Angels; and two 157,000 dwt Suezmax tankers, including the M/T Eco Bel Air and M/T Eco Beverly Hills. The company was formerly known as Top Tankers Inc. and changed its name to Top Ships Inc. in December 2007. Top Ships Inc. was founded in 2000 and is based in Maroussi, Greece.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "TQZA.SG": {
        "short_name": "Technical Olympic S.A. Namens-A",
        "long_name": "Technical Olympic S.A.",
        "summary": "Technical Olympic S.A. engages in the construction, marina management, and other businesses in Greece and internationally. Technical Olympic S.A. was founded in 1965 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "UERX.F": {
        "short_name": "TOP SHIPS  DL-,01",
        "long_name": "Top Ships Inc.",
        "summary": "Top Ships Inc. owns and operates tanker vessels worldwide. The company's medium range tanker vessels transport crude oil, petroleum products, and bulk liquid chemicals. As of December 31, 2019, it had a fleet with a total capacity of 714,000 deadweight tonnes (dwt) consisting of eight 50,000 dwt product/chemical tankers, such as the M/T Stenaweco Energy, M/T Stenaweco Evolution, M/T Nord Valiant, M/T Stenaweco Excellence, the M/T Eco California, the M/T Eco Marina Del Ray, The M/T Eco Los Angeles, and the M/T Eco City of Angels; and two 157,000 dwt Suezmax tankers, including the M/T Eco Bel Air and M/T Eco Beverly Hills. The company was formerly known as Top Tankers Inc. and changed its name to Top Ships Inc. in December 2007. Top Ships Inc. was founded in 2000 and is based in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "city": "Marousi"
    }
}