{
    "1GT.F": {
        "short_name": "GEK TERNA S.A.  EO 0,57",
        "long_name": "GEK TERNA Holdings, Real Estate, Construction S.A.",
        "summary": "GEK TERNA Holdings, Real Estate, Construction S.A., together with its subsidiaries, engages in the construction, energy, real estate, industrial, and concession businesses in Greece, the Balkans, the Middle East, Eastern Europe, the United States, and internationally. The company is involved in the construction of motorways, buildings, ports, and large energy projects; the financing, management, and commercial exploitation of concession projects, such as operation of car parking. It also constructs and operates wind farms, hydroelectric projects, pumping storage projects, hybrid stations, and photovoltaics, as well as the undertaking of integrated projects for waste management, biofuels, and other materials with an installed capacity of 1,363.7 MW; and trades in electric energy and natural gas. In addition, the company engages in the acquisition, development, and exploitation of real estate properties, including business centers, logistic centers, industrial parks, entertainment parks, residential properties, commercial properties, hotels, etc.; production of quarry products; and exploitation of magnesite products. Further, it operates Borovets Euphoria Club Hotel & Spa in Bulgaria; and owns two thermal power plants with a total installed capacity of 147 MW and 435 MW in Viotia, Greece. The company was formerly known as Ermis Real Estate Constructions Enterprises S.A. and changed its name to GEK TERNA Holdings, Real Estate, Construction S.A. in 2008. The company was founded in 1960 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "115 26",
        "website": "http://www.gekterna.com",
        "market_cap": 936107840
    },
    "ELLKY": {
        "short_name": "ELLAKTOR SA",
        "long_name": "Ellaktor S.A.",
        "summary": "Ellaktor S.A., through its subsidiaries, engages in the construction and quarrying, real estate development and management, wind power, environment, and concession businesses. The company constructs bridges, motorways, metro projects, biological treatment plants, natural gas pipelines, refineries, shopping centers, casinos, tourist and hotel units, cultural centers, hospitals, airports, Olympic and athletic complexes, railway projects, tunnels, dams, port projects, energy production stations, electromechanical projects, etc.; and logistics, office, residential, industrial, and educational buildings. It is also involved in the waste management and energy production, which include design, construction, and operation of waste treatment plant, as well as offers alternative fuel production and biomass exploitation projects. In addition, the company develops, constructs, and operates wind farms; provides real estate development and services, which consists of retail parks, entertainment centers, residential complexes, exhibition centers, and offices and mixed use buildings; and provides consultancy and services to third parties. Ellaktor S.A. operates in Greece, other European countries, Gulf countries, the Americas, Africa, and Australia. The company was formerly known as ELLINIKI TECHNODOMIKI TEB SA and changed its name to Ellaktor S.A. in 2008. Ellaktor S.A. is based in Athens, Greece.  As per the transaction announced on January 8, 2021, Ellaktor S.A. operates as a subsidiary of Reggeborgh Invest B.V.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "145 64",
        "website": "http://www.ellaktor.gr",
        "market_cap": 347843200
    },
    "HLL.F": {
        "short_name": "ELLAKTOR S.A.NAM. EO 1,03",
        "long_name": "Ellaktor S.A.",
        "summary": "Ellaktor S.A., through its subsidiaries, engages in the construction and quarrying, real estate development and management, wind power, environment, and concession businesses. The company constructs bridges, motorways, metro projects, biological treatment plants, natural gas pipelines, refineries, shopping centers, casinos, tourist and hotel units, cultural centers, hospitals, airports, Olympic and athletic complexes, railway projects, tunnels, dams, port projects, energy production stations, electromechanical projects, etc.; and logistics, office, residential, industrial, and educational buildings. It is also involved in the waste management and energy production, which include design, construction, and operation of waste treatment plant, as well as offers alternative fuel production and biomass exploitation projects. In addition, the company develops, constructs, and operates wind farms; provides real estate development and services, which consists of retail parks, entertainment centers, residential complexes, exhibition centers, and offices and mixed use buildings; and provides consultancy and services to third parties. Ellaktor S.A. operates in Greece, other European countries, Gulf countries, the Americas, Africa, and Australia. The company was formerly known as ELLINIKI TECHNODOMIKI TEB SA and changed its name to Ellaktor S.A. in 2008. Ellaktor S.A. is based in Athens, Greece.  As per the transaction announced on January 8, 2021, Ellaktor S.A. operates as a subsidiary of Reggeborgh Invest B.V.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "145 64",
        "website": "http://www.ellaktor.gr",
        "market_cap": 357789280
    },
    "IJ6.SG": {
        "short_name": "Avax S.A. Namens-Aktien EO 0,30",
        "long_name": "Avax S.A.",
        "summary": "Avax S.A., together with its subsidiaries, operates as a construction company in Greece and internationally. It operates through four segments: Construction, Concessions, Energy, and Other Activities. The company constructs civil engineering projects, including airports, banks, buildings, education facilities, garages, hospitals, hotels, Olympic sports facilities, special projects, sports facilities, and other civil engineering projects. It also constructs energy and industrial projects, such as environmental plants; natural gas and petrochemical projects; and power plant projects; and infrastructure projects, such as bridges, harbors, railroads, roads, and other infrastructure projects. In addition, the company is involved in activities focusing on the residential development-urban and country/holiday homes and investing in commercial real estate; and vehicle technical inspection, and facility management services. The company was formerly known as J&P-AVAX S.A. and changed its name to Avax S.A. in April 2019. Avax S.A. was founded in 1986 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Marousi",
        "zipcode": "151 25",
        "website": "http://www.avax.gr",
        "market_cap": 154044944
    },
    "TQZA.SG": {
        "short_name": "Technical Olympic S.A. Namens-A",
        "long_name": "Technical Olympic S.A.",
        "summary": "Technical Olympic S.A. engages in the construction, marina management, and other businesses in Greece and internationally. Technical Olympic S.A. was founded in 1965 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "174 56",
        "website": "http://www.techol.gr",
        "market_cap": 69789136
    }
}