{
  "000848.SZ": {
    "city": "Chengde",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "He Bei Cheng De Lolo Company Limited",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "HE BEI CHENG DE L",
    "state": null,
    "summary": "He Bei Cheng De Lolo Company Limited provides healthy plant drinks and foods. It offers almond milk, sugar-free almond dew, walnut dew, and walnut milk under the Lulu brand name. The company was founded in 1950 and is headquartered in Chengde, China.",
    "website": "http://www.lolo.com.cn",
    "zipcode": null
  },
  "1256.TW": {
    "city": "Kunshan",
    "country": "China",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Sunjuice Holdings Co., Limited",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "SUNJUICE HOLDINGS CO LIMITED",
    "state": null,
    "summary": "Sunjuice Holdings Co., Limited engages in the production and wholesale of juices in China. The company operates through Manufacture and Sale of Fresh Juice; and Sale of Juice Dispenser Machinery. It offers concentrated juices, flavored syrups, natural-based juice drinks ingredients, etc. The company primarily sells its products to catering chain system and restaurants. Sunjuice Holdings Co., Limited was founded in 2010 and is based in Kunshan, China.",
    "website": "http://www.myfreshjuice.com/index_en.htm",
    "zipcode": "215321"
  },
  "2218.HK": {
    "city": "Yantai",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Yantai North Andre Juice Company Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "ANDRE JUICE",
    "state": null,
    "summary": "Yantai North Andre Juice Company Limited manufactures and sells various fruit and vegetable juices, fruit pulp, essence, pomace, biological feed, and related products in China, North America, Asia, Europe, Oceania, South America, and Africa. It also manufactures fruit and vegetable beverages, apple juice concentrate, pear juice concentrate, peach puree and juice, haw juice concentrate, sweet potato juice concentrate, strawberry puree and juice concentrate, bio-feedstuff, apple fructose, pear fructose, drinking water, and other products. In addition, the company manufactures iron drums for juice outer packaging; purchases agricultural and sideline products; imports and exports goods and technology; and manufactures and sells of lemon and orange juice, lemon oil and essence, and orange oil and essence. Further, it is involved in the biological comprehensive utilization of apple essence, pomace, vegetables, and other products; and import and export of juice and pulp. The company was founded in 1996 and is headquartered in Yantai, the People's Republic of China.",
    "website": "http://www.andre.com.cn",
    "zipcode": "264100"
  },
  "603156.SS": {
    "city": "Hengshui",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Hebei Yangyuan ZhiHui Beverage Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "HEBEI YANGYUAN ZHIHUI BEVERAGE ",
    "state": null,
    "summary": "Hebei Yangyuan ZhiHui Beverage Co., Ltd. engages in the research and development, processing, production, and sale of walnut milk beverages in China. The company's products include protein and compound drinks. It also sells its products online. The company was founded in 1997 and is headquartered in Hengshui, China.",
    "website": "http://www.hbyangyuan.com",
    "zipcode": null
  },
  "605388.SS": {
    "city": "Yichang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Hubei Juneyao Health Drinks Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "JUNEYAO GRAND HEALTHY DRINKS CO",
    "state": null,
    "summary": "Hubei Juneyao Health Drinks Co., Ltd engages in the research and development, production, promotion, and sale of lactic acid bacteria beverages. It offers a range of lactic acid bacteria, herbal plant, and body relaxing drinks under the weiwei, Xiaomengxing, and werdery brands. The company was founded in 1994 and is based in Yichang, China.",
    "website": "http://www.juneyaodairy.com",
    "zipcode": null
  },
  "9633.HK": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Nongfu Spring Co., Ltd.",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "NONGFU SPRING",
    "state": null,
    "summary": "Nongfu Spring Co., Ltd. produces and markets packaged drinking water and beverage products primarily in Mainland China. It operates through five segments: Water Products, Functional Drinks Products, Ready-To-Drink Tea Products, Juice Beverage Products, and Other Products. The company also offers tea and coffee drink products, functional drink products, fruit juice products, plant-based yogurts, and fresh oranges and apples, as well as supply chain management. The company was founded in 1996 and is headquartered in Hangzhou, China. Nongfu Spring Co., Ltd. is a subsidiary of Yangshengtang Co., Ltd.",
    "website": "http://www.nongfuspring.com",
    "zipcode": "310024"
  },
  "NNFSF": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Nongfu Spring Co., Ltd.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "NONGFU SPRING CO LTD",
    "state": null,
    "summary": "Nongfu Spring Co., Ltd. produces and markets packaged drinking water and beverage products primarily in Mainland China. It operates through five segments: Water Products, Functional Drinks Products, Ready-To-Drink Tea Products, Juice Beverage Products, and Other Products. The company also offers tea and coffee drink products, functional drink products, fruit juice products, plant-based yogurts, and fresh oranges and apples, as well as supply chain management. The company was founded in 1996 and is headquartered in Hangzhou, China. Nongfu Spring Co., Ltd. is a subsidiary of Yangshengtang Co., Ltd.",
    "website": "http://www.nongfuspring.com",
    "zipcode": "310024"
  },
  "UPCHY": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Beverages - Non-Alcoholic",
    "long_name": "Uni-President China Holdings Ltd",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "UNI-PRESIDENT CHINA HOLDINGS LT",
    "state": null,
    "summary": "Uni-President China Holdings Ltd., an investment holding company, manufactures, sells, and trades in beverages and instant noodles in the People's Republic of China. The company operates through Beverages, Instant Noodles, and Others segments. It offers tea drinks, juice drinks, milk tea, coffee, bottled water, soy milk, and bottle can drinks. The company also engages in the wholesale of pre-packaged food and dairy products, and forage and fertilizers, as well as manufactures and sells seasonings. In addition, it is involved in leasing, real estate, catering, and management consulting, as well as human resource management related activities. The company was incorporated in 2007 and is headquartered in Shanghai, China. Uni-President China Holdings Ltd. is a subsidiary of Cayman President Holdings Ltd.",
    "website": "http://www.uni-president.com.cn",
    "zipcode": "200335"
  }
}
