{"000523.SZ": {"short_name": "LONKEY INDUSTRIAL", "long_name": "Lonkey Industrial Co.,Ltd.Guangzhou", "summary": "Lonkey Industrial Co.,Ltd.Guangzhou manufactures and sells detergents in China. The company offers washing powders, liquid detergents, soaps, fabric and homecare cleaning products, and personal care products. It offers its products under Langqi, Gaofuli, Tianli, Renaissance, Weikeyi, Kuan'an, and Jiannengjing brands. The company was founded in 1959 and is headquartered in Guangzhou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Guangzhou"}, "002094.SZ": {"short_name": "QINGDAO KINGKING A", "long_name": "Qingdao Kingking Applied Chemistry Co., Ltd.", "summary": "Qingdao Kingking Applied Chemistry Co., Ltd. produces and sells candles and craft products. The company's products include polymer matrix composite candlelight material products, daily-use candle products, and craft glass products. It is also involved in the production and sale of cosmetics; and oil trading activities. The company was formerly known as Qingdao Jinhai Craft Products Co., Ltd. Qingdao Kingking Applied Chemistry Co., Ltd. was incorporated in 1977 and is based in Qingdao, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Qingdao"}, "002919.SZ": {"short_name": "MINGCHEN HEALTH CO", "long_name": "Mingchen Health Co.,Ltd.", "summary": "Mingchen Health Co., Ltd. engages in the research and development, production, and sale of personal health care supplies in China. It offers anti-dandruff shampoos and conditioners, and lotions. It offers its products under the Tihuaxiu, MeiWang, YiCai, High-tech Health, Green effect, and Likoujian brand names. The company was formerly known as Guangdong Ming Chen Co., Ltd. and changed its name to Mingchen Health Co., Ltd. Mingchen Health Co., Ltd was founded in 1994 and is based in Shantou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shantou"}, "003006.SZ": {"short_name": "CHONGQING BAIYA SA", "long_name": "Chongqing Baiya Sanitary Products Co., Ltd.", "summary": "Chongqing Baiya Sanitary Products Co., Ltd. Researches, develops, produces, and sells maternity and infant sanitary products and adult diapers. The company is based in Chongqing, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Chongqing"}, "1044.HK": {"short_name": "HENGAN INT'L", "long_name": "Hengan International Group Company Limited", "summary": "Hengan International Group Company Limited, an investment holding company, manufactures, distributes, and sells personal hygiene products in the People's Republic of China and internationally. The company offers pocket handkerchiefs, box and soft tissue papers, kitchen towels/papers, toilet rolls, first-aid products, enema, garbage and food bags, preservation papers, table cloths and swabbers, sanitary napkins, pantiliners, overnight pants, wet tissues, maternal and child care products, adult and baby diapers, and cleansing products. It is also involved in the trading of various products for ladies, pregnant women, infants, and kids. In addition, the company engages in the manufacturing and distribution of heat and power; and manufacturing, distribution, and sale of gas. The company was founded in 1985 and is headquartered in Jinjiang, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Jinjiang"}, "1338.HK": {"short_name": "BAWANG GROUP", "long_name": "BaWang International (Group) Holding Limited", "summary": "BaWang International (Group) Holding Limited, together with its subsidiaries, designs, manufactures, trades in, and distributes Chinese herbal products in the People's Republic of China, Hong Kong, Singapore, Thailand, and Malaysia. It operates through Hair-Care Products, Skin-Care Products, and Other Household and Personal Care Products segments. The company offers shampoo, hair-care, skin-care, household cleaning, and shower gel products, as well as laundry detergents under the Bawang, Royal Wind, Herborn, Litao, and Little King brands through distributors and retailers; and through online. It also manufactures, markets, and trades in household and personal care products. The company was is based in Guangzhou, the People's Republic of China. BaWang International (Group) Holding Limited is a subsidiary of Fortune Station Limited.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Guangzhou"}, "1925.HK": {"short_name": "KWUNGS HOLDINGS", "long_name": "Kwung's Holdings Limited", "summary": "Kwungs Holdings Limited., an investment holding company, designs, manufactures, supplies, and trades in home decoration products. It provides candles, home fragrances, and home accessories under the Fumare and Aromart brands. The company also offers wax, metal, and glass products, as well as wholesales and retails household items and handicrafts. In addition, it engages in import and export of self-manufactured or agent goods and technologies. The company sells its products through e-commerce platforms, distributors, and self-operated stores. It operates in France, the United Kingdom, the Netherlands, Germany, Canada, Australia, and the People's Republic of China. The company was incorporated in 2018 and is headquartered in Ningbo, the People's Republic of China. Kwungs Holdings Limited is a subsidiary of King Harmony Limited.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Ningbo"}, "2023.HK": {"short_name": "CHINA LUDAO", "long_name": "China Ludao Technology Company Limited", "summary": "China Ludao Technology Company Limited, an investment holding company, researches and develops, manufactures, and sells aerosol, chemical, and related products in Mainland China, the United States, Europe, Japan, Chile, and internationally. It offers aerosol products for household and auto care, air fresheners, personal care products, and insecticides. The company sells its products through a network of distributors under the Green Island, Ludao, JIERJIA, and EAGLEIN KING brand names. In addition, the company is involved in the clean energy business of collection and utilization of sewage source thermal energy. The company was formerly known as China Ludao Holdings Limited and changed its name to China Ludao Technology Company Limited in July 2012. China Ludao Technology Company Limited was founded in 2002 and is headquartered in Taizhou, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Taizhou"}, "3332.HK": {"short_name": "SINOLIFE UTD", "long_name": "Nanjing Sinolife United Company Limited", "summary": "Nanjing Sinolife United Company Limited, an investment holding company, engages in the research, development, manufacture, processing, sale, and retail of nutritional supplements and packaged health food products. The company is also involved in the trade of food products; provision of information technology maintenance services; and manufacture and sale of cosmetics and skin care products. It sells its products under the Good Health, Zhongsheng, Hejian, and Cobayer series through a network of retail stores. The company also sells its products through distributors, TV shopping, and e-commerce platforms; and chain pharmacies, health goods supermarkets, and tourist souvenir shops. It has operations in Mainland China, Australia, New Zealand, Vietnam, and internationally. Nanjing Sinolife United Company Limited was founded in 1999 and is headquartered in Nanjing, China.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Nanjing"}, "600249.SS": {"short_name": "LIUZHOU LIANGMIANZHEN CO", "long_name": "Liuzhou Liangmianzhen Co., Ltd.", "summary": "Liuzhou Liangmianzhen Co., Ltd. produces and sells oral care products in China, Hong Kong, Macau, North America, Western Europe, South Asia, and Africa. It offers toothpastes under the LMZ Herbal and Fangcao brand names; and toothbrushes and mouthwashes. The company also provides body care and facial care products; sanitary towels and papers; sucralose sweeteners; medical products comprising bulk drugs, tablets, capsules, and granules; and clothes cleaning, pesticide residue degrading, and dishwashing liquid products. In addition, it offers travel packages and kits; and develops real estate properties. The company was founded in 1941 and is headquartered in Liuzhou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Liuzhou"}, "600315.SS": {"short_name": "SHANGHAI JAHWA UNITED CO. LTD.", "long_name": "Shanghai Jahwa United Co., Ltd.", "summary": "Shanghai Jahwa United Co., Ltd. produces and sells skin care, personal care, and home care products primarily in the People's Republic of China. The company offers fragrance skin care products, make-ups, perfumes, hair waxes, mousses, hand creams, floral water, body and hand wash products, products for babies, soaps, powders, summer portable products, shampoos, household cleaning products, and baby feeding accessories; facial skin care, facial cleaning, body care, and infant care products; and dermatologist solutions. It provides its products under the VIVE, Maxam, Liushen, GF, Herborist, HomeAegis, Dr. Yu, GIVING, Fresh Herb, and Tommee Tippee brands. The company also operates e-commerce channels and cosmetics specialty stores. It also sells its products in department stores and supermarkets. The company was formerly known as HK Kwong Sang Hong and changed its name to Shanghai Jahwa United Co., Ltd. Shanghai Jahwa United Co., Ltd. was founded in 1898 and is headquartered in Shanghai, the People's Republic of China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "600439.SS": {"short_name": "HENAN REBECCA HAIR PRODUCTS CO", "long_name": "Henan Rebecca Hair Products Co., Ltd.", "summary": "Henan Rebecca Hair Products Co., Ltd. engages in the research, development, production, and sale of hair products and hair fiber raw materials. It offers human hair weaving products, synthetic hair weaving products, mannequins, toupees, and wigs under the Rebecca, Sleek, JOEDIR, BLACK PEARL, STYLE ICON, NOBLE, MAGIC, and FASHION IDOL brands. The company sells its products through approximately 200 stores in China. It serves customers in approximately 40 countries in North America, Western Europe, Asia, and Africa. The company was founded in 1990 and is based in Xuchang, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Xuchang"}, "603605.SS": {"short_name": "PROYA COSMETICS CO LTD", "long_name": "Proya Cosmetics Co.,Ltd.", "summary": "Proya Cosmetics Co.,Ltd. manufactures and sells skin care products in China and rest of Asia. It offers its products under the PROYA, UZERO, ANYA, YOYA, and CATS & ROSES brands. The company markets its products through a distribution network covering department stores, cosmetic boutiques, supermarket chains, and electronic business platforms in approximately 30 cities in China. Proya Cosmetics Co.,Ltd. is based in Hangzhou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "603630.SS": {"short_name": "LAFANG CHINA CO LTD", "long_name": "Lafang China Co.,Ltd", "summary": "Lafang China Co.,Ltd engages in the research and development of personal care products in China. It provides hair care, cleansing, skin care, and oral care products under the Lafang, Medoc, Yujie, Shengfeng, and various other brands. The company was formerly known as Guangdong Lafang Rihua Co., Ltd. Lafang China Co.,Ltd was founded in 2001 and is based in Shantou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shantou"}, "603868.SS": {"short_name": "SHANGHAI FLYCO ELECTRICAL APPLI", "long_name": "Shanghai Flyco Electrical Appliance Co., Ltd.", "summary": "Shanghai Flyco Electrical Appliance Co., Ltd. engages in the research, development, manufacture, and sales of personal care electrical appliances in China and internationally. Its products include shavers, hair driers, hair clippers, hair straighteners, hair curlers, electric irons, garment steamers, lint removers, lady shavers, nose hair trimmers, and robot vacuum cleaners. The company was founded in 1999 and is based in Shanghai, China. Shanghai Flyco Electrical Appliance Co., Ltd. is a subsidiary of Shanghai Feike Investment Co., Ltd.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "603983.SS": {"short_name": "GUANGDONG MARUBI BIOTECHNOLOGY ", "long_name": "Guangdong Marubi Biotechnology Co., Ltd.", "summary": "Guangdong Marubi Biotechnology Co., Ltd. provides eye care product under the Maru brand in China. It offers eye cream and facial series products through e-commerce platform. The company is based in Guangzhou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Guangzhou"}, "605009.SS": {"short_name": "HANGZHOU HAOYUE PERSONAL CARE C", "long_name": "Hangzhou Haoyue Personal Care Co., Ltd", "summary": "Hangzhou Haoyue Personal Care Co., Ltd. manufactures and sells health care products under the haoyue name. It produces baby step pants, paper diapers, paper diapers, wet towels, adult Lala pants, diapers, paper diapers, nursing mats, wet towels, female sanitary napkins, menstrual care pants, maternity and baby dual-use napkins, parturient towel, etc. The company was founded in 1992 and is headquartered in Hangzhou, China.", "currency": "CNY", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "6993.HK": {"short_name": "BLUE MOON GROUP", "long_name": "Blue Moon Group Holdings Limited", "summary": "Blue Moon Group Holdings Limited, a consumer-centric household care company, develops, manufactures, and markets fabric care, personal hygiene, and home care products in China. The company offers fabric care products, including liquid laundry detergents, bleaches and disinfectant sanitizers, and strain removers, as well as laundry aids, such as fabric softeners and collar cleaners; and personal hygiene products comprising specialized liquid soaps, children's liquid soaps, and amino acid moisturizing liquid soaps. It also provides home care products, including kitchen cleaners, dish detergents, toilet and bathroom cleaners, multi-surface cleaners, and disinfectant liquids. The company offers its products under the Blue Moon, Volo, Supreme, Jingxiang, and Tianlu brands. It serves distributors and direct sales clients, including e-commerce platforms, offline distributors, and hypermarkets and supermarkets. Blue Moon Group Holdings Limited was founded in 1992 and is headquartered in Guangzhou, China. Blue Moon Group Holdings Limited is a subsidiary of Aswann Ventures Limited.", "currency": "HKD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Guangzhou"}, "6BK.MU": {"short_name": "BAWANG INT.G.H.REGS HD-10", "long_name": "BaWang International (Group) Holding Limited", "summary": "BaWang International (Group) Holding Limited, together with its subsidiaries, designs, manufactures, trades in, and distributes Chinese herbal products in the People's Republic of China, Hong Kong, Singapore, Thailand, and Malaysia. It operates through Hair-Care Products, Skin-Care Products, and Other Household and Personal Care Products segments. The company offers shampoo, hair-care, skin-care, household cleaning, and shower gel products, as well as laundry detergents under the Bawang, Royal Wind, Herborn, Litao, and Little King brands through distributors and retailers; and through online. It also manufactures, markets, and trades in household and personal care products. The company was is based in Guangzhou, the People's Republic of China. BaWang International (Group) Holding Limited is a subsidiary of Fortune Station Limited.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "MUN", "market": "dr_market", "country": "China", "city": "Guangzhou"}, "BEUT": {"short_name": "SCIENCE TO CONSUMERS INC", "long_name": "Science to Consumers, Inc.", "summary": "Science to Consumers, Inc., a development stage company, focuses on marketing and selling formulated anti-aging cream products under the DermaLastyl name; and distributing Argan oil products. It intends to sell its products to individual customers and commercial customers, such as spas, stores, and massage therapy offices. The company was formerly known as Argan Beauty Corporation and changed its name to Science to Consumers, Inc. in December 2014. Science to Consumers, Inc. was founded in 2013 and is based in Guangzhou, China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Guangzhou"}, "CDSG": {"short_name": "CHINA DONGSHENG INTERNATIONAL I", "long_name": "China Dongsheng International, Inc.", "summary": "China Dongsheng International, Inc. develops and manufactures nutritional supplements and personal care products in the People's Republic of China. The company offers Aidong Nutritionals, which include supplements and healthcare products with Chitosan as an ingredient; Jiujiu Ozone Purifiers, a line of portable home ozone air, water, and food purifiers; Nao Li Zhi Bao herbal extracts, a Chinese herbal supplement line of natural botanical extracts; and Donghe Cosmetics, a line of skin care products. China Dongsheng International sells its products through approximately 200,000 independent distributors, 2,500 retail stores, and e-commerce outlets over the Internet. The company was founded in 2002 and is based in Jilin City, the People's Republic of China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Jilin City"}, "DOGZ": {"short_name": "Dogness (International) Corpora", "long_name": "Dogness (International) Corporation", "summary": "Dogness (International) Corporation, through its subsidiaries, designs, manufactures, and sells fashionable products for dogs and cats worldwide. It provides pet leashes, pet collars, pet harnesses, and retractable dog leashes, as well as lanyards; dog comfort wrap harnesses, pet muzzles, metal chain traffic leashes, pet belt and ropes, and other miscellaneous products; mouth covers and pet charms; gift suspenders, including various ribbons and belts for use in the badges, name tags, and gift bags; and intelligent pet products, such as APP-controlled pet feeders, pet water fountains, and smart pet toys, as well as climbing hooks and pet shampoos. The company offers its products to wholesalers and retailers. Dogness (International) Corporation was founded in 2003 and is headquartered in Dongguan, the People's Republic of China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Dongguan"}, "GTVI": {"short_name": "JOWAY HEALTH INDUSTRIES GROUP I", "long_name": "Joway Health Industries Group Inc.", "summary": "Joway Health Industries Group Inc., through its subsidiaries, manufactures, distributes, and sells tourmaline-related healthcare products. The company operates in three segments: Healthcare Knit Goods, Daily Healthcare and Personal Care Products, and Wellness House and Activated Water Machine Products. It offers healthcare knit goods, including tourmaline treated mattresses, bed linen, underwear, pillows, and shirts; daily healthcare and personal care products, such as tourmaline-treated waist protectors, knee protectors, scarves, shampoo and soap products, toothpaste, and fish oil soft gel; and wellness house and activated water machine products comprising tourmaline wellness houses, foot sauna buckets, and tourmaline activated water machines and drinking mugs. The company markets and sells its products through a network of franchise stores. As of December 31, 2019, it had approximately 82 franchise stores. The company was formerly known as G2 Ventures, Inc. The company was founded in 2003 and is based in Tianjin, the People's Republic of China. Joway Health Industries Group Inc. is a subsidiary of Crystal Globe Limited.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Tianjin"}, "HEGIF": {"short_name": "HENGAN INTERNATIONAL", "long_name": "Hengan International Group Company Limited", "summary": "Hengan International Group Company Limited, an investment holding company, manufactures, distributes, and sells personal hygiene products in the People's Republic of China and internationally. The company offers pocket handkerchiefs, box and soft tissue papers, kitchen towels/papers, toilet rolls, first-aid products, enema, garbage and food bags, preservation papers, table cloths and swabbers, sanitary napkins, pantiliners, overnight pants, wet tissues, maternal and child care products, adult and baby diapers, and cleansing products. It is also involved in the trading of various products for ladies, pregnant women, infants, and kids. In addition, the company engages in the manufacturing and distribution of heat and power; and manufacturing, distribution, and sale of gas. The company was founded in 1985 and is headquartered in Jinjiang, the People's Republic of China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Jinjiang"}, "HEGIY": {"short_name": "HENGAN INTERNATIONAL", "long_name": "Hengan International Group Company Limited", "summary": "Hengan International Group Company Limited, an investment holding company, manufactures, distributes, and sells personal hygiene products in the People's Republic of China and internationally. The company offers pocket handkerchiefs, box and soft tissue papers, kitchen towels/papers, toilet rolls, first-aid products, enema, garbage and food bags, preservation papers, table cloths and swabbers, sanitary napkins, pantiliners, overnight pants, wet tissues, maternal and child care products, adult and baby diapers, and cleansing products. It is also involved in the trading of various products for ladies, pregnant women, infants, and kids. In addition, the company engages in the manufacturing and distribution of heat and power; and manufacturing, distribution, and sale of gas. The company was founded in 1985 and is headquartered in Jinjiang, the People's Republic of China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Jinjiang"}, "HGNC.F": {"short_name": "HENGAN INTL GRP  HD-,10", "long_name": "Hengan International Group Company Limited", "summary": "Hengan International Group Company Limited, an investment holding company, manufactures, distributes, and sells personal hygiene products in the People's Republic of China and internationally. The company offers pocket handkerchiefs, box and soft tissue papers, kitchen towels/papers, toilet rolls, first-aid products, enema, garbage and food bags, preservation papers, table cloths and swabbers, sanitary napkins, pantiliners, overnight pants, wet tissues, maternal and child care products, adult and baby diapers, and cleansing products. It is also involved in the trading of various products for ladies, pregnant women, infants, and kids. In addition, the company engages in the manufacturing and distribution of heat and power; and manufacturing, distribution, and sale of gas. The company was founded in 1985 and is headquartered in Jinjiang, the People's Republic of China.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Jinjiang"}, "NUVI": {"short_name": "EMO CAPITAL CORP", "long_name": "Emo Capital Corp.", "summary": "Emo Capital Corp., a development stage company, focuses on promoting and distributing health and beauty care products through the Internet. The company develops a formulation in tablet form for the male enhancement industry. It intends to serve individual consumers located in the United States and Canada. Emo Capital Corp. was founded in 2006 and is headquartered in Shanghai, China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Shanghai"}, "SGTI": {"short_name": "SHENGTAI PHARMACEUTICAL INC", "long_name": "Shengtai Pharmaceutical, Inc.", "summary": "Shengtai Pharmaceutical, Inc., through its subsidiaries, engages in the manufacture and distribution of glucose and starch products in the People's Republic of China and internationally. The company provides pharmaceutical and medical grade products, including dextrose monohydrate, dextrose anhydrous, dextrin, and pharmaceutical grade cornstarch; and rough glucose, dextrose monohydrate oral, and food and beverage grade cornstarch for the food and beverage, and processing industries. It also offers other products comprising fibers, corn embryo, protein powder, mother liquid, and abamectin ointment. The company markets its products directly to healthcare institutions, medical supply companies, pharmaceutical companies, medical supply exporters, and food and beverage companies. Shengtai Pharmaceutical, Inc. was incorporated in 2004 and is based in Weifang, China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Weifang"}, "TANH": {"short_name": "Tantech Holdings Ltd.", "long_name": "Tantech Holdings Ltd", "summary": "Tantech Holdings Ltd. develops and manufactures bamboo-based charcoal products for industrial energy, household cooking, heating, purification, agricultural, and cleaning applications in the People's Republic of China and internationally. The company operates in three segments: Consumer Products, Trading, and Electric Vehicle. It provides pressed and formed charcoal briquettes for use in grills, incense burners, and other applications under the Algold brand. The company also offers Charcoal Doctor branded products, such as air purifiers and humidifiers, automotive accessories for air purification, underfloor humidity control products, pillows and mattresses, wardrobe deodorizers, mouse pads and wrist mats, refrigerator deodorants, charcoal toilet cleaner disks, liquid charcoal cleaners, shoe insoles, and decorative charcoal gifts. In addition, it provides bamboo vinegar, a liquid byproduct for use in disinfectants, detergents, lotions, specialized soaps, toilet cleaners, and fertilizers, as well as in various agricultural applications; and trades in charcoal products. Further, the company develops, manufactures, and sells electric buses and specialty electric vehicles, such as electric logistics cars, brushless cleaning cars, electric cleaning cars, special emergency vehicles, and funeral cars; and solar cells, lithium-ion batteries, auto parts, and electric control systems. Tantech Holdings Ltd. was founded in 2001 and is headquartered in Lishui, the People's Republic of China.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Household & Personal Products", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Lishui"}}