{
    "2LS.F": {
        "short_name": "SILOAM INTL HOSPIT. RP100",
        "long_name": "PT Siloam International Hospitals Tbk",
        "summary": "PT Siloam International Hospitals Tbk, together with its subsidiaries, provides healthcare services in Indonesia. It also engages in setting up and managing hospitals. The company offers specialist and general medical services, including complex surgical procedures, laboratory services, radiology and imaging services, fertility treatment, diagnostic, and emergency services. Its hospitals provide services in the therapeutic areas of orthopedics, neurosciences, oncology, cardiology, urology, pediatrics, otolaryngology, ophthalmology, nephrology, pulmonology/respiratory, gastroenterology, and obstetrics and gynecology. As of December 31, 2019, the company operated 37 hospitals with 7,682 beds in Sumatra, Java, Bali, Kalimantan, Sulawesi, and Nusa Tenggara. In addition, it engages in trading, development, mining, agriculture, service, land transportation, pharmacy, workshop and industrial printing, plantation, forestry, electrical, mechanical, engineering, construction, agribusiness, and real estate businesses. The company was formerly known as PT Sentralindo Wirasta. PT Siloam International Hospitals Tbk was founded in 1996 and is headquartered in Tangerang, Indonesia. PT Siloam International Hospitals Tbk is a subsidiary of PT Megapratama Karya Persada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "DGNS.JK": {
        "short_name": "Diagnos Laboratorium Utama Tbk.",
        "long_name": "PT Diagnos Laboratorium Utama Tbk",
        "summary": "PT Diagnos Laboratorium Utama Tbk provides health services using laboratories. It offers clinical and genomics laboratory, inspection package, homecare diagnosis, SARS-COV-2 examination package, and examination panel services. The company was founded in 2007 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Central Jakarta"
    },
    "DVLA.JK": {
        "short_name": "Darya-Varia Laboratoria Tbk.",
        "long_name": "PT Darya-Varia Laboratoria Tbk",
        "summary": "PT Darya-Varia Laboratoria Tbk engages in the manufacture and trading of pharmaceutical products and cosmetics in Indonesia and internationally. It operates in three segments: Prescription Drugs, Consumer Health Products, and Export and Toll Manufacturing Services. It provides various prescription and consumer health products in antibiotic, antiparasit, antiseptic, anti-fungal, cough and cold, cardiology, central nervous system, gastro-hepatology, somatic, vitamin and food supplement, women healthcare, ear healthcare, and derma medic areas. The company was founded in 1976 and is headquartered in Jakarta, Indonesia. PT Darya-Varia Laboratoria Tbk is a subsidiary of Blue Sphere Singapore Pte. Ltd.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "EPMT.JK": {
        "short_name": "Enseval Putera Megatrading Tbk.",
        "long_name": "PT Enseval Putera Megatrading Tbk",
        "summary": "PT Enseval Putera Megatrading Tbk, together with its subsidiaries, engages in the distribution and supply of pharmaceutical products in Indonesia. The company operates in three segments: Pharmaceutical, Consumer Products, and Others. It also distributes medical and laboratory equipment and supplies; and provides health care clinical services. In addition, the company engages in the trading of raw materials for pharmaceutical products; and consumable products for hemodialysis therapy. Further, it offers warehouse facilities, including chiller, cool, and ambient rooms, as well as container chiller as facilities. The company was formerly known as PT Arya Gupta Cempaka and changed its name to PT Enseval Putera Megatrading Tbk in August 1993. The company was founded in 1973 and is headquartered in East Jakarta, Indonesia. PT Enseval Putera Megatrading Tbk is a subsidiary of PT Kalbe Farma Tbk.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "FEK.SG": {
        "short_name": "Enseval Putera Megatrading, PTR",
        "long_name": "PT Enseval Putera Megatrading Tbk",
        "summary": "PT Enseval Putera Megatrading Tbk, together with its subsidiaries, engages in the distribution and supply of pharmaceutical products in Indonesia. The company operates in three segments: Pharmaceutical, Consumer Products, and Others. It also distributes medical and laboratory equipment and supplies; and provides health care clinical services. In addition, the company engages in the trading of raw materials for pharmaceutical products; and consumable products for hemodialysis therapy. Further, it offers warehouse facilities, including chiller, cool, and ambient rooms, as well as container chiller as facilities. The company was formerly known as PT Arya Gupta Cempaka and changed its name to PT Enseval Putera Megatrading Tbk in August 1993. The company was founded in 1973 and is headquartered in East Jakarta, Indonesia. PT Enseval Putera Megatrading Tbk is a subsidiary of PT Kalbe Farma Tbk.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "HEAL.JK": {
        "short_name": "Medikaloka Hermina Tbk.",
        "long_name": "PT Medikaloka Hermina Tbk",
        "summary": "PT Medikaloka Hermina Tbk operates a network of general hospitals in Indonesia. As of March 31, 2020, it operated 37 hospitals comprising 8 type B hospitals and 29 type C hospitals. The company was founded in 1999 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "HQP.SG": {
        "short_name": "KIMIA FARMA TBK",
        "long_name": "PT Kimia Farma (Persero) Tbk",
        "summary": "PT Kimia Farma (Persero) Tbk produces and sells medicines, herbal medicines, iodine, salts, quinine and their derivative products, and vegetable oils in Indonesia, rest of Asia, Europe, Australia, Africa, and New Zealand. The company operates through Manufacture, Distribution, Retail, and Other Services segments. It also manufactures and markets chemical, betalactam and non betalactam, antiretroviral, narcotic, hormone contraceptive, powder, oil castor, edible oil, cosmetic, over the counter, personal, and beauty care products, as well as food supplements, active pharmaceutical ingredients, and medical devices. In addition, the company manufactures, markets, distributes, and trades in pharmaceutical products; and operates drug materials plants. As of December 31, 2019, it operated 1,279 retail pharmacy outlets under the Kimia Farma Pharmacy brand, 565 health clinic outlets, 64 clinical laboratories, 10 optics, and 3 beauty clinics. The company sells its products to pharmacies, drug stores, hospitals, and free traders through pharmaceutical wholesalers and logistics warehouses. The company was founded in 1817 and is headquartered in Jakarta, Indonesia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "IGEX": {
        "short_name": "INDO GLOBAL EXCHANGES PTE LTD",
        "long_name": "Indo Global Exchange(s) PTE, Ltd.",
        "summary": "Indo Global Exchange(s) Pte, Ltd. focuses on providing financial market access to customers worldwide. Its platform provides financial market access to approximately 30 equity exchanges for trading in securities and contract for differences. The company is based in Jakarta, Indonesia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "INAF.JK": {
        "short_name": "Indofarma Tbk.",
        "long_name": "PT Indofarma (Persero) Tbk",
        "summary": "PT Indofarma (Persero) Tbk, together with its subsidiaries, manufactures and markets pharmaceutical products in Indonesia. It manufactures, trades in, and distributes medicine and medical devices; and operates laboratory. The company also exports its products. PT Indofarma (Persero) Tbk was founded in 1918 and is headquartered in Bekasi, Indonesia. PT Indofarma (Persero) Tbk is a subsidiary of PT. Bio Farma.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "IRRA.JK": {
        "short_name": "Itama Ranoraya Tbk.",
        "long_name": "PT Itama Ranoraya Tbk",
        "summary": "PT Itama Ranoraya Tbk distributes medical devices in Indonesia. The company offers Oneject auto disable syringe products, Abbott diagnostics products, Terumo BCT products, Ortho-clinical diagnostics, etc. It is also involved in building and office space rental business. The company was founded in 1989 and is headquartered in East Jakarta, Indonesia. PT Itama Ranoraya Tbk is a subsidiary of PT Global Dinamika Kencana.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "East Jakarta"
    },
    "KAEF.JK": {
        "short_name": "Kimia Farma Tbk.",
        "long_name": "PT Kimia Farma (Persero) Tbk",
        "summary": "PT Kimia Farma (Persero) Tbk produces and sells medicines, herbal medicines, iodine, salts, quinine and their derivative products, and vegetable oils in Indonesia, rest of Asia, Europe, Australia, Africa, and New Zealand. The company operates through Manufacture, Distribution, Retail, and Other Services segments. It also manufactures and markets chemical, betalactam and non betalactam, antiretroviral, narcotic, hormone contraceptive, powder, oil castor, edible oil, cosmetic, over the counter, personal, and beauty care products, as well as food supplements, active pharmaceutical ingredients, and medical devices. In addition, the company manufactures, markets, distributes, and trades in pharmaceutical products; and operates drug materials plants. As of December 31, 2019, it operated 1,279 retail pharmacy outlets under the Kimia Farma Pharmacy brand, 565 health clinic outlets, 64 clinical laboratories, 10 optics, and 3 beauty clinics. The company sells its products to pharmacies, drug stores, hospitals, and free traders through pharmaceutical wholesalers and logistics warehouses. The company was founded in 1817 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "KLBF.JK": {
        "short_name": "Kalbe Farma Tbk.",
        "long_name": "PT Kalbe Farma Tbk.",
        "summary": "PT Kalbe Farma Tbk., together with its subsidiaries, develops, manufactures, and trades in pharmaceutical products in Indonesia. It operates in four division: Prescription Pharmaceutical, Consumer Health, Nutritionals, and Distribution and Logistic. The company offers generic, branded, and licensed drugs, including Brainact, Cefspan, Mycoral, Cernevit, Cravit, Neuralgin, Broadced, Neurotam, Hemapo, and CPG that are distributed to hospitals, pharmacies, and drug stores. It also provides over-the-counter drugs; energy drinks, ready-to-drink products, supplements, and other preventive products; and nutritional products for infants, toddlers, children, pre-teenagers, adults, pregnant and lactating women, and elders, as well as for consumers with special medical needs. In addition, the company operates Mitrasana Clinics, a health care service; contract services, including clinical study management, bioavailability/bioequivalence studies, and contract analysis to pharmaceutical companies; and animal health products. Further, it offers health screening services; operates as an agent and representative for biotechnology products; distributes consumer products, medical equipment, cosmetics, and other trading products; and trades in medical and laboratory equipment and supplies, raw materials for pharmaceutical products, and consumable products for hemodialysis therapy, as well as provides advertising services. The company was founded in 1966 and is headquartered in Jakarta, Indonesia. PT Kalbe Farma Tbk. is a subsidiary of PT Gira Sole Prima.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "MERK.JK": {
        "short_name": "Merck Tbk.",
        "long_name": "PT Merck Tbk",
        "summary": "PT Merck Tbk manufactures and sells pharmaceutical products in Indonesia. It operates through three segments: Biopharma, Consumer Health, and Others. The company operates in the healthcare, life science, and performance materials sectors. It offers health care products in the areas of allergies, endocrinology, fertility, general medicine, neuro degenerative diseases, and oncology. The company also engages in discovery, development, manufacturing, and diagnostics of drugs. In addition, it offers liquid crystals and OLED materials for displays, materials for integrated circuits, pigments for coatings or colour cosmetics, and functional materials for energy solutions. The company was formerly known as PT Merck Indonesia Tbk and changed its name to PT Merck Tbk in June 2002. The company was founded in 1970 and is headquartered in East Jakarta, Indonesia. PT Merck Tbk is a subsidiary of Merck Holding GmbH.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Timur"
    },
    "MIKA.JK": {
        "short_name": "Mitra Keluarga Karyasehat Tbk.",
        "long_name": "PT Mitra Keluarga Karyasehat Tbk",
        "summary": "PT Mitra Keluarga Karyasehat Tbk, together with its subsidiaries, owns and operates hospitals in Indonesia. The company provides healthcare services; and operates a pharmacy. Its hospital network comprises of 16 Mitra Keluarga hospitals and 8 other hospitals located in Jakarta, Bekasi, Cikarang, Depok, Cibubur, Tangerang, Sukabumi, Karawang, Cirebon, Surabaya, Cibinong, Subang, and Tegal. The company was founded in 1995 and is headquartered in Bekasi, Indonesia. PT Mitra Keluarga Karyasehat Tbk is a subsidiary of PT Griyainsani Cakrasadaya.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Bekasi"
    },
    "PEHA.JK": {
        "short_name": "Phapros Tbk.",
        "long_name": "PT Phapros, Tbk",
        "summary": "PT Phapros, Tbk operates in the pharmaceutical and health care industry in Indonesia. The company operates through Over the Counter (OTC), Ethical, Generic Drugs Bearing, and Toll Manufacturing segments. It offers OTC drugs, including Antimo Anak, Livron B Plek, Noza, Hemorogard, Bioron, and others. The company also provides generic drug products for government institutions and hospitals, as well as produces drugs for other pharmaceutical industries; and offers medical devices. PT Phapros, Tbk also exports its products internationally. The company was founded in 1954 and is headquartered in Jakarta, Indonesia. PT Phapros, Tbk operates as a subsidiary of PT Kimia Farma (Persero) Tbk.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PEXXF": {
        "short_name": "TEMPO SCAN PACIFIC",
        "long_name": "PT Tempo Scan Pacific Tbk",
        "summary": "PT Tempo Scan Pacific Tbk engages in the pharmaceuticals, personal care and cosmetics, and distribution services businesses in Indonesia and internationally. It operates through three segments: Pharmaceuticals, Consumer Products and Cosmetics, and Distribution Services. The company is involved in the construction and rental of buildings; provision of warehousing, freight forwarding, advertising and promotion, research and development, computer systems, and distribution and marketing services; medical devices trading; and manufacture of food supplements, food and beverages, and plastic packaging, as well as consumer products, soaps, and household products. It sells its products under Bodrex, Vidoran, Hemaviton, Oskadon, Bodrexin, Neo rheumacyl, Oskadryl, Contrexyn, Zevit Grow, Wybert, Vitonal, Polaris, and Vitamin IPI brands. The company was formerly known as PT Scanchemie. PT Tempo Scan Pacific Tbk was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Tempo Scan Pacific Tbk is a subsidiary of PT Bogamulia Nagadi.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PRDA.JK": {
        "short_name": "Prodia Widyahusada Tbk.",
        "long_name": "PT Prodia Widyahusada Tbk",
        "summary": "PT Prodia Widyahusada Tbk provides private clinical laboratory services. The company offers laboratory and panel test services; and other diagnostics support services. It operates through a network of 151 branches and outlets in Indonesia. The company was founded in 1973 and is headquartered in Jakarta Pusat, Indonesia. PT Prodia Widyahusada Tbk is a subsidiary of PT Prodia Utama.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta Pusat"
    },
    "PTKFF": {
        "short_name": "KALBE FARMA",
        "long_name": "PT Kalbe Farma Tbk.",
        "summary": "PT Kalbe Farma Tbk., together with its subsidiaries, develops, manufactures, and trades in pharmaceutical products in Indonesia. It operates in four division: Prescription Pharmaceutical, Consumer Health, Nutritionals, and Distribution and Logistic. The company offers generic, branded, and licensed drugs, including Brainact, Cefspan, Mycoral, Cernevit, Cravit, Neuralgin, Broadced, Neurotam, Hemapo, and CPG that are distributed to hospitals, pharmacies, and drug stores. It also provides over-the-counter drugs; energy drinks, ready-to-drink products, supplements, and other preventive products; and nutritional products for infants, toddlers, children, pre-teenagers, adults, pregnant and lactating women, and elders, as well as for consumers with special medical needs. In addition, the company operates Mitrasana Clinics, a health care service; contract services, including clinical study management, bioavailability/bioequivalence studies, and contract analysis to pharmaceutical companies; and animal health products. Further, it offers health screening services; operates as an agent and representative for biotechnology products; distributes consumer products, medical equipment, cosmetics, and other trading products; and trades in medical and laboratory equipment and supplies, raw materials for pharmaceutical products, and consumable products for hemodialysis therapy, as well as provides advertising services. The company was founded in 1966 and is headquartered in Jakarta, Indonesia. PT Kalbe Farma Tbk. is a subsidiary of PT Gira Sole Prima.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PTKFY": {
        "short_name": "KALBE FARMA",
        "long_name": "PT Kalbe Farma Tbk.",
        "summary": "PT Kalbe Farma Tbk., together with its subsidiaries, develops, manufactures, and trades in pharmaceutical products in Indonesia. It operates in four division: Prescription Pharmaceutical, Consumer Health, Nutritionals, and Distribution and Logistic. The company offers generic, branded, and licensed drugs, including Brainact, Cefspan, Mycoral, Cernevit, Cravit, Neuralgin, Broadced, Neurotam, Hemapo, and CPG that are distributed to hospitals, pharmacies, and drug stores. It also provides over-the-counter drugs; energy drinks, ready-to-drink products, supplements, and other preventive products; and nutritional products for infants, toddlers, children, pre-teenagers, adults, pregnant and lactating women, and elders, as well as for consumers with special medical needs. In addition, the company operates Mitrasana Clinics, a health care service; contract services, including clinical study management, bioavailability/bioequivalence studies, and contract analysis to pharmaceutical companies; and animal health products. Further, it offers health screening services; operates as an agent and representative for biotechnology products; distributes consumer products, medical equipment, cosmetics, and other trading products; and trades in medical and laboratory equipment and supplies, raw materials for pharmaceutical products, and consumable products for hemodialysis therapy, as well as provides advertising services. The company was founded in 1966 and is headquartered in Jakarta, Indonesia. PT Kalbe Farma Tbk. is a subsidiary of PT Gira Sole Prima.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—General",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PYFA.JK": {
        "short_name": "Pyridam Farma Tbk",
        "long_name": "PT Pyridam Farma Tbk",
        "summary": "PT Pyridam Farma Tbk develops, produces, and sells pharmaceuticals, vitamins, supplements, and traditional herbal care products in Indonesia. The company operates in two segments, Pharmaceutical Products and Toll Manufacturing Services, and Medical Equipments. It offers analgesic, antipiretic, anti anemic, anti fungal, anti hypertension, anti parkinsonism, anti rheumatics, anti inflammatory, anti tuberculotic, anti ulcerant and antasida, antibiotic, anticoagulant, anti platelet, fibrinolytic, anticonvulsant, antihistamine, antipsychotic, calcium w/vitamin, central muscle relaxant, cholesterol lowering, and cough and cold remedy products. The company also provides genito-urinary system, eye preparation, hematology, hepatoprotector, immunomodulator, multivitamin and mineral, neurological, nootropic and neurotonic, oral antidiabetics and corticosteroid, peripheral vasodilator and cerebral activator, supplement and adjuvant therapy, anti infective, anti virus, beta-adrenergic agonist bronchodilator, diuretic, hyperuricemia, and gout products, as well as antiemetic and GIT regulators. In addition, it trades in medical equipment. The company was founded in 1976 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "PYZA.SG": {
        "short_name": "PT Tempo Scan Pacific Registere",
        "long_name": "PT Tempo Scan Pacific Tbk",
        "summary": "PT Tempo Scan Pacific Tbk engages in the pharmaceuticals, personal care and cosmetics, and distribution services businesses in Indonesia and internationally. It operates through three segments: Pharmaceuticals, Consumer Products and Cosmetics, and Distribution Services. The company is involved in the construction and rental of buildings; provision of warehousing, freight forwarding, advertising and promotion, research and development, computer systems, and distribution and marketing services; medical devices trading; and manufacture of food supplements, food and beverages, and plastic packaging, as well as consumer products, soaps, and household products. It sells its products under Bodrex, Vidoran, Hemaviton, Oskadon, Bodrexin, Neo rheumacyl, Oskadryl, Contrexyn, Zevit Grow, Wybert, Vitonal, Polaris, and Vitamin IPI brands. The company was formerly known as PT Scanchemie. PT Tempo Scan Pacific Tbk was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Tempo Scan Pacific Tbk is a subsidiary of PT Bogamulia Nagadi.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SAME.JK": {
        "short_name": "Sarana Meditama Metropolitan Tb",
        "long_name": "PT Sarana Meditama Metropolitan Tbk",
        "summary": "PT Sarana Meditama Metropolitan Tbk engages in the hospital management of OMNI Hospital Pulomas in Pulomas, East Jakarta. The company was founded in 1984 and is based in Indonesia. As of December 1, 2020, PT Sarana Meditama Metropolitan Tbk operates as a subsidiary of PT Elang Mahkota Teknologi Tbk.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SDPC.JK": {
        "short_name": "Millennium Pharmacon Internatio",
        "long_name": "PT Millennium Pharmacon International Tbk",
        "summary": "PT Millennium Pharmacon International Tbk engages in the distribution and trading of prescription and non-prescription medicines, food supplements, and medical devices in Indonesia and internationally. The company distributes its products through hospitals, drug stores, pharmacies, and modern markets. As of December 31, 2019, it operated 32 branch offices in Java, Bali, Sumatera, Kalimantan, and Sulawesi Islands. The company was formerly known as PT NVPD Soedarpo Corporation Tbk and changed its name to PT Millennium Pharmacon International Tbk in February 1990. The company was founded in 1952 and is headquartered in Jakarta, Indonesia. PT Millennium Pharmacon International Tbk is a subsidiary of Pharmaniaga International Corporation Sdn. Bhd.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    },
    "SIDO.JK": {
        "short_name": "Industri Jamu dan Farmasi Sido ",
        "long_name": "PT Industri Jamu dan Farmasi Sido Muncul Tbk",
        "summary": "PT Industri Jamu dan Farmasi Sido Muncul Tbk provides herbal medicines, cosmetics, and foods and beverages related to health in Indonesia and internationally. The company produces various medicines consisting of ethical products, OTC products, food supplements, and medical herbs. Its products include Anacetine, a medicine to reduce fever; Combicitrine, a medicine for bacteries/worms removal; Berlosid, a medicine for gastric pains; Anabion multivitamins for children; Suprabion multivitamins for adults; and Telon Oil. The company also manufactures herbal extracts, as well as offers confectionary products, energy and health drinks, and other products. In addition, it is involved in commerce and land transportation activities. The company was founded in 1940 and is headquartered in Semarang, Indonesia. PT Industri Jamu dan Farmasi Sido Muncul Tbk is a subsidiary of PT Hotel Candi Baru.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Semarang"
    },
    "SILO.JK": {
        "short_name": "Siloam International Hospitals ",
        "long_name": "PT Siloam International Hospitals Tbk",
        "summary": "PT Siloam International Hospitals Tbk, together with its subsidiaries, provides healthcare services in Indonesia. It also engages in setting up and managing hospitals. The company offers specialist and general medical services, including complex surgical procedures, laboratory services, radiology and imaging services, fertility treatment, diagnostic, and emergency services. Its hospitals provide services in the therapeutic areas of orthopedics, neurosciences, oncology, cardiology, urology, pediatrics, otolaryngology, ophthalmology, nephrology, pulmonology/respiratory, gastroenterology, and obstetrics and gynecology. As of December 31, 2019, the company operated 37 hospitals with 7,682 beds in Sumatra, Java, Bali, Kalimantan, Sulawesi, and Nusa Tenggara. In addition, it engages in trading, development, mining, agriculture, service, land transportation, pharmacy, workshop and industrial printing, plantation, forestry, electrical, mechanical, engineering, construction, agribusiness, and real estate businesses. The company was formerly known as PT Sentralindo Wirasta. PT Siloam International Hospitals Tbk was founded in 1996 and is headquartered in Tangerang, Indonesia. PT Siloam International Hospitals Tbk is a subsidiary of PT Megapratama Karya Persada.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "SRAJ.JK": {
        "short_name": "Sejahteraraya Anugrahjaya Tbk.",
        "long_name": "PT Sejahteraraya Anugrahjaya Tbk",
        "summary": "PT Sejahteraraya Anugrahjaya Tbk operates private hospitals in Tangerang and South Jakarta, Indonesia. It operates through two segment; In-Patient and Out-Patient services. The company operates its hospitals under the Mayapada Hospital name, offers support facilities. The company was formerly known as PT Sejahtera Raya Anugrah and changed its name to PT Sejahteraraya Anugrahjaya Tbk in December 1992. PT Sejahteraraya Anugrahjaya Tbk was founded in 1991 and is headquartered in Tangerang, Indonesia. PT Sejahteraraya Anugrahjaya Tbk is a subsidiary of PT Surya Cipta Inti Cemerlang.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Tangerang"
    },
    "TSPC.JK": {
        "short_name": "Tempo Scan Pacific Tbk.",
        "long_name": "PT Tempo Scan Pacific Tbk",
        "summary": "PT Tempo Scan Pacific Tbk engages in the pharmaceuticals, personal care and cosmetics, and distribution services businesses in Indonesia and internationally. It operates through three segments: Pharmaceuticals, Consumer Products and Cosmetics, and Distribution Services. The company is involved in the construction and rental of buildings; provision of warehousing, freight forwarding, advertising and promotion, research and development, computer systems, and distribution and marketing services; medical devices trading; and manufacture of food supplements, food and beverages, and plastic packaging, as well as consumer products, soaps, and household products. It sells its products under Bodrex, Vidoran, Hemaviton, Oskadon, Bodrexin, Neo rheumacyl, Oskadryl, Contrexyn, Zevit Grow, Wybert, Vitonal, Polaris, and Vitamin IPI brands. The company was formerly known as PT Scanchemie. PT Tempo Scan Pacific Tbk was founded in 1970 and is headquartered in Jakarta, Indonesia. PT Tempo Scan Pacific Tbk is a subsidiary of PT Bogamulia Nagadi.",
        "currency": "IDR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "city": "Jakarta"
    }
}