{
    "2080.SR": {
        "short_name": "National Gas and Industrializat",
        "long_name": "National Gas & Industerialization Co.",
        "summary": "National Gas & Industerialization Co. engages in the transportation, filling, and marketing of liquefied petroleum gas primarily in Saudi Arabia. The company's products include underground and ground surface gas tanks; gas and fiber cylinders; gas cylinder and tank regulators; and liquid gas. It also provides installation, refill, and maintenance services; and manufactures, transfers, and markets petroleum products, chemicals, glass, and auto parts, as well as markets cylinders, empty tanks, related spare parts, and tank transportation equipment. In addition, the company is involved in the operation of equipment service centers; and the establishment and maintenance of petroleum equipment and vehicles. Its gases are also used for residential, industrial, agricultural, and commercial purposes. National Gas & Industerialization Co. was incorporated in 1963 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11421",
        "website": "http://www.gasco.com.sa",
        "full_time_employees": null
    },
    "2081.SR": {
        "short_name": "Alkhorayef Water and Power Tech",
        "long_name": "Alkhorayef Water & Power Technologies",
        "summary": "Alkhorayef Water & Power Technologies designs, constructs, operates, maintains, and manages water and wastewater projects in Saudi Arabia. It provides engineering, procurement, and construction; and operation and maintenance services. The company's services cover domestic and industrial wastewater plants, water treatment plants, water desalination plants, water and wastewater networks and house connections, filtration solutions and membrane systems, main water and sewage lines, strategic tanks, pump/lifting stations, electro-mechanical works, storm water, and water well projects. Its customers include government agencies and institutions, such as Ministry of Water and Electricity, National Water Company, MODON, Sabic, Aramco, Marafiq, Royal Commission, SWCC, Ministry of Defense, etc. The company is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Water",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11595",
        "website": "http://www.alkhorayef.com/en/Company/CompanyDetails/28",
        "full_time_employees": null
    }
}