{
    "0NR.F": {
        "short_name": "UNIPHAR PLC  EO -,08",
        "long_name": "Uniphar plc",
        "summary": "Uniphar plc operates as a diversified healthcare services company in the Republic of Ireland, the United Kingdom, and internationally. The company operates through three divisions: Commercial & Clinical, Product Access, and Supply Chain & Retail. The Commercial & Clinical division offers outsourced sales, marketing, and multichannel account management services to pharmaco-medical manufacturers; and distribution and support services to medical device manufacturers. The Product Access division provides on demand services, which provides access to pharmaco-medical products and treatments by developing valuable relationships and interactions between manufacturers and other healthcare stakeholders; and exclusive access services that offers bespoke distribution partnerships to pharmaceutical partners for key brands. The Supply Chain & Retail division engages in pre-wholesale and wholesale distribution of pharmaceutical, healthcare, and animal health products to pharmacies, hospitals, and veterinary surgeons; operates a network of pharmacies under the Life, Allcare, and Hickey's brands. It also offers pharmacy support, pharmaceutical supply chain, specialist nursing and infusion, data intelligence and consultancy services, and online pharmacy and product fostering services, as well as data solutions for pharma industry. Uniphar plc was founded in 1967 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D24 V06K",
        "website": "http://www.uniphar.ie",
        "market_cap": "Small Cap"
    },
    "0PT.F": {
        "short_name": "PROTHENA CORP. PLC DL-,01",
        "long_name": "Prothena Corporation plc",
        "summary": "Prothena Corporation plc, a late-stage clinical company, focuses on discovery and development of novel therapies for life-threatening diseases in the United States. The company is involved in developing PRX002/RG7935 that is in Phase 2 clinical trial for treating Parkinson's disease and other related synucleinopathies; and PRX004, an antibody that is in Phase 1 clinical trial for the treatment of ATTR amyloidosis. Its discovery-stage programs include Tau for treating Alzheimer's disease, frontotemporal dementia, progressive supranuclear palsy, chronic traumatic encephalopathy, and other tauopathies; AÃ\u009f, or Amyloid Beta, a protein for the treatment of Alzheimer's disease; TDP-43 for amyotrophic lateral sclerosis and frontotemporal dementia; and other products for neurodegenerative diseases. The company has a license, development, and commercialization agreement with F. Hoffmann-La Roche Ltd. and Hoffmann-La Roche Inc. to develop and commercialize antibodies that target alpha-synuclein; and a collaboration agreement with Bristol-Myers Squibb to develop antibodies. Prothena Corporation plc was founded in 2012 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.prothena.com",
        "market_cap": "Small Cap"
    },
    "2M6.DE": {
        "short_name": "MEDTRONIC PLC  DL-,0001",
        "long_name": "Medtronic plc",
        "summary": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "GER",
        "market": "de_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.medtronic.com",
        "market_cap": "Large Cap"
    },
    "2M6.F": {
        "short_name": "MEDTRONIC PLC  DL-,0001",
        "long_name": "Medtronic plc",
        "summary": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.medtronic.com",
        "market_cap": "Large Cap"
    },
    "2TG.F": {
        "short_name": "STERIS PLC  DL 0,001",
        "long_name": "STERIS plc",
        "summary": "STERIS plc provides infection prevention and other procedural products and services worldwide. It operates in four segments: Healthcare Products, Healthcare Specialty Services, Life Sciences, and Applied Sterilization Technologies. The Healthcare Products segment offers cleaning chemistries and sterility assurance products; accessories for gastrointestinal (GI) procedures, washers, sterilizers, and other pieces of capital equipment for the operation of a sterile processing department; and equipment used directly in the operating room, including surgical tables, lights, equipment management services, and connectivity solutions. It also provides capital equipment installation, maintenance, upgradation, repair, and troubleshooting services. This segment offers its products and services to acute care hospitals, ambulatory surgery centers, and GI clinics. The Healthcare Specialty Services segment provides solutions and managed services, such as instrument and endoscope repair and maintenance solutions; custom process improvement consulting services; and outsourced instrument sterile processing services to acute care hospitals and other healthcare settings. The Life Sciences segment offers formulated cleaning chemistries, barrier and sterility assurance products, steam and vaporized hydrogen peroxide sterilizers, and washer disinfectors. The Applied Sterilization Technologies segment provides contract sterilization and testing services for medical device and pharmaceutical manufacturers through a network of approximately 50 contract sterilization and laboratory facilities. The company was founded in 1985 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D02 R296",
        "website": "http://www.steris.com",
        "market_cap": "Large Cap"
    },
    "3N9.F": {
        "short_name": "AMRYT PHARMA PLC  LS -,06",
        "long_name": "Amryt Pharma plc",
        "summary": "Amryt Pharma plc, a commercial-stage biopharmaceutical company, develops and commercializes novel therapeutics to treat patients suffering from serious and life-threatening rare diseases. The company offers Lomitapide for the treatment of homozygous familial hypercholesterolemia; and Metreleptin for the treatment of generalized and partial lipodystrophy. It also develops FILSUVEZ drug candidate, which is in Phase 3 EASE trial for the treatment of severe epidermolysis bullosa (EB), a rare and genetic skin disease; and AP103 that is in preclinical stage for the treatment of patients with recessive dystrophic EB, a subset of EB. The company sells its products in the Americas, Europe, and the Middle East. Amryt Pharma plc was founded in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.amrytpharma.com",
        "market_cap": "Small Cap"
    },
    "3N9A.F": {
        "short_name": "AMRYT PHARMA PLC SP.ADR/5",
        "long_name": "Amryt Pharma plc",
        "summary": "Amryt Pharma plc, a commercial-stage biopharmaceutical company, develops and commercializes novel therapeutics to treat patients suffering from serious and life-threatening rare diseases. The company offers Lomitapide for the treatment of homozygous familial hypercholesterolemia; and Metreleptin for the treatment of generalized and partial lipodystrophy. It also develops FILSUVEZ drug candidate, which is in Phase 3 EASE trial for the treatment of severe epidermolysis bullosa (EB), a rare and genetic skin disease; and AP103 that is in preclinical stage for the treatment of patients with recessive dystrophic EB, a subset of EB. The company sells its products in the Americas, Europe, and the Middle East. Amryt Pharma plc was founded in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.amrytpharma.com",
        "market_cap": "Small Cap"
    },
    "8AK.F": {
        "short_name": "ALKERMES PLC  DL-,01",
        "long_name": "Alkermes plc",
        "summary": "Alkermes plc, a biopharmaceutical company, researches, develops, and commercializes pharmaceutical products to address unmet medical needs of patients in various therapeutic areas in the United States, Ireland, and internationally. Its marketed products include ARISTADA (aripiprazole lauroxil), an extended-release intramuscular injectable suspension for the treatment of schizophrenia; VIVITROL (naltrexone for extended-release injectable suspension) for the treatment of alcohol and opioid dependence; RISPERDAL CONSTA for the treatment of schizophrenia and bipolar I disorder; INVEGA SUSTENNA for the treatment of schizophrenia and schizoaffective disorder; XEPLION, INVEGA TRINZA, and TREVICTA to treat schizophrenia; and VUMERITY (diroximel fumarate) for the treatment of relapsing forms of multiple sclerosis in adults, including clinically isolated syndrome, relapsing-remitting and active secondary progressive diseases. The company is also developing LYBALVI (olanzapine/samidorphan), an oral atypical antipsychotic drug candidate for the treatment of adults with schizophrenia and bipolar I disorder; and nemvaleukin alfa, an engineered fusion protein to expand tumor-killing immune cells and to avoid the activation of immunosuppressive cells. It has collaboration agreements with Janssen Pharmaceutica N.V., Janssen Pharmaceutica Inc, and Janssen Pharmaceutica International; a license agreement with Acorda Therapeutics, Inc.; and a license and collaboration agreement with Biogen Swiss Manufacturing GmbH. Alkermes plc was founded in 1987 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.alkermes.com",
        "market_cap": "Mid Cap"
    },
    "ALKS": {
        "short_name": "Alkermes plc",
        "long_name": "Alkermes plc",
        "summary": "Alkermes plc, a biopharmaceutical company, researches, develops, and commercializes pharmaceutical products to address unmet medical needs of patients in various therapeutic areas in the United States, Ireland, and internationally. Its marketed products include ARISTADA (aripiprazole lauroxil), an extended-release intramuscular injectable suspension for the treatment of schizophrenia; VIVITROL (naltrexone for extended-release injectable suspension) for the treatment of alcohol and opioid dependence; RISPERDAL CONSTA for the treatment of schizophrenia and bipolar I disorder; INVEGA SUSTENNA for the treatment of schizophrenia and schizoaffective disorder; XEPLION, INVEGA TRINZA, and TREVICTA to treat schizophrenia; and VUMERITY (diroximel fumarate) for the treatment of relapsing forms of multiple sclerosis in adults, including clinically isolated syndrome, relapsing-remitting and active secondary progressive diseases. The company is also developing LYBALVI (olanzapine/samidorphan), an oral atypical antipsychotic drug candidate for the treatment of adults with schizophrenia and bipolar I disorder; and nemvaleukin alfa, an engineered fusion protein to expand tumor-killing immune cells and to avoid the activation of immunosuppressive cells. It has collaboration agreements with Janssen Pharmaceutica N.V., Janssen Pharmaceutica Inc, and Janssen Pharmaceutica International; a license agreement with Acorda Therapeutics, Inc.; and a license and collaboration agreement with Biogen Swiss Manufacturing GmbH. Alkermes plc was founded in 1987 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.alkermes.com",
        "market_cap": "Mid Cap"
    },
    "AMRN": {
        "short_name": "Amarin Corporation plc",
        "long_name": "Amarin Corporation plc",
        "summary": "Amarin Corporation plc, a pharmaceutical company, engages in the development and commercialization of therapeutics for the treatment of cardiovascular diseases in the United States. Its lead product is VASCEPA, a prescription-only omega-3 fatty acid product, used as an adjunct to diet for reducing triglyceride levels in adult patients with severe hypertriglyceridemia. The company sells its products principally to wholesalers and specialty pharmacy providers. It has a collaboration with Mochida Pharmaceutical Co., Ltd. to develop and commercialize drug products and indications based on the active pharmaceutical ingredient in Vascepa, the omega-3 acid, and eicosapentaenoic acid. The company was formerly known as Ethical Holdings plc and changed its name to Amarin Corporation plc in 1999. Amarin Corporation plc was incorporated in 1989 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.amarincorp.com",
        "market_cap": "Small Cap"
    },
    "AMYT.L": {
        "short_name": "AMRYT PHARMA PLC ORD 6P",
        "long_name": "Amryt Pharma plc",
        "summary": "Amryt Pharma plc, a commercial-stage biopharmaceutical company, develops and commercializes novel therapeutics to treat patients suffering from serious and life-threatening rare diseases. The company offers Lomitapide for the treatment of homozygous familial hypercholesterolemia; and Metreleptin for the treatment of generalized and partial lipodystrophy. It also develops FILSUVEZ drug candidate, which is in Phase 3 EASE trial for the treatment of severe epidermolysis bullosa (EB), a rare and genetic skin disease; and AP103 that is in preclinical stage for the treatment of patients with recessive dystrophic EB, a subset of EB. The company sells its products in the Americas, Europe, and the Middle East. Amryt Pharma plc was founded in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.amrytpharma.com",
        "market_cap": "Small Cap"
    },
    "AMYT": {
        "short_name": "Amryt Pharma plc",
        "long_name": "Amryt Pharma plc",
        "summary": "Amryt Pharma plc, a commercial-stage biopharmaceutical company, develops and commercializes novel therapeutics to treat patients suffering from serious and life-threatening rare diseases. The company offers Lomitapide for the treatment of homozygous familial hypercholesterolemia; and Metreleptin for the treatment of generalized and partial lipodystrophy. It also develops FILSUVEZ drug candidate, which is in Phase 3 EASE trial for the treatment of severe epidermolysis bullosa (EB), a rare and genetic skin disease; and AP103 that is in preclinical stage for the treatment of patients with recessive dystrophic EB, a subset of EB. The company sells its products in the Americas, Europe, and the Middle East. Amryt Pharma plc was founded in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.amrytpharma.com",
        "market_cap": "Small Cap"
    },
    "AVDL": {
        "short_name": "Avadel Pharmaceuticals plc",
        "long_name": "Avadel Pharmaceuticals plc",
        "summary": "Avadel Pharmaceuticals plc operates as a biopharmaceutical company in the United States. The company's lead product candidate is FT218, a formulation of sodium oxybate which is in a Phase 3 clinical trial for the treatment excessive daytime sleepiness (EDS) and cataplexy in adults with narcolepsy. The company was formerly known as Flamel Technologies SA and changed its name to Avadel Pharmaceuticals PLC in January 2017. Avadel Pharmaceuticals plc was incorporated in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.avadel.com",
        "market_cap": "Small Cap"
    },
    "AWK1.F": {
        "short_name": "AVADEL PHARM. SPONS.ADR/1",
        "long_name": "Avadel Pharmaceuticals plc",
        "summary": "Avadel Pharmaceuticals plc operates as a biopharmaceutical company in the United States. The company's lead product candidate is FT218, a formulation of sodium oxybate which is in a Phase 3 clinical trial for the treatment excessive daytime sleepiness (EDS) and cataplexy in adults with narcolepsy. The company was formerly known as Flamel Technologies SA and changed its name to Avadel Pharmaceuticals PLC in January 2017. Avadel Pharmaceuticals plc was incorporated in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.avadel.com",
        "market_cap": "Small Cap"
    },
    "C43.F": {
        "short_name": "COSMO PHARMACEUT.  EO-,26",
        "long_name": "Cosmo Pharmaceuticals N.V.",
        "summary": "Cosmo Pharmaceuticals N.V., a specialty pharmaceutical company, develops, manufactures, and distributes products for gastroenterology and endoscopy worldwide. The company offers Lialda/Mezavant/Mesavancol and UCERIS/Cortiment, an oral tablet formulation for remission in active, mild to moderate ulcerative colitis; Aemcolo, a pharmaceutical product used for the treatment of traveler's diarrhea, uncomplicated acute diverticulitis, minimal hepatic encephalopathy, and small intestine bacterial overgrowth, as well as Rifamycin for irritable bowel syndrome with diarrhoea; and Eleview, an injectable composition for use in gastrointestinal endoscopic procedures for submucosal lift of polyps, adenomas, early stage cancers, or other gastrointestinal mucosal lesions. It also provides ByFavo (Remimazolam), a fast-acting intravenous benzodiazepine agent for the induction and maintenance of procedural sedation; Qolotag, a medical device that enhances the visualisation of lesions during sigmoidoscopies; Methylene Blue MMX, diagnostic drug to enhance pre-cancerous and cancerous detection of colorectal lesions during colonoscopy; GI Genius, a system that uses artificial intelligence to detect colorectal polyps; and CB-03-10, an oral androgen receptor antagonist for treatment against solid tumors. The company has a license agreement with RedHill Biopharma Ltd.; and Acacia Pharma Group plc. Cosmo Pharmaceuticals N.V. was founded in 1997 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.cosmopharma.com",
        "market_cap": "Small Cap"
    },
    "COPN.SW": {
        "short_name": "COSMO PHARM N",
        "long_name": "Cosmo Pharmaceuticals N.V.",
        "summary": "Cosmo Pharmaceuticals N.V., a specialty pharmaceutical company, develops, manufactures, and distributes products for gastroenterology and endoscopy worldwide. The company offers Lialda/Mezavant/Mesavancol and UCERIS/Cortiment, an oral tablet formulation for remission in active, mild to moderate ulcerative colitis; Aemcolo, a pharmaceutical product used for the treatment of traveler's diarrhea, uncomplicated acute diverticulitis, minimal hepatic encephalopathy, and small intestine bacterial overgrowth, as well as Rifamycin for irritable bowel syndrome with diarrhoea; and Eleview, an injectable composition for use in gastrointestinal endoscopic procedures for submucosal lift of polyps, adenomas, early stage cancers, or other gastrointestinal mucosal lesions. It also provides ByFavo (Remimazolam), a fast-acting intravenous benzodiazepine agent for the induction and maintenance of procedural sedation; Qolotag, a medical device that enhances the visualisation of lesions during sigmoidoscopies; Methylene Blue MMX, diagnostic drug to enhance pre-cancerous and cancerous detection of colorectal lesions during colonoscopy; GI Genius, a system that uses artificial intelligence to detect colorectal polyps; and CB-03-10, an oral androgen receptor antagonist for treatment against solid tumors. The company has a license agreement with RedHill Biopharma Ltd.; and Acacia Pharma Group plc. Cosmo Pharmaceuticals N.V. was founded in 1997 and is headquartered in Dublin, Ireland.",
        "currency": "CHF",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.cosmopharma.com",
        "market_cap": "Small Cap"
    },
    "EH3A.F": {
        "short_name": "AMARIN CORP.ADR LS-50",
        "long_name": "Amarin Corporation plc",
        "summary": "Amarin Corporation plc, a pharmaceutical company, engages in the development and commercialization of therapeutics for the treatment of cardiovascular diseases in the United States. Its lead product is VASCEPA, a prescription-only omega-3 fatty acid product, used as an adjunct to diet for reducing triglyceride levels in adult patients with severe hypertriglyceridemia. The company sells its products principally to wholesalers and specialty pharmacy providers. It has a collaboration with Mochida Pharmaceutical Co., Ltd. to develop and commercialize drug products and indications based on the active pharmaceutical ingredient in Vascepa, the omega-3 acid, and eicosapentaenoic acid. The company was formerly known as Ethical Holdings plc and changed its name to Amarin Corporation plc in 1999. Amarin Corporation plc was incorporated in 1989 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.amarincorp.com",
        "market_cap": "Small Cap"
    },
    "ENDP": {
        "short_name": "Endo International plc",
        "long_name": "Endo International plc",
        "summary": "Endo International plc, a specialty pharmaceutical company, manufactures and sells generic and branded pharmaceuticals in the United States and internationally. Its Branded Pharmaceuticals segment provides branded prescription products, including XIAFLEX to treat adult patients with Dupuytren's contracture; SUPPRELIN LA to treat central precocious puberty in children; NASCOBAL nasal spray to treat vitamin B12 deficiency; AVEED to treat hypogonadism; PERCOCET to treat moderate-to-moderately-severe pain; TESTOPEL an implantable pellet indicated for TRT in conditions associated with a deficiency or absence of endogenous testosterone; EDEX to treat erectile dysfunction; LIDODERM a topical patch product containing lidocaine for the relief of pain; and products for the pain management and urology. The company's Sterile Injectables segment manufactures VASOSTRICT, a vasopressin injection; ADRENALIN, a non-selective adrenergic agonist; and APLISOL, which is a sterile aqueous solution, as well as generic sterile injectable products, including ertapenem for injections and ephedrine sulfate injections. Its Generic Pharmaceuticals segment offers solid oral extended-release, solid oral immediate-release, liquids, semi-solids, patches, powders, ophthalmic products, and sprays. The company's International Pharmaceuticals segment offers specialty pharmaceutical products in various therapeutic areas comprising attention deficit hyperactivity disorder, pain, women's health, oncology, and transplantation. The company sells its branded pharmaceuticals and generics to specialty physicians, retailers, clinics, government agencies, doctors, retail and specialty pharmacies, and specialty distributors. Endo International plc was founded in 1920 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.endo.com",
        "market_cap": "Small Cap"
    },
    "ENDPN.MX": {
        "short_name": "ENDO INTERNATIONAL PLC",
        "long_name": "Endo International plc",
        "summary": "Endo International plc, a specialty pharmaceutical company, manufactures and sells generic and branded pharmaceuticals in the United States and internationally. Its Branded Pharmaceuticals segment provides branded prescription products, including XIAFLEX to treat adult patients with Dupuytren's contracture; SUPPRELIN LA to treat central precocious puberty in children; NASCOBAL nasal spray to treat vitamin B12 deficiency; AVEED to treat hypogonadism; PERCOCET to treat moderate-to-moderately-severe pain; TESTOPEL an implantable pellet indicated for TRT in conditions associated with a deficiency or absence of endogenous testosterone; EDEX to treat erectile dysfunction; LIDODERM a topical patch product containing lidocaine for the relief of pain; and products for the pain management and urology. The company's Sterile Injectables segment manufactures VASOSTRICT, a vasopressin injection; ADRENALIN, a non-selective adrenergic agonist; and APLISOL, which is a sterile aqueous solution, as well as generic sterile injectable products, including ertapenem for injections and ephedrine sulfate injections. Its Generic Pharmaceuticals segment offers solid oral extended-release, solid oral immediate-release, liquids, semi-solids, patches, powders, ophthalmic products, and sprays. The company's International Pharmaceuticals segment offers specialty pharmaceutical products in various therapeutic areas comprising attention deficit hyperactivity disorder, pain, women's health, oncology, and transplantation. The company sells its branded pharmaceuticals and generics to specialty physicians, retailers, clinics, government agencies, doctors, retail and specialty pharmacies, and specialty distributors. Endo International plc was founded in 1920 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Drugs - Generic",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.endo.com",
        "market_cap": "Large Cap"
    },
    "EO7.F": {
        "short_name": "ENDO INTERNATL  DL-,0001",
        "long_name": "Endo International plc",
        "summary": "Endo International plc, a specialty pharmaceutical company, manufactures and sells generic and branded pharmaceuticals in the United States and internationally. Its Branded Pharmaceuticals segment provides branded prescription products, including XIAFLEX to treat adult patients with Dupuytren's contracture; SUPPRELIN LA to treat central precocious puberty in children; NASCOBAL nasal spray to treat vitamin B12 deficiency; AVEED to treat hypogonadism; PERCOCET to treat moderate-to-moderately-severe pain; TESTOPEL an implantable pellet indicated for TRT in conditions associated with a deficiency or absence of endogenous testosterone; EDEX to treat erectile dysfunction; LIDODERM a topical patch product containing lidocaine for the relief of pain; and products for the pain management and urology. The company's Sterile Injectables segment manufactures VASOSTRICT, a vasopressin injection; ADRENALIN, a non-selective adrenergic agonist; and APLISOL, which is a sterile aqueous solution, as well as generic sterile injectable products, including ertapenem for injections and ephedrine sulfate injections. Its Generic Pharmaceuticals segment offers solid oral extended-release, solid oral immediate-release, liquids, semi-solids, patches, powders, ophthalmic products, and sprays. The company's International Pharmaceuticals segment offers specialty pharmaceutical products in various therapeutic areas comprising attention deficit hyperactivity disorder, pain, women's health, oncology, and transplantation. The company sells its branded pharmaceuticals and generics to specialty physicians, retailers, clinics, government agencies, doctors, retail and specialty pharmacies, and specialty distributors. Endo International plc was founded in 1920 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.endo.com",
        "market_cap": "Small Cap"
    },
    "FOBK.F": {
        "short_name": "KNEAT.COM INC.",
        "long_name": "kneat.com, inc.",
        "summary": "kneat.com, inc. designs, develops, and supplies software for data and document management within regulated environments in the United States, Ireland, Canada, internationally. The company offers Kneat Gx platform, a configurable commercial off-the-shelf application focused on validation lifecycle management and testing for biotechnology, pharmaceutical, and medical device manufacturing industries. Its platform is used in instrument, method, utility and facility, process, equipment, computer system, cold chain, and cleaning validation, as well commissioning and qualification, and electronic logbook management. It also provides software-related services, including training, installation, upgradation, consulting, and maintenance, as well as process mapping, project management, and other services. The company is headquartered in Limerick, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Limerick",
        "zipcode": "V94 KW28",
        "website": "http://www.kneat.com",
        "market_cap": "Small Cap"
    },
    "H1ZN34.SA": {
        "short_name": "HORIZON THERDRN",
        "long_name": "Horizon Therapeutics Public Limited Company",
        "summary": "Horizon Therapeutics Public Limited Company focuses on researching, developing, and commercializing medicines that address unmet treatment needs for rare and rheumatic diseases in the United States and internationally. It operates in two segments, Orphan and Inflammation. Its medicines include KRYSTEXXA, a medicine for the treatment of uncontrolled gout; RAVICTI for use as a nitrogen-binding agent for chronic management of adult and pediatric patients; PROCYSBI for nephropathic cystinosis, a rare lysosomal storage disorder; ACTIMMUNE for chronic granulomatous disease and severe malignant osteopetrosis; RAYOS for the treatment of rheumatoid arthritis (RA), ankylosing spondylitis (AS), polymyalgia rheumatica, primary systemic amyloidosis, asthma, chronic obstructive pulmonary disease, systemic lupus erythematosus, and other conditions; BUPHENYL tablets for oral administration and BUPHENYL powder for oral, nasogastric, or gastrostomy tube administration; and QUINSAIR, a formulation of the antibiotic drug levofloxacin for the management of chronic pulmonary infections due to Pseudomonas aeruginosa in adult patients with cystic fibrosis. The company also offers PENNSAID 2% that is indicated for the treatment of pain of osteoarthritis (OA) of the knees; DUEXIS for the relief of signs and symptoms of RA and OA, and to decrease the risk of developing upper-GI ulcers; and VIMOVO for the relief of signs and symptoms of OA, RA, and AS to decrease the risk of developing gastric ulcers in patients at risk of developing NSAID-associated gastric ulcers. It has collaboration agreements with Lupus Research and HemoShear Therapeutics, LLC. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland.",
        "currency": "BRL",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.horizontherapeutics.com",
        "market_cap": "Large Cap"
    },
    "HPR.F": {
        "short_name": "HORIZON THERAP.PLC DL-,01",
        "long_name": "Horizon Therapeutics Public Limited Company",
        "summary": "Horizon Therapeutics Public Limited Company focuses on researching, developing, and commercializing medicines that address unmet treatment needs for rare and rheumatic diseases in the United States and internationally. It operates in two segments, Orphan and Inflammation. Its medicines include KRYSTEXXA, a medicine for the treatment of uncontrolled gout; RAVICTI for use as a nitrogen-binding agent for chronic management of adult and pediatric patients; PROCYSBI for nephropathic cystinosis, a rare lysosomal storage disorder; ACTIMMUNE for chronic granulomatous disease and severe malignant osteopetrosis; RAYOS for the treatment of rheumatoid arthritis (RA), ankylosing spondylitis (AS), polymyalgia rheumatica, primary systemic amyloidosis, asthma, chronic obstructive pulmonary disease, systemic lupus erythematosus, and other conditions; BUPHENYL tablets for oral administration and BUPHENYL powder for oral, nasogastric, or gastrostomy tube administration; and QUINSAIR, a formulation of the antibiotic drug levofloxacin for the management of chronic pulmonary infections due to Pseudomonas aeruginosa in adult patients with cystic fibrosis. The company also offers PENNSAID 2% that is indicated for the treatment of pain of osteoarthritis (OA) of the knees; DUEXIS for the relief of signs and symptoms of RA and OA, and to decrease the risk of developing upper-GI ulcers; and VIMOVO for the relief of signs and symptoms of OA, RA, and AS to decrease the risk of developing gastric ulcers in patients at risk of developing NSAID-associated gastric ulcers. It has collaboration agreements with Lupus Research and HemoShear Therapeutics, LLC. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.horizontherapeutics.com",
        "market_cap": "Large Cap"
    },
    "HZNP": {
        "short_name": "Horizon Therapeutics Public Lim",
        "long_name": "Horizon Therapeutics Public Limited Company",
        "summary": "Horizon Therapeutics Public Limited Company focuses on researching, developing, and commercializing medicines that address unmet treatment needs for rare and rheumatic diseases in the United States and internationally. It operates in two segments, Orphan and Inflammation. Its medicines include KRYSTEXXA, a medicine for the treatment of uncontrolled gout; RAVICTI for use as a nitrogen-binding agent for chronic management of adult and pediatric patients; PROCYSBI for nephropathic cystinosis, a rare lysosomal storage disorder; ACTIMMUNE for chronic granulomatous disease and severe malignant osteopetrosis; RAYOS for the treatment of rheumatoid arthritis (RA), ankylosing spondylitis (AS), polymyalgia rheumatica, primary systemic amyloidosis, asthma, chronic obstructive pulmonary disease, systemic lupus erythematosus, and other conditions; BUPHENYL tablets for oral administration and BUPHENYL powder for oral, nasogastric, or gastrostomy tube administration; and QUINSAIR, a formulation of the antibiotic drug levofloxacin for the management of chronic pulmonary infections due to Pseudomonas aeruginosa in adult patients with cystic fibrosis. The company also offers PENNSAID 2% that is indicated for the treatment of pain of osteoarthritis (OA) of the knees; DUEXIS for the relief of signs and symptoms of RA and OA, and to decrease the risk of developing upper-GI ulcers; and VIMOVO for the relief of signs and symptoms of OA, RA, and AS to decrease the risk of developing gastric ulcers in patients at risk of developing NSAID-associated gastric ulcers. It has collaboration agreements with Lupus Research and HemoShear Therapeutics, LLC. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.horizontherapeutics.com",
        "market_cap": "Large Cap"
    },
    "ICLR": {
        "short_name": "ICON plc",
        "long_name": "ICON Public Limited Company",
        "summary": "ICON Public Limited Company, a clinical research organization, provides outsourced development and commercialization services in Ireland, rest of Europe, the United States, and internationally. The company specializes in the strategic development, management, and analysis of programs that support various stages of the clinical development process from compound selection to Phase I-IV clinical studies. It offers clinical development services, including product development planning, strategic consulting, study protocol preparation, clinical pharmacology, pharmacokinetic and pharmacodynamic analysis, site feasibility, patient recruitment and retention, digital patient and site, project management, clinical operations/monitoring, patient centric monitoring, data management, and adaptive and virtual trial services. The company's clinical development services also comprise medical imaging, biostatistics, medical affairs, pharmacovigilance, strategic regulatory, electronic endpoint adjudication, medical writing and publishing, interactive response technologies, functional solutions, strategic resourcing central laboratory, bioanalytical laboratory, biomarket development, strategy and analytics, late phase research, patient centered science, and medical device and diagnostics research services, as well as access, commercialization, and communication services, and research trials for us government agencies. It serves pharmaceutical, biotechnology, and medical device industries, as well as government and public health organizations. The company was incorporated in 1990 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "18",
        "website": "http://www.iconplc.com",
        "market_cap": "Large Cap"
    },
    "IJF.F": {
        "short_name": "ICON PLC  EO-,06",
        "long_name": "ICON Public Limited Company",
        "summary": "ICON Public Limited Company, a clinical research organization, provides outsourced development and commercialization services in Ireland, rest of Europe, the United States, and internationally. The company specializes in the strategic development, management, and analysis of programs that support various stages of the clinical development process from compound selection to Phase I-IV clinical studies. It offers clinical development services, including product development planning, strategic consulting, study protocol preparation, clinical pharmacology, pharmacokinetic and pharmacodynamic analysis, site feasibility, patient recruitment and retention, digital patient and site, project management, clinical operations/monitoring, patient centric monitoring, data management, and adaptive and virtual trial services. The company's clinical development services also comprise medical imaging, biostatistics, medical affairs, pharmacovigilance, strategic regulatory, electronic endpoint adjudication, medical writing and publishing, interactive response technologies, functional solutions, strategic resourcing central laboratory, bioanalytical laboratory, biomarket development, strategy and analytics, late phase research, patient centered science, and medical device and diagnostics research services, as well as access, commercialization, and communication services, and research trials for us government agencies. It serves pharmaceutical, biotechnology, and medical device industries, as well as government and public health organizations. The company was incorporated in 1990 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "18",
        "website": "http://www.iconplc.com",
        "market_cap": "Mid Cap"
    },
    "ITRM": {
        "short_name": "Iterum Therapeutics plc",
        "long_name": "Iterum Therapeutics plc",
        "summary": "Iterum Therapeutics plc, a clinical-stage pharmaceutical company, engages in developing anti-infectives for multi-drug resistant pathogens in Ireland and the United States. It is developing sulopenem, a novel anti-infective compound with oral and IV formulations that is in Phase III clinical trials for the treatment of uncomplicated urinary tract infections, complicated urinary tract infections, and complicated intra-abdominal infections. The company was founded in 2015 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.iterumtx.com",
        "market_cap": "Small Cap"
    },
    "J7Z.F": {
        "short_name": "JAZZ PHARMACEUT. DL-,0001",
        "long_name": "Jazz Pharmaceuticals plc",
        "summary": "Jazz Pharmaceuticals plc, a biopharmaceutical company, identifies, develops and commercializes pharmaceutical products for various unmet medical needs in the United States, Europe, and internationally. The company has a portfolio of products and product candidates with a focus in the areas of neuroscience, including sleep medicine and movement disorders; and in oncology, including hematologic and solid tumors. Its lead marketed products include Xyrem, an oral solution for the treatment of cataplexy and excessive daytime sleepiness (EDS) in narcolepsy patients seven years of age and older; Sunosi for the treatment of EDS in patients with narcolepsy and obstructive sleep apnea; Erwinaze to treat acute lymphoblastic leukemia; Defitelio for the treatment of adult and pediatric patients with hepatic veno-occlusive disease; Vyxeos liposome for injection, a product for the treatment of adults with newly-diagnosed therapy-related acute myeloid leukemia; and Zepzelca for the treatment of adult patients with metastatic small cell lung cancer. The company also offers Xywav, an oxybate product candidate, to treat EDS and cataplexy with narcolepsy and idiopathic hypersomnia; JZP-324, a low sodium oxybate formulation with the potential to provide a clinically meaningful option for narcolepsy patients; JZP-385, a T-type calcium channel modulator, for the treatment of essential tremor; JZP-458, a recombinant Erwinia asparaginase, for use as a component of a multi-agent chemotherapeutic regimen in the treatment of pediatric and adult patients; and JZP-150 for treatment of post-traumatic stress disorder. Jazz Pharmaceuticals plc has licensing and collaboration agreements with ImmunoGen, Inc.; Codiak BioSciences, Inc.; Pfenex, Inc.; XL-protein GmbH; and Redx Pharma plc . The company was founded in 2003 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.jazzpharma.com",
        "market_cap": "Mid Cap"
    },
    "JAZZ": {
        "short_name": "Jazz Pharmaceuticals plc",
        "long_name": "Jazz Pharmaceuticals plc",
        "summary": "Jazz Pharmaceuticals plc, a biopharmaceutical company, identifies, develops and commercializes pharmaceutical products for various unmet medical needs in the United States, Europe, and internationally. The company has a portfolio of products and product candidates with a focus in the areas of neuroscience, including sleep medicine and movement disorders; and in oncology, including hematologic and solid tumors. Its lead marketed products include Xyrem, an oral solution for the treatment of cataplexy and excessive daytime sleepiness (EDS) in narcolepsy patients seven years of age and older; Sunosi for the treatment of EDS in patients with narcolepsy and obstructive sleep apnea; Erwinaze to treat acute lymphoblastic leukemia; Defitelio for the treatment of adult and pediatric patients with hepatic veno-occlusive disease; Vyxeos liposome for injection, a product for the treatment of adults with newly-diagnosed therapy-related acute myeloid leukemia; and Zepzelca for the treatment of adult patients with metastatic small cell lung cancer. The company also offers Xywav, an oxybate product candidate, to treat EDS and cataplexy with narcolepsy and idiopathic hypersomnia; JZP-324, a low sodium oxybate formulation with the potential to provide a clinically meaningful option for narcolepsy patients; JZP-385, a T-type calcium channel modulator, for the treatment of essential tremor; JZP-458, a recombinant Erwinia asparaginase, for use as a component of a multi-agent chemotherapeutic regimen in the treatment of pediatric and adult patients; and JZP-150 for treatment of post-traumatic stress disorder. Jazz Pharmaceuticals plc has licensing and collaboration agreements with ImmunoGen, Inc.; Codiak BioSciences, Inc.; Pfenex, Inc.; XL-protein GmbH; and Redx Pharma plc . The company was founded in 2003 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.jazzpharma.com",
        "market_cap": "Mid Cap"
    },
    "KSI.V": {
        "short_name": "KNEAT.COM INC",
        "long_name": "kneat.com, inc.",
        "summary": "kneat.com, inc. designs, develops, and supplies software for data and document management within regulated environments in the United States, Ireland, Canada, internationally. The company offers Kneat Gx platform, a configurable commercial off-the-shelf application focused on validation lifecycle management and testing for biotechnology, pharmaceutical, and medical device manufacturing industries. Its platform is used in instrument, method, utility and facility, process, equipment, computer system, cold chain, and cleaning validation, as well commissioning and qualification, and electronic logbook management. It also provides software-related services, including training, installation, upgradation, consulting, and maintenance, as well as process mapping, project management, and other services. The company is headquartered in Limerick, Ireland.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Ireland",
        "state": null,
        "city": "Limerick",
        "zipcode": "V94 KW28",
        "website": "http://www.kneat.com",
        "market_cap": "Small Cap"
    },
    "LENSF": {
        "short_name": "PRESBIA PLC",
        "long_name": "Presbia PLC",
        "summary": "Presbia PLC, an ophthalmic device company, develops and markets optical lens implants for treating presbyopia. The company provides the refractive lens for patient surgeries, as well as accessories for procedures. It primarily operates in the United States, South Korea, Australia, Italy, the Netherlands, Ireland, Canada, and Germany. The company was founded in 2014 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "18",
        "website": "http://www.presbia.com",
        "market_cap": "Small Cap"
    },
    "MDT.BA": {
        "short_name": "MEDTRONIC PLC",
        "long_name": "Medtronic plc",
        "summary": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "currency": "ARS",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.medtronic.com",
        "market_cap": "Large Cap"
    },
    "MDT": {
        "short_name": "Medtronic plc.",
        "long_name": "Medtronic plc",
        "summary": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.medtronic.com",
        "market_cap": "Large Cap"
    },
    "MDTC34.SA": {
        "short_name": "MEDTRONIC   DRN",
        "long_name": "Medtronic plc",
        "summary": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "currency": "BRL",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.medtronic.com",
        "market_cap": "Large Cap"
    },
    "MDTN.MX": {
        "short_name": "MEDTRONIC PLC",
        "long_name": "Medtronic plc",
        "summary": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.medtronic.com",
        "market_cap": "Large Cap"
    },
    "MLC.IR": {
        "short_name": "MALIN CORP. PLC",
        "long_name": "Malin Corporation plc",
        "summary": "Malin Corporation plc, through its subsidiaries, operates in the life sciences industry in Spain, rest of European Union, and internationally. It offers life-saving cell and gene therapies for patients with high unmet medical need; medicines to address unmet needs in cancer, infection, and autoimmune diseases; and treatment of recurrent vulvovaginal candidiasis, an unmet need in women's health and onychomycosis. The company also develops, manufactures, and markets injectable medications for hospital and other healthcare provider; provides drugs for protein misfolding diseases. In addition, it focuses on the therapeutics areas of autoimmune and inflammatory disease, immuno-oncology, haematology, and infectious diseases; and platform to distinguish disease-driving bacteria from the intestinal microbiota. Further, the company provides company secretarial services. Malin Corporation plc was incorporated in 2014 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D02 FK02",
        "website": "http://www.malinplc.com",
        "market_cap": "Small Cap"
    },
    "MNKKQ": {
        "short_name": "Mallinckrodt plc",
        "long_name": "Mallinckrodt plc",
        "summary": "Mallinckrodt plc develops, manufactures, markets, and distributes specialty pharmaceutical products and therapies in the United States, Europe, the Middle East, Africa, and internationally. It operates in two segments, Specialty Brands and Specialty Generics. The company markets branded pharmaceutical products for autoimmune and rare diseases in the areas of neurology, rheumatology, nephrology, ophthalmology, and pulmonology; and immunotherapy and neonatal respiratory critical care therapies, as well as analgesics and gastrointestinal products. It offers Acthar Gel, an injectable drug for rheumatoid arthritis, multiple sclerosis, infantile spasms, systemic lupus erythematosus, polymyositis, and others; INOmax, a vasodilator to enhance oxygenation and reduce the need for extracorporeal membrane oxygenation; Ofirmev, an acetaminophen injection; Therakos photopheresis, an immunotherapy treatment platform; and Amitiza for constipation. The company is also developing Terlipressin for the treatment of hepatorenal syndrome; StrataGraft, which is in Phase III and II clinical development for the treatment of burns; MNK-6105 and MNK-6106, an ammonia scavenger for the treatment of hepatic encephalopathy, a neuropsychiatric syndrome associated with hyperammonemia; and SLN500, a ribonucleic acid technology therapy. In addition, it offers specialty generic drugs and active pharmaceutical ingredients. The company markets its branded products to physicians, pharmacists, pharmacy buyers, hospital procurement departments, ambulatory surgical centers, and specialty pharmacies. Mallinckrodt plc has collaboration with Silence Therapeutics plc for the development and commercialization of ribonucleic acid interference drug targets. The company was founded in 1867 and is based in Dublin, Ireland. On October 12, 2020, Mallinckrodt plc, along with its affiliates, filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the District of Delaware.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "15",
        "website": "http://www.mallinckrodt.com",
        "market_cap": "Small Cap"
    },
    "NBRV": {
        "short_name": "Nabriva Therapeutics plc",
        "long_name": "Nabriva Therapeutics plc",
        "summary": "Nabriva Therapeutics plc, a biopharmaceutical company, engages in the development and commercialization of novel anti-infective agents to treat serious infections. The company's product includes XENLETA, a semi-synthetic pleuromutilin antibiotic for the treatment of community-acquired bacterial pneumonia; and SIVEXTRO, an oxazolidinone-class antibacterial for the treatment of acute bacterial skin and skin structure infection (ABSSSI). It also develops XENLETA that is in Phase I clinical trial for the treatment of pediatric infections, as well as sexually transmitted infections, cystic fibrosis, ABSSSI, ventilator-associated bacterial pneumonia, hospital-acquired bacterial pneumonia, osteomyelitis, and prosthetic joint infections. In addition, the company develops CONTEPO, an epoxide antibiotic for use in treating complicated urinary tract infections, as well as is in Phase I clinical trial for peri-operative prophylaxis. The company was formerly known as Nabriva Therapeutics Forschungs GmbH and changed its name to Nabriva Therapeutics plc in 2007. Nabriva Therapeutics plc was incorporated in 2005 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "1",
        "website": "http://www.nabriva.com",
        "market_cap": "Small Cap"
    },
    "NTY0.F": {
        "short_name": "NABRIVA THERAPEUT. DL-,01",
        "long_name": "Nabriva Therapeutics plc",
        "summary": "Nabriva Therapeutics plc, a biopharmaceutical company, engages in the development and commercialization of novel anti-infective agents to treat serious infections. The company's product includes XENLETA, a semi-synthetic pleuromutilin antibiotic for the treatment of community-acquired bacterial pneumonia; and SIVEXTRO, an oxazolidinone-class antibacterial for the treatment of acute bacterial skin and skin structure infection (ABSSSI). It also develops XENLETA that is in Phase I clinical trial for the treatment of pediatric infections, as well as sexually transmitted infections, cystic fibrosis, ABSSSI, ventilator-associated bacterial pneumonia, hospital-acquired bacterial pneumonia, osteomyelitis, and prosthetic joint infections. In addition, the company develops CONTEPO, an epoxide antibiotic for use in treating complicated urinary tract infections, as well as is in Phase I clinical trial for peri-operative prophylaxis. The company was formerly known as Nabriva Therapeutics Forschungs GmbH and changed its name to Nabriva Therapeutics plc in 2007. Nabriva Therapeutics plc was incorporated in 2005 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "1",
        "website": "http://www.nabriva.com",
        "market_cap": "Small Cap"
    },
    "ONE.AX": {
        "short_name": "ONEVIEW CDI 1:1",
        "long_name": "Oneview Healthcare PLC",
        "summary": "Oneview Healthcare PLC engages in the development and sale of software and related consultancy services for the healthcare and aged care sectors in Ireland, rest of Europe, the United States, Australia, Asia, and the Middle East and North Africa. The company's platform allows caregivers to make real-time care decisions; enhance care coordination and workflows; and provides patients, seniors, and families to participants in their care. It serves hospitals and healthcare providers. Oneview Healthcare PLC was incorporated in 2012 and is headquartered in Dublin, Ireland.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "A94 H2X4",
        "website": "http://www.oneviewhealthcare.com",
        "market_cap": "Small Cap"
    },
    "ONVVF": {
        "short_name": "ONEVIEW HEALTHCARE PLC",
        "long_name": "Oneview Healthcare PLC",
        "summary": "Oneview Healthcare PLC engages in the development and sale of software and related consultancy services for the healthcare and aged care sectors in Ireland, rest of Europe, the United States, Australia, Asia, and the Middle East and North Africa. The company's platform allows caregivers to make real-time care decisions; enhance care coordination and workflows; and provides patients, seniors, and families to participants in their care. It serves hospitals and healthcare providers. Oneview Healthcare PLC was incorporated in 2012 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "A94 H2X4",
        "website": "http://www.oneviewhealthcare.com",
        "market_cap": "Small Cap"
    },
    "OVB.L": {
        "short_name": "OVOCA BIO PLC EUR0.125 (CDI)",
        "long_name": "Ovoca Bio plc",
        "summary": "Ovoca Bio plc, a clinical-stage biopharmaceutical company, engages in the development and commercialization of novel product candidates for the treatment of female sexual dysfunctions. It is developing BP-101, a medicinal treatment for premenopausal women with hypoactive sexual desire disorder. The company was formerly known as Ovoca Gold plc and changed its name to Ovoca Bio plc in July 2018. Ovoca Bio plc was founded in 1985 and is based in Dublin, Ireland.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://ovocabio.com",
        "market_cap": "Small Cap"
    },
    "OVXA.IR": {
        "short_name": "OVOCA BIO PLC",
        "long_name": "Ovoca Bio plc",
        "summary": "Ovoca Bio plc, a clinical-stage biopharmaceutical company, engages in the development and commercialization of novel product candidates for the treatment of female sexual dysfunctions. It is developing BP-101, a medicinal treatment for premenopausal women with hypoactive sexual desire disorder. The company was formerly known as Ovoca Gold plc and changed its name to Ovoca Bio plc in July 2018. Ovoca Bio plc was founded in 1985 and is based in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://ovocabio.com",
        "market_cap": "Small Cap"
    },
    "P1RG34.SA": {
        "short_name": "PERRIGO CO PDRN",
        "long_name": "Perrigo Company plc",
        "summary": "Perrigo Company plc provides over-the-counter (OTC) health and wellness solutions that enhance individual well-being by empowering consumers to prevent or treat conditions that can be self-managed. The company operates through Consumer Self-Care Americas, Consumer Self-Care International, and Prescription Pharmaceuticals segments. The Consumer Self-Care Americas segment focuses primarily on the development, manufacture, marketing, and sale of store brand, self-care products in categories, including upper respiratory, pain and sleep-aids, digestive health, nutrition, vitamins, minerals and supplements, healthy lifestyle, skincare and personal hygiene, and oral self-care in the United States, Mexico, Canada, and South America. The segment offers its products under the brand names of Prevacid 24HR, Good Sense, Zephrex D, ScarAway, Plackers, Rembrandt, Steripod, Firefly, REACH, and Dr. Fresh. The Consumer Self-Care International segment develops, manufactures, markets, and distributes consumer self-care brands through a network of pharmacies, wholesalers, drug and grocery store retailers, and para-pharmacies in approximately 30 countries, primarily in Europe. The Prescription Pharmaceuticals segment develops, manufactures, and markets a portfolio of generic prescription drugs, such as creams, ointments, lotions, gels, shampoos, foams, suppositories, sprays, liquids, suspensions, solutions, controlled substances, injectable, hormones, oral solid dosage forms, and oral liquid formulations in the United States, as well as pharmaceutical and diagnostic products in Israel. In addition, it offers contract manufacturing services. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.",
        "currency": "BRL",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.perrigo.com",
        "market_cap": "Large Cap"
    },
    "PIG.F": {
        "short_name": "PERRIGO CO. PLCEO -,001",
        "long_name": "Perrigo Company plc",
        "summary": "Perrigo Company plc provides over-the-counter (OTC) health and wellness solutions that enhance individual well-being by empowering consumers to prevent or treat conditions that can be self-managed. The company operates through Consumer Self-Care Americas, Consumer Self-Care International, and Prescription Pharmaceuticals segments. The Consumer Self-Care Americas segment focuses primarily on the development, manufacture, marketing, and sale of store brand, self-care products in categories, including upper respiratory, pain and sleep-aids, digestive health, nutrition, vitamins, minerals and supplements, healthy lifestyle, skincare and personal hygiene, and oral self-care in the United States, Mexico, Canada, and South America. The segment offers its products under the brand names of Prevacid 24HR, Good Sense, Zephrex D, ScarAway, Plackers, Rembrandt, Steripod, Firefly, REACH, and Dr. Fresh. The Consumer Self-Care International segment develops, manufactures, markets, and distributes consumer self-care brands through a network of pharmacies, wholesalers, drug and grocery store retailers, and para-pharmacies in approximately 30 countries, primarily in Europe. The Prescription Pharmaceuticals segment develops, manufactures, and markets a portfolio of generic prescription drugs, such as creams, ointments, lotions, gels, shampoos, foams, suppositories, sprays, liquids, suspensions, solutions, controlled substances, injectable, hormones, oral solid dosage forms, and oral liquid formulations in the United States, as well as pharmaceutical and diagnostic products in Israel. In addition, it offers contract manufacturing services. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.perrigo.com",
        "market_cap": "Mid Cap"
    },
    "PRGO": {
        "short_name": "Perrigo Company plc",
        "long_name": "Perrigo Company plc",
        "summary": "Perrigo Company plc provides over-the-counter (OTC) health and wellness solutions that enhance individual well-being by empowering consumers to prevent or treat conditions that can be self-managed. The company operates through Consumer Self-Care Americas, Consumer Self-Care International, and Prescription Pharmaceuticals segments. The Consumer Self-Care Americas segment focuses primarily on the development, manufacture, marketing, and sale of store brand, self-care products in categories, including upper respiratory, pain and sleep-aids, digestive health, nutrition, vitamins, minerals and supplements, healthy lifestyle, skincare and personal hygiene, and oral self-care in the United States, Mexico, Canada, and South America. The segment offers its products under the brand names of Prevacid 24HR, Good Sense, Zephrex D, ScarAway, Plackers, Rembrandt, Steripod, Firefly, REACH, and Dr. Fresh. The Consumer Self-Care International segment develops, manufactures, markets, and distributes consumer self-care brands through a network of pharmacies, wholesalers, drug and grocery store retailers, and para-pharmacies in approximately 30 countries, primarily in Europe. The Prescription Pharmaceuticals segment develops, manufactures, and markets a portfolio of generic prescription drugs, such as creams, ointments, lotions, gels, shampoos, foams, suppositories, sprays, liquids, suspensions, solutions, controlled substances, injectable, hormones, oral solid dosage forms, and oral liquid formulations in the United States, as well as pharmaceutical and diagnostic products in Israel. In addition, it offers contract manufacturing services. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.perrigo.com",
        "market_cap": "Mid Cap"
    },
    "PRGO.TA": {
        "short_name": "PERRIGO CO PLC",
        "long_name": "Perrigo Company plc",
        "summary": "Perrigo Company plc provides over-the-counter (OTC) health and wellness solutions that enhance individual well-being by empowering consumers to prevent or treat conditions that can be self-managed. The company operates through Consumer Self-Care Americas, Consumer Self-Care International, and Prescription Pharmaceuticals segments. The Consumer Self-Care Americas segment focuses primarily on the development, manufacture, marketing, and sale of store brand, self-care products in categories, including upper respiratory, pain and sleep-aids, digestive health, nutrition, vitamins, minerals and supplements, healthy lifestyle, skincare and personal hygiene, and oral self-care in the United States, Mexico, Canada, and South America. The segment offers its products under the brand names of Prevacid 24HR, Good Sense, Zephrex D, ScarAway, Plackers, Rembrandt, Steripod, Firefly, REACH, and Dr. Fresh. The Consumer Self-Care International segment develops, manufactures, markets, and distributes consumer self-care brands through a network of pharmacies, wholesalers, drug and grocery store retailers, and para-pharmacies in approximately 30 countries, primarily in Europe. The Prescription Pharmaceuticals segment develops, manufactures, and markets a portfolio of generic prescription drugs, such as creams, ointments, lotions, gels, shampoos, foams, suppositories, sprays, liquids, suspensions, solutions, controlled substances, injectable, hormones, oral solid dosage forms, and oral liquid formulations in the United States, as well as pharmaceutical and diagnostic products in Israel. In addition, it offers contract manufacturing services. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.perrigo.com",
        "market_cap": "Large Cap"
    },
    "PRTA": {
        "short_name": "Prothena Corporation plc",
        "long_name": "Prothena Corporation plc",
        "summary": "Prothena Corporation plc, a late-stage clinical company, focuses on discovery and development of novel therapies for life-threatening diseases in the United States. The company is involved in developing PRX002/RG7935 that is in Phase 2 clinical trial for treating Parkinson's disease and other related synucleinopathies; and PRX004, an antibody that is in Phase 1 clinical trial for the treatment of ATTR amyloidosis. Its discovery-stage programs include Tau for treating Alzheimer's disease, frontotemporal dementia, progressive supranuclear palsy, chronic traumatic encephalopathy, and other tauopathies; AÃ\u009f, or Amyloid Beta, a protein for the treatment of Alzheimer's disease; TDP-43 for amyotrophic lateral sclerosis and frontotemporal dementia; and other products for neurodegenerative diseases. The company has a license, development, and commercialization agreement with F. Hoffmann-La Roche Ltd. and Hoffmann-La Roche Inc. to develop and commercialize antibodies that target alpha-synuclein; and a collaboration agreement with Bristol-Myers Squibb to develop antibodies. Prothena Corporation plc was founded in 2012 and is based in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "2",
        "website": "http://www.prothena.com",
        "market_cap": "Small Cap"
    },
    "STE": {
        "short_name": "STERIS plc (Ireland)",
        "long_name": "STERIS plc",
        "summary": "STERIS plc provides infection prevention and other procedural products and services worldwide. It operates in four segments: Healthcare Products, Healthcare Specialty Services, Life Sciences, and Applied Sterilization Technologies. The Healthcare Products segment offers cleaning chemistries and sterility assurance products; accessories for gastrointestinal (GI) procedures, washers, sterilizers, and other pieces of capital equipment for the operation of a sterile processing department; and equipment used directly in the operating room, including surgical tables, lights, equipment management services, and connectivity solutions. It also provides capital equipment installation, maintenance, upgradation, repair, and troubleshooting services. This segment offers its products and services to acute care hospitals, ambulatory surgery centers, and GI clinics. The Healthcare Specialty Services segment provides solutions and managed services, such as instrument and endoscope repair and maintenance solutions; custom process improvement consulting services; and outsourced instrument sterile processing services to acute care hospitals and other healthcare settings. The Life Sciences segment offers formulated cleaning chemistries, barrier and sterility assurance products, steam and vaporized hydrogen peroxide sterilizers, and washer disinfectors. The Applied Sterilization Technologies segment provides contract sterilization and testing services for medical device and pharmaceutical manufacturers through a network of approximately 50 contract sterilization and laboratory facilities. The company was founded in 1985 and is based in Dublin, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D02 R296",
        "website": "http://www.steris.com",
        "market_cap": "Large Cap"
    },
    "TRBA.F": {
        "short_name": "TRINITY BIOTEC.ADR NEW A",
        "long_name": "Trinity Biotech plc",
        "summary": "Trinity Biotech plc acquires, develops, manufactures, and markets medical diagnostic products for the clinical laboratory and point-of-care (POC) segments of the diagnostic market in the United States, Africa, Asia, and Europe. The company offers clinical laboratory products, including diagnostic tests and instrumentation, which detect infectious diseases, such as lyme disease; sexually transmitted diseases consisting syphilis and herpes; and epstein barr, measles, mumps, toxoplasmosis, cytomegalovirus, rubella, varicella and other viral pathogens, as well as products for the in-vitro diagnostic testing for haemoglobin A1c used in the monitoring and diagnosis of diabetes, and identifying those who are at a risk of developing diabetes. It also develops, manufactures, and distributes products in the immunofluorescence assay, enzyme-linked immunosorbent, western blot, and line immunoassay formats; and provides reagent products, such as ACE, bile acids, lactate, oxalate, and glucose-6-phosphate dehydrogenase for diagnosis of liver and kidney diseases, as well as haemolytic anaemia. In addition, the company sells raw materials to the life sciences industry and research institutes. The company sells its products through its direct sales force; and a network of independent distributors and strategic partners. Its customers include public health facilities, hospitals, and other outreach facilities, as well as clinical and reference laboratories. Trinity Biotech plc was founded in 1992 and is headquartered in Bray, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Bray",
        "zipcode": null,
        "website": "http://www.trinitybiotech.com",
        "market_cap": "Small Cap"
    },
    "TRIB": {
        "short_name": "Trinity Biotech plc",
        "long_name": "Trinity Biotech plc",
        "summary": "Trinity Biotech plc acquires, develops, manufactures, and markets medical diagnostic products for the clinical laboratory and point-of-care (POC) segments of the diagnostic market in the United States, Africa, Asia, and Europe. The company offers clinical laboratory products, including diagnostic tests and instrumentation, which detect infectious diseases, such as lyme disease; sexually transmitted diseases consisting syphilis and herpes; SARS-CoV-2; and epstein barr, measles, mumps, toxoplasmosis, cytomegalovirus, rubella, varicella and other viral pathogens, as well as products for the in-vitro diagnostic testing for haemoglobin A1c used in the monitoring and diagnosis of diabetes, and identifying those who are at a risk of developing diabetes. It also develops, manufactures, and distributes products in the immunofluorescence assay, enzyme-linked immunosorbent, western blot, and line immunoassay formats; and provides reagent products, such as ACE, bile acids, lactate, oxalate, and glucose-6-phosphate dehydrogenase for diagnosis of liver and kidney diseases, as well as haemolytic anaemia. In addition, the company sells raw materials to the life sciences industry and research institutes. The company sells its products through its direct sales force; and a network of independent distributors and strategic partners. Its customers include public health facilities, hospitals, and other outreach facilities, as well as clinical and reference laboratories. Trinity Biotech plc was incorporated in 1992 and is headquartered in Bray, Ireland.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Ireland",
        "state": null,
        "city": "Bray",
        "zipcode": null,
        "website": "http://www.trinitybiotech.com",
        "market_cap": "Small Cap"
    },
    "UDG.L": {
        "short_name": "UDG HEALTHCARE PUBLIC LIMITED C",
        "long_name": "UDG Healthcare plc",
        "summary": "UDG Healthcare plc, together with its subsidiaries, provides advisory, communication, commercial, clinical, and packaging services in the Republic of Ireland, the United Kingdom, North America, and internationally. The company operates in two segments, Ashfield and Sharp. The Ashfield segment offers commercialization services for the pharmaceutical and healthcare industry in the areas of advisory, communications, and commercial and clinical services. This segment supports healthcare professionals and patients at various stages of the product life cycle; and provides field and contact center sales teams, healthcare communications, patient support, audit, advisory, medical information, and event management services to approximately 300 healthcare companies. The Sharp segment provides contract and clinical trial packaging services for the pharmaceutical and biotechnology industries; serialization solutions; and clinical IRT services. The company was formerly known as United Drug plc and changed its name to UDG Healthcare plc in August 2013. UDG Healthcare plc was founded in 1948 and is heaquartered in Dublin, the Republic of Ireland.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "24",
        "website": "http://www.udghealthcare.com",
        "market_cap": "Mid Cap"
    },
    "UN6A.F": {
        "short_name": "UDG HEALTHCARE EO -,05",
        "long_name": "UDG Healthcare plc",
        "summary": "UDG Healthcare plc, together with its subsidiaries, provides advisory, communication, commercial, clinical, and packaging services in the Republic of Ireland, the United Kingdom, North America, and internationally. The company operates in two segments, Ashfield and Sharp. The Ashfield segment offers commercialization services for the pharmaceutical and healthcare industry in the areas of advisory, communications, and commercial and clinical services. This segment supports healthcare professionals and patients at various stages of the product life cycle; and provides field and contact center sales teams, healthcare communications, patient support, audit, advisory, medical information, and event management services to approximately 300 healthcare companies. The Sharp segment provides contract and clinical trial packaging services for the pharmaceutical and biotechnology industries; serialization solutions; and clinical IRT services. The company was formerly known as United Drug plc and changed its name to UDG Healthcare plc in August 2013. UDG Healthcare plc was founded in 1948 and is heaquartered in Dublin, the Republic of Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "24",
        "website": "http://www.udghealthcare.com",
        "market_cap": "Mid Cap"
    },
    "UPR.IR": {
        "short_name": "UNIPHAR PLC",
        "long_name": "Uniphar plc",
        "summary": "Uniphar plc operates as a diversified healthcare services company in the Republic of Ireland, the United Kingdom, and internationally. The company operates through three divisions: Commercial & Clinical, Product Access, and Supply Chain & Retail. The Commercial & Clinical division offers outsourced sales, marketing, and multichannel account management services to pharmaco-medical manufacturers; and distribution and support services to medical device manufacturers. The Product Access division provides on demand services, which provides access to pharmaco-medical products and treatments by developing valuable relationships and interactions between manufacturers and other healthcare stakeholders; and exclusive access services that offers bespoke distribution partnerships to pharmaceutical partners for key brands. The Supply Chain & Retail division engages in pre-wholesale and wholesale distribution of pharmaceutical, healthcare, and animal health products to pharmacies, hospitals, and veterinary surgeons; operates a network of pharmacies under the Life, Allcare, and Hickey's brands. It also offers pharmacy support, pharmaceutical supply chain, specialist nursing and infusion, data intelligence and consultancy services, and online pharmacy and product fostering services, as well as data solutions for pharma industry. Uniphar plc was founded in 1967 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D24 V06K",
        "website": "http://www.uniphar.ie",
        "market_cap": "Small Cap"
    },
    "UPR.L": {
        "short_name": "UNIPHAR PLC ORD EUR0.08 (CDI)",
        "long_name": "Uniphar plc",
        "summary": "Uniphar plc operates as a diversified healthcare services company in the Republic of Ireland, the United Kingdom, and internationally. The company operates through three divisions: Commercial & Clinical, Product Access, and Supply Chain & Retail. The Commercial & Clinical division offers outsourced sales, marketing, and multichannel account management services to pharmaco-medical manufacturers; and distribution and support services to medical device manufacturers. The Product Access division provides on demand services, which provides access to pharmaco-medical products and treatments by developing valuable relationships and interactions between manufacturers and other healthcare stakeholders; and exclusive access services that offers bespoke distribution partnerships to pharmaceutical partners for key brands. The Supply Chain & Retail division engages in pre-wholesale and wholesale distribution of pharmaceutical, healthcare, and animal health products to pharmacies, hospitals, and veterinary surgeons; operates a network of pharmacies under the Life, Allcare, and Hickey's brands. It also offers pharmacy support, pharmaceutical supply chain, specialist nursing and infusion, data intelligence and consultancy services, and online pharmacy and product fostering services, as well as data solutions for pharma industry. Uniphar plc was founded in 1967 and is headquartered in Dublin, Ireland.",
        "currency": "GBp",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "D24 V06K",
        "website": "http://www.uniphar.ie",
        "market_cap": "Small Cap"
    }
}