{"COPN.SW": {"short_name": "COSMO PHARM N", "long_name": "Cosmo Pharmaceuticals N.V.", "summary": "Cosmo Pharmaceuticals N.V., a specialty pharmaceutical company, develops, manufactures, and distributes products for gastroenterology and endoscopy worldwide. The company offers Lialda/Mezavant/Mesavancol and UCERIS/Cortiment, an oral tablet formulation for remission in active, mild to moderate ulcerative colitis; Aemcolo, a pharmaceutical product used for the treatment of traveler's diarrhea, uncomplicated acute diverticulitis, minimal hepatic encephalopathy, small intestine bacterial overgrowth, as well as for treatment of inflammatory bowel diseases; and Eleview, a submucosal injectable composition for extracting adenomas and polyps. It also provides Remimazolam (ByFavo), an ultra-short-acting sedative/anesthetic; Qolotag, a medical device that enhances the visualisation of lesions during sigmoidoscopies; Methylene Blue MMX, diagnostic drug to enhance pre-cancerous and cancerous detection of colorectal lesions during colonoscopy; GI Genius, a system that uses artificial intelligence to detect colorectal polyps; and CB-03-10, an oral androgen receptor antagonist for treatment against solid tumors. The company has a strategic partnership with RedHill Biopharma Ltd. to co-develop a novel therapy for the eradication of H. pylori infection. Cosmo Pharmaceuticals N.V. was founded in 1997 and is headquartered in Dublin, Ireland.", "currency": "CHF", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "EBS", "market": "ch_market", "country": "Ireland", "city": "Dublin"}, "HPR.F": {"short_name": "HORIZON THERAP.PLC DL-,01", "long_name": "Horizon Therapeutics Public Limited Company", "summary": "Horizon Therapeutics Public Limited Company, a biopharmaceutical company, focuses on researching, developing, and commercializing of medicines that address unmet treatment needs for rare and rheumatic diseases in the United States and internationally. Its orphan and rheumatology marketed medicines include KRYSTEXXA, a medicine for the treatment of uncontrolled gout; RAVICTI for use as a nitrogen-binding agent for chronic management of adult and pediatric patients; PROCYSBI for nephropathic cystinosis, a rare and life-threatening metabolic disorder; ACTIMMUNE for chronic granulomatous disease; RAYOS for the treatment of rheumatoid arthritis (RA), polymyalgia rheumatic, systemic lupus erythematosus, and various other indications; BUPHENYL tablets for oral administration and BUPHENYL powder for oral, nasogastric, or gastrostomy tube administration; and QUINSAIR, a formulation of the antibiotic drug levofloxacin for the management of chronic pulmonary infections due to Pseudomonas aeruginosa in adult patients with cystic fibrosis. The company also offers PENNSAID 2% that is indicated for the treatment of pain of osteoarthritis (OA) of the knees; DUEXIS for the relief of signs and symptoms of RA and OA, and to decrease the risk of developing upper-GI ulcers; and VIMOVO for the relief of signs and symptoms of OA, RA, and ankylosing spondylitis to decrease the risk of developing gastric ulcers in patients at risk of developing NSAID-associated gastric ulcers. It has collaboration agreements with Lupus Research and HemoShear Therapeutics, LLC. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland.", "currency": "EUR", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "FRA", "market": "dr_market", "country": "Ireland", "city": "Dublin"}, "HZNP": {"short_name": "Horizon Therapeutics Public Lim", "long_name": "Horizon Therapeutics Public Limited Company", "summary": "Horizon Therapeutics Public Limited Company, a biopharmaceutical company, focuses on researching, developing, and commercializing of medicines that address unmet treatment needs for rare and rheumatic diseases in the United States and internationally. Its orphan and rheumatology marketed medicines include KRYSTEXXA, a medicine for the treatment of uncontrolled gout; RAVICTI for use as a nitrogen-binding agent for chronic management of adult and pediatric patients; PROCYSBI for nephropathic cystinosis, a rare and life-threatening metabolic disorder; ACTIMMUNE for chronic granulomatous disease; RAYOS for the treatment of rheumatoid arthritis (RA), polymyalgia rheumatic, systemic lupus erythematosus, and various other indications; BUPHENYL tablets for oral administration and BUPHENYL powder for oral, nasogastric, or gastrostomy tube administration; and QUINSAIR, a formulation of the antibiotic drug levofloxacin for the management of chronic pulmonary infections due to Pseudomonas aeruginosa in adult patients with cystic fibrosis. The company also offers PENNSAID 2% that is indicated for the treatment of pain of osteoarthritis (OA) of the knees; DUEXIS for the relief of signs and symptoms of RA and OA, and to decrease the risk of developing upper-GI ulcers; and VIMOVO for the relief of signs and symptoms of OA, RA, and ankylosing spondylitis to decrease the risk of developing gastric ulcers in patients at risk of developing NSAID-associated gastric ulcers. It has collaboration agreements with Lupus Research and HemoShear Therapeutics, LLC. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland.", "currency": "USD", "sector": "Healthcare", "industry": "Drug Manufacturers—General", "exchange": "NMS", "market": "us_market", "country": "Ireland", "city": "Dublin"}}