{
  "BMA.OL": {
    "city": "Vennesla",
    "country": "Norway",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Building Products & Equipment",
    "long_name": "Byggma ASA",
    "market": "no_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BYGGMA ASA",
    "state": null,
    "summary": "Byggma ASA manufactures and supplies building materials to builders and retailers in Norway and internationally. It offers pre-painted ceilings and wall panels under the Huntonit brand name; I-beams for use in ceilings, walls, and floors in wood-based buildings under the brand name of Masonite; and particle boards, boards, and structural panels for use in buildings, interior ceilings, and wall panels under the Forestia brand name. The company also provides home lighting products under the Scan Lamps brand name; doors and windows for new buildings, extensions, or rehabilitation under the brand name of Uldal; a range of lamp and lighting products under the Aneta brand name; and develops, manufactures and distributes MDF panels for walls, ceilings, bathrooms, and kitchens under the brand name of Smartpanel., as well as supplies OSB plywood and building boards. The company is headquartered in Vennesla, Norway.",
    "website": "http://www.byggma.no",
    "zipcode": "4701"
  },
  "BOR.OL": {
    "city": "Skien",
    "country": "Norway",
    "currency": "NOK",
    "exchange": "OSL",
    "industry": "Building Products & Equipment",
    "long_name": "Borgestad ASA",
    "market": "no_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "BORGESTAD ASA",
    "state": null,
    "summary": "Borgestad ASA develops, manufactures, distributes, and installs refractory products in Norway. The company also develops and manages real estate properties. Its properties include Agora Bytom, a shopping center with a gross area of 52,000 square meters and a rental area of approximately 30,000 square meters, as well as a parking garage with 820 parking spaces in Poland; and Borgestad Business Park, which has approximately 20,000 square meters of total rental area for warehouses, production, and offices. Borgestad ASA was founded in 1904 and is headquartered in Skien, Norway.",
    "website": "http://borgestad.no",
    "zipcode": "3712"
  }
}
