{
    "000100.KS": {
        "short_name": "Yuhan",
        "long_name": "Yuhan Corporation",
        "summary": "Yuhan Corporation, a pharmaceutical company, engages in the research, development, and production of active pharmaceutical products and intermediates in South Korea and internationally. It offers antivirals, antibiotics, antihistamines, antidiabetics, beta-lactamase inhibitors, CNS intermediates, and PEGylated compounds; Revanex, an acid pump antagonist for the treatment of peptic ulcers and gastritis-related mucosal injury; ETC products in the areas of cardiovascular, alimentary, genito-urinary, metabolic, respiratory and allergy, and neuro systems; anti-infective, anti-cancer, and hormone and other products; and analgesics, anti-rheumatics, and anesthetics. It also offers OTC products, including vitamins and minerals, hepatopathy drugs and tonics, respiratory system drugs, alimentary system drugs, dermatology and analgesics drugs, and others; and household and healthcare products, such as bleaches, detergents, pesticides, and oral care products. In addition, the company engages in dental business and offers implants, dental equipment/consumable, and dental care products. Additionally, the company manufactures and sells medical supplies for livestock, aquatic animals, and household pets.  Further, it provides contract manufacturing services. Yuhan Corporation was founded in 1926 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000105.KS": {
        "short_name": "Yuhan(1P)",
        "long_name": "Yuhan Corporation",
        "summary": "Yuhan Corporation, a pharmaceutical company, engages in the research, development, and production of active pharmaceutical products and intermediates in South Korea and internationally. It offers antivirals, antibiotics, antihistamines, antidiabetics, beta-lactamase inhibitors, CNS intermediates, and PEGylated compounds; Revanex, an acid pump antagonist for the treatment of peptic ulcers and gastritis-related mucosal injury; ETC products in the areas of cardiovascular, alimentary, genito-urinary, metabolic, respiratory and allergy, and neuro systems; anti-infective, anti-cancer, and hormone and other products; and analgesics, anti-rheumatics, and anesthetics. It also offers OTC products, including vitamins and minerals, hepatopathy drugs and tonics, respiratory system drugs, alimentary system drugs, dermatology and analgesics drugs, and others; and household and healthcare products, such as bleaches, detergents, pesticides, and oral care products. In addition, the company engages in dental business and offers implants, dental equipment/consumable, and dental care products. Additionally, the company manufactures and sells medical supplies for livestock, aquatic animals, and household pets.  Further, it provides contract manufacturing services. Yuhan Corporation was founded in 1926 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000220.KS": {
        "short_name": "YuyuPharma",
        "long_name": "Yuyu Pharma, Inc.",
        "summary": "Yuyu Pharma, Inc. develops and markets pharmaceutical products. The company offers various prescription drugs, including osteoporosis, brainbone metabolism-hypocalcemia improvement, cerebral and peripheral circulatory disturbance, tromboembolism, respiratory organ, hypertension, pulmonary tuberculosis therapy, arthrifuge, diabetic neuropathy therapy, eczematous dermatitis drugs, and other circulatory system drugs, as well as antibiotics and skeletal muscle relaxants. It also provides non-prescription drugs and health supplements. The company was formerly known as YuYu Inc. and changed its name to Yuyu Pharma, Inc. in May 2008. Yuyu Pharma, Inc. was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000225.KS": {
        "short_name": "YuyuPharma(1P)",
        "long_name": "Yuyu Pharma, Inc.",
        "summary": "Yuyu Pharma, Inc. develops and markets pharmaceutical products. The company offers various prescription drugs, including osteoporosis, brainbone metabolism-hypocalcemia improvement, cerebral and peripheral circulatory disturbance, tromboembolism, respiratory organ, hypertension, pulmonary tuberculosis therapy, arthrifuge, diabetic neuropathy therapy, eczematous dermatitis drugs, and other circulatory system drugs, as well as antibiotics and skeletal muscle relaxants. It also provides non-prescription drugs and health supplements. The company was formerly known as YuYu Inc. and changed its name to Yuyu Pharma, Inc. in May 2008. Yuyu Pharma, Inc. was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000227.KS": {
        "short_name": "YuyuPharma(2PB)",
        "long_name": "Yuyu Pharma, Inc.",
        "summary": "Yuyu Pharma, Inc. develops and markets pharmaceutical products. The company offers various prescription drugs, including osteoporosis, brainbone metabolism-hypocalcemia improvement, cerebral and peripheral circulatory disturbance, tromboembolism, respiratory organ, hypertension, pulmonary tuberculosis therapy, arthrifuge, diabetic neuropathy therapy, eczematous dermatitis drugs, and other circulatory system drugs, as well as antibiotics and skeletal muscle relaxants. It also provides non-prescription drugs and health supplements. The company was formerly known as YuYu Inc. and changed its name to Yuyu Pharma, Inc. in May 2008. Yuyu Pharma, Inc. was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000230.KS": {
        "short_name": "ILDONG HOLDINGS",
        "long_name": "Ildong Holdings Co., Ltd.",
        "summary": "Ildong Holdings Co., Ltd. develops, manufactures, and supplies pharmaceutical products in South Korea and internationally. It develops new drugs against resistant bacteria, malignant tumors, Alzheimer's disease, obesity, and ageing; and raw vitamins, probiotics, and antimicrobials, as well as offers Biovita, a lactobacillus product; and Aronamin, a multivitamin product. It also engages in the research and manufacture of health foods and ingredients, as well as offers hyaluronic acid for use in drugs, medical devices, and cosmetics; and various medical devices for beauty, cosmetic-surgery, and antiaging applications. In addition, the company distributes medical devices, quasi drugs, health supplements, food products, beverages, cosmetics, sanitary ware, and other healthcare products through online. Further, it offers beauty and cosmetic surgery services; and pharmaceutical SI consulting, system development and deployment, RFID and barcode systems, and other solutions, as well as engages in advertising business. The company was formerly known as Ildong Pharmaceutical Co., Ltd. and changed its name to Ildong Holdings Co., Ltd. in August 2016. Ildong Holdings Co., Ltd. was founded in 1941 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000520.KS": {
        "short_name": "SamilPharm",
        "long_name": "Samil Pharmaceutical Co.,Ltd",
        "summary": "Samil Pharmaceutical Co.,Ltd engages in the manufacture and sale of indispensable medicines in South Korea. It offers hepatic, gastrointestinal, vasodilator, antithrombotic, respiratory, skeletal muscle relaxants, circulatory, neurological, antibiotics, metabolic, antihistamines, immunosuppressive, hormone, anti-tumor, urinary, and ophthalmic drugs, as well as antipyretic, analgesic, and anti-inflammatory agents. The company also provides OTC products and sanitary aids. Samil Pharmaceutical Co.,Ltd was founded in 1947 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000640.KS": {
        "short_name": "Donga Socio Holdings",
        "long_name": "Dong-A Socio Holdings Co., Ltd.",
        "summary": "Dong-A Socio Holdings Co., Ltd. engages in the pharmaceutical business in South Korea and internationally. It offers DA-3801 (Gonadopin) for the treatment of controlled ovarian hyper-stimulation in ART and ovulation induction in anovulatory women; and DA-3031 (Dulastin) for the treatment of neutropenia. The company also develops DA-3880 that completed Phase I in European Union and Phase III in Japan for the treatment of anemia; DMB-3111, which completed Phase I in Japan and Phase III in European Union for the treatment of breast cancer; DMB-3113, a Phase I product for the treatment of rheumatoid arthritis; DA-3131 for the treatment of age-related macular degeneration; and DA-3115 for the treatment of psoriasis. Dong-A Socio Holdings Co., Ltd. was founded in 1932 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001630.KS": {
        "short_name": "CHONGKUNDANG HOLDINGS",
        "long_name": "Chong Kun Dang Holdings Corp.",
        "summary": "Chong Kun Dang Holdings Corp. manufactures and distributes pharmaceutical products in South Korea and internationally. The company was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002390.KS": {
        "short_name": "HANDOK",
        "long_name": "HANDOK Inc.",
        "summary": "Handok Inc. operates as an integrated pharmaceutical company. The company provides ETC and OTC drugs, medical devices, and in-vitro diagnostics instruments and devices. It focuses on various therapeutic areas, such as oncology, diabetes and metabolic disorders, CNS orphan diseases, eye disorders, and other disease areas. The company also offers healthcare products comprising food supplements under the NatureSet and Culturelle brands; food and beverages; and medical nutrition products. The company was formerly known as Handok Pharmaceuticals Co., Ltd and changed its name to Handok Inc. in July 2013. Handok Inc. was founded in 1954 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002620.KS": {
        "short_name": "JEIL PHARMA HOLDINGS",
        "long_name": "Jeil Pharma Holdings Inc",
        "summary": "Jeil Pharma Holdings Inc manufactures and sells ingredients of drugs, incrementally modified drugs, and generic drugs in South Korea. The company offers active pharmaceutical ingredients in the areas of antibiotics, gastrointestinal, cardiovascular, neuropsychiatry, oncology, endocrinology, urology, antiviral, and antihistamines, as well as patch products. It also provides finished dosage forms in the areas of anti-bacteria and anti-fungal, anti-virus, cardiovascular, endocrinology, neurology, gastrointestinal, urology, oncology, anti-histamine, rheumatology, respiratory, otolaryngological, heaptic, laxatives, and purgatives. The company exports its products to approximately 40 countries in the Association of Southeast Asian Nations, Central and South America, Africa, etc. Jeil Pharma Holdings Inc was founded in 1959 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002720.KS": {
        "short_name": "Kukje Pharma",
        "long_name": "Kukje Pharma Co., Ltd.",
        "summary": "Kukje Pharma Co., Ltd. engages in manufacturing, importing, exporting, selling, and distributing pharmaceutical products. The company offers pharmaceutical products, including ETC and OTC products, raw materials, intermediates, and side chain products, as well as cosmetics and health care products. Its products include cephalosporins, quinolones, tetracycline, aminoglycosides, macrolides, ophthalmic, antifungal and antiviral agents, ophthalmic agents, adrenal corticosteroids, CNS and osteoporotic agents, antihistamines, NSAIDS and other analgesics, gastrointestinal and cardiovascular agents, antidiabetics, genitourinary and respiratory agents, and other ETC products. The company was founded in 1959 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "003000.KS": {
        "short_name": "BukwangPharm",
        "long_name": "Bukwang Pharmaceutical Co., Ltd.",
        "summary": "Bukwang Pharmaceutical Co., Ltd. operates as a pharmaceutical company in South Korea and internationally. It manufactures oral solid dosage forms, injections, oral solutions, external-use solutions, and ointments. The company offers products in various therapeutic areas, including liver disease treatments, such as Levovir and Legalon; diabetic complication products comprising Dexid and Thioctacid; CNS disorder drugs consisting of Lonasen, Ixel, and Orfil; and respiratory disease treatments, which comprise Azeptin and Asima. It also provides OTC products; toothpastes, and hair and skin care goods; and nutritional supplements. In addition, the company offers products for antihistamines, hepatitis and gastrointestinal, sedative and antidote, anti-cancer, thyroid and osteoporosis, diabetes, obstetrics, urinogenital, cardiovascular, dermatology, obesity, pain relief, and muscle relaxant. Further, it provides products for bruises, skin and mucous membrane, rhinitis, cold symptoms, cough, phlegm and asthma, rheumatoid arthritis, osteoarthritis, pain caused by cold and fever, dysmenorrhea, NSAIDs, inflammation, joint inflammation, tinea pedis, infected wounds, dermatitis, antivirals-herpes, eczema, diarrhea, dyspepsia, sense of distension, anti-histamine, anti-ulcer, constipation, anemia, pregnant multivitamins, candidiasis, athlete's foot, onychomycosis, stomatitis, pimple, acne, physical fatigue, neuralgia, myalgia, and arthralgia. Additionally, the company offers medicines for period of lactation, rickets, night blindness, varicose vein, and sputum; and quasi drugs and medical devices, as well as health functional food. It also develops anti-diabetes compound with Melior Pharmaceuticals; and anti-cancer drugs with LSK BioPartners, as well as cell therapies using adult stem cells, as well as holds a license for a novel candidate to treat movement disorder in Parkinson's disease patients. The company was founded in 1960 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003060.KS": {
        "short_name": "Aprogen pharmaceuticals",
        "long_name": "Aprogen pharmaceuticals,Inc.",
        "summary": "Aprogen pharmaceuticals,Inc. manufactures and sells pharmaceutical products primarily in South Korea. It offers approximately 200 types of medicines, including ethical and over the counter drugs. The company offers its drugs for transfusion, digestive system, osteoarthritis, skeletal muscle relaxants, NSAIDs, osteoporosis, circulatory system, endocrine, respiratory system, urinary system, depilatory, antihistamines and antiallergics, obesity, brain function, neurologics, and male pattern hair loss. It also provides anti-biotic, anti-fungal, anti-viral, anti-ulcerant, anti-epliepsy products; external agents; anti-cancer drugs; amino-acid nutrient transfusion agents; and cosmetics. The company was formerly known as Schnell Biopharmaceuticals, Inc. and changed its name to Aprogen pharmaceuticals,Inc. in April 2017. Aprogen pharmaceuticals,Inc. was founded in 1960 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "003090.KS": {
        "short_name": "Daewoong",
        "long_name": "Daewoong Co., Ltd.",
        "summary": "Daewoong Co., Ltd., together with its subsidiaries, manufactures and sells pharmaceuticals. It also engages in the leasing of real estates. The company was formerly known as Daewoong Pharmaceutical Co., Ltd. and changed its name to Daewoong Co., Ltd. in 2002. Daewoong Co., Ltd. was founded in 1961 and is headquartered in Seongnam-si, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Hwaseong-si"
    },
    "003120.KS": {
        "short_name": "IlsungPharm",
        "long_name": "Ilsung Pharmaceuticals Co., Ltd.",
        "summary": "Ilsung Pharmaceuticals Co., Ltd. operates as a pharmaceutical company in South Korea. It offers antibiotics, analgesics, neuromuscular blocker, anesthetics, antipyretics, and cardiovascular system products. The company was founded in 1954 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003220.KS": {
        "short_name": "Daewonpharm",
        "long_name": "Daewon Pharmaceutical Co., Ltd.",
        "summary": "Daewon Pharmaceutical Co., Ltd., a pharmaceutical company, produces and sells medicine and medical supplies in South Korea. It offers various medicines for circulatory, respiratory, antibiotic, chemotherapy, and psychoneurosis uses. The company's principal products include Oramin-F Soft Cap, a multivitamin product; Pelubi Tablet, a NSAID product for pain relief; Freefol-MCT Inj., a microemulsion propofol for the anti-exogenous infectious bacteria; Megex-I Susp, a medicine that supplements subalimentation of cancer patients; Trigel Susp, a therapy for gastritis and duodenal ulcer; and Renamezin Cap, a spherical carbonaceous adsorbent for chronic kidney disease. It also exports its products to approximately 45 countries primarily in Asia, Central and South America, the Middle East, etc. The company was founded in 1958 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003520.KS": {
        "short_name": "YUNGJIN PHARM",
        "long_name": "Yungjin Pharm. Co., Ltd.",
        "summary": "Yungjin Pharm. Co., Ltd. operates as a pharmaceutical company in South Korea. It provides cephalosporin, general, and calcium APIs; antibiotic, central nervous system, cardiovascular, endocrine, respiratory, analgesic and anti-inflammatory, anti-histamine, anti-fungal, nutrition, and urinary formulations, as well as vitamins and supplements, and cosmetics; and tonic drinks. The company was founded in 1952 and is based in Seoul, South Korea. Yungjin Pharm. Co., Ltd. is a subsidiary of KT&G Corporation.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003850.KS": {
        "short_name": "BoryungPharm",
        "long_name": "Boryung Pharmaceutical Co., Ltd.",
        "summary": "Boryung Pharmaceutical Co., Ltd. researches and develops, produces, and sells pharmaceutical products in South Korea. The company offers cardiovascular products, antibiotics, anticancer products, amino acids and cosmetics, gastrointestinal products, and API's. It also exports its products to approximately 50 countries on 6 continents, including Japan, China, the Southeast Asia, the Middle East, Europe, South America, and Africa. The company was formerly known as Boryung Drugs Co., Ltd. and changed its name to Boryung Pharmaceutical Co., Ltd. in February 1966. Boryung Pharmaceutical Co., Ltd. was founded in 1963 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "004080.KS": {
        "short_name": "Shinhung",
        "long_name": "Shinhung Co., Ltd",
        "summary": "Shinhung Co., Ltd. manufactures and sells dental products and supplies in South Korea. Its products include implant systems; dental units, chairs, operatories, and implants; autoclaves and X-ray equipment; disposable needles; dental porcelain powder and laboratory products; dental alloys; cabinets, such as drawer cabinets, equipment cabinets, soap dispensers, sink cabinets, lateral panels, insert cabinets, and mobile cabinets; and other equipment, which include compressors and mixers. The company also offers loan services for dentists. Shinhung Co., Ltd. was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "004720.KS": {
        "short_name": "PharmGen Science",
        "long_name": "PharmGen Science Inc.",
        "summary": "PharmGen Science, Inc. engages in the research and development, production, and sale of pharmaceutical products in South Korea. It offers prescription drugs, OTC drugs, health food, and cosmetics. It offers its products in the form of tablet, hard capsule, granule and ointment, syrups, and suspension forms. The company was formerly known as Wooridul Pharmaceutical Limited and changed its name to PharmGen Science, Inc. PharmGen Science, Inc. was founded in 1961 and is headquartered in Hwaseong, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Hwaseong-si"
    },
    "005500.KS": {
        "short_name": "SamjinPharm",
        "long_name": "Samjin Pharmaceuticals Co., Ltd.",
        "summary": "Samjin Pharmaceuticals Co., Ltd. engages in the research and development of pharmaceutical products in Korea. The company's products include SA001, a clinical Phase II product for the treatment of dry eye syndrome; SJ-3366 for HIV that is in preclinical/clinical stage; and SJ-3902, SJP1601, SJP1604, SJP1803/1804, and SJP004, which are preclinical stage products for the treatment of cancer, AMD, and CNS disorders. Its products also comprise SJP1602, SJP1610, SJP1702, SJP1801, and SJP005 that are in biological testing stage for the treatment of cancer, RA, diabetes, and Alzheimer's; and SJP003, which is in clinical stage for the treatment of anti-coagulation disease. The company was founded in 1968 and is headquartered in Seoul, Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005690.KS": {
        "short_name": "Pharmicell",
        "long_name": "Pharmicell Co., Ltd.",
        "summary": "Pharmicell Co., Ltd., a biopharmaceutical company, develops and sells stem cell drugs in South Korea and internationally. The company operates in Biopharmaceutical Business and Biochemical Business divisions. It offers Cellgram_AMI that is manufactured using autologous bone marrow-derived mesenchymal stem cell to enhance the ejection fraction in patients with acute myocardial infarction reperfused by coronary angioplasty. The company's products under development include Cellgram_LC, a liver disease drug; Cellgram_ED for treating impotence; and Cellgram_DC, a cancer drug. It also develops and produces intermediates of raw material medicines, such as nucleosides, mPEGs, and HDP-tosylates; and phosphorus-based flame retardants. In addition, the company operates Twelve, a stem cell bank; develops and sells stem cell culture media cosmetics; and distributes various experimental materials related to stem cells, including cell culture medium. Pharmicell Co., Ltd. was founded in 2002 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "007570.KS": {
        "short_name": "IlyangPharm",
        "long_name": "Ilyang Pharmaceutical Co.,Ltd",
        "summary": "Ilyang Pharmaceutical Co.,Ltd operates as a pharmaceutical company primarily in South Korea. The company offers anticancer, circulatory system, endocrine/metabolism, cheonjiyang, female hormone, urinary system, ophthalmology, liver disease, anti-inflammatory analgesic, digestive system, dermatology, respiratory system, nutrient infusion, and neurology medicines. It also provides antibiotics, antifungal drugs, anti-inflammatory analgesic drugs, insecticides, and vaccines; and health drinks, daily food, supplements, health food, cosmetics, and beverages. In addition, the company offers pharmaceutical raw materials products, such as aluminum hydroxide gel, dried aluminum hydroxide gel, magnesium hydroxide, magnesium hydroxide gel, aluminum hydroxide-magnesium carbonate co-dried gel, magnesium trisilicate, hydrotalcite, almagate, aluminum phosphate, aluminum phosphate gel, aluminum magnesium metasilicate, aluminum magnesium silicate, aluminum magnesium silicopolydrate, magaldrate, magaldrate wet gel, dihydroxy aluminum sodium carbonate, magnesium carbonate, aluminum magnesium hydroxide, synthetic aluminum silicate, and other products. Ilyang Pharmaceutical Co.,Ltd also exports its products to approximately 14 countries. The company was formerly known as Il-Yang Pharm. Ind. Co. and changed its name to Ilyang Pharmaceutical Co., Ltd. in May 1991. Ilyang Pharmaceutical Co.,Ltd was founded in 1946 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yongin"
    },
    "007575.KS": {
        "short_name": "IlyangPharm(1P)",
        "long_name": "Ilyang Pharmaceutical Co.,Ltd",
        "summary": "Ilyang Pharmaceutical Co.,Ltd operates as a pharmaceutical company primarily in South Korea. The company offers anticancer, circulatory system, endocrine/metabolism, cheonjiyang, female hormone, urinary system, ophthalmology, liver disease, anti-inflammatory analgesic, digestive system, dermatology, respiratory system, nutrient infusion, and neurology medicines. It also provides antibiotics, antifungal drugs, anti-inflammatory analgesic drugs, insecticides, and vaccines; and health drinks, daily food, supplements, health food, cosmetics, and beverages. In addition, the company offers pharmaceutical raw materials products, such as aluminum hydroxide gel, dried aluminum hydroxide gel, magnesium hydroxide, magnesium hydroxide gel, aluminum hydroxide-magnesium carbonate co-dried gel, magnesium trisilicate, hydrotalcite, almagate, aluminum phosphate, aluminum phosphate gel, aluminum magnesium metasilicate, aluminum magnesium silicate, aluminum magnesium silicopolydrate, magaldrate, magaldrate wet gel, dihydroxy aluminum sodium carbonate, magnesium carbonate, aluminum magnesium hydroxide, synthetic aluminum silicate, and other products. Ilyang Pharmaceutical Co.,Ltd also exports its products to approximately 14 countries. The company was formerly known as Il-Yang Pharm. Ind. Co. and changed its name to Ilyang Pharmaceutical Co., Ltd. in May 1991. Ilyang Pharmaceutical Co.,Ltd was founded in 1946 and is headquartered in Yongin, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yongin"
    },
    "008490.KS": {
        "short_name": "SUHEUNG",
        "long_name": "Suheung Co., Ltd.",
        "summary": "Suheung Co., Ltd. produces and sells empty hard capsules for use in pharmaceutical and nutraceutical applications. The company also offers contract manufacturing services for various dosage types and packaging combinations. It also provides OEM services for paintballs. Suheung Co., Ltd. was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008930.KS": {
        "short_name": "Hanmi Science",
        "long_name": "Hanmi Science Co., Ltd.",
        "summary": "Hanmi Science Co., Ltd., through its subsidiaries, manufactures and sells pharmaceutical products in Korea and internationally. It develops drugs in the areas of diabetes and anti-cancer. The company also offers drug substances, general medicines, health functional foods, and nutrition and health products and services. In addition, it operates an online pharmacy; and offers pharmaceutical management automation systems. The company was formerly known as Hanmi Holdings Co., Ltd. and changed its name to Hanmi Science Co., Ltd. in March 2012. Hanmi Science Co., Ltd. was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009290.KS": {
        "short_name": "KwangdongPharm",
        "long_name": "Kwang Dong Pharmaceutical Co., Ltd.",
        "summary": "Kwang Dong Pharmaceutical Co., Ltd. operates as a human healthcare provider in South Korea. It develops and sells OTC drugs in the areas of antitussive expectorants, ophthalmic, liver disease agents, mineral preparations, vitamins, circulating system, and nutritious tonics; and ETC drugs in the areas of oral hypoglycemic agents, anti-arteriosclerotic agents, metabolic drugs, vitamins, digestive organ agents, circulating systems, immunosuppressants, obesity drugs, urinary genital and anal drugs, appetite suppressants, neuropsychiatric solvents, antispasmodics, antitussive expectorants, anti-vertigo drugs, antivirals agents, anti-malignant-tumor agents, and vasodilator, as well as antiepileptic, antihistaminic, antipyretic, analgesic, and anti-inflammatory agents. The company also provides general supplements, OTC drinks, consumer drinks, functional drinks, and traditional health foods. In addition, it engages in the operation of hospitals; and the retail and wholesale of products through discount stores, TV home shopping, and Internet shopping malls. Further, the company operates as a MRO total service provider for the raw/intermediate materials and consumables under various business models, such as the construction purchase service and overseas local purchase service. Kwang Dong Pharmaceutical Co., Ltd. was founded in 1963 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009420.KS": {
        "short_name": "HANALL BIOPHARMA",
        "long_name": "Hanall Biopharma Co.,Ltd",
        "summary": "Hanall Biopharma Co.,Ltd, a pharmaceutical company, researches, develops, and sells pharmaceutical products in South Korea and internationally. The company offers specialty drugs and over-the-counter products for the treatment of gastric and duodenal ulcers, gastritis, cerebrovascular and peripheral blood vessel disorder, hypertension, atherosclerotic symptom, acute coronary syndrome, atherothrombosis and thromboembolism, diabetes, osteoporosis, chronic kidney failure, hypothyroidism, vitamin D-resistant rickets, osteomalacia, erectile dysfunction, prostatic hyperplasia, candidiasis, various fungal infections, prostate cancer, formal, constipation, thin stools, bloating, bowel abnormal fermentation, and hemorrhoids. The company was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "011000.KS": {
        "short_name": "GENEONE",
        "long_name": "GeneOne Life Science, Inc.",
        "summary": "GeneOne Life Science, Inc., a biopharmaceutical company, engages in the development and contract manufacturing of gene-based-biomedicines. Its products comprise GLS-1027, which is in Phase I clinical trial for treatment of nephropathy and inflammatory diseases; GLS-1200 that is in Phase II clinical trial to treat Rhinosinusitis; GLS-1027 and GLS-1200, which is Phase II clinical trial for treatment of COVID-19. The company also develops GLS-3000 and GLS-5310 for the treatment of SARS-CoV-2; GLS-5100 to treat VZV-Shingles; and GLS-5140 for the treatment of SFTS. In addition, it is developing GLS-5300, which is in Phase II clinical trial for MERS; GLS-5700 that is in Phase I clinical trial for Zika; and GLS-6150, which is in Phase I clinical trial for treatment of hepatitis C, as well as GLS-6100 that is in pre-clinical stage for hepatitis C. Further, the company, through its subsidiary, VGXI, Inc., engages in the cGMP production of nucleic acid-based products, including DNA plasmids and mRNA. The company was formerly known as VGX International Inc. and changed its name to GeneOne Life Science, Inc. in April 2014. GeneOne Life Science, Inc. was founded in 1976 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "016580.KS": {
        "short_name": "WhaninPharm",
        "long_name": "Whan In Pharm Co.,Ltd.",
        "summary": "Whan In Pharm Co.,Ltd., a pharmaceutical company, develops, manufactures, markets, and sells therapeutic products in South Korea. It offers anti-depressants, anti-psychotics, nootropics and anti-dementia, anti-epileptics, cardiovascular, gastrointestinal, antibiotics, antiviral agents, antihistamines, anti-inflammatory and analgesics, metabolic disorders, respiratory, central nervous system, other drug products. The company was founded in 1978 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "017180.KS": {
        "short_name": "Myungmoon Pharm",
        "long_name": "MYUNGMOON Pharm co.,Ltd",
        "summary": "MYUNGMOON Pharm co.,Ltd engages in the research, development, production, distribution, and sale of pharmaceuticals in South Korea and internationally. It offers prescription drugs, including anti osteoarthritis, anti-inflammatory analgesics, antiphlogistic enzymes, muscle relaxant, anti rheumarthritis, antibiotics and antifungal, respiratory agents, GI therapeutics, circulation agents, anti-hypertension agents, antidiabetic drugs, narcotics, anesthetic agents, central nervous system products, female hormone products, osteoporotic therapeutics, urogentital agents, adrenocortical hormone products, oncology agents, other preparations, fillers, and anti-obesity agents for pharmacotherapy. The company also provides OTC products, such as antinausants, genitourinary system products, anti gum disease products, hepatics, parasiticides, cathartic, oral disease products, antidiarrheal agents, digestive system products, cold drugs, calcium products, nasal sprays, multiple vitamin products, eye nutrition products, eye drops, blood circulation products, circulatory solvents, skin external preparations, and topical analgesic products. In addition, it offers health supplements, quasi drugs, and blended juices. MYUNGMOON Pharm co.,Ltd was founded in 1983 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "019170.KS": {
        "short_name": "ShinpoongPharm",
        "long_name": "Shin Poong Pharm.Co.,Ltd.",
        "summary": "Shin Poong Pharm.Co.,Ltd. manufactures and sells pharmaceutical products in South Korea. The company offers cephalosporin antibiotics; penicillin antibiotics; and finished products. It also provides active pharmaceutical ingredients; Pyramax, an anti-malarial drug; drugs for treating hypercholesterolemia, knee osteoarthritis and shoulder periarthritis, and surgical adhesion barrier; and over the counter products. The company also exports its products to approximately 50 countries. Shin Poong Pharm.Co.,Ltd. was founded in 1962 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "019175.KS": {
        "short_name": "ShinpoongPharm(1P)",
        "long_name": "Shin Poong Pharm.Co.,Ltd.",
        "summary": "Shin Poong Pharm.Co.,Ltd. manufactures and sells pharmaceutical products in South Korea. The company offers cephalosporin antibiotics; penicillin antibiotics; and finished products. It also provides active pharmaceutical ingredients; Pyramax, an anti-malarial drug; drugs for treating hypercholesterolemia, knee osteoarthritis and shoulder periarthritis, and surgical adhesion barrier; and over the counter products. The company also exports its products to approximately 50 countries. Shin Poong Pharm.Co.,Ltd. was founded in 1962 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "063160.KS": {
        "short_name": "CKDBio",
        "long_name": "CKD Bio Corp.",
        "summary": "CKD Bio Corp. manufactures and distributes drug substances based on fermentation, synthesis, and biotechnology in South Korea. It offers drug substances in the areas of antibiotic, Ã\u009f-lactamase inhibitors, immunosuppressants, anticancer drugs, obesity treatment drugs, dry eye, antivirus, antituberculosis, antihyperlipidemics, and probiotics. The company also provides contract research and development, and manufacturing services for active pharmaceutical ingredients and intermediates, and probiotics. It also exports its products. The company was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "068270.KS": {
        "short_name": "Celltrion",
        "long_name": "Celltrion, Inc.",
        "summary": "Celltrion, Inc., together with its subsidiaries, develops and produces therapeutics based on proteins including oncology treatment drugs in South Korea. The company markets Remsima, Truxima, and Herzuma products; generic pharmaceuticals; covid-19 test kits. Its antibody biosimilar pipeline includes CT-P39 for the treatment of asthma, urticaria; CT-P17 for the treatment of rheumatoid arthritis; CT-P16 for the treatment of metastatic colorectal cancer and breast cancer; CT-P41 for the treatment of osteoporosis and bone loss; CT-P43 for the treatment of psoriasis, crohn's disease, and ulcerative colitis; CT-P42 for the treatment of diabetic macular edema; CT-P27 for the treatment of pandemic/seasonal influenza; CT-P59 for the treatment of COVID-19; and CT-G20 for the treatment of Cardiomyopathy. The company was founded in 2002 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    },
    "069620.KS": {
        "short_name": "DAEWOONG PHARM",
        "long_name": "Daewoong pharmaceutical Co.,Ltd.",
        "summary": "Daewoong pharmaceutical Co.,Ltd. manufactures and sells pharmaceutical products in South Korea and internationally. It offers products in therapeutic areas, such as central nervous system, endocrinology, musculoskeletal, nephrology, antineoplastic, cardiovascular, gastrointestinal, metabolic, antiviral, analgesic, antacid, and digestive diseases, as well as wound, iron supplements, and muti-vitamins. The company also provides COVID-19 PCR kit, COVID-19 IgG/IgM RDT, and viral transport medium medical devices. The company was founded in 1945 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "102460.KS": {
        "short_name": "REYON",
        "long_name": "REYON Pharmaceutical Co., Ltd.",
        "summary": "REYON Pharmaceutical Co., Ltd. manufactures and sells finished medicines and APIs in South Korea and internationally. The company offers its products under the areas of adrenal corticosteroides; angiotensin II receptor antagonists; anticholinergics; antiemetic; antihypertensives; anti-inflammatory enzymes; antilipidemic, antirheumatic, and oral hypoglycemic agents; anti-peptic ulcer; antispasmodics; benign prostatic hypertrophy; cough and cold remedies; cardiac stimulant; genitourinary smooth muscle relaxants; hemostatics; immunosuppressants; rheumatoid arthritis; local anesthetics; migraine drugs; miscellaneous cardiovascular system drugs; neuromuscular disorder related drugs; nootropics and neurotonics; NSAIDs; respiratory stimulants; skeletal muscle relaxants; and vasodilators. REYON Pharmaceutical Co., Ltd. was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "118000.KS": {
        "short_name": "WOORIDUL HUEBRAIN",
        "long_name": "Wooridul Huebrain Limited",
        "summary": "Wooridul Huebrain Limited engages in the medical, life and health, pharmaceutical, and storage businesses. It sells medical equipment and appliances, health equipment, medicines, and computer servers. Wooridul Huebrain Limited was formerly known as Wooridul Life Sciences Limited and changed its name to Wooridul Huebrain Limited in April 2014. Wooridul Huebrain Limited was founded in 2009 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Hwaseong-si"
    },
    "128940.KS": {
        "short_name": "HanmiPharm",
        "long_name": "Hanmi Pharm. Co., Ltd.",
        "summary": "Hanmi Pharm. Co., Ltd. operates as a pharmaceutical company worldwide. It develops treatments for diabetes, obesity, cancer, autoimmune, and rare diseases. The company was founded in 1973 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "145720.KS": {
        "short_name": "DENTIUM",
        "long_name": "Dentium CO., LTD",
        "summary": "Dentium Co.,Ltd. manufactures and sells dental implant products worldwide. Its dental implant systems include superline, implantium, simpleline II, slimline, overdenture system, NR line, and implantium II. The company also provides surgical instruments, such as surgical, drill stopper, sinus, osteotome, trephine bur, prosthetic, planning, restorative, and help kits, as well as harvest drills, sinus elevators, GBR systems, surgical guides, temporary shells, white seals, TN brushes, and guide systems; regeneration products, including bone grafts, membranes, and tissue regeneration products; and digital dentistry products. In addition, it offers lab products; and iCT motors and injections. The company was formerly known as Biostech Co., Ltd. and changed its name to Dentium Co.,Ltd. in August 2002. The company was founded in 2000 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "185750.KS": {
        "short_name": "CHONGKUNDANG",
        "long_name": "Chong Kun Dang Pharmaceutical Corp.",
        "summary": "Chong Kun Dang pharmaceutical Corp. engages in the manufacturing, marketing, and selling of medicines in South Korea and internationally. It provides prescription drugs for anti-hypertension, anti-hyperlipidemia, and anti-diabetics; over-the-counter drugs, such as Penzal, Prefemine, and Modcol, as well as consumer health products, such as insecticides, hair dye, etc.; and healthcare supplements with preventive benefits. The company also exports its products. Chong Kun Dang pharmaceutical Corp. was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "207940.KS": {
        "short_name": "SAMSUNG BIOLOGICS",
        "long_name": "Samsung Biologics Co.,Ltd.",
        "summary": "Samsung Biologics Co., Ltd. engages in the contract manufacturing organization business for biopharmaceuticals products. It is involved in the provision of contract development organization services, including cell line development, upstream and downstream processes, and analytical methods and formulations. The company also offers aseptic filling, lyophilization, finishing, storage and shipping, and support services; and quality assurance and control, as well as biosafety and analytical testing services. In addition, it engages in the development and commercialization of biosimilar drugs; and manufactures mammalian cell-based antibody drugs. The company was founded in 2011 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    },
    "214390.KS": {
        "short_name": "KYONGBO",
        "long_name": "Kyongbo Pharmaceutical Co., Ltd",
        "summary": "Kyongbo Pharmaceutical Co., Ltd manufactures and sells active pharmaceutical ingredients in South Korea. The company offers general, cephalosporins, and anti-cancer APIs; prescription drugs, including anesthetic, cardiovascular, digestive, and antibiotics; and OTC drugs. It also exports its products to 30 countries worldwide. The company was formerly known as Kyongbo Chemical Co. Ltd. and changed its name to Kyongbo Pharmaceutical Co., Ltd in March 2002. Kyongbo Pharmaceutical Co., Ltd was founded in 1987 and is headquartered in Asan, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Asan"
    },
    "249420.KS": {
        "short_name": "ILDONG PHARM",
        "long_name": "Ildong Pharmaceutical Co., Ltd.",
        "summary": "Ildong Pharmaceutical Co., Ltd. develops, manufactures, and sells pharmaceutical products in South Korea. The company offers active lactic acid bacterial and anti-diarrheal agents, antibiotics, antifungal and antiviral products, anti-histamine drugs, antineoplastic agents, and NSAIDs and analgesics, as well as vitamins, minerals, and nutrients; and drugs for blood circulation, cardiovascular and central nervous system, dental, endocrine and metabolic system, gastrointestinal system, respiratory system, topical preparation, and urogenital system applications. It also provides raw material drugs; health foods and foods; cosmetics; medical devices for scar treatment; and other drugs for treating thick wounds, osteoarthritis, periarthritis of shoulder, and artificial tears, as well as feminine cleanser products. In addition, the company manages licenses and provides contract manufacturing services. It also exports its products to approximately 20 countries worldwide. Ildong Pharmaceutical Co., Ltd. a strategic collaboration with Evotec SE to accelerate the development of various Ildong's proprietary projects through access to Evotec's INDiGO platform. The company was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "271980.KS": {
        "short_name": "JEIL PHARM",
        "long_name": "Jeil Pharmaceutical Co.,Ltd",
        "summary": "Jeil Pharmaceutical Co.,Ltd develops and supplies pharmaceutical products primarily in South Korea. It provides products in the areas of antibiotic, gatrointestinal, cardiovascular, neuropyschiatry, oncology, endocrinology, urology, antiviral, and antihistamine. The company also exports its products to approximately 40 countries in ASEAN, Central and South America, Africa, etc. Jeil Pharmaceutical Co.,Ltd was founded in 1959 and is headquartered in Seoul, South Korea. Jeil Pharmaceutical Co.,Ltd operates independently of Jeil Pharma Holdings Inc as of June 2, 2017.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "293480.KS": {
        "short_name": "Hana Pharm",
        "long_name": "Hana Pharm Co., Ltd.",
        "summary": "Hana Pharm Co., Ltd. develops and provides various pharmaceutical products in South Korea and internationally. It offers anesthetics, narcotic analgesics, antiemetics, muscle relaxants, cardiovascular and endocrine system, gastrointestinal system, respiratory system, antibiotics, dermatology, urinology, osteoporosis, and central nervous system products, as well as analgesics, antipyretics, and anti-inflammatory drugs. The company was founded in 1958 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}