{
    "001630.KS": {
        "short_name": "CHONGKUNDANG HOLDINGS",
        "long_name": "Chong Kun Dang Holdings Corp.",
        "summary": "Chong Kun Dang Holdings Corp. manufactures and distributes pharmaceutical products in South Korea and internationally. The company was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.ckd-holdings.com/company/summary.do",
        "market_cap": "Small Cap"
    },
    "005690.KS": {
        "short_name": "Pharmicell",
        "long_name": "Pharmicell Co., Ltd.",
        "summary": "Pharmicell Co., Ltd., a biopharmaceutical company, develops and sells stem cell drugs in South Korea and internationally. The company operates in Biopharmaceutical Business and Biochemical Business divisions. It offers Cellgram_AMI that is manufactured using autologous bone marrow-derived mesenchymal stem cell to enhance the ejection fraction in patients with acute myocardial infarction reperfused by coronary angioplasty. The company's products under development include Cellgram_LC, a liver disease drug; Cellgram_ED for treating impotence; and Cellgram_DC, a cancer drug. It also develops and produces intermediates of raw material medicines, such as nucleosides, mPEGs, and HDP-tosylates; and phosphorus-based flame retardants. In addition, the company operates Twelve, a stem cell bank; develops and sells stem cell culture media cosmetics; and distributes various experimental materials related to stem cells, including cell culture medium. Pharmicell Co., Ltd. was founded in 2002 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.pharmicell.com",
        "market_cap": "Small Cap"
    },
    "011000.KS": {
        "short_name": "GENEONE",
        "long_name": "GeneOne Life Science, Inc.",
        "summary": "GeneOne Life Science, Inc., a biopharmaceutical company, engages in the development and contract manufacturing of gene-based-biomedicines. Its products comprise GLS-1027, which is in Phase I clinical trial for treatment of nephropathy and inflammatory diseases; GLS-1200 that is in Phase II clinical trial to treat Rhinosinusitis; GLS-1027 and GLS-1200, which is Phase II clinical trial for treatment of COVID-19. The company also develops GLS-3000 and GLS-5310 for the treatment of SARS-CoV-2; GLS-5100 to treat VZV-Shingles; and GLS-5140 for the treatment of SFTS. In addition, it is developing GLS-5300, which is in Phase II clinical trial for MERS; GLS-5700 that is in Phase I clinical trial for Zika; and GLS-6150, which is in Phase I clinical trial for treatment of hepatitis C, as well as GLS-6100 that is in pre-clinical stage for hepatitis C. Further, the company, through its subsidiary, VGXI, Inc., engages in the cGMP production of nucleic acid-based products, including DNA plasmids and mRNA. The company was formerly known as VGX International Inc. and changed its name to GeneOne Life Science, Inc. in April 2014. GeneOne Life Science, Inc. was founded in 1976 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06060",
        "website": "http://www.genels.com",
        "market_cap": "Small Cap"
    },
    "068270.KS": {
        "short_name": "Celltrion",
        "long_name": "Celltrion, Inc.",
        "summary": "Celltrion, Inc., together with its subsidiaries, develops and produces therapeutics based on proteins including oncology treatment drugs in South Korea. The company markets Remsima, Truxima, and Herzuma products; generic pharmaceuticals; covid-19 test kits. Its antibody biosimilar pipeline includes CT-P39 for the treatment of asthma, urticaria; CT-P17 for the treatment of rheumatoid arthritis; CT-P16 for the treatment of metastatic colorectal cancer and breast cancer; CT-P41 for the treatment of osteoporosis and bone loss; CT-P43 for the treatment of psoriasis, crohn's disease, and ulcerative colitis; CT-P42 for the treatment of diabetic macular edema; CT-P27 for the treatment of pandemic/seasonal influenza; CT-P59 for the treatment of COVID-19; and CT-G20 for the treatment of Cardiomyopathy. The company was founded in 2002 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.celltrion.com",
        "market_cap": "Large Cap"
    },
    "207940.KS": {
        "short_name": "SAMSUNG BIOLOGICS",
        "long_name": "Samsung Biologics Co.,Ltd.",
        "summary": "Samsung Biologics Co., Ltd. engages in the contract manufacturing organization business for biopharmaceuticals products. It is involved in the provision of contract development organization services, including cell line development, upstream and downstream processes, and analytical methods and formulations. The company also offers aseptic filling, lyophilization, finishing, storage and shipping, and support services; and quality assurance and control, as well as biosafety and analytical testing services. In addition, it engages in the development and commercialization of biosimilar drugs; and manufactures mammalian cell-based antibody drugs. The company was founded in 2011 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": "21987",
        "website": "http://samsungbiologics.com",
        "market_cap": "Large Cap"
    }
}