{"ARO.F": {"short_name": "ARCANDOR AG O.N.", "long_name": "Arcandor AG", "summary": "Arcandor AG is a holding company, which through its subsidiaries, owns and operates home shopping, general merchandise, and departmental retail stores. The company operates stores under Karstadt, Alsterhaus, KaDeWe, and Oberpollinger brands; and sporting goods stores under the Karstadt sports brand, as well as an online store under the karstadt.de brand name. It also provides restaurant services under the Le Buffet brand name. In addition, the company offers mail order services through monthly catalogues and the Internet. Its online sites include quelle.de, a shopping site focusing on fashion, technology, home, and kitchen products. The company was formerly known as Karstadt Quelle Aktiengesellschaft and changed its name to Arcandor AG in July 2007. The company was founded in 1881 and is based in Essen, Germany. As of June 9, 2009, Arcandor AG is in liquidation.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "FRA", "market": "dr_market", "country": "Germany", "city": "Essen"}, "ECK.DE": {"short_name": "LUDW.BECK A.RATHAUSECK", "long_name": "LUDWIG BECK am Rathauseck - Textilhaus Feldmeier AG", "summary": "LUDWIG BECK am Rathauseck - Textilhaus Feldmeier AG engages in the textile retail business in Germany. It operates through Textile and Non-Textile segments. The company wholesales and retails textiles, clothing, hardware, and other merchandise. It also non-textile goods, such as cosmetics, paper products, and sound recording products. In addition, the company offers a range of cosmetics through ludwigbeck.de, an online portal. Further, it is involved in the acquisition, holding, and management of investments in real estate companies. The company operates its flagship store at Marienplatz in Munich. It operates its business under the LUDWIG BECK brand name. LUDWIG BECK am Rathauseck - Textilhaus Feldmeier AG was founded in 1861 and is based in Munich, Germany.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "GER", "market": "de_market", "country": "Germany", "city": "Munich"}, "ECK.F": {"short_name": "LUDW.BECK A.RATHAUSECK", "long_name": "LUDWIG BECK am Rathauseck - Textilhaus Feldmeier AG", "summary": "LUDWIG BECK am Rathauseck - Textilhaus Feldmeier AG engages in the textile retail business in Germany. It operates through Textile and Non-Textile segments. The company wholesales and retails textiles, clothing, hardware, and other merchandise. It also non-textile goods, such as cosmetics, paper products, and sound recording products. In addition, the company offers a range of cosmetics through ludwigbeck.de, an online portal. Further, it is involved in the acquisition, holding, and management of investments in real estate companies. The company operates its flagship store at Marienplatz in Munich. It operates its business under the LUDWIG BECK brand name. LUDWIG BECK am Rathauseck - Textilhaus Feldmeier AG was founded in 1861 and is based in Munich, Germany.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "FRA", "market": "dr_market", "country": "Germany", "city": "Munich"}}