{
    "1GIA.F": {
        "short_name": "FIRSTSERVICE",
        "long_name": "FirstService Corporation",
        "summary": "FirstService Corporation, together with its subsidiaries, provides residential property management and other essential property services to residential and commercial customers in the United States and Canada. The company operates in two segments, FirstService Residential and FirstService Brands. The FirstService Residential segment offers property management services for private residential communities, such as condominiums, co-operatives, homeowner associations, master-planned communities, active adult and lifestyle communities, and various other residential developments. This segment also provides a range of ancillary services, including on-site staffing for building engineering and maintenance, full-service swimming pool and amenity management, and security and concierge/front desk; and financial services comprising cash management, other banking transaction-related, and specialized property insurance brokerage. In addition, this segment offers energy management solutions and advisory services, and resale processing services. The FirstService Brands segment provides property services through 5 franchise networks; and company-owned locations, including 19 California Closets and 11 Paul Davis Restoration locations. It provides residential and commercial restoration, painting, and floor coverings design and installation services; custom-designed and installed closet, and home storage solutions; home inspection services; and fire protection and related services. This segment offers its services primarily under the Paul Davis Restoration, Interstate Restoration, FirstOnSite Restoration, Century Fire Protection, CertaPro Painters, California Closets, Pillar to Post Home Inspectors, and Floor Coverings International brand names. FirstService Corporation was founded in 1989 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 2A9",
        "website": "http://www.firstservice.com",
        "market_cap": "Mid Cap"
    },
    "331.F": {
        "short_name": "TRICON RESIDENTIAL INC.",
        "long_name": "Tricon Residential Inc.",
        "summary": "Founded in 1988, Tricon is a rental housing company focused on serving the middle-market demographic. Tricon owns and operates approximately 31,000 single-family rental homes and multi-family rental units in 21 markets across the United States and Canada, managed with an integrated technology-enabled operating platform. More information about Tricon is available at www.triconresidential.com.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2B7",
        "website": "http://www.triconresidential.com",
        "market_cap": "Small Cap"
    },
    "53U.F": {
        "short_name": "ALTUS GROUP LTD",
        "long_name": "Altus Group Limited",
        "summary": "Altus Group Limited provides software, data solutions, and independent advisory services to the commercial real estate (CRE) industry in Canada, the United States, Europe, and the Asia Pacific. It operates through Altus Analytics and Commercial Real Estate Consulting (CRE Consulting) segments. The Altus Analytics segment offers ARGUS Enterprise (AE) software for CRE valuation and portfolio management; ARGUS Developer and ARGUS EstateMaster software for development feasibility analysis; ARGUS API, an application programming interface; ARGUS Voyanta, a cloud-based data management solution; ARGUS Taliance, a cloud-based fund solution for alternative investment firms; and ARGUS Acquire, a cloud-based deal management solution for CRE acquisitions. It also offers data subscription products that provide real estate information on the residential, office, industrial, and investment markets; advisory and managed services; and technology-related services. This segment serves large owners, managers, and investors of CRE asset and funds; service providers; brokers; and developers. The CRE Consulting segment offers real estate property tax services, including assessment reviews, management, and appeals, as well as personal property, and state and local tax advisory services; valuation services, such as appraisals of real estate portfolios and valuation of properties, as well as due diligence, and litigation and economic consulting services; and construction feasibility study, budgeting, cost and loan monitoring, and project management services to owner operators, developers, financial institutions, and CRE asset holders and investors. The company was founded in 2005 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1G4",
        "website": "http://www.altusgroup.com",
        "market_cap": "Small Cap"
    },
    "74S.F": {
        "short_name": "MORGUARD CORP.",
        "long_name": "Morguard Corporation",
        "summary": "Morguard Corporation, a real estate investment and management corporation, acquires, owns, and develops real estate properties in Canada and the United States. As of February 25, 2021, the company owned a portfolio of 203 multi-suite residential, retail, office, industrial, and hotel properties that comprised 17,752 residential suites, approximately 16.9 million square feet of commercial leasable space, and 5,517 hotel rooms. It also offers real estate management services, including acquisitions, development, dispositions, leasing, performance measurement, and asset and property management; real estate advisory services; and investment products across equity, fixed-income, and balanced portfolios to institutional clients and private investors. The company is headquartered in Mississauga, Canada. Morguard Corporation is a subsidiary of Paros Enterprises Limited.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5B 1M3",
        "website": "http://www.morguard.com",
        "market_cap": "Small Cap"
    },
    "AFD.CN": {
        "short_name": "AnsarFinancial",
        "long_name": "Ansar Financial and Development Corporation",
        "summary": "Ansar Financial and Development Corporation, a real estate corporation, acquires, owns, and sells properties in Canada. The company also purchases, develops, and sells residential lots near the Edmonton Airport in Alberta; and commercial/industrial lots near Calgary, Alberta. Ansar Financial and Development Corporation was incorporated in 2008 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M1B 4Z9",
        "website": "http://www.ansarfinancial.com",
        "market_cap": "Nano Cap"
    },
    "AGGHF": {
        "short_name": "AGRIOS GLOBAL HOLDINGS LTD",
        "long_name": "Agrios Global Holdings Ltd.",
        "summary": "Agrios Global Holdings Ltd. operates as a data analytics driven agriculture technology and services company. The company leases and manages properties and equipment for eco-sustainable agronomy and provides advisory services to support various aspects of aeroponic cultivation in the cannabis sector in the state of Washington. Agrios Global Holdings Ltd. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2E9",
        "website": "http://www.agriosglobal.com",
        "market_cap": "Nano Cap"
    },
    "AHOTF": {
        "short_name": "AMERICAN HOTEL INCOME PPTYS REI",
        "long_name": "American Hotel Income Properties REIT LP",
        "summary": "American Hotel Income Properties REIT LP (TSX: HOT.UN, TSX: HOT.U, TSX: HOT.DB.U), or AHIP, is a limited partnership formed to invest in hotel real estate properties across the United States. AHIP's 78 premium branded, select-service hotels are located in secondary metropolitan markets that benefit from diverse and stable demand. AHIP hotels operate under brands affiliated with Marriott, Hilton, IHG and Choice Hotels through license agreements. The Company's long-term objectives are to build on its proven track record of successful investment, deliver monthly U.S. dollar denominated distributions to unitholders, and generate value through the continued growth of its diversified hotel portfolio.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Hotel & Motel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3L2",
        "website": "http://www.ahipreit.com",
        "market_cap": "Micro Cap"
    },
    "AIF.TO": {
        "short_name": "ALTUS GROUP LIMITED",
        "long_name": "Altus Group Limited",
        "summary": "Altus Group Limited provides software, data solutions, and independent advisory services to the commercial real estate (CRE) industry in Canada, the United States, Europe, and the Asia Pacific. It operates through Altus Analytics and Commercial Real Estate Consulting (CRE Consulting) segments. The Altus Analytics segment offers ARGUS Enterprise (AE) software for CRE valuation and portfolio management; ARGUS Developer and ARGUS EstateMaster software for development feasibility analysis; ARGUS API, an application programming interface; ARGUS Voyanta, a cloud-based data management solution; ARGUS Taliance, a cloud-based fund solution for alternative investment firms; and ARGUS Acquire, a cloud-based deal management solution for CRE acquisitions. It also offers data subscription products that provide real estate information on the residential, office, industrial, and investment markets; advisory and managed services; and technology-related services. This segment serves large owners, managers, and investors of CRE asset and funds; service providers; brokers; and developers. The CRE Consulting segment offers real estate property tax services, including assessment reviews, management, and appeals, as well as personal property, and state and local tax advisory services; valuation services, such as appraisals of real estate portfolios and valuation of properties, as well as due diligence, and litigation and economic consulting services; and construction feasibility study, budgeting, cost and loan monitoring, and project management services to owner operators, developers, financial institutions, and CRE asset holders and investors. The company was founded in 2005 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1G4",
        "website": "http://www.altusgroup.com",
        "market_cap": "Small Cap"
    },
    "APYRF": {
        "short_name": "ALLIED PROPS REAL ESTATE INV TS",
        "long_name": "Allied Properties Real Estate Investment Trust",
        "summary": "Allied is a leading owner, manager and developer of (i) distinctive urban workspace in Canada's major cities and (ii) network-dense urban data centres in Toronto that form Canada's hub for global connectivity. Allied's business is providing knowledge-based organizations with distinctive urban environments for creativity and connectivity.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 2H2",
        "website": "http://www.alliedreit.com",
        "market_cap": "Mid Cap"
    },
    "ARESF": {
        "short_name": "ARTIS REAL ESTATE INVESTMENT TR",
        "long_name": "Artis Real Estate Investment Trust",
        "summary": "Artis is a diversified Canadian real estate investment trust investing in industrial and office properties in Canada and the United States. Since 2004, Artis has executed an aggressive but disciplined growth strategy, building a portfolio of commercial properties in select markets in Canada and the United States. As of September 30, 2020, Artis' commercial property comprises approximately 23.8 million square feet of leasable area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "MB",
        "city": "Winnipeg",
        "zipcode": "R3C 0A5",
        "website": "http://www.artisreit.com",
        "market_cap": "Small Cap"
    },
    "BEI-UN.TO": {
        "short_name": "BOARDWALK REAL ESTATE INVESTMEN",
        "long_name": "Boardwalk Real Estate Investment Trust",
        "summary": "Boardwalk REIT strives to be Canada's friendliest communities and currently owns and operates more than 200 communities with over 33,000 residential units totaling over 28 million net rentable square feet. Boardwalk's principal objectives are to provide its Residents with the best quality communities and superior customer service, while providing Unitholders with sustainable monthly cash distributions, and increase the value of its trust units through selective acquisitions, dispositions, development, and effective management of its residential multi-family communities. Boardwalk REIT is vertically integrated and is Canada's leading owner/operator of multi-family communities bringing Residents home to properties located in Alberta, Saskatchewan, Ontario, and Quebec. Boardwalk REIT's Trust units are listed on the Toronto Stock Exchange, trading under the symbol BEI.UN.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2R 0W1",
        "website": "http://www.bwalk.com",
        "market_cap": "Small Cap"
    },
    "BEK-B.TO": {
        "short_name": "BECKER MILK COMPANY LTD. (THE),",
        "long_name": "The Becker Milk Company Limited",
        "summary": "The Becker Milk Company Limited owns and manages retail commercial properties primarily in Ontario, Canada. As of April 30, 2020, it owned and managed 48 commercial properties located in southern Ontario, which includes single store sites with a multi store plazas comprising one residential units above a retail commercial store; and leased 56 retail stores. The Becker Milk Company Limited was founded in 1957 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 1P1",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "BOWFF": {
        "short_name": "BOARDWALK REAL ESTATE INVESTMEN",
        "long_name": "Boardwalk Real Estate Investment Trust",
        "summary": "Boardwalk REIT strives to be Canada's friendliest communities and currently owns and operates more than 200 communities with over 33,000 residential units totaling over 28 million net rentable square feet. Boardwalk's principal objectives are to provide its Residents with the best quality communities and superior customer service, while providing Unitholders with sustainable monthly cash distributions, and increase the value of its trust units through selective acquisitions, dispositions, development, and effective management of its residential multi-family communities. Boardwalk REIT is vertically integrated and is Canada's leading owner/operator of multi-family communities bringing Residents home to properties located in Alberta, Saskatchewan, Ontario, and Quebec. Boardwalk REIT's Trust units are listed on the Toronto Stock Exchange, trading under the symbol BEI.UN.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2R 0W1",
        "website": "http://www.bwalk.com",
        "market_cap": "Small Cap"
    },
    "BPO-PC.TO": {
        "short_name": "BROOKFIELD OFFICE PROPERTIES PR",
        "long_name": "Brookfield Office Properties Inc.",
        "summary": "Brookfield Properties Corporation is a privately owned real estate investment firm. The firm engages in the ownership, development, and management of premier commercial properties and also invests in core-plus office buildings. It also provides ancillary real estate service businesses, such as tenant service and amenities. The firm invests in the real estate markets of the United States with a focus on North American cities, including Seattle, San Francisco, Los Angeles, Denver, Houston, New York, Boston, and Washington, DC., and Minneapolis and Canadian cities such as Toronto and Calgary. It primarily invests in properties and development sites predominantly office buildings. It was formerly known as Carena-Bancorp Holdings, Inc. and changed its name to Le Holding Carena-Bancorp Inc. in 1978. The company further changed its name to Carena-Bancorp, Inc. in 1985; to Carena Developments Limited in 1989; and to Brookfield Properties Corporation in 1996. Brookfield Properties was founded in 1923 and is based in New York, New York with an additional office in Toronto, Canada. As of March 31, 2014, Brookfield Office Properties Inc. operates as a subsidiary of Brookfield Property Partners L.P.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.brookfieldproperties.com",
        "market_cap": "Large Cap"
    },
    "BPO-PY.TO": {
        "short_name": "BROOKFIELD OFFICE PROPERTIES PR",
        "long_name": "Brookfield Office Properties Inc.",
        "summary": "Brookfield Properties Corporation is a privately owned real estate investment firm. The firm engages in the ownership, development, and management of premier commercial properties and also invests in core-plus office buildings. It also provides ancillary real estate service businesses, such as tenant service and amenities. The firm invests in the real estate markets of the United States with a focus on North American cities, including Seattle, San Francisco, Los Angeles, Denver, Houston, New York, Boston, and Washington, DC., and Minneapolis and Canadian cities such as Toronto and Calgary. It primarily invests in properties and development sites predominantly office buildings. It was formerly known as Carena-Bancorp Holdings, Inc. and changed its name to Le Holding Carena-Bancorp Inc. in 1978. The company further changed its name to Carena-Bancorp, Inc. in 1985; to Carena Developments Limited in 1989; and to Brookfield Properties Corporation in 1996. Brookfield Properties was founded in 1923 and is based in New York, New York with an additional office in Toronto, Canada. As of March 31, 2014, Brookfield Office Properties Inc. operates as a subsidiary of Brookfield Property Partners L.P.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.brookfieldproperties.com",
        "market_cap": "Mid Cap"
    },
    "BRE.TO": {
        "short_name": "BRIDGEMARQ REAL ESTATE SERVICES",
        "long_name": "Bridgemarq Real Estate Services Inc.",
        "summary": "Bridgemarq Real Estate Services Inc. provides various services to residential real estate brokers and REALTORS in Canada. It offers information, tools, and services that assist its customers in the delivery of real estate sales services. The company provides its services under the Royal LePage, Via Capitale, and Johnston & Daniel brand names. As of December 31, 2020, its franchise network consisted of 19,046 REALTORS operating under 289 franchise agreements in 662 locations. The company was formerly known as Brookfield Real Estate Services Inc. and changed its name to Bridgemarq Real Estate Services Inc. in May 2019. Bridgemarq Real Estate Services Inc. was incorporated in 2010 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M3C 3K5",
        "website": "http://www.bridgemarq.com",
        "market_cap": "Micro Cap"
    },
    "BREUF": {
        "short_name": "BRIDGEMARQ REAL ESTATE SERVICES",
        "long_name": "Bridgemarq Real Estate Services Inc.",
        "summary": "Bridgemarq Real Estate Services Inc. provides various services to residential real estate brokers and REALTORS in Canada. It offers information, tools, and services that assist its customers in the delivery of real estate sales services. The company provides its services under the Royal LePage, Via Capitale, and Johnston & Daniel brand names. As of December 31, 2020, its franchise network consisted of 19,046 REALTORS operating under 289 franchise agreements in 662 locations. The company was formerly known as Brookfield Real Estate Services Inc. and changed its name to Bridgemarq Real Estate Services Inc. in May 2019. Bridgemarq Real Estate Services Inc. was incorporated in 2010 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M3C 3K5",
        "website": "http://www.bridgemarq.com",
        "market_cap": "Micro Cap"
    },
    "BSRTF": {
        "short_name": "BSR REAL ESTATE INVESTMENT TRUS",
        "long_name": "BSR Real Estate Investment Trust",
        "summary": "BSR Real Estate Investment Trust is an internally managed, unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT owns a portfolio of multifamily garden-style residential properties located in attractive primary and secondary markets in the Sunbelt region of the United States.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S7",
        "website": "http://www.bsrreit.com",
        "market_cap": "Small Cap"
    },
    "BTB-UN.TO": {
        "short_name": "BTB REIT UNITS",
        "long_name": "BTB Real Estate Investment Trust",
        "summary": "BTB is a real estate investment trust listed on the Toronto Stock Exchange. BTB is an important owner of properties in eastern Canada. As at November 10th, 2020, BTB owns 64 retail, office and industrial properties for a total leasable area of approximately 5.3 million square feet and an approximate total asset value as of September 30th, 2020 of approximately of $946M.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3G 2B3",
        "website": "http://www.btbreit.com",
        "market_cap": "Micro Cap"
    },
    "BTBIF": {
        "short_name": "BTB REAL ESTATE INVESTMENT TRUS",
        "long_name": "BTB Real Estate Investment Trust",
        "summary": "BTB is a real estate investment trust listed on the Toronto Stock Exchange. BTB is an important owner of properties in eastern Canada. As at November 10th, 2020, BTB owns 64 retail, office and industrial properties for a total leasable area of approximately 5.3 million square feet and an approximate total asset value as of September 30th, 2020 of approximately of $946M.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3G 2B3",
        "website": "http://www.btbreit.com",
        "market_cap": "Micro Cap"
    },
    "CAR-UN.TO": {
        "short_name": "CDN APARTMENT UN",
        "long_name": "Canadian Apartment Properties Real Estate Investment Trust",
        "summary": "CAPREIT is one of Canada's largest real estate investment trusts. CAPREIT owns approximately 57,000 suites, including townhomes and manufactured housing sites, in Canada and, indirectly through its investment in ERES, approximately 5,800 suites in the Netherlands. CAPREIT manages approximately 61,200 of its owned suites in Canada and Netherlands, and additionally approximately 3,800 suites in Ireland as at September 30, 2020.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1W1",
        "website": "http://www.caprent.com",
        "market_cap": "Mid Cap"
    },
    "CDPYF": {
        "short_name": "CANADIAN APARTMENT PROPERTIES R",
        "long_name": "Canadian Apartment Properties Real Estate Investment Trust",
        "summary": "CAPREIT is one of Canada's largest real estate investment trusts. CAPREIT owns approximately 57,000 suites, including townhomes and manufactured housing sites, in Canada and, indirectly through its investment in ERES, approximately 5,800 suites in the Netherlands. CAPREIT manages approximately 61,200 of its owned suites in Canada and Netherlands, and additionally approximately 3,800 suites in Ireland as at September 30, 2020.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1W1",
        "website": "http://www.caprent.com",
        "market_cap": "Mid Cap"
    },
    "CHP-UN.TO": {
        "short_name": "CHOICE PROPERTIES REIT",
        "long_name": "Choice Properties Real Estate Investment Trust",
        "summary": "Choice Properties, Canada's preeminent diversified real estate investment trust, is the owner, manager and developer of a high-quality portfolio comprising 725 properties totaling 66.1 million square feet of gross leasable area. Choice Properties owns a portfolio comprised of retail properties predominantly leased to necessity-based tenants; industrial, office and residential assets concentrated in attractive markets; and offers an impressive and substantial development pipeline. Choice Properties' strategic alliance with its principal tenant, Loblaw Companies Limited, the country's leading retailer, is a key competitive advantage providing long-term growth opportunities.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4T 2S5",
        "website": "http://www.choicereit.ca",
        "market_cap": "Mid Cap"
    },
    "CIGI": {
        "short_name": "Colliers International Group In",
        "long_name": "Colliers International Group Inc.",
        "summary": "Colliers International Group Inc. provides commercial real estate services to corporate and institutional clients in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers sales brokerage services, which include purchases and sales, debt placement, equity capital raising, market value opinions, acquisition advisory, and transaction management services; and lease brokerage services comprising landlord and tenant representation services. The company provides outsourcing and advisory services that consist of corporate and workplace solutions; property management services comprising building operations and maintenance, facilities management, lease administration, property accounting and financial reporting, contract management and, construction management; project management services, including bid document review, construction monitoring and delivery management, contract administration and integrated cost control, development management, facility and engineering functionality, milestone and performance monitoring, quality assurance, risk management and strategic project consulting; engineering design services for property and building, infrastructure, transportation, environmental and telecommunications end-markets; valuation and advisory services; workplace strategy services; loan servicing; property marketing; and research services. It also offers investment management services comprising asset management advisory and administration, and transaction services. The company was founded in 1972 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2B4",
        "website": "http://www.colliers.com",
        "market_cap": "Mid Cap"
    },
    "CIGI.TO": {
        "short_name": "COLLIERS INTERNATIONAL GROUP IN",
        "long_name": "Colliers International Group Inc.",
        "summary": "Colliers International Group Inc. provides commercial real estate services to corporate and institutional clients in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers sales brokerage services, which include purchases and sales, debt placement, equity capital raising, market value opinions, acquisition advisory, and transaction management services; and lease brokerage services comprising landlord and tenant representation services. The company provides outsourcing and advisory services that consist of corporate and workplace solutions; property management services comprising building operations and maintenance, facilities management, lease administration, property accounting and financial reporting, contract management and, construction management; project management services, including bid document review, construction monitoring and delivery management, contract administration and integrated cost control, development management, facility and engineering functionality, milestone and performance monitoring, quality assurance, risk management and strategic project consulting; engineering design services for property and building, infrastructure, transportation, environmental and telecommunications end-markets; valuation and advisory services; workplace strategy services; loan servicing; property marketing; and research services. It also offers investment management services comprising asset management advisory and administration, and transaction services. The company was founded in 1972 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2B4",
        "website": "http://www.colliers.com",
        "market_cap": "Mid Cap"
    },
    "CMLEF": {
        "short_name": "COMINAR REAL ESTATE INVESTMENT",
        "long_name": "Cominar Real Estate Investment Trust",
        "summary": "Cominar is one of the largest diversified real estate investment trusts in Canada and is the largest commercial property owner in the Province of QuÃ©bec. Our portfolio consists of 314 high-quality office, retail and industrial properties, totalling 35.8 million square feet located in the Montreal, QuÃ©bec City and Ottawa areas. Cominar's primary objective is to maximize total return to unitholders by way of tax-efficient distributions and maximizing the unit value through the proactive management of our portfolio.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Quebec City",
        "zipcode": "G1V 0C1",
        "website": "http://www.cominar.com",
        "market_cap": "Small Cap"
    },
    "CRR-UN.TO": {
        "short_name": "CROMBIE REAL ESTATE INVESTMENT ",
        "long_name": "Crombie Real Estate Investment Trust",
        "summary": "Crombie Real Estate Investment Trust (\"Crombie\") is an unincorporated, open-ended real estate investment trust established under, and governed by, the laws of the Province of Ontario. Crombie is one of the country's leading national retail property landlords with a strategy to own, operate and develop a portfolio of high-quality grocery- and pharmacy-anchored shopping centres, freestanding stores and mixed-use developments primarily in Canada's top urban and suburban markets.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "NS",
        "city": "New Glasgow",
        "zipcode": "B2H 3S2",
        "website": "http://www.crombiereit.com",
        "market_cap": "Mid Cap"
    },
    "CRXPF": {
        "short_name": "VERT INFRASTRUCTURE LTD",
        "long_name": "Vert Infrastructure Ltd.",
        "summary": "Vert Infrastructure Ltd. invests in, constructs, owns, and leases greenhouse projects to licensed cannabis producers. The company's portfolio of project includes cultivation properties in California; and two in Washington State, such as a 1,000-acre Nevada cannabis farm and 2,115 acres of hemp CBD farms. It develops a portfolio of assets, including Canna Drink, a cannabis infused functional beverage line and 16 Cannabis brands. Vert Infrastructure Ltd. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2Z4",
        "website": "http://www.vertltd.ca",
        "market_cap": "Nano Cap"
    },
    "CSH-UN.TO": {
        "short_name": "CHARTWELL RETIREMENT RESIDENCES",
        "long_name": "Chartwell Retirement Residences",
        "summary": "Chartwell is an unincorporated, open-ended real estate trust which indirectly owns and operates a complete range of seniors housing communities, from independent supportive living through assisted living to long term care. It is the largest operator in the Canadian seniors living sector with over 200 quality retirement communities in four provinces including properties under development. Chartwell is committed to its vision of Making People's Lives BETTER and to providing a happier, healthier and more fulfilling life experience for its residents.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5W 0G5",
        "website": "http://www.chartwell.com",
        "market_cap": "Mid Cap"
    },
    "CUF-UN.TO": {
        "short_name": "COMINAR R E UN",
        "long_name": "Cominar Real Estate Investment Trust",
        "summary": "Cominar is one of the largest diversified real estate investment trusts in Canada and is the largest commercial property owner in the Province of QuÃ©bec. Our portfolio consists of 314 high-quality office, retail and industrial properties, totalling 35.8 million square feet located in the Montreal, QuÃ©bec City and Ottawa areas. Cominar's primary objective is to maximize total return to unitholders by way of tax-efficient distributions and maximizing the unit value through the proactive management of our portfolio.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Quebec City",
        "zipcode": "G1V 0C1",
        "website": "http://www.cominar.com",
        "market_cap": "Small Cap"
    },
    "CWSRF": {
        "short_name": "CHARTWELL RETIREMENT RESIDENCES",
        "long_name": "Chartwell Retirement Residences",
        "summary": "Chartwell is an unincorporated, open-ended real estate trust which indirectly owns and operates a complete range of seniors housing communities, from independent supportive living through assisted living to long term care. It is the largest operator in the Canadian seniors living sector with over 200 quality retirement communities in four provinces including properties under development. Chartwell is committed to its vision of Making People's Lives BETTER and to providing a happier, healthier and more fulfilling life experience for its residents.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5W 0G5",
        "website": "http://www.chartwell.com",
        "market_cap": "Mid Cap"
    },
    "CWYUF": {
        "short_name": "SMARTCENTRES REAL ESTATE INVEST",
        "long_name": "SmartCentres Real Estate Investment Trust",
        "summary": "SmartCentres Real Estate Investment Trust is one of Canada's largest fully integrated REITs, with a best-in-class portfolio featuring 166 strategically located properties in communities across the country. SmartCentres has approximately $10.4 billion in assets and owns 33.8 million square feet of income producing value-oriented retail space with 97.4% occupancy, on 3,500 acres of owned land across Canada. SmartCentres continues to focus on enhancing the lives of Canadians by planning and developing complete, connected, mixed-use communities on its existing retail properties. A publicly announced $11.9 billion intensification program ($5.4 billion at SmartCentres' share) represents the REIT's current major development focus on which construction is expected to commence within the next five years. This intensification program consists of rental apartments, condos, seniors' residences and hotels, to be developed under the SmartLiving banner, and retail, office, and storage facilities, to be developed under the SmartCentres banner. SmartCentres' intensification program is expected to produce an additional 59.3 million square feet (27.9 million square feet at SmartCentres' share) of space, 27.1 million square feet (12.3 million square feet at SmartCentres' share) of which has or will commence construction within next five years. From shopping centres to city centres, SmartCentres is uniquely positioned to reshape the Canadian urban and urban-suburban landscape. Included in this intensification program is the Trust's share of SmartVMC which, when completed, is expected to include approximately 11.0 million square feet of mixed-use space in Vaughan, Ontario. Construction of the first five sold-out phases of Transit City Condominiums that represent 2,789 residential units continues to progress. Final closings of the first two phases of Transit City Condominiums began ahead of budget and ahead of schedule in August 2020 and as at September 30, 2020, 766 units (representing approximately 70% of all 1,110 units in the first and second phases) had closed with the balance of units expected to close before year end. In addition, the presold 631 units in the third phase along with 22 townhomes, all of which are sold out and currently under construction, are expected to close in 2021. The fourth and fifth sold-out phases representing 1,026 units are currently under construction and are expected to close in 2023.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 5Z5",
        "website": "http://www.smartcentres.com",
        "market_cap": "Mid Cap"
    },
    "DRM.TO": {
        "short_name": "DREAM UNLIMITED CORP",
        "long_name": "Dream Unlimited Corp.",
        "summary": "Dream Unlimited Corp. formerly known as Dundee Realty Corporation is a real estate investment firm. The firm provides real estate asset management and advisory services including sourcing, acquiring, managing, and developing commercial and residential real estate primarily in Western Canada. It invests in the real estate markets across the globe. The firm also seeks to invest in renewable energy infrastructure and power projects with a focus on wind, hydro, and solar in North American. Dream Unlimited Corp. was founded in 1996 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 3H1",
        "website": "http://www.dream.ca",
        "market_cap": "Small Cap"
    },
    "EMER.CN": {
        "short_name": "Emergia Inc.",
        "long_name": "Emergia Inc.",
        "summary": "Emergia Inc., together with its subsidiaries, engages in the acquisition, development, and management of real estate properties in Canada, the United States, and Greece. Its portfolio includes retail, residential, office, and industrial properties. The company was formerly known as The Delma Group Inc. and changed its name to Emergia Inc. in January 2020. Emergia Inc. is headquartered in Dorval, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Dorval",
        "zipcode": "H9P 1E9",
        "website": "http://www.emergia.com",
        "market_cap": "Nano Cap"
    },
    "FCAFF": {
        "short_name": "FIRM CAP APT REAL ESTATE INVT T",
        "long_name": "Firm Capital Apartment Real Estate Investment Trust",
        "summary": "Firm Capital Apartment Real Estate Investment Trust operates as a real estate investment company in the United States. It invests in income producing real estate assets in Texas, Florida, New Jersey, North and South Carolina, Colorado, Georgia, and New York; and provides bridge lending of mortgage and preferred capital secured by residential/multi-residential properties. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. The company was formerly known as Firm Capital American Realty Partners Trust and changed its name to Firm Capital Apartment Real Estate Investment Trust in September 2020. Firm Capital Apartment Real Estate Investment Trust was incorporated in 2007 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6A 1V5",
        "website": "http://www.firmcapital.com/fcareit",
        "market_cap": "Micro Cap"
    },
    "FCD-UN.V": {
        "short_name": "FIRM CAPITAL PROPERTY TRUST",
        "long_name": "Firm Capital Property Trust",
        "summary": "Firm Capital Property Trust is focused on creating long-term value for Unitholders, through capital preservation and disciplined investing to achieve stable distributable income. In partnership with management and industry leaders, The Trust's plan is to own as well as to co-own a diversified property portfolio of multi-residential, flex industrial, net lease convenience retail, and core service provider professional space. In addition to stand alone accretive acquisitions, the Trust will make joint acquisitions with strong financial partners and acquisitions of partial interests from existing ownership groups, in a manner that provides liquidity to those selling owners and professional management for those remaining as partners. Firm Capital Realty Partners Inc., through a structure focused on an alignment of interests with the Trust sources, syndicates and property and asset manages investments on behalf of the Trust.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6A 1V5",
        "website": "http://www.firmcapital.com/fcpt/",
        "market_cap": "Micro Cap"
    },
    "FRMUF": {
        "short_name": "FIRM CAP PPTY TR COM NPV",
        "long_name": "Firm Capital Property Trust",
        "summary": "Firm Capital Property Trust is focused on creating long-term value for Unitholders, through capital preservation and disciplined investing to achieve stable distributable income. In partnership with management and industry leaders, The Trust's plan is to own as well as to co-own a diversified property portfolio of multi-residential, flex industrial, net lease convenience retail, and core service provider professional space. In addition to stand alone accretive acquisitions, the Trust will make joint acquisitions with strong financial partners and acquisitions of partial interests from existing ownership groups, in a manner that provides liquidity to those selling owners and professional management for those remaining as partners. Firm Capital Realty Partners Inc., through a structure focused on an alignment of interests with the Trust sources, syndicates and property and asset manages investments on behalf of the Trust.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M6A 1V5",
        "website": "http://www.firmcapital.com/fcpt/",
        "market_cap": "Micro Cap"
    },
    "FRO-UN.V": {
        "short_name": "FRONSAC REAL ESTATE INVESTMENT ",
        "long_name": "Fronsac Real Estate Investment Trust",
        "summary": "Fronsac Real Estate Investment Trust is an open-ended trust that acquires and owns high quality triple net and management-free commercial real estate properties.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Quebec City",
        "zipcode": "H9R 3X3",
        "website": "http://www.en.fronsacreit.com",
        "market_cap": "Micro Cap"
    },
    "FSV.F": {
        "short_name": "COLLIERS INTL GRP INC. SV",
        "long_name": "Colliers International Group Inc.",
        "summary": "Colliers International Group Inc. provides commercial real estate services to corporate and institutional clients in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers sales brokerage services, which include purchases and sales, debt placement, equity capital raising, market value opinions, acquisition advisory, and transaction management services; and lease brokerage services comprising landlord and tenant representation services. The company provides outsourcing and advisory services that consist of corporate and workplace solutions; property management services comprising building operations and maintenance, facilities management, lease administration, property accounting and financial reporting, contract management and, construction management; project management services, including bid document review, construction monitoring and delivery management, contract administration and integrated cost control, development management, facility and engineering functionality, milestone and performance monitoring, quality assurance, risk management and strategic project consulting; engineering design services for property and building, infrastructure, transportation, environmental and telecommunications end-markets; valuation and advisory services; workplace strategy services; loan servicing; property marketing; and research services. It also offers investment management services comprising asset management advisory and administration, and transaction services. The company was founded in 1972 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2B4",
        "website": "http://www.colliers.com",
        "market_cap": "Mid Cap"
    },
    "FSV": {
        "short_name": "FirstService Corporation",
        "long_name": "FirstService Corporation",
        "summary": "FirstService Corporation, together with its subsidiaries, provides residential property management and other essential property services to residential and commercial customers in the United States and Canada. The company operates in two segments, FirstService Residential and FirstService Brands. The FirstService Residential segment offers property management services for private residential communities, such as condominiums, co-operatives, homeowner associations, master-planned communities, active adult and lifestyle communities, and various other residential developments. This segment also provides a range of ancillary services, including on-site staffing for building engineering and maintenance, full-service swimming pool and amenity management, and security and concierge/front desk; and financial services comprising cash management, other banking transaction-related, and specialized property insurance brokerage. In addition, this segment offers energy management solutions and advisory services, and resale processing services. The FirstService Brands segment provides property services through 5 franchise networks; and company-owned locations, including 19 California Closets and 11 Paul Davis Restoration locations. It provides residential and commercial restoration, painting, and floor coverings design and installation services; custom-designed and installed closet, and home storage solutions; home inspection services; and fire protection and related services. This segment offers its services primarily under the Paul Davis Restoration, Interstate Restoration, FirstOnSite Restoration, Century Fire Protection, CertaPro Painters, California Closets, Pillar to Post Home Inspectors, and Floor Coverings International brand names. FirstService Corporation was founded in 1989 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 2A9",
        "website": "http://www.firstservice.com",
        "market_cap": "Mid Cap"
    },
    "FSV.TO": {
        "short_name": "FIRSTSERVICE CORPORATION",
        "long_name": "FirstService Corporation",
        "summary": "FirstService Corporation, together with its subsidiaries, provides residential property management and other essential property services to residential and commercial customers in the United States and Canada. The company operates in two segments, FirstService Residential and FirstService Brands. The FirstService Residential segment offers property management services for private residential communities, such as condominiums, co-operatives, homeowner associations, master-planned communities, active adult and lifestyle communities, and various other residential developments. This segment also provides a range of ancillary services, including on-site staffing for building engineering and maintenance, full-service swimming pool and amenity management, and security and concierge/front desk; and financial services comprising cash management, other banking transaction-related, and specialized property insurance brokerage. In addition, this segment offers energy management solutions and advisory services, and resale processing services. The FirstService Brands segment provides property services through 5 franchise networks; and company-owned locations, including 19 California Closets and 11 Paul Davis Restoration locations. It provides residential and commercial restoration, painting, and floor coverings design and installation services; custom-designed and installed closet, and home storage solutions; home inspection services; and fire protection and related services. This segment offers its services primarily under the Paul Davis Restoration, Interstate Restoration, FirstOnSite Restoration, Century Fire Protection, CertaPro Painters, California Closets, Pillar to Post Home Inspectors, and Floor Coverings International brand names. FirstService Corporation was founded in 1989 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 2A9",
        "website": "http://www.firstservice.com",
        "market_cap": "Mid Cap"
    },
    "GDC.TO": {
        "short_name": "GENESIS LAND J",
        "long_name": "Genesis Land Development Corp.",
        "summary": "Genesis Land Development Corp., an integrated land developer and residential home builder, owns and develops a portfolio of residential, commercial and mixed-use land, and serviced lots in the Calgary Metropolitan Area, Canada. It operates through two segments, Land Development and Home Building. The Land Development segment acquires, plans, rezones, subdivides, services, and sells residential lots, and commercial and industrial lands to third-party developers and builders. The Home Building segment designs, constructs, and sells single-family and semi-detached homes and townhomes. The company was formerly known as Genesis Capital Corp. and changed its name to Genesis Land Development Corp. in October 1998. Genesis Land Development Corp. was founded in 1991 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T3K 0S3",
        "website": "http://www.genesisland.com",
        "market_cap": "Micro Cap"
    },
    "GRP-UN": {
        "short_name": "Granite Real Estate Inc. Staple",
        "long_name": "Granite Real Estate Investment Trust",
        "summary": "Granite is a Canadian-based REIT engaged in the acquisition, development, ownership and management of logistics, warehouse and industrial properties in North America and Europe. Granite owns 108 investment properties representing approximately 45.3 million square feet of leasable area.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1H1",
        "website": "http://www.granitereit.com",
        "market_cap": "Mid Cap"
    },
    "GRT-UN.TO": {
        "short_name": "GRANITE REAL ESTATE INVESTMENT ",
        "long_name": "Granite Real Estate Investment Trust",
        "summary": "Granite is a Canadian-based REIT engaged in the acquisition, development, ownership and management of logistics, warehouse and industrial properties in North America and Europe. Granite owns 108 investment properties representing approximately 45.3 million square feet of leasable area.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1H1",
        "website": "http://www.granitereit.com",
        "market_cap": "Mid Cap"
    },
    "GUF.V": {
        "short_name": "Gulf & Pacific Equities Corp.",
        "long_name": "Gulf & Pacific Equities Corp.",
        "summary": "Gulf & Pacific Equities Corp. invests in commercial real estate properties in western Canada. It primarily focuses on the acquisition, management, and development of grocery-anchored shopping centers. The company owns grocery-anchored shopping centers located in Whitecourt, Alberta, and St. Paul, Alberta. Gulf & Pacific Equities was incorporated in 1998 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 2A7",
        "website": "http://www.gpequities.com",
        "market_cap": "Nano Cap"
    },
    "HMT.V": {
        "short_name": "HALMONT PROPERTIES CORP",
        "long_name": "Halmont Properties Corporation",
        "summary": "Halmont Properties Corporation invests in real assets in Canada. The company's property portfolio includes commercial, forest, and residential properties. It also invests in securities of companies holding property, and energy and infrastructure assets. As of December 31, 2019, the company holds an interest in four heritage commercial buildings, and the ground and second floor premises of a residential condominium complex located in the Toronto Entertainment District. It also holds a 40% equity interest in Haliburton Forest; and a 60% interest in the redevelopment of the peripheral lands of the Muskoka Grandview Resort in Huntsville, Ontario. The company was formerly known as H.A.L. Concepts, Ltd. and changed its name to Halmont Properties Corporation in February 2007. Halmont Properties Corporation was incorporated in 2000 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1J1",
        "website": null,
        "market_cap": "Micro Cap"
    },
    "HOM-U.TO": {
        "short_name": "BSR REAL ESTATE INVESTMENT TRUS",
        "long_name": "BSR Real Estate Investment Trust",
        "summary": "BSR Real Estate Investment Trust is an internally managed, unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT owns a portfolio of multifamily garden-style residential properties located in attractive primary and secondary markets in the Sunbelt region of the United States.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S7",
        "website": "http://www.bsrreit.com",
        "market_cap": "Small Cap"
    },
    "HOM-UN.TO": {
        "short_name": "BSR REAL ESTATE INVESTMENT TRUS",
        "long_name": "BSR Real Estate Investment Trust",
        "summary": "BSR Real Estate Investment Trust is an internally managed, unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT owns a portfolio of multifamily garden-style residential properties located in attractive primary and secondary markets in the Sunbelt region of the United States.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S7",
        "website": "http://www.bsrreit.com",
        "market_cap": "Small Cap"
    },
    "HRUFF": {
        "short_name": "H&R REAL ESTATE INVESTMENT TRUS",
        "long_name": "H&R Real Estate Investment Trust",
        "summary": "H&R REIT is one of Canada's largest real estate investment trusts with total assets of approximately $13.3 billion at September 30, 2020. H&R REIT has ownership interests in a North American portfolio of high quality office, retail, industrial and residential properties comprising over 40 million square feet.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M3K 1N4",
        "website": "http://www.hr-reit.com",
        "market_cap": "Mid Cap"
    },
    "IEI.V": {
        "short_name": "Imperial Equities Inc.",
        "long_name": "Imperial Equities Inc.",
        "summary": "Imperial Equities Inc. engages in the acquisition, development, redevelopment, leasing, and sale of commercial, industrial, and agricultural properties primarily in Edmonton and Alberta, Canada. The company operates in two segments, Agricultural and Industrial/Retail. Imperial Equities Inc. was founded in 1998 and is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T5J 3R8",
        "website": "http://www.imperialequities.com",
        "market_cap": "Nano Cap"
    },
    "IIP-UN.TO": {
        "short_name": "INTERRENT REAL ESTATE INVESTMEN",
        "long_name": "InterRent Real Estate Investment Trust",
        "summary": "InterRent REIT is a growth-oriented real estate investment trust engaged in increasing Unitholder value and creating a growing and sustainable distribution through the acquisition and ownership of multi-residential properties. InterRent's strategy is to expand its portfolio primarily within markets that have exhibited stable market vacancies, sufficient suites available to attain the critical mass necessary to implement an efficient portfolio management structure and, offer opportunities for accretive acquisitions. InterRent's primary objectives are to use the proven industry experience of the Trustees, Management and Operational Team to: (i) to grow both funds from operations per Unit and net asset value per Unit through investments in a diversified portfolio of multi-residential properties; (ii) to provide Unitholders with sustainable and growing cash distributions, payable monthly; and (iii) to maintain a conservative payout ratio and balance sheet.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K2P 1Z2",
        "website": "http://www.interrentreit.com",
        "market_cap": "Small Cap"
    },
    "INO-UN.TO": {
        "short_name": "INOVALIS REIT",
        "long_name": "Inovalis Real Estate Investment Trust",
        "summary": "Inovalis Real Estate Investment Trust is an unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT has been created for the purpose of acquiring and owning office properties primarily located in France and Germany but also opportunistically in other European countries where assets meet the REIT's investment criteria.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 2W7",
        "website": "http://www.inovalisreit.com",
        "market_cap": "Micro Cap"
    },
    "KDSX.V": {
        "short_name": "KADESTONE CAPITAL CORP",
        "long_name": "Kadestone Capital Corp.",
        "summary": "Kadestone Capital Corp. operates as a real estate investment and development company. It engages in the investment, acquisition, development, and management of residential and commercial income producing properties in Metro Vancouver and Kelowna markets, Canada. The company was incorporated in 2019 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1L3",
        "website": "http://www.kadestone.com",
        "market_cap": "Micro Cap"
    },
    "KGF.V": {
        "short_name": "KING GEORGE FINANCIAL CORPORATI",
        "long_name": "King George Financial Corporation",
        "summary": "King George Financial Corporation develops commercial and residential real estate properties in Canada. The company operates through Real Estate Development, Hotel Development and Operation, Management and Finance Services, and Other segments. It also invests in real estate and hotel related securities. The company was incorporated in 1999 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3A8",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "KMP-UN.TO": {
        "short_name": "KILLAM APARTMENT REIT",
        "long_name": "Killam Apartment Real Estate Investment Trust",
        "summary": "Killam Apartment REIT, based in Halifax, Nova Scotia, is one of Canada's largest residential landlords, owning, operating, managing and developing a $3.6 billion portfolio of apartments and manufactured home communities. Killam's strategy to enhance value and profitability focuses on three priorities: 1) increasing earnings from existing operations, 2) expanding the portfolio and diversifying geographically through accretive acquisitions, with an emphasis on newer properties, and 3) developing high-quality properties in its core markets.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "NS",
        "city": "Halifax",
        "zipcode": "B3K 4X8",
        "website": "http://www.killamreit.com",
        "market_cap": "Small Cap"
    },
    "LRT-UN.V": {
        "short_name": "LANESBOROUGH R.E. INVESTMENT TR",
        "long_name": "Lanesborough Real Estate Investment Trust",
        "summary": "LREIT is a real estate investment trust, which is listed on the TSX Venture Exchange under the symbols LRT.UN (Trust Units) and LRT.DB.G (Series G Debentures).",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "MB",
        "city": "Winnipeg",
        "zipcode": "R3L 2T3",
        "website": "http://www.lreit.com",
        "market_cap": "Nano Cap"
    },
    "MEQ.TO": {
        "short_name": "MAINSTREET EQ J",
        "long_name": "Mainstreet Equity Corp.",
        "summary": "Mainstreet Equity Corp. engages in the acquisition, divestiture, value-enhancement, and management of multi-family residential properties in Western Canada. The company owns a portfolio of multi-family residential properties in Vancouver and the Lower Mainland, Calgary and Southern Alberta, Edmonton, Saskatoon, and Regina. As of September 30, 2020, it had a total portfolio of 13,580 revenue producing units consisting of townhouses, garden-style apartments, and mid-rise and high-rise apartments and 3 freestanding commercial houses. The company was founded in 1997 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2G 0W2",
        "website": "http://www.mainst.biz",
        "market_cap": "Small Cap"
    },
    "MI-UN.TO": {
        "short_name": "MINTO APARTMENT REIT",
        "long_name": "Minto Apartment Real Estate Investment Trust",
        "summary": "Minto Apartment Real Estate Investment Trust, an open-ended real estate investment trust, owns and operates a portfolio of income-producing multi-residential rental properties located in Canada. As of December 31, 2020, its portfolio consists of interests in 29 multi-residential rental properties, including three mixed-use residential apartment and commercial buildings in Toronto, Ottawa, MontrÃ©al, Calgary, and Edmonton. Minto Apartment Real Estate Investment Trust was founded in 2018 and is headquartered in Ottawa, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Ottawa",
        "zipcode": "K1P 0B6",
        "website": "http://www.mintoapartments.com",
        "market_cap": "Small Cap"
    },
    "MNGGF": {
        "short_name": "MONGOLIA GROWTH GROUP LTD",
        "long_name": "Mongolia Growth Group Ltd.",
        "summary": "Mongolia Growth Group Ltd., a real estate investment and development company, owns commercial investment property assets in Ulaanbaatar, Mongolia. Its investment portfolio consists of residential, office, retail, and land and redevelopment sites. The company was formerly known as Summus Capital Corp. and changed its name to Mongolia Growth Group Ltd. in February 2011. Mongolia Growth Group Ltd. was incorporated in 2007 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1C9",
        "website": "http://www.mongoliagrowthgroup.com",
        "market_cap": "Nano Cap"
    },
    "MODVF": {
        "short_name": "MELCOR DEVELOPMENTS",
        "long_name": "Melcor Developments Ltd.",
        "summary": "Melcor Developments Ltd. operates as a real estate development company in the United States and Canada. The company operates through Community Development, Property Development, Melcor REIT, Investment Properties, and Recreational Property segments. It develops and manages owns mixed-use residential communities, business and industrial parks, office buildings, retail centers, and golf courses. The company purchases and develops land to be sold as residential, industrial, and commercial lots; develops, constructs, and leases retail, office, and industrial properties, as well as multi-family residential properties; and acquires and owns residential, office, retail, and industrial properties. It also owns and manages three 18-hole championship golf courses. Melcor Developments Ltd. was founded in 1923 and is headquartered in Edmonton, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T5J 1Y8",
        "website": "http://www.melcor.ca",
        "market_cap": "Small Cap"
    },
    "MPC.TO": {
        "short_name": "MADISON PAC CL B",
        "long_name": "Madison Pacific Properties Inc.",
        "summary": "Madison Pacific Properties Inc., together with its subsidiaries, owns, develops, and manages office, industrial, commercial, retail, and multi-family rental real estate properties in Metro Vancouver region, British Columbia, Alberta, and Ontario. Its property portfolio comprises interests in 1,595,277 square feet of net rentable area of industrial properties; 120,565 square feet of net rentable area of retail/highway commercial properties; and 116,689 square feet of net rentable area of office property. The company also provides property management services, including tenant services and relationships, building operations, leasing, lease administration, property accounting and reporting, and project management. In addition, it holds interest in undeveloped residential lands in Mission, British Columbia. The company was formerly known as Princeton Mining Corporation and changed its name to Madison Pacific Properties Inc. in April 1998. Madison Pacific Properties Inc. was incorporated in 1963 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V5Y 1L1",
        "website": "http://www.madisonpacific.ca",
        "market_cap": "Micro Cap"
    },
    "MPCT-UN.TO": {
        "short_name": "DREAM IMPACT TRUST",
        "long_name": "Dream Impact Trust",
        "summary": "Dream Hard Asset Alternatives Trust specializes in hard asset alternative investments including real estate, real estate lending and infrastructure, including renewable power.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 3H1",
        "website": "http://www.dream.ca/alternatives/",
        "market_cap": "Small Cap"
    },
    "MR-UN.TO": {
        "short_name": "MELCOR REIT",
        "long_name": "Melcor Real Estate Investment Trust",
        "summary": "Melcor REIT is an unincorporated, open-ended real estate investment trust. Melcor REIT owns, acquires, manages and leases quality retail, office and industrial income-generating properties in western Canadian markets. Its portfolio is currently made up of interests in 39 properties representing approximately 3.21 million square feet of gross leasable area located across Alberta and in Regina, Saskatchewan; and Kelowna, British Columbia.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T5J 1Y8",
        "website": "http://www.melcorreit.ca",
        "market_cap": "Micro Cap"
    },
    "MRC.TO": {
        "short_name": "MORGUARD CORP.",
        "long_name": "Morguard Corporation",
        "summary": "Morguard Corporation, a real estate investment and management corporation, acquires, owns, and develops real estate properties in Canada and the United States. As of February 25, 2021, the company owned a portfolio of 203 multi-suite residential, retail, office, industrial, and hotel properties that comprised 17,752 residential suites, approximately 16.9 million square feet of commercial leasable space, and 5,517 hotel rooms. It also offers real estate management services, including acquisitions, development, dispositions, leasing, performance measurement, and asset and property management; real estate advisory services; and investment products across equity, fixed-income, and balanced portfolios to institutional clients and private investors. The company is headquartered in Mississauga, Canada. Morguard Corporation is a subsidiary of Paros Enterprises Limited.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5B 1M3",
        "website": "http://www.morguard.com",
        "market_cap": "Small Cap"
    },
    "MRD.TO": {
        "short_name": "MELCOR DEV",
        "long_name": "Melcor Developments Ltd.",
        "summary": "Melcor Developments Ltd. operates as a real estate development company in the United States and Canada. The company operates through Community Development, Property Development, Melcor REIT, Investment Properties, and Recreational Property segments. It develops and manages owns mixed-use residential communities, business and industrial parks, office buildings, retail centers, and golf courses. The company purchases and develops land to be sold as residential, industrial, and commercial lots; develops, constructs, and leases retail, office, and industrial properties, as well as multi-family residential properties; and acquires and owns residential, office, retail, and industrial properties. It also owns and manages three 18-hole championship golf courses. Melcor Developments Ltd. was founded in 1923 and is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T5J 1Y8",
        "website": "http://www.melcor.ca",
        "market_cap": "Small Cap"
    },
    "MRG-UN.TO": {
        "short_name": "MORGUARD NA RESIDENTIAL REIT UN",
        "long_name": "Morguard North American Residential Real Estate Investment Trust",
        "summary": "The REIT is an unincorporated, open-ended real estate investment trust established under and governed by the laws of the Province of Ontario. The Units of the REIT trade on the Toronto Stock Exchange under the ticker symbol MRG.UN. With a strategic focus on the acquisition of high-quality multi-suite residential properties in Canada and the United States, the REIT maximizes long-term Unit value through active asset and property management. The REIT's portfolio is comprised of 13,275 residential suites (as of October 27, 2020) located in Alberta, Ontario, Colorado, Texas, Louisiana, Illinois, Georgia, Florida, North Carolina, Virginia and Maryland with an appraised value of approximately $3.1 billion at September 30, 2020.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5B 1M3",
        "website": "http://www.morguard.com",
        "market_cap": "Small Cap"
    },
    "MRT-UN.TO": {
        "short_name": "MORGUARD UN",
        "long_name": "Morguard Real Estate Investment Trust",
        "summary": "The Trust is a closed-end real estate investment trust, which owns a diversified portfolio of 47 retail, office and industrial income producing properties in Canada with a book value of $2.6 billion and approximately 8.3 million square feet of leasable space.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5B 1M3",
        "website": "http://www.morguard.com",
        "market_cap": "Small Cap"
    },
    "NHS.CN": {
        "short_name": "NHSIndustries",
        "long_name": "NHS Industries Ltd.",
        "summary": "NHS Industries Ltd. engages in the development and rental of real estate properties and facilities in Canada. The company operates Langley Site, a five and a half acre agricultural property with a 48,000 square foot greenhouse facility on site; and a residential property. NHS Industries Ltd. was incorporated in 2001 and is headquartered in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "North Vancouver",
        "zipcode": "V7M 2J5",
        "website": "http://nhsindustries.ca",
        "market_cap": "Nano Cap"
    },
    "NHT-U.V": {
        "short_name": "NEXPOINT HOSPITALITY TRUST USD",
        "long_name": "NexPoint Hospitality Trust",
        "summary": "NexPoint Hospitality Trust is a publicly traded real estate investment trust, with its Units listed on the TSX Venture Exchange under the ticker NHT.U. NHT is focused on acquiring, owning and operating welllocated hospitality properties in the United States that offer a high current yield and in many cases are underperforming assets with the potential to increase in value through investments in capital improvements, a market-based recovery, brand repositioning, revenue enhancements, operational improvements, expense inefficiencies, and exploiting excess land or underutilized space. NHT owns 11 branded properties sponsored by Marriott, Hilton and Intercontinental Hotels Group, located across the U.S. NHT is externally advised by NexPoint Real Estate Advisors VI, L.P.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Hotel & Motel",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2S7",
        "website": "http://www.nexpointhospitality.com",
        "market_cap": "Nano Cap"
    },
    "PLZ-UN.TO": {
        "short_name": "PLAZA RETAIL REIT",
        "long_name": "Plaza Retail REIT",
        "summary": "Plaza is an open-ended real estate investment trust and is a leading retail property owner and developer, focused on Ontario, Quebec and Atlantic Canada. Plaza's portfolio at September 30, 2020 includes interests in 272 properties totaling approximately 8.6 million square feet across Canada and additional lands held for development. Plaza's portfolio largely consists of open-air centres and stand-alone small box retail outlets and is predominantly occupied by national tenants.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "NB",
        "city": "Fredericton",
        "zipcode": "E3A 9N6",
        "website": "http://www.plaza.ca",
        "market_cap": "Small Cap"
    },
    "RCO-UN.TO": {
        "short_name": "MIDDLEFIELD CAN GLOBAL REIT INC",
        "long_name": "Middlefield Can-Global REIT Income Fund",
        "summary": "Middlefield Can-Global REIT Income Fund is an equity mutual fund launched and managed by Middlefield Capital Corporation. The fund invests in public equity markets. It primarily focuses on equity based securities of issuers operating in Canada and global real estate sectors utilizing active and low cost passive portfolio management. Middlefield Can-Global REIT Income Fund is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Specialty",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1A6",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "REAX.V": {
        "short_name": "THE REAL BROKERAGE INC",
        "long_name": "The Real Brokerage Inc.",
        "summary": "The Real Brokerage Inc., together with its subsidiaries, operates as a technology-powered residential real estate brokerage company. It assists home buyers, sellers, and renters with closing real estate transactions and collects a real estate commission for the services rendered through a network of approximately 1,100 agents. The company is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2L3",
        "website": "http://www.joinreal.com",
        "market_cap": "Small Cap"
    },
    "REAXF": {
        "short_name": "THE REAL BROKERAGE INC",
        "long_name": "The Real Brokerage Inc.",
        "summary": "The Real Brokerage Inc., together with its subsidiaries, operates as a technology-powered residential real estate brokerage company. It assists home buyers, sellers, and renters with closing real estate transactions and collects a real estate commission for the services rendered through a network of approximately 1,100 agents. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2L3",
        "website": "http://www.joinreal.com",
        "market_cap": "Micro Cap"
    },
    "REI-UN.TO": {
        "short_name": "RIOCAN REAL EST UN",
        "long_name": "RioCan Real Estate Investment Trust",
        "summary": "RioCan is one of Canada's largest real estate investment trusts. RioCan owns, manages and develops retail-focused, increasingly mixed-use properties located in prime, high-density transit-oriented areas where Canadians want to shop, live and work. As at September 30, 2020, our portfolio is comprised of 221 properties with an aggregate net leasable area of approximately 38.4 million square feet (at RioCan's interest) including office, residential rental and 16 development properties.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4P 1E4",
        "website": "http://www.riocan.com",
        "market_cap": "Mid Cap"
    },
    "RIOCF": {
        "short_name": "RIOCAN REAL ESTATE INVESTMENT T",
        "long_name": "RioCan Real Estate Investment Trust",
        "summary": "RioCan is one of Canada's largest real estate investment trusts. RioCan owns, manages and develops retail-focused, increasingly mixed-use properties located in prime, high-density transit-oriented areas where Canadians want to shop, live and work. As at September 30, 2020, our portfolio is comprised of 221 properties with an aggregate net leasable area of approximately 38.4 million square feet (at RioCan's interest) including office, residential rental and 16 development properties.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4P 1E4",
        "website": "http://www.riocan.com",
        "market_cap": "Mid Cap"
    },
    "RLP.V": {
        "short_name": "REALIA PROPERTIES INC",
        "long_name": "Realia Properties Inc.",
        "summary": "Realia Properties Inc. engages in the ownership of real property interests in the United States. It focuses on retail/ commercial properties and community centers. The company was formerly known as TitanStar Properties Inc. and changed its name to Realia Properties, Inc. in October 2019. Realia Properties Inc. was founded in 2008 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 2W7",
        "website": "http://www.realiaproperties.com",
        "market_cap": "Nano Cap"
    },
    "RPP.V": {
        "short_name": "REGENT PACIFIC PROPERTIES INC",
        "long_name": "Regent Pacific Properties Inc.",
        "summary": "Regent Pacific Properties Inc. operates as a real estate development and investment company in Canada. The company invests in residential and commercial properties. Its portfolio consists of three-storey commercial office tower and attached single-storey bays with underground parking facility; and 15 residential apartment-style condominium units in a 119 unit condominium project located in Edmonton, Alberta. The company is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Edmonton",
        "zipcode": "T6X 0P7",
        "website": "http://www.regentpacific.ca",
        "market_cap": "Nano Cap"
    },
    "SGR-UN.TO": {
        "short_name": "SLATE GROCERY REIT",
        "long_name": "Slate Grocery REIT",
        "summary": "Slate Grocery REIT is an owner and operator of U.S. grocery-anchored real estate. The REIT owns and operates approximately U.S. $1.3 billion of critical real estate infrastructure across major U.S. metro markets that communities rely upon for their everyday needs. The REIT's resilient grocery-anchored portfolio and strong credit tenants provide unitholders with durable cash flows and the potential for capital appreciation over the longer term.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.slategroceryreit.com",
        "market_cap": "Small Cap"
    },
    "SKLN.TA": {
        "short_name": "SKYLINE INVEST.INC",
        "long_name": "Skyline Investments Inc.",
        "summary": "Skyline Investments Inc. develops and operates real estate properties. The company was formerly known as Skyline International Development Inc. Skyline Investments Inc. was founded in 1998 and is based in Toronto, Canada with an additional office in Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 1E5",
        "website": "http://www.skylineinvestments.com",
        "market_cap": null
    },
    "SLTTF": {
        "short_name": "SLATE OFFICE REIT",
        "long_name": "Slate Office REIT",
        "summary": "Slate Office REIT is an owner and operator of North American office real estate. The REIT owns interests in and operates a portfolio of 35 strategic and well-located real estate assets across Canada's major population centres and includes two assets in downtown Chicago, Illinois. 60% of the REIT's portfolio is comprised of government or credit rated tenants. The REIT acquires quality assets at a discount to replacement cost and creates value for unitholders by applying hands-on asset management strategies to grow rental revenue, extend lease term and increase occupancy.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.slateofficereit.com",
        "market_cap": "Micro Cap"
    },
    "SMU-UN.TO": {
        "short_name": "SUMMIT INDUSTRIAL INCOME REIT",
        "long_name": "Summit Industrial Income REIT",
        "summary": "Summit Industrial Income REIT is an unincorporated open-end REIT focused on growing and managing a portfolio of light industrial and other properties across Canada. Summit II's units are listed on the TSX and trade under the symbol SMU.UN.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Brampton",
        "zipcode": "L6T 4V2",
        "website": "http://www.summitIIreit.com",
        "market_cap": "Mid Cap"
    },
    "SOT-UN.TO": {
        "short_name": "SLATE OFFICE REIT",
        "long_name": "Slate Office REIT",
        "summary": "Slate Office REIT is an owner and operator of North American office real estate. The REIT owns interests in and operates a portfolio of 35 strategic and well-located real estate assets across Canada's major population centres and includes two assets in downtown Chicago, Illinois. 60% of the REIT's portfolio is comprised of government or credit rated tenants. The REIT acquires quality assets at a discount to replacement cost and creates value for unitholders by applying hands-on asset management strategies to grow rental revenue, extend lease term and increase occupancy.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.slateofficereit.com",
        "market_cap": "Micro Cap"
    },
    "SRES.V": {
        "short_name": "SUN RESIDENTIAL REIT",
        "long_name": "Sun Residential Real Estate Investment Trust",
        "summary": "Sun Residential Real Estate Investment Trust is an unincorporated open-ended real estate investment trust established pursuant to a declaration of trust dated January 22, 2019, which was amended and restated on March 22, 2019. The business of Sun is to acquire multi-family residential properties in the Sunbelt region of the United States. Its business operations commenced on January 28, 2020, when it completed a financing and concurrently acquired a 51% interest in a multi-family residential property comprising 12 buildings with 288 rental units as well as various amenities for tenants located in Tallahassee, Florida.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Residential",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "ON M5X 1C8",
        "website": "http://sunresreit.com",
        "market_cap": "Nano Cap"
    },
    "SRRTF": {
        "short_name": "SLATE GROCERY REIT",
        "long_name": "Slate Grocery REIT",
        "summary": "Slate Grocery REIT is an owner and operator of U.S. grocery-anchored real estate. The REIT owns and operates approximately U.S. $1.3 billion of critical real estate infrastructure across major U.S. metro markets that communities rely upon for their everyday needs. The REIT's resilient grocery-anchored portfolio and strong credit tenants provide unitholders with durable cash flows and the potential for capital appreciation over the longer term.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.slategroceryreit.com",
        "market_cap": "Small Cap"
    },
    "SRU-UN.TO": {
        "short_name": "SMARTCENTRES REIT",
        "long_name": "SmartCentres Real Estate Investment Trust",
        "summary": "SmartCentres Real Estate Investment Trust is one of Canada's largest fully integrated REITs, with a best-in-class portfolio featuring 166 strategically located properties in communities across the country. SmartCentres has approximately $10.4 billion in assets and owns 33.8 million square feet of income producing value-oriented retail space with 97.4% occupancy, on 3,500 acres of owned land across Canada. SmartCentres continues to focus on enhancing the lives of Canadians by planning and developing complete, connected, mixed-use communities on its existing retail properties. A publicly announced $11.9 billion intensification program ($5.4 billion at SmartCentres' share) represents the REIT's current major development focus on which construction is expected to commence within the next five years. This intensification program consists of rental apartments, condos, seniors' residences and hotels, to be developed under the SmartLiving banner, and retail, office, and storage facilities, to be developed under the SmartCentres banner. SmartCentres' intensification program is expected to produce an additional 59.3 million square feet (27.9 million square feet at SmartCentres' share) of space, 27.1 million square feet (12.3 million square feet at SmartCentres' share) of which has or will commence construction within next five years. From shopping centres to city centres, SmartCentres is uniquely positioned to reshape the Canadian urban and urban-suburban landscape. Included in this intensification program is the Trust's share of SmartVMC which, when completed, is expected to include approximately 11.0 million square feet of mixed-use space in Vaughan, Ontario. Construction of the first five sold-out phases of Transit City Condominiums that represent 2,789 residential units continues to progress. Final closings of the first two phases of Transit City Condominiums began ahead of budget and ahead of schedule in August 2020 and as at September 30, 2020, 766 units (representing approximately 70% of all 1,110 units in the first and second phases) had closed with the balance of units expected to close before year end. In addition, the presold 631 units in the third phase along with 22 townhomes, all of which are sold out and currently under construction, are expected to close in 2021. The fourth and fifth sold-out phases representing 1,026 units are currently under construction and are expected to close in 2023.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Vaughan",
        "zipcode": "L4K 5Z5",
        "website": "http://www.smartcentres.com",
        "market_cap": "Mid Cap"
    },
    "TCN.TO": {
        "short_name": "TRICON RESIDENTIAL INC",
        "long_name": "Tricon Residential Inc.",
        "summary": "Founded in 1988, Tricon is a rental housing company focused on serving the middle-market demographic. Tricon owns and operates approximately 31,000 single-family rental homes and multi-family rental units in 21 markets across the United States and Canada, managed with an integrated technology-enabled operating platform. More information about Tricon is available at www.triconresidential.com.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2B7",
        "website": "http://www.triconresidential.com",
        "market_cap": "Mid Cap"
    },
    "TEMP.CN": {
        "short_name": "TempusCapInc",
        "long_name": "Tempus Capital Inc.",
        "summary": "Tempus Capital Inc. operates as a real estate operating company in Canada. Its real estate portfolio includes three properties comprising a commercial plaza and two mixed commercial/residential properties in Ontario. The company was incorporated in 2011 and is based in Burlington, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Burlington",
        "zipcode": "L7R 2J6",
        "website": "http://tempuscapital.ca",
        "market_cap": "Nano Cap"
    },
    "TNT-UN.TO": {
        "short_name": "TRUE NORTH COMMERCIAL REIT",
        "long_name": "True North Commercial Real Estate Investment Trust",
        "summary": "The REIT is an unincorporated, open-ended real estate investment trust established under the laws of the Province of Ontario. The REIT currently owns and operates a portfolio of 48 commercial properties consisting of approximately 4.8 million square feet in urban and select strategic secondary markets across Canada focusing on long term leases with government and credit rated tenants. The REIT is focused on growing its portfolio principally through acquisitions across Canada and such other jurisdictions where opportunities exist.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M8X 2X3",
        "website": "http://www.truenorthreit.com",
        "market_cap": "Small Cap"
    },
    "TRBE.V": {
        "short_name": "TRIBE PROPERTY TECHNOLOGIES INC",
        "long_name": "Tribe Property Technologies Inc.",
        "summary": "Bazinga Technologies Inc. offer communication, collaboration and self-serve tools for residents and councils. It provides issue management, digital manuals, post-occupancy, generate and export reports, and warranty management. The company was incorporated in 2011 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2P4",
        "website": "http://mybazinga.com",
        "market_cap": "Micro Cap"
    },
    "TUERF": {
        "short_name": "TRUE NORTH COMMERCIAL REAL EST ",
        "long_name": "True North Commercial Real Estate Investment Trust",
        "summary": "The REIT is an unincorporated, open-ended real estate investment trust established under the laws of the Province of Ontario. The REIT currently owns and operates a portfolio of 48 commercial properties consisting of approximately 4.8 million square feet in urban and select strategic secondary markets across Canada focusing on long term leases with government and credit rated tenants. The REIT is focused on growing its portfolio principally through acquisitions across Canada and such other jurisdictions where opportunities exist.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M8X 2X3",
        "website": "http://www.truenorthreit.com",
        "market_cap": "Small Cap"
    },
    "UFC.V": {
        "short_name": "URBANFUND CORP.",
        "long_name": "Urbanfund Corp.",
        "summary": "Urbanfund Corp. owns, develops, and operates a real estate portfolio for residential and commercial properties in Canada. The company also focuses on identifying and investing in real estate and real estate related projects. Its assets are located in Toronto, Brampton, Belleville, Kitchener, and London, Ontario; Quebec City and Montreal, Quebec; and Dartmouth, Nova Scotia. Urbanfund Corp. was incorporated in 1997 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M3B 2T3",
        "website": "http://www.urbanfund.ca",
        "market_cap": "Nano Cap"
    },
    "USTC": {
        "short_name": "USA REAL ESTATE HOLDING CO",
        "long_name": "USA Real Estate Holding Company",
        "summary": "USA Real Estate Holding Company, a development stage company, focuses on purchasing commercial or other real estate properties, including land in the United States. The company, through its subsidiary, USA Real Estate Inc., intends to acquire retail outlets and the land they sit upon in the Midwest and Rocky Mountain states. USA Real Estate Holding Company was founded in 2007 and is based in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Mississauga",
        "zipcode": "L5T2A5",
        "website": "http://www.usarealestateholding.com",
        "market_cap": "Nano Cap"
    },
    "VCOM.V": {
        "short_name": "VIVERE COMMUNITIES INC",
        "long_name": "ViveRE Communities Inc.",
        "summary": "ViveRE Communities Inc. owns and manages multi-unit residential real estate properties in Canada. As of December 23, 2020, it owned and managed 533 units in New Brunswick and Ontario. The company was formerly known as NSX Silver Inc. and changed its name to ViveRE Communities Inc. in August 2018. ViveRE Communities Inc. was incorporated in 2011 and is based in Halifax, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "NS",
        "city": "Halifax",
        "zipcode": "B3J 3R7",
        "website": "http://www.viverecommunities.com",
        "market_cap": "Nano Cap"
    },
    "WFC.TO": {
        "short_name": "WALL FINANCIAL",
        "long_name": "Wall Financial Corporation",
        "summary": "Wall Financial Corporation, together with its subsidiaries, operates as a real estate investment and development company in Canada. It operates through three segments: Rental, Hotel, and Development. The company owns and manages residential and commercial properties; owns and manages hotel properties; and develops and sells residential housing properties. It also engages in the development and management of residential rental units; and development and construction of residential housing for re-sale. As of January 31, 2021, it owned and managed 934 hotel units; and thirteen rental properties in Metro Vancouver, consisting of 1,392 residential and ten commercial rental units. Wall Financial Corporation was incorporated in 1969 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6Z 2R9",
        "website": "http://www.wallfinancialcorp.ca",
        "market_cap": "Small Cap"
    },
    "WIR-U.TO": {
        "short_name": "WPT INDUSTRIAL REIT USD",
        "long_name": "WPT Industrial Real Estate Investment Trust",
        "summary": "WPT Industrial Real Estate Investment Trust is an unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT acquires, develops, manages and owns distribution and logistics properties located in the United States. WPT Industrial, LP (the REIT's operating subsidiary) indirectly owns or manages a portfolio of properties across 20 U.S. states consisting of approximately 35.6 million square feet of GLA and 108 properties. The REIT pays monthly cash distributions, currently at $0.0633 per Unit, or approximately $0.76 per Unit on an annualized basis, in US funds.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5L 1A9",
        "website": "http://www.wptreit.com",
        "market_cap": "Small Cap"
    },
    "WIR-UN.TO": {
        "short_name": "WPT INDUSTRIAL REIT UNITS",
        "long_name": "WPT Industrial Real Estate Investment Trust",
        "summary": "WPT Industrial Real Estate Investment Trust is an unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT acquires, develops, manages and owns distribution and logistics properties located in the United States. WPT Industrial, LP (the REIT's operating subsidiary) indirectly owns or manages a portfolio of properties across 20 U.S. states consisting of approximately 35.6 million square feet of GLA and 108 properties. The REIT pays monthly cash distributions, currently at $0.0633 per Unit, or approximately $0.76 per Unit on an annualized basis, in US funds.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5L 1A9",
        "website": "http://www.wptreit.com",
        "market_cap": "Small Cap"
    },
    "WPTIF": {
        "short_name": "WPT INDL REAL ESTATE INVT TR",
        "long_name": "WPT Industrial Real Estate Investment Trust",
        "summary": "WPT Industrial Real Estate Investment Trust is an unincorporated, open-ended real estate investment trust established pursuant to a declaration of trust under the laws of the Province of Ontario. The REIT acquires, develops, manages and owns distribution and logistics properties located in the United States. WPT Industrial, LP (the REIT's operating subsidiary) indirectly owns or manages a portfolio of properties across 20 U.S. states consisting of approximately 35.6 million square feet of GLA and 108 properties. The REIT pays monthly cash distributions, currently at $0.0633 per Unit, or approximately $0.76 per Unit on an annualized basis, in US funds.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5L 1A9",
        "website": "http://www.wptreit.com",
        "market_cap": "Small Cap"
    },
    "YAK.V": {
        "short_name": "MONGOLIA GROWTH GROUP LTD",
        "long_name": "Mongolia Growth Group Ltd.",
        "summary": "Mongolia Growth Group Ltd., a real estate investment and development company, owns commercial investment property assets in Ulaanbaatar, Mongolia. Its investment portfolio consists of residential, office, retail, and land and redevelopment sites. The company was formerly known as Summus Capital Corp. and changed its name to Mongolia Growth Group Ltd. in February 2011. Mongolia Growth Group Ltd. was incorporated in 2007 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1C9",
        "website": "http://www.mongoliagrowthgroup.com",
        "market_cap": "Nano Cap"
    },
    "YEG.V": {
        "short_name": "YORKTON EQUITY GROUP INC",
        "long_name": "Yorkton Equity Group Inc.",
        "summary": "Yorkton Equity Group Inc. operates as a real estate development company with an investment property located in Edmonton, Alberta. The company is based in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": null,
        "market_cap": "Nano Cap"
    }
}