{"AFD.CN": {"short_name": "AnsarFinancial", "long_name": "Ansar Financial and Development Corporation", "summary": "Ansar Financial and Development Corporation, a real estate corporation, acquires, owns, and sells properties in Canada. The company also purchases, develops, and sells residential lots near the Edmonton Airport in Alberta; and commercial/industrial lots near Calgary, Alberta. Ansar Financial and Development Corporation was incorporated in 2008 and is based in Toronto, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "CNQ", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "CSH-UN.TO": {"short_name": "CHARTWELL RETIREMENT RESIDENCES", "long_name": "Chartwell Retirement Residences", "summary": "Chartwell is an unincorporated, open-ended real estate trust which indirectly owns and operates a complete range of seniors housing communities, from independent supportive living through assisted living to long term care. It is the largest operator in the Canadian seniors living sector with over 200 quality retirement communities in four provinces including properties under development. Chartwell is committed to its vision of Making People's Lives BETTER and to providing a happier, healthier and more fulfilling life experience for its residents.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Mississauga"}, "DRM.TO": {"short_name": "DREAM UNLIMITED CORP", "long_name": "Dream Unlimited Corp.", "summary": "Dream Unlimited Corp. formerly known as Dundee Realty Corporation is a real estate investment firm. The firm provides real estate asset management and advisory services including sourcing, acquiring, managing, and developing commercial and residential real estate primarily in Western Canada. It invests in the real estate markets across the globe. The firm also seeks to invest in renewable energy infrastructure and power projects with a focus on wind, hydro, and solar in North American. Dream Unlimited Corp. was founded in 1996 and is based in Toronto, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "GDC.TO": {"short_name": "GENESIS LAND J", "long_name": "Genesis Land Development Corp.", "summary": "Genesis Land Development Corp. engages in the acquisition, development, and sale of land, residential lots, and homes primarily in the greater Calgary area, Canada. It operates through two segments, Land Development and Home Building. The Land Development segment acquires, plans, rezones, subdivides, services, and sells residential lots, and commercial and industrial lands to third-party developers and builders. The Home Building segment designs, constructs, and sells single-family homes and townhouses. The company was formerly known as Genesis Capital Corp. and changed its name to Genesis Land Development Corp. in October 1998. Genesis Land Development Corp. was founded in 1991 and is headquartered in Calgary, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "HMT.V": {"short_name": "HALMONT PROPERTIES CORP", "long_name": "Halmont Properties Corporation", "summary": "Halmont Properties Corporation invests in real assets in Canada. The company's property portfolio includes commercial, forest, and residential properties. It also invests in securities of companies holding property, and energy and infrastructure assets. As of December 31, 2019, the company holds an interest in four heritage commercial buildings, and the ground and second floor premises of a residential condominium complex located in the Toronto Entertainment District. It also holds a 40% equity interest in Haliburton Forest; and a 60% interest in the redevelopment of the peripheral lands of the Muskoka Grandview Resort in Huntsville, Ontario. The company was formerly known as H.A.L. Concepts, Ltd. and changed its name to Halmont Properties Corporation in February 2007. Halmont Properties Corporation was incorporated in 2000 and is headquartered in Toronto, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Toronto"}, "KDSX.V": {"short_name": "KADESTONE CAPITAL CORP", "long_name": "Kadestone Capital Corp.", "summary": "Kadestone Capital Corp. engages in the acquisition, development, and management of residential and commercial income producing properties primarily in Metro Vancouver and Kelowna markets, Canada. The company was incorporated in 2019 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "KGF.V": {"short_name": "KING GEORGE FINANCIAL CORPORATI", "long_name": "King George Financial Corporation", "summary": "King George Financial Corporation develops commercial and residential real estate properties in Canada. The company operates through Real Estate Development, Hotel Development and Operation, Management and Finance Services, and Other segments. It also invests in real estate and hotel related securities. The company was incorporated in 1999 and is based in Vancouver, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "VAN", "market": "ca_market", "country": "Canada", "city": "Vancouver"}, "MODVF": {"short_name": "MELCOR DEVELOPMENTS", "long_name": "Melcor Developments Ltd.", "summary": "Melcor Developments Ltd. operates as a real estate development company in the United States and Canada. The company operates through Community Development, Property Development, Investment Properties, REIT, and Recreational Property segments. It develops, manages, and owns mixed-use residential communities, business and industrial parks, office buildings, retail commercial centers, and golf courses. The company purchases and develops land to be sold as residential, industrial, and commercial lots; develops, constructs, and leases retail, office, and industrial properties; and owns and leases residential, commercial, retail, and industrial properties. It also owns and manages three 18-hole championship golf courses. The company was founded in 1923 and is headquartered in Edmonton, Canada.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Edmonton"}, "MRD.TO": {"short_name": "MELCOR DEV", "long_name": "Melcor Developments Ltd.", "summary": "Melcor Developments Ltd. operates as a real estate development company in the United States and Canada. The company operates through Community Development, Property Development, Investment Properties, REIT, and Recreational Property segments. It develops, manages, and owns mixed-use residential communities, business and industrial parks, office buildings, retail commercial centers, and golf courses. The company purchases and develops land to be sold as residential, industrial, and commercial lots; develops, constructs, and leases retail, office, and industrial properties; and owns and leases residential, commercial, retail, and industrial properties. It also owns and manages three 18-hole championship golf courses. The company was founded in 1923 and is headquartered in Edmonton, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Edmonton"}, "WFC.TO": {"short_name": "WALL FINANCIAL", "long_name": "Wall Financial Corporation", "summary": "Wall Financial Corporation, together with its subsidiaries, operates as a real estate investment and development company in Canada. It operates through three segments: Rental, Hotel, and Development. The company owns and manages residential and commercial properties; owns and manages hotel properties; and develops and sells residential housing properties. It also engages in the development and management of residential rental units; and development and construction of residential housing for re-sale. As of January 31, 2020, it owned hotel units was 934; and thirteen rental properties in Metro Vancouver, consisting of 1,390 residential and ten commercial rental units. Wall Financial Corporation was founded in 1969 and is headquartered in Vancouver, Canada.", "currency": "CAD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Vancouver"}}