{
    "NWH-UN.TO": {
        "short_name": "NORTHWEST HEALTHCARE PROP REIT",
        "long_name": "NorthWest Healthcare Properties Real Estate Investment Trust",
        "summary": "NorthWest Healthcare Properties Real Estate Investment Trust (TSX: NWH.UN) (NorthWest) is an unincorporated, open-ended real estate investment trust established under the laws of the Province of Ontario. As at September 30, 2020, the REIT provides investors with access to a portfolio of high quality international healthcare real estate infrastructure comprised of interests in a diversified portfolio of 190 income-producing properties and 15.4 million square feet of gross leasable area located throughout major markets in Canada, Brazil, Europe, Australia and New Zealand. The REIT's portfolio of medical office buildings, clinics, and hospitals is characterized by long term indexed leases and stable occupancies. With a fully integrated and aligned senior management team, the REIT leverages over 200 professionals across nine offices in 5 countries to serve as a long-term real estate partner to leading healthcare operators.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PINE-UN.V": {
        "short_name": "PINE TRAIL REAL ESTATE INVESTME",
        "long_name": "Pine Trail Real Estate Investment Trust",
        "summary": "Pine Trail Real Estate Investment Trust is a real estate investment firm. The Trust intends to identify and selectively acquire complementary commercial properties to build a portfolio which provides stability, reliable distributions and capital appreciation.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Healthcare Facilities",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    }
}