{"AMRK.TA": {"short_name": "AMIR MARKETING AND", "long_name": "Amir Marketing and Investments in Agriculture Ltd.", "summary": "Amir Marketing and Investments in Agriculture Ltd. engages in the business of agricultural products for private farmers in Israel. It is involved in the sale, service, storage, and transportation of agricultural products, such as pesticides, fertilizers, packaging products, technical equipment, animal feed, greenhouse covers, shears, tools, and irrigation equipment for agriculture and gardening. The company also produces animal food mixes for cattle, goats, sheep, poultry, and geese. In addition, it rents commercial properties. The company was founded in 2004 and is based in Hefer, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Agricultural Inputs", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Hefer"}, "BRND.TA": {"short_name": "BRAND INDUSTRIES", "long_name": "Brand Industries Ltd.", "summary": "Brand Industries Ltd., together with its subsidiaries, provides metal industry solutions for the infrastructure, energy, and security markets in Israel. The company offers range of products and services for power plants, specialized equipment, and power distribution elements; large-scale plants and infrastructure; and high-rise and complex buildings. It also designs and manufactures LPG and petrol pressure tanks, and pressurized air tanks; and tankers, aircraft refuelers, firefighting trucks, armored vehicles, and special purpose trailers, as well as provides site erection, installation, and logistical services. In addition, the company undertakes turnkey natural gas projects; large scale projects in the industrial, energy, and infrastructure related fields; and erects power plants, large steel structures, bridges, tanks, and pressure vessels. It serves industrial, energy, and security companies; and government agencies. The company was founded in 1978 and is based in Yeruham, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Steel", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Yeruham"}, "GAGR.TA": {"short_name": "GAON GROUP", "long_name": "Gaon Group Ltd.", "summary": "Gaon Group Ltd. produces and sells pipes, valves, hydrants, and accessories in Israel. The company offers steel and plastic pipes, as well as structural pipes for water, sewerage, oil and gas, and construction industries. It also provides low pressure valves comprising butterfly, gate, diaphragm, and check valves and stariners for water and wastewater, chemicals, firefighting, air conditioning, desalination, and agriculture applications; and water metering solutions. In addition, the company engages in the hot dip galvanization of steel items; and manufacture of household and infrastructure piping, ducts, and profiles. Further, it offers ball-type faucets and fixtures. The company was formerly known as Middle East Tube Company Ltd. and changed its name to Gaon Group Ltd. in March 2017. The company was founded in 1951 and is based in Or Yehuda, Israel. Gaon Group Ltd. operates as a subsidiary of B. Gaon Holdings Ltd.", "currency": "ILA", "sector": "Basic Materials", "industry": "Steel", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Or Yehuda"}, "HAP.TA": {"short_name": "HADERA PAPER LTD", "long_name": "Hadera Paper Ltd.", "summary": "Hadera Paper Ltd., through its subsidiaries, manufactures and sells writing and printing paper, packaging paper, cardboard and corrugated boards, and recycled paper products in Israel and internationally. It provides collection and recycling services for wastepaper, cardboard and plastic waste, electronic waste, and other recyclable materials; and offers cardboard packaging solutions for the food, cosmetics, pharmaceutics, textile, high-tech, games, plastic, and metal products. The company also offers office supplies, paper and paper products, technology and peripherals, hobbies and crafts, furniture, food, and cleaning products. The company was formerly known as American Israeli Paper Mills Ltd. and changed its name to Hadera Paper Ltd. in July 2008. Hadera Paper Ltd. was founded in 1951 and is based in Hadera, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Hadera"}, "HOD.TA": {"short_name": "HOD-ASSAF INDS", "long_name": "Hod Assaf Industries Ltd.", "summary": "Hod Assaf Industries Ltd., together with its subsidiaries, manufactures and sells steel bars for construction, welded meshes for concrete reinforcement, and galvanized and drawn wires in Israel and Romania. The company offers products, such as steel for construction, processed steel for construction, assembled and welded elements, fences and concertinas, welded meshes for concrete reinforcement, and wires and auxiliary products. It also produces copper and aluminum wires and cables for electrical and control applications; supplies tools and equipment for construction; and manufactures galvanized and tensioned wires, barbed wires, nails, steel cables for cranes, mines, anchors, and other applications. In addition, the company is involved in processing and trading wood products for construction and communication industries. It serves customers in construction, infrastructure, security, and agricultural sectors and industries. The company was founded in 1947 and is based in Acre, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Steel", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Acre"}, "ICL": {"short_name": "ICL Group Ltd.", "long_name": "ICL Group Ltd", "summary": "ICL Group Ltd, together with its subsidiaries, operates as a specialty minerals and chemicals company worldwide. It operates in four segments: Industrial Products, Potash, Phosphate Solutions, and Innovative Ag Solutions (IAS). The Industrial Products segment produces bromine out of a solution that is a by-product of the potash production process, as well as bromine-based compounds; produces various grades of potash, salt, magnesium chloride, and magnesia products; and produces and markets phosphorous-based flame retardants and other phosphorus-based products. The Potash segment extracts potash from the Dead Sea; mines and produces potash and salt; produces Polysulphate; produces, markets, and sells magnesium and magnesium alloys, as well as related by-products, including chlorine and sylvinite; and sells salt. The Phosphate Solutions segment produces specialty products; produces and markets phosphate-based fertilizers, as well as sulphuric acid, green phosphoric acid, and phosphate fertilizers; and manufactures thermal phosphoric acid for various industrial end markets, such as oral care, cleaning products, paints and coatings, water treatment, asphalt modification, construction, and metal treatment. It also develops and produces functional food ingredients and phosphate additives for use in the processed meat, poultry, seafood, dairy, beverage, and baked goods markets; and produces milk and whey proteins for the food ingredients industry. The IAS segment develops, manufactures, markets, and sells fertilizers based primarily on nitrogen, potash, and phosphate, including water soluble specialty, liquid, soluble, and controlled-release fertilizers. The company sells its products through marketing companies, agents, and distributors. The company was formerly known as Israel Chemicals Ltd. and changed its name to ICL Group Ltd in May 2020. ICL Group Ltd was founded in 1968 and is headquartered in Tel Aviv, Israel.", "currency": "USD", "sector": "Basic Materials", "industry": "Agricultural Inputs", "exchange": "NYQ", "market": "us_market", "country": "Israel", "city": "Tel Aviv"}, "ILCO.TA": {"short_name": "THE ISRAEL CORP", "long_name": "Israel Corporation Ltd", "summary": "Israel Corporation Ltd, together with its subsidiaries, engages in the specialty minerals and chemicals, and refining and petrochemicals businesses in Israel, Europe, North America, Asia, South America, and internationally. It extracts raw materials, including potash and bromine from Dead Sea; and specialty phosphates from phosphate rock mines. The company offers bromine-based flame retardants and industrial solutions; elemental bromine; bromine compounds; magnesium; phosphorous-based industrial compounds; specialty agriculture products; phosphate fertilizers; green phosphoric acid; phosphorus-based flame retardants; clear brine fluids; calcium products; brominated biocides; organic and inorganic bromides; potassium chloride; magnesium dichloride; and magnesia products. It also provide specialty fertilizers, including soluble fertilizers, which includes water-soluble straights and water-soluble NPK; controlled release fertilizers; and liquid NPK fertilizers. In addition, the company produces fuel products; raw materials for the petrochemical industry; materials for the plastics industry; and oils, waxes, and related products, as well as provides power and water, including steam services to various industries in Haifa. Its products are primarily used in the areas of agriculture, electronics, construction, automotive, oil drilling, food, furniture, pharmaceutical, textile, water treatment, metal treatment, oral care, carbonated drinks, asphalt modification, paints and coatings, and other industries. The company was founded in 1968 and is based in Tel Aviv, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "INRM.TA": {"short_name": "INROM CONSTRUCTION", "long_name": "Inrom Construction Industries Ltd", "summary": "Inrom Construction Industries Ltd produces, markets, and sells various products and solutions for the construction and renovation industries in Israel. It offers flooring, and environment and landscape development products, such as interlocking stones, curbstones, steps and dimples, terrazzo tiles, and various claddings; and concrete plants, including underground infrastructure products. The company also manufactures and markets construction adhesive products comprising cement adhesives for gluing tiles, various cladding surfaces for interior and exterior design, colored guns, mortar products for flooring, and others; plaster products, shlichat and shtetl products, special cement products, and additives for various construction projects; and sealants, coatings, and bonding materials. In addition, it provides construction paint products for interior and exterior works, decorative colors for special designs, and various coatings; electrostatic powder paints for metal products and other materials; industrial paints, including wet paint and primer products for coating concrete floors and industrial designation. The company serves entrepreneurs, contractors, self-builders, architects, interior designers, building inspectors, and professionals in construction-related sectors. Inrom Construction Industries Ltd was founded in 2013 and is based in Airport City, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Airport City"}, "KAFR.TA": {"short_name": "KAFRIT INDUSTRIES", "long_name": "Kafrit Industries (1993) Ltd", "summary": "Kafrit Industries (1993) Ltd develops, manufactures, and sells customized masterbatches and compounds for the plastic industry worldwide. The company offers masterbatches and compounds for polycarbonate and PMMA sheets, halogen free solutions for sheets and pipes, agricultural films, polyethylene packaging polypropylene cast and calender films, and blowing agents. It also provides CONSTAB and CONPEEL compounds, injection/blow moldings, and antioxidants; Ecocell, a revolutionary foaming agent to reduce material and resin consumption; BOPE, a sustainable solution for flexible packaging films; and antimony free/reduced antimony FR solutions. The company offers its products for various applications, such as packaging films, including BOPP, CPP, and PE, as well as PC sheet, agricultural derivatives, biopolymers, flame retardant, PEX pipes, fibers, and nonwovens. Kafrit Industries (1993) Ltd was founded in 1973 and is based in Sha'ar HaNegev, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Sha'ar HaNegev"}, "KLIL.TA": {"short_name": "KLIL INDUSTRIES", "long_name": "Klil Industries Ltd", "summary": "Klil Industries Ltd designs, develops, manufactures, and markets aluminum systems for the building and industry sectors in Israel and internationally. It offers sliding and hinges windows; balcony and interior doors, as well as front entrances; rolling shutter systems; and curtain walls, coatings and colors, industry profiles, and window accessories. The company was founded in 1950 and is based in Karmiel, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Karmiel"}, "MNIN.TA": {"short_name": "MENDELSON INFRASTR", "long_name": "Mendelson Infrastructures & Industries Ltd.", "summary": "Mendelson Infrastructures & Industries Ltd. engages in the marketing and supply of fluid conveyance equipment in Israel. It operates through Trade in Israel and Other segments. The company also manufactures and markets pipes. Its products include steel, stainless steel, P.V.C., galvanized steel, copper, polyethylene, and casting steel pipes; and pipes for conveyance of fluids, such as water, sewage, gas, fuel, oil, steam, chemicals, etc. In addition, the company offers pipeline accessories, such as fittings designed for connections of industrial tubes, security and adjustment valves, faucets, sealing products, fittings command and control systems, pressure meters, and firefighting systems. Further, it provides bathroom products, including faucets, bathtubs, showers, basins, toilet bowls, and furniture and accessories; and semi-finished plastic products for pipeline engineering plats, bars, and cylinders. Additionally, the company engages in the assembly and maintenance of water pumps; and refurbish of electric motors. It serves chemical and petrochemical industries; food and pharmaceutical industries; military and security industries; energy and oil companies; air condition companies; and subcontractors, as well as public companies and institutions. Mendelson Infrastructures & Industries Ltd. distributes its products through its agents and stores. The company was formerly known as MENDELSON S.BAR Technical & Engineering Supply - KAMAN (2005) Ltd and changed its name to Mendelson Infrastructures & Industries Ltd. in June 2013. The company was founded in 1947 and is based in Kiryat Ata, Israel. Mendelson Infrastructures & Industries Ltd. Is a subsidiary of Emilia Development (O.F.G) Ltd.", "currency": "ILA", "sector": "Basic Materials", "industry": "Steel", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Kiryat Ata"}, "NALA.TA": {"short_name": "NALA DIGITAL COMME", "long_name": "Nala Digital Commerce Ltd", "summary": "Nala Digital Commerce Ltd, a multi-commodity gemstone mining exploration company, explores for, develops, and produces gemstones projects in Northern Israel. The company primarily explores for diamond, moissanite, corundum, ruby, garnet, hibonite, spinel, ilmenite, and sapphire, as well as zircon and rutile. Its flagship projects include the Mount Carmel and Kishon River Mid-Reach projects. The company was formerly known as Shefa Yamim Ltd and changed its name to Nala Digital Commerce Ltd in November 2020. Nala Digital Commerce Ltd was founded in 1999 and is based in Acre, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Acre"}, "POLP.TA": {"short_name": "POLYRAM PLASTIC IN", "long_name": "Polyram Plastic Industries LTD", "summary": "Polyram Plastic Industries LTD manufactures and supplies thermoplastic compounds. Its products include engineering plastics; functional polymers, including coupling agents, compatibilizers, impact modifiers, and adhesive resins for applications in automotive, multi-layer film, industrial, and packaging; polytron materials, which are primarily used in automotive sector; and purging agents. The company offers its products through distributors in Israel and internationally. Polyram Plastic Industries LTD was founded in 1986 and is headquartered in Moshav Ram-On, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Gilboa"}, "PTCH.TA": {"short_name": "ISRAEL PETROCHEMIC", "long_name": "Israel Petrochemical Enterprises Ltd.", "summary": "Israel Petrochemical Enterprises Ltd., together with its subsidiaries, operates in the energy and petrochemical industry worldwide. The company is involved in refining of crude oil and provision of various petroleum products, such as gas, liquefied petroleum gases, naphtha, gasoline, kerosene oils, various diesels, various fuel oils, waxy substances, and bitumen that is used in industrial operation, transportation, private consumption, agriculture, and infrastructures. It also manufactures raw materials for the plastic industry comprising polypropylene and polyethylene. In addition, the company manufactures aromatic substances, which include benzene, paraxylene, orthoxylene, and toluene that are used as ingredients in the manufacture of other products in the chemical and petrochemical industry; and are used as raw materials for clothing, medicine, packaging, cosmetics, paints, vehicle spare parts, and home maintenance products. Further, it provides basic oils and lubricating oils used for the vehicle and other industries; and paraffin wax used for candles, tires, fertilizers, detergents, rubber, and adhesives, as well as leases tankers to transport petroleum products or aromatics. It serves fuel and gas marketing companies, industries, gas stations, and plastics plants. Israel Petrochemical Enterprises Ltd. sells its products through agents. The company was founded in 1961 and is headquartered in Tel Aviv, Israel. Israel Petrochemical Enterprises Ltd. is a subsidiary of Alverstone Ltd.", "currency": "ILA", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "PVNNF": {"short_name": "P V NANO CELL LTD", "long_name": "P.V. Nano Cell Ltd.", "summary": "P.V. Nano Cell Ltd. engages in developing, manufacturing, marketing, and commercializing conductive inks for digital inkjet conductive printing applications. The company develops the Sicrys family of single crystal nano-metric conductive inks; and silver-based Sicrys inks for photovoltaic and printed electronics (PE) applications. It also offers copper-based nano-metric inks for mass-production of PE. In addition, the company manufactures printing machines, which offer solutions for inkjet print-quality technologies. It operates in Israel, Germany, France, Holland, Austria, the United States, and internationally. The company was founded in 2009 and is headquartered in Migdal Ha'Emek, Israel.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "Israel", "city": "Migdal Haâ\u0080\u0099Emek"}, "RIMO.TA": {"short_name": "RIMONI INDUSTRIES", "long_name": "Rimoni Industries Ltd.", "summary": "Rimoni Industries Ltd. engages in the design, engineering, and manufacturing of molds, and precise injection molding and assemblies for the medical, automotive, agricultural, high-tech, and consumer industries in Israel. It offers hardened steel molds, including multi-cavity molds, molds with hot runner systems, prototype molds for complex and intricate products, molds for micro-precision parts, over-moldings, and others. The company also provides precision plastic parts by thermoplastic injection molding; and assembly services for injection molding products. Rimoni Industries Ltd. was founded in 1954 and is based in Modi'in-Maccabim-Re'ut, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Modi'in-Maccabim-Re'ut"}, "RMN.TA": {"short_name": "RAM-ON INVESTMENTS", "long_name": "Ram-On Investments and Holdings (1999) Ltd", "summary": "Ram-On Investments and Holdings (1999) Ltd manufactures and markets engineering thermoplastic compounds. The company's products include adhesives, and linking and performance enhancers. It also engages in the building rental business in Israel. It primarily serves irrigation, automotive, electrical, and electronics industries in Israel, the United States, and Europe. The company was formerly known as Poliram (1999) Ltd and changed its name to Ram-On Investments and Holdings (1999) Ltd in September 2015. Ram-On Investments and Holdings (1999) Ltd was incorporated in 1999 and is based in Gilboa, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Gilboa"}, "SAFO": {"short_name": "SAVE FOODS INC", "long_name": "Save Foods, Inc.", "summary": "Save Foods, Inc., a food-tech company, focuses on developing and selling various products to extend the shelf life and ensure food safety of fresh fruits and vegetables. The company has developed various sanitizing solutions for fresh produce with high efficiency against human pathogens, as well as against plant pathogens, as well as to ensure food safety, extend shelf life, and reduce food waste. Its products are based on proprietary blend of food acids combined with an oxidizer, and is capable of cleaning, sanitizing, and controlling pathogens that render produce unsafe for human consumption or which lead to various forms of decay in fruit and vegetable. The company's principal products include SF3, an organic food acids blend; SpuDefender product for controlling post-harvest potato sprouts; and FreshProtect product for controlling spoilage microorganisms on post-harvest citrus. Save Foods, Inc. was incorporated in 2009 and is based in Tel Aviv, Israel.", "currency": "USD", "sector": "Basic Materials", "industry": "Agricultural Inputs", "exchange": "PNK", "market": "us_market", "country": "Israel", "city": "Tel Aviv"}, "SEFA.L": {"short_name": "SHEFA GEMS LTD ORD NIS0.10 (DI)", "long_name": "Shefa Gems Ltd", "summary": "Shefa Gems Ltd operates as a precious stone exploration company in northern Israel. The company explores for diamonds, natural moissanites, sapphires, rubies, garnets, hibonites, spinels, and ilmenites, as well as gold deposits; and heavy minerals, including zircon and rutile. It has interests in exploration and prospecting permits in the Kishon River catchment area of Haifa and Mount Carmel that covers a total area of approximately 614 square kilometers. The company was formerly known as Shefa Yamim (A.T.M.) Ltd. and changed its name to Shefa Gems Ltd in June 2019. Shefa Gems Ltd was founded in 1999 and is based in Netanya, Israel.", "currency": "GBp", "sector": "Basic Materials", "industry": "Other Precious Metals & Mining", "exchange": "LSE", "market": "gb_market", "country": "Israel", "city": "Netanya"}, "SHAN.TA": {"short_name": "SHANIV PAPER IND", "long_name": "Shaniv Paper Industry Ltd", "summary": "Shaniv Paper Industry Ltd develops, manufactures, and markets paper products in Israel and internationally. It offers toilet paper, paper towels, tissue paper, and paper napkins, as well as a line of products for rolling for the institutional market. household, automotive, personal care, institutional, and industrial. The company also provides detergents; bleach products; products for cleaning and handling various surfaces; pesticide products for household use; laundry and perfume products; complementary products for cleaning and maintenance of the house, such as cloths, scrubbing pillows, nylon bags, kitchen auxiliary products, and disposable products; and soaps and toiletries, hair and skin care products, sun blocking products, deodorants, and shaving gels under the Touch and Lovely brand names. In addition, it offers automotive and industry maintenance and servicing products, including urea additives; oils and greases; cooling system liquids; maintenance sprays; vehicle care products; grease removers; professional washing preparations; and hand cleaning and hygiene products under the MAXOL-MAX name. The company's products are used in various sectors, such as household, automotive, personal care, institutional, and industrial sectors. The company was founded in 1988 and is based in Ofakim, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Ofakim"}}