{
    "AMRK.TA": {
        "short_name": "AMIR MARKETING AND",
        "long_name": "Amir Marketing and Investments in Agriculture Ltd.",
        "summary": "Amir Marketing and Investments in Agriculture Ltd. engages in the business of agricultural products for private farmers in Israel. It is involved in the sale, service, storage, and transportation of agricultural products, such as pesticides, fertilizers, packaging products, technical equipment, animal feed, greenhouse covers, shears, tools, and irrigation equipment for agriculture and gardening. The company also produces animal food mixes for cattle, goats, sheep, poultry, and geese. In addition, it rents commercial properties. The company was founded in 2004 and is based in Hefer, Israel.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Hefer",
        "zipcode": "38777",
        "website": "http://www.amir-agricul.co.il",
        "market_cap": 341466944
    },
    "ICL": {
        "short_name": "ICL Group Ltd.",
        "long_name": "ICL Group Ltd",
        "summary": "ICL Group Ltd, together with its subsidiaries, operates as a specialty minerals and chemicals company worldwide. It operates in four segments: Industrial Products, Potash, Phosphate Solutions, and Innovative Ag Solutions (IAS). The Industrial Products segment produces bromine out of a solution that is a by-product of the potash production process, as well as bromine-based compounds; produces various grades of potash, salt, magnesium chloride, and magnesia products; and produces and markets phosphorous-based flame retardants and other phosphorus-based products. The Potash segment extracts potash from the Dead Sea; mines and produces potash and salt; produces Polysulphate; produces, markets, and sells magnesium and magnesium alloys, as well as related by-products, including chlorine and sylvinite; and sells salt. The Phosphate Solutions segment uses phosphate commodity products to produce specialty products; produces and markets phosphate-based fertilizers, as well as sulphuric acid, green phosphoric acid, and phosphate fertilizers; and manufactures thermal phosphoric acid for various industrial end markets, such as oral care, cleaning products, paints and coatings, water treatment, asphalt modification, construction, and metal treatment. It also develops and produces functional food ingredients and phosphate additives for use in the processed meat, poultry, seafood, dairy, beverage, and baked goods markets; and produces milk and whey proteins for the food ingredients industry. The IAS segment develops, manufactures, markets, and sells fertilizers based primarily on nitrogen, potash, and phosphate, including water soluble specialty, liquid, soluble, and controlled-release fertilizers. It sells its products through marketing companies, agents, and distributors. The company was formerly known as Israel Chemicals Ltd. and changed its name to ICL Group Ltd in May 2020. ICL Group Ltd was founded in 1968 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6107025",
        "website": "http://www.icl-group.com",
        "market_cap": 8236603392
    },
    "ICL.TA": {
        "short_name": "ICL GROUP LTD",
        "long_name": "ICL Group Ltd",
        "summary": "ICL Group Ltd, together with its subsidiaries, operates as a specialty minerals and chemicals company worldwide. It operates in four segments: Industrial Products, Potash, Phosphate Solutions, and Innovative Ag Solutions (IAS). The Industrial Products segment produces bromine out of a solution that is a by-product of the potash production process, as well as bromine-based compounds; produces various grades of potash, salt, magnesium chloride, and magnesia products; and produces and markets phosphorous-based flame retardants and other phosphorus-based products. The Potash segment extracts potash from the Dead Sea; mines and produces potash and salt; produces Polysulphate; produces, markets, and sells magnesium and magnesium alloys, as well as related by-products, including chlorine and sylvinite; and sells salt. The Phosphate Solutions segment uses phosphate commodity products to produce specialty products; produces and markets phosphate-based fertilizers, as well as sulphuric acid, green phosphoric acid, and phosphate fertilizers; and manufactures thermal phosphoric acid for various industrial end markets, such as oral care, cleaning products, paints and coatings, water treatment, asphalt modification, construction, and metal treatment. It also develops and produces functional food ingredients and phosphate additives for use in the processed meat, poultry, seafood, dairy, beverage, and baked goods markets; and produces milk and whey proteins for the food ingredients industry. The IAS segment develops, manufactures, markets, and sells fertilizers based primarily on nitrogen, potash, and phosphate, including water soluble specialty, liquid, soluble, and controlled-release fertilizers. It sells its products through marketing companies, agents, and distributors. The company was formerly known as Israel Chemicals Ltd. and changed its name to ICL Group Ltd in May 2020. ICL Group Ltd was founded in 1968 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6107025",
        "website": "http://www.icl-group.com",
        "market_cap": 30382989312
    },
    "SAFO": {
        "short_name": "SAVE FOODS INC",
        "long_name": "Save Foods, Inc.",
        "summary": "Save Foods, Inc. develops and sells eco-friendly green solutions to enhance food safety and shelf life of fresh fruits and vegetables. Its products include SavePROTECT or PeroStar, a processing aids used in post-harvest treatment added to fruit and vegetable wash water; and SF3HS and SF3H, a post-harvest cleaning and sanitizing solution to control both plant and foodborne pathogens. The company also offers SpuDefender product for controlling post-harvest potato sprouts; and FreshProtect product for controlling spoilage microorganisms on post-harvest citrus. Its products are based on proprietary blend of food acids combined with an oxidizer, and is capable of cleaning, sanitizing, and controlling pathogens on fresh produce safer for human consumption or which lead to various forms of decay in fruit and vegetable. Save Foods, Inc. was incorporated in 2009 and is headquartered in Lower Galilee, Israel.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Lower Galilee",
        "zipcode": "3657700",
        "website": "http://savefoods.co",
        "market_cap": 20887880
    }
}