{"PTCH.TA": {"short_name": "ISRAEL PETROCHEMIC", "long_name": "Israel Petrochemical Enterprises Ltd.", "summary": "Israel Petrochemical Enterprises Ltd., together with its subsidiaries, operates in the energy and petrochemical industry worldwide. The company is involved in refining of crude oil and provision of various petroleum products, such as gas, liquefied petroleum gases, naphtha, gasoline, kerosene oils, various diesels, various fuel oils, waxy substances, and bitumen that is used in industrial operation, transportation, private consumption, agriculture, and infrastructures. It also manufactures raw materials for the plastic industry comprising polypropylene and polyethylene. In addition, the company manufactures aromatic substances, which include benzene, paraxylene, orthoxylene, and toluene that are used as ingredients in the manufacture of other products in the chemical and petrochemical industry; and are used as raw materials for clothing, medicine, packaging, cosmetics, paints, vehicle spare parts, and home maintenance products. Further, it provides basic oils and lubricating oils used for the vehicle and other industries; and paraffin wax used for candles, tires, fertilizers, detergents, rubber, and adhesives, as well as leases tankers to transport petroleum products or aromatics. It serves fuel and gas marketing companies, industries, gas stations, and plastics plants. Israel Petrochemical Enterprises Ltd. sells its products through agents. The company was founded in 1961 and is headquartered in Tel Aviv, Israel. Israel Petrochemical Enterprises Ltd. is a subsidiary of Alverstone Ltd.", "currency": "ILA", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Tel Aviv"}, "RMN.TA": {"short_name": "RAM-ON INVESTMENTS", "long_name": "Ram-On Investments and Holdings (1999) Ltd", "summary": "Ram-On Investments and Holdings (1999) Ltd manufactures and markets engineering thermoplastic compounds. The company's products include adhesives, and linking and performance enhancers. It also engages in the building rental business in Israel. It primarily serves irrigation, automotive, electrical, and electronics industries in Israel, the United States, and Europe. The company was formerly known as Poliram (1999) Ltd and changed its name to Ram-On Investments and Holdings (1999) Ltd in September 2015. Ram-On Investments and Holdings (1999) Ltd was incorporated in 1999 and is based in Gilboa, Israel.", "currency": "ILA", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "TLV", "market": "il_market", "country": "Israel", "city": "Gilboa"}}