{
  "PTCH.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Chemicals",
    "long_name": "Israel Petrochemical Enterprises Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "ISRAEL PETROCHEMIC",
    "state": null,
    "summary": "Israel Petrochemical Enterprises Ltd., together with its subsidiaries, operates in the petrochemicals industry worldwide. The company is involved in processing of crude oil and provision of various petroleum products, such as gasoline, naphtha, diesel, kerosene, fuel oil, and bitumen. It also manufactures raw materials for the plastic industry comprising polypropylene and polyethylene. In addition, the company manufactures aromatic substances, which include benzene, paraxylene, orthoxylene, and toluene that are used as ingredients in the manufacture of other products. Further, it provides basic oils and waxes, as well as leases tankers to transport fuel products. The company serves fuel and gas marketing companies, industries, gas stations. Israel Petrochemical Enterprises Ltd. sells its products through agents and distributors. The company was founded in 1961 and is headquartered in Tel Aviv, Israel. Israel Petrochemical Enterprises Ltd. is a subsidiary of Alverstone Ltd.",
    "website": "http://www.israel-petro.co.il",
    "zipcode": "64733"
  },
  "RMN.TA": {
    "city": "Gilboa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Chemicals",
    "long_name": "Ram-On Investments and Holdings (1999) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "RAM-ON INVESTMENTS",
    "state": null,
    "summary": "Ram-On Investments and Holdings (1999) Ltd develops, manufactures, and markets engineering thermoplastic compounds. The company provides adhesives and enhancers. It also engages in the building rental business. It primarily serves irrigation, automotive, electrical appliances, and electronic accessories industries in Israel, the United States, and Europe. The company was formerly known as Poliram (1999) Ltd and changed its name to Ram-On Investments and Holdings (1999) Ltd in September 2015. Ram-On Investments and Holdings (1999) Ltd was incorporated in 1999 and is based in Gilboa, Israel.",
    "website": "http://www.polyram.co.il",
    "zipcode": "19205"
  }
}
