{
  "57N.F": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Specialty Chemicals",
    "long_name": "Dotz Nano Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "DOTZ NANO LTD",
    "state": null,
    "summary": "Dotz Nano Limited, a technology company, develops and commercializes graphene quantum dots for use in tracing, anti-counterfeiting, and product-liability applications. It provides ValiDotz, BioDotz, Fluorensic, and InSpec solutions for use in crude oil and gas, agrochemicals tagging, polymer tagging, bioimaging, DEF, lubricant, frac fluids tracing, and print and package industry segments. The company sells its products through distributors in North America, Europe, Japan, China, and Australia. It has scientific collaborations and partnerships with various academic institutes. Dotz Nano Limited is headquartered in Petah Tikva, Israel.",
    "website": "http://www.dotz.tech",
    "zipcode": "4951446"
  },
  "DTZ.AX": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Specialty Chemicals",
    "long_name": "Dotz Nano Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Basic Materials",
    "short_name": "DOTZ NANO FPO",
    "state": null,
    "summary": "Dotz Nano Limited, a technology company, develops and commercializes graphene quantum dots for use in tracing, anti-counterfeiting, and product-liability applications. It provides ValiDotz, BioDotz, Fluorensic, and InSpec solutions for use in crude oil and gas, agrochemicals tagging, polymer tagging, bioimaging, DEF, lubricant, frac fluids tracing, and print and package industry segments. The company sells its products through distributors in North America, Europe, Japan, China, and Australia. It has scientific collaborations and partnerships with various academic institutes. Dotz Nano Limited is headquartered in Petah Tikva, Israel.",
    "website": "http://www.dotz.tech",
    "zipcode": "4951446"
  },
  "ILCO.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Chemicals",
    "long_name": "Israel Corporation Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "THE ISRAEL CORP",
    "state": null,
    "summary": "Israel Corporation Ltd, together with its subsidiaries, engages in the specialty minerals and chemicals, and refining and petrochemicals businesses in Europe, Asia, North America, South America, and internationally. The company offers bromine and bromine-based compounds; magnesia, calcium carbonate, and salt products; phosphorous-based products; potash, salt, polysulphate, and magnesium; phosphate rock and fertilizer-grade phosphoric acid; phosphate-based fertilizers; sulphuric and green phosphoric acids; and controlled release fertilizers, water soluble fertilizers, liquid fertilizers, and straights. It also provides bromine-based and phosphorus-based flame retardants; elemental bromine; clear brine fluids; industrial brominated biocides; inorganic bromides; phosphorus-based industrial compounds; MgCl2; and technical grade KCl products. In addition, the company produces fuel products; raw materials for the petrochemical industry; and materials for the plastics industry, as well as provides power and water, including steam services to various industries in Haifa. Its products are primarily used in the areas of agriculture, electronics, food, fuel and gas exploration, water purification and desalination, detergents, cosmetics, pharmaceuticals, and automotive. The company was founded in 1968 and is based in Tel Aviv, Israel.",
    "website": "http://www.israelcorp.com",
    "zipcode": "61204"
  },
  "KAFR.TA": {
    "city": "Sha'ar HaNegev",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Chemicals",
    "long_name": "Kafrit Industries (1993) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "KAFRIT INDUSTRIES",
    "state": null,
    "summary": "Kafrit Industries (1993) Ltd develops, manufactures, and sells customized masterbatches and compounds for the plastic industry worldwide. The company offers masterbatches and compounds for polycarbonate and PMMA sheets, halogen free solutions for sheets and pipes, agricultural films, polyethylene packaging polypropylene cast and calender films, and blowing agents. It also provides CONSTAB and CONPEEL compounds, injection/blow moldings, and antioxidants; Ecocell, a revolutionary foaming agent to reduce material and resin consumption; BOPE, a sustainable solution for flexible packaging films; and antimony free/reduced antimony FR solutions. The company offers its products for various applications, such as packaging films, including BOPP, CPP, and PE, as well as PC sheet, agricultural derivatives, biopolymers, flame retardant, PEX pipes, fibers, and nonwovens. Kafrit Industries (1993) Ltd was founded in 1973 and is based in Sha'ar HaNegev, Israel.",
    "website": "http://www.kafrit.co.il",
    "zipcode": "8514200"
  },
  "POLP.TA": {
    "city": "Gilboa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Chemicals",
    "long_name": "Polyram Plastic Industries LTD",
    "market": "il_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "POLYRAM PLASTIC IN",
    "state": null,
    "summary": "Polyram Plastic Industries LTD manufactures and supplies thermoplastic compounds. Its products include engineering plastics; functional polymers, including coupling agents, compatibilizers, impact modifiers, and adhesive resins for applications in automotive, multi-layer film, industrial, and packaging; polytron materials, which are primarily used in automotive sector; and purging agents. The company offers its products through distributors in Israel and internationally. Polyram Plastic Industries LTD was founded in 1986 and is headquartered in Moshav Ram-On, Israel.",
    "website": "http://www.polyram-group.com",
    "zipcode": null
  },
  "PVNNF": {
    "city": "Migdal Haemek",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Specialty Chemicals",
    "long_name": "P.V. Nano Cell Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Basic Materials",
    "short_name": "P V NANO CELL LTD",
    "state": null,
    "summary": "P.V. Nano Cell Ltd. engages in developing, manufacturing, marketing, and commercializing conductive inks for digital inkjet conductive printing applications. The company develops the Sicrys family of single crystal nano-metric conductive inks; and silver-based Sicrys inks for printed electronics (PE) applications, including photovoltaic devices, printed passive components, circuit boards, mobile phone antennas, 3D printed electronic devices, radio-frequency identification chips, sensors and touchscreens, and other digital PE, as well as printing of windshields in automotive. It also offers copper-based nano-metric inks for mass-production of PE. In addition, the company manufactures printing machines, which offer solutions for inkjet print-quality technologies. It operates in Israel, Germany, France, Holland, Austria, the United States, and internationally. The company was founded in 2009 and is headquartered in Migdal Ha'Emek, Israel.",
    "website": "http://www.pvnanocell.com",
    "zipcode": "2310102"
  },
  "RIMO.TA": {
    "city": "Modi'in-Maccabim-Re'ut",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Specialty Chemicals",
    "long_name": "Rimoni Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Basic Materials",
    "short_name": "RIMONI INDUSTRIES",
    "state": null,
    "summary": "Rimoni Industries Ltd. engages in the design, engineering, and manufacturing of molds, and precise injection molding and assemblies for the medical, automotive, agricultural, high-tech, and consumer industries in Israel. It offers hardened steel molds, including multi-cavity molds, molds with hot runner systems, prototype molds for complex and intricate products, molds for micro-precision parts, over-moldings, and others. The company also provides precision plastic parts by thermoplastic injection molding; and assembly services for injection molding products. Rimoni Industries Ltd. was founded in 1954 and is based in Modi'in-Maccabim-Re'ut, Israel.",
    "website": "http://www.rimoni-ind.com",
    "zipcode": "7173000"
  }
}
