{
    "BRND.TA": {
        "short_name": "BRAND INDUSTRIES",
        "long_name": "Brand Industries Ltd.",
        "summary": "Brand Industries Ltd., together with its subsidiaries, provides metal industry solutions for the infrastructure, energy, and security markets in Israel. The company offers range of products and services for power plants, specialized equipment, and power distribution elements; large-scale plants and infrastructure; and high-rise and complex buildings. It also designs and manufactures LPG and petrol pressure tanks, and pressurized air tanks; and tankers, aircraft refuelers, firefighting trucks, armored vehicles, and special purpose trailers, as well as provides site erection, installation, and logistical services. In addition, the company undertakes turnkey natural gas projects; large scale projects in the industrial, energy, and infrastructure related fields; and erects power plants, large steel structures, bridges, tanks, and pressure vessels. It serves industrial, energy, and security companies; and government agencies. The company was founded in 1978 and is based in Yeruham, Israel.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yeruham"
    },
    "GAGR.TA": {
        "short_name": "GAON GROUP",
        "long_name": "Gaon Group Ltd.",
        "summary": "Gaon Group Ltd. produces and sells pipes, valves, hydrants, and accessories in Israel. The company offers steel and plastic pipes, as well as structural pipes for water, sewerage, oil and gas, and construction industries. It also provides low pressure valves comprising butterfly, gate, diaphragm, and check valves and stariners for water and wastewater, chemicals, firefighting, air conditioning, desalination, and agriculture applications; and water metering solutions. In addition, the company engages in the hot dip galvanization of steel items; and manufacture of household and infrastructure piping, ducts, and profiles. Further, it offers ball-type faucets and fixtures. The company was formerly known as Middle East Tube Company Ltd. and changed its name to Gaon Group Ltd. in March 2017. The company was founded in 1951 and is based in Or Yehuda, Israel. Gaon Group Ltd. operates as a subsidiary of B. Gaon Holdings Ltd.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Or Yehuda"
    },
    "HOD.TA": {
        "short_name": "HOD-ASSAF INDS",
        "long_name": "Hod Assaf Industries Ltd.",
        "summary": "Hod Assaf Industries Ltd., together with its subsidiaries, manufactures and sells steel bars for construction, welded meshes for concrete reinforcement, and galvanized and drawn wires in Israel and Romania. The company offers products, such as steel for construction, processed steel for construction, assembled and welded elements, fences and concertinas, welded meshes for concrete reinforcement, and wires and auxiliary products. It also produces copper and aluminum wires and cables for electrical and control applications; supplies tools and equipment for construction; and manufactures galvanized and tensioned wires, barbed wires, nails, steel cables for cranes, mines, anchors, and other applications. In addition, the company is involved in processing and trading wood products for construction and communication industries. It serves customers in construction, infrastructure, security, and agricultural sectors and industries. The company was founded in 1947 and is based in Acre, Israel.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Acre"
    },
    "MNIN.TA": {
        "short_name": "MENDELSON INFRASTR",
        "long_name": "Mendelson Infrastructures & Industries Ltd.",
        "summary": "Mendelson Infrastructures & Industries Ltd. engages in the marketing and supply of fluid conveyance equipment in Israel. It operates through Trade in Israel and Other segments. The company also manufactures and markets pipes. Its products include steel, stainless steel, P.V.C., galvanized steel, copper, polyethylene, and casting steel pipes; and pipes for conveyance of fluids, such as water, sewage, gas, fuel, oil, steam, chemicals, etc. In addition, the company offers pipeline accessories, such as fittings designed for connections of industrial tubes, security and adjustment valves, faucets, sealing products, fittings command and control systems, pressure meters, and firefighting systems. Further, it provides bathroom products, including faucets, bathtubs, showers, basins, toilet bowls, and furniture and accessories; and semi-finished plastic products for pipeline engineering plats, bars, and cylinders. Additionally, the company engages in the assembly and maintenance of water pumps; and refurbish of electric motors. It serves chemical and petrochemical industries; food and pharmaceutical industries; military and security industries; energy and oil companies; air condition companies; and subcontractors, as well as public companies and institutions. Mendelson Infrastructures & Industries Ltd. distributes its products through its agents and stores. The company was formerly known as MENDELSON S.BAR Technical & Engineering Supply - KAMAN (2005) Ltd and changed its name to Mendelson Infrastructures & Industries Ltd. in June 2013. The company was founded in 1947 and is based in Kiryat Ata, Israel. Mendelson Infrastructures & Industries Ltd. Is a subsidiary of Emilia Development (O.F.G) Ltd.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Kiryat Ata"
    }
}