{
    "1D1.SI": {
        "short_name": "$ UnUsUaL",
        "long_name": "UnUsUaL Limited",
        "summary": "UnUsUaL Limited, an investment holding company, engages in the production and promotion of live events and concerts in Singapore, Malaysia, Hong Kong, and internationally. The company operates through three segments: Promotion, Production, and Others. It is involved in the rental of stage lighting, sound systems, and audio equipment; provision of light system installation and its related services; and leasing of stage equipment. The company also organizes and promotes various shows, entertainment acts, and other related services; organizes and manages events; and provides concert production services and artiste services. UnUsUaL Limited was founded in 1997 and is headquartered in Singapore. UnUsUaL Limited is a subsidiary of Unusual Management Pte. Ltd.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "1F0.SI": {
        "short_name": "$ Shopper360",
        "long_name": "shopper360 Limited",
        "summary": "shopper360 Limited, an investment holding company, provides shopper marketing services in the retail and consumer goods industries. It operates through three segments: In-Store Advertising and Digital Marketing, Field Force Management, and Sampling Activities and Events Management. The In-Store Advertising and Digital Marketing segment offers digital and non-digital in-store advertising mediums in retail chains establishment; and creative campaign development and mobile marketing services through its proprietary loyalty mobile application platform. The Field Force Management segment offers merchandiser, sales force and supervisory, and talent management services. The Sampling Activities and Events Management segment provides in-store promoter services, such as sampling and event management for product launches, roadshows, seminars, and annual dinners; and marketing programs, marketing intelligence and analysis, and consumer relationship management services. The company also engages in the provision of project management and manpower outsourcing services for digital imaging training; and subletting of property and related activities. It serves local and multi-national customers. The company provides its services through approximately 2,840 hypermarkets, pharmacy chains, convenience store outlets, and petrol marts. shopper360 Limited was founded in 1986 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "E27.SI": {
        "short_name": "The Place Hldg",
        "long_name": "The Place Holdings Limited",
        "summary": "The Place Holdings Limited, an investment holding company, invests in, develops, and manages media, integrated tourism, and tourism-related 'new retail' businesses in the People's Republic of China. It engages in the management of various cultural events and activities; and provision of branding strategy, planning, and organizing services for corporate events, exhibitions, and other events, as well as advertising services. The company also development and operating of integrated tourism business, including development of tourist townships near renowned tourist destinations; and the development of commercial malls, hotels, entertainment and recreation facilities, resorts, corporate clubhouses, and wellness resorts for the elderly. It has a strategic collaboration framework agreement with MCC Land (Singapore) Pte. Ltd. for the construction and development of residential and commercial property projects, and projects management, as well as development and management of cultural tourism projects. The company was formerly known as Eucon Holding Limited and changed its name to The Place Holdings Limited in May 2017. The Place Holdings Limited was founded in 1988 and is based in Singapore. The Place Holdings Limited is a subsidiary of Oriental Straits Fund III.",
        "currency": "SGD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "NCL.AX": {
        "short_name": "NETCENTRIC CDI 1:1",
        "long_name": "Netccentric Limited",
        "summary": "Netccentric Limited operates in the digital advertising sector primarily in Malaysia, Singapore, Thailand, and Taiwan. It operates Nuffnang, a blog advertising community that allows advertisers to promote their products or services across a network of approximately 950,000 targeted blogs; and Reelity.TV that produces online video content for advertisers for distribution through social networks. The company also operates Sashimi, a social media agency specializing in purchasing media, and monitoring and managing social media accounts for a range of advertisers; Plata & Punta, a performance marketing agency specializing in digital media trading; and Dejitaru, a social media agency specializing in advertising through digital content, communities, and influencers. In addition, it operates a platform that enables advertisers to engage social media influencers to promote their products and services; and mobile blogging applications. Further, the company is involved in the Web design and development activities. Netccentric Limited was founded in 2006 and is based in Singapore.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}