{
    "ANDRO.AT": {
        "short_name": "ALPHA TRUST-ANDROMEDA INVEST.",
        "long_name": "Alpha Trust Andromeda Investment Trust S.A.",
        "summary": "Alpha Trust Andromeda Investment Trust S.A. is a closed-end balanced mutual fund launched and managed by Alpha Trust M.F.M. S.A. It invests in the public equity and fixed income markets of Greece. The fund focuses on investments across diversified sectors. It invests in stocks of companies across all market capitalizations. Alpha Trust Andromeda Investment Trust S.A was formed in July 25, 2000 and is domiciled in Greece.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kifissia"
    },
    "ATRUST.AT": {
        "short_name": "ALPHA TRUST Mutual Fund Man SA",
        "long_name": "Alpha Trust Mutual Fund and Alternative Investment Fund Management S.A.",
        "summary": "Alpha Trust Mutual Fund and Alternative Investment Fund Management S.A. is a publicly owned investment manager. The firm primarily provides its services to private and institutional investors. It also manages accounts for corporate, ultra high net worth individuals, insurance companies, and pension funds. The firm offers client focused equity, fixed income, and balanced portfolios. It also launches and manages equity, fixed income, and balanced mutual funds and hedge funds for its clients. The firm invests in the public equity, fixed income, and alternative markets across the globe with a focus on Greece. It employs quantitative and qualitative fundamental analysis to make its investments. Alpha Trust Mutual Fund and Alternative Investment Fund Management S.A. was founded in 1987 and is based in Kifissia, Greece.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kifissia"
    },
    "EX.AT": {
        "short_name": "EUROXX SECURITIES S.A",
        "long_name": "Euroxx Securities S.A.",
        "summary": "Euroxx Securities S.A., a brokerage firm, provides a range of products and services to the investors in Greece and internationally. The company offers various investment options, such as short-term and long-term credit, stock borrowing, and joint investor share, as well as markets, wealth management, online transactions, and information services to retail investors. It also provides institutional services, including institutional sales; research and analysis; investment banking services, including consulting services for acquisitions and mergers, capital markets, and business financials; purchase, liquidity, credit, operational, and legal risk management services; and information services. Euroxx Securities S.A. was founded in 1993 and is based in Chalandri, Greece.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Chalandri"
    },
    "EXAE.AT": {
        "short_name": "HELLENIC EXCHANGES- ASE S.A",
        "long_name": "Hellenic Exchanges - Athens Stock Exchange SA",
        "summary": "Hellenic Exchanges - Athens Stock Exchange SA provides support services for the operation of Greek capital market. It operates equities and derivatives markets, and the alternative market; and performs clearing and settlement of trades, as well as develops tools. The company is involved in the management of clearing systems and central counterparty; and finalizing, reconciling, or settling the finalization of transactions in financial instruments, as well as operates as a system administrator in the Athens Exchange Clearing House. It engages in carrying out commercial activities to promote and provide IT services and use/broadcast market data, as well as in general the promotion, distribution, support, monitoring, operation and commercial exploitation of products, systems and customized software applications based on corresponding licenses to resell and commercially exploit. In addition, the company offers listing, trading, clearing, settlement, registry, market data, and depository services, as well as engages in distribution of dividends, interest payment, distribution of securities, and intermediation in the transfer of options or stock options. The company was formerly known as Hellenic Exchanges S.A. and changed its name to Hellenic Exchanges - Athens Stock Exchange SA in December 2013. Hellenic Exchanges - Athens Stock Exchange SA was founded in 1876 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    }
}