{"EUPIC.AT": {"short_name": "EUROPEAN RELIANCE GEN. INSUR.", "long_name": "European Reliance General Insurance Company S.A.", "summary": "European Reliance General Insurance Company S.A., together with its subsidiaries, provides various insurance products and services to individuals and companies in Greece. The company offers pension plans; child insurance programs; and family life, car, health, house, and quality of life insurance plans for individuals. It also provides business insurance programs, such as coverage for business in terms of fire, which can be caused by negligence, lightning, explosion, short circuiting, and forest fires, as well as natural disasters, including floods, hurricanes, storms, snow, hail, and frost; security against the risk of theft, robbery at the till, terrorist activities, strikes, political disturbances, and malicious damage; and programs for buildings and businesses to protect from the risk of leaks and ruptured pipes, vehicle collisions, breaking of shop windows, liability of fire transmission to third parties, loss of income, and damage caused by earthquakes. In addition, the company offers group insurance programs; financial loss programs that cover loss of income, profits, rental income loss, and operating expenses; and transport insurance programs for import or export businesses. Further, it manages various mutual funds that provide investors with portfolio management services and investment opportunities; and a range of services comprising technical support, relocation project management, site design and construction, reception staff placement, cleaning, disinfection, landscaping, catering, integrated solutions for electronic systems, and Internet communications. The company offers products and services through a network of sales persons, as well as through online. European Reliance General Insurance Company S.A. was founded in 1977 and is headquartered in Chalandri, Greece.", "currency": "EUR", "sector": "Financial", "industry": "Property & Casualty Insurance", "exchange": "ATH", "market": "gr_market", "country": "Greece", "city": "Chalandri"}}