{
    "2T8.F": {
        "short_name": "TOWNSQUARE MEDIA A DL-,01",
        "long_name": "Townsquare Media, Inc.",
        "summary": "Townsquare Media, Inc. operates as a radio, digital media, entertainment, and digital marketing solutions company in small and mid-sized markets. It operates through Advertising, Townsquare Interactive, and Live Events segments. The company provides advertising and marketing solutions to advertisers and businesses through its radio stations, Websites, radio stations' online streams, and mobile applications; and digital advertising services, as well as operates Townsquare Ignite, a digital programmatic advertising platform. It also offers digital marketing solutions, such as traditional and mobile enabled Website development and hosting services, e-commerce platforms, search engine and online directory optimization services, online reputation monitoring, and social media and website retargeting services under the Townsquare Interactive brand. Additionally, the company sells tickets, sponsorships, food and other concessions, merchandise, and other ancillary products and services. As of June 15, 2020, the company owned and operated 321 radio stations and approximately 330 local Websites in 67 markets in the United States. It also creates, promotes, and produces live events, including concerts, expositions, and other experiential events. The company was formerly known as Regent Communications, Inc. and changed its name to Townsquare Media, Inc. in May 2010. Townsquare Media, Inc. was founded in 1996 and is headquartered in Purchase, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Purchase"
    },
    "42S.F": {
        "short_name": "BOSTON OMAHA CORP.DL-,001",
        "long_name": "Boston Omaha Corporation",
        "summary": "Boston Omaha Corporation, together with its subsidiaries, engages in the outdoor billboard advertising business in the southeast United States. The company is also involved in the surety insurance and related brokerage, broadband, and investment businesses. As of March 12, 2020, it operated approximately 3,000 billboards containing approximately 5,600 advertising faces of which 63 are digital displays. The company was formerly known as REO Plus, Inc. and changed its name to Boston Omaha Corporation in March 2015. Boston Omaha Corporation was founded in 2009 and is headquartered in Omaha, Nebraska.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Omaha"
    },
    "5Q8.F": {
        "short_name": "QUINSTREET INC  DL-,01",
        "long_name": "QuinStreet, Inc.",
        "summary": "QuinStreet, Inc., an online performance marketing company, provides customer acquisition services for its clients in the United States and internationally. The company offers online marketing services to its clients in the form of qualified clicks, leads, inquiries, calls, applications, customers, display advertisements, or impressions through its websites or third-party publishers. It provides its services in various verticals, such as financial services, education, home services, and business-to-business technology. The company was founded in 1999 and is headquartered in Foster City, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Foster City"
    },
    "7TM.F": {
        "short_name": "FLUENT INC.  DL-,01",
        "long_name": "Fluent, Inc.",
        "summary": "Fluent, Inc. provides data-driven digital marketing services primarily in the United States. The company also offers customer acquisition services by operating digital marketing campaigns, through which the company connects its advertiser clients with consumers. It delivers data and performance-based marketing executions to approximately 500 consumer brands, direct marketers, and agencies across a range of industries, including financial products and services, media and entertainment, health and wellness, staffing and recruitment, and retail and consumer Fluent, Inc. is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "AATV": {
        "short_name": "ADAPTIVE AD SYSTEMS INC",
        "long_name": "Adaptive Ad Systems, Inc.",
        "summary": "Adaptive Ad Systems Inc. operates as a digital media and video communications streaming company. The company, together with its subsidiaries, manufactures, develops, and deploys dynamic digital ad insertion (DDAI) and streaming media hardware and proprietary processing software (DDAI) for the cable TV, satellite, and IPTV markets. The company targets and serves the 2nd and 3rd tier United States markets. The company sells all available advertising space in market it has contracted while maintaining complete technology ownership. Its technology and business model allows to serve approximately 75 designated marketing areas in approximately 40 states. In addition, it provides broadband and cable TV services in principal markets. Adaptive Ad Systems, Inc. was formerly known as Adaptive Media, Inc. and changed its name to Adaptive Ad Systems, Inc. in June 2014. The company was incorporated in 1994 and is based in Vancouver, Washington.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Vancouver"
    },
    "ACGX": {
        "short_name": "ALLIANCE CREATIVE GROUP INC",
        "long_name": "Alliance Creative Group, Inc.",
        "summary": "Alliance Creative Group, Inc. operates as a creative packaging and digital engagement company in the United States. The company provides creative and design services, including advertising campaigns, art direction, brand identity, graphic design, strategy and planning, logo design, Website design, collateral design, video production, conversion copywriting, blog and keyword planning, package design, and photography; and club packs, corrugate, flexible, folding carton, pallet display, pre-print, custom, stock, and thermo-forming packaging services. It also offers supply chain management services, such as third-party logistics, trucking and distribution, vendor managed inventory, and warehousing; commercial, digital, direct mail, grand format, large format, offset, catalog, design support, outdoor signage, and Web printing services; and brand audit and research, brand strategy, communication planning, content planning, event planning, event advisory, and PR advisory services. In addition, the company provides content creation, online marketing, customer engagement, business consulting and strategic marketing, software development, digital engagement, and logistics/VMI services. It offers its services under the St. Louis Packaging, STL Graphics, Snap Graphics, Print4aCause, CoporateGifts4aCause, and PeopleVine brand names to automotive, beauty and wellness, confectionery, food and beverage, gaming and electronics, home enhancement, music and entertainment, pet care, restaurant, sports, technology, and wine and spirits industries. The company was formerly known as Invicta Group, Inc. and changed its name to Alliance Creative Group, Inc. in November 2010. Alliance Creative Group, Inc. was founded in 2000 and is headquartered in East Dundee, Illinois.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "East Dundee"
    },
    "ACTL": {
        "short_name": "ARTEC GLOBAL MEDIA INC",
        "long_name": "Artec Global Media, Inc.",
        "summary": "Artec Global Media, Inc. provides online marketing and reporting solutions. Its solutions include lead generation, such as prospect email, performance display, and mobile marketing; performance media comprising PPC, SEO, social media, and retargeting; and affiliate marketing, as well as other related Web services and consultation, search and display advertising, creative design, telecommunications, and design services. It also engages in student loan debt consultation business. The company was formerly known as Artec Consulting Corp. and changed its name to Artec Global Media, Inc. in June 2014. Artec Global Media, Inc. was founded in 2012 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "ADTY": {
        "short_name": "ADTEGRITY.COM INTL INC",
        "long_name": "Adtegrity.com International, Inc.",
        "summary": "Adtegrity.com International, Inc. provides digital and display advertising services under the Media Place Partners brand. The company is based in Grand Rapids, Michigan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Grand Rapids"
    },
    "ADV": {
        "short_name": "Advantage Solutions Inc.",
        "long_name": "Advantage Solutions Inc.",
        "summary": "Advantage Solutions Inc. provides promotions agency services to clients worldwide. It offers sales agency, marketing agency, technology agency, retail agency, international, and business services. Advantage Solutions Inc. was formerly known as Karman Holding Corp. and changed its name to Advantage Solutions Inc. in March 2016. The company was founded in 1987 and is based in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "BLAB": {
        "short_name": "BIO LAB NATURALS INC",
        "long_name": "Bio Lab Naturals, Inc.",
        "summary": "Bio Lab Naturals, Inc., together with its subsidiaries, engages in the development, manufacture, and wholesale distribution of dietary supplements in the United States. It primarily offers velvet antler extract and other deer antler supplements; and elk antler supplements for dogs. The company sells its products to health food stores, doctor's offices, and fitness facilities. Bio Lab Naturals, Inc. is based in Tampa, Florida. As of January 6, 2020, Bio Lab Naturals, Inc. operates as a subsidiary of Canavation Product Group, Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tampa"
    },
    "BOMN": {
        "short_name": "Boston Omaha Corporation",
        "long_name": "Boston Omaha Corporation",
        "summary": "Boston Omaha Corporation, together with its subsidiaries, engages in the outdoor billboard advertising business in the southeast United States. The company is also involved in the surety insurance and related brokerage, broadband, and investment businesses. As of March 12, 2020, it operated approximately 3,000 billboards containing approximately 5,600 advertising faces of which 63 are digital displays. The company was formerly known as REO Plus, Inc. and changed its name to Boston Omaha Corporation in March 2015. Boston Omaha Corporation was founded in 2009 and is headquartered in Omaha, Nebraska.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Omaha"
    },
    "BXNG": {
        "short_name": "BANG HOLDINGS CORP",
        "long_name": "Bang Holdings Corp.",
        "summary": "Bang Holdings Corp., a brand management and advertising technology company, provides content and an influencer-based marketing network to the cannabis industry. It operates 4TTnetwork, a multi-platform comprising TwentyToday, VaporBang, AmericanToker, and HighOnStocks; and Green Monkey Network, a network of social media influencers in the marijuana industry. Bang Holdings Corp. was incorporated in 2014 and is based in North Miami Beach, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "North Miami Beach"
    },
    "BYOC": {
        "short_name": "BEYOND COMMERCE INC",
        "long_name": "Beyond Commerce, Inc.",
        "summary": "Beyond Commerce, Inc. engages in business-to-business Internet marketing technology and services, and the information management market businesses. It offers content, business process management, customer experience management, discovery, business network, and analytics services. The company was formerly known as BOOMj, Inc. and changed its name to Beyond Commerce, Inc. in December 2008. Beyond Commerce, Inc. was founded in 2006 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "C7C1.F": {
        "short_name": "CLEAR CHANNEL O.H.A DL-01",
        "long_name": "Clear Channel Outdoor Holdings, Inc.",
        "summary": "Clear Channel Outdoor Holdings, Inc., an outdoor advertising company, owns, operates, and sells advertising displays in the United States and internationally. It operates through two segments, Americas Outdoor Advertising and International Outdoor Advertising. The company offers advertising services through billboards, including bulletins and posters; transit displays, which are advertising surfaces on various types of vehicles or within transit systems; street furniture displays, such as advertising surfaces on bus shelters, information kiosks, freestanding units, and other public structures; spectaculars, which are customized display structures that incorporate videos, multidimensional lettering and figures, mechanical devices and moving parts, and other embellishments; wallscape, a display that drapes over or is suspended from the sides of buildings or other structures; and retail and other small displays. It also provides street furniture equipment, cleaning and maintenance services, and production and creative services; and a public bicycle rental program, which offers bicycles for rent to the general public in various municipalities. The company serves the business service, retail, media, healthcare and medical, banking and financial services, retail, food/food products, entertainment, Internet and E-Commerce, and telecommunications. As of December 31, 2019, it owned or operated approximately 74,000 advertising displays in the United States; and 390,000 displays across 22 countries. The company was formerly known as Eller Media Company and changed its name to Clear Channel Outdoor Holdings, Inc. in August 2005. The company was incorporated in 1995 and is headquartered in San Antonio, Texas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "CCO": {
        "short_name": "Clear Channel Outdoor Holdings,",
        "long_name": "Clear Channel Outdoor Holdings, Inc.",
        "summary": "Clear Channel Outdoor Holdings, Inc., an outdoor advertising company, owns, operates, and sells advertising displays in the United States and internationally. It operates through two segments, Americas Outdoor Advertising and International Outdoor Advertising. The company offers advertising services through billboards, including bulletins and posters; transit displays, which are advertising surfaces on various types of vehicles or within transit systems; street furniture displays, such as advertising surfaces on bus shelters, information kiosks, freestanding units, and other public structures; spectaculars, which are customized display structures that incorporate videos, multidimensional lettering and figures, mechanical devices and moving parts, and other embellishments; wallscape, a display that drapes over or is suspended from the sides of buildings or other structures; and retail and other small displays. It also provides street furniture equipment, cleaning and maintenance services, and production and creative services; and a public bicycle rental program, which offers bicycles for rent to the general public in various municipalities. The company serves the business service, retail, media, healthcare and medical, banking and financial services, retail, food/food products, entertainment, Internet and E-Commerce, and telecommunications. As of December 31, 2019, it owned or operated approximately 74,000 advertising displays in the United States; and 390,000 displays across 22 countries. The company was formerly known as Eller Media Company and changed its name to Clear Channel Outdoor Holdings, Inc. in August 2005. The company was incorporated in 1995 and is headquartered in San Antonio, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Antonio"
    },
    "CD5N.F": {
        "short_name": "INUVO INC. NEW  DL -,001",
        "long_name": "Inuvo, Inc.",
        "summary": "Inuvo, Inc., together with its subsidiaries, a technology company, develops and sells information technology solutions in the United States. The company's platforms identify and message online audiences across devices, channels and formats, video, mobile, connected TV, display, and social and native. Its platform also allows advertisers and publishers to buy and sell advertising space in real time. The company's products and services include ValidClick that provides marketing service online, as well as indirectly to various advertisers, where a collection of data, analytics, and software gets used to align advertising messages with anonymous consumers online; and IntentKey, a consumer intent recognition system designed to reach targeted mobile and desktop in-market audiences. It also operates a collection of websites including alot.com and earnspendlive.com, which creates content in health, finance, travel, careers, auto, education, and living categories. The company's marketing channels consist of websites, social media, blogs, public relations, trade shows, and conferences. Inuvo, Inc. was incorporated in 1987 and is headquartered in Little Rock, Arkansas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Little Rock"
    },
    "CMGO": {
        "short_name": "CMG HLDGS GRP INC",
        "long_name": "CMG Holdings Group, Inc.",
        "summary": "CMG Holdings Group, Inc., a marketing communications company, engages in the operation of organizations in the alternative advertising, digital media, experiential and interactive marketing, and entertainment sectors. The company is involved in the production and promotion, event design, sponsorship evaluation, negotiation and activation, talent buying, show production, stage and set design, and data analysis and management activities. It also offers branding and design services, such as graphic, industrial and package designs across traditional and new media, public relations, social media, media development and relations, and interactive marketing platforms to provide its clients with customary private digital media networks for the design and development of individual broadcasting digital media channels, as well as to sell, promote, and enhance their digital media video content through mobile, online, and social mediums. In addition, the company provides marketing services, including interactive event strategy and planning, creative development, and nontraditional out of home marketing. It serves clients operating in the marketing communication and entertainment industries. CMG Holdings Group, Inc. was founded in 2002 and is based in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Chicago"
    },
    "CNFN": {
        "short_name": "CFN ENTERPRISES INC",
        "long_name": "CFN Enterprises Inc.",
        "summary": "CFN Enterprises Inc., a digital media and e-commerce company, owns and operates CFN Media, the media network for the legal cannabis, CBD, and psychedelics industries in the United States. The company provides sponsored content, including articles, press releases, videos, podcasts, advertisements and other media, email advertisements, and other marketing campaigns. It also operates various media platforms, such as CannabisFN.com, the CannabisFN iOS app, the CFN Media YouTube channel, the CFN Media podcast, and other venues. In addition, the company offers CFN Enterprises' services that are designed to help private companies prepare to go public and public companies grow their shareholder base through sponsored content and marketing outreach. CFN Enterprises Inc. distributes its content to various online platforms, which include CannabisFN.com website, press releases, financial news syndicates, search engines, YouTube, iTunes, Twitter, Instagram, Facebook, LinkedIn, and others. The company was formerly known as Accelerize Inc. and changed its name to CFN Enterprises Inc. in October 2019. CFN Enterprises Inc. was founded in 2001 and is based in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "COGV": {
        "short_name": "COGNITIV INC",
        "long_name": "Cognitiv, Inc.",
        "summary": "Cognitiv, Inc. operates as diversified media, Internet, and marketing company. It engages in business to consumers e-commerce sales activities. The company was formerly known as University Health Industries, Inc. and changed its name to Cognitiv, Inc. in March 2012. Cognitiv, Inc. is based in Heathrow, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Heathrow"
    },
    "CQER": {
        "short_name": "SECURCAPITAL HOLDINGS CORP",
        "long_name": "SecurCapital Holdings Corp.",
        "summary": "SecurCapital Holdings Corp. engages in the acquisition, exploration, development, production, and operation of oil and natural gas properties in the Rocky Mountain region. It holds working interests in oil and natural gas prospects in the Lake Frances field, the West Pondera field, and the Loneman Coulee field, Montana. The company has 6,400 barrels of estimated oil reserves. It sells natural gas to gas transmission companies. The company was founded in 2002 and is based in Cut Bank, Montana.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Cut Bank"
    },
    "CU7.F": {
        "short_name": "QUOTIENT TECHN. DL-,00001",
        "long_name": "Quotient Technology Inc.",
        "summary": "Quotient Technology Inc., a digital marketing company, provides technology and services that offers power integrated digital promotions and media programs for consumer packaged goods (CPGs) brands and retailers. The company offers programs across its network, including its flagship consumer brand Coupons.com and retail partners' properties. It also operates Quotient Retailer iQ, a digital platform to engage with shoppers across their websites, mobiles, e-commerce, and social channels. It serves approximately 700 CPGs, representing approximately 2,000 brands, including various food, beverage, personal, and household product manufacturers; retail partners representing various classes of trade, such as grocery retailers, as well as drug, dollar, club, and mass merchandise channels; and consumers visiting its websites, mobile properties, and social channels. The company was formerly known as Coupons.com Incorporated and changed its name to Quotient Technology Inc. in October 2015. Quotient Technology Inc. was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Mountain View"
    },
    "DBMM": {
        "short_name": "DIGITAL BRAND MEDIA&MKT GR INC",
        "long_name": "Digital Brand Media & Marketing Group, Inc.",
        "summary": "Digital Brand Media & Marketing Group, Inc., together with its subsidiaries, crafts, designs, and executes digital marketing strategies across various ad platforms and social media networks in Great Britain. The company offers pay-per-click advertising, search engine marketing and optimization, web design, social media, digital analytics, and advisory services. It serves entertainment, sports, fashion, automotive, ecommerce, and investment banking markets. The company was formerly known as RTG Ventures, Inc. and changed its name to Digital Brand Media & Marketing Group, Inc. in April 2013. Digital Brand Media & Marketing Group, Inc. was founded in 1998 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "DL8.F": {
        "short_name": "DELUXE CORP.  DL1",
        "long_name": "Deluxe Corporation",
        "summary": "Deluxe Corporation provides printed business forms, checks, marketing solutions, accessories, and other products and services for small businesses and financial institutions. It operates through three segments: Small Business Services, Financial Services, and Direct Checks. The company provides marketing materials and promotional solutions, such as postcards, brochures, retail packaging supplies, apparel, greeting cards, and business cards; and treasury management solutions, including remittance and lockbox processing, remote deposit capture, receivables management, payment processing, and paperless treasury management, as well as software, hardware and digital imaging solutions. It also offers Web services comprising web hosting and domain name, logo and web design, payroll, email marketing, search engine marketing and optimization, and business incorporation and organization services; strategic targeting, lead optimization, retention, and cross-selling services; and fraud protection and security services, electronic checks and deposits, and digital engagement solutions, including loyalty and rewards programs and financial management tools. In addition, the company provides checks; printed business forms, such as deposit tickets, billing forms, work orders, job proposals, purchase orders, invoices, and personnel forms, as well as computer forms; and customized products comprising envelopes, office supplies, ink stamps, labels, check registers, and checkbook covers. It operates in the United States, Canada, Australia, South America, and Europe. The company was formerly known as Deluxe Check Printers, Incorporated and changed its name to Deluxe Corporation in 1988. Deluxe Corporation was founded in 1915 and is headquartered in Shoreview, Minnesota.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Shoreview"
    },
    "DLX": {
        "short_name": "Deluxe Corporation",
        "long_name": "Deluxe Corporation",
        "summary": "Deluxe Corporation provides printed business forms, checks, marketing solutions, accessories, and other products and services for small businesses and financial institutions. It operates through three segments: Small Business Services, Financial Services, and Direct Checks. The company provides marketing materials and promotional solutions, such as postcards, brochures, retail packaging supplies, apparel, greeting cards, and business cards; and treasury management solutions, including remittance and lockbox processing, remote deposit capture, receivables management, payment processing, and paperless treasury management, as well as software, hardware and digital imaging solutions. It also offers Web services comprising web hosting and domain name, logo and web design, payroll, email marketing, search engine marketing and optimization, and business incorporation and organization services; strategic targeting, lead optimization, retention, and cross-selling services; and fraud protection and security services, electronic checks and deposits, and digital engagement solutions, including loyalty and rewards programs and financial management tools. In addition, the company provides checks; printed business forms, such as deposit tickets, billing forms, work orders, job proposals, purchase orders, invoices, and personnel forms, as well as computer forms; and customized products comprising envelopes, office supplies, ink stamps, labels, check registers, and checkbook covers. It operates in the United States, Canada, Australia, South America, and Europe. The company was formerly known as Deluxe Check Printers, Incorporated and changed its name to Deluxe Corporation in 1988. Deluxe Corporation was founded in 1915 and is headquartered in Shoreview, Minnesota.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Shoreview"
    },
    "DMS": {
        "short_name": "Digital Media Solutions, Inc.",
        "long_name": "Digital Media Solutions, Inc.",
        "summary": "Digital Media Solutions, Inc. provides technology and digital performance technology solutions in the United States. It operates in three segments: Brand Direct, Marketplace, and Other. The company operates as a performance marketing engine for companies across various industries, including consumer finance, education, automotive, insurance, home services, brand performance, gig, health and wellness, and career. It builds, hosts, and maintains a portfolio of owned and operated websites in various verticals, such as insurance, education, home services, consumer finance, and automotive; and digital performance marketing solutions for its advertising clients' brand-specific products or services. The company also offers software-as-a-service and managed services to clients in the insurance, consumer finance, and education verticals. Digital Media Solutions, Inc. was founded in 2000 and is headquartered in Clearwater, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Clearwater"
    },
    "EEX": {
        "short_name": "Emerald Holding, Inc.",
        "long_name": "Emerald Holding, Inc.",
        "summary": "Emerald Holding, Inc. operates business-to-business (B2B) trade shows in the United States. The company operates trade shows in various industry sectors, including retail, design and construction, technology, equipment, and safety. It also operates content and content-marketing Websites, and related digital products, as well as produce publications. Emerald Expositions Events, Inc. was founded in 2013 and is based in San Juan Capistrano, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Juan Capistrano"
    },
    "EN1.AX": {
        "short_name": "ENGAGE BDR FPO",
        "long_name": "engage:BDR Limited",
        "summary": "engage:BDR Limited operates as an Internet-based marketplace platform and technology solution provider in the United States, Australia, and internationally. The company operates in two segments, Programmatic and Collaborative Marketing Trading. Its proprietary technology is used to optimize the sale of advertising inventory from digital publishers, including Websites and apps to advertisers and their agents, such as brands, agencies, and advertising platforms. The company's proprietary technology allows digital publishers to monetize available advertising space by making the inventory available to multiple advertisers, as well as provides various related technologies designed to help publishers; and ad exchange platform allows publishers to sell space for video advertising on webpages that do not have video content. engage:BDR Limited was founded in 2009 and is based in West Hollywood, California.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "city": "West Hollywood"
    },
    "EPGC": {
        "short_name": "ECOM PRODUCTS GROUP",
        "long_name": "Ecom Products Group Corporation",
        "summary": "Ecom Products Group, a development stage company, provides Web-based advertising and promotion services to the business and consumer community through its discountcoupons.com Website. The company sells discount coupons from its merchant clients to customers registering on the Website. It also manages other daily deal Websites. The company was formerly known as Discount Coupons Corporation and changed its name to Ecom Products Group in November 2016. Ecom Products Group was founded in 2010 and is based in St. Petersburg, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "St Petersburg"
    },
    "FBCD": {
        "short_name": "FBC HOLDING INC",
        "long_name": "FBC Holding, Inc.",
        "summary": "FBC Holding, Inc. engages in the development and sale of vinyl collectible toys and related products. The company primarily offers flow boards, flow saucers, and snow skates. It serves artists and the toy industry through retailers and wholesale accounts, as well as through online. The company also has a strategic relationship with Large International Sourcing Company for the development and manufacture of a health and wellness product. FBC Holding, Inc. is based in Gardena, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Gardena"
    },
    "FLNT": {
        "short_name": "Fluent, Inc.",
        "long_name": "Fluent, Inc.",
        "summary": "Fluent, Inc. provides data-driven digital marketing services primarily in the United States. The company also offers customer acquisition services by operating digital marketing campaigns, through which the company connects its advertiser clients with consumers. It delivers data and performance-based marketing executions to approximately 500 consumer brands, direct marketers, and agencies across a range of industries, including financial products and services, media and entertainment, health and wellness, staffing and recruitment, and retail and consumer Fluent, Inc. is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "GTNM": {
        "short_name": "GOLDEN TIME NETWORK MARKETING L",
        "long_name": "Golden Time Network Marketing Limited",
        "summary": "SupportSave Solutions, Inc. provides outsourced customer care, technical support, and back-office solutions worldwide. It also offers legal process outsourcing; customer management services comprising contact center, collections, research and analytics, and industry specific back-office processes; and staffing services. The company's services include customer acquisition, verification and activation, customer and helpdesk, technical support, billing and settlement, customer retention, travel reservations, call quality monitoring, collection, skip tracing, account set-up, data entry and audit, order provisioning and management, fulfillment, loan filling/processing, online research projects, email management, online chat support, Web content management, and fax processing services. It serves various industries, such as hi-tech and electronics, retail and e-commerce, transportation and logistics, media and publishing, and online service providers. The company was incorporated in 2007 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "GTRL": {
        "short_name": "GET REAL USA INC",
        "long_name": "Get Real USA, Inc.",
        "summary": "Get Real USA, Inc., through its subsidiaries, focuses on the movie and streaming Internet business. It offers music and videos by various artists and talents. The company was formerly known as Hydrogen Hybrid Corporation and changed its name to Get Real USA, Inc. in January 2011. Get Real USA, Inc. was founded in 1995 and is based in Babylon, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Babylon"
    },
    "HHK1.F": {
        "short_name": "HARTE-HANKS INC.  DL 1",
        "long_name": "Harte Hanks, Inc.",
        "summary": "Harte Hanks, Inc. provides various multi-channel marketing services in the United States and internationally. The company provides agency services, such as customer engagement solutions in direct and digital communications for consumer and business-to-business markets; digital services, including search engine management, display, digital analytics, website development and design, digital strategy, social media, email, e-commerce, and interactive relationship management services; and database marketing and business-to-business markets that offer insight and analytics, customer data integration, and marketing communications tools. It also provides direct marketing services, including digital printing, print on demand, advanced mail optimization, logistics and transportation optimization, tracking, commingling, shrink wrapping, and specialized mailing services, as well as custom kitting, product recalls, and freight optimization services through its fulfillment centers; and operates tele-service workstations, which offer contact center solutions comprising speech, voice and video chat, integrated voice response, analytics, social cloud monitoring, and web self-services. The company provides its services primarily to the retail, B2B, financial services, consumer, and healthcare vertical markets. Harte Hanks, Inc. was founded in 1923 and is headquartered in Austin, Texas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Austin"
    },
    "HRTH": {
        "short_name": "HARTE-HANKS INC",
        "long_name": "Harte Hanks, Inc.",
        "summary": "Harte Hanks, Inc. provides various multi-channel marketing services in the United States and internationally. The company provides agency services, such as customer engagement solutions in direct and digital communications for consumer and business-to-business markets; digital services, including search engine management, display, digital analytics, website development and design, digital strategy, social media, email, e-commerce, and interactive relationship management services; and database marketing and business-to-business markets that offer insight and analytics, customer data integration, and marketing communications tools. It also provides direct marketing services, including digital printing, print on demand, advanced mail optimization, logistics and transportation optimization, tracking, commingling, shrink wrapping, and specialized mailing services, as well as custom kitting, product recalls, and freight optimization services through its fulfillment centers; and operates tele-service workstations, which offer contact center solutions comprising speech, voice and video chat, integrated voice response, analytics, social cloud monitoring, and web self-services. The company provides its services primarily to the retail, B2B, financial services, consumer, and healthcare vertical markets. Harte Hanks, Inc. was founded in 1923 and is headquartered in Austin, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Austin"
    },
    "IFUS": {
        "short_name": "IMPACT FUSION INTERNATIONAL INC",
        "long_name": "Impact Fusion International, Inc.",
        "summary": "Impact Fusion International, Inc. engages in the business of marketing products in the health and wellness sector. The company focuses on the invention, development, and marketing of its proprietary products worldwide for the health of humans and animals. The company's products include Nutri-Mastic that supports digestive function, the immune system, vital organ health, healthy blood cells, and cardiac muscle and heart function; Intact Nutrition herbal health support products; Intact Endurance, which offers nutrients to increase body's optimal energy levels; Pet Intact nutritional supplements; and Equine Intact products. It also sells herbal health support beverages under the Mastic Blast Beverage brand; and alternative proprietary formulation for beef and dairy cattle under the Supreme Gold Plus brand. The company was formerly known as Red Reef Laboratories International, Inc. and changed its name to Impact Fusion International Inc. in April 2009. Impact Fusion International, Inc. was founded in 2002 and is based in Margate, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Margate"
    },
    "INUV": {
        "short_name": "Inuvo, Inc.",
        "long_name": "Inuvo, Inc.",
        "summary": "Inuvo, Inc., together with its subsidiaries, a technology company, develops and sells information technology solutions in the United States. The company's platforms identify and message online audiences across devices, channels and formats, video, mobile, connected TV, display, and social and native. Its platform also allows advertisers and publishers to buy and sell advertising space in real time. The company's products and services include ValidClick that provides marketing service online, as well as indirectly to various advertisers, where a collection of data, analytics, and software gets used to align advertising messages with anonymous consumers online; and IntentKey, a consumer intent recognition system designed to reach targeted mobile and desktop in-market audiences. It also operates a collection of websites including alot.com and earnspendlive.com, which creates content in health, finance, travel, careers, auto, education, and living categories. The company's marketing channels consist of websites, social media, blogs, public relations, trade shows, and conferences. Inuvo, Inc. was incorporated in 1987 and is headquartered in Little Rock, Arkansas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "city": "Little Rock"
    },
    "IPG": {
        "short_name": "Interpublic Group of Companies,",
        "long_name": "The Interpublic Group of Companies, Inc.",
        "summary": "The Interpublic Group of Companies, Inc. provides advertising and marketing services worldwide. It operates through two segments, Integrated Agency Networks and Constituency Management Group. The company offers consumer advertising, digital marketing, communications planning and media buying, public relations, and specialized communications disciplines, as well as data management services. It also provides various diversified services, including meeting and event production, sports and entertainment marketing, corporate and brand identity, and strategic marketing consulting. The company was formerly known as McCann-Erickson Incorporated and changed its name to The Interpublic Group of Companies, Inc. in January 1961. The Interpublic Group of Companies, Inc. was founded in 1902 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "ISIG": {
        "short_name": "Insignia Systems, Inc.",
        "long_name": "Insignia Systems, Inc.",
        "summary": "Insignia Systems, Inc. provides in-store and digital advertising solutions to consumer-packaged goods manufacturers, retailers, shopper marketing agencies, and brokerages. The company offers in-store signage solutions, which provides point-of-purchase services; merchandising solutions that include various corrugate displays, side caps, free standing shippers, and customized end-cap solutions; on-pack solutions, which include BoxTalk, coupons, recipes, and cross-promotions; digital solutions, such as mobile programmatic advertising services; and custom print solutions that offer small- and large-format print solutions, labels, and cardstock. Insignia Systems, Inc. was founded in 1990 and is based in Minneapolis, Minnesota.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Minneapolis"
    },
    "ISML": {
        "short_name": "ISM INTERNATIONAL INC",
        "long_name": "Ism International Inc.",
        "summary": "ISM International Inc. develops and sells green energy products and organic non-toxic products in Canada. The company offers its products under the MyGirl, Superwipes, SwatBra, GotchaGps, and BioSolvant trademarks. The company was founded in 1993 and is based in Clearwater, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Clearwater"
    },
    "ITKH": {
        "short_name": "ITEKNIK HOLDING CORPORATION",
        "long_name": "iTeknik Holding Corporation",
        "summary": "iTeknik Holding Corporation, through its subsidiary, Send Global Corporation, provides wholesale and retail telecommunications services and products worldwide. Its services include voice over Internet protocol origination and termination; A-Z routing and switching; wholesale carrier routing services; Web-based reseller solutions; prepaid calling solutions; international cellular calling; and retail point of sale solutions. The company serves B2B carriers, telecom resellers, retail outlets, and consumers through Websites, such as MyMobile011.com, GreatMinutes.com, AloBilady.com, IndiaMinutes.com, and MexicoMinutes.com. iTeknik Holding Corporation was founded in 2007 and is headquartered in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "West Palm Beach"
    },
    "KHZM": {
        "short_name": "MADISON AVE MEDIA",
        "long_name": "Madison Ave Media, Inc.",
        "summary": "Madison Ave Media, Inc., a development stage company, offers marketing technologies and services to various industries. The company provides integrated corporate development, product development, branding, marketing, communications, media, and promotion services through digital media to consumer products industry, as well as to publishing, financial services, media/entertainment, and manufacturing industries. Madison Ave Media, Inc. is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boca Raton"
    },
    "KLTI": {
        "short_name": "KLAUSTECH INC",
        "long_name": "KlausTech, Inc.",
        "summary": "KlausTech, Inc. provides digital marketing technology, licensing, and related solutions and services. It primarily offers AdcastPLUS, a patented advertising tool that provides non-scrollable, time-controllable, and TV styled online advertising solutions, including video and sound media, as well as standard sized IAB formats. KlausTech offers its solutions for advertisers and publishers. The company was formerly known as Ricky's Board Shop and changed its name to KlausTech, Inc. in January 2010. KlausTech, Inc. is based in Plano, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Plano"
    },
    "KNIT": {
        "short_name": "KINETIC GROUP INC",
        "long_name": "Kinetics Group, Inc.",
        "summary": "As of April 2004, Kinetics Group, Inc. was acquired by Celerity Group, Inc. following an internal reorganization. Kinetics Group, Inc. engages in the manufacture, design, and installation of process systems for the electronics and biopharm industries. Its services for electronics industry clients consist of design and installation of gas, chemical, water, and utilities systems, including modularized fab fit-up and manufacturing tool installation. Kinetics offers a range of equipment and system solutions for blending and distribution of purity chemicals and solvents for semiconductor fabrication and other applications. For biopharm clients, it provides turnkey process solutions with a validatable process system. The company designs and builds thermal control equipment, including freeze-dryers and controlled-rate freezers. Kinetics also offers modular process equipment and systems; pilot and industrial fermentors, and bioreactors; and stainless steel process vessels. Its customers include schools and municipalities, water treatment and remediation, environmental, food and beverage, and aerospace industries in Americas, Europe, Middle East, China, Malaysia, Singapore, Japan, Taiwan, and Australia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Clara"
    },
    "LIGA": {
        "short_name": "LIG ASSETS INC",
        "long_name": "LIG Assets, Inc.",
        "summary": "LIG Assets, Inc. focuses on residential and commercial real estate business in the state of Texas. The company purchases commercial and residential real estate properties for resale and rental. It also invests, acquires, finances, and manages commercial properties, such as hotels, apartments, condos, retail, and office buildings; and offers loans for single family homes. The company was founded in 2008 and is based in Carthage, Tennessee.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carthage"
    },
    "LOGX": {
        "short_name": "PEERLOGIX INC",
        "long_name": "PeerLogix, Inc.",
        "summary": "PeerLogix, Inc. operates as an advertising technology and data aggregation company. It provides proprietary software as a service platform, which enables the tracking and cataloguing of over-the-top (OTT) viewership and listenership to determine consumer trends and preferences based upon media consumption. The company's platform collects OTT data, including Internet protocol addresses of the streaming and downloading parties (location), the name, media type, and genre of media watched, listened, or downloaded; and utilizes licensed and publicly available demographic and other databases to further filter the collected data to provide insights into consumer preferences to digital advertising firms, product and media companies, entertainment studios, and others. It also offers advertising services, which provide marketers, publishers, and networks custom digital audience segments that match specific advertiser criteria; and data licensing services, which offer networks, studios, and content creators unfettered analysis of the company's OTT data. The company's platform is used by approximately 765 million people worldwide to consume TV shows, movies, music, pictures, video games, e-books, and software online. PeerLogix, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "MCHX": {
        "short_name": "Marchex, Inc.",
        "long_name": "Marchex, Inc.",
        "summary": "Marchex, Inc. operates as a call analytics company that helps businesses connect, drive, measure, and convert callers into customers. Its products include Marchex Call Analytics, an analytics platform for enterprises that depend on inbound phone calls to drive sales, appointments, and reservations; Marchex Speech Analytics that enable actionable insights for enterprise, mid-sized, and small businesses; Text Analytics and Communications, which enable businesses to send and receive text/SMS messages with customers; Call Monitoring; and Marchex Sales Edge that enable businesses to understand customer conversations in phone calls and text. The company also offers Marchex Omnichannel Analytics Cloud products, such as Marchex Search Analytics, a product for search marketers that drive phone calls from search campaigns; Marchex Display and Video Analytics, a product for marketers that buy digital display advertising; Marchex Site Analytics, a product for marketers that can drive phone calls from Websites; and Marchex Social Analytics, a product for marketers that buy social media advertising. In addition, it provides Marchex Audience Targeting that leverages call data to automatically build audience segments for display and social media platforms; and Marchex Call Marketplace, a mobile advertising network for businesses that depend on inbound phone calls to drive sales, as well as provides advertisers ad placements across various mobile and online media sources to deliver qualified calls to their businesses. In addition, it provides Local Leads platform, a service advertising solution for small business resellers, such as Yellow Pages providers and vertical marketing service providers to sell call advertising, search marketing, and other lead generation products through their existing sales channels to small business advertisers. Marchex, Inc. was founded in 2003 and is headquartered in Seattle, Washington.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Seattle"
    },
    "MDCA": {
        "short_name": "MDC Partners Inc.",
        "long_name": "MDC Partners Inc.",
        "summary": "MDC Partners Inc. provides marketing, advertising, activation, communications, and strategic consulting solutions worldwide. It offers a range of client services, including global advertising and marketing, data analytics and insights, mobile and technology experiences, direct marketing, database and customer relationship management, business consulting, sales promotion, corporate communications, market research, corporate identity, design and branding services, social media strategy and communications, product and service innovation, and e-commerce management, as well as media buying, planning, and optimization. The company was formerly known as MDC Corporation Inc. and changed its name to MDC Partners Inc. in January 2004. MDC Partners Inc. was founded in 1980 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "MGNI": {
        "short_name": "Magnite, Inc.",
        "long_name": "Magnite, Inc.",
        "summary": "Magnite, Inc. operates an independent sell-side advertising platform in the United States and internationally. Its omnichannel advertising platform enables publishers to monetize various auction types and formats, including CTV, desktop display, video, audio, and mobile, as well as allows agencies and brands to access brand-safe ad inventory and execute advertising transactions. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "MMND": {
        "short_name": "MASTERMIND INC",
        "long_name": "Mastermind, Inc.",
        "summary": "Mastermind, Inc., an involvement marketing service agency, designs, creates, and develops branding and marketing campaigns for corporate clients with category-leading brands. Its programs could take in various forms, including creating and managing digital content, designing campaign Websites/landing pages, social media and viral campaigns, mobile marketing initiatives, and brand communications. The company was founded in 2012 and is based in Atlanta, Georgia. Mastermind, Inc. is a subsidiary of Mastermind Marketing, Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "MOBQ": {
        "short_name": "MOBIQUITY TECHNOLOGIES INC",
        "long_name": "Mobiquity Technologies, Inc.",
        "summary": "Mobiquity Technologies, Inc., together with its subsidiaries, operates as a location data intelligence company in the United States. It provides location data and insights on consumer's real-world behavior and trends for use in marketing and research; and solutions for mobile data collection and analysis. The company also operates an advertising technology operating system (ATOS) platform that creates an automated marketplace of advertisers and publishers on digital media outlets to host online auctions. In addition, its ATOS platform includes adserver, demand side platform, advertisement quality tools, analytics dashboard, avails engine, advertisement prediction and delivery tools, supply quality tools, private market place tools, audience and location targeting tools, wrap up reports, prebid adaptor, and an advertisement software development kit. The company's platform also provides advertisers the capability to understand and interact with their audiences, as well as engage them by using ads in image and video formats. It serves advertising, data licensing, footfall and attribution reporting, real estate planning, financial forecasting, and custom research sectors. The company was formerly known as Ace Marketing & Promotions, Inc. and changed its name to Mobiquity Technologies, Inc. in September 2013. Mobiquity Technologies, Inc. was founded in 1998 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "MWTR.OL": {
        "short_name": "MELTWATER BV",
        "long_name": "Meltwater B.V.",
        "summary": "Meltwater B.V., an online media monitoring company, provides media intelligence and social analytics software-as-a-service solutions worldwide. It offers solutions for brand management, media relations, crisis communications, and PR reporting. The company also provides solutions for social listening, such as ad-hoc research, monitor social mentions, track brand reputation, and consumer segmentation; social media management, including publish content, engage with customers, measure performance, and build relationships; influencer marketing comprising influencer identification, qualification criteria, relationship management, and campaign measurement; and consumer and audience insights consisting of audience segmentation, influencer discovery, audience-centric social listening, and targeted content strategy. In addition, it offers application programming interfaces and developer platforms; and competitive intelligence solutions. The company was formerly known as Meltwater Holding B.V. Meltwater B.V. was founded in 2001 and is headquartered in San Francisco, California.",
        "currency": "NOK",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "OSL",
        "market": "no_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "NCMI": {
        "short_name": "National CineMedia, Inc.",
        "long_name": "National CineMedia, Inc.",
        "summary": "National CineMedia, Inc., through its subsidiary, National CineMedia, LLC, operates a digital in-theater network in North America. The company engages in the sale of advertising to national, regional, and local businesses in Noovie, a cinema advertising and entertainment pre-show seen on movie screens; and sells advertising on its Lobby Entertainment Network, a series of strategically-placed screens located in movie theater lobbies, as well as other forms of advertising and promotions in theatre lobbies. It is also involved in the sale of online and mobile advertising through its Cinema Accelerator digital product, as well as suite of Noovie digital properties, such as Noovie.com, Noovie Shuffle, Name That Movie, Noovie Arcade, and Fantasy Movie League to reach entertainment audiences beyond the theater. The company offers its services to third-party theater circuits under long-term network affiliate agreements. It also operates search and discovery platform, under the brand name Noovie.com. National CineMedia, Inc. was founded in 2005 and is headquartered in Centennial, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Centennial"
    },
    "NHM.F": {
        "short_name": "MARCHEX INC.  DL-,01",
        "long_name": "Marchex, Inc.",
        "summary": "Marchex, Inc. operates as a call analytics company that helps businesses connect, drive, measure, and convert callers into customers. Its products include Marchex Call Analytics, an analytics platform for enterprises that depend on inbound phone calls to drive sales, appointments, and reservations; Marchex Speech Analytics that enable actionable insights for enterprise, mid-sized, and small businesses; Text Analytics and Communications, which enable businesses to send and receive text/SMS messages with customers; Call Monitoring; and Marchex Sales Edge that enable businesses to understand customer conversations in phone calls and text. The company also offers Marchex Omnichannel Analytics Cloud products, such as Marchex Search Analytics, a product for search marketers that drive phone calls from search campaigns; Marchex Display and Video Analytics, a product for marketers that buy digital display advertising; Marchex Site Analytics, a product for marketers that can drive phone calls from Websites; and Marchex Social Analytics, a product for marketers that buy social media advertising. In addition, it provides Marchex Audience Targeting that leverages call data to automatically build audience segments for display and social media platforms; and Marchex Call Marketplace, a mobile advertising network for businesses that depend on inbound phone calls to drive sales, as well as provides advertisers ad placements across various mobile and online media sources to deliver qualified calls to their businesses. In addition, it provides Local Leads platform, a service advertising solution for small business resellers, such as Yellow Pages providers and vertical marketing service providers to sell call advertising, search marketing, and other lead generation products through their existing sales channels to small business advertisers. Marchex, Inc. was founded in 2003 and is headquartered in Seattle, Washington.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Seattle"
    },
    "NXMR": {
        "short_name": "NEXTMART INC",
        "long_name": "NextMart, Inc.",
        "summary": "NextMart, Inc. focuses on the art event and art media direct marketing; design and marketing of art-themed products lines for luxury and high-end goods and brands; and art themed real estate development businesses. The company is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "West Palm Beach"
    },
    "OCN.F": {
        "short_name": "OMNICOM GRP INC.  DL-,15",
        "long_name": "Omnicom Group Inc.",
        "summary": "Omnicom Group Inc., together with its subsidiaries, provides advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising, customer relationship management, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital/direct marketing, digital transformation, entertainment marketing, experiential marketing, field marketing, financial/corporate business-to-business advertising, graphic arts/digital imaging, healthcare marketing and communications, and in-store design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, sales support, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the United States, Canada, Puerto Rico, South America, Mexico, Europe, the Middle East, Africa, Australia, Greater China, India, Japan, Korea, New Zealand, Singapore, and other Asian countries. The company is based in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "OMC": {
        "short_name": "Omnicom Group Inc.",
        "long_name": "Omnicom Group Inc.",
        "summary": "Omnicom Group Inc., together with its subsidiaries, provides advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising, customer relationship management, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital/direct marketing, digital transformation, entertainment marketing, experiential marketing, field marketing, financial/corporate business-to-business advertising, graphic arts/digital imaging, healthcare marketing and communications, and in-store design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, sales support, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the United States, Canada, Puerto Rico, South America, Mexico, Europe, the Middle East, Africa, Australia, Greater China, India, Japan, Korea, New Zealand, Singapore, and other Asian countries. The company is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "OSCN": {
        "short_name": "ONESCREEN INC",
        "long_name": "OneScreen Inc.",
        "summary": "OneScreen Inc., a technology company, provides media solutions. The company's offerings include Media Graph that provides video stakeholders a network to connect with other stakeholders, a platform to manage video initiatives, and a B2B marketplace to make deals. Its offerings also consist of media services, which include consultancy services; delivery of branded video players and interactive campaigns; development of custom mobile apps and custom apps for connected devices; and Media Graph and video industry related training services. The company's solutions comprise content management, cloud storage, aggregation, encoding and metadata, reporting and analytics, and content protection and licensing for video producers and aggregators, publishers and networks, and advertisers and agencies; customizable video player, device applications, Web applications, content delivery, Ad management, reporting and analytics, micro sites, and contextualization for publishers and networks; and Ad serving, audience analytics and data targeting, reporting and analytics, custom creative and branded content distribution, publishers discovery, brand protection, real-time bidding, and display advertising for advertisers agencies. The company was formerly known as Vidshadow, Inc. and changed its name to OneScreen Inc. in February 2009. OneScreen Inc. was incorporated in 1999 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "PIN.AX": {
        "short_name": "PINCHME CDI FORUS",
        "long_name": "PINCHme.com Inc.",
        "summary": "PINCHme.com Inc. provides various marketing services to companies worldwide. The company operates through sampling and audience monetization businesses. It offers marketing services, such as delivery of product samples, coupons, and advertising mailers to consumers; solicitation of consumer feedback through surveys; digital advertising; and sales and lead generation PINCHme.com Inc. was founded in 2012 and is based in New York, New York.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "United States",
        "city": "New York"
    },
    "PRKI": {
        "short_name": "PERK INTL INC",
        "long_name": "Perk International, Inc.",
        "summary": "Perk International Inc. intends to manufacture and sell natural and organic nutraceuticals. The company was incorporated in 2013 and is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "PROM": {
        "short_name": "PROPEL MEDIA INC",
        "long_name": "Propel Media, Inc.",
        "summary": "Propel Media, Inc. operates as a diversified online advertising company in the United States and internationally. It delivers advertising via its online advertising platform called Propel Media Platform that allows advertisers to target users and deliver video, display, and text based advertising. The company offers a self-serve platform and a managed services option that give advertisers diverse solutions to reach online users and acquire customers. It primarily serves its advertising to users who are part of its owned and operated member-based network. The company also operates DeepIntent platform, which provides a data-driven approach to programmatic advertising that integrates into its data management platform. Propel Media, Inc. was founded in 2006 and is based in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "PSYC": {
        "short_name": "GLOBAL TRAC SOLUTIONS INC",
        "long_name": "Global Trac Solutions Inc.",
        "summary": "MoneyTrac Technology, Inc., through its subsidiary, provides electronic wallet and e-banking financial solutions for the marijuana industry. It offers financial technology, which includes an e-wallet and mobile app that allows users to access financial information. The company also provides white labeling services; mobile platform to manage financial transactions; and solutions for accessing account information, making payments, and online bill pay activities. In addition, it offers transaction management services. The company has a joint venture agreement with Compliance Financial Network Corp. MoneyTrac Technology, Inc. also has a strategic partnership with Pegasus Fintech, Inc. The company was founded in 2015 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Diego"
    },
    "QNST": {
        "short_name": "QuinStreet, Inc.",
        "long_name": "QuinStreet, Inc.",
        "summary": "QuinStreet, Inc., an online performance marketing company, provides customer acquisition services for its clients in the United States and internationally. The company offers online marketing services to its clients in the form of qualified clicks, leads, inquiries, calls, applications, customers, display advertisements, or impressions through its websites or third-party publishers. It provides its services in various verticals, such as financial services, education, home services, and business-to-business technology. The company was founded in 1999 and is headquartered in Foster City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Foster City"
    },
    "QUOT": {
        "short_name": "Quotient Technology Inc.",
        "long_name": "Quotient Technology Inc.",
        "summary": "Quotient Technology Inc., a digital marketing company, provides technology and services that offers power integrated digital promotions and media programs for consumer packaged goods (CPGs) brands and retailers. The company offers programs across its network, including its flagship consumer brand Coupons.com and retail partners' properties. It also operates Quotient Retailer iQ, a digital platform to engage with shoppers across their websites, mobiles, e-commerce, and social channels. It serves approximately 700 CPGs, representing approximately 2,000 brands, including various food, beverage, personal, and household product manufacturers; retail partners representing various classes of trade, such as grocery retailers, as well as drug, dollar, club, and mass merchandise channels; and consumers visiting its websites, mobile properties, and social channels. The company was formerly known as Coupons.com Incorporated and changed its name to Quotient Technology Inc. in October 2015. Quotient Technology Inc. was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Mountain View"
    },
    "SCOR": {
        "short_name": "comScore, Inc.",
        "long_name": "comScore, Inc.",
        "summary": "comScore, Inc. operates as an information and analytics company that measures audiences, consumer behavior, and advertising across media platforms worldwide. The company offers ratings and planning products and services, including Media Metrix and Mobile Metrix, which measure Websites and apps on computers, smartphones, and tablets; Video Metrix that delivers unduplicated measurement of digital video consumption, as well as provides TV-comparable reach and engagement metrics, and audience demographics; Plan Metrix, which offers an understanding of consumer lifestyle; validated Campaign Essentials (vCE) that validates whether digital ad impressions are visible to humans, identifies those that are fraudulent, and verifies that ads are shown in brand safe content and delivered to the right audience targets; and Campaign Ratings, which expands upon vCE's verification, as well as provides unduplicated reporting to negotiate and evaluate campaigns across media platforms. Its ratings and planning products and services also comprises TV Essentials that combines TV viewing information with marketing segmentation and consumer databases; StationView Essentials to understand consumer viewing patterns and characteristics; OnDemand Essentials that provides transactional tracking and reporting; and Cross-Platform Suite, which integrates person-level linear TV viewership with digital audience data. The company also offers analytics and optimization products and services that provide end-to-end solutions for planning, optimization, and evaluation of advertising campaigns and brand protection. In addition, it offers movies reporting and analytics products and services to measure movie viewership and box office results by capturing movie ticket sales in real time or near real time, which include box office analytics, trend analysis, and insights for movie studios and movie theater operators. The company was founded in 1999 and is headquartered in Reston, Virginia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Reston"
    },
    "SRAX": {
        "short_name": "SRAX, Inc.",
        "long_name": "SRAX, Inc.",
        "summary": "SRAX, Inc., a digital marketing and data technology company, provides tools to reach consumers with marketing and advertising communication in the United States. The company's machine learning technology analyzes marketing data to identify core consumers and their characteristics across marketing channels. It also offers SRAX IR, software as a service (Saas) that enables companies to understand their shareholder base through the tracking of holdings, the management of investor contact information, and identification of trends in the purchase and sale of issuer's securities; and BIGToken platform, a consumer data management platform where consumers rewarded for providing and verifying their data and completing activities within the platform. The company provides data management, audience optimization and recognition, multi-channel and omni channel media, and marketing services. The company markets and sells its services through its in-house sales team, as well as through industry specific events. The company was formerly known as Social Reality, Inc. and changed its name to SRAX, Inc. in August 2019. SRAX, Inc. was founded in 2009 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "STCB": {
        "short_name": "STARCO BRANDS INC",
        "long_name": "Starco Brands, Inc.",
        "summary": "Starco Brands, Inc. engages in the direct response marketing of consumer products through television and/or retail in the United States. It offers products in various categories, including household cleaning, personal care, OTC, food, beverage and spirits, DIY/Hardware, paints, coatings and adhesives, household, hair care, disinfectants, automotive, motorcycle, arts and crafts, personal care cosmetics, personal care FDA, sun care, cooking oils, and wine. The company was formerly known as Insynergy Products, Inc. and changed its name to Starco Brands, Inc. in September 2017. Starco Brands, Inc. was founded in 2010 and is based in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "SWWI": {
        "short_name": "SIMON WORLDWIDE INC",
        "long_name": "Simon Worldwide, Inc.",
        "summary": "Simon Worldwide, Inc. does not have significant operations. Previously, it was operated as a promotional marketing company. The company was founded in 1976 and is based in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Irvine"
    },
    "TRBO": {
        "short_name": "TURBO GLOBAL PARTNERS INC",
        "long_name": "Turbo Global Partners, Inc.",
        "summary": "Turbo Global Partners, Inc. operates as a marketing consulting services company. The company is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Carson City"
    },
    "TSQ": {
        "short_name": "Townsquare Media, Inc.",
        "long_name": "Townsquare Media, Inc.",
        "summary": "Townsquare Media, Inc. operates as a radio, digital media, entertainment, and digital marketing solutions company in small and mid-sized markets. It operates through Advertising, Townsquare Interactive, and Live Events segments. The company provides advertising and marketing solutions to advertisers and businesses through its radio stations, Websites, radio stations' online streams, and mobile applications; and digital advertising services, as well as operates Townsquare Ignite, a digital programmatic advertising platform. It also offers digital marketing solutions, such as traditional and mobile enabled Website development and hosting services, e-commerce platforms, search engine and online directory optimization services, online reputation monitoring, and social media and website retargeting services under the Townsquare Interactive brand. Additionally, the company sells tickets, sponsorships, food and other concessions, merchandise, and other ancillary products and services. As of June 15, 2020, the company owned and operated 321 radio stations and approximately 330 local Websites in 67 markets in the United States. It also creates, promotes, and produces live events, including concerts, expositions, and other experiential events. The company was formerly known as Regent Communications, Inc. and changed its name to Townsquare Media, Inc. in May 2010. Townsquare Media, Inc. was founded in 1996 and is headquartered in Purchase, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Purchase"
    },
    "UCPA": {
        "short_name": "UNITED COMMUNICATIONS PARTNERS ",
        "long_name": "United Communications Partners Inc.",
        "summary": "United Communications Partners Inc., together with its subsidiaries, offers a network of advertising, media, and other communication services in Europe. The company is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "VIZC": {
        "short_name": "VIZCONNECT INC",
        "long_name": "VizConnect, Inc.",
        "summary": "VizConnect, Inc. provides cloud-based, mobile video marketing platform in the United States. The company's proprietary mobile video marketing platform helps social celebrities, businesses, and brands visually connect with and monetize online fans, followers, and customers using mobile and online video. It offers cloud based marketing services using a combination of mobile video marketing, video storage, and cloud computing. VizConnect, Inc. assists companies in a range of industries in utilizing mobile devices and technologies to create targeted branding and advertising campaigns. Its cloud-based marketing tool has small business applications, enterprise solutions for large companies, and white-label opportunities for marketing and communications firms. The company was founded in 2010 and is based in Longmeadow, Massachusetts.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Longmeadow"
    },
    "WWIO": {
        "short_name": "WOWIO INC",
        "long_name": "Wowio, Inc.",
        "summary": "Wowio, Inc. operates in the real estate sector. It is involved in the development of properties in the United States. The company was founded in 2005 and is based in Newport Beach, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Newport Beach"
    },
    "XWM.F": {
        "short_name": "NTNL CINEMEDIA INC.DL-,01",
        "long_name": "National CineMedia, Inc.",
        "summary": "National CineMedia, Inc., through its subsidiary, National CineMedia, LLC, operates a digital in-theater network in North America. The company engages in the sale of advertising to national, regional, and local businesses in Noovie, a cinema advertising and entertainment pre-show seen on movie screens; and sells advertising on its Lobby Entertainment Network, a series of strategically-placed screens located in movie theater lobbies, as well as other forms of advertising and promotions in theatre lobbies. It is also involved in the sale of online and mobile advertising through its Cinema Accelerator digital product, as well as suite of Noovie digital properties, such as Noovie.com, Noovie Shuffle, Name That Movie, Noovie Arcade, and Fantasy Movie League to reach entertainment audiences beyond the theater. The company offers its services to third-party theater circuits under long-term network affiliate agreements. It also operates search and discovery platform, under the brand name Noovie.com. National CineMedia, Inc. was founded in 2005 and is headquartered in Centennial, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Centennial"
    }
}