{
    "0VV.F": {
        "short_name": "VIACOMCBS INC. CL.A",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "0VVB.F": {
        "short_name": "VIACOMCBS INC. BDL-,001",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "351.F": {
        "short_name": "LIVEXLIVE MEDIA  DL-,001",
        "long_name": "Antero Midstream Partners LP",
        "summary": "Antero Midstream Partners LP owns, develops, and operates midstream energy infrastructure in the United States. The company operates through two segments, Gathering and Processing, and Water Handling and Treatment. The Gathering and Processing segment operates a network of gathering pipelines and compressor stations to collect and process production from Antero Resources' wells in West Virginia and Ohio. This segment also provides processing and fractionation services. The Water Handling and Treatment segment delivers fresh water from the Ohio River, local reservoirs, and other regional waterways, as well as operates waste water treatment facilities. This segment also provides fluid handling services that include high rate transfer, and waste water treatment and disposal services. Antero Midstream Partners GP LLC serves as the general partner of the company. Antero Midstream Partners LP was founded in 2013 and is headquartered in Denver, Colorado. Antero Midstream Partners LP operates as a subsidiary of Antero Midstream Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80202",
        "website": "http://www.anteromidstream.com",
        "market_cap": "Small Cap"
    },
    "3L1.F": {
        "short_name": "MARCUS CORP.  DL 1",
        "long_name": "The Marcus Corporation",
        "summary": "The Marcus Corporation, together with its subsidiaries, owns and operates movie theatres, and hotels and resorts in the United States. As of March 4, 2021, it owned or operated 1,097 screens at 89 movie theatre locations in 17 states under the Marcus Theatres, Movie Tavern by Marcus, and BistroPlex brands; and owned and managed 18 hotels, resorts, and other properties in 8 states. The company also operates a family entertainment center under the Funset Boulevard name in Appleton, Wisconsin, as well as owns and operates a retail outlet under the name of Ronnie's Plaza in St. Louis, Missouri. In addition, it provides hospitality management services, including check-in, housekeeping, and maintenance for a vacation ownership development. The company was founded in 1935 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53202-4125",
        "website": "http://www.marcuscorp.com",
        "market_cap": "Small Cap"
    },
    "46B.F": {
        "short_name": "READING INTL A  DL-,01",
        "long_name": "Reading International, Inc.",
        "summary": "Reading International, Inc., together with its subsidiaries, focuses on the ownership, development, and operation of entertainment and real property assets in the United States, Australia, and New Zealand. The company operates in two segments, Cinema Exhibition and Real Estate. The Cinema Exhibition segment operates multiplex cinemas. This segment operates its cinema exhibition businesses under the Reading Cinemas, Angelika Film Centers, Consolidated Theatres, State Cinema, City Cinemas, Event Cinemas, and Rialto brands. The Real Estate segment develops, rents, or licenses retail, commercial, and live theater assets. As of December 31, 2020, the company had interests in 61 cinemas comprising approximately 504 screens; fee interests in two live theaters; fee interest in 44 Union Square property; fee interest in one cinema in Manhattan; fee interests in two cinemas in Australia and four cinemas in New Zealand; fee interest in entertainment-themed centers; fee interest in 2 office buildings; and fee ownership of approximately 20.8 million square feet of developed and undeveloped real estate assets. Reading International, Inc. was founded in 1937 and is headquartered in Culver City, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Culver City",
        "zipcode": "90230",
        "website": "http://www.readingrdi.com",
        "market_cap": "Small Cap"
    },
    "4XV.F": {
        "short_name": "GENIUS BRANDS  DL-,001",
        "long_name": "Genius Brands International, Inc.",
        "summary": "Genius Brands International, Inc., a content and brand management company, creates and licenses multimedia content for toddlers to tweens worldwide. The company offers Rainbow Rangers, an animated series about the adventures of seven magical girls; Llama Llama, an animated series; SpacePop is a music and fashion driven animated property; Thomas Edison's Secret Lab, a STEM-based comedy adventure series; and Warren Buffet's Secret Millionaire's Club, an animated series for kids. It also develops animated series, such as Superhero Kindergarten and Baby Genius. In addition, the company acts as a licensing agent for Llama Llama. It serves various customers and partners, including broadcasters, consumer products licensees, manufacturers, wholesalers, and retailers. The company was formerly known as Pacific Entertainment Corporation and changed its name to Genius Brands International, Inc. in October 2011. Genius Brands International, Inc. was founded in 2006 and is based in Beverly Hills, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.gnusbrands.com",
        "market_cap": "Small Cap"
    },
    "8L8C.F": {
        "short_name": "LIBERTY BROADBAND C",
        "long_name": "Liberty Broadband Corporation",
        "summary": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertybroadband.com",
        "market_cap": "Large Cap"
    },
    "AEMC": {
        "short_name": "ARCHER ENTERTAINMENT MEDIA COMM",
        "long_name": "Archer Entertainment Media Communications, Inc.",
        "summary": "Archer Entertainment Media Communications, Inc. is engaged in the development, management, and distribution of digital films in the United States and China. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90071",
        "website": null,
        "market_cap": "Small Cap"
    },
    "AESE": {
        "short_name": "Allied Esports Entertainment, I",
        "long_name": "Allied Esports Entertainment Inc.",
        "summary": "Allied Esports Entertainment Inc. operates a premier public esports and entertainment company, consisting of the Allied Esports and World Poker Tour (WPT) businesses worldwide. The company has two segments, Gaming & Entertainment and E-Sports. It operates esports properties to connect players and fans via a network of connected arenas; a flagship gaming arena located at the Luxor Hotel in Las Vegas, Nevada; a mobile esports truck that serves as a battleground and content generation hub; and a studio for recording and streaming gaming events, as well as provides multiplayer video game competitions. The company also operates ClubWPT, an online poker club; PlayWPT, a web and mobile social poker; and Alpha8, a social poker product. In addition, it engages in the brand and music licensing business. Allied Esports Entertainment Inc. is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92614",
        "website": "http://www.alliedesportsent.com",
        "market_cap": "Small Cap"
    },
    "AFOM": {
        "short_name": "ALL FOR ONE MEDIA CORP",
        "long_name": "All For One Media Corp.",
        "summary": "All For One Media Corp., a media and entertainment company, engages in the content development of media. It primarily offers its services for the children between the ages of seven and fourteen. The company was formerly known as Early Equine, Inc. and changed its name to All for One Media Corp. in November 2015. All For One Media Corp. was incorporated in 2004 and is based in Mount Kisco, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Mount Kisco",
        "zipcode": "10549",
        "website": "http://allforone.media",
        "market_cap": "Small Cap"
    },
    "AFTM": {
        "short_name": "AFTERMASTER INC",
        "long_name": "AfterMaster, Inc.",
        "summary": "AfterMaster, Inc., together with its subsidiaries, operates as an audio technology company in the United States. It develops and commercializes proprietary audio and video technologies for professional and consumer use. The company offers AfterMaster audio, a mastering, remastering, and audio processing technology that makes various audio source sounds louder, fuller, deeper, and clearer; ProMaster, an online music mastering, streaming, and storage service designed for independent artists; and Aftermaster Pro, a personal audio re-mastering device. It also provides Aftermaster Studio Pro products for use in commercial audio applications; and MyStudio products. In addition, AfterMaster, Inc. operates six recording and mastering studios. The company was formerly known as Studio One Media, Inc. and changed its name to AfterMaster, Inc. in September 2015. AfterMaster, Inc. was incorporated in 1988 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85260",
        "website": "http://www.aftermaster.com",
        "market_cap": "Small Cap"
    },
    "AH9.F": {
        "short_name": "AMC ENTERTAINMENT HLDGS A",
        "long_name": "AMC Entertainment Holdings, Inc.",
        "summary": "AMC Entertainment Holdings, Inc., through its subsidiaries, involved in the theatrical exhibition business. The company owns, operates, or has interests in theatres. As of March 12, 2021, it operated approximately 1000 theatres and 10,700 screens in the United States and internationally. The company was founded in 1920 and is headquartered in Leawood, Kansas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "KS",
        "city": "Leawood",
        "zipcode": "66211",
        "website": "http://www.amctheatres.com",
        "market_cap": "Large Cap"
    },
    "AMC.MX": {
        "short_name": "AMC ENTERTAINMENT HOLDINGS INC",
        "long_name": "AMC Entertainment Holdings, Inc.",
        "summary": "AMC Entertainment Holdings, Inc., through its subsidiaries, involved in the theatrical exhibition business. The company owns, operates, or has interests in theatres. As of March 12, 2021, it operated approximately 1000 theatres and 10,700 screens in the United States and internationally. The company was founded in 1920 and is headquartered in Leawood, Kansas.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "KS",
        "city": "Leawood",
        "zipcode": "66211",
        "website": "http://www.amctheatres.com",
        "market_cap": "Large Cap"
    },
    "AMC": {
        "short_name": "AMC Entertainment Holdings, Inc",
        "long_name": "AMC Entertainment Holdings, Inc.",
        "summary": "AMC Entertainment Holdings, Inc., through its subsidiaries, involved in the theatrical exhibition business. The company owns, operates, or has interests in theatres. As of March 12, 2021, it operated approximately 1000 theatres and 10,700 screens in the United States and internationally. The company was founded in 1920 and is headquartered in Leawood, Kansas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "KS",
        "city": "Leawood",
        "zipcode": "66211",
        "website": "http://www.amctheatres.com",
        "market_cap": "Mid Cap"
    },
    "BATRA": {
        "short_name": "Liberty Media Corporation - Ser",
        "long_name": "The Liberty Braves Group",
        "summary": "The Liberty Braves Group, through its subsidiary, Braves Holdings, LLC, owns the Atlanta Braves Major League Baseball Club (ANLBC), assets and liabilities associated with ANLBC's stadium, and mixed use development project. The company is based in Englewood, Colorado. The Liberty Braves Group is a subsidiary of Liberty Media Corporation.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertymedia.com/companies/braves-group.html",
        "market_cap": "Small Cap"
    },
    "BATRB": {
        "short_name": "LIBERTY MEDIA CORPORATION",
        "long_name": "The Liberty Braves Group",
        "summary": "The Liberty Braves Group, through its subsidiary, Braves Holdings, LLC, owns the Atlanta Braves Major League Baseball Club (ANLBC), assets and liabilities associated with ANLBC's stadium, and mixed use development project. The company is based in Englewood, Colorado. The Liberty Braves Group is a subsidiary of Liberty Media Corporation.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertymedia.com/companies/braves-group.html",
        "market_cap": "Small Cap"
    },
    "BATRK": {
        "short_name": "Liberty Media Corporation - Ser",
        "long_name": "The Liberty Braves Group",
        "summary": "The Liberty Braves Group, through its subsidiary, Braves Holdings, LLC, owns the Atlanta Braves Major League Baseball Club (ANLBC), assets and liabilities associated with ANLBC's stadium, and mixed use development project. The company is based in Englewood, Colorado. The Liberty Braves Group is a subsidiary of Liberty Media Corporation.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertymedia.com/companies/braves-group.html",
        "market_cap": "Small Cap"
    },
    "BDIC": {
        "short_name": "BLOW & DRIVE INTERLOCK CORP",
        "long_name": "Blow & Drive Interlock Corporation",
        "summary": "Blow & Drive Interlock Corporation, through its subsidiaries, operates an eSports platform in Malaysia. The company provides www.Matchroom.net., an integrated e-sports tournament site that allows tournament organizers, brands, players, and game developers to organize e-sports tournaments on platform utilizing platform tools, such as user registrations, payments, communications, lives stream link ups, wallet system, and other community features. It also offers information technology, mobile application development, and digital content publishing services. Blow & Drive Interlock Corporation is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90035",
        "website": "http://www.blowanddrive.com",
        "market_cap": "Small Cap"
    },
    "BLIAQ": {
        "short_name": "BB LIQUIDATING INC",
        "long_name": "BB Liquidating Inc.",
        "summary": "BB Liquidating Inc. is in the process of liquidation of its remaining assets. Previously, it was operated and franchised entertainment-related stores in the United States and internationally. The company was formerly known as Blockbuster Inc. and changed its name to BB Liquidating Inc. in August 2011. BB Liquidating Inc. was founded in 1982 and is based in Dallas, Texas. On July 16, 2013, the voluntary petition of BB Liquidating Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on September 23, 2010. BB Liquidating Inc. operates as a subsidiary of DISH Network Corporation",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.blockbuster.com",
        "market_cap": "Small Cap"
    },
    "BLIBQ": {
        "short_name": "BB LIQUIDATING INC",
        "long_name": "BB Liquidating Inc.",
        "summary": "BB Liquidating Inc. is in the process of liquidation of its remaining assets. Previously, it was operated and franchised entertainment-related stores in the United States and internationally. The company was formerly known as Blockbuster Inc. and changed its name to BB Liquidating Inc. in August 2011. BB Liquidating Inc. was founded in 1982 and is based in Dallas, Texas. On July 16, 2013, the voluntary petition of BB Liquidating Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on September 23, 2010. BB Liquidating Inc. operates as a subsidiary of DISH Network Corporation",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.blockbuster.com",
        "market_cap": "Small Cap"
    },
    "BOTY": {
        "short_name": "LINGERIE FIGHTING CHAMPIONSHIPS",
        "long_name": "Lingerie Fighting Championships, Inc.",
        "summary": "Lingerie Fighting Championships, Inc., a media company, focuses on developing, producing, promoting, and distributing entertainment through live entertainment events, digital home videos, broadcast television networks, video on demand, and digital media channels in the United States. It offers wrestling and mixed martial arts fights featuring women under the LFC brand name. The company was founded in 2014 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89149",
        "website": "http://www.lingeriefc.com",
        "market_cap": "Small Cap"
    },
    "BSEG": {
        "short_name": "BIG SCREEN ENTMT GROUP INC",
        "long_name": "Big Screen Entertainment Group, Inc.",
        "summary": "Big Screen Entertainment Group, Inc. operates as an entertainment company in the United States. The company develops, produces, purchases, exhibits, and distributes entertainment products in various media formats, including motion pictures, television, music, video games, and publishing. It plays its films at independent film festivals; and at the theatrical chains in the United States, the United Kingdom, and Germany, as well as in retail outlets. The company was formerly known as Beverly Hills Film Studios, Inc. and changed its name to Big Screen Entertainment Group, Inc. in August 2005. Big Screen Entertainment Group, Inc. was founded in 1995 and is headquartered in Hollywood, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Hollywood",
        "zipcode": "90038",
        "website": "http://bigscreenentgroup.com",
        "market_cap": "Small Cap"
    },
    "BTOW": {
        "short_name": "GTFN HLDGS INC",
        "long_name": "GTFN Holdings Inc.",
        "summary": "GTFN Holdings Inc., through its subsidiaries, engages in the production and distribution of feature length and shorter length motion pictures. The company was formerly known as Belltower Entertainment Corp. and changed its name to GTFN Holdings Inc. in February 2021. GTFN Holdings Inc. is based in Studio City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Studio City",
        "zipcode": "91604",
        "website": "http://www.belltower.ca",
        "market_cap": "Small Cap"
    },
    "C1BS34.SA": {
        "short_name": "VIACOMCBS   DRN",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "CATV": {
        "short_name": "4CABLE TV INTL INC",
        "long_name": "4Cable TV International, Inc.",
        "summary": "4Cable TV International, Inc. provides specialty solutions to the cable television sector. It offers a suite of products comprising RF to Fiber (RF2F), a proprietary line of coax-to-fiber taps that enables cable operators to reach homes within their franchise authorized area; PowerMiser, a circuitry, which allows a low current 1 GHz amplifier and/or line extender to be constructed with a decrease in current power requirements; RF over Glass (RFoG) signal distribution technology that combines the existing cable TV infrastructure with fiber optics to reach the home; and Node+0 application, which combines the RFoG technology platform with its PowerMiser engineering to take fiber signal. The company also provides SOLAR-CATV that utilizes solar power and helps the operator extend service to areas not presently served without adding power sources; and Dynamically Scalable Return technology, which allows nodes, R-ONU's (RFoG optical network units) to adjust their return bandwidth by changing the channel lineup at the head end, as well as repair, testing, and upgrade services. It markets and sells its products through a network of dealers in the United States and Canada primarily to independent cable TV operators, as well as to multiple system operators. 4Cable TV International, Inc. was incorporated in 2007 and is based in Conway, South Carolina.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Conway",
        "zipcode": "29526",
        "website": "http://www.4cable.tv",
        "market_cap": "Small Cap"
    },
    "CCLX": {
        "short_name": "CABLECLIX USA INC",
        "long_name": "CableClix (USA), Inc.",
        "summary": "CableClix (USA), Inc. provides media rebroadcasting services. The company was incorporated in 2013 and is based in Winchester, Virginia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Winchester",
        "zipcode": "22601",
        "website": "http://www.cableclix.com",
        "market_cap": "Small Cap"
    },
    "CEXE": {
        "short_name": "CIRCLE ENTERTAINMENT INC",
        "long_name": "Circle Entertainment Inc.",
        "summary": "Circle Entertainment, Inc. does not have significant operations. Previously, the company was involved in the development of location-based entertainment line of business. The company was formerly known as FX Real Estate and Entertainment Inc. and changed its name to Circle Entertainment, Inc. in January 2011. Circle Entertainment Inc. was founded in 2007 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": null,
        "market_cap": "Small Cap"
    },
    "CHCM34.SA": {
        "short_name": "CHARTER COMMDRN",
        "long_name": "Charter Communications, Inc.",
        "summary": "Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company provides Internet services, such as security suite that protects computers from viruses and spyware; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi services, as well as video services. It also offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, the company provides mobile services; offers video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as MTV, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App for optimizes linear inventory. Further, it offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports and news networks. The company serves approximately 31 million customers in 41 states. Charter Communications, Inc. was founded in 1993 and is headquartered in Stamford, Connecticut.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06901",
        "website": "http://corporate.charter.com",
        "market_cap": "Large Cap"
    },
    "CHTR.MX": {
        "short_name": "CHARTER COMMUNICATIONS INC",
        "long_name": "Charter Communications, Inc.",
        "summary": "Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company provides Internet services, such as security suite that protects computers from viruses and spyware; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi services, as well as video services. It also offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, the company provides mobile services; offers video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as MTV, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App for optimizes linear inventory. Further, it offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports and news networks. The company serves approximately 31 million customers in 41 states. Charter Communications, Inc. was founded in 1993 and is headquartered in Stamford, Connecticut.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06901",
        "website": "http://corporate.charter.com",
        "market_cap": "Large Cap"
    },
    "CHTR": {
        "short_name": "Charter Communications, Inc.",
        "long_name": "Charter Communications, Inc.",
        "summary": "Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company provides Internet services, such as security suite that protects computers from viruses and spyware; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi services, as well as video services. It also offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, the company provides mobile services; offers video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as MTV, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App for optimizes linear inventory. Further, it offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports and news networks. The company serves approximately 31 million customers in 41 states. Charter Communications, Inc. was founded in 1993 and is headquartered in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06901",
        "website": "http://corporate.charter.com",
        "market_cap": "Large Cap"
    },
    "CHTR.VI": {
        "short_name": "CHARTER COMMUNICATIONS INC-A",
        "long_name": "Charter Communications, Inc.",
        "summary": "Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company provides Internet services, such as security suite that protects computers from viruses and spyware; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi services, as well as video services. It also offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, the company provides mobile services; offers video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as MTV, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App for optimizes linear inventory. Further, it offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports and news networks. The company serves approximately 31 million customers in 41 states. Charter Communications, Inc. was founded in 1993 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06901",
        "website": "http://corporate.charter.com",
        "market_cap": "Large Cap"
    },
    "CIDM": {
        "short_name": "Cinedigm Corp",
        "long_name": "Cinedigm Corp.",
        "summary": "Cinedigm Corp., together with its subsidiaries, operates as distributor and aggregator of independent movie, television, and other short form content in the United States, Canada, and New Zealand. The company operates through two segments, Cinema Equipment Business and Content and Entertainment Business. It manages a library of distribution rights to various titles and episodes released across digital, physical, and home and mobile entertainment platforms, as well as services digital cinema assets on approximately 12,000 domestic and foreign movie screens. The company distributes its products for various brands, such as Hallmark, Televisa, ITV, Nelvana, ZDF, Shout! Factory, NFL, NHL and Scholastic, as well as international and domestic content creators, movie producers, television producers, and other short form digital content producers. It also collaborates with producers, various brands, and other content owners to market, source, curate, and distribute content to targeted audiences through existing and emerging digital home entertainment platforms, including Apple, Amazon Prime, Netflix, Hulu, Xbox, PlayStation, Sony, and cable/satellite video-on-demand; and distributes DVD and Blu-ray discs to wholesalers and retailers with sales coverage to approximately 60,000 brick and mortar storefronts, including Walmart, Target, Best Buy, and Amazon. In addition, the company operates various branded and curated over-the-top (OTT) entertainment channels, including Docurama, CONtv, and Dove Channel; and Matchpoint, a software-as-a-service platform to automate the distribution of streaming content and OTT channels. Cinedigm Corp. has a strategic alliance with Starrise Media Holdings Limited to release films in China theatrically and to digital platforms. The company was formerly known as Cinedigm Digital Cinema Corp. and changed its name to Cinedigm Corp. in September 2013. Cinedigm Corp. was founded in 2000 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.cinedigm.com",
        "market_cap": "Small Cap"
    },
    "CMCS.VI": {
        "short_name": "COMCAST CORP-CLASS A",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "CMCS34.SA": {
        "short_name": "COMCAST     DRN",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "CMCSA.MX": {
        "short_name": "COMCAST CORP",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "CMCSA": {
        "short_name": "Comcast Corporation",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "CMCSA.SN": {
        "short_name": "COMCAST CORP",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "CMGR": {
        "short_name": "CLUBHOUSE MEDIA GROUP INC",
        "long_name": "Clubhouse Media Group Inc.",
        "summary": "West of Hudson Group, Inc. was incorporated in 2004 and is based in Morris Plains, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Morris Plains",
        "zipcode": "07950",
        "website": null,
        "market_cap": "Small Cap"
    },
    "CNK.MX": {
        "short_name": "CINEMARK HOLDINGS INC",
        "long_name": "Cinemark Holdings, Inc.",
        "summary": "Cinemark Holdings, Inc., together with its subsidiaries, engages in the motion picture exhibition business. As of March 4, 2021, it operated 531 theatres with 5,958 screens in the United States, Brazil, Argentina, Chile, Colombia, Ecuador, Peru, Honduras, El Salvador, Nicaragua, Costa Rica, Panama, Guatemala, Bolivia, Curacao, and Paraguay. The company was founded in 1984 and is headquartered in Plano, Texas.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Plano",
        "zipcode": "75093",
        "website": "http://ir.cinemark.com",
        "market_cap": "Large Cap"
    },
    "CNK": {
        "short_name": "Cinemark Holdings Inc Cinemark ",
        "long_name": "Cinemark Holdings, Inc.",
        "summary": "Cinemark Holdings, Inc., together with its subsidiaries, engages in the motion picture exhibition business. As of March 4, 2021, it operated 531 theatres with 5,958 screens in the United States, Brazil, Argentina, Chile, Colombia, Ecuador, Peru, Honduras, El Salvador, Nicaragua, Costa Rica, Panama, Guatemala, Bolivia, Curacao, and Paraguay. The company was founded in 1984 and is headquartered in Plano, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Plano",
        "zipcode": "75093",
        "website": "http://ir.cinemark.com",
        "market_cap": "Mid Cap"
    },
    "CQD.F": {
        "short_name": "CHARTER COM. CL. A",
        "long_name": "Charter Communications, Inc.",
        "summary": "Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company provides Internet services, such as security suite that protects computers from viruses and spyware; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi services, as well as video services. It also offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, the company provides mobile services; offers video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as MTV, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App for optimizes linear inventory. Further, it offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports and news networks. The company serves approximately 31 million customers in 41 states. Charter Communications, Inc. was founded in 1993 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06901",
        "website": "http://corporate.charter.com",
        "market_cap": "Large Cap"
    },
    "CSCW": {
        "short_name": "Color Star Technology Co. Ltd.",
        "long_name": "Color Star Technology Co., Ltd.",
        "summary": "Color Star Technology Co., Ltd., through its subsidiaries, provides online and offline music education services in the United States and China. It also offers Color World, an online cultural entertainment platform that provides celebrity lectures, celebrity concert videos, celebrity peripheral products, and artist interactive communication. Color Star Technology Co., Ltd. has a strategic partnership with Yinmiao Culture Development Co., Ltd. to work together in the areas of piano competition, art festival coordination, and online and offline training, as well as artificial intelligence piano hardware research and development, production, and sales. The company was formerly known as Huitao Technology Co., Ltd., and changed its name to Color Star Technology Co., Ltd. in May 2020. Color Star Technology Co., Ltd. was founded in 2005 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.colorstarinternational.com",
        "market_cap": "Small Cap"
    },
    "CTP2.DE": {
        "short_name": "COMCAST CORP.  A  DL-,01",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "CTP2.F": {
        "short_name": "COMCAST CORP.  A  DL-,01",
        "long_name": "Comcast Corporation",
        "summary": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand, as well as sells advertising. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "PA",
        "city": "Philadelphia",
        "zipcode": "19103-2838",
        "website": "http://corporate.comcast.com",
        "market_cap": "Large Cap"
    },
    "D1IS34.SA": {
        "short_name": "DISH NETWORKDRN",
        "long_name": "DISH Network Corporation",
        "summary": "DISH Network Corporation, together with its subsidiaries, provides pay-TV services in the United States. The company operates in two segments, Pay-TV and Wireless. It offers video services under the DISH TV brand; and programming packages that include programming through national broadcast networks, local broadcast networks, and national and regional cable networks, as well as regional and specialty sports channels, premium movie channels, and Latino and international programming packages. The company also provides access to movies and television shows through TV or Internet-connected devices; and dishanywhere.com and mobile applications on Internet-connected devices to view authorized content, search program listings, and remotely control certain features of their DVRs. In addition, it offers Sling TV services, including Sling domestic, Sling International, Sling Latino, Sling Orange, and Sling Blue services that require an Internet connection and are available on streaming-capable devices, such as streaming media devices, TVs, tablets, computers, game consoles, and phones primarily to consumers who do not subscribe to traditional satellite and cable pay-TV services. As of December 31, 2020, it had 11.290 million Pay-TV subscribers in the United States, including 8.816 million DISH TV subscribers and 2.474 million SLING TV subscribers. The company offers receiver systems and programming through direct sales channels, as well as independent third parties, such as small retailers, direct marketing groups, local and regional consumer electronics stores, retailers, and telecommunications companies. DISH Network Corporation was founded in 1980 and is headquartered in Englewood, Colorado.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.dish.com",
        "market_cap": "Large Cap"
    },
    "DAFL": {
        "short_name": "DU-ART FILM LABORATORIES INC",
        "long_name": "Du-Art Film Laboratories, Inc.",
        "summary": "Du-Art Film Laboratories, Inc. provides post production and media services to producers, distributors, Fortune 500 companies, and independent filmmakers. It offers 4K digital post production, audiobook production, audio production and mixing, language localization production, digital asset management, editing, finishing, equipment and suite rental, and other services. The company was founded in 1922 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.duart.com",
        "market_cap": null
    },
    "DC6.F": {
        "short_name": "DISCOVERY A DL-,01",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DC6B.F": {
        "short_name": "DISCOVERY B DL-,01",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DC6C.F": {
        "short_name": "DISCOVERY C DL-,01",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DCVY34.SA": {
        "short_name": "DISCOVERY INDRN A",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DCVY35.SA": {
        "short_name": "DISCOVERY INDRN C",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DIS.MX": {
        "short_name": "THE WALT DISNEY COMPANY",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "DIS": {
        "short_name": "Walt Disney Company (The)",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "DIS.SN": {
        "short_name": "THE WALT DISNEY COMPANY",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "DIS.VI": {
        "short_name": "WALT DISNEY CO",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "DISA.VI": {
        "short_name": "DISCOVERY COMMUNICATIONS-A",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DISB34.SA": {
        "short_name": "WALT DISNEY DRN",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "DISC.VI": {
        "short_name": "DISCOVERY COMMUNICATIONS-C",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DISCA.MX": {
        "short_name": "DISCOVERY INC",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DISCA": {
        "short_name": "Discovery, Inc. - Series A",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DISCB": {
        "short_name": "Discovery, Inc. - Series B",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DISCK": {
        "short_name": "Discovery, Inc. - Series C",
        "long_name": "Discovery, Inc.",
        "summary": "Discovery, Inc., a media company, provides content across various distribution platforms in approximately 50 languages worldwide. It operates in two segments, U.S. Networks and International Networks. The company owns and operates various television networks under the Discovery Channel, HGTV, Food Network, TLC, Animal Planet, Investigation Discovery, Travel Channel, Science, MotorTrend, Discovery en EspaÃ±ol, Discovery Familia, Eurosport, TVN, Discovery Kids, Discovery Family, American Heroes Channel, Destination America, Discovery Life, DIY Network, Cooking Channel, Great American Country, ID, the Oprah Winfrey Network, Eurosport, DMAX, and Discovery Home & Health brands, as well as other regional television networks. Its content spans genres, including survival, natural history, exploration, sports, general entertainment, home, food, travel, heroes, adventure, crime and investigation, health, and kids. The company also operates production studios that develop and produce content; and digital products and Websites. It provides content through various distribution platforms comprising pay-television, free-to-air and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing agreements, and direct-to-consumer subscriptions, as well as various platforms that include brand-aligned Websites, online streaming, mobile devices, video on demand, and broadband channels. The company was founded in 1985 and is headquartered in Silver Spring, Maryland.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MD",
        "city": "Silver Spring",
        "zipcode": "20910",
        "website": "http://corporate.discovery.com",
        "market_cap": "Large Cap"
    },
    "DISH.MX": {
        "short_name": "DISH NETWORK CORPORATION",
        "long_name": "DISH Network Corporation",
        "summary": "DISH Network Corporation, together with its subsidiaries, provides pay-TV services in the United States. The company operates in two segments, Pay-TV and Wireless. It offers video services under the DISH TV brand; and programming packages that include programming through national broadcast networks, local broadcast networks, and national and regional cable networks, as well as regional and specialty sports channels, premium movie channels, and Latino and international programming packages. The company also provides access to movies and television shows through TV or Internet-connected devices; and dishanywhere.com and mobile applications on Internet-connected devices to view authorized content, search program listings, and remotely control certain features of their DVRs. In addition, it offers Sling TV services, including Sling domestic, Sling International, Sling Latino, Sling Orange, and Sling Blue services that require an Internet connection and are available on streaming-capable devices, such as streaming media devices, TVs, tablets, computers, game consoles, and phones primarily to consumers who do not subscribe to traditional satellite and cable pay-TV services. As of December 31, 2020, it had 11.290 million Pay-TV subscribers in the United States, including 8.816 million DISH TV subscribers and 2.474 million SLING TV subscribers. The company offers receiver systems and programming through direct sales channels, as well as independent third parties, such as small retailers, direct marketing groups, local and regional consumer electronics stores, retailers, and telecommunications companies. DISH Network Corporation was founded in 1980 and is headquartered in Englewood, Colorado.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.dish.com",
        "market_cap": "Large Cap"
    },
    "DISH": {
        "short_name": "DISH Network Corporation",
        "long_name": "DISH Network Corporation",
        "summary": "DISH Network Corporation, together with its subsidiaries, provides pay-TV services in the United States. The company operates in two segments, Pay-TV and Wireless. It offers video services under the DISH TV brand; and programming packages that include programming through national broadcast networks, local broadcast networks, and national and regional cable networks, as well as regional and specialty sports channels, premium movie channels, and Latino and international programming packages. The company also provides access to movies and television shows through TV or Internet-connected devices; and dishanywhere.com and mobile applications on Internet-connected devices to view authorized content, search program listings, and remotely control certain features of their DVRs. In addition, it offers Sling TV services, including Sling domestic, Sling International, Sling Latino, Sling Orange, and Sling Blue services that require an Internet connection and are available on streaming-capable devices, such as streaming media devices, TVs, tablets, computers, game consoles, and phones primarily to consumers who do not subscribe to traditional satellite and cable pay-TV services. As of December 31, 2020, it had 11.290 million Pay-TV subscribers in the United States, including 8.816 million DISH TV subscribers and 2.474 million SLING TV subscribers. The company offers receiver systems and programming through direct sales channels, as well as independent third parties, such as small retailers, direct marketing groups, local and regional consumer electronics stores, retailers, and telecommunications companies. DISH Network Corporation was founded in 1980 and is headquartered in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.dish.com",
        "market_cap": "Large Cap"
    },
    "DISH.VI": {
        "short_name": "DISH NETWORK CORP-A",
        "long_name": "DISH Network Corporation",
        "summary": "DISH Network Corporation, together with its subsidiaries, provides pay-TV services in the United States. The company operates in two segments, Pay-TV and Wireless. It offers video services under the DISH TV brand; and programming packages that include programming through national broadcast networks, local broadcast networks, and national and regional cable networks, as well as regional and specialty sports channels, premium movie channels, and Latino and international programming packages. The company also provides access to movies and television shows through TV or Internet-connected devices; and dishanywhere.com and mobile applications on Internet-connected devices to view authorized content, search program listings, and remotely control certain features of their DVRs. In addition, it offers Sling TV services, including Sling domestic, Sling International, Sling Latino, Sling Orange, and Sling Blue services that require an Internet connection and are available on streaming-capable devices, such as streaming media devices, TVs, tablets, computers, game consoles, and phones primarily to consumers who do not subscribe to traditional satellite and cable pay-TV services. As of December 31, 2020, it had 11.290 million Pay-TV subscribers in the United States, including 8.816 million DISH TV subscribers and 2.474 million SLING TV subscribers. The company offers receiver systems and programming through direct sales channels, as well as independent third parties, such as small retailers, direct marketing groups, local and regional consumer electronics stores, retailers, and telecommunications companies. DISH Network Corporation was founded in 1980 and is headquartered in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.dish.com",
        "market_cap": "Large Cap"
    },
    "DKMR": {
        "short_name": "XTREME FIGHTING CHAMPIONSHIPS I",
        "long_name": "Xtreme Fighting Championships, Inc.",
        "summary": "Xtreme Fighting Championships, Inc. operates as a mixed martial arts company. The company was formerly known as Duke Mountain Resources, Inc. and changed its name to Xtreme Fighting Championships, Inc. in July 2020. Xtreme Fighting Championships, Inc. was founded in 2006 and is based in Miramar Beach, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miramar Beach",
        "zipcode": "32550",
        "website": "http://www.xfcmma.net",
        "market_cap": "Small Cap"
    },
    "DLPN": {
        "short_name": "Dolphin Entertainment, Inc.",
        "long_name": "Dolphin Entertainment, Inc.",
        "summary": "Dolphin Entertainment, Inc., together with its subsidiaries, operates as an independent entertainment marketing and premium content development company in the United States. It operates in two segments, Entertainment Publicity and Marketing; and Content Production. The Entertainment Publicity and Marketing segment offers public relations, entertainment content marketing, strategic communications, social media and digital marketing, creative branding, talent publicity, and entertainment marketing services, as well as produces promotional video content. The Content Production segment produces and distributes feature films and digital content. In addition, it offers strategic marketing and publicity services to individuals and corporates in the entertainment, hospitality, and music industries. The company was formerly known as Dolphin Digital Media, Inc. and changed its name to Dolphin Entertainment, Inc. in July 2017. Dolphin Entertainment, Inc. is headquartered in Coral Gables, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Coral Gables",
        "zipcode": "33134",
        "website": "http://www.dolphinentertainment.com",
        "market_cap": "Small Cap"
    },
    "E1OA.F": {
        "short_name": "EROS STX GLOBAL  LS -,30",
        "long_name": "Eros STX Global Corporation",
        "summary": "Eros STX Global Corporation produces, markets, and distributes content to audiences around the world across traditional and digital media platforms. The company produces and distributes films, scripted and unscripted TV programming, and digital content across a variety of platforms. It also offers Eros Now, a subscription based OTT platform. Eros STX Global Corporation was founded in 2011 and is headquartered in Burbank, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91505",
        "website": "http://erosstx.com",
        "market_cap": "Small Cap"
    },
    "EDR": {
        "short_name": "Endeavor Group Holdings, Inc.",
        "long_name": "Endeavor Group Holdings, Inc.",
        "summary": "Endeavor Group Holdings, Inc. operates as an entertainment, sports, and content company in the United States, the United Kingdom, and internationally. It operates in three segments: Owned Sports Properties, Events, Experiences & Rights, and Representation. The Owned Sports Properties segment operates a portfolio of sports properties, including Ultimate Fighting Championship, Professional Bull Rider, and Euroleague that license broadcast and other intellectual property rights and operate exclusive live events. The Events, Experiences & Rights segment provides services to a portfolio of live events, including sporting events, fashion, art fairs and music, culinary, and lifestyle festivals. This segment also owns and operates the IMG Academy, an academic and sports training institution; and produces and distributes sports video programming. The Representation segment offers services to a diverse group of talent across entertainment, sports, and fashion, such as actors, directors, writers, athletes, models, musicians, and other artists in various mediums comprising film, television, art, books, and live events. This segment provides brand strategy, marketing, advertising, public relations, analytics, digital, activation, and experiential services to corporate and other clients; intellectual property licensing services to a portfolio of entertainment, sports and consumer product brands; and content development, production, financing, sales, and advisory services for television properties, documentaries, feature films, and podcasts. The company was founded in 1898 and is headquartered in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.endeavorco.com",
        "market_cap": "Large Cap"
    },
    "EEGI": {
        "short_name": "ELINE ENTERTAINMENT GROUP INC",
        "long_name": "Eline Entertainment Group, Inc.",
        "summary": "Eline Entertainment Group, Inc., through its subsidiary Graystone Education, Inc., provides various education services. It also offers consulting services to public and private institutions, including charter schools, private k-12 schools, and higher education institutions at the undergraduate and graduate level. The company was formerly known as Influential Media Holdings, Inc. and changed its name to Eline Entertainment Group, Inc. in August 2018. Eline Entertainment Group, Inc. is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "West Palm Beach",
        "zipcode": "33401",
        "website": null,
        "market_cap": "Small Cap"
    },
    "EMPM": {
        "short_name": "EMPIRE POST MEDIA INC",
        "long_name": "Empire Post Media, Inc.",
        "summary": "Empire Post Media, Inc. does not have significant operations. The company intends to merge with another entity. Previously, it was engaged in post-production services to the movie and television industry. The company was founded in 2009 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89128",
        "website": "http://www.empirepostmedia.com",
        "market_cap": "Small Cap"
    },
    "ENTI": {
        "short_name": "ENCOUNTER TECHNOLOGIES INC",
        "long_name": "Encounter Development Technologies Inc.",
        "summary": "Encounter Development Technologies, Inc. operates as an online video distribution and technology company that launches proprietary syndication platforms and offers a range of video technology and distribution services to other companies. The company develops and programs solutions for the online streaming, distribution, and networking, as well as for the social network and distribution platforms. It also offers end-to-end technology and online marketing services, including design, build, hosting, and online marketing support. The company primarily operates GlobalAdOn.com, a patented technology for the yellow pages publishing industry. Its sales and management platform facilitates the sales and video production process for Internet yellow page publishers and their sales forces, as well as integrates and facilitates various processes, such as video shoot, sales rep, and publisher. The company was formerly known as Encounter Technologies, Inc. and changed its name to Encounter Development Technologies, Inc. in September 2011. Encounter Development Technologies, Inc. was founded in 1986 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": null,
        "website": "http://www.enticolorado.com",
        "market_cap": "Small Cap"
    },
    "EOT.F": {
        "short_name": "DISH NETWORK CORP.A DL-01",
        "long_name": "DISH Network Corporation",
        "summary": "DISH Network Corporation, together with its subsidiaries, provides pay-TV services in the United States. The company operates in two segments, Pay-TV and Wireless. It offers video services under the DISH TV brand; and programming packages that include programming through national broadcast networks, local broadcast networks, and national and regional cable networks, as well as regional and specialty sports channels, premium movie channels, and Latino and international programming packages. The company also provides access to movies and television shows through TV or Internet-connected devices; and dishanywhere.com and mobile applications on Internet-connected devices to view authorized content, search program listings, and remotely control certain features of their DVRs. In addition, it offers Sling TV services, including Sling domestic, Sling International, Sling Latino, Sling Orange, and Sling Blue services that require an Internet connection and are available on streaming-capable devices, such as streaming media devices, TVs, tablets, computers, game consoles, and phones primarily to consumers who do not subscribe to traditional satellite and cable pay-TV services. As of December 31, 2020, it had 11.290 million Pay-TV subscribers in the United States, including 8.816 million DISH TV subscribers and 2.474 million SLING TV subscribers. The company offers receiver systems and programming through direct sales channels, as well as independent third parties, such as small retailers, direct marketing groups, local and regional consumer electronics stores, retailers, and telecommunications companies. DISH Network Corporation was founded in 1980 and is headquartered in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.dish.com",
        "market_cap": "Large Cap"
    },
    "ESGC": {
        "short_name": "Eros STX Global Corporation A",
        "long_name": "Eros STX Global Corporation",
        "summary": "Eros STX Global Corporation produces, markets, and distributes content to audiences around the world across traditional and digital media platforms. The company produces and distributes films, scripted and unscripted TV programming, and digital content across a variety of platforms. It also offers Eros Now, a subscription based OTT platform. Eros STX Global Corporation was founded in 2011 and is headquartered in Burbank, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91505",
        "website": "http://erosstx.com",
        "market_cap": "Small Cap"
    },
    "EVLI": {
        "short_name": "EVERLERT INC",
        "long_name": "Everlert, Inc.",
        "summary": "Everlert, Inc. provides strategic management and structured financing services focusing on entertainment and real estate business sectors in Southern California. It offers entertainment related services and projects in the areas of management, new entertainment content development and acquisition, and structural financing solutions to entertainment projects. The company also develops and operates senior assisted living facilities in the Inland Empire region of Southern California. In addition, it provides consumer financial services, such as payday loans, car title loans, bail bonds, and pawnshop services. The company was incorporated in 1998 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Hollywood",
        "zipcode": "90028",
        "website": null,
        "market_cap": "Small Cap"
    },
    "EWKS": {
        "short_name": "EARTHWORKS ENTERTAINMENT INC",
        "long_name": "Earthworks Entertainment, Inc.",
        "summary": "Earthworks Entertainment, Inc., a development stage company, engages in the creation, co-production, marketing, and distribution of children's and family-oriented entertainment properties. It markets its properties through multiplatform Earthworks Entertainment, Inc., a development stage company, engages in the creation, co-production, marketing, and distribution of children's and family-oriented entertainment properties. It markets its properties through multiplatform market categories, including television, home video, merchandise licensing, electronic and video games, and book and music publishing. The company also forms teaming agreements with outside companies for the co-operative marketing of entertainment properties. Earthworks Entertainment owns marketing rights to nine family-oriented entertainment properties, which include Z-Force, an action adventure property; Nine Dog Christmas, a music-driven holiday property; Big Dogs, the big attitude character brand; Little Suzy's Zoo, the preschool and baby character brand; Corneil & Bernie; The Plonsters, the clay animation television series; The Little Reindeer, an animated Christmas special; 64 Zoo Lane, the animated children's series; and Kiddo the Super Truck, a theatrical quality computer animated property. The company was incorporated in 1986 and is based in Addison, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Addison",
        "zipcode": "75001",
        "website": null,
        "market_cap": "Small Cap"
    },
    "FMYR": {
        "short_name": "FAMILY ROOM ENTERTAINMENT CORP",
        "long_name": "Family Room Entertainment Corporation",
        "summary": "Family Room Entertainment Corporation, together with its subsidiaries, provides development, production, co-production and production, distribution, and consulting services for the motion picture entertainment industry in the United States. It also contracts with third parties or joint ventures for the distribution and/or exploitation of wholly owned and controlled entertainment properties and/or arrangements. The company was formerly known as Cobb Resources Corporation and changed its name to Family Room Entertainment Corporation in 2000. The company was founded in 1969 and is based in Toluca Lake, California. Family Room Entertainment Corporation is a subsidiary of Qin Media Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Toluca Lake",
        "zipcode": "91602",
        "website": "http://www.fmlyroom.com",
        "market_cap": "Small Cap"
    },
    "GBHL": {
        "short_name": "GLOBAL ENTERTAINMENT HOLDINGS I",
        "long_name": "Global Entertainment Holdings, Inc.",
        "summary": "Global Entertainment Holdings, Inc. operates an independent entertainment content production and distribution company that connects with audiences through compelling motion picture content and social media websites. It produces, finances, and sells motion pictures and other entertainment related content. The company also distributes Hollywood classic movies, TV shows, and shorts and vintage cartoons; develops You've Got The Part, a social media web platform; and operates WeedWeb.com, a professional cannabis network. Global Entertainment Holdings, Inc. was founded in 1996 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89119",
        "website": "http://www.global-gbhl.com",
        "market_cap": "Small Cap"
    },
    "GBXI": {
        "short_name": "GBX INTERNATIONAL GROUP INC",
        "long_name": "GBX International Group Inc.",
        "summary": "GBX International Group Inc. engages in the financing, development, and distribution of various feature films in the theatrical motion picture markets. The company was formerly known as Bridgegate Pictures Corp. GBX International Group Inc. was founded in 1997 and is based in Corona, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Corona",
        "zipcode": "92882",
        "website": "http://gbxintl.com",
        "market_cap": "Small Cap"
    },
    "GFMH": {
        "short_name": "GOLIATH FILM & MEDIA HLDGS",
        "long_name": "Goliath Film and Media Holdings",
        "summary": "Goliath Film and Media Holdings, through its subsidiaries, develops, produces, distributes, and licenses motion pictures and television content in the United States and internationally. The company was incorporated in 2010 and is based in Carson City, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Carson City",
        "zipcode": "89703",
        "website": "http://www.goliathfilmandmediainternational.com",
        "market_cap": "Small Cap"
    },
    "GNUS": {
        "short_name": "Genius Brands International, In",
        "long_name": "Genius Brands International, Inc.",
        "summary": "Genius Brands International, Inc., a content and brand management company, creates and licenses multimedia content for toddlers to tweens worldwide. The company offers Rainbow Rangers, an animated series about the adventures of seven magical girls; Llama Llama, an animated series; SpacePop is a music and fashion driven animated property; Thomas Edison's Secret Lab, a STEM-based comedy adventure series; and Warren Buffet's Secret Millionaire's Club, an animated series for kids. It also develops animated series, such as Superhero Kindergarten and Baby Genius. In addition, the company acts as a licensing agent for Llama Llama. It serves various customers and partners, including broadcasters, consumer products licensees, manufacturers, wholesalers, and retailers. The company was formerly known as Pacific Entertainment Corporation and changed its name to Genius Brands International, Inc. in October 2011. Genius Brands International, Inc. was founded in 2006 and is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.gnusbrands.com",
        "market_cap": "Small Cap"
    },
    "HHSE": {
        "short_name": "HANNOVER HOUSE INC",
        "long_name": "Hannover House, Inc.",
        "summary": "Hannover House, Inc. operates as a media production and distribution company in worldwide. The company produces and distributes feature films and video to theater, home video, digital streaming formats, television outlets, and international licensors; and publishes fiction and non-fiction books. It also develops MyFlix, a digital streaming site to consolidate feature films and television series programming owned by various studios and content owners into a single destination digital streaming site. The company was formerly known as Target Development Group, Inc. and changed its name to Hannover House, Inc. in January 2012. Hannover House, Inc. was incorporated in 1993 and is based in Fayetteville, Arkansas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AR",
        "city": "Fayetteville",
        "zipcode": "72701",
        "website": "http://www.hannoverhouse.com",
        "market_cap": "Small Cap"
    },
    "HLWD": {
        "short_name": "ALMOST NEVER FILMS INC",
        "long_name": "Almost Never Films Inc.",
        "summary": "Almost Never Films Inc. operates as a film company in the United States. It focuses on film production activities; and the provision of finance and production related services. The company is based in West Hollywood, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "West Hollywood",
        "zipcode": "90069",
        "website": "http://www.almostneverfilms.com",
        "market_cap": "Small Cap"
    },
    "HMTV": {
        "short_name": "Hemisphere Media Group, Inc.",
        "long_name": "Hemisphere Media Group, Inc.",
        "summary": "Hemisphere Media Group, Inc., the Spanish-language media company, operates broadcast and cable television networks, and digital content platforms. It operates Cinelatino, a cable movie network with approximately 17.9 million subscribers in the United States, Latin America, and Canada; WAPA, a broadcast television network and television content producer; WAPA.TV, a news and entertainment website, as well as mobile apps, featuring content produced by WAPA; and WAPA Deportes, a sports television network in Puerto Rico. The company also operates WAPA America, a cable television network that serves approximately 3.7 million subscribers in the United States; and Pasiones, a cable television network, which offers telenovelas and serialized dramas to approximately 18.4 million subscribers in the United States and Latin America. In addition, it operates Centroamerica TV, a cable television network that provides news and entertainment, and soccer programming to approximately 3.5 million subscribers in the United States; and Television Dominicana, a cable television network, which offers news and entertainment to approximately 2.2 million subscribers in the United States. Further, the company distributes content to broadcast and cable television networks; and over-the-top, SVOD, and AVOD platforms in Latin America. Hemisphere Media Group, Inc. was founded in 2013 and is headquartered in Coral Gables, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Coral Gables",
        "zipcode": "33146",
        "website": "http://www.hemispheretv.com",
        "market_cap": "Small Cap"
    },
    "HOFV": {
        "short_name": "Hall of Fame Resort & Entertain",
        "long_name": "Hall of Fame Resort & Entertainment Company",
        "summary": "Hall of Fame Resort & Entertainment Company, a resort and entertainment company, doing business as the Pro Football Hall of Fame. It owns the premier sports, entertainment, and media enterprise surrounding the Pro Football Hall of Fame in Canton, Ohio. The company was founded in 2015 and is headquartered in Canton, Ohio.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Canton",
        "zipcode": "44718",
        "website": "http://www.hofreco.com",
        "market_cap": "Small Cap"
    },
    "HOMU": {
        "short_name": "HOUMU HLDGS LTD",
        "long_name": "Houmu Holdings Ltd",
        "summary": "XXStream Entertainment, Inc. does not have significant operations. It intends to seek new business opportunities or to engage in a merger or acquisition with an unidentified company. The company was founded in 2005 and is based in Oceanside, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Oceanside",
        "zipcode": "11572",
        "website": null,
        "market_cap": null
    },
    "HQGE": {
        "short_name": "HQ GLOBAL EDUCATION INC",
        "long_name": "HQ Global Education Inc.",
        "summary": "HQ Global Education, Inc., a scientific research development company, focuses on the industrial hemp and CBD manufacturing industry in the United States. It provides data gathering, intelligence, and education for the industrial CBD industry. The company also processes and distributes CBD oils, as well as offers real estate management services. HQ Global Education, Inc. is based in Orange, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Orange",
        "zipcode": "92868",
        "website": "http://www.hqgeinc.com",
        "market_cap": "Small Cap"
    },
    "HWAL": {
        "short_name": "HOLLYWALL ENTERTAINMENT INC",
        "long_name": "Hollywall Entertainment, Inc.",
        "summary": "Hollywall Entertainment, Inc. offers digital music network and entertainment services. It also provides construction and development services, which include building houses, industrial parks, and commercial and retail buildings; and telecom services, such as maintenance of cable, network, and communications infrastructure. In addition, the company offers education services in career, technical, and high school education programs; and infrastructure services, including water and wastewater management, road and bridge inspections, and construction management services. Hollywall Entertainment, Inc. was incorporated in 2009 and is based in Washington, District of Columbia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "DC",
        "city": "Washington",
        "zipcode": "20006",
        "website": "http://www.hollywall.com",
        "market_cap": "Small Cap"
    },
    "HYWI": {
        "short_name": "HOLLYWOOD INTERMEDIATE INC",
        "long_name": "Hollywood Intermediate, Inc.",
        "summary": "Hollywood Intermediate, Inc. engages in the development, sale, and marketing of digital intermediate motion picture services. Its services include film resolution scanning, digital conforming, color manipulation, titling and effects, digital file recording to 35mm film negative, and high definition conversions and down conversions. The company was founded in 2002 and is headquartered in Burbank, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91506",
        "website": null,
        "market_cap": "Small Cap"
    },
    "IFLM": {
        "short_name": "INDEPENDENT FILM DEV CORP",
        "long_name": "Independent Film Development Corporation",
        "summary": "Independent Film Development Corporation operates in the hospitality division. The company operates a restaurant under Chef Eddie G's Kitchen name in East Harlem neighborhood in New York. It also owns distribution rights for various eclectic feature films; and episodic television programs, as well as for celebrity biography series worldwide. In addition, the company intends to acquire and manage real estate assets. Independent Film Development Corporation was founded in 2007 and is based in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92614",
        "website": "http://www.indyfilmcorp.com",
        "market_cap": "Small Cap"
    },
    "IMTV": {
        "short_name": "IMAGINATION TV INC",
        "long_name": "Imagination TV, Inc.",
        "summary": "Imagination TV, Inc. owns and operates a network of city-based Websites for business and vacation travelers, and local individuals. Its Websites provide information about hotels, restaurant dining, golf courses, discount event tickets, discount car rentals, discount airfare, and attraction tickets. The company was formerly known as IC Places, Inc. and changed its name to Imagination TV, Inc. in October 2014. Imagination TV, Inc. was founded in 2005 and is based in Casper, Wyoming.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WY",
        "city": "Casper",
        "zipcode": "82609",
        "website": "http://imaginationtv.co",
        "market_cap": "Small Cap"
    },
    "IPIC": {
        "short_name": "IPIC ENTERTAINMENT INC",
        "long_name": "iPic Entertainment Inc.",
        "summary": "iPic Entertainment Inc. operates restaurants and theaters in the United States. The company operates casual restaurants, farm-to-glass full-service bars, and theater auditoriums with in-theater dining. It operates restaurants under the City Perch Kitchen + Bar, Tanzy, The Tuck Room, The Tuck Room Tavern, and iPic Express brands. As of March 31, 2019, it operated 123 screens at 16 locations in Arizona, California, Florida, Illinois, Maryland, New Jersey, New York, Texas, and Washington. The company was founded in 2010 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33432",
        "website": "http://www.ipictheaters.com",
        "market_cap": "Small Cap"
    },
    "IQ51.F": {
        "short_name": "CINEDIGM CORP.  DL-,01",
        "long_name": "Cinedigm Corp.",
        "summary": "Cinedigm Corp., together with its subsidiaries, operates as distributor and aggregator of independent movie, television, and other short form content in the United States, Canada, and New Zealand. The company operates through two segments, Cinema Equipment Business and Content and Entertainment Business. It manages a library of distribution rights to various titles and episodes released across digital, physical, and home and mobile entertainment platforms, as well as services digital cinema assets on approximately 12,000 domestic and foreign movie screens. The company distributes its products for various brands, such as Hallmark, Televisa, ITV, Nelvana, ZDF, Shout! Factory, NFL, NHL and Scholastic, as well as international and domestic content creators, movie producers, television producers, and other short form digital content producers. It also collaborates with producers, various brands, and other content owners to market, source, curate, and distribute content to targeted audiences through existing and emerging digital home entertainment platforms, including Apple, Amazon Prime, Netflix, Hulu, Xbox, PlayStation, Sony, and cable/satellite video-on-demand; and distributes DVD and Blu-ray discs to wholesalers and retailers with sales coverage to approximately 60,000 brick and mortar storefronts, including Walmart, Target, Best Buy, and Amazon. In addition, the company operates various branded and curated over-the-top (OTT) entertainment channels, including Docurama, CONtv, and Dove Channel; and Matchpoint, a software-as-a-service platform to automate the distribution of streaming content and OTT channels. Cinedigm Corp. has a strategic alliance with Starrise Media Holdings Limited to release films in China theatrically and to digital platforms. The company was formerly known as Cinedigm Digital Cinema Corp. and changed its name to Cinedigm Corp. in September 2013. Cinedigm Corp. was founded in 2000 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.cinedigm.com",
        "market_cap": "Small Cap"
    },
    "KLOC": {
        "short_name": "KUSHNER-LOCKE",
        "long_name": "The Kushner-Locke Company",
        "summary": "The Kushner-Locke Company develops, produces, finances, and distributes feature films and television programming. Its library includes approximately 250 titles with 1,000 hours of film and television programming. The company distributes its films and television programming in various media worldwide. The Kushner-Locke Company was founded in 1983 and is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90212",
        "website": "http://www.kushnerlocke.com",
        "market_cap": "Small Cap"
    },
    "L1YV34.SA": {
        "short_name": "LIVE NATION DRN",
        "long_name": "Live Nation Entertainment, Inc.",
        "summary": "Live Nation Entertainment, Inc. operates as a live entertainment company. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues; operates and manages music venues; produces music festivals; creates associated content; and offers management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients for tickets and event information through its primary websites livenation.com and ticketmaster.com as well as provides ticket resale services. This segment sells tickets for its events, as well as for third-party clients in various live event categories, such as arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters through websites, mobile apps, ticket outlets, and telephone call centers. The Sponsorship & Advertising segment sells international, national, and local sponsorships and placement of advertising, including signage, promotional programs, rich media offering that include advertising related with live streaming and music-related content; and ads across its distribution network of venues, events, and websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. As of December 31, 2020, it owned, operated, or leased 155 entertainment venues in North America and 76 entertainment venues internationally. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is headquartered in Beverly Hills, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.livenationentertainment.com",
        "market_cap": "Large Cap"
    },
    "LBRD34.SA": {
        "short_name": "LIBERTY BROADRN",
        "long_name": "Liberty Broadband Corporation",
        "summary": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertybroadband.com",
        "market_cap": "Large Cap"
    },
    "LBRDA": {
        "short_name": "Liberty Broadband Corporation",
        "long_name": "Liberty Broadband Corporation",
        "summary": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertybroadband.com",
        "market_cap": "Large Cap"
    },
    "LBRDB": {
        "short_name": "LIBERTY BROADBAND CORP",
        "long_name": "Liberty Broadband Corporation",
        "summary": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertybroadband.com",
        "market_cap": "Large Cap"
    },
    "LBRDK": {
        "short_name": "Liberty Broadband Corporation",
        "long_name": "Liberty Broadband Corporation",
        "summary": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertybroadband.com",
        "market_cap": "Large Cap"
    },
    "LBRDP": {
        "short_name": "Liberty Broadband Corporation -",
        "long_name": "Liberty Broadband Corporation",
        "summary": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertybroadband.com",
        "market_cap": null
    },
    "LGF-A": {
        "short_name": "Lions Gate Entertainment Corpor",
        "long_name": "Lions Gate Entertainment Corp.",
        "summary": "Lions Gate Entertainment Corp. engages in motion picture production and distribution, television programming and syndication, home entertainment, interactive ventures and games, and location-based entertainment operations in Canada, the United States, and internationally. It operates through three segments: Motion Picture, Television Production, and Media Networks. The Motion Picture segment engages in the development and production of feature films; acquisition of North American and worldwide distribution rights; North American theatrical, home entertainment, and television distribution of feature films produced and acquired; and worldwide licensing of distribution rights to feature films produced and acquired. The Television Production segment is involved in the development, production, and worldwide distribution of television productions, including television series, television movies and mini-series, and non-fiction programming. It also licenses Starz original series productions to Starz Networks and STARZPLAY International; distributes Starz original productions and licensed product; and sells and licenses music from television broadcasts of its productions. In addition, this segment sells and rents television production movies or series on packaged media, as well as through digital media platforms; produces, syndicates, and distributes approximately 70 television shows on approximately 25 networks; and offers services related to talent management. The Media Networks segment is involved in the domestic distribution of STARZ branded premium subscription video services to video programming distributors; OTT distribution of its STARZ branded premium subscription video services internationally; and streaming services on subscription video-on-demand platforms. The company was founded in 1986 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.lionsgate.com",
        "market_cap": "Mid Cap"
    },
    "LGF-B": {
        "short_name": "Lions Gate Entertainment Corpor",
        "long_name": "Lions Gate Entertainment Corp.",
        "summary": "Lions Gate Entertainment Corp. engages in motion picture production and distribution, television programming and syndication, home entertainment, interactive ventures and games, and location-based entertainment operations in Canada, the United States, and internationally. It operates through three segments: Motion Picture, Television Production, and Media Networks. The Motion Picture segment engages in the development and production of feature films; acquisition of North American and worldwide distribution rights; North American theatrical, home entertainment, and television distribution of feature films produced and acquired; and worldwide licensing of distribution rights to feature films produced and acquired. The Television Production segment is involved in the development, production, and worldwide distribution of television productions, including television series, television movies and mini-series, and non-fiction programming. It also licenses Starz original series productions to Starz Networks and STARZPLAY International; distributes Starz original productions and licensed product; and sells and licenses music from television broadcasts of its productions. In addition, this segment sells and rents television production movies or series on packaged media, as well as through digital media platforms; produces, syndicates, and distributes approximately 70 television shows on approximately 25 networks; and offers services related to talent management. The Media Networks segment is involved in the domestic distribution of STARZ branded premium subscription video services to video programming distributors; OTT distribution of its STARZ branded premium subscription video services internationally; and streaming services on subscription video-on-demand platforms. The company was founded in 1986 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.lionsgate.com",
        "market_cap": "Mid Cap"
    },
    "LGMH": {
        "short_name": "LIGHT MEDIA HOLDINGS INC",
        "long_name": "Light Media Holdings, Inc.",
        "summary": "Light Media Holdings, Inc. provides inspirational media content products, technology, and services through audio, video, print, and Internet platorms worldwide. It owns 88 Web-domains and distributes audio and video content, as well as sells Internet advertising through its network of Websites. The company also owns and operates a FM radio station (Power 105.5/The King) in Albany, Georgia. The company was formerly known as Christian Media Holdings, Inc and changed its name to Light Media Holdings, Inc. Light Media Holdings, Inc. was founded in 1997 and is based in Albany, Georgia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Albany",
        "zipcode": "31701",
        "website": "http://invaluablemedia.com",
        "market_cap": "Small Cap"
    },
    "LGNA.F": {
        "short_name": "LIONS GATE ENTERT. CL. A",
        "long_name": "Lions Gate Entertainment Corp.",
        "summary": "Lions Gate Entertainment Corp. engages in motion picture production and distribution, television programming and syndication, home entertainment, interactive ventures and games, and location-based entertainment operations in Canada, the United States, and internationally. It operates through three segments: Motion Picture, Television Production, and Media Networks. The Motion Picture segment engages in the development and production of feature films; acquisition of North American and worldwide distribution rights; North American theatrical, home entertainment, and television distribution of feature films produced and acquired; and worldwide licensing of distribution rights to feature films produced and acquired. The Television Production segment is involved in the development, production, and worldwide distribution of television productions, including television series, television movies and mini-series, and non-fiction programming. It also licenses Starz original series productions to Starz Networks and STARZPLAY International; distributes Starz original productions and licensed product; and sells and licenses music from television broadcasts of its productions. In addition, this segment sells and rents television production movies or series on packaged media, as well as through digital media platforms; produces, syndicates, and distributes approximately 70 television shows on approximately 25 networks; and offers services related to talent management. The Media Networks segment is involved in the domestic distribution of STARZ branded premium subscription video services to video programming distributors; OTT distribution of its STARZ branded premium subscription video services internationally; and streaming services on subscription video-on-demand platforms. The company was founded in 1986 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.lionsgate.com",
        "market_cap": "Mid Cap"
    },
    "LGNB.F": {
        "short_name": "LIONS GATE ENTERT. CL. B",
        "long_name": "Lions Gate Entertainment Corp.",
        "summary": "Lions Gate Entertainment Corp. engages in motion picture production and distribution, television programming and syndication, home entertainment, interactive ventures and games, and location-based entertainment operations in Canada, the United States, and internationally. It operates through three segments: Motion Picture, Television Production, and Media Networks. The Motion Picture segment engages in the development and production of feature films; acquisition of North American and worldwide distribution rights; North American theatrical, home entertainment, and television distribution of feature films produced and acquired; and worldwide licensing of distribution rights to feature films produced and acquired. The Television Production segment is involved in the development, production, and worldwide distribution of television productions, including television series, television movies and mini-series, and non-fiction programming. It also licenses Starz original series productions to Starz Networks and STARZPLAY International; distributes Starz original productions and licensed product; and sells and licenses music from television broadcasts of its productions. In addition, this segment sells and rents television production movies or series on packaged media, as well as through digital media platforms; produces, syndicates, and distributes approximately 70 television shows on approximately 25 networks; and offers services related to talent management. The Media Networks segment is involved in the domestic distribution of STARZ branded premium subscription video services to video programming distributors; OTT distribution of its STARZ branded premium subscription video services internationally; and streaming services on subscription video-on-demand platforms. The company was founded in 1986 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.lionsgate.com",
        "market_cap": "Mid Cap"
    },
    "LIVX": {
        "short_name": "LiveXLive Media, Inc. Common St",
        "long_name": "LiveXLive Media, Inc.",
        "summary": "LiveXLive Media, Inc., a digital media company, engages in the acquisition, distribution, and monetization of live music, Internet radio, podcasting, and music-related streaming and video content. It operates LiveXLive, a live music streaming platform; and Slacker Radio, a streaming music service, as well as produces original music-related content. The company also produces, edits, curates, and streams live music events through broadband transmission over the Internet and satellite networks to its users; provides digital Internet radio and music services to users online and through original equipment manufacturers on a white label basis; and offers ancillary products and services, such as regulatory and post-implementation support services. In addition, it offers an application that provides access to live events, audio streams, original episodic content, podcasts, video on demand, real-time livestreams, and social sharing of content. The company was formerly known as Loton, Corp. and changed its name to LiveXLive Media, Inc. in August 2017. LiveXLive Media, Inc. was founded in 2009 and is headquartered in West Hollywood, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "West Hollywood",
        "zipcode": "90069",
        "website": "http://www.livexlive.com",
        "market_cap": "Small Cap"
    },
    "LSXM34.SA": {
        "short_name": "LIBERTY MEDIDRN",
        "long_name": "Liberty Media Corporation",
        "summary": "Liberty Media Corporation, through its subsidiaries, operates in the media, communications, and entertainment businesses in North America, the United Kingdom, and internationally. The company operates through SIRIUS XM and Formula 1 segments. It provides music, sports, entertainment, comedy, talk, news, traffic, weather channels, and other content, as well as podcasts and infotainment services on a subscription fee basis through its satellite radio systems; provides connected vehicle and a suite of in-vehicle data services to enhance the safety, security, and driving experience for vehicle operators; distributes satellite radios and accessories primarily through automakers, retailers, and Website; and sells advertise on non-music channels, as well as streams music and non-music channels over the internet. The company also offers other services, such as commercial subscription accounts directly, as well as through providers of in-store entertainment solutions; satellite television services; Travel Link, a suite of data services that comprise graphical weather, fuel prices, sports schedules and scores, and movie listings; and real time traffic and weather services. In addition, it licenses its technology to various electronics manufacturers to develop, manufacture, and distribute radios under various brands. Further, the company owns and operates the Atlanta Braves Major League Baseball club; six minor league baseball clubs, including the Gwinnett Stripers, the Mississippi Braves, the Rome Braves, the Danville Braves, the GCL Braves, and the Dominican Summer League; and a baseball academy in the Dominican Republic. Additionally, it holds the commercial rights for exploitation and development of the World Championship. The company was founded in 1991 and is headquartered in Englewood, Colorado.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertymedia.com",
        "market_cap": "Mid Cap"
    },
    "LSXM35.SA": {
        "short_name": "LIBERTY MEDIDRN",
        "long_name": "Formula One Group",
        "summary": "Formula One Group engages in the motorsports business. It holds commercial rights for the world championship, approximately a nine-month long motor race-based competition in which teams compete for the constructors' championship and drivers compete for the drivers' championship. The company was founded in 1950 and is based in Englewood, Colorado. Formula One Group is a subsidiary of Liberty Media Corporation.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertymedia.com/companies/formula-one-group.html",
        "market_cap": null
    },
    "LYV.MX": {
        "short_name": "LIVE NATION ENTERTAINMENT INC",
        "long_name": "Live Nation Entertainment, Inc.",
        "summary": "Live Nation Entertainment, Inc. operates as a live entertainment company. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues; operates and manages music venues; produces music festivals; creates associated content; and offers management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients for tickets and event information through its primary websites livenation.com and ticketmaster.com as well as provides ticket resale services. This segment sells tickets for its events, as well as for third-party clients in various live event categories, such as arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters through websites, mobile apps, ticket outlets, and telephone call centers. The Sponsorship & Advertising segment sells international, national, and local sponsorships and placement of advertising, including signage, promotional programs, rich media offering that include advertising related with live streaming and music-related content; and ads across its distribution network of venues, events, and websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. As of December 31, 2020, it owned, operated, or leased 155 entertainment venues in North America and 76 entertainment venues internationally. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is headquartered in Beverly Hills, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.livenationentertainment.com",
        "market_cap": "Large Cap"
    },
    "LYV": {
        "short_name": "Live Nation Entertainment, Inc.",
        "long_name": "Live Nation Entertainment, Inc.",
        "summary": "Live Nation Entertainment, Inc. operates as a live entertainment company. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues; operates and manages music venues; produces music festivals; creates associated content; and offers management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients for tickets and event information through its primary websites livenation.com and ticketmaster.com as well as provides ticket resale services. This segment sells tickets for its events, as well as for third-party clients in various live event categories, such as arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters through websites, mobile apps, ticket outlets, and telephone call centers. The Sponsorship & Advertising segment sells international, national, and local sponsorships and placement of advertising, including signage, promotional programs, rich media offering that include advertising related with live streaming and music-related content; and ads across its distribution network of venues, events, and websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. As of December 31, 2020, it owned, operated, or leased 155 entertainment venues in North America and 76 entertainment venues internationally. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is headquartered in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.livenationentertainment.com",
        "market_cap": "Large Cap"
    },
    "MCS": {
        "short_name": "Marcus Corporation (The)",
        "long_name": "The Marcus Corporation",
        "summary": "The Marcus Corporation, together with its subsidiaries, owns and operates movie theatres, and hotels and resorts in the United States. As of March 4, 2021, it owned or operated 1,097 screens at 89 movie theatre locations in 17 states under the Marcus Theatres, Movie Tavern by Marcus, and BistroPlex brands; and owned and managed 18 hotels, resorts, and other properties in 8 states. The company also operates a family entertainment center under the Funset Boulevard name in Appleton, Wisconsin, as well as owns and operates a retail outlet under the name of Ronnie's Plaza in St. Louis, Missouri. In addition, it provides hospitality management services, including check-in, housekeeping, and maintenance for a vacation ownership development. The company was founded in 1935 and is headquartered in Milwaukee, Wisconsin.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Milwaukee",
        "zipcode": "53202-4125",
        "website": "http://www.marcuscorp.com",
        "market_cap": "Small Cap"
    },
    "MGMA": {
        "short_name": "METRO GLOBAL MEDIA INC",
        "long_name": "Metro Global Media, Inc.",
        "summary": "Metro Global Media, Inc. operates through its wholly owned subsidiaries and operating divisions: Metro West Studios, Inc.; Metro, Inc. - West Coast Division; Metro International Distributors; Amazing Media Group, Inc.; Amazing Direct, Inc.; Metro, Inc. Â\u0096 East Coast Division; and Airborne for Men, LTD. Through Metro Studios, Metro Global produces and distributes erotic motion picture entertainment. Metro West, the company's West Coast division, duplicates, manufactures, warehouses, and distributes exclusively all of Metro Studio's productions on Vertical Helical Scan and Digital Versatile Disc formats. Metro International operates an international sales office in Flensburg, Germany to handle the sales of video rights in Europe, South America, and Australia. Amazing Media publishes and distributes a variety of adult magazines under various trade names. AmazingDirect.com is the company's e-commerce and mail order business. Airborne engages in the sale of franchise and licensing rights to operate upscale adult orientated retail stores. The company is based in Cranston, Rhode Island.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "RI",
        "city": "Cranston",
        "zipcode": "02910",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MIKP": {
        "short_name": "MIKE THE PIKE PRODUCTIONS INC",
        "long_name": "Mike the Pike Productions, Inc.",
        "summary": "Mike the Pike Productions, Inc., a media holdings company, engages in the development, production, and distribution of motion picture/entertainment content worldwide. It develops, produces, and licenses genre films; and publishes graphic novels, as well as focuses on identifying and securing literary assets. The company was formerly known as Pine Ridge Holdings Inc. and changed its name to Mike The Pike Productions, Inc. in August 2009. Mike The Pike Productions, Inc. was founded in 2001 and is headquartered in Fort Wayne, Indiana.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "IN",
        "city": "Fort Wayne",
        "zipcode": "46815",
        "website": "http://mikethepike.com",
        "market_cap": "Small Cap"
    },
    "MLWN": {
        "short_name": "MALWIN VENTURES INC",
        "long_name": "Malwin Ventures, Inc.",
        "summary": "Malwin Ventures, Inc. operates in the entertainment, publishing, and interactive industries. It also funds, develops, produces, publishes, and distributes digital content. The company was formerly known as Logo Industries Corp and changed its name to Malwin Ventures, Inc. in November 2008. Malwin Ventures, Inc. was incorporated in 2002 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89169",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MOCI": {
        "short_name": "MODERN CINEMA GROUP INC",
        "long_name": "Modern Cinema Group, Inc.",
        "summary": "Modern Cinema Group, Inc., a motion picture studio, provides co-operative financing, marketing, and distribution services. Its business model focuses on assisting multichannel video program distributors (MVPDs) with production of their own original content; and helping MVPDs to enhance revenues from profit participation. The company was formerly known as Hemis Corporation and changed its name to Modern Cinema Group, Inc. in September 2015. Modern Cinema Group, Inc. was founded in 2005 and is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.moderncinemagroup.com",
        "market_cap": "Small Cap"
    },
    "MS8.F": {
        "short_name": "MADISON SQUARE GAR.SP. A",
        "long_name": "Madison Square Garden Sports Corp.",
        "summary": "Madison Square Garden Sports Corp. operates as a professional sports company. Its portfolio of assets include the New York Knickerbockers of the National Basketball Association (NBA), and the New York Rangers of the National Hockey League; two development league teams, including the Hartford Wolf Pack of the American Hockey League, and the Westchester Knicks of the NBA G League; Knicks Gaming, an esports franchise; and esports teams. The company also owns two professional sports team performance centers, including the Madison Square Garden Training Center in Greenburgh, New York, and the CLG Performance Center in Los Angeles, California. Madison Square Garden Sports Corp. was formerly known as The Madison Square Garden Company. The company was founded in 1879 and is based in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10121-0091",
        "website": "http://www.msgsports.com",
        "market_cap": "Mid Cap"
    },
    "MSGE": {
        "short_name": "Madison Square Garden Entertain",
        "long_name": "Madison Square Garden Entertainment Corp.",
        "summary": "Madison Square Garden Entertainment Corp. engages in the entertainment business. It produces, presents, or hosts various live entertainment events, including concerts, family shows, and special events, as well as sporting events, such as professional boxing, college basketball, professional bull riding, mixed martial arts, and esports in its venues, including New York's Madison Square Garden, Hulu Theater at Madison Square Garden, Radio City Music Hall and Beacon Theatre, and The Chicago Theatre. The company also operates entertainment dining and nightlife venues in New York City, Las Vegas, Los Angeles, Chicago, Singapore, and Australia under the Tao, Marquee, Lavo, Avenue, Beauty & Essex, and CathÃ©drale brand names; and creates and operates New England's premier music festival. In addition, it features the Radio City Rockettes, which serves as the star for its Christmas Spectacular at Radio City Music Hall. The company is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10121",
        "website": "http://www.msgentertainment.com",
        "market_cap": "Mid Cap"
    },
    "MSGN": {
        "short_name": "MSG Networks Inc.",
        "long_name": "MSG Networks Inc.",
        "summary": "MSG Networks Inc. engages in the sports production, and content development and distribution businesses in the United States. The company owns and operates MSG Network and MSG+, which are regional sports and entertainment networks. It also operates MSG GO that provides video on demand, as well as a website and social media platforms for its brands. The company was formerly known as The Madison Square Garden Company and changed its name to MSG Networks Inc. in October 2015. MSG Networks Inc. was founded in 1969 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.msgnetworks.com",
        "market_cap": "Small Cap"
    },
    "MSGS": {
        "short_name": "Madison Square Garden Sports Co",
        "long_name": "Madison Square Garden Sports Corp.",
        "summary": "Madison Square Garden Sports Corp. operates as a professional sports company. Its portfolio of assets include the New York Knickerbockers of the National Basketball Association (NBA), and the New York Rangers of the National Hockey League; two development league teams, including the Hartford Wolf Pack of the American Hockey League, and the Westchester Knicks of the NBA G League; Knicks Gaming, an esports franchise; and esports teams. The company also owns two professional sports team performance centers, including the Madison Square Garden Training Center in Greenburgh, New York, and the CLG Performance Center in Los Angeles, California. Madison Square Garden Sports Corp. was formerly known as The Madison Square Garden Company. The company was founded in 1879 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10121-0091",
        "website": "http://www.msgsports.com",
        "market_cap": "Mid Cap"
    },
    "MVES": {
        "short_name": "MOVIE STUDIO INC",
        "long_name": "The Movie Studio, Inc.",
        "summary": "The Movie Studio, Inc. operates as a vertically integrated motion picture production and distribution company. It focuses on acquiring, developing, producing, and distributing independent motion picture content for consumption via subscription and advertiser video on demand (SVOD/AVOD), over the top (OTT) platforms, foreign sales, and various media devices. The company is establishing its own OTT VOD platform to integrate its own and aggregated feature film projects, television programming, and other media intellectual properties. It is disrupting traditional media content delivery systems with its digital business model of motion picture distribution, and intends to create a direct server access platform of its content with geo-fractured territories for worldwide distribution. The company was formerly known as Destination Television, Inc. and changed its name to The Movie Studio, Inc. in November 2012. The Movie Studio, Inc. was incorporated in 1961 and is headquartered in Fort Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Fort Lauderdale",
        "zipcode": "33304",
        "website": "http://www.themoviestudio.com",
        "market_cap": "Small Cap"
    },
    "NFC.DE": {
        "short_name": "NETFLIX INC.  DL-,001",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFC.F": {
        "short_name": "NETFLIX INC.  DL-,001",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFLX.BA": {
        "short_name": "NETFLIX INC",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFLX.MI": {
        "short_name": "NETFLIX",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MIL",
        "market": "it_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFLX.MX": {
        "short_name": "NETFLIX INC",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFLX": {
        "short_name": "Netflix, Inc.",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFLX.VI": {
        "short_name": "NETFLIX INC",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NFLX34.SA": {
        "short_name": "NETFLIX     DRN",
        "long_name": "Netflix, Inc.",
        "summary": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Gatos",
        "zipcode": "95032",
        "website": "http://www.netflix.com",
        "market_cap": "Large Cap"
    },
    "NLMP": {
        "short_name": "NATIONAL LAMPOON INC",
        "long_name": "National Lampoon Inc.",
        "summary": "National Lampoon Inc. engages in the comedy publication business. It publishes National Lampoon, a humor magazine; and Animal House, a comedy film, as well as franchises films, such as Vacation and Van Wilder. The company was formerly known as J2 Communications Inc. and changed its name to National Lampoon Inc. in November 2002. The company was founded in 1967 and is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90028",
        "website": "http://www.nationallampoon.com",
        "market_cap": "Small Cap"
    },
    "PLFX": {
        "short_name": "PULSE EVOLUTION CORP",
        "long_name": "Pulse Evolution Corporation",
        "summary": "Pulse Evolution Corporation develops computer-generated human likeness applications for utilization in education, health care, telecommunications, defense, transportation, and entertainment industries. It develops virtual humans for live shows, virtual reality, augmented reality, holographic, 3D stereoscopic, Web, mobile, interactive, and artificial intelligence applications. The company is headquartered in Port St. Lucie, Florida. As of August 6, 2018, Pulse Evolution Corporation operates as a subsidiary of Evolution|AI Corporation.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Port St. Lucie",
        "zipcode": "34987",
        "website": "http://www.pulse.co",
        "market_cap": "Small Cap"
    },
    "R1KU34.SA": {
        "short_name": "ROKU INC    DRN",
        "long_name": "Roku, Inc.",
        "summary": "Roku, Inc., together with its subsidiaries, operates a TV streaming platform. The company operates in two segments, Platform and Player. The company operates in two segment, Platform and Player. Its platform allows users to discover and access various movies and TV episodes, as well as live sports, music, news, and others. As of December 31, 2020, the company had 51.2 million active accounts. It also provides digital and video advertising, content distribution, subscription, and billing services, as well as other commerce transactions, brand sponsorship and promotions, and audience development campaigns; and manufactures, sells, and licenses smart TVs under the Roku TV name. In addition, the company offers streaming players, and audio products and accessories under the Roku brand name; and sells branded channel buttons on remote controls. It provides its products and services through retailers and distributors, as well as directly to customers through its website in the United States, Canada, the United Kingdom, France, the Republic of Ireland, Mexico, Brazil, and other Latin American countries. Roku, Inc. was founded in 2002 and is headquartered in San Jose, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95510",
        "website": "http://www.roku.com",
        "market_cap": "Large Cap"
    },
    "R35.F": {
        "short_name": "ROKU INC  CL. A DL-,0001",
        "long_name": "Roku, Inc.",
        "summary": "Roku, Inc., together with its subsidiaries, operates a TV streaming platform. The company operates in two segments, Platform and Player. The company operates in two segment, Platform and Player. Its platform allows users to discover and access various movies and TV episodes, as well as live sports, music, news, and others. As of December 31, 2020, the company had 51.2 million active accounts. It also provides digital and video advertising, content distribution, subscription, and billing services, as well as other commerce transactions, brand sponsorship and promotions, and audience development campaigns; and manufactures, sells, and licenses smart TVs under the Roku TV name. In addition, the company offers streaming players, and audio products and accessories under the Roku brand name; and sells branded channel buttons on remote controls. It provides its products and services through retailers and distributors, as well as directly to customers through its website in the United States, Canada, the United Kingdom, France, the Republic of Ireland, Mexico, Brazil, and other Latin American countries. Roku, Inc. was founded in 2002 and is headquartered in San Jose, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95510",
        "website": "http://www.roku.com",
        "market_cap": "Large Cap"
    },
    "RDI": {
        "short_name": "Reading International Inc",
        "long_name": "Reading International, Inc.",
        "summary": "Reading International, Inc., together with its subsidiaries, focuses on the ownership, development, and operation of entertainment and real property assets in the United States, Australia, and New Zealand. The company operates in two segments, Cinema Exhibition and Real Estate. The Cinema Exhibition segment operates multiplex cinemas. This segment operates its cinema exhibition businesses under the Reading Cinemas, Angelika Film Centers, Consolidated Theatres, State Cinema, City Cinemas, Event Cinemas, and Rialto brands. The Real Estate segment develops, rents, or licenses retail, commercial, and live theater assets. As of December 31, 2020, the company had interests in 61 cinemas comprising approximately 504 screens; fee interests in two live theaters; fee interest in 44 Union Square property; fee interest in one cinema in Manhattan; fee interests in two cinemas in Australia and four cinemas in New Zealand; fee interest in entertainment-themed centers; fee interest in 2 office buildings; and fee ownership of approximately 20.8 million square feet of developed and undeveloped real estate assets. Reading International, Inc. was founded in 1937 and is headquartered in Culver City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Culver City",
        "zipcode": "90230",
        "website": "http://www.readingrdi.com",
        "market_cap": "Small Cap"
    },
    "RDIB": {
        "short_name": "Reading International Inc",
        "long_name": "Reading International, Inc.",
        "summary": "Reading International, Inc., together with its subsidiaries, focuses on the ownership, development, and operation of entertainment and real property assets in the United States, Australia, and New Zealand. The company operates in two segments, Cinema Exhibition and Real Estate. The Cinema Exhibition segment operates multiplex cinemas. This segment operates its cinema exhibition businesses under the Reading Cinemas, Angelika Film Centers, Consolidated Theatres, State Cinema, City Cinemas, Event Cinemas, and Rialto brands. The Real Estate segment develops, rents, or licenses retail, commercial, and live theater assets. As of December 31, 2020, the company had interests in 61 cinemas comprising approximately 504 screens; fee interests in two live theaters; fee interest in 44 Union Square property; fee interest in one cinema in Manhattan; fee interests in two cinemas in Australia and four cinemas in New Zealand; fee interest in entertainment-themed centers; fee interest in 2 office buildings; and fee ownership of approximately 20.8 million square feet of developed and undeveloped real estate assets. Reading International, Inc. was founded in 1937 and is headquartered in Culver City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Culver City",
        "zipcode": "90230",
        "website": "http://www.readingrdi.com",
        "market_cap": "Small Cap"
    },
    "RGMP": {
        "short_name": "REGNUM CORP",
        "long_name": "Regnum Corp.",
        "summary": "Regnum Corp. focuses on the premium entertainment content business. It acquires unpublished and unproduced intellectual properties at a discount from independent writers, filmmakers, studios, agencies, and production companies for reselling to the entertainment community. The company was founded in 2016 and is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94109",
        "website": null,
        "market_cap": "Small Cap"
    },
    "RIVU": {
        "short_name": "RIVULET MEDIA INC",
        "long_name": "Rivulet Media, Inc.",
        "summary": "Rivulet Media, Inc. produces, distributes, and markets feature-length films, television and mini-series, and television movies. The company also engages in the music production and distribution activities. Rivulet Media, Inc. was founded in 2020 and is based in Gilbert, Arizona.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Gilbert",
        "zipcode": "85296",
        "website": "http://rivuletmedia.com",
        "market_cap": "Small Cap"
    },
    "RLTR": {
        "short_name": "REELTIME RENTALS INC",
        "long_name": "Reeltime Rentals, Inc.",
        "summary": "Reeltime Rentals, Inc., doing business as ReelTime VR, operates as a multimedia company, develops, produces, and distributes virtual reality contents and technologies in the United States. It offers discounted media and ad placement service, which includes Internet, television, prints, radio, and out of office advertisement. It also provides production and distribution of Virtual Reality content, technologies, and media. Further, it offers VR shows, consulting, production, monetization, VR design set, media campaign, and content production. In addition, it provides a virtual reality app, which is technologically advanced and creative content of any application to be released to the public. The company was incorporated in 2004 and is based in Kenmore, Washington.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Kenmore",
        "zipcode": "98028",
        "website": "http://www.reeltime.com",
        "market_cap": "Small Cap"
    },
    "ROKU.MX": {
        "short_name": "ROKU INC",
        "long_name": "Roku, Inc.",
        "summary": "Roku, Inc., together with its subsidiaries, operates a TV streaming platform. The company operates in two segments, Platform and Player. The company operates in two segment, Platform and Player. Its platform allows users to discover and access various movies and TV episodes, as well as live sports, music, news, and others. As of December 31, 2020, the company had 51.2 million active accounts. It also provides digital and video advertising, content distribution, subscription, and billing services, as well as other commerce transactions, brand sponsorship and promotions, and audience development campaigns; and manufactures, sells, and licenses smart TVs under the Roku TV name. In addition, the company offers streaming players, and audio products and accessories under the Roku brand name; and sells branded channel buttons on remote controls. It provides its products and services through retailers and distributors, as well as directly to customers through its website in the United States, Canada, the United Kingdom, France, the Republic of Ireland, Mexico, Brazil, and other Latin American countries. Roku, Inc. was founded in 2002 and is headquartered in San Jose, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95510",
        "website": "http://www.roku.com",
        "market_cap": "Large Cap"
    },
    "ROKU": {
        "short_name": "Roku, Inc.",
        "long_name": "Roku, Inc.",
        "summary": "Roku, Inc., together with its subsidiaries, operates a TV streaming platform. The company operates in two segments, Platform and Player. The company operates in two segment, Platform and Player. Its platform allows users to discover and access various movies and TV episodes, as well as live sports, music, news, and others. As of December 31, 2020, the company had 51.2 million active accounts. It also provides digital and video advertising, content distribution, subscription, and billing services, as well as other commerce transactions, brand sponsorship and promotions, and audience development campaigns; and manufactures, sells, and licenses smart TVs under the Roku TV name. In addition, the company offers streaming players, and audio products and accessories under the Roku brand name; and sells branded channel buttons on remote controls. It provides its products and services through retailers and distributors, as well as directly to customers through its website in the United States, Canada, the United Kingdom, France, the Republic of Ireland, Mexico, Brazil, and other Latin American countries. Roku, Inc. was founded in 2002 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95510",
        "website": "http://www.roku.com",
        "market_cap": "Large Cap"
    },
    "RTRK": {
        "short_name": "RED TRUCK ENTERTAINMENT INC",
        "long_name": "Red Truck Entertainment, Inc.",
        "summary": "Red Truck Entertainment, Inc. produces movies, music videos, and other videos. It also offers development, publication, and distribution of music and record labels. The company was incorporated in 2000 and is based in Scottsdale, Arizona.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Scottsdale",
        "zipcode": "85260",
        "website": null,
        "market_cap": null
    },
    "RWMI": {
        "short_name": "REGALWORKS MEDIA INC",
        "long_name": "RegalWorks Media, Inc.",
        "summary": "RegalWorks Media, Inc. operates as an independent multimedia studio in California. It focuses on acquiring, producing, distributing, and managing feature films. The company is based in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SAKL": {
        "short_name": "SACK LUNCH PRODUCTIONS INC",
        "long_name": "Sack Lunch Productions, Inc.",
        "summary": "Sack Lunch Productions, Inc., together with its subsidiaries, engages in the event and film production businesses worldwide. The company operates through three segments: Events, Salons, and Other. The Events segment produces branded events under the Color Me Rad, The Dirty Dash, Lantern Fest, Slide the City, and Trike Riot trademarked names; and franchises its branded events to third parties under agreements with various franchisees. The Salons segment operates health and beauty salons. This segment operates through a network of two Aveda lifestyle salons; and an Aveda retail store. The Other segment distributes films; provides assisting services in the development and production of film products; and acquires, leases, and sells commercial and residential properties. The company was formerly known as Nexia Holdings, Inc. and changed its name to Sack Lunch Productions, Inc. in April 2015. Sack Lunch Productions, Inc. was incorporated in 1987 and is headquartered in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84101",
        "website": "http://www.sacklunchproductions.com",
        "market_cap": "Small Cap"
    },
    "SAPX": {
        "short_name": "SEVEN ARTS ENTERTAINMENT INC",
        "long_name": "Seven Arts Entertainment, Inc.",
        "summary": "Seven Arts Entertainment, Inc. operates as an independent motion picture production and distribution company. It acquires, develops, finances, produces, and licenses theatrical motion pictures for exhibition in theatrical markets worldwide. The company also provides its motion pictures in other forms of media, including home video, and pays and frees television. It owns interests in approximately 39 completed motion pictures. In addition, the company licenses distribution rights in its motion pictures; produces and distributes recorded music; and operates a film production and post-production facility in New Orleans, Louisiana. The company was formerly known as Seven Arts Pictures, Plc and changed its name to Seven Arts Entertainment, Inc. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90069",
        "website": null,
        "market_cap": "Small Cap"
    },
    "SLCH": {
        "short_name": "SPOTLIGHT CAPITAL HOLDINGS INC",
        "long_name": "Spotlight Capital Holdings, Inc.",
        "summary": "Spotlight Capital Holdings, Inc., through its subsidiaries, provides maintenance, repair, and overhaul products and services for aircraft in the general aviation sector in Florida. It offers various services that include federal aviation administration (FAA) certified repair station, major and minor airframe repairs, annual inspections, computerized aircraft weight and balance, aircraft modifications and STC kit installations, routine maintenance/insurance and accident repairs, composite airframe repairs, and pre-purchase inspections/log book analysis. The company also provides oxygen service/nitrogen service, service parts, janitrol/southwind heater service/AD compliance inspections, dye/fluorescent penetrant inspection service, aircraft exterior and interior detailing services, ACES dynamic propeller balancing service, avionics installations and repairs, minor paint repairs and detailing, instrument panel upgrades and component installs, engine scanners and monitor installation, and EGT/CHT calibration, as well as engine maintenance, repair, and overhaul, including custom installations and refurbishment. In addition, it offers charter air services for both passengers and cargo from South Florida to the Bahamas with leased aircraft. The company was formerly known as AvStar Aviation Group, Inc. and changed its name to Spotlight Capital Holdings, Inc. in November 2014. The company is headquartered in Houston, Texas. Spotlight Capital Holdings, Inc. was founded in 1987 and is based in Houston, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77063",
        "website": "http://www.spotlightcapitalholdings.com",
        "market_cap": "Small Cap"
    },
    "SNMN": {
        "short_name": "SNM GLOBAL HOLDINGS",
        "long_name": "SNM Global Holdings, Inc.",
        "summary": "SNM Global Holdings, Inc., together with its subsidiaries, provides international south Asian media, entertainment, and marketing services with operations in the areas of publication, broadcast television, radio, Internet, film, television production, events, advertising, and marketing. The company publishes a weekly English language newspaper, The Indian Express North American Edition, comprising three regional editions in the United States and an edition in Canada; and Divya Bhaskar North American Edition, a weekly Gujarati language newspaper for the sub-ethnic Gujarati community in the United States and Canada, as well as has a marketing tie-up with the Telugu language newspaper, Telugu Times in North America. It also broadcasts INDIA PLUS on DIRECTV that offers news and current affairs programming for Indians in the United States; and operates as partner in the FM radio station for the south Asian community in North America. In addition, the company produces international television programming in the United States and India for south Asian TV networks; develops films for Bollywood and international markets; and produces proprietary events, such as CineMaya Media Group Indian American Achiever Awards, as well as events for clients. SNM Global Holdings, Inc. was formerly known as CineMaya Media Group, Inc. and changed its name to CineMaya Media Group, Inc. in November 2008. The company was founded in 2000 and is based in Miami, Florida with additional offices in Edison, New Jersey; Santa Clara, California; Toronto, Canada; Mumbai and Delhi, India; and Chicago, Illinois.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33166",
        "website": "http://www.snmholdings.com",
        "market_cap": "Small Cap"
    },
    "SNWR": {
        "short_name": "SANWIRE CORP",
        "long_name": "Sanwire Corporation",
        "summary": "Sanwire Corporation, through its subsidiaries, provides technology integration, development, and solutions in the artificial intelligence, cryptography, Internet security, and Web software industries. The company is based in Cheyenne, Wyoming.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WY",
        "city": "Cheyenne",
        "zipcode": "82001",
        "website": "http://www.sanwirecorporation.com",
        "market_cap": "Small Cap"
    },
    "STGZ": {
        "short_name": "STARGAZE ENTERTAINMENT GROUP IN",
        "long_name": "Stargaze Entertainment Group Inc.",
        "summary": "Stargaze Entertainment Group Inc. operates as an entertainment production and distribution company. It focuses on the creation and distribution of films, music, and television shows. The company was formerly known as Umining Resources Inc. and changed its name to Stargaze Entertainment Group Inc. in March 2015 to reflect the change of corporate direction. Stargaze Entertainment Group Inc. was incorporated in 1999 and is headquartered in Plattsburgh, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Plattsburgh",
        "zipcode": "12901",
        "website": "http://www.stargazeentertainmentgroup.com",
        "market_cap": "Small Cap"
    },
    "SVSN": {
        "short_name": "STEREO VISION ENTMT INC",
        "long_name": "Stereo Vision Entertainment, Inc.",
        "summary": "Stereo Vision Entertainment, Inc., a development stage company, intends to operate as a diversified media entertainment company. It focuses on the production of new and existing feature films in 3-D and 2-D format for theatrical and direct to DVD release, as well as licensing of film rights to the video gaming industry. The company was founded in 1999 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89104",
        "website": "http://www.stereovision.com",
        "market_cap": "Small Cap"
    },
    "TCHC": {
        "short_name": "TECH CENT INC",
        "long_name": "Tech Central, Inc.",
        "summary": "Tech Central, Inc. engages in online video and photography content development and distribution businesses. The company is also involved in Website and mobile app technology integration design and development activities. Its content services include video shoots, photography, photo shoots, video and photography editing, voiceover, and Ad copywriting. In addition, the company offers CBD product line for sleep, anxiety, inflammation, and stress. The company was incorporated in 2014 and is based in Temecula, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Temecula",
        "zipcode": "92590",
        "website": "http://www.techcentralinc.com",
        "market_cap": "Small Cap"
    },
    "TIXC": {
        "short_name": "TIX CORPORATION",
        "long_name": "Tix Corporation",
        "summary": "Tix Corporation, through its subsidiary, operates as an entertainment company in the United States and internationally. The company provides discount ticketing and discount dinner reservations services. It offers discount tickets under short-term, exclusive, and nonexclusive agreements in Las Vegas at a discount of up to 50 percent for same day shows, concerts, attractions, and tours, as well as discount dining and shopping offers. As of March 19, 2020, the company operated nine discount ticket stores in Las Vegas under its Tix4Tonight marquee; and tix4tonight.com, an online ticket sales site. In addition, it provides online booking services for shows, concerts, tours, attractions, and other entertainment and leisure activities. The company was formerly known as Cinema Ride, Inc. and changed its name to Tix Corporation in March 2005. Tix Corporation was founded in 1993 and is headquartered in Studio City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Studio City",
        "zipcode": "91604",
        "website": "http://www.tixcorp.com",
        "market_cap": "Small Cap"
    },
    "UMGP": {
        "short_name": "UNIVERSAL MEDIA GROUP INC",
        "long_name": "Universal Media Group Inc.",
        "summary": "Universal Media Group Inc., a media company, produces and distributes media content worldwide. It produces On The Mike, a TV show that primarily include celebrity interviews, music concerts, and other events. The company was formerly known as Dalton Industries Inc. and changed its name to Universal Media Group Inc. in January 2016. Universal Media Group Inc. was founded in 1971 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33432",
        "website": "http://www.umediagroupinc.com",
        "market_cap": "Small Cap"
    },
    "URBT": {
        "short_name": "URBAN TELEVISION NETWORK CORP",
        "long_name": "Urban Television Network Corporation",
        "summary": "Urban Television Network Corporation operates a broadcast television network in the United States. It primarily focuses on serving the African-American and Hispanic populations, and other ethnic populations in the urban markets. The company branded its broadcast television network as UATV for marketing purposes. Urban Television Network would provide free over-the-air programming to television viewing audiences in the communities served by its local affiliate television stations. It also has access to various shows, including sports, movies, news, entertainment, and family programming. The company is based in Inglewood, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Inglewood",
        "zipcode": "90302",
        "website": "http://punchanimation.com",
        "market_cap": "Small Cap"
    },
    "VCX.F": {
        "short_name": "VIACOMCBS PRF.A (4/24)25",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "VGTL": {
        "short_name": "VGTEL INC",
        "long_name": "VGTel, Inc.",
        "summary": "VGTel, Inc. develops, finances, produces, and distributes movies and 4K ultra high definition (UHD) content. It also offers UHD scanning and post production services and support. The company is headquartered in Suffern, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Suffern",
        "zipcode": "10901",
        "website": "http://www.360entertainmentandproductions.com",
        "market_cap": "Small Cap"
    },
    "VIAC.MX": {
        "short_name": "VIACOMCBS INC",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "VIAC": {
        "short_name": "ViacomCBS Inc.",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "VIACA": {
        "short_name": "ViacomCBS Inc.",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": "Large Cap"
    },
    "VIACP": {
        "short_name": "ViacomCBS Inc. - 5.75% Series A",
        "long_name": "ViacomCBS Inc.",
        "summary": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates through TV Entertainment, Cable Networks, and Filmed Entertainment segments. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; acquires or develops, and schedules programming on the CBS Television Network that includes primetime comedies and dramas, reality, specials, kids' programs, daytime dramas, game shows, and late night programs; produces or distributes talk shows, court shows, game shows, and newsmagazines; owns and operates 29 broadcast television stations; and operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as streaming and cable subscription services. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, and basic cable networks. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was incorporated in 1986 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": "http://www.viacomcbs.com",
        "market_cap": null
    },
    "VIDA": {
        "short_name": "VIDAROO CORP",
        "long_name": "Vidaroo Corp",
        "summary": "Vidaroo Corporation, a video technology company, engages in licensing an online video platform and performing professional video production activities. It operates and licenses an online video platform under a software-as-a-service model that consists of a series of Web-based applications, a centralized user console, and an application for the management of the platform. The company's video platform is divided into two editions comprising Publisher, which is divided into a series of modules; and Enterprise edition that allows management of multiple content destinations. It licenses its video platform in on-demand and enterprise programs. The company's video platform provides video management, live streaming, content delivery and syndication, player functionality, social destination, analytics, and advertising capabilities. It is also involved in the creation and support of video imagery in the entertainment business; and support of video production for traditional media and corporate presentations, and in-house production of content. The company was formerly known as Gen2Media Corporation and changed its name to Vidaroo Corporation in April 2010. Vidaroo Corporation is based in Winter Garden, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Winter Garden",
        "zipcode": "34787",
        "website": "http://www.vidaroo.com",
        "market_cap": "Small Cap"
    },
    "VNUE": {
        "short_name": "VNUE INC",
        "long_name": "VNUE, Inc.",
        "summary": "VNUE, Inc. operates as a live entertainment music technology company. It offers a suite of products and services that monetize and monitor music for artists, labels, performing rights organizations, publishers, writers, radio stations, venues, restaurants, and bars, as well as other stakeholders in music. The company provides Set.fm/DiscLive Network, a digital live music distribution consumer app platform that allows users to record and sell live shows directly to fans' mobile devices, and instant physical collectible products are recorded and sold at shows and online through its DiscLive Network partner; and Soundstr, a music identification and rights management cloud platform that track and audit public performances of music. VNUE, Inc. has a strategic relationship with NEWHD Media to launch VNUE Radio, an online radio station. The company was founded in 2013 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10001",
        "website": "http://www.vnue.com",
        "market_cap": "Small Cap"
    },
    "W1MG34.SA": {
        "short_name": "WARNER MUSICDRN",
        "long_name": "Warner Music Group Corp.",
        "summary": "Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, and internationally. The company operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as the related marketing, promotion, distribution, sale, and licensing of music created by such artists. This segment also specializes in marketing its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials. It conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Elektra, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin', Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 80,000 songwriters and composers; and a range of genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, techno, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York. Warner Music Group Corp. is a subsidiary of AI Entertainment Holdings LLC.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.wmg.com",
        "market_cap": "Large Cap"
    },
    "WA4.F": {
        "short_name": "WARNER MUSIC GRP CORP.CLA",
        "long_name": "Warner Music Group Corp.",
        "summary": "Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, and internationally. The company operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as the related marketing, promotion, distribution, sale, and licensing of music created by such artists. This segment also specializes in marketing its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials. It conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Elektra, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin', Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 80,000 songwriters and composers; and a range of genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, techno, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York. Warner Music Group Corp. is a subsidiary of AI Entertainment Holdings LLC.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.wmg.com",
        "market_cap": "Large Cap"
    },
    "WDP.DE": {
        "short_name": "DISNEY (WALT) CO.",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "WDP.F": {
        "short_name": "DISNEY (WALT) CO.",
        "long_name": "The Walt Disney Company",
        "summary": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. The company's Media Networks segment operates domestic cable networks under the Disney, ESPN, Freeform, FX, and National Geographic brands; and television broadcast network under the ABC brand, as well as eight domestic television stations. This segment is also involved in the television production and distribution. Its Parks, Experiences and Products segment operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney and Aulani, a Disney resort and spa in Hawaii, as well as licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort in Japan. The company's Studio Entertainment segment produces and distributes motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, Searchlight Pictures, and Blue Sky Studios banners; develops, produces, and licenses live entertainment events; produces and distributes music; and provides post-production services through Industrial Light & Magic and Skywalker Sound. Its Direct-To-Consumer & International segment operates international television networks and channels comprising Disney, ESPN, Fox, National Geographic, and Star; direct-to-consumer videos streaming services consisting of Disney+/Disney+Hotstar, ESPN+, and Hulu; and operates branded apps and Websites, such as Disney Movie Club and Disney Digital Network, as well as provides streaming technology support services. The company was founded in 1923 and is based in Burbank, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91521",
        "website": "http://www.thewaltdisneycompany.com",
        "market_cap": "Large Cap"
    },
    "WEBB": {
        "short_name": "WEB BLOCKCHAIN MEDIA INC",
        "long_name": "Web Blockchain Media Inc.",
        "summary": "Web Blockchain Media Inc. engages in television production, Internet, and streaming media with crypto, blockchain, and fin-tech space. The company is based in Studio City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Studio City",
        "zipcode": "91604",
        "website": "http://webblockchainmedia.com",
        "market_cap": "Small Cap"
    },
    "WIZD": {
        "short_name": "WIZARD BRANDS INC",
        "long_name": "Wizard Brands, Inc.",
        "summary": "Wizard Brands Inc. produces pop culture live multimedia conventions in North America. Its live multimedia conventions offer a social networking and entertainment venue for enthusiasts of movies, TV shows, video games, technology, toys, social networking/gaming, comic books, anime, and graphic novels. The company's conventions also provide sales, marketing, product promotion, public relations, advertising, and sponsorship opportunities for entertainment, toy, gaming, publishing, and retail businesses. It serves movie studios, video game producers, comic book publishers, television broadcasters, and toy manufacturers. Wizard Brands Inc. markets its comic conventions through various media outlets, such as including social media, websites, public relations, television, radio, out-of-home media, email, flyers, and postcards, as well as newspapers, national press, and blogs. The company was formerly known as Wizard Entertainment, Inc. and changed its name to Wizard Brands Inc. in July 2020. Wizard Brands Inc. was incorporated in 2001 and is based in Utah, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Park City",
        "zipcode": "84098",
        "website": "http://www.wizardworld.com",
        "market_cap": "Small Cap"
    },
    "WMG": {
        "short_name": "Warner Music Group Corp.",
        "long_name": "Warner Music Group Corp.",
        "summary": "Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, and internationally. The company operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as the related marketing, promotion, distribution, sale, and licensing of music created by such artists. This segment also specializes in marketing its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials. It conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Elektra, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin', Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 80,000 songwriters and composers; and a range of genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, techno, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York. Warner Music Group Corp. is a subsidiary of AI Entertainment Holdings LLC.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.wmg.com",
        "market_cap": "Large Cap"
    },
    "WMG.VI": {
        "short_name": "WARNER MUSIC GROUP CORP-CL A",
        "long_name": "Warner Music Group Corp.",
        "summary": "Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, and internationally. The company operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as the related marketing, promotion, distribution, sale, and licensing of music created by such artists. This segment also specializes in marketing its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials. It conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Elektra, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin', Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 80,000 songwriters and composers; and a range of genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, techno, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York. Warner Music Group Corp. is a subsidiary of AI Entertainment Holdings LLC.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10019",
        "website": "http://www.wmg.com",
        "market_cap": "Large Cap"
    },
    "WOW": {
        "short_name": "WideOpenWest, Inc.",
        "long_name": "WideOpenWest, Inc.",
        "summary": "WideOpenWest, Inc. provides high speed data, cable television, and digital telephony services to residential and business services customers in the United States. Its video services include basic cable services that comprise local broadcast television and local community programming; digital cable services; WOW! tv+ that offers traditional cable video and cloud DVR functionality, voice remote with Google Assistant, and Netflix integration along with access to various streaming services and apps through the Google Play Store; and ultra-video products, as well as offers commercial-free movies, TV shows, sports, and other special event entertainment programs. The company's telephony services consist of local and long-distance telephone services; business telephony and data services include fiber based, office-to-office metro Ethernet, session initiated protocol trunking, colocation infrastructure, cloud computing, managed backup, and recovery services. As of December 31, 2020, it served approximately 3.2 million home and business, and 850,600 customers in the states of Alabama, Florida, Georgia, Illinois, Indiana, Maryland, Michigan, Ohio, South Carolina, and Tennessee. The company was formerly known as WideOpenWest Kite, Inc. and changed its name to WideOpenWest, Inc. in March 2017. WideOpenWest, Inc. was founded in 2001 and is based in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80111",
        "website": "http://www.wowway.com",
        "market_cap": "Small Cap"
    },
    "WRIT": {
        "short_name": "WRIT MEDIA GROUP INC",
        "long_name": "WRIT Media Group, Inc.",
        "summary": "WRIT Media Group, Inc., through its subsidiaries, operates as a content creation company worldwide. It produces, acquires, licenses, and distributes music-related content in 3D and ultra-high definition for digital broadcast into digitally-enabled movie theaters, TV, and mobile streaming providers. The company also licenses pre-Windows computer game libraries, as well as adapts and republishes titles under the Amiga, Atari, and MS-DOS brands for smartphones, modern game consoles, PCs, tablets, and other television streaming devices; and publishes related merchandise and characters from the games. In addition, it develops digital currency, Blockchain technology, and digital currency trading software. The company was formerly known as Writers' Group Film Corp. and changed its name to WRIT Media Group, Inc. in January 2014. WRIT Media Group, Inc. headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89135",
        "website": "http://www.writmediagroup.com",
        "market_cap": "Small Cap"
    },
    "WU5.F": {
        "short_name": "WIDEOPENWEST INC DL -,01",
        "long_name": "WideOpenWest, Inc.",
        "summary": "WideOpenWest, Inc. provides high speed data, cable television, and digital telephony services to residential and business services customers in the United States. Its video services include basic cable services that comprise local broadcast television and local community programming; digital cable services; WOW! tv+ that offers traditional cable video and cloud DVR functionality, voice remote with Google Assistant, and Netflix integration along with access to various streaming services and apps through the Google Play Store; and ultra-video products, as well as offers commercial-free movies, TV shows, sports, and other special event entertainment programs. The company's telephony services consist of local and long-distance telephone services; business telephony and data services include fiber based, office-to-office metro Ethernet, session initiated protocol trunking, colocation infrastructure, cloud computing, managed backup, and recovery services. As of December 31, 2020, it served approximately 3.2 million home and business, and 850,600 customers in the states of Alabama, Florida, Georgia, Illinois, Indiana, Maryland, Michigan, Ohio, South Carolina, and Tennessee. The company was formerly known as WideOpenWest Kite, Inc. and changed its name to WideOpenWest, Inc. in March 2017. WideOpenWest, Inc. was founded in 2001 and is based in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80111",
        "website": "http://www.wowway.com",
        "market_cap": "Small Cap"
    },
    "WWE": {
        "short_name": "World Wrestling Entertainment, ",
        "long_name": "World Wrestling Entertainment, Inc.",
        "summary": "World Wrestling Entertainment, Inc., an integrated media and entertainment company, engages in the sports entertainment business in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through three segments: Media, Live Events, and Consumer Products. The Media segment engages in the production and monetization of long-form and short-form media content across various platforms, including WWE Network, pay television, and digital and social media, as well as filmed entertainment. The Live Events segment is involved in the sale of tickets, including primary and secondary distribution; provision of event services; and sale of travel packages related to its live events. The Consumer Products segment engages in merchandising of WWE branded products, such as video games, toys, apparels, and books through licensing arrangements and direct-to-consumer sales, as well as through e-commerce platforms. World Wrestling Entertainment, Inc. was founded in 1980 and is headquartered in Stamford, Connecticut.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06902",
        "website": "http://corporate.wwe.com",
        "market_cap": "Mid Cap"
    },
    "WWFA.F": {
        "short_name": "WW ENTERTAIN A  DL-,01",
        "long_name": "World Wrestling Entertainment, Inc.",
        "summary": "World Wrestling Entertainment, Inc., an integrated media and entertainment company, engages in the sports entertainment business in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates through three segments: Media, Live Events, and Consumer Products. The Media segment engages in the production and monetization of long-form and short-form media content across various platforms, including WWE Network, pay television, and digital and social media, as well as filmed entertainment. The Live Events segment is involved in the sale of tickets, including primary and secondary distribution; provision of event services; and sale of travel packages related to its live events. The Consumer Products segment engages in merchandising of WWE branded products, such as video games, toys, apparels, and books through licensing arrangements and direct-to-consumer sales, as well as through e-commerce platforms. World Wrestling Entertainment, Inc. was founded in 1980 and is headquartered in Stamford, Connecticut.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Stamford",
        "zipcode": "06902",
        "website": "http://corporate.wwe.com",
        "market_cap": "Mid Cap"
    },
    "XSPT": {
        "short_name": "XSPORT GLOBAL INC",
        "long_name": "XSport Global, Inc.",
        "summary": "XSport Global, Inc. operates as a youth and collegiate sports technology and media holding company worldwide. The company operates in two segments, XSport Global and Shift Now. It focuses on creating, developing, promoting, marketing, producing, and distributing online/mobile application cognitive training tools for the youth, millennial, and adult sports markets. The company engages in the development of XSport Global, a mobile device application that provides a suite of cognitive training exercises available in iOS and Android versions; and integrates into a server-based platform that can customize user experiences, track progress, provide education, and offer an administrative console for the user. It also provides marketing and advertising services for retail, and business to business. The company is based in Charlotte, North Carolina.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NC",
        "city": "Charlotte",
        "zipcode": "28203",
        "website": "http://xsportglobal.com",
        "market_cap": "Small Cap"
    },
    "ZZA.F": {
        "short_name": "CINEMARK HLDGS INC.DL-,01",
        "long_name": "Cinemark Holdings, Inc.",
        "summary": "Cinemark Holdings, Inc., together with its subsidiaries, engages in the motion picture exhibition business. As of March 4, 2021, it operated 531 theatres with 5,958 screens in the United States, Brazil, Argentina, Chile, Colombia, Ecuador, Peru, Honduras, El Salvador, Nicaragua, Costa Rica, Panama, Guatemala, Bolivia, Curacao, and Paraguay. The company was founded in 1984 and is headquartered in Plano, Texas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Plano",
        "zipcode": "75093",
        "website": "http://ir.cinemark.com",
        "market_cap": "Mid Cap"
    }
}