{
    "0C6.F": {
        "short_name": "CARGURUS INC.CL.A DL-,001",
        "long_name": "CarGurus, Inc.",
        "summary": "CarGurus, Inc. operates an online automotive marketplace connecting buyers and sellers of new and used cars in the United States and internationally. The company provides consumers an online automotive marketplace where they can search for new and used car listings from its dealers, as well as sell their car in the United States marketplace. Its marketplace connects dealers to a large audience of informed and engaged consumers. The company operates online marketplaces under the CarGurus brand in Canada and the United Kingdom; and the Autolist and PistonHeads online marketplaces as independent brands in the United States and the United Kingdom. CarGurus, Inc. was founded in 2005 and is headquartered in Cambridge, Massachusetts.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Cambridge",
        "zipcode": "02141",
        "website": "http://www.cargurus.com",
        "full_time_employees": 827
    },
    "0ZG.F": {
        "short_name": "ZILLOW GROUP  DL-,01",
        "long_name": "Zillow Group, Inc.",
        "summary": "Zillow Group, Inc., a digital real estate company, operates real estate brands on mobile applications and websites in the United States. It operates through three segments: Homes; Internet, Media & Technology; and Mortgages. The company's mobile applications and websites offer various real estate transactions and related services, including buying, selling, renting, and financing services for residential real estate properties; purchase and sell homes; offer title and escrow services, title insurance products and services, and mortgage loans. Its portfolio of brands include Zillow, Zillow Offers, Zillow Closing Services, Zillow Home Loans, Trulia, StreetEasy, and HotPads. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.zillowgroup.com",
        "full_time_employees": 5504
    },
    "0ZG2.F": {
        "short_name": "ZILLOW GROUP C CAP.DL-,01",
        "long_name": "Zillow Group, Inc.",
        "summary": "Zillow Group, Inc., a digital real estate company, operates real estate brands on mobile applications and websites in the United States. It operates through three segments: Homes; Internet, Media & Technology; and Mortgages. The company's mobile applications and websites offer various real estate transactions and related services, including buying, selling, renting, and financing services for residential real estate properties; purchase and sell homes; offer title and escrow services, title insurance products and services, and mortgage loans. Its portfolio of brands include Zillow, Zillow Offers, Zillow Closing Services, Zillow Home Loans, Trulia, StreetEasy, and HotPads. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.zillowgroup.com",
        "full_time_employees": 5504
    },
    "1GU.F": {
        "short_name": "GRUBHUB INC.  DL-,0001",
        "long_name": "Grubhub Inc.",
        "summary": "Grubhub Inc., together with its subsidiaries, provides an online and mobile platform for restaurant pick-up and delivery orders in the United States. The company connects approximately 300,000 local restaurants with diners in various cities. It offers mobile applications and mobile Websites; and operates Websites through grubhub.com, seamless.com, and menupages.com. The company also provides corporate program that offers employees with various food and ordering options, including options for individual meals, group ordering, and catering, as well as proprietary tools that consolidate various food ordering into a single online account. In addition, it offers Grubhub for Restaurants, a responsive web application that can be accessed from computers and mobile devices, as well as Grubhub-provided tablets; GH+ subscription program to diners; delivery services to restaurants; point of sale (POS) integration, which allows restaurants to manage Grubhub orders and update their menus directly from their existing POS system; and Website and mobile application design and hosting services for restaurants, as well as technology and fulfillment services, including order transmission and customer relationship management tools. The company was formerly known as GrubHub Seamless Inc. and changed its name to Grubhub Inc. in February 2014. Grubhub Inc. was founded in 1999 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60602",
        "website": "http://investors.grubhub.com/investors/overview/",
        "full_time_employees": 2841
    },
    "1SI.DE": {
        "short_name": "SNAP INC. CL.A DL-,00001",
        "long_name": "Snap Inc.",
        "summary": "Snap Inc. operates as a camera company in the United States and internationally. The company offers Snapchat, a camera application with functionalities, such as Camera, Communication, Snap Map, Stories, and Spotlight that enable people to communicate through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures video from a human perspective; and advertising products, including AR and Snap ads. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90405",
        "website": "http://www.snap.com",
        "full_time_employees": 3863
    },
    "2IZ.F": {
        "short_name": "IZEA WORLDWIDE  DL -,0001",
        "long_name": "IZEA Worldwide, Inc.",
        "summary": "IZEA Worldwide, Inc., together with its subsidiaries, creates and operates online marketplaces that connect marketers and content creators. Its technology solutions enable the management of content workflow, creator search and targeting, bidding, analytics, and payment processing. The company engages creator for influencer marketing campaigns, and to create content for the marketers' use and distribution. It primarily sells influencer marketing and content campaigns through sales team, as well as IZEAx Exchnage, BrandGraph, Shake, and TapInfluence platforms. The company was formerly known as IZEA, Inc. and changed its name to IZEA Worldwide, Inc. in August 2018. IZEA Worldwide, Inc. was founded in 2006 and is headquartered in Winter Park, Florida.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Winter Park",
        "zipcode": "32789",
        "website": "http://www.izea.com",
        "full_time_employees": 104
    },
    "2UH.F": {
        "short_name": "ANGI INC  DL-,001",
        "long_name": "Angi Inc.",
        "summary": "Angi Inc. offers home service professionals in the United States and internationally. Its HomeAdvisor digital marketplace service connects consumers with service professionals for home repair, maintenance, and improvement projects; provides consumers with tools and resources to find local, pre-screened, and customer-rated service professionals, as well as offers online appointment booking; and connects consumers with service professionals by telephone, as well as offers several home services-related resources. The company also owns and operates Angie's List, which connects consumers with service professionals for local services through an online directory of service professionals in various service categories; and provides consumers with valuable tools, services, and content, including verified reviews, to help them research, shop, and hire for local services. In addition, it operates Handy, a platform for connecting individuals looking for household services, primarily cleaning and handyman services; Fixd Repair that offers home warranty and service; mHelpDesk, a provider of cloud-based field service software for small to mid-size businesses; and CraftJack, a third-party lead generation service that connects home service professionals with consumers looking to complete home projects; and home services marketplaces under the Travaux, MyHammer, Werkspot, MyBuilder, HomeStars, and Instapro names. As of December 31, 2020, it had a network of approximately 208,000 service professionals. The company was formerly known as ANGI Homeservices Inc. and changed its name to Angi Inc. in March 2021. The company was incorporated in 2017 and is headquartered in Denver, Colorado. Angi Inc. is a subsidiary of IAC/InterActiveCorp.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80205",
        "website": "http://www.angi.com",
        "full_time_employees": 5100
    },
    "3SWN.F": {
        "short_name": "REMARK HLDGS NEW DL -,001",
        "long_name": "Remark Holdings, Inc.",
        "summary": "Remark Holdings, Inc. primarily focuses on the development and deployment of artificial-intelligence-based solutions for businesses and software developers. It owns and operates an e-commerce digital media property focuses on a luxury beach lifestyle. The company sells its AI-based products and services under the Remark AI brand in the United States; and under the KanKan brand in China. The company was incorporated in 2006 and is headquartered in Las Vegas, Nevada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89106",
        "website": "http://www.remarkholdings.com",
        "full_time_employees": 77
    },
    "5TC.F": {
        "short_name": "TRUECAR INC.  DL -,0001",
        "long_name": "TrueCar, Inc.",
        "summary": "TrueCar, Inc. operates as an internet-based information, technology, and communication services company in the United States. It operates its platform on the TrueCar website and mobile applications. Its platform enables users to obtain market-based pricing data on new and used cars, and to connect with its network of TrueCar certified dealers. The company also offers forecast and consulting services regarding determination of the residual value of an automobile at given future points in time, which are used to underwrite automotive loans and leases, and by financial institutions to measure exposure and risk across loan, lease, and fleet portfolios. In addition, it provides accurate, geographically specific, and real-time pricing information for consumers and dealers; TrueCar Trade, which gives consumers information on the value of their trade-in vehicles and enables them to obtain a guaranteed trade-in price before setting foot in the dealership; DealerSync, a dealer website creation and management service and a software platform that assists dealers in managing, marketing, and growing their business; and DealerScience that provides dealers with advanced digital retailing software tools. Further, the company customizes and operates its platform for financial institutions, membership-based organizations, and large enterprises. The company was formerly known as Zag.com Inc. TrueCar, Inc. was incorporated in 2005 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.truecar.com",
        "full_time_employees": 435
    },
    "ABBY": {
        "short_name": "ABBY INC",
        "long_name": "Abby, Inc.",
        "summary": "Abby, Inc. operates in the auto industry. The company, through its interest in The Evans Corporation, focuses on auto brokerage and sales business in California under the Evans Auto Brokerage & Sales name. It also focuses on providing catering and commissary needs for special events. The company was incorporated in 2000 and is based in Thousand Oaks, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Thousand Oaks",
        "zipcode": "91360",
        "website": "http://abbyholdinggroup.com",
        "full_time_employees": 1
    },
    "ABEA.DE": {
        "short_name": "ALPHABET INC.CL.A DL-,001",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "ABEA.F": {
        "short_name": "ALPHABET INC.CL.A DL-,001",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "ABEC.DE": {
        "short_name": "ALPHABET INC.CL C DL-,001",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "ABEC.F": {
        "short_name": "ALPHABET INC.CL C DL-,001",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "ABNB.MX": {
        "short_name": "AIRBNB INC",
        "long_name": "Airbnb, Inc.",
        "summary": "Airbnb, Inc., together with its subsidiaries, operates a platform for stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms and luxury villas. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.airbnb.com",
        "full_time_employees": 5597
    },
    "ABNB": {
        "short_name": "Airbnb, Inc.",
        "long_name": "Airbnb, Inc.",
        "summary": "Airbnb, Inc., together with its subsidiaries, operates a platform for stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms and luxury villas. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.airbnb.com",
        "full_time_employees": 5597
    },
    "ABNB.VI": {
        "short_name": "AIRBNB INC-CLASS A",
        "long_name": "Airbnb, Inc.",
        "summary": "Airbnb, Inc., together with its subsidiaries, operates a platform for stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms and luxury villas. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.airbnb.com",
        "full_time_employees": 5597
    },
    "AIRB34.SA": {
        "short_name": "AIRBNB      DRN",
        "long_name": "Airbnb, Inc.",
        "summary": "Airbnb, Inc., together with its subsidiaries, operates a platform for stays and experiences to guests worldwide. The company's marketplace model connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms and luxury villas. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.airbnb.com",
        "full_time_employees": 5597
    },
    "ANGI": {
        "short_name": "Angi Inc.",
        "long_name": "Angi Inc.",
        "summary": "Angi Inc. offers home service professionals in the United States and internationally. Its HomeAdvisor digital marketplace service connects consumers with service professionals for home repair, maintenance, and improvement projects; provides consumers with tools and resources to find local, pre-screened, and customer-rated service professionals, as well as offers online appointment booking; and connects consumers with service professionals by telephone, as well as offers several home services-related resources. The company also owns and operates Angie's List, which connects consumers with service professionals for local services through an online directory of service professionals in various service categories; and provides consumers with valuable tools, services, and content, including verified reviews, to help them research, shop, and hire for local services. In addition, it operates Handy, a platform for connecting individuals looking for household services, primarily cleaning and handyman services; Fixd Repair that offers home warranty and service; mHelpDesk, a provider of cloud-based field service software for small to mid-size businesses; and CraftJack, a third-party lead generation service that connects home service professionals with consumers looking to complete home projects; and home services marketplaces under the Travaux, MyHammer, Werkspot, MyBuilder, HomeStars, and Instapro names. As of December 31, 2020, it had a network of approximately 208,000 service professionals. The company was formerly known as ANGI Homeservices Inc. and changed its name to Angi Inc. in March 2021. The company was incorporated in 2017 and is headquartered in Denver, Colorado. Angi Inc. is a subsidiary of IAC/InterActiveCorp.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Denver",
        "zipcode": "80205",
        "website": "http://www.angi.com",
        "full_time_employees": 5100
    },
    "AUTO": {
        "short_name": "AutoWeb, Inc.",
        "long_name": "AutoWeb, Inc.",
        "summary": "AutoWeb, Inc. operates as a digital marketing company for the automotive industry in the United States. It assists automotive retail dealers and manufacturers to market and sell new and used vehicles to consumers through its programs. The company's products include new vehicle lead program, which allows consumers to submit requests for pricing and availability of specific makes and models; and used vehicle lead program, which allows consumers to search for used vehicles according to specific search parameters, such as price, make, model, mileage, year, and location of the vehicle. Its products and services also comprise WebLeads+ that offers various coupon options, which display marketing messages to consumers visiting the dealer's Website; and Payment Pro, a dealer website conversion tool that offers consumers real-time online monthly payment information, as well as sells fixed placement advertising across its Website to automotive advertisers. The company owns and operates automotive websites that offers consumers with the information and tools to aid them with their automotive purchase decisions; direct marketing platform that enables manufacturers to selectively target in-market consumers during the often-extended vehicle shopping process; and click traffic referral program, a pay-per-click advertising program that offer targeted offers to consumers based on make, model, and geographic location. The company was formerly known as Autobytel Inc. and changed its name to AutoWeb, Inc. in October 2017. AutoWeb, Inc. was founded in 1995 and is based in Tampa, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33602-4314",
        "website": "http://www.autoweb.com",
        "full_time_employees": 149
    },
    "AYCP.F": {
        "short_name": "AUTOWEB INC.  DL-,001",
        "long_name": "AutoWeb, Inc.",
        "summary": "AutoWeb, Inc. operates as a digital marketing company for the automotive industry in the United States. It assists automotive retail dealers and manufacturers to market and sell new and used vehicles to consumers through its programs. The company's products include new vehicle lead program, which allows consumers to submit requests for pricing and availability of specific makes and models; and used vehicle lead program, which allows consumers to search for used vehicles according to specific search parameters, such as price, make, model, mileage, year, and location of the vehicle. Its products and services also comprise WebLeads+ that offers various coupon options, which display marketing messages to consumers visiting the dealer's Website; and Payment Pro, a dealer website conversion tool that offers consumers real-time online monthly payment information, as well as sells fixed placement advertising across its Website to automotive advertisers. The company owns and operates automotive websites that offers consumers with the information and tools to aid them with their automotive purchase decisions; direct marketing platform that enables manufacturers to selectively target in-market consumers during the often-extended vehicle shopping process; and click traffic referral program, a pay-per-click advertising program that offer targeted offers to consumers based on make, model, and geographic location. The company was formerly known as Autobytel Inc. and changed its name to AutoWeb, Inc. in October 2017. AutoWeb, Inc. was founded in 1995 and is based in Tampa, Florida.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33602-4314",
        "website": "http://www.autoweb.com",
        "full_time_employees": 149
    },
    "BLIS": {
        "short_name": "BELISS CORPORATION",
        "long_name": "Treasure & Shipwreck Recovery, Inc.",
        "summary": "Treasure & Shipwreck Recovery, Inc. operates in the sunken treasure industry. It focuses on researching, surveying, finding, and recovering artifacts, treasure, or other items of value from valuable historical shipwrecks. The company was formerly known as Beliss Corp. and changed its name to Treasure & Shipwreck Recovery, Inc. in June 2019. Treasure & Shipwreck Recovery, Inc. was incorporated in 2016 and is based in Tampa, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33626",
        "website": "http://treasurewreck.com",
        "full_time_employees": 2
    },
    "BMTM": {
        "short_name": "BRIGHT MOUNTAIN MEDIA INC",
        "long_name": "Bright Mountain Media, Inc.",
        "summary": "Bright Mountain Media, Inc., owns and manages websites in the United States. The company operates websites, which provides information, news, and entertainment to military, law enforcement, first responders, and other public safety employees. It also offers video, display, mobile, and native advertisements, as well as provides focused promotion for advertisers of products and services. The company was formerly known as Bright Mountain Acquisition Corporation and changed its name to Bright Mountain Media, Inc. in December 2015. Bright Mountain Media, Inc. was founded in 2010 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33487",
        "website": "http://www.brightmountainmedia.com",
        "full_time_employees": null
    },
    "BSPR": {
        "short_name": "BIGSUPERSEARCH COM INC",
        "long_name": "Bigsupersearch.com, Inc.",
        "summary": "Bigsupersearch.com, Inc., an online advertising and technology company, provides advertising solutions for consumers, publishers, and advertisers. The company's primary commercial function is an online search engine. It offers advertisers the ability to reach Internet users via contextually targeted keywords. Bigsupersearch.com, Inc. was founded in 2005 and is based in Tarzana, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Tarzana",
        "zipcode": "91356",
        "website": "http://www.bigsupersearch.com",
        "full_time_employees": null
    },
    "BTIM": {
        "short_name": "BOATIM INC",
        "long_name": "Boatim Inc.",
        "summary": "Boatim Inc. operates online marketplace and special interest social network for the boating industry and boat users. The company operates BOATIM, a boat trading platform. The company was formerly known as Emerald Data Inc. and changed its name to Boatim Inc. in February 2019. Boatim Inc. was founded in 2014 and is based in Miami, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33166",
        "website": "http://boatim.com",
        "full_time_employees": 11
    },
    "BWBA": {
        "short_name": "BROADWEBASIA INC",
        "long_name": "BroadWebAsia, Inc.",
        "summary": "BroadWebAsia, Inc. operates Chinese language Web sites. Its Chinese language Web sites provides social and community entertainment and search services. The company's Web sites include major.tv/china, a major league baseball focused Web site in the simplified Chinese language; and bbmao.com, a Web site for delivering meta-and social search results to Chinese Internet users. It targets an audience of young Chinese Internet users who are in 13-30 year old demographic. The company was founded in 2005 and is based in West Hollywood, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "West Hollywood",
        "zipcode": "90069",
        "website": null,
        "full_time_employees": 46
    },
    "CARG": {
        "short_name": "CarGurus, Inc.",
        "long_name": "CarGurus, Inc.",
        "summary": "CarGurus, Inc. operates an online automotive marketplace connecting buyers and sellers of new and used cars in the United States and internationally. The company provides consumers an online automotive marketplace where they can search for new and used car listings from its dealers, as well as sell their car in the United States marketplace. Its marketplace connects dealers to a large audience of informed and engaged consumers. The company operates online marketplaces under the CarGurus brand in Canada and the United Kingdom; and the Autolist and PistonHeads online marketplaces as independent brands in the United States and the United Kingdom. CarGurus, Inc. was founded in 2005 and is headquartered in Cambridge, Massachusetts.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Cambridge",
        "zipcode": "02141",
        "website": "http://www.cargurus.com",
        "full_time_employees": 827
    },
    "CDLX.MX": {
        "short_name": "CARDLYTICS INC",
        "long_name": "Cardlytics, Inc.",
        "summary": "Cardlytics, Inc. operates an advertising platform within financial institutions digital channels that include online, mobile, email, and various real-time notifications in the United States and the United Kingdom. It offers Cardlytics platform, a proprietary native bank advertising channel that enables marketers to reach consumers through their trusted and frequently visited online and mobile banking channels. The company was incorporated in 2008 and is headquartered in Atlanta, Georgia.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30308",
        "website": "http://www.cardlytics.com",
        "full_time_employees": 471
    },
    "CDLX": {
        "short_name": "Cardlytics, Inc. Common Stock",
        "long_name": "Cardlytics, Inc.",
        "summary": "Cardlytics, Inc. operates an advertising platform within financial institutions digital channels that include online, mobile, email, and various real-time notifications in the United States and the United Kingdom. It offers Cardlytics platform, a proprietary native bank advertising channel that enables marketers to reach consumers through their trusted and frequently visited online and mobile banking channels. The company was incorporated in 2008 and is headquartered in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30308",
        "website": "http://www.cardlytics.com",
        "full_time_employees": 578
    },
    "CHNO": {
        "short_name": "CHILL N OUT CRYOTHERAPY INC",
        "long_name": "ClassWorx, Inc.",
        "summary": "Bay Stakes Corporation does not have significant operations. The company intends to investigate alternative business opportunities, which might include a merger with another company. Previously, it was involved in mining business. The company was formerly known as Sanborn Resources, Ltd. and changed its name to Bay Stakes Corporation in November 2016. Bay Stakes Corporation was founded in 2011 and is based in West Palm Beach, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "West Palm Beach",
        "zipcode": "33401",
        "website": "http://www.chillnout.com",
        "full_time_employees": null
    },
    "CIIX": {
        "short_name": "CHINESEINVESTORS COM INC",
        "long_name": "Chineseinvestors.com, Inc.",
        "summary": "Chineseinvestors.com, Inc. provides Web-based real-time financial information in Chinese language for the Chinese population in Singapore, Malaysia, Thailand, Indonesia, Vietnam, the Philippines, Taiwan, and China. It offers various subscription services, including real-time market commentary and analysis in the Chinese language to various Chinese speaking investors and traders in the United States and Canada. The company also provides advisory services on the US capital markets and the US Securities markets; Website-based advertising services; price chart and news updates on stocks and research tools; and additional education services, such as courses offering basic knowledge and practical trading skills. In addition, it offers Website content comprising stock quotes, trading volumes, and pricing indicators for listed companies in the United States. Further, the company sells various hemp-infused skincare products, including hemp oil, soft gels, and gummies through its Website, ChineseHempOil.com and Chinese Wellness Center, as well as through Shopee, a Singaporean e-commerce platform; and distributes liquor products. Additionally, it provides in person and online courses on crypto currency investment and trading. The company offers its services through its Websites, as well as through customer support personnel at its telemarketing and customer service center. The company was founded in 1997 and is headquartered in San Gabriel, California. On January 25, 2021, the voluntary petition of Chineseinvestors.com, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on June 18, 2020.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Gabriel",
        "zipcode": "91776",
        "website": "http://www.chinesefn.com",
        "full_time_employees": 53
    },
    "CRTD": {
        "short_name": "Creatd Inc.",
        "long_name": "Creatd, Inc.",
        "summary": "Creatd, Inc., a technology company, focuses on the development of digital communities, marketing branded digital content, and e-commerce opportunities. The company's flagship product is Vocal, a content distribution platform that delivers a digital publishing platform organized into niche-communities capable of hosting various rich media content. Its Vocal platform enhances the visibility of content and maximizes viewership, and provides advertisers access to target markets that closely match their interests. The company also offers Vocal for Brands, an internal content studio that pairs leading brands with authentic creators to produce marketing campaigns; and Seller's Choice, an in-house marketing agency for direct-to-consumer and e-commerce clients, which provides managed and performance marketing services. In addition, it provides Recreatd, which houses intellectual property and legacy media assets, including acquired artwork, photographs, and media memorabilia to reboot archival media assets and e-commerce properties. The company was formerly known as Jerrick Media Holdings, Inc. and changed its name to Creatd Inc. in September 2020. Creatd, Inc. is headquartered in Fort Lee, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Fort Lee",
        "zipcode": "07024",
        "website": "http://www.creatd.com",
        "full_time_employees": 42
    },
    "CRWG": {
        "short_name": "CROWDGATHER INC",
        "long_name": "CrowdGather, Inc.",
        "summary": "CrowdGather, Inc., a social networking Internet company, develops and hosts forum based Websites primarily in the United States. It monetizes a network of online forums and message boards designed to engage, provide information to, and build community around users. The company's forum community connects a network of people sharing their questions, expertise, and experiences. It also provides targeted advertising and marketing services for online customers. The company's portfolio includes approximately 350 domain names and 70 Web properties at various stages of development. CrowdGather, Inc. is headquartered in Calabasas, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Calabasas",
        "zipcode": "91302",
        "website": null,
        "full_time_employees": null
    },
    "CTYO": {
        "short_name": "CATHAYONLINE INC",
        "long_name": "CathayOnline, Inc.",
        "summary": "Cathayonline, Inc. operates as a fully integrated Internet company serving the global Chinese community, with a primary focus on the People's Republic of China. The company, through its subsidiary companies and exclusive partnership and joint venture arrangements with certain Chinese entities, operates as an Internet Service Provider. It provides Web based email and advanced messaging services, principally in the areas of Sichuan province, Beijing, and Guangdong. The company's Web-based email and advanced messaging services also include Fax over Internet and Voice over Internet. Cathayonline, Inc. was founded in 1995 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.cathayonline.com",
        "full_time_employees": 80
    },
    "CYAP": {
        "short_name": "CYBER APPS WORLD INC",
        "long_name": "Cyber Apps World Inc.",
        "summary": "Cyber Apps World Inc. operates a price comparison Website. The company's savinstultra.com Website consists of a search engine that users may access in order to compare the prices of different consumer products in various product categories, such as electronics, computers, cellular phones, office equipment, clothing, books, toys, and jewelry. The company was formerly known as Clean Enviro Tech Corp. and changed its name to Cyber Apps World Inc. in April 2015. Cyber Apps World Inc. was incorporated in 2002 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89134",
        "website": null,
        "full_time_employees": null
    },
    "CYX.F": {
        "short_name": "CARDLYTICS INC DL-,0001",
        "long_name": "Cardlytics, Inc.",
        "summary": "Cardlytics, Inc. operates an advertising platform within financial institutions digital channels that include online, mobile, email, and various real-time notifications in the United States and the United Kingdom. It offers Cardlytics platform, a proprietary native bank advertising channel that enables marketers to reach consumers through their trusted and frequently visited online and mobile banking channels. The company was incorporated in 2008 and is headquartered in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30308",
        "website": "http://www.cardlytics.com",
        "full_time_employees": 471
    },
    "DASH.MX": {
        "short_name": "DOORDASH INC",
        "long_name": "DoorDash, Inc.",
        "summary": "DoorDash, Inc. operates a logistics platform that connects merchants, consumers, and dashers in the United States and internationally. It operates DoorDash marketplace, which provides an array of services that enable merchants to solve mission-critical challenges, such as customer acquisition, delivery, insights and analytics, merchandising, payment processing, and customer support; and offers DoorDash Drive, a white-label logistics service; DoorDash Storefront that enables merchants to offer consumers on-demand access to e-commerce. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94107",
        "website": "http://www.doordash.com",
        "full_time_employees": 3886
    },
    "DASH": {
        "short_name": "DoorDash, Inc.",
        "long_name": "DoorDash, Inc.",
        "summary": "DoorDash, Inc. operates a logistics platform that connects merchants, consumers, and dashers in the United States and internationally. It operates DoorDash marketplace, which provides an array of services that enable merchants to solve mission-critical challenges, such as customer acquisition, delivery, insights and analytics, merchandising, payment processing, and customer support; and offers DoorDash Drive, a white-label logistics service; DoorDash Storefront that enables merchants to offer consumers on-demand access to e-commerce. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94107",
        "website": "http://www.doordash.com",
        "full_time_employees": 3886
    },
    "DATI": {
        "short_name": "DIGITAL ASSET MONETARY NETWORK ",
        "long_name": "Digital Asset Monetary Network, Inc.",
        "summary": "Digital Asset Monetary Network, Inc. operates as a public accelerator-incubator.  The company funds disruptive and sustainable innovations, solves problems through digital platforms and other electronic applications. The company aligns with other private accelerators and incubators, to form unique partnerships. These partnerships enhance the vetting process, to ensure that the teams, who are developing the cutting edge innovations, are properly funded and acquired. Further, the company partners with entrepreneurs, venture capitalists, and development teams to provide startups with general and functional mentorship. Digital Arts Media Network, Inc. was formerly known as Umairco, Inc. and changed its name to Digital Arts Media Network, Inc. in March 2015. The company is based in Bronx, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Riverdale",
        "zipcode": "10463",
        "website": "http://digitalamn.com",
        "full_time_employees": null
    },
    "DELC.CN": {
        "short_name": "DelicHoldings",
        "long_name": "Delic Holdings Inc.",
        "summary": "Delic Corp provides media brand mainstreaming psychedelic services. The company was founded in 2019 and is based in Marina Del Rey, California.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "United States",
        "state": "CA",
        "city": "Marina Del Rey",
        "zipcode": "90292",
        "website": "http://www.deliccorp.com",
        "full_time_employees": null
    },
    "DELCF": {
        "short_name": "DELIC HOLDINGS INC",
        "long_name": "Delic Holdings Inc.",
        "summary": "Delic Corp provides media brand mainstreaming psychedelic services. The company was founded in 2019 and is based in Marina Del Rey, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Marina Del Rey",
        "zipcode": "90292",
        "website": "http://www.deliccorp.com",
        "full_time_employees": null
    },
    "DJM1.F": {
        "short_name": "LEAF GROUP LTD  DL-,0001",
        "long_name": "Leaf Group Ltd.",
        "summary": "Leaf Group Ltd., together with its subsidiaries, operates as a diversified consumer internet company worldwide. It operates in two segments, Marketplaces and Media. The Marketplaces segment offers Society6.com, which provides artists with an online commerce platform to feature and sell their original art and designs on consumer products in the wall art, home dÃ©cor, and tech and apparel accessories categories. It also provides SaatchiArt.com and its related art fair event brand, which is an online art gallery where a global community of artists exhibit and sell their original artwork directly to consumers. The Media segment offers Well+Good, a health and wellness media brand that offers journalistic approach to content; and Livestrong.com, a destination and action-oriented community, as well as mobile applications, such as MyPlate that monitor users' health, fitness, and life achievements. This segment also provides Hunker, a home design media site for enabling first-time homeowners enhance their homes with practical solutions, home tours, and design advice for people; and Only In Your State, a US-focused local attractions and review site, which highlights small businesses, hidden gems, and natural wonders for the audience. In addition, this segment offers content creation, traffic source, mobile application, and monetization services; and develops partner sites. It sells its products through wholesale channels to trade and hospitality clients, as well as through retail distribution partners. The company was formerly known as Demand Media, Inc. and changed its name to Leaf Group Ltd. in November 2016. Leaf Group Ltd. was incorporated in 2006 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.leafgroup.com",
        "full_time_employees": 360
    },
    "EFT.F": {
        "short_name": "TECHTARGET INC.",
        "long_name": "TechTarget, Inc.",
        "summary": "TechTarget, Inc., together with its subsidiaries, provides marketing and sales services that deliver business impact for enterprise technology companies in North America and internationally. It also provides purchase-intent marketing and sales services for enterprise technology vendors; and customized marketing programs that integrate demand generation and brand advertising techniques. The company offers online services, including IT Deal Alert, including priority engine, qualified sales opportunities, deal data services; demand solutions, such as white papers, webcasts, podcasts, videocasts, virtual trade shows, and content sponsorships; brand solutions comprise on-network, off-network, and microsites and related formats branding; and custom content creation. It also operates an integrated content platform that consists of a network of approximately 140 websites that focus on a specific IT sector, such as storage, security, networking, or business applications. In addition, the company enables registered members to conduct their pre-purchase research by accessing vendor supplied content through a websites network. TechTarget, Inc. was incorporated in 1999 and is headquartered in Newton, Massachusetts.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "MA",
        "city": "Newton",
        "zipcode": "02466",
        "website": "http://www.techtarget.com",
        "full_time_employees": 940
    },
    "EVER.MX": {
        "short_name": "EVERQUOTE INC",
        "long_name": "EverQuote, Inc.",
        "summary": "EverQuote, Inc. operates an online marketplace for insurance shopping in the United States. The company's online marketplace offers consumers shopping for auto, home and renters, life, health, and commercial insurance. It serves carriers and agents, as well as indirect distributors. The company was formerly known as AdHarmonics, Inc., and changed its name to EverQuote, Inc. in November 2014. EverQuote, Inc. was incorporated in 2008 and is based in Cambridge, Massachusetts.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "MA",
        "city": "Cambridge",
        "zipcode": "02139",
        "website": "http://www.everquote.com",
        "full_time_employees": 447
    },
    "EVER": {
        "short_name": "EverQuote, Inc.",
        "long_name": "EverQuote, Inc.",
        "summary": "EverQuote, Inc. operates an online marketplace for insurance shopping in the United States. The company's online marketplace offers consumers shopping for auto, home and renters, life, health, and commercial insurance. It serves carriers and agents, as well as indirect distributors. The company was formerly known as AdHarmonics, Inc., and changed its name to EverQuote, Inc. in November 2014. EverQuote, Inc. was incorporated in 2008 and is based in Cambridge, Massachusetts.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Cambridge",
        "zipcode": "02139",
        "website": "http://www.everquote.com",
        "full_time_employees": 450
    },
    "EWRC": {
        "short_name": "EWORLD COMPANIES INC",
        "long_name": "eWorld Companies, Inc.",
        "summary": "eWorld Companies, Inc. operates as an online marketing and advertising company. The company develops and markets technologies using media, flash, and 3D graphics. It owns the Boomerang Media Station, an online media distribution platform, as well as produces the events, the music, and the video content. The company is based in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": null,
        "full_time_employees": null
    },
    "FB.BA": {
        "short_name": "FACEBOOK INC",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FB.MI": {
        "short_name": "FACEBOOK",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MIL",
        "market": "it_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FB.MX": {
        "short_name": "FACEBOOK INC",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FB": {
        "short_name": "Facebook, Inc.",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FB.VI": {
        "short_name": "FACEBOOK INC-A",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FB2A.DE": {
        "short_name": "FACEBOOK INC.A DL-,000006",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FB2A.F": {
        "short_name": "FACEBOOK INC.A DL-,000006",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FBOK34.SA": {
        "short_name": "FACEBOOK    DRN",
        "long_name": "Facebook, Inc.",
        "summary": "Facebook, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. The company's products include Facebook that enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way. It also provides Facebook Reality Labs, an augmented and virtual reality product that help people feel connected, anytime, and anywhere. Facebook, Inc. was founded in 2004 and is headquartered in Menlo Park, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Menlo Park",
        "zipcode": "94025",
        "website": "http://investor.fb.com",
        "full_time_employees": 60654
    },
    "FMHS": {
        "short_name": "FARMHOUSE INC",
        "long_name": "Farmhouse, Inc",
        "summary": "Farmhouse, Inc. operates a platform for regulated cannabis industry. Its core product is the WeedClub, a social network platform that allows its members to digitally network with actual vetted cannabis industry stakeholders. Its platform serve professional cannabis and hemp industries, such as licensed growers, dispensers, laboratories, distributors, investors, accountants, lawyers, consultants, and others. The company was founded in 2014 and is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.weedclub.com",
        "full_time_employees": null
    },
    "G5NA.F": {
        "short_name": "GROUPON INC. DL-,0001",
        "long_name": "Groupon, Inc.",
        "summary": "Groupon, Inc. operates a marketplace that connects consumers to merchants. It operates in two segments, North America and International. The company sells goods or services on behalf of third-party merchants; and first-party goods inventory. It serves customers through its mobile applications and websites. The company was formerly known as ThePoint.com, Inc. and changed its name to Groupon, Inc. in October 2008. Groupon, Inc. was founded in 2008 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60654",
        "website": "http://www.groupon.com",
        "full_time_employees": 4159
    },
    "GA6.F": {
        "short_name": "GAIA INC. A  DL-,0001",
        "long_name": "Gaia, Inc.",
        "summary": "Gaia, Inc. operates a digital video subscription service and on-line community for underserved member base in the United States, Canada, Australia, and internationally. The company has a digital content library of approximately 8,000 titles in Spanish, German, and French languages available to its subscribers on internet-connected devices. The company's network includes Yoga channel, which offers access to yoga, eastern arts, and other movement based classes; Transformation channel that provides spiritual growth, personal development, and consciousness content; Alternative Healing channel, which features content focused on food and nutrition, holistic healing, alternative and integrative medicines, and longevity; and Seeking Truth channel that offers category-leading talent that enables to draw speakers, authors, and experts in the alternative media world. It also operates gaia.com and gaiamtv.com websites. Gaia, Inc. complements its produced and owned content through long term licensing agreements. The company was formerly known as Gaiam, Inc. and changed its name to Gaia, Inc. in July 2016. Gaia, Inc. was incorporated in 1988 and is headquartered in Louisville, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Louisville",
        "zipcode": "80027",
        "website": "http://www.gaia.com",
        "full_time_employees": 123
    },
    "GAIA": {
        "short_name": "Gaia, Inc.",
        "long_name": "Gaia, Inc.",
        "summary": "Gaia, Inc. operates a digital video subscription service and on-line community for underserved member base in the United States, Canada, Australia, and internationally. The company has a digital content library of approximately 8,000 titles in Spanish, German, and French languages available to its subscribers on internet-connected devices. The company's network includes Yoga channel, which offers access to yoga, eastern arts, and other movement based classes; Transformation channel that provides spiritual growth, personal development, and consciousness content; Alternative Healing channel, which features content focused on food and nutrition, holistic healing, alternative and integrative medicines, and longevity; and Seeking Truth channel that offers category-leading talent that enables to draw speakers, authors, and experts in the alternative media world. It also operates gaia.com and gaiamtv.com websites. Gaia, Inc. complements its produced and owned content through long term licensing agreements. The company was formerly known as Gaiam, Inc. and changed its name to Gaia, Inc. in July 2016. Gaia, Inc. was incorporated in 1988 and is headquartered in Louisville, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Louisville",
        "zipcode": "80027",
        "website": "http://www.gaia.com",
        "full_time_employees": 123
    },
    "GIFX": {
        "short_name": "GIFA INC",
        "long_name": "GIFA, Inc.",
        "summary": "GIFA, Inc. provides mobile and Internet marketing services to retailers primarily in India. The company offers text message advertising services to retailers through a mobile advertising platform that enables retailers to manage their advertising campaigns to its segmented database of consumers. It also provides training/certification/competition services consisting of the Primary Olympiad, an annual English, Math, and Science competency program and competition for young learners; spoken English classes; and English certification programs in partnership with non-governmental agencies and state governments. The company was formerly known as Firefish, Inc. and changed its name to GIFA, Inc. in October 2017. GIFA, Inc. was founded in 2008 and is based in San Diego, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Diego",
        "zipcode": "92180",
        "website": null,
        "full_time_employees": 1
    },
    "GOGL34.SA": {
        "short_name": "ALPHABET    DRN A",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOGL35.SA": {
        "short_name": "ALPHABET    DRN C",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOGY": {
        "short_name": "GOLDEN GRAIL TECHNOLOGY CORP",
        "long_name": "Golden Grail Technology Corp.",
        "summary": "Golden Grail Technology Corp. develops e-commerce sites. The company's sites offer various categories of products, such as jewelry, health and personal care, beauty, consumer electronics, pet/animal supplies, gifts, sports and outdoor, toys, and games and hobbies. Its portfolio of e-commerce sites includes bandsofvalor.com and aireomatic.com. The company was formerly known as Golden Energy Corp. and changed its name to Golden Grail Technology Corp. in December 2014. Golden Grail Technology Corp. was incorporated in 1985 and is based in Davie, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Davie",
        "zipcode": "33330",
        "website": "http://goldengrailtechnology.com",
        "full_time_employees": null
    },
    "GOOA.VI": {
        "short_name": "ALPHABET INC-CL A",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOC.VI": {
        "short_name": "ALPHABET INC-CL C",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOG.MX": {
        "short_name": "ALPHABET INC",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOG": {
        "short_name": "Alphabet Inc.",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOG.SN": {
        "short_name": "ALPHABET INC",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOGL.BA": {
        "short_name": "ALPHABET INC",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOGL.MX": {
        "short_name": "ALPHABET INC",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOGL": {
        "short_name": "Alphabet Inc.",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GOOGL.SN": {
        "short_name": "ALPHABET INC",
        "long_name": "Alphabet Inc.",
        "summary": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "CA",
        "city": "Mountain View",
        "zipcode": "94043",
        "website": "http://www.abc.xyz",
        "full_time_employees": 139995
    },
    "GRMM": {
        "short_name": "GROM SOCIAL ENTERPRISES INC",
        "long_name": "Grom Social Enterprises, Inc.",
        "summary": "Grom Social Enterprises, Inc., through its subsidiaries, operates as a media, technology, and entertainment company in the United States. The company operates a social media network for children under the age of 13 years. It also produces animated films and televisions series; and provides web filtering services to schools and government agencies. The company was founded in 2012 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Boca Raton",
        "zipcode": "33431",
        "website": "http://www.gromsocial.com",
        "full_time_employees": 89
    },
    "GRPN": {
        "short_name": "Groupon, Inc.",
        "long_name": "Groupon, Inc.",
        "summary": "Groupon, Inc. operates a marketplace that connects consumers to merchants. It operates in two segments, North America and International. The company sells goods or services on behalf of third-party merchants; and first-party goods inventory. It serves customers through its mobile applications and websites. The company was formerly known as ThePoint.com, Inc. and changed its name to Groupon, Inc. in October 2008. Groupon, Inc. was founded in 2008 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60654",
        "website": "http://www.groupon.com",
        "full_time_employees": 4159
    },
    "GRUB": {
        "short_name": "GrubHub Inc.",
        "long_name": "Grubhub Inc.",
        "summary": "Grubhub Inc., together with its subsidiaries, provides an online and mobile platform for restaurant pick-up and delivery orders in the United States. The company connects approximately 300,000 local restaurants with diners in various cities. It offers mobile applications and mobile Websites; and operates Websites through grubhub.com, seamless.com, and menupages.com. The company also provides corporate program that offers employees with various food and ordering options, including options for individual meals, group ordering, and catering, as well as proprietary tools that consolidate various food ordering into a single online account. In addition, it offers Grubhub for Restaurants, a responsive web application that can be accessed from computers and mobile devices, as well as Grubhub-provided tablets; GH+ subscription program to diners; delivery services to restaurants; point of sale (POS) integration, which allows restaurants to manage Grubhub orders and update their menus directly from their existing POS system; and Website and mobile application design and hosting services for restaurants, as well as technology and fulfillment services, including order transmission and customer relationship management tools. The company was formerly known as GrubHub Seamless Inc. and changed its name to Grubhub Inc. in February 2014. Grubhub Inc. was founded in 1999 and is headquartered in Chicago, Illinois.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60602",
        "website": "http://investors.grubhub.com/investors/overview/",
        "full_time_employees": 2841
    },
    "GRUB.VI": {
        "short_name": "GRUBHUB INC",
        "long_name": "Grubhub Inc.",
        "summary": "Grubhub Inc., together with its subsidiaries, provides an online and mobile platform for restaurant pick-up and delivery orders in the United States. The company connects approximately 300,000 local restaurants with diners in various cities. It offers mobile applications and mobile Websites; and operates Websites through grubhub.com, seamless.com, and menupages.com. The company also provides corporate program that offers employees with various food and ordering options, including options for individual meals, group ordering, and catering, as well as proprietary tools that consolidate various food ordering into a single online account. In addition, it offers Grubhub for Restaurants, a responsive web application that can be accessed from computers and mobile devices, as well as Grubhub-provided tablets; GH+ subscription program to diners; delivery services to restaurants; point of sale (POS) integration, which allows restaurants to manage Grubhub orders and update their menus directly from their existing POS system; and Website and mobile application design and hosting services for restaurants, as well as technology and fulfillment services, including order transmission and customer relationship management tools. The company was formerly known as GrubHub Seamless Inc. and changed its name to Grubhub Inc. in February 2014. Grubhub Inc. was founded in 1999 and is headquartered in Chicago, Illinois.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "IL",
        "city": "Chicago",
        "zipcode": "60602",
        "website": "http://investors.grubhub.com/investors/overview/",
        "full_time_employees": 2841
    },
    "I1AC34.SA": {
        "short_name": "IAC INTERACTDRN",
        "long_name": "IAC/InterActiveCorp",
        "summary": "IAC/InterActiveCorp operates as a media and internet company worldwide. The company offers digital marketplace service which connects consumers with service professionals for repairing, remodeling, cleaning, and landscaping solutions under the HomeAdvisor, Angie's List, and Handy brands; Vimeo, a cloud-based software platform for professionals, teams, and organizations to create, collaborate, and communicate with video; and Dotdash, a portfolio of digital publishing brands that provides information and inspiration in select vertical content categories, as well as provides original and engaging digital content in a various formats, including articles, illustrations, videos, and images. It also provides general search services; advertising-driven desktop applications; and desktop browser applications. The company operates various platforms, such as iTranslate that develops and distributes downloaded mobile translation applications for users to read, write, speak, and learn foreign languages anywhere in the world; TelTech that develops and distributes mobile communications applications to help protect consumer privacy; Daily Burn, a health and fitness business, which provides streaming fitness and workout videos across various platforms; Care.com, an online destination for families to connect with caregivers for their children, aging parents, pets, and homes; Bluecrew, a staffing platform for flexible W-2 work; The Daily Beast, a website dedicated to news, commentary, culture, and entertainment that publishes original reporting and opinion from its journalists and contributors; NurseFly, a platform to connect healthcare professionals with job opportunities; and IAC Films providers production and producer services for feature films, primarily for initial sale and distribution through theatrical releases and video-on-demand services. The company was formerly known as IAC HOLDINGS, INC. IAC/InterActiveCorp is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10011",
        "website": "http://www.iac.com",
        "full_time_employees": 8200
    },
    "IAC": {
        "short_name": "IAC/InterActiveCorp",
        "long_name": "IAC/InterActiveCorp",
        "summary": "IAC/InterActiveCorp operates as a media and internet company worldwide. The company offers digital marketplace service which connects consumers with service professionals for repairing, remodeling, cleaning, and landscaping solutions under the HomeAdvisor, Angie's List, and Handy brands; Vimeo, a cloud-based software platform for professionals, teams, and organizations to create, collaborate, and communicate with video; and Dotdash, a portfolio of digital publishing brands that provides information and inspiration in select vertical content categories, as well as provides original and engaging digital content in a various formats, including articles, illustrations, videos, and images. It also provides general search services; advertising-driven desktop applications; and desktop browser applications. The company operates various platforms, such as iTranslate that develops and distributes downloaded mobile translation applications for users to read, write, speak, and learn foreign languages anywhere in the world; TelTech that develops and distributes mobile communications applications to help protect consumer privacy; Daily Burn, a health and fitness business, which provides streaming fitness and workout videos across various platforms; Care.com, an online destination for families to connect with caregivers for their children, aging parents, pets, and homes; Bluecrew, a staffing platform for flexible W-2 work; The Daily Beast, a website dedicated to news, commentary, culture, and entertainment that publishes original reporting and opinion from its journalists and contributors; NurseFly, a platform to connect healthcare professionals with job opportunities; and IAC Films providers production and producer services for feature films, primarily for initial sale and distribution through theatrical releases and video-on-demand services. The company was formerly known as IAC HOLDINGS, INC. IAC/InterActiveCorp is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10011",
        "website": "http://www.iac.com",
        "full_time_employees": 8200
    },
    "IDLM": {
        "short_name": "IDLE MEDIA INC",
        "long_name": "Idle Media, Inc.",
        "summary": "Idle Media Inc. operates as an online media and entertainment company. It primarily owns and operates DatPiff, the source for new music and the collection of mixtapes on the Web. The company is based in Leesport, Pennsylvania. Idle Media, Inc. operates as a subsidiary of Zoeter, LLC.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Leesport",
        "zipcode": "19533",
        "website": "http://www.idlemedia.com",
        "full_time_employees": 11
    },
    "ILIM": {
        "short_name": "IL2M INTERNATIONAL CORP",
        "long_name": "IL2M International Corp",
        "summary": "il2m International Corp. operates as a music entertainment and social media company. The company develops, creates, and markets Ilink2music.com, a social media platform that allows users to unify their personal digital-mobile lifestyle while simultaneously providing exclusive international music entertainment content, networking, events, products, and services. Its platform enables the user to create a profile in the music entertainment zone that displays his/her talents or expertise. The company is based in Burbank, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91505",
        "website": "http://www.ilink2music.com",
        "full_time_employees": 3
    },
    "INTH": {
        "short_name": "INNOTECH CORP.",
        "long_name": "Innotech Corporation",
        "summary": "Innotech Corporation operates a financial news redistribution website. It also provides real time news alerts on US and Canadian stocks, mutual fund news and information alerts, insider trading, SEC filings, and IPO information. The company was formerly known as Equityalert.com, Inc. and changed its name to Innotech Corporation in July 2001. Innotech Corporation was incorporated in 1997 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89123",
        "website": null,
        "full_time_employees": 6
    },
    "ISHM": {
        "short_name": "INFOSEARCH MEDIA",
        "long_name": "InfoSearch Media, Inc.",
        "summary": "InfoSearch Media, Inc. provides search-targeted text and video content solutions in the United States. Its network of professional writers, editors, other technical specialists, and video production facilities enable businesses succeed on the Web by implementing text and video content-based Internet marketing solutions. The company's search marketing solutions involve online content that supports the non-paid search marketing initiatives of its clients. Nonpaid search results are those results that the search engines find on the worldwide Web as opposed to those listings for which companies pay for placement. Its solutions include TrafficBuilder Text, which delivers branded original content for use by the company's clients on their Web sites; ArticleInsider and Popdex Web sites, through which the company distributes traffic to advertisers; and TrafficBuilder Video, a search-targeted online video product. The company was founded in 2000 and is headquartered in Culver City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Culver City",
        "zipcode": "90230",
        "website": null,
        "full_time_employees": 30
    },
    "IZEA": {
        "short_name": "IZEA Worldwide, Inc.",
        "long_name": "IZEA Worldwide, Inc.",
        "summary": "IZEA Worldwide, Inc., together with its subsidiaries, creates and operates online marketplaces that connect marketers and content creators. Its technology solutions enable the management of content workflow, creator search and targeting, bidding, analytics, and payment processing. The company engages creator for influencer marketing campaigns, and to create content for the marketers' use and distribution. It primarily sells influencer marketing and content campaigns through sales team, as well as IZEAx Exchnage, BrandGraph, Shake, and TapInfluence platforms. The company was formerly known as IZEA, Inc. and changed its name to IZEA Worldwide, Inc. in August 2018. IZEA Worldwide, Inc. was founded in 2006 and is headquartered in Winter Park, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Winter Park",
        "zipcode": "32789",
        "website": "http://www.izea.com",
        "full_time_employees": 104
    },
    "KIWB": {
        "short_name": "KIWIBOX COM INC",
        "long_name": "Kiwibox.Com, Inc.",
        "summary": "Kiwibox.Com, Inc. owns and operates Kiwibox.com, a social networking Website. The company was formerly known as Magnitude Information Systems, Inc. and changed its name to Kiwibox.Com, Inc. in December 2009. Kiwibox.Com, Inc. was founded in 1988 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10036",
        "website": null,
        "full_time_employees": 2
    },
    "LBUY": {
        "short_name": "LEAFBUYER TECHNOLOGIES INC",
        "long_name": "Leafbuyer Technologies, Inc.",
        "summary": "Leafbuyer Technologies, Inc., through its subsidiary, LB Media Group, LLC, operates an online platform for cannabis deals and specials, and information that connects consumers with dispensaries in the United States. The company is headquartered in Greenwood Village, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80112",
        "website": "http://www.leafbuyer.com",
        "full_time_employees": null
    },
    "LDSI": {
        "short_name": "LIFE DESIGN STATION INTL INC",
        "long_name": "Life Design Station International, Inc.",
        "summary": "Life Design Station International, Inc., through its subsidiary, Life Design Station Japan, provides estate planning services in Japan. It also develops a national sales force that consists of financial planners stationed in various locations in Japan. The company has locations in Tokyo, Japan. Life Design Station International, Inc. is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90017",
        "website": null,
        "full_time_employees": null
    },
    "LEAF": {
        "short_name": "Leaf Group Ltd.",
        "long_name": "Leaf Group Ltd.",
        "summary": "Leaf Group Ltd., together with its subsidiaries, operates as a diversified consumer internet company worldwide. It operates in two segments, Marketplaces and Media. The Marketplaces segment offers Society6.com, which provides artists with an online commerce platform to feature and sell their original art and designs on consumer products in the wall art, home dÃ©cor, and tech and apparel accessories categories. It also provides SaatchiArt.com and its related art fair event brand, which is an online art gallery where a global community of artists exhibit and sell their original artwork directly to consumers. The Media segment offers Well+Good, a health and wellness media brand that offers journalistic approach to content; and Livestrong.com, a destination and action-oriented community, as well as mobile applications, such as MyPlate that monitor users' health, fitness, and life achievements. This segment also provides Hunker, a home design media site for enabling first-time homeowners enhance their homes with practical solutions, home tours, and design advice for people; and Only In Your State, a US-focused local attractions and review site, which highlights small businesses, hidden gems, and natural wonders for the audience. In addition, this segment offers content creation, traffic source, mobile application, and monetization services; and develops partner sites. It sells its products through wholesale channels to trade and hospitality clients, as well as through retail distribution partners. The company was formerly known as Demand Media, Inc. and changed its name to Leaf Group Ltd. in November 2016. Leaf Group Ltd. was incorporated in 2006 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.leafgroup.com",
        "full_time_employees": 360
    },
    "LHGI": {
        "short_name": "LIGHTHOUSE GLOBAL HOLDINGS INC",
        "long_name": "Lighthouse Global Holdings Inc.",
        "summary": "Lighthouse Global Holdings Inc. focuses on holding a portfolio of assets. It acquires, invests, and collaborates companies in various industries, including project development, sharing economy platform, distributed ledger technology, green technology, big data and AI, and property management and hospitality. The company was formerly known as WMAC Holdings Corporation and changed its name to Lighthouse Global Holdings Inc. in May 2018. Lighthouse Global Holdings Inc. is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89109",
        "website": "http://www.lhgincorp.com",
        "full_time_employees": null
    },
    "LIVC": {
        "short_name": "LIVE CURRENT MEDIA INC",
        "long_name": "Live Current Media Inc.",
        "summary": "Live Current Media Inc. operates as a digital technology company in the sports/gaming sector in the United States. It is developing SPRT MTRX, a gaming app that allows players bid on the final scores of NHL, NFL, and NBA games that is available in iPhone and Android versions. The company was formerly known as Communicate.com Inc. and changed its name to Live Current Media Inc. in May 2008. Live Current Media Inc. was founded in 1995 and is based in Reno, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Reno",
        "zipcode": "89501",
        "website": "http://www.livecurrent.com",
        "full_time_employees": null
    },
    "LKST": {
        "short_name": "LOOKSMART GROUP INC NEW",
        "long_name": "LookSmart Group, Inc.",
        "summary": "LookSmart Group, Inc. provides online search advertising services for advertisers and publishers. The company was founded in 1996 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10012",
        "website": "http://www.looksmart.com",
        "full_time_employees": 10
    },
    "LOCMQ": {
        "short_name": "LOCAL CORP",
        "long_name": "Local Corporation",
        "summary": "Local Corporation, a technology and advertising company, provides search results to consumers who search online for local businesses, products, and services in the United States. The company offers various local search advertising products and services comprising Local.com, a Website and app, which reaches approximately 20 million monthly unique visitors (MUVs); hosted network, a database of local business and product listings along with ad feeds, which consists of approximately 1,000 partner Websites and reaches approximately 5 million MUVs; syndication network, an ad feed solution; and display and pre-roll video networks that provide advertisers with additional reach and exposure for brands through distribution of customized display and pre-roll ads. It also provides pay-per-click, pay-per-call, and display ad units through its search results; and photographs, user ratings and reviews, video, coupons, hours of operations, and others to users of its Websites and network partner Websites, as well as third party partners. The company was formerly known as Local.com Corporation and changed its name to Local Corporation in September 2012. Local Corporation was founded in 1999 and is headquartered in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92618",
        "website": "http://www.localcorporation.com",
        "full_time_employees": 60
    },
    "LT0A.F": {
        "short_name": "LIBERTY TRIPADV. HLDGS A",
        "long_name": "Liberty TripAdvisor Holdings, Inc.",
        "summary": "Liberty TripAdvisor Holdings, Inc., through its subsidiaries, operates as an online travel company that connects travelers with travel partners. The company operates through two segments, Hotels, Media & Platform, and Experiences & Dining. Its travel platform provides content, price comparison tools, and online reservation and related services for destinations, accommodations, travel activities and experiences, and restaurants. The company owns and operates a portfolio of travel media brands and businesses, which offers travel-planning and trip-taking resources in the travel industry; and provides click-based, display-based, and subscription-based advertising services. It also operates Viator, a website that offers research, book, and experience activities and attractions in travel destinations; and TheFork, an online restaurant booking platform. Liberty TripAdvisor Holdings, Inc. was founded in 2013 and is headquartered in Englewood, Colorado.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertytripadvisorholdings.com",
        "full_time_employees": 2196
    },
    "LTCP": {
        "short_name": "LIFES TIME CAPSULE SERVICES INC",
        "long_name": "Life's Time Capsule Services, Inc.",
        "summary": "Life's Time Capsule Services, Inc. engages in the social media and online data storage space with services built to capture, preserve, and share customers' digital legacies for present and future generations to add to and pass along for centuries into the future. The company offers a secure personal data storage and social media service that enables its customers to build a digital legacy to be passed on to many generations into the future. It provides Individual, Family, and Entity Plans, which allow customers the opportunity to upload and safely store digital images, videos, voice recordings, personal journal entries, and various document types from its customers' desktop or mobile devices. The company was formerly known as Hyperera, Inc. and changed its name to Life's Time Capsule Services, Inc. in March 2017. The company was incorporated in 2008 and is headquartered in Newtown, Connecticut.",
        "currency": null,
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Newtown",
        "zipcode": "06470",
        "website": "http://www.lifestimecapsule.com",
        "full_time_employees": 17
    },
    "LTRPA": {
        "short_name": "Liberty TripAdvisor Holdings, I",
        "long_name": "Liberty TripAdvisor Holdings, Inc.",
        "summary": "Liberty TripAdvisor Holdings, Inc., through its subsidiaries, operates as an online travel company that connects travelers with travel partners. The company operates through two segments, Hotels, Media & Platform, and Experiences & Dining. Its travel platform provides content, price comparison tools, and online reservation and related services for destinations, accommodations, travel activities and experiences, and restaurants. The company owns and operates a portfolio of travel media brands and businesses, which offers travel-planning and trip-taking resources in the travel industry; and provides click-based, display-based, and subscription-based advertising services. It also operates Viator, a website that offers research, book, and experience activities and attractions in travel destinations; and TheFork, an online restaurant booking platform. Liberty TripAdvisor Holdings, Inc. was founded in 2013 and is headquartered in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertytripadvisorholdings.com",
        "full_time_employees": 2196
    },
    "LTRPB": {
        "short_name": "Liberty TripAdvisor Holdings, I",
        "long_name": "Liberty TripAdvisor Holdings, Inc.",
        "summary": "Liberty TripAdvisor Holdings, Inc., through its subsidiaries, operates as an online travel company that connects travelers with travel partners. The company operates through two segments, Hotels, Media & Platform, and Experiences & Dining. Its travel platform provides content, price comparison tools, and online reservation and related services for destinations, accommodations, travel activities and experiences, and restaurants. The company owns and operates a portfolio of travel media brands and businesses, which offers travel-planning and trip-taking resources in the travel industry; and provides click-based, display-based, and subscription-based advertising services. It also operates Viator, a website that offers research, book, and experience activities and attractions in travel destinations; and TheFork, an online restaurant booking platform. Liberty TripAdvisor Holdings, Inc. was founded in 2013 and is headquartered in Englewood, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Englewood",
        "zipcode": "80112",
        "website": "http://www.libertytripadvisorholdings.com",
        "full_time_employees": 2196
    },
    "M1TC34.SA": {
        "short_name": "MATCH GROUP DRN",
        "long_name": "Match Group, Inc.",
        "summary": "Match Group, Inc. provides dating products worldwide. The company's portfolio of brands includes Tinder, Match, Meetic, OkCupid, Hinge, Pairs, PlentyOfFish, and OurTime, as well as a various other brands. The company was incorporated in 1986 and is based in Dallas, Texas.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75231",
        "website": "http://www.mtch.com",
        "full_time_employees": 1880
    },
    "MARK": {
        "short_name": "Remark Holdings, Inc.",
        "long_name": "Remark Holdings, Inc.",
        "summary": "Remark Holdings, Inc. primarily focuses on the development and deployment of artificial-intelligence-based solutions for businesses and software developers. It owns and operates an e-commerce digital media property focuses on a luxury beach lifestyle. The company sells its AI-based products and services under the Remark AI brand in the United States; and under the KanKan brand in China. The company was incorporated in 2006 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89106",
        "website": "http://www.remarkholdings.com",
        "full_time_employees": 77
    },
    "MAX": {
        "short_name": "MediaAlpha, Inc.",
        "long_name": "MediaAlpha, Inc.",
        "summary": "MediaAlpha, Inc., through its subsidiaries, operates insurance customer acquisition platform in the United States. Its real-time customer acquisition and predictive analytics platform allows insurance carriers, distributors, and other clients to acquire customers and optimize customer acquisition in various verticals of property and casualty insurance, health insurance, and life insurance. The company was founded in 2014 and is headquartered in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90017",
        "website": "http://www.mediaalpha.com",
        "full_time_employees": 117
    },
    "MDAW": {
        "short_name": "MEDIA WAY CORPORATION",
        "long_name": "Media Way Corp.",
        "summary": "Media Way Corp. provides Web site design, hosting, online marketing, platforms for third party advertising and e-commerce for music artists and for its own entertainment destination site - amuZnet.com. Media Way designs, owns, hosts and maintains an integrated network of distinct types of entertainment based Web sites. Additionally, it produces exclusive new media content for the Internet, in audio and video form, which it is syndicating to several large Tier-1 partners. Some of the material is also produced with the view, to repurpose it for interactive satellite broadcasting and other broadband channels. Media Way has signed contracts with EchoStar (Dish Network) for the launch of an Interactive Satellite Entertainment Channel. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Los Angeles",
        "zipcode": "90016",
        "website": null,
        "full_time_employees": 29
    },
    "MRNJ": {
        "short_name": "METATRON INC",
        "long_name": "Metatron, Inc.",
        "summary": "Metatron, Inc. operates as a public digital content distribution and mobile app company. It engages in various business sectors, including online dating, credit card processing, next-gen relational database development, search engine advertising optimization, and mobile device applications. The company's i-Mobilize business provides digital content distribution services for various mobile device platforms. Its Just Data business operates as a processing service provider, which enables businesses and individuals to accept transactional payments through channels, such as Internet, broadband, wireless, call centers, and brick and mortar. The company's PB Magic business offers Web design and development, custom programming, database integration, and other Internet-related services, as well as advertising creation and management for SEO and pay-per-click campaigns. Metatron, Inc. is based in Dover, Delaware.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Dover",
        "zipcode": "19904",
        "website": "http://www.metatroninc.com",
        "full_time_employees": 3
    },
    "MSEZ": {
        "short_name": "MEDIA SENTIMENT INC",
        "long_name": "Media Sentiment, Inc.",
        "summary": "Media Sentiment, Inc. operates an online real-time alerts portal that provides news and information. Its portal provides real-time alerts on the U.S. equities, including OTC markets, and NYSE and NASDAQ; currencies, such as the U.S. dollar and more currencies; and commodities, such as metals. The company also provides live streaming real-time stock, currency, and metal charts. Media Sentiment, Inc. was founded in 2006 and is based in San Francisco, California. Media Sentiment, Inc. is a former subsidiary of Debut Broadcasting Corp., Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94102",
        "website": "http://www.mediasentiment.com",
        "full_time_employees": null
    },
    "MSMY": {
        "short_name": "MC ENDEAVORS INC",
        "long_name": "MC Endeavors, Inc.",
        "summary": "MC Endeavors, Inc. develops single core platform to produce, distribute, and monetize online communities for individuals and businesses to interact with industries ranging from industrial business to healthcare to entertainment. The company is based in Dana Point, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Dana Point",
        "zipcode": "92629",
        "website": null,
        "full_time_employees": 3
    },
    "MTC2.VI": {
        "short_name": "MATCH GROUP INC",
        "long_name": "Match Group, Inc.",
        "summary": "Match Group, Inc. provides dating products worldwide. The company's portfolio of brands includes Tinder, Match, Meetic, OkCupid, Hinge, Pairs, PlentyOfFish, and OurTime, as well as a various other brands. The company was incorporated in 1986 and is based in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75231",
        "website": "http://www.mtch.com",
        "full_time_employees": 1880
    },
    "MTCH": {
        "short_name": "Match Group, Inc.",
        "long_name": "Match Group, Inc.",
        "summary": "Match Group, Inc. provides dating products worldwide. The company's portfolio of brands includes Tinder, Match, Meetic, OkCupid, Hinge, Pairs, PlentyOfFish, and OurTime, as well as a various other brands. The company was incorporated in 1986 and is based in Dallas, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75231",
        "website": "http://www.mtch.com",
        "full_time_employees": 1880
    },
    "MVEN": {
        "short_name": "THEMAVEN INC",
        "long_name": "TheMaven, Inc.",
        "summary": "TheMaven, Inc. engages in software development and other operational activities. The company develops a proprietary online publishing platform that provides channel partners the ability to produce and manage editorially focused content and community interaction through tools and services; and proprietary advertising technology, techniques, and relationships that allow its channel partners to monetize online editorially focused content through various display and custom content advertising solutions and services. It also develops and operates a coalition of network of professionally managed online media channels on third party cloud platforms and data center hosting facilities. The company's channel partners publishes content and oversee an online community for its channels and leverages its proprietary technology platform to engage the collective audiences within a single network. Its channel partner joins the media-coalition by invitation-only and is drawn from premium media brands, professional journalists, subject matter experts, and social leaders. The company was incorporated in 1990 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10281",
        "website": "http://www.themaven.net",
        "full_time_employees": null
    },
    "NUGL": {
        "short_name": "NUGL INC",
        "long_name": "NUGL, Inc.",
        "summary": "VIBE I, Inc. was formerly known as New Vibe, Inc. and changed its name to VIBE I, Inc. in August 2015. The company was incorporated in 2015 and is headquartered in Chino Hills, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Chino Hills",
        "zipcode": "91709",
        "website": "http://www.nugl.com",
        "full_time_employees": null
    },
    "OTTV": {
        "short_name": "VIVA ENTERTAINMENT GROUP INC",
        "long_name": "Viva Entertainment Group Inc.",
        "summary": "Viva Entertainment Group Inc. develops and markets Internet protocol television over the top application for connected TV's, desktop computers, tablets, and smart phones. The company is based in Briarwood, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Briarwood",
        "zipcode": "11435",
        "website": "http://vivalivetv.net",
        "full_time_employees": 8
    },
    "PINS.MX": {
        "short_name": "PINTEREST INC",
        "long_name": "Pinterest, Inc.",
        "summary": "Pinterest, Inc. provides visual discovery engine in the United States and internationally. The company's engine allows people to find inspiration for their lives, including recipes, style and home inspiration, DIY, and others. It shows them visual recommendations based on people personal taste and interests. The company was formerly known as Cold Brew Labs Inc. and changed its name to Pinterest, Inc. in April 2012. Pinterest, Inc. was founded in 2008 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94107",
        "website": "http://www.pinterest.com",
        "full_time_employees": 2707
    },
    "PINS": {
        "short_name": "Pinterest, Inc.",
        "long_name": "Pinterest, Inc.",
        "summary": "Pinterest, Inc. provides visual discovery engine in the United States and internationally. The company's engine allows people to find inspiration for their lives, including recipes, style and home inspiration, DIY, and others. It shows them visual recommendations based on people personal taste and interests. The company was formerly known as Cold Brew Labs Inc. and changed its name to Pinterest, Inc. in April 2012. Pinterest, Inc. was founded in 2008 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94107",
        "website": "http://www.pinterest.com",
        "full_time_employees": 2707
    },
    "RAIO": {
        "short_name": "RADIOIO INC",
        "long_name": "Radioio, Inc.",
        "summary": "Radioio, Inc. operates an Internet media platform that provides streamed music to targeted audiences. Radioio broadcasts 140 streaming channels, and offers Internet radio services, including customized channels with various genres of music ranging from high-brow classical to acid rock. The company also provides a background music and messaging ecosystem for large franchise businesses and other vertical markets, such as retail, hospitality, and health and wellness. In addition, it offers Radioio live channels that stream live and pre-recorded talk radio content over the Internet to individual customers via advertising. The company was formerly known as ioWorldMedia, Incorporated and changed its name to Radioio, Inc. December 2013. Radioio, Inc. was incorporated in 1995 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10016",
        "website": null,
        "full_time_employees": null
    },
    "RBDC": {
        "short_name": "RBID.COM INC",
        "long_name": "RBID.com, Inc.",
        "summary": "RBID.com, Inc. operates as a financial information technology and marketing company. It involves in facilitating acquisitions, commercialization, and promotions for technology companies, which are underdeveloped, and have distressed patented and proprietary technologies. The company, through its subsidiary, GLA International, Inc., also operates as a direct sales company that offers healthy energy drinks, alkaline water systems, and superfoods. RBID.com, Inc. was formerly known as GCST, Inc. and changed the name to RBID.com, Inc. in April, 1999. The company was incorporated in 1988 and is based in Newport Beach, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Newport Beach",
        "zipcode": "92660",
        "website": null,
        "full_time_employees": 11
    },
    "RWRDP": {
        "short_name": "ICONSUMER CORP",
        "long_name": "iConsumer Corp.",
        "summary": "iConsumer Corp. operates a Website that offers cash back, deal coupons, savings, and crowd funded ownership with online purchases. It offers cash back, deal coupons, savings, and crowd funded ownership on various categories, including accessories, arts and crafts, automotive, babies and maternity, beauty, books and magazines, clothing, collectibles and novelties, computers, cooking and cookware, department stores, education, electronics, flowers, business solutions, garden and patio, gift cards, gifts, gourmet and grocery, green and eco-friendly, health, home, in-store pick-up, in-store redemption, jewelry and fragrances, kids and teens, medical supplies, music and movies, new stores, office, optical, pets, phones and calling plans, photography, services and finance, shoes, sports and outdoors, toys and games, and travel. The company is based in Miami Gardens, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "DE",
        "city": "Dover",
        "zipcode": "19904",
        "website": "http://www.iconsumer.com",
        "full_time_employees": null
    },
    "S3T.F": {
        "short_name": "SHUTTERSTOCK INC.  DL-,01",
        "long_name": "Shutterstock, Inc.",
        "summary": "Shutterstock, Inc., a technology company, provides content, and tools and services in North America, Europe, and internationally. It offers image services consisting of photographs, vectors, and illustrations, which is used in visual communications, such as Websites, digital and print marketing materials, corporate communications, books, publications, and others; footage services, including video clips, filmed by industry experts and cinema grade video effects, and HD and 4K formats that are integrated into Websites, social media, marketing campaigns, and cinematic productions; and music services comprising music tracks and sound effects, which are used to complement digital imagery. The company provides its services under the Shutterstock, Bigstock, Offset, Shutterstock Select, Shutterstock Custom, Shutterstock Editorial, Offset, PremiumBeat brand names, as well as Application programming interface, and Editor and Editor Pro tools to enhance workflow and project management needs, and search capabilities. It serves marketing professionals and organizations, media and broadcast companies, and small and medium-sized businesses through online platform. Shutterstock, Inc. was founded in 2003 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10118",
        "website": "http://www.shutterstock.com",
        "full_time_employees": 967
    },
    "S3T.SG": {
        "short_name": "Shutterstock Inc. Registered Sh",
        "long_name": "Shutterstock, Inc.",
        "summary": "Shutterstock, Inc., a technology company, provides content, and tools and services in North America, Europe, and internationally. It offers image services consisting of photographs, vectors, and illustrations, which is used in visual communications, such as Websites, digital and print marketing materials, corporate communications, books, publications, and others; footage services, including video clips, filmed by industry experts and cinema grade video effects, and HD and 4K formats that are integrated into Websites, social media, marketing campaigns, and cinematic productions; and music services comprising music tracks and sound effects, which are used to complement digital imagery. The company provides its services under the Shutterstock, Bigstock, Offset, Shutterstock Select, Shutterstock Custom, Shutterstock Editorial, Offset, PremiumBeat brand names, as well as Application programming interface, and Editor and Editor Pro tools to enhance workflow and project management needs, and search capabilities. It serves marketing professionals and organizations, media and broadcast companies, and small and medium-sized businesses through online platform. Shutterstock, Inc. was founded in 2003 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10118",
        "website": "http://www.shutterstock.com",
        "full_time_employees": 967
    },
    "SCOR": {
        "short_name": "comScore, Inc.",
        "long_name": "comScore, Inc.",
        "summary": "comScore, Inc. operates as an information and analytics company that measures advertising, consumer behavior, and audiences across media platforms worldwide. The company offers ratings and planning products and services, including Media Metrix Multi-Platform and Mobile Metrix, which measure Websites and apps on computers, smartphones, and tablets; Video Metrix that delivers measurement of digital video consumption; and Plan Metrix, which offers understanding of consumer lifestyle. Its ratings and planning products and services also comprises TV Essentials that combines TV viewing information with marketing segmentation and consumer databases; StationView Essentials to understand consumer viewing patterns and characteristics; Cross-Platform Suite, which integrates person-level linear TV viewership with digital audience data; and OnDemand Essentials that provides transactional tracking and reporting. In addition, its ratings and planning products comprise Comscore Campaign Ratings for verification of mobile and desktop video campaigns; validated Campaign Essentials, which validates whether digital ad impressions are visible to humans, identifies those that are fraudulent, and verifies that ads are shown in brand safe content and delivered to the right audience targets; and Total Home Panel Suite, which capture OTT, connected TV, and IOT device usage and content consumption. The company also offers analytics and optimization products and services that provide solutions for planning, optimization, and evaluation of advertising campaigns and brand protection. In addition, it offers movies reporting and analytics products and services to measure movie viewership and box office results by capturing movie ticket sales in real time or near real time. It serves digital publishers, television networks, movie studios, content owners, brand advertisers, agencies, and technology providers. The company was incorporated in 1999 and is headquartered in Reston, Virginia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Reston",
        "zipcode": "20190",
        "website": "http://www.comscore.com",
        "full_time_employees": 1246
    },
    "SEEK": {
        "short_name": "THEDIRECTORY.COM",
        "long_name": "TheDirectory.com, Inc",
        "summary": "TheDirectory.com, Inc. operates as an online local search and directory company in the United States. The company owns and operates a network of online local business directories and city guides, which provide business listings, directory information, and user generated reviews to consumers, who are searching online for services from local businesses through its business search engine, TheDirectory.com. It also operates various vertically targeted directories, such as Podiatrist.net, Chiropractor.net, 123HomeRepair.com, and DentistAppointments.com; and a network of Hello branded city guides, such as HelloNewYorkCity.com, HelloChicago.com, HelloMiami.com, and other guides. In addition, the company provides a suite of online marketing and branding solutions comprising search engine marketing, display advertising, Web presence, and online media and social networking products, as well as designs, develops, and deploys custom-built search engine optimized business Websites. It primarily serves small-and medium-sized businesses, advertisers focused on the local market, agencies, and resellers. The company was formerly known as Elysium Internet, Inc. and changed its name to TheDirectory.com, Inc. in May 2011. The company is based in Tampa, Florida. TheDirectory.com, Inc. is a subsidiary of FTS Group, Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33694",
        "website": "http://www.thedirectory.com",
        "full_time_employees": 14
    },
    "SLNM": {
        "short_name": "SALON MEDIA GROUP INC",
        "long_name": "Salon Media Group, Inc.",
        "summary": "Salon Media Group, Inc., an Internet media company, operates an online news Website in the United States. It produces a content Website with various subject-specific sections. The company's Salon.com Website features various voices and perspectives; and covers a range of topics, including news, politics, race, religion, culture, entertainment, sustainability, economy and innovation, technology, and business, as well as food, and health and science. Salon Media Group, Inc. was founded in 1995 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94102",
        "website": "http://www.salon.com",
        "full_time_employees": 24
    },
    "SNAP.BA": {
        "short_name": "SNAP INC",
        "long_name": "Snap Inc.",
        "summary": "Snap Inc. operates as a camera company in the United States and internationally. The company offers Snapchat, a camera application with functionalities, such as Camera, Communication, Snap Map, Stories, and Spotlight that enable people to communicate through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures video from a human perspective; and advertising products, including AR and Snap ads. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90405",
        "website": "http://www.snap.com",
        "full_time_employees": 3863
    },
    "SNAP.MX": {
        "short_name": "SNAP INC",
        "long_name": "Snap Inc.",
        "summary": "Snap Inc. operates as a camera company in the United States and internationally. The company offers Snapchat, a camera application with functionalities, such as Camera, Communication, Snap Map, Stories, and Spotlight that enable people to communicate through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures video from a human perspective; and advertising products, including AR and Snap ads. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90405",
        "website": "http://www.snap.com",
        "full_time_employees": 3863
    },
    "SNAP": {
        "short_name": "Snap Inc.",
        "long_name": "Snap Inc.",
        "summary": "Snap Inc. operates as a camera company in the United States and internationally. The company offers Snapchat, a camera application with functionalities, such as Camera, Communication, Snap Map, Stories, and Spotlight that enable people to communicate through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures video from a human perspective; and advertising products, including AR and Snap ads. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90405",
        "website": "http://www.snap.com",
        "full_time_employees": 3863
    },
    "SNAP.VI": {
        "short_name": "SNAP INC",
        "long_name": "Snap Inc.",
        "summary": "Snap Inc. operates as a camera company in the United States and internationally. The company offers Snapchat, a camera application with functionalities, such as Camera, Communication, Snap Map, Stories, and Spotlight that enable people to communicate through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures video from a human perspective; and advertising products, including AR and Snap ads. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90405",
        "website": "http://www.snap.com",
        "full_time_employees": 3863
    },
    "SSTK": {
        "short_name": "Shutterstock, Inc.",
        "long_name": "Shutterstock, Inc.",
        "summary": "Shutterstock, Inc., a technology company, provides content, and tools and services in North America, Europe, and internationally. It offers image services consisting of photographs, vectors, and illustrations, which is used in visual communications, such as Websites, digital and print marketing materials, corporate communications, books, publications, and others; footage services, including video clips, filmed by industry experts and cinema grade video effects, and HD and 4K formats that are integrated into Websites, social media, marketing campaigns, and cinematic productions; and music services comprising music tracks and sound effects, which are used to complement digital imagery. The company provides its services under the Shutterstock, Bigstock, Offset, Shutterstock Select, Shutterstock Custom, Shutterstock Editorial, Offset, PremiumBeat brand names, as well as Application programming interface, and Editor and Editor Pro tools to enhance workflow and project management needs, and search capabilities. It serves marketing professionals and organizations, media and broadcast companies, and small and medium-sized businesses through online platform. Shutterstock, Inc. was founded in 2003 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10118",
        "website": "http://www.shutterstock.com",
        "full_time_employees": 967
    },
    "T1WL34.SA": {
        "short_name": "TWILIO INC  DRN",
        "long_name": "Twilio Inc.",
        "summary": "Twilio Inc., together with its subsidiaries, provides a cloud communications platform that enables developers to build, scale, and operate customer engagement within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, video, and email capabilities into their applications. The company was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.twilio.com",
        "full_time_employees": 4629
    },
    "THRY": {
        "short_name": "Thryv Holdings, Inc.",
        "long_name": "Thryv Holdings, Inc.",
        "summary": "Thryv Holdings, Inc. provides print and digital marketing solutions to small-to-medium sized businesses, and Software as a Service (SaaS) business management tools in the United States. The company operates in two segments, Marketing Services and SaaS. It prints yellow pages that are co-branded with various local telephone service providers. The company also offers Internet yellow pages services, including the creation of clients' business profile that primarily displayed and operated on Yellowpages.com, Superpages.com, and Dexknows.com platforms; search engine marketing solutions; and other digital media solutions, such as online display advertising, search engine optimization (SEO), and websites. In addition, it provides Thryv, a SMB business management platform; Thryv Leads solution is an add-on to the Thryv platform. The company was formerly known as Dex Media Holdings, Inc. and changed its name to Thryv Holdings, Inc. in July 2019. Thryv Holdings, Inc. is based in DFW Airport, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "DFW Airport",
        "zipcode": "75261",
        "website": "http://www.thryv.com",
        "full_time_employees": 2309
    },
    "TRUE": {
        "short_name": "TrueCar, Inc.",
        "long_name": "TrueCar, Inc.",
        "summary": "TrueCar, Inc. operates as an internet-based information, technology, and communication services company in the United States. It operates its platform on the TrueCar website and mobile applications. Its platform enables users to obtain market-based pricing data on new and used cars, and to connect with its network of TrueCar certified dealers. The company also offers forecast and consulting services regarding determination of the residual value of an automobile at given future points in time, which are used to underwrite automotive loans and leases, and by financial institutions to measure exposure and risk across loan, lease, and fleet portfolios. In addition, it provides accurate, geographically specific, and real-time pricing information for consumers and dealers; TrueCar Trade, which gives consumers information on the value of their trade-in vehicles and enables them to obtain a guaranteed trade-in price before setting foot in the dealership; DealerSync, a dealer website creation and management service and a software platform that assists dealers in managing, marketing, and growing their business; and DealerScience that provides dealers with advanced digital retailing software tools. Further, the company customizes and operates its platform for financial institutions, membership-based organizations, and large enterprises. The company was formerly known as Zag.com Inc. TrueCar, Inc. was incorporated in 2005 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90401",
        "website": "http://www.truecar.com",
        "full_time_employees": 435
    },
    "TTGT": {
        "short_name": "TechTarget, Inc.",
        "long_name": "TechTarget, Inc.",
        "summary": "TechTarget, Inc., together with its subsidiaries, provides marketing and sales services that deliver business impact for enterprise technology companies in North America and internationally. It also provides purchase-intent marketing and sales services for enterprise technology vendors; and customized marketing programs that integrate demand generation and brand advertising techniques. The company offers online services, including IT Deal Alert, including priority engine, qualified sales opportunities, deal data services; demand solutions, such as white papers, webcasts, podcasts, videocasts, virtual trade shows, and content sponsorships; brand solutions comprise on-network, off-network, and microsites and related formats branding; and custom content creation. It also operates an integrated content platform that consists of a network of approximately 140 websites that focus on a specific IT sector, such as storage, security, networking, or business applications. In addition, the company enables registered members to conduct their pre-purchase research by accessing vendor supplied content through a websites network. TechTarget, Inc. was incorporated in 1999 and is headquartered in Newton, Massachusetts.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "MA",
        "city": "Newton",
        "zipcode": "02466",
        "website": "http://www.techtarget.com",
        "full_time_employees": 940
    },
    "TWH.F": {
        "short_name": "TWILIO INC.",
        "long_name": "Twilio Inc.",
        "summary": "Twilio Inc., together with its subsidiaries, provides a cloud communications platform that enables developers to build, scale, and operate customer engagement within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, video, and email capabilities into their applications. The company was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.twilio.com",
        "full_time_employees": 4629
    },
    "TWLO.MX": {
        "short_name": "TWILIO INC",
        "long_name": "Twilio Inc.",
        "summary": "Twilio Inc., together with its subsidiaries, provides a cloud communications platform that enables developers to build, scale, and operate customer engagement within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, video, and email capabilities into their applications. The company was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.twilio.com",
        "full_time_employees": 4629
    },
    "TWLO": {
        "short_name": "Twilio Inc.",
        "long_name": "Twilio Inc.",
        "summary": "Twilio Inc., together with its subsidiaries, provides a cloud communications platform that enables developers to build, scale, and operate customer engagement within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, video, and email capabilities into their applications. The company was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.twilio.com",
        "full_time_employees": 5482
    },
    "TWLO.VI": {
        "short_name": "TWILIO INC - A",
        "long_name": "Twilio Inc.",
        "summary": "Twilio Inc., together with its subsidiaries, provides a cloud communications platform that enables developers to build, scale, and operate customer engagement within software applications in the United States and internationally. Its customer engagement platform provides a set of application programming interfaces that handle the higher-level communication logic needed for nearly every type of customer engagement, as well as enable developers to embed voice, messaging, video, and email capabilities into their applications. The company was incorporated in 2008 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.twilio.com",
        "full_time_employees": 4629
    },
    "TWR.DE": {
        "short_name": "TWITTER INC.  DL-,000005",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "TWR.F": {
        "short_name": "TWITTER INC.  DL-,000005",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "TWTR.BA": {
        "short_name": "TWITTER INC",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "TWTR.MX": {
        "short_name": "TWITTER INC",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "TWTR": {
        "short_name": "Twitter, Inc.",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "TWTR.VI": {
        "short_name": "TWITTER INC",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "TWTR34.SA": {
        "short_name": "TWITTER     DRN",
        "long_name": "Twitter, Inc.",
        "summary": "Twitter, Inc. operates as a platform for public self-expression and conversation in real time United States, Japan, and internationally. The company offers Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products and services, such as promoted tweets, promoted accounts, and promoted trends, which enable its advertisers to promote their brands, products, and services. In addition, the company offers MoPub, a mobile-focused advertising exchange that combines ad serving, ad network mediation, and a real-time bidding exchange into one monetization platform; Twitter Audience platform, an advertising offering that enables advertisers to extend advertising campaigns; Developer and Enterprise solutions, a software-as-a-service platform that enables developers to build products on Twitter; and paid enterprise access for its public data streams. Twitter, Inc. was founded in 2006 and is headquartered in San Francisco, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94103",
        "website": "http://www.twitter.com",
        "full_time_employees": 6100
    },
    "VMSI": {
        "short_name": "VITA MOBILE SYSTEMS INC",
        "long_name": "Vita Mobile Systems, Inc.",
        "summary": "Vita Mobile Systems, Inc. designs and develops an application that focuses on digital imaging and technology in mobile devices. Its products include VITA, a geolocation-based social media application that allows to illustrating, record, and sharing life's events. The VITA community empowers its users to experience an event or view a location from a multitude of perspectives. Vita Mobile Systems, Inc. provides proprietary algorithms and tools that gather, categorize, analyze, and augment digital content. Vita Mobile Systems, Inc. was formerly known as Gold Mining USA, Inc. and changed its name to Vita Mobile Systems, Inc. in January, 2018. The company was incorporated in 1995 and is based in Irvine, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92614",
        "website": "http://www.vitamobilesystems.com",
        "full_time_employees": null
    },
    "WIKI.CN": {
        "short_name": "WikileafTech",
        "long_name": "Wikileaf Technologies Inc.",
        "summary": "Wikileaf Technologies Inc. operates a price comparison platform for recreational and medicinal cannabis consumers. It owns and operates wikileaf.com, a price comparison site that help cannabis consumers in finding location-based pricing information about individual marijuana strains and products. The company was founded in 2014 and is based in Seattle, Washington. Wikileaf Technologies Inc. is a subsidiary of Nesta Holding Co. Ltd.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98122",
        "website": "http://www.wikileaf.com",
        "full_time_employees": null
    },
    "WLYW": {
        "short_name": "WALLY WORLD MEDIA INC",
        "long_name": "Wally World Media, Inc.",
        "summary": "Wally World Media, Inc. focuses on the creation of an Internet crowdsourcing, virtual, and micro-service network. It intends to allow the registered users on the company's Website to job offerings for a service on its Youpop platform, a social media Website, as well as to post events, such as a bachelor party or anniversary on its Party Crowd platform. It also offers reShoot, a mobile video camera app for Apple's iPhone and iPad, which allows users to pause recordings, live preview of videos, record new footage into existing videos, and insert clips from the camera roll. The company was founded in 2012 and is based in New Brunswick, New Jersey.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "New Brunswick",
        "zipcode": "08901",
        "website": null,
        "full_time_employees": 5
    },
    "Y9L.F": {
        "short_name": "YELP INC.  DL-,000001",
        "long_name": "Yelp Inc.",
        "summary": "Yelp Inc. operates a platform that connects consumers with local businesses in the United States and internationally. The company's platform covers various local business categories, including restaurants, shopping, beauty and fitness, health, and other categories, as well as home, local, auto, professional, pets, events, real estate, and financial services. It provides free and paid advertising products to businesses, which include cost-per-click search advertising and multi-location ad products, as well as enables businesses to deliver targeted search advertising to local audiences; and business listing page products. The company also offers other services comprising Yelp Reservations that provide online reservations for restaurants, nightlife, and other venues directly from their Yelp business listing pages; Yelp Waitlist, a subscription-based waitlist management solution that allows consumers to check wait times and join waitlists remotely, as well as businesses to manage seating and server rotation; Yelp Knowledge program that offers business owners local analytics and insights through access to its historical data and other proprietary content; and Yelp Fusion, which offers free and paid access to content and data for consumer-facing enterprise use through publicly available APIs. In addition, it provides content licensing, as well as allows third-party data providers to update and manage business listing information on behalf of businesses. The company offers its products directly through its sales force; indirectly through partners; and online through its website, as well as non-advertising partner arrangements. It has strategic partnership with Grubhub for providing consumers with a service to place food orders for pickup and delivery. Yelp Inc. was incorporated in 2004 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.yelp.com",
        "full_time_employees": 3900
    },
    "YELP.BA": {
        "short_name": "YELP INC",
        "long_name": "Yelp Inc.",
        "summary": "Yelp Inc. operates a platform that connects consumers with local businesses in the United States and internationally. The company's platform covers various local business categories, including restaurants, shopping, beauty and fitness, health, and other categories, as well as home, local, auto, professional, pets, events, real estate, and financial services. It provides free and paid advertising products to businesses, which include cost-per-click search advertising and multi-location ad products, as well as enables businesses to deliver targeted search advertising to local audiences; and business listing page products. The company also offers other services comprising Yelp Reservations that provide online reservations for restaurants, nightlife, and other venues directly from their Yelp business listing pages; Yelp Waitlist, a subscription-based waitlist management solution that allows consumers to check wait times and join waitlists remotely, as well as businesses to manage seating and server rotation; Yelp Knowledge program that offers business owners local analytics and insights through access to its historical data and other proprietary content; and Yelp Fusion, which offers free and paid access to content and data for consumer-facing enterprise use through publicly available APIs. In addition, it provides content licensing, as well as allows third-party data providers to update and manage business listing information on behalf of businesses. The company offers its products directly through its sales force; indirectly through partners; and online through its website, as well as non-advertising partner arrangements. It has strategic partnership with Grubhub for providing consumers with a service to place food orders for pickup and delivery. Yelp Inc. was incorporated in 2004 and is headquartered in San Francisco, California.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.yelp.com",
        "full_time_employees": 3900
    },
    "YELP": {
        "short_name": "Yelp Inc.",
        "long_name": "Yelp Inc.",
        "summary": "Yelp Inc. operates a platform that connects consumers with local businesses in the United States and internationally. The company's platform covers various local business categories, including restaurants, shopping, beauty and fitness, health, and other categories, as well as home, local, auto, professional, pets, events, real estate, and financial services. It provides free and paid advertising products to businesses, which include cost-per-click search advertising and multi-location ad products, as well as enables businesses to deliver targeted search advertising to local audiences; and business listing page products. The company also offers other services comprising Yelp Reservations that provide online reservations for restaurants, nightlife, and other venues directly from their Yelp business listing pages; Yelp Waitlist, a subscription-based waitlist management solution that allows consumers to check wait times and join waitlists remotely, as well as businesses to manage seating and server rotation; Yelp Knowledge program that offers business owners local analytics and insights through access to its historical data and other proprietary content; and Yelp Fusion, which offers free and paid access to content and data for consumer-facing enterprise use through publicly available APIs. In addition, it provides content licensing, as well as allows third-party data providers to update and manage business listing information on behalf of businesses. The company offers its products directly through its sales force; indirectly through partners; and online through its website, as well as non-advertising partner arrangements. It has strategic partnership with Grubhub for providing consumers with a service to place food orders for pickup and delivery. Yelp Inc. was incorporated in 2004 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.yelp.com",
        "full_time_employees": 3900
    },
    "YELP.VI": {
        "short_name": "YELP INC",
        "long_name": "Yelp Inc.",
        "summary": "Yelp Inc. operates a platform that connects consumers with local businesses in the United States and internationally. The company's platform covers various local business categories, including restaurants, shopping, beauty and fitness, health, and other categories, as well as home, local, auto, professional, pets, events, real estate, and financial services. It provides free and paid advertising products to businesses, which include cost-per-click search advertising and multi-location ad products, as well as enables businesses to deliver targeted search advertising to local audiences; and business listing page products. The company also offers other services comprising Yelp Reservations that provide online reservations for restaurants, nightlife, and other venues directly from their Yelp business listing pages; Yelp Waitlist, a subscription-based waitlist management solution that allows consumers to check wait times and join waitlists remotely, as well as businesses to manage seating and server rotation; Yelp Knowledge program that offers business owners local analytics and insights through access to its historical data and other proprietary content; and Yelp Fusion, which offers free and paid access to content and data for consumer-facing enterprise use through publicly available APIs. In addition, it provides content licensing, as well as allows third-party data providers to update and manage business listing information on behalf of businesses. The company offers its products directly through its sales force; indirectly through partners; and online through its website, as well as non-advertising partner arrangements. It has strategic partnership with Grubhub for providing consumers with a service to place food orders for pickup and delivery. Yelp Inc. was incorporated in 2004 and is headquartered in San Francisco, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94105",
        "website": "http://www.yelp.com",
        "full_time_employees": 3900
    },
    "Z.MX": {
        "short_name": "ZILLOW GROUP INC",
        "long_name": "Zillow Group, Inc.",
        "summary": "Zillow Group, Inc., a digital real estate company, operates real estate brands on mobile applications and websites in the United States. It operates through three segments: Homes; Internet, Media & Technology; and Mortgages. The company's mobile applications and websites offer various real estate transactions and related services, including buying, selling, renting, and financing services for residential real estate properties; purchase and sell homes; offer title and escrow services, title insurance products and services, and mortgage loans. Its portfolio of brands include Zillow, Zillow Offers, Zillow Closing Services, Zillow Home Loans, Trulia, StreetEasy, and HotPads. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.zillowgroup.com",
        "full_time_employees": 5504
    },
    "Z": {
        "short_name": "Zillow Group, Inc.",
        "long_name": "Zillow Group, Inc.",
        "summary": "Zillow Group, Inc., a digital real estate company, operates real estate brands on mobile applications and websites in the United States. It operates through three segments: Homes; Internet, Media & Technology; and Mortgages. The company's mobile applications and websites offer various real estate transactions and related services, including buying, selling, renting, and financing services for residential real estate properties; purchase and sell homes; offer title and escrow services, title insurance products and services, and mortgage loans. Its portfolio of brands include Zillow, Zillow Offers, Zillow Closing Services, Zillow Home Loans, Trulia, StreetEasy, and HotPads. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.zillowgroup.com",
        "full_time_employees": 5868
    },
    "ZG": {
        "short_name": "Zillow Group, Inc.",
        "long_name": "Zillow Group, Inc.",
        "summary": "Zillow Group, Inc., a digital real estate company, operates real estate brands on mobile applications and websites in the United States. It operates through three segments: Homes; Internet, Media & Technology; and Mortgages. The company's mobile applications and websites offer various real estate transactions and related services, including buying, selling, renting, and financing services for residential real estate properties; purchase and sell homes; offer title and escrow services, title insurance products and services, and mortgage loans. Its portfolio of brands include Zillow, Zillow Offers, Zillow Closing Services, Zillow Home Loans, Trulia, StreetEasy, and HotPads. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Seattle",
        "zipcode": "98101",
        "website": "http://www.zillowgroup.com",
        "full_time_employees": 5868
    },
    "ZONX": {
        "short_name": "ZONZIA MEDIA INC",
        "long_name": "Zonzia Media, Inc.",
        "summary": "Zonzia Media, Inc. operates as a multi-platform entertainment company in the United States. It focuses on content development and multi-platform content distribution, advertising, and ecommerce activities. The company was formerly known as Hdimax Media, Inc. and changed its name to Zonzia Media, Inc. in March 2015. Zonzia Media, Inc. was founded in 2014 and is based in Henderson, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Henderson",
        "zipcode": "89052",
        "website": "http://www.zonzia.com",
        "full_time_employees": 3
    }
}