{
    "0802.HK": {
        "short_name": "CHINA E-WALLET",
        "long_name": "China e-Wallet Payment Group Limited",
        "summary": "China e-Wallet Payment Group Limited, an investment holding company, primarily engages in Internet and mobile's application and related accessories business in Hong Kong and other Asian countries. The company operates in two segments, Internet and Mobile's Application and Related Accessories; and Trading of Security & Biometric Products. The Internet and Mobile's Application and Related Accessories segment operates in the mobile payment platform and gaming industry. It provides application development for merchants; online gaming and utilities applications for mobile platform; and mass advertising services. The Trading of Security and Biometric Products segment offers biometrics and RFID products for consumer applications. It sells its products to distributors, system integrators, and security system providers. The company also invests in financial assets; develops hardware and software products; provides consultancy services; and develops Internet and Web software products, and computer systems. The company was formerly known as RCG Holdings Limited and changed its name to China e-Wallet Payment Group Limited in February 2017. China e-Wallet Payment Group Limited was founded in 1999 and is headquartered in Petaling Jaya, Malaysia.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    },
    "5CP.SI": {
        "short_name": "Silverlake Axis",
        "long_name": "Silverlake Axis Ltd",
        "summary": "Silverlake Axis Ltd, an investment holding company, provides software solutions and services to the banking, insurance, retail, government, payment, and logistics industries. Its products include Silverlake Axis integrated banking solutions, Silverlake Axis integrated Islamic banking solutions, Silverlake Axis integrated provident fund systems, Silverlake Axis cards systems, Silverlake digital banking MÃ\u0096BIUS open banking platforms, Silverlake Axis retail merchandising systems, Silverlake Axis enterprise payment platforms, Cyber Village converged Internet and mobile platforms, and Silverlake Symmetri retail banking solutions; IntelliSuite solutions; NowSuite solutions; and digital identity and security software solutions. The company also offers software project customization and implementation services to deliver end-to-end banking, payment, retail, digital identity, and security software solutions; software maintenance support and enhancement services; processing services for credit cards and other credit products on an outsourcing basis; and cloud computing software-as-a service platform for policy origination and claim processing for the insurance industry, as well as sells software and hardware products, including the resale of IBM hardware products and related system software. In addition, it engages in the commercialization of software-as-a-service solutions for the automotive industry; and provision of Internet and mobile, portal, customer loyalty, and e-commerce solutions and services. Silverlake Axis Ltd operates in South East Asia, North East Asia, South Asia, the Middle East, the Americas, Africa, and Europe. The company was founded in 1989 and is headquartered in Petaling Jaya, Malaysia. Silverlake Axis Ltd is a subsidiary of Intelligentsia Holding Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    },
    "8611.HK": {
        "short_name": "MINDTELL TECH",
        "long_name": "Mindtell Technology Limited",
        "summary": "Mindtell Technology Limited, an investment holding company, provides information technology (IT) services in Malaysia and Singapore. It operates through System Integration and Development Services, IT Outsourcing Services, and Maintenance and Consultancy Services segments. It is involved in the design, procurement, installation, and maintenance of customized system applications for corporate customers. The company primarily serves banks and financial institutions, government and statutory bodies, educational institutions, IT service firms, software principals, and other small and medium enterprises. Mindtell Technology Limited was founded in 2006 and is headquartered in Subang Jaya, Malaysia.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "city": "Subang Jaya"
    },
    "BDIC": {
        "short_name": "BLOW & DRIVE INTERLOCK CORP",
        "long_name": "Blow & Drive Interlock Corporation",
        "summary": "Blow & Drive Interlock Corporation, through its subsidiaries, operates an eSports platform in Malaysia. The company provides www.Matchroom.net., an integrated e-sports tournament site that allows tournament organizers, brands, players, and game developers to organize e-sports tournaments on platform utilizing platform tools, such as user registrations, payments, communications, lives tream link ups, wallet system, and other community features. It also offers information technology, mobile application development, and digital content publishing services. Blow & Drive Interlock Corporation is based in Petaling Jaya, Malaysia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    },
    "DKGH": {
        "short_name": "DKG CAPITAL INC",
        "long_name": "DKG Capital, Inc.",
        "summary": "DKG Capital, Inc. provides tokenization and other software solutions in the Asia Pacific region. The company was formerly known as Star Ally, Inc. DKG Capital, Inc. was founded in 2013 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "E28.SI": {
        "short_name": "Frencken",
        "long_name": "Frencken Group Limited",
        "summary": "Frencken Group Limited, an investment holding company, operates as a capital and consumer equipment service provider worldwide. It operates in two segments, Mechatronics and Integrated Manufacturing Services (IMS). The Mechatronics segment designs, develops, and produces precision-engineered systems and machines, electromechanical assemblies, and high precision parts and components for original equipment manufacturers. It offers integrated one-stop outsourcing solutions, such as product design, development, and prototyping; project management and engineering support; strategic purchasing and sourcing; high precision parts and components manufacturing; final test and assembly of modules and complete systems/machines; and product life cycle management. This segment serves medical, semiconductor, analytical, and industrial/factory automation industries. The IMS segment provides integrated contract design and manufacturing services to the automotive, office automation, and consumer and industrial electronics industries. This segment offers a range of outsourcing services, including mechanical and electronic design and engineering support; tooling design and manufacture; plastic injection molded parts and components; printed circuit board assemblies; and final test and assembly of modules and box build products. The company also provides program and supply chain management services; modular and equipment system assembly, integration, testing, and commissioning services; and vacuum coating, thermal treatment, and other related services for plastic components. In addition, it manufactures sheet metal parts and dies; designs, engineers, manufactures, and sells oil filters; manufactures and distributes plastic products and components; designs and trades in micro-mechanical product components for automotive industry; and sells machines, as well as holds properties. Frencken Group Limited was founded in 1995 and is based in George Town, Malaysia.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Georgetown"
    },
    "MBO.L": {
        "short_name": "MOBILITYONE LIMITED ORD 2.5P",
        "long_name": "MobilityOne Limited",
        "summary": "MobilityOne Limited, an investment holding company, provides e-commerce infrastructure payment solutions and platforms through its proprietary technology solutions in Malaysia. The company operates in two segments, Telecommunication Services and Electronic Commerce Solutions; and Hardware. It offers payment terminals for retailers, which enables bill payments, mobile and e-games top-ups, loan repayments, credit and ATM card payments, cashbacks, and e-wallets payments; mobile payment applications; and payment solution products and services, such as bill and loan collection, e-voucher distribution, local and federal government payment, and other recurring payment services for corporates. The company also provides custom build enterprise payment solutions comprising agent and mobile banking, e-voucher, and POS systems; and messaging platform that enables bulk, secured, two way, and premium SMS. In addition, it offers e-channel products and services, technology man-aged services, and solution sales and consultancy services; and retails various goods, materials, and commodities. Further, the company provides IT systems and solutions; and electronic payment and product fulfillment services, as well as establishes a multi-channel electronic service bureau services. It markets its products under the MoCS and ABOSSE brands. The company serves mobile operators, transportation, financial institutions, hypermarkets, retailers, as well as other service providers requiring payment and transactional technology. MobilityOne Limited is based in Kuala Lumpur, Malaysia.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "SEAV": {
        "short_name": "SEATECH VENTURES CORP",
        "long_name": "SEATech Ventures Corp.",
        "summary": "SEATech Ventures Corp., an investment holding company, provides business mentoring, nurturing, and incubating services in Asia. The company also offers corporate development advisory services. It primarily serves businesses and entrepreneurs of the information and communication technology, and technology-based companies. SEATech Ventures Corp. was founded in 2018 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "WECT": {
        "short_name": "WECONNECT TECH INTERNATIONAL IN",
        "long_name": "Weconnect Tech International Inc.",
        "summary": "Weconnect Tech International, Inc. operates as an IT-solutions provider in Malaysia. Weconnect Tech International, Inc. was founded in 2015 and is based in Petaling Jaya, Malaysia.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    },
    "YYN.SI": {
        "short_name": "$ PlatoCapital",
        "long_name": "Plato Capital Limited",
        "summary": "Plato Capital Limited, an investment holding company, provides e-commerce systems and services, and system integration related services in Malaysia. The company operates through IT Operations and Investment Activities segments. It also distributes and markets computer hardware and software; manages investments in quoted and unquoted equity shares; and provides money lending services. In addition, the company offers credit facilities; and management, aviation, and investment fund services, as well as develops and operates hotel. The company was incorporated in 1999 and is based in Kuala Lumpur, Malaysia.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    }
}