{"E28.SI": {"short_name": "Frencken", "long_name": "Frencken Group Limited", "summary": "Frencken Group Limited, an investment holding company, operates as a capital and consumer equipment service provider worldwide. It operates in two segments, Mechatronics and Integrated Manufacturing Services (IMS). The Mechatronics segment designs, develops, and produces precision-engineered systems and machines, electromechanical assemblies, and high precision parts and components for original equipment manufacturers. It offers integrated one-stop outsourcing solutions, such as product design, development, and prototyping; project management and engineering support; strategic purchasing and sourcing; high precision parts and components manufacturing; final test and assembly of modules and complete systems/machines; and product life cycle management. This segment serves medical, semiconductor, analytical, and industrial/factory automation industries. The IMS segment provides integrated contract design and manufacturing services to the automotive, office automation, and consumer and industrial electronics industries. This segment offers a range of outsourcing services, including mechanical and electronic design and engineering support; tooling design and manufacture; plastic injection molded parts and components; printed circuit board assemblies; and final test and assembly of modules and box build products. The company also provides program and supply chain management services; modular and equipment system assembly, integration, testing, and commissioning services; and vacuum coating, thermal treatment, and other related services for plastic components. In addition, it manufactures sheet metal parts and dies; designs, engineers, manufactures, and sells oil filters; manufactures and distributes plastic products and components; designs and trades in micro-mechanical product components for automotive industry; and sells machines, as well as holds properties. Frencken Group Limited was founded in 1995 and is based in George Town, Malaysia.", "currency": "SGD", "sector": "Technology", "industry": "Electronic Components", "exchange": "SES", "market": "sg_market", "country": "Malaysia", "city": "Georgetown"}}