{
    "0IL.F": {
        "short_name": "INTELGENX TECHN.DL-,00001",
        "long_name": "IntelGenx Technologies Corp.",
        "summary": "IntelGenx Technologies Corp., a drug delivery company, focuses on the development and manufacturing of novel oral thin film products for the pharmaceutical market. It offers INT0008/2008, a Rizatriptan oral film product for the treatment of migraine. The company's products under development comprise INT0004/2006, an antidepressant; INT0046/2018 for adult use; INT0007/2006 for the treatment of erectile dysfunction; INT0010/2006 for the treatment of neuropathic pain and nausea in cancer patients; INT0027/2011 to treat opioid addition; INT0036/2013 for schizophrenia; and INT0043/2015 to treat Alzheimer's disease; and INT0048/2020 for animal health. It is also developing INT0039/2013, INT0040/2014, INT0052/2020, and INT0053/2020. The company has licensing, development, and supply agreement with Tilray, Inc. and Gensco Pharma; and development agreement with Cynapsus Therapeutics Inc. IntelGenx Technologies Corp. was founded in 2003 and is headquartered in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "0OX.F": {
        "short_name": "ZYMEWORKS INC.",
        "long_name": "Zymeworks Inc.",
        "summary": "Zymeworks Inc., a clinical-stage biopharmaceutical company, discovers, develops, and commercializes biotherapeutics for the treatment of cancer. The company's lead product candidates include zanidatamab, a novel bispecific antibody that is in Phase 1 and Phase 2 clinical trials for the treatment of biliary tract, gastroesophageal adenocarcinomas, and breast cancer; and ZW49, a biparatopic anti- human epidermal growth factor receptor 2 (HER2) antibody-drug conjugate that is in Phase 1 clinical trial for the treatment of advanced or metastatic HER2-expressing tumors. The company has strategic partnerships with Merck Sharp & Dohme Research Ltd.; Eli Lilly and Company; Bristol-Myers Squibb company; GlaxoSmithKline Intellectual Property Development Ltd.; Daiichi Sankyo Co., Ltd.; Janssen Biotech, Inc.; and BeiGene, Ltd. It also has licensing and research collaboration with LEO Pharma A/S to discover and develop bispecific antibodies; and Iconic Therapeutics, Inc. Zymeworks Inc. was founded in 2003 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "18H.F": {
        "short_name": "PREVECEUTICAL MED.",
        "long_name": "PreveCeutical Medical Inc.",
        "summary": "PreveCeutical Medical Inc., a health sciences company, develops options for preventive and curative therapies utilizing organic and nature identical products in the United States and Canada. It has research and development programs, including dual gene therapy for curative and prevention therapies for type 2 diabetes and obesity; a soluble gel drug delivery program, which provide relief from pain, inflammation, seizures, and neurological disorders; Nature Identical peptide therapeutic applications; non-addictive analgesic peptides as a replacement to the addictive analgesics, such as morphine, fentanyl, and oxycodone; and a therapeutic product for treating athletes who suffer from concussions. It also provides medicinal cannabis-based products. PreveCeutical Medical Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "1XU1.F": {
        "short_name": "ENTHEON BIOMEDICAL CORP.",
        "long_name": "Entheon Biomedical Corp.",
        "summary": "Entheon Biomedical Corp., a biotechnology research and drug development company, engages in developing and commercializing various N,N-dimethyltryptamine based psychedelic therapeutic products for treating addiction and substance use disorders. The company is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "23J.F": {
        "short_name": "PROMIS NEUROSCIENCES",
        "long_name": "ProMIS Neurosciences, Inc.",
        "summary": "ProMIS Neurosciences, Inc., a development stage biotech company, discovers and develops precision medicine solutions for the treatment of neurodegenerative diseases, primarily Alzheimer's disease (AD), amyotrophic lateral sclerosis (ALS), and Parkinson's disease (PD). Its proprietary target discovery engine is based on the use of two complementary techniques. The company applies its thermodynamic, computational discovery platformÂ\u0097ProMIS and Collective Coordinates to predict novel targets known as disease specific epitopes on the molecular surface of misfolded proteins. Its lead product candidates include PMN310, a monoclonal antibody (mAb); PMN350, a mAb targeting on toxic amyloid beta oligomers (AÃ\u009fO); and PMN330, a monoclonal antibody targeting toxic prion-like forms of AÃ\u009fO for AD. The company is also developing therapeutics targeting the neurotoxic form of the tau protein in AD; and superoxide dismustase 1 and TAR-DNA binding protein 43 in ALS, as well as alpha synuclein in PD and Lewy body dementia. The company has a collaboration with BC Neuroimmunology to develop and commercialize proprietary diagnostic assays; and BC Neuroimmunology to develop and offer blood-based diagnostic tests for Alzheimer's diseases. The company was formerly known as Amorfix Life Sciences Ltd. and changed its name to ProMIS Neurosciences, Inc. in July 2015. ProMIS Neurosciences, Inc. was incorporated in 2004 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "2CG2.F": {
        "short_name": "NANOSPHERE HEA.SCIENCES",
        "long_name": "NanoSphere Health Sciences Inc.",
        "summary": "Nanosphere Health Sciences Inc., a nano-biotechnology company, focuses on providing next generation delivery of biologically active compounds in the United States. Its nanoencapsulation technology delivers nutritive elements and medicants through licensing arrangements. The company was incorporated in 2005 is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "2M4.F": {
        "short_name": "MICROBIX BIOSYSTEMS",
        "long_name": "Microbix Biosystems Inc.",
        "summary": "Microbix Biosystems Inc., a life science company, manufactures viral and bacterial antigens and reagents for the diagnostics industry worldwide. The company produces infectious disease antigens, including viral, bacterial, and parasitic products, which are used in various applications, such as immunodiagnostic assays comprising ELISA, chemiluminescent automated immunoassays, immunohistochemistry, immunofluorescence, latex agglutination, rapid tests, and flow cytometry. Its infectious disease antigens also used in controls for diagnostic assays, basic and applied research in virology, microbiology, cell biology, immunology, and pathology, or for vaccine and antiviral research and development. The company also provides quality assessment products, including PROCEEDx Verification/Validation samples, which are research use only products for use in test system IQ/OQ/PQ, verification/validation, and training; PTDx proficiency testing products; and REDx Controls, which are designed to enhance the diagnostic quality outcome by early detection of the deviations from desired assay performance. In addition, it develops Kinlytic Urokinase for injection, a thrombolytic biologic drug used to treat blood clots; and LumiSort cell-sorting, a technology for sorting of particles that could be used to enrich cell populations of interest, such as in sexing semen. The company also offers viral transport media that stabilize the organisms in patient samples. Microbix Biosystems Inc. was founded in 1988 and is based in Mississauga, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "2VF0.F": {
        "short_name": "HEMOSTEMIX INC.",
        "long_name": "Hemostemix Inc.",
        "summary": "Hemostemix Inc., a clinical-stage biotechnology company, develops, manufactures, and commercializes blood-derived cell therapies for medical conditions. It develops cell therapy products from the patient's own blood, a relatively non-invasive source of therapeutic cells. The company's lead product is ACP-01, an autologous cell therapy for the treatment of critical limb ischemia, peripheral arterial disease, angina, ischemic cardiomyopathy, dilated cardiomyopathy, and other conditions of ischemia that is in Phase II clinical trial in Canada and the United States. It also offers various types of synergetic cell populations, such as angiogenic cell precursors, myocardial cell precursors, neural cell precursors, and bone cell precursors. Hemostemix Inc. is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "385.F": {
        "short_name": "CEAPRO INC.",
        "long_name": "Ceapro Inc.",
        "summary": "Ceapro Inc., a biotechnology company, engages in the development and commercialization of active ingredients in the United States, Germany, China, Canada, and internationally. It operates in two segments, The Active Ingredient Product Technology Industry and The Cosmeceutical Industry. The company is involved in the development and application of technology to the production of extracts and active ingredients from oats and other renewable plant resources. It adds value to its extracts by supporting their use in cosmeceutical, nutraceutical, and therapeutics products for humans and animals. The company's products include natural active ingredients comprising beta glucan, avenanthramides, oat powder, oat oil, oat peptides, and lupin peptides that are marketed to personal care, cosmetic, medical, and animal health industries through its distribution partners and direct sales; natural anti-aging skincare products; and veterinary therapeutic products, such as oat shampoos, ear cleansers, and dermal complexes/conditioners. Its products and technologies that are under research and development, or pre-commercial stage comprise a platform using its beta glucan formulations to deliver compounds for treatments in the personal and healthcare sectors; various novel enabling technologies, such as Pressurized Gas eXpanded drying technology; and technologies to enhance the content of avenanthramides. The company has a collaboration with the McMaster University to develop inhalable therapeutic for COVID-19; and a research project with the University of Alberta to expand the utilization of the PGX technology and generate ingredients targeting applications in functional food, dietary supplement, personal care, and pharmaceuticals. Ceapro Inc. was incorporated in 1997 and is headquartered in Edmonton, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "47M.F": {
        "short_name": "MEDMIRA INC.",
        "long_name": "MedMira Inc.",
        "summary": "MedMira Inc., a biotechnology company, researches, develops, manufactures, and commercializes rapid diagnostics and technology platforms in North America, Latin America, the Caribbean, Europe, and the Asia Pacific. The company's research is focused on specific areas of the diagnostics market, such as rapid, point-of-care, and in vitro sectors. It offers Reveal HIV that detects antibodies to HIV-1 and HIV-2 in whole blood, serum, or plasma; and Reveal HP, a rapid H. Pylori antibody test, which detects helicobacter pylori (HP) antibodies in serum, plasma, or whole blood produced in response to HP infection. The company also provides Reveal TP, a rapid syphilis antibody test that detects treponema pallidum antibodies in serum, plasma, or whole blood; Multiplo, a line of multiplex tests, including combination testing solutions for HIV-1/2, Hepatitis B and C, and Syphilis; and REVEALCOVID-19, an antibody test. In addition, it offers Miriad RVF toolkit that facilitates the development and commercialization of rapid diagnostics. MedMira Inc. sells its products through a network of medical distributors and strategic business development partners to customers in various sectors of the healthcare industry, including laboratories, hospitals, point-of-care clinics, governments, aid organizations, and public health agencies. The company was founded in 1993 and is headquartered in Halifax, Canada. MedMira Inc. is a subsidiary of MedMira Holding AG.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Halifax"
    },
    "4B70.F": {
        "short_name": "ANTIBE THERAPEUTICS INC.",
        "long_name": "Antibe Therapeutics Inc.",
        "summary": "Antibe Therapeutics Inc., a pharmaceutical development company, originates, develops, and out-licenses patent novel therapeutics and medical devices in the areas of pain, inflammation and regenerative medicine in Canada, Europe, the United States, and internationally. Its drugs are designed to prevent the gastrointestinal damage and bleeding caused by non-steroidal anti-inflammatory drugs. The company's lead compound is ATB-346, a hydrogen sulfide-releasing derivative of naproxen for treating rheumatoid arthritis, ankylosing spondylitis, and general pain reduction that has completed Phase 2B gastrointestinal safety study. Its products also comprise ATB-352, which is in preclinical stage for the treatment of gout, dental pain, post-surgical pain, etc.; and ATB-340 that is in preclinical development stage for the treatment of stroke and cancer. In addition, it offers bone graft substitutes, barrier membranes, and other products for the dental and orthopedic markets under the C-Graft Putty, C-Blast Putty, Eclipse, NeoGuarde, Neomem, Neomem FlexPlus, PentOS OI, and Raptos trademarks. The company was incorporated in 2009 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "50N.F": {
        "short_name": "NATURALLY SPLEND.ENTERPR.",
        "long_name": "Naturally Splendid Enterprises Ltd.",
        "summary": "Naturally Splendid Enterprises Ltd., a biotechnology and consumer products company, develops, produces, commercializes, sells, and licenses plant-derived, bio-active ingredients, nutrient dense foods, and related products in Canada, Japan, South Korea, Thailand, and Western Europe. The company offers nutrition for athletes under the Natera Sport brand; food energy bars under the WOODS WILD BAR; healthy snack bars under the ELEVATE ME brand; hemp for health under the CHII brand; products for dogs under the PawsitiveFX brand; and hemp and plant-based natural health products under the Natera FX brand. It also provides hemp processing, manufacturing, private label, and CBD extraction services; and distributes lifestyle and healthy meal replacement products. The company sells food and ingredients to commercial processors and consumers through grocery stores, health and nutrition stores, and online. Naturally Splendid Enterprises Ltd. was incorporated in 2010 and is headquartered in Pitt Meadows, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Pitt Meadows"
    },
    "5GZ.F": {
        "short_name": "WAVERLEY PHARMA INC.",
        "long_name": "Waverley Pharma Inc.",
        "summary": "Waverley Pharma Inc., a biopharmaceutical company, researches, develops, and commercializes cancer therapeutics in the United Kingdom, European Union, and North America. It focuses on the generic oncology injectable products. The company sells generic oncology products comprising capecitabine, temozolomide, and erlotinib. Its products under development include injectable generic chemotherapy drugs, such as WAV-101 for the treatment of non-small cell lung cancer and pleural mesothelioma; and WAV-102 to treat multiple myeloma and mantle cell lymphoma. The company has a collaboration with the University of Manitoba for the development of a synthetic library of chloroquine analogs to treat COVID-19. Waverley Pharma Inc. is headquartered in Winnipeg, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "5IV1.F": {
        "short_name": "IMV INC.",
        "long_name": "IMV Inc.",
        "summary": "IMV Inc., a biopharmaceutical company, focuses on the development of cancer immunotherapies and vaccines against infectious diseases using its DPX delivery technology platform. The company's lead drug candidate includes maveropepimut-S (DPX-Survivac), a T cell therapy, which is in three Phase II clinical trials across 6 different cancer indications with and without Merck's Keytruda; and Phase II clinical trials for the treatment of ovarian cancer, and recurrent and refractory diffuse large B cell lymphoma. It is also developing DPX-COVID-19, a second-generation vaccine against severe acute respiratory syndrome coronavirus 2; and DPX-RSV, a vaccine candidate, which has completed Phase I clinical trials for the treatment of respiratory syncytial virus strain A, as well as DPX-SurMAGE for the treatment of bladder cancer and DPX-BRAF to treat melanoma patients. The company was formerly known as Immunovaccine Inc. and changed its name to IMV Inc. in May 2018. IMV Inc. was founded in 2000 and is headquartered in Dartmouth, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Dartmouth"
    },
    "5LB.F": {
        "short_name": "BIOVAXYS TECHNOLOGY CORP.",
        "long_name": "BioVaxys Technology Corp.",
        "summary": "BioVaxys Technology Corp., a clinical biotechnology company, develops antiviral and anticancer vaccine platforms. It develops BVX-0320, a monovalent SARS-CoV-2 vaccine; and BVX-0918A, a haptenized tumor antigen vaccine for ovarian cancer, as well as and Covid-T, which screens for an immune system response in patients exposed to SARS-CoV-2. The company is also developing Papilocare for human papilloma virus (HPV)-dependent cervical lesions; BVX-0918C for cervical cancer; BVX-0204 HPV viral vaccine; and BVX-0121, a multivalent SARS-CoV-2 vaccine. BioVaxys Technology Corp. has a bioproduction agreement with WuXi Biologics Limited that produces SARS-CoV-2 s-proteins for BVX-0320 and Covid-T; research collaboration with The Ohio State University, Wexner School of Medicine for BVX-0320; and agreement with Bioanalytical Systems, Inc. to conduct preclinical toxicology studies for its Covid-T immunodiagnostic. The company is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "5NP.F": {
        "short_name": "HAVN LIFE SCIENCES INC.",
        "long_name": "HAVN Life Sciences Inc.",
        "summary": "HAVN Life Sciences Inc., a biotechnology company, engages in the research and development of psychopharmacological products from plants and fungi. The company was founded in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "6PB.F": {
        "short_name": "PASCAL BIOSCIENCES INC.",
        "long_name": "Pascal Biosciences Inc.",
        "summary": "Pascal Biosciences Inc., a biotechnology company, researches and develops products for the treatment of cancer, and for the enhancement of immune system. Its development portfolio includes PAS-403, a small molecule therapeutic advancing into clinical trials for the treatment of glioblastoma; and PAS-393, an immuno-stimulatory cannabinoid to be used in combination with checkpoint inhibitor therapy for cancer treatment. The company is also developing a B-cell targeted antibody for acute lymphoblastic leukemia and B cell lymphomas; and cannabinoid therapeutic for the treatment of COVID-19. The company has an exclusive license agreement with the University of Washington to develop a cannabinoid-based product for the treatment of glioblastoma multiforme and brain metastases; and a collaborative research agreement with SoRSE Technology Corporation to advance PAS-393 into clinical testing. Pascal Biosciences Inc. was founded in 2013 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "6UF.F": {
        "short_name": "NEONMIND BIOSCIENCES INC.",
        "long_name": "NeonMind Biosciences Inc.",
        "summary": "NeonMind Biosciences Inc. engages in the discovery, development, and commercialization of medicinal and psychedelic mushrooms for mental illnesses. It is developing psilocybin based products comprising mushroom-infused beverages and other mushroom-infused products to treat weight loss and management, depression, cardiovascular, obesity, diabetes, and heart diseases. The company was formerly known as Flourish Mushroom Labs Inc. and changed its name to NeonMind Biosciences Inc. in April 2020. NeonMind Biosciences Inc. was incorporated in 2019 and is headquartered in Vancouver, Canada. NeonMind Biosciences Inc. is a subsidiary of The Yield Growth Corp.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "8BTA.F": {
        "short_name": "BRIACELL THERAPEUTICS",
        "long_name": "BriaCell Therapeutics Corp.",
        "summary": "BriaCell Therapeutics Corp., an immuno-oncology biotechnology company, engages in developing approaches for the management of cancer. Its lead candidate is Bria-IMT that is in Phase I/IIa clinical trial in a combination study with immune checkpoint inhibitors for the treatment of breast cancer. The company also has a cooperative research and development agreement with the National Cancer Institute for developing Bria-OTS, an off-the-shelf personalized immunotherapy for advanced breast cancer; and BriaDx, a diagnostic test. BriaCell Therapeutics Corp. is headquartered in West Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "West Vancouver"
    },
    "8FW.F": {
        "short_name": "TRYP THERAPEUTICS INC.",
        "long_name": "Tryp Therapeutics Inc.",
        "summary": "Tryp Therapeutics Inc., a clinical stage pharmaceutical company, focuses on developing compounds with known activity and/or safety profiles for the treatment of rare or orphan diseases and other diseases. The company's lead development program is psilocybin-for-neuropsychiatry (PFN), which is designed to treat neuropsychiatric disorders through the dosing of formulations of synthetic psilocybin. Its PFN program candidates include TRP-8802 for fibromyalgia, hyperphagia in prader-willi syndrome, and other therapies; and TRP-1001, an oral formulation of razoxane evaluating for the treatment of soft tissue sarcoma. The company was formerly known as Artos Pharma Corp. and changed its name to Tryp Therapeutics Inc. in June 2020. The company was founded in 2019 and is headquartered in Kelowna, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "8QQ.F": {
        "short_name": "ABCELLERA BIOLOGICS",
        "long_name": "AbCellera Biologics Inc.",
        "summary": "AbCellera Biologics Inc. develops antibody discovery platform. Its full-stack, AI-powered drug discovery platform searches and analyzes the database of natural immune systems to find antibodies that can be developed as drugs. As of December 31, 2020, the company had 103 discovery programs that are either completed, in progress, or under contract. It has a discovery partnership agreement with Eli Lilly and Company. AbCellera Biologics Inc. was founded in 2012 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "8SV1.F": {
        "short_name": "WPD PHARMACEUTICALS",
        "long_name": "WPD Pharmaceuticals Inc.",
        "summary": "WPD Pharmaceuticals Inc. engages in the research and development of medicinal products in the fields of oncology and infectious diseases. Its drug development pipeline includes WPD101 to treat brain cancers, including glioblastoma that is in the pre-clinical trial; WPD102 to treat Uval Melanoma, which is in the pre-clinical trial; Berubicin for the treatment of glioblastoma that us in phase 1 clinical trial; and WP1066 to treat central nervous system tumors, pancreatic cancer, and ocular tumors, which is in phase 1 clinical trial. The company's drug development pipeline also includes WP1732 for the treatment of pancreatic cancer; WP1220 to treat cutaneous T-cell lymphoma; WPD103 for the treatment of glioblastoma multiforme that is in the pre-clinical trial; and Annamycin to treat acute myeloid leukemia (AML) and metastasis to lungs, which is in Phase I/II clinical trials in AML. WPD Pharmaceuticals Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "9DF.F": {
        "short_name": "MINDSET PHARMA INC.",
        "long_name": "Mindset Pharma Inc.",
        "summary": "Mindset Pharma Inc. operates as a neuro-pharmaceutical drug discovery and development platform company. It offers psychedelic compounds for treatment-resistant neurological and psychiatric disorders. The company is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "9DO.F": {
        "short_name": "GLOW LIFETECH CORP.",
        "long_name": "Glow Lifetech Corp.",
        "summary": "Glow Lifetech Corp., a biotechnology company, focuses on producing nutraceutical and cannabinoid-based products. The company was founded in 2018 and is based in Toronto, Canada. Glow LifeTech Ltd. operates as a subsidiary of Relay Medical Corp.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "A1PA.F": {
        "short_name": "ACASTI PHARMA INC.",
        "long_name": "Acasti Pharma Inc.",
        "summary": "Acasti Pharma Inc., a biopharmaceutical company, focuses on the research, development, and commercialization of prescription drugs for the treatment of cardiovascular diseases. Its lead product candidate is CaPre, an omega-3 phospholipid therapeutic that is in Phase III clinical trial to treat patients with hypertriglyceridemia; and TRILOGY that is in Phase III to evaluate the safety and efficacy of CaPre in patients with sHTG. The company was incorporated in 2002 and is headquartered in Laval, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Laval"
    },
    "ABCL": {
        "short_name": "AbCellera Biologics Inc.",
        "long_name": "AbCellera Biologics Inc.",
        "summary": "AbCellera Biologics Inc. develops antibody discovery platform. Its full-stack, AI-powered drug discovery platform searches and analyzes the database of natural immune systems to find antibodies that can be developed as drugs. As of December 31, 2020, the company had 103 discovery programs that are either completed, in progress, or under contract. It has a discovery partnership agreement with Eli Lilly and Company. AbCellera Biologics Inc. was founded in 2012 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ACHFF": {
        "short_name": "ARCH BIOPARTNERS INC",
        "long_name": "Arch Biopartners Inc.",
        "summary": "Arch Biopartners Inc., a biotechnology company, develops technologies for improving the health of patients. It focuses on developing its lead drug candidate MetaBlok, which is in Phase II for the treatment or prevention of dipeptidase-1 (DPEP-1) mediated organ inflammation in the lungs, liver, or kidneys. The company also develops AB569, a drug candidate for the treatment of antibiotic resistant bacterial infections, primarily in the lungs and wounds, as well as to treat pseudomonas aeruginosa infections in the respiratory tracts of patients with cystic fibrosis. In addition, the company develops Borg, a peptide-solid surface interface to inhibit biofilm formation and reduce corrosion; and MetaMx, which are synthetic molecules that target brain tumor initiating cells and invasive glioma cells. Arch Biopartners Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ACHV": {
        "short_name": "Achieve Life Sciences, Inc.",
        "long_name": "Achieve Life Sciences, Inc.",
        "summary": "Achieve Life Sciences, Inc., a clinical-stage pharmaceutical company, develops and commercializes of cytisinicline for smoking cessation and nicotine addiction in the United States and internationally. The company offers cytisinicline, a plant-based alkaloid that interacts with nicotine receptors in the brain to help reduce the severity of nicotine withdrawal symptoms. It has license agreements with Sopharma AD and University of Bristol. The company is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ACOG.V": {
        "short_name": "ALPHA COGNITION INC",
        "long_name": "Alpha Cognition Inc.",
        "summary": "Alpha Cognition Inc., a clinical stage biopharmaceutical company, focuses on developing treatments for Alzheimer's Disease and Amyotrophic Lateral Sclerosis (ALS). It develops ALPHA-1062, an acetylcholine esterase inhibitor for the treatment of dementia of the Alzheimer's type; and ALPHA-0602, a gene therapy program for the treatment of ALS. The company was formerly known as Crystal Bridge Enterprises Inc. and changed its name to Alpha Cognition Inc. in March 2021. The company was founded in 2000 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ACST": {
        "short_name": "Acasti Pharma, Inc.",
        "long_name": "Acasti Pharma Inc.",
        "summary": "Acasti Pharma Inc., a biopharmaceutical company, focuses on the research, development, and commercialization of prescription drugs for the treatment of cardiovascular diseases. Its lead product candidate is CaPre, an omega-3 phospholipid therapeutic that is in Phase III clinical trial to treat patients with hypertriglyceridemia; and TRILOGY that is in Phase III to evaluate the safety and efficacy of CaPre in patients with sHTG. The company was incorporated in 2002 and is headquartered in Laval, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Canada",
        "city": "Laval"
    },
    "ACST.V": {
        "short_name": "ACASTI PHARMA INC",
        "long_name": "Acasti Pharma Inc.",
        "summary": "Acasti Pharma Inc., a biopharmaceutical company, focuses on the research, development, and commercialization of prescription drugs for the treatment of cardiovascular diseases. Its lead product candidate is CaPre, an omega-3 phospholipid therapeutic that is in Phase III clinical trial to treat patients with hypertriglyceridemia; and TRILOGY that is in Phase III to evaluate the safety and efficacy of CaPre in patients with sHTG. The company was incorporated in 2002 and is headquartered in Laval, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Laval"
    },
    "AGN.CN": {
        "short_name": "AlgernonPharma",
        "long_name": "Algernon Pharmaceuticals Inc.",
        "summary": "Algernon Pharmaceuticals Inc. operates as a clinical stage pharmaceutical development company. It focuses on the areas of nonÂ\u0096alcoholic steatohepatitis, chronic kidney disease, inflammatory bowel disease, idiopathic pulmonary fibrosis, chronic cough, and acute lung injury associated with COVID-19 in Canada and Australia. The company's lead candidate is NP-120, an N-methyl-d-aspartate (NMDA) receptor glutamate receptor antagonist, which targets NMDA-type subunit 2B (Glu2NB), as well as exhibits agonist activity for the Sigma-1 receptor, a chaperone protein up-regulated during endoplasmic reticulum stress. It is also developing AP-188 (N,N-Dimethyltryptamine), a psychedelic compound that is part of the tryptamine family for the treatment of ischemic stroke in humans. Algernon Pharmaceuticals Inc. has an agreement with Charles River Laboratories for preclinical studies of AP-188 for the company's stroke clinical research program. Algernon Pharmaceuticals Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "AGNPF": {
        "short_name": "ALGERNON PHARMACEUTICALS INC",
        "long_name": "Algernon Pharmaceuticals Inc.",
        "summary": "Algernon Pharmaceuticals Inc., a clinical stage pharmaceutical development company, focuses in the areas of nonÂ\u0096alcoholic steatohepatitis, chronic kidney disease, inflammatory bowel disease, idiopathic pulmonary fibrosis, chronic cough, and acute lung injury associated with COVID-19 in Canada and Australia. The company's lead candidate is NP-120, an N-methyl-d-aspartate (NMDA) receptor glutamate receptor antagonist, which targets NMDA-type subunit 2B (Glu2NB), as well as exhibits agonist activity for the Sigma-1 receptor, a chaperone protein up-regulated during endoplasmic reticulum stress. It is also developing AP-188 (N,N-Dimethyltryptamine), a psychedelic compound that is part of the tryptamine family for the treatment of ischemic stroke in humans. Algernon Pharmaceuticals Inc. has an agreement with Charles River Laboratories for preclinical studies of AP-188 for the company's stroke clinical research program. Algernon Pharmaceuticals Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ANU1.F": {
        "short_name": "XORTX THERAPEUTICS",
        "long_name": "XORTX Therapeutics Inc.",
        "summary": "XORTX Therapeutics Inc., a bio-pharmaceutical company, engages in the development and commercialization of therapies to treat progressive kidney diseases, hypertension, insulin resistance, and diabetic nephropathy. It develops XRx-008, a late clinical stage program therapy for autosomal dominant polycystic kidney disease; XRx-101, an uric acid lowering agent used to treat patients infected with the coronavirus COVID-19 infection and suppression of acute kidney injury and associated health consequences; and XRx-221, a xanthine oxidase inhibitor candidates for the treatment of diabetic nephropathy. The company has a partnership with the Icahn School of Medicine to study the incidence of acute kidney injury and hyperuricemia in patients hospitalized with COVID-19. XORTX Therapeutics Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "APC.V": {
        "short_name": "ADVANCED PROTEOME THERAPEUTICS ",
        "long_name": "Advanced Proteome Therapeutics Corporation",
        "summary": "Advanced Proteome Therapeutics Corporation, through its subsidiary, Advanced Proteome Therapeutics Inc., operates as a biotechnology company in the United States. The company develops and commercializes a platform for the chemical modification of protein therapeutics, primarily antibody-drug conjugates. Its proprietary technology targets delivery of anti-cancer drugs to cancerous tumors. The company is headquartered in Burnaby, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "APLI.TO": {
        "short_name": "APPILI THERAPEUTICS INC",
        "long_name": "Appili Therapeutics Inc.",
        "summary": "Appili Therapeutics Inc., a biopharmaceutical company, acquires, develops, and commercializes novel medicines for unmet needs in the infectious disease in Canada. Its anti-infective portfolio includes Favipiravir for pandemic influenza and COVID-19; ATI-2307, an antifungal candidate, which is in clinical stage for the treatment of cryptococcal meningitis and invasive candidiasis; ATI-1501, a taste-masked oral liquid suspension formulation of an antibiotic, metronidazole; ATI-1503 that develops a class of gram-negative targeting antibiotics; and ATI-1701 is a live-attenuated vaccine for Francisella tularensis. Appili Therapeutics Inc. was founded in 2015 and is headquartered in Halifax, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Halifax"
    },
    "APLIF": {
        "short_name": "APPILI THERAPEUTICS INC",
        "long_name": "Appili Therapeutics Inc.",
        "summary": "Appili Therapeutics Inc., a biopharmaceutical company, acquires, develops, and commercializes novel medicines for unmet needs in the infectious disease in Canada. Its anti-infective portfolio includes Favipiravir for pandemic influenza and COVID-19; ATI-2307, an antifungal candidate, which is in clinical stage for the treatment of cryptococcal meningitis and invasive candidiasis; ATI-1501, a taste-masked oral liquid suspension formulation of an antibiotic, metronidazole; ATI-1503 that develops a class of gram-negative targeting antibiotics; and ATI-1701 is a live-attenuated vaccine for Francisella tularensis. Appili Therapeutics Inc. was founded in 2015 and is headquartered in Halifax, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Halifax"
    },
    "APS.TO": {
        "short_name": "APTOSE BIOSCIENCES INC",
        "long_name": "Aptose Biosciences Inc.",
        "summary": "Aptose Biosciences Inc., a clinical-stage biotechnology company, discovers and develops personalized therapies addressing unmet medical needs in oncology in the United States. Its clinical programs is APTO-253, which is a Phase 1a/b clinical trial for the treatment of patients with relapsed or refractory blood cancers, including acute myeloid leukemia and high-risk myelodysplastic syndrome. It has an agreement with CrystalGenomics, Inc. to research, develop, and commercialize CG026806 and CG-806, which are in Phase 1a/b clinical trial for the treatment of patients with chronic lymphocytic leukemia, small lymphocytic lymphoma, and certain non-Hodgkin's lymphomas, as well as relapsed/refractory acute myeloid leukemia. The company also has an agreement with OHM Oncology for the development, manufacture, and commercialization of APL-581, a dual bromodomain and extra-terminal domain motif protein and kinase inhibitor program. The company was formerly known as Lorus Therapeutics Inc. and changed its name to Aptose Biosciences Inc. in August 2014. Aptose Biosciences Inc. was incorporated in 1986 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "APTO": {
        "short_name": "Aptose Biosciences, Inc.",
        "long_name": "Aptose Biosciences Inc.",
        "summary": "Aptose Biosciences Inc., a clinical-stage biotechnology company, discovers and develops personalized therapies addressing unmet medical needs in oncology in the United States. Its clinical programs is APTO-253, which is a Phase 1a/b clinical trial for the treatment of patients with relapsed or refractory blood cancers, including acute myeloid leukemia and high-risk myelodysplastic syndrome. It has an agreement with CrystalGenomics, Inc. to research, develop, and commercialize CG026806 and CG-806, which are in Phase 1a/b clinical trial for the treatment of patients with chronic lymphocytic leukemia, small lymphocytic lymphoma, and certain non-Hodgkin's lymphomas, as well as relapsed/refractory acute myeloid leukemia. The company also has an agreement with OHM Oncology for the development, manufacture, and commercialization of APL-581, a dual bromodomain and extra-terminal domain motif protein and kinase inhibitor program. The company was formerly known as Lorus Therapeutics Inc. and changed its name to Aptose Biosciences Inc. in August 2014. Aptose Biosciences Inc. was incorporated in 1986 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ARCH.V": {
        "short_name": "ARCH BIOPARTNERS INC",
        "long_name": "Arch Biopartners Inc.",
        "summary": "Arch Biopartners Inc., a biotechnology company, develops technologies for improving the health of patients. It focuses on developing its lead drug candidate MetaBlok, which is in Phase II for the treatment or prevention of dipeptidase-1 (DPEP-1) mediated organ inflammation in the lungs, liver, or kidneys. The company also develops AB569, a drug candidate for the treatment of antibiotic resistant bacterial infections, primarily in the lungs and wounds, as well as to treat pseudomonas aeruginosa infections in the respiratory tracts of patients with cystic fibrosis. In addition, the company develops Borg, a peptide-solid surface interface to inhibit biofilm formation and reduce corrosion; and MetaMx, which are synthetic molecules that target brain tumor initiating cells and invasive glioma cells. Arch Biopartners Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ARFXF": {
        "short_name": "PROMIS NEUROSCIENCES INC",
        "long_name": "ProMIS Neurosciences, Inc.",
        "summary": "ProMIS Neurosciences, Inc., a development stage biotech company, discovers and develops precision medicine solutions for the treatment of neurodegenerative diseases, primarily Alzheimer's disease (AD), amyotrophic lateral sclerosis (ALS), and Parkinson's disease (PD). Its proprietary target discovery engine is based on the use of two complementary techniques. The company applies its thermodynamic, computational discovery platformÂ\u0097ProMIS and Collective Coordinates to predict novel targets known as disease specific epitopes on the molecular surface of misfolded proteins. Its lead product candidates include PMN310, a monoclonal antibody (mAb); PMN350, a mAb targeting on toxic amyloid beta oligomers (AÃ\u009fO); and PMN330, a monoclonal antibody targeting toxic prion-like forms of AÃ\u009fO for AD. The company is also developing therapeutics targeting the neurotoxic form of the tau protein in AD; and superoxide dismustase 1 and TAR-DNA binding protein 43 in ALS, as well as alpha synuclein in PD and Lewy body dementia. The company has a collaboration with BC Neuroimmunology to develop and commercialize proprietary diagnostic assays; and BC Neuroimmunology to develop and offer blood-based diagnostic tests for Alzheimer's diseases. The company was formerly known as Amorfix Life Sciences Ltd. and changed its name to ProMIS Neurosciences, Inc. in July 2015. ProMIS Neurosciences, Inc. was incorporated in 2004 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ATBPF": {
        "short_name": "ANTIBE THERAPEUTICS INC",
        "long_name": "Antibe Therapeutics Inc.",
        "summary": "Antibe Therapeutics Inc., a pharmaceutical development company, originates, develops, and out-licenses patent novel therapeutics and medical devices in the areas of pain, inflammation and regenerative medicine in Canada, Europe, the United States, and internationally. Its drugs are designed to prevent the gastrointestinal damage and bleeding caused by non-steroidal anti-inflammatory drugs. The company's lead compound is ATB-346, a hydrogen sulfide-releasing derivative of naproxen for treating rheumatoid arthritis, ankylosing spondylitis, and general pain reduction that has completed Phase 2B gastrointestinal safety study. Its products also comprise ATB-352, which is in preclinical stage for the treatment of gout, dental pain, post-surgical pain, etc.; and ATB-340 that is in preclinical development stage for the treatment of stroke and cancer. In addition, it offers bone graft substitutes, barrier membranes, and other products for the dental and orthopedic markets under the C-Graft Putty, C-Blast Putty, Eclipse, NeoGuarde, Neomem, Neomem FlexPlus, PentOS OI, and Raptos trademarks. The company was incorporated in 2009 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "ATE.TO": {
        "short_name": "ANTIBE THERAPEUTICS INC",
        "long_name": "Antibe Therapeutics Inc.",
        "summary": "Antibe Therapeutics Inc., a pharmaceutical development company, originates, develops, and out-licenses patent novel therapeutics and medical devices in the areas of pain, inflammation and regenerative medicine in Canada, Europe, the United States, and internationally. Its drugs are designed to prevent the gastrointestinal damage and bleeding caused by non-steroidal anti-inflammatory drugs. The company's lead compound is ATB-346, a hydrogen sulfide-releasing derivative of naproxen for treating rheumatoid arthritis, ankylosing spondylitis, and general pain reduction that has completed Phase 2B gastrointestinal safety study. Its products also comprise ATB-352, which is in preclinical stage for the treatment of gout, dental pain, post-surgical pain, etc.; and ATB-340 that is in preclinical development stage for the treatment of stroke and cancer. In addition, it offers bone graft substitutes, barrier membranes, and other products for the dental and orthopedic markets under the C-Graft Putty, C-Blast Putty, Eclipse, NeoGuarde, Neomem, Neomem FlexPlus, PentOS OI, and Raptos trademarks. The company was incorporated in 2009 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "AUP.TO": {
        "short_name": "AURINIA PHARMACEUTICALS INC",
        "long_name": "Aurinia Pharmaceuticals Inc.",
        "summary": "Aurinia Pharmaceuticals Inc., a biopharmaceutical company, develops and commercializes therapies to treat various diseases with unmet medical need in Japan and China. The company offers LUPKYNIS for the treatment of adult patients with active lupus nephritis. It has a collaboration and license agreement with Otsuka Pharmaceutical Co., Ltd. The company is headquartered in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "AUPH": {
        "short_name": "Aurinia Pharmaceuticals Inc",
        "long_name": "Aurinia Pharmaceuticals Inc.",
        "summary": "Aurinia Pharmaceuticals Inc., a biopharmaceutical company, develops and commercializes therapies to treat various diseases with unmet medical need in Japan and China. The company offers LUPKYNIS for the treatment of adult patients with active lupus nephritis. It has a collaboration and license agreement with Otsuka Pharmaceutical Co., Ltd. The company is headquartered in Victoria, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "BCT.V": {
        "short_name": "BRIACELL THERAPEUTICS CORP",
        "long_name": "BriaCell Therapeutics Corp.",
        "summary": "BriaCell Therapeutics Corp., an immuno-oncology biotechnology company, engages in developing approaches for the management of cancer. Its lead candidate is Bria-IMT that is in Phase I/IIa clinical trial in a combination study with immune checkpoint inhibitors for the treatment of breast cancer. The company also has a cooperative research and development agreement with the National Cancer Institute for developing Bria-OTS, an off-the-shelf personalized immunotherapy for advanced breast cancer; and BriaDx, a diagnostic test. BriaCell Therapeutics Corp. is headquartered in West Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "West Vancouver"
    },
    "BCTX": {
        "short_name": "BriaCell Therapeutics Corp.",
        "long_name": "BriaCell Therapeutics Corp.",
        "summary": "BriaCell Therapeutics Corp., an immuno-oncology biotechnology company, engages in developing approaches for the management of cancer. Its lead candidate is Bria-IMT that is in Phase I/IIa clinical trial in a combination study with immune checkpoint inhibitors for the treatment of breast cancer. The company also has a cooperative research and development agreement with the National Cancer Institute for developing Bria-OTS, an off-the-shelf personalized immunotherapy for advanced breast cancer; and BriaDx, a diagnostic test. BriaCell Therapeutics Corp. is headquartered in West Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "West Vancouver"
    },
    "BETR.CN": {
        "short_name": "BetterLifePhar",
        "long_name": "BetterLife Pharma Inc.",
        "summary": "BetterLife Pharma Inc., a biotechnology company, engages in the development and commercialization of psychedelic products for the treatment of mental disorders in Canada, the United States, Australia, and European Union. It is involved in refining and developing drug candidates from a set of complementary interferon-based technologies that have the potential to engage the immune system to fight virus infections, such as coronavirus disease and human papillomavirus, and/or to directly inhibit tumours to treat various types of cancer. BetterLife Pharma Inc. has a research agreement with the University of California San Diego for preclinical behavioral pharmacology studies of TD-0148A, a lysergic acid diethylamide derivative solution. The company was formerly known as Pivot Pharmaceuticals Inc. and changed its name to BetterLife Pharma Inc. in December 2019. BetterLife Pharma Inc. was founded in 2002 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BETRF": {
        "short_name": "BETTERLIFE PHARMA INC",
        "long_name": "BetterLife Pharma Inc.",
        "summary": "BetterLife Pharma Inc., a biotechnology company, engages in the development and commercialization of psychedelic products for the treatment of mental disorders in Canada, the United States, Australia, and European Union. It is involved in refining and developing drug candidates from a set of complementary interferon-based technologies that have the potential to engage the immune system to fight virus infections, such as coronavirus disease and human papillomavirus, and/or to directly inhibit tumours to treat various types of cancer. BetterLife Pharma Inc. has a research agreement with the University of California San Diego for preclinical behavioral pharmacology studies of TD-0148A, a lysergic acid diethylamide derivative solution. The company was formerly known as Pivot Pharmaceuticals Inc. and changed its name to BetterLife Pharma Inc. in December 2019. BetterLife Pharma Inc. was founded in 2002 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BHN0.F": {
        "short_name": "BELLUS HEALTH INC.",
        "long_name": "BELLUS Health Inc.",
        "summary": "BELLUS Health Inc., a clinical stage biopharmaceutical company, develops therapeutics for the treatment of chronic cough and other hypersensitization disorders. Its lead drug candidate includes BLU-5937, an oral small molecule antagonist of the P2X3 receptor, which is in Phase II clinical trial for treatment of chronic cough and chronic pruritus. The company was founded in 1993 and is headquartered in Laval, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Laval"
    },
    "BICTF": {
        "short_name": "BIOCURE TECHNOLOGY INC",
        "long_name": "Biocure Technology Inc.",
        "summary": "Biocure Technology Inc. develops and commercializes biopharmaceutical technologies for uses in recombinant and ranibizumab. The company is developing Interferons- Ã\u009f for the treatment of multiple sclerosis; Ranibizumab, a monoclonal antibody fragment for the treatment of macular degeneration, as well as to treat a type of eye problem known as macular edema; and Filgrastim to treat neutropenia, a lack of white blood cells caused by cancer, bone marrow transplant, chemotherapy, or by other conditions. It is also developing CAR T Cell Therapy that identifies and destroys cancer cells; a foot and mouth disease vaccine; and a hair growth production product. Biocure Technology Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BIMUF": {
        "short_name": "PASCAL BIOSCIENCES INC",
        "long_name": "Pascal Biosciences Inc.",
        "summary": "Pascal Biosciences Inc., a biotechnology company, researches and develops products for the treatment of cancer, and for the enhancement of immune system. Its development portfolio includes PAS-403, a small molecule therapeutic advancing into clinical trials for the treatment of glioblastoma; and PAS-393, an immuno-stimulatory cannabinoid to be used in combination with checkpoint inhibitor therapy for cancer treatment. The company is also developing a B-cell targeted antibody for acute lymphoblastic leukemia and B cell lymphomas; and cannabinoid therapeutic for the treatment of COVID-19. The company has an exclusive license agreement with the University of Washington to develop a cannabinoid-based product for the treatment of glioblastoma multiforme and brain metastases; and a collaborative research agreement with SoRSE Technology Corporation to advance PAS-393 into clinical testing. Pascal Biosciences Inc. was founded in 2013 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BIOV.CN": {
        "short_name": "BioVaxysTech",
        "long_name": "BioVaxys Technology Corp.",
        "summary": "BioVaxys Technology Corp., a clinical biotechnology company, develops antiviral and anticancer vaccine platforms. It develops BVX-0320, a monovalent SARS-CoV-2 vaccine; and BVX-0918A, a haptenized tumor antigen vaccine for ovarian cancer, as well as and Covid-T, which screens for an immune system response in patients exposed to SARS-CoV-2. The company is also developing Papilocare for human papilloma virus (HPV)-dependent cervical lesions; BVX-0918C for cervical cancer; BVX-0204 HPV viral vaccine; and BVX-0121, a multivalent SARS-CoV-2 vaccine. BioVaxys Technology Corp. has a bioproduction agreement with WuXi Biologics Limited that produces SARS-CoV-2 s-proteins for BVX-0320 and Covid-T; research collaboration with The Ohio State University, Wexner School of Medicine for BVX-0320; and agreement with Bioanalytical Systems, Inc. to conduct preclinical toxicology studies for its Covid-T immunodiagnostic. The company is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BLU": {
        "short_name": "BELLUS Health Inc.",
        "long_name": "BELLUS Health Inc.",
        "summary": "BELLUS Health Inc., a clinical stage biopharmaceutical company, develops therapeutics for the treatment of chronic cough and other hypersensitization disorders. Its lead drug candidate includes BLU-5937, an oral small molecule antagonist of the P2X3 receptor, which is in Phase II clinical trial for treatment of chronic cough and chronic pruritus. The company was founded in 1993 and is headquartered in Laval, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Laval"
    },
    "BLU.TO": {
        "short_name": "BELLUS HEALTH INC.",
        "long_name": "BELLUS Health Inc.",
        "summary": "BELLUS Health Inc., a clinical stage biopharmaceutical company, develops therapeutics for the treatment of chronic cough and other hypersensitization disorders. Its lead drug candidate includes BLU-5937, an oral small molecule antagonist of the P2X3 receptor, which is in Phase II clinical trial for treatment of chronic cough and chronic pruritus. The company was founded in 1993 and is headquartered in Laval, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Laval"
    },
    "BMBIF": {
        "short_name": "BRIGHT MINDS BIOSCIENCES INC",
        "long_name": "Bright Minds Biosciences Inc.",
        "summary": "Bright Minds Biosciences Inc., a biotechnology company, develops 5-HT (serotonin) medicines to improve the lives of patients with severe and life-altering diseases. Its portfolio of selective 5-HT receptor agonists comprise 5-HT2C, 5-HT2A, and 5-HT2C/A for central nervous system -pediatric pharmacoresistant epilepsy, pain- cluster headache, migraine, fibromyalgia, chemotherapy induced neuropathy, neuropsychiatry-major depressive disorder, and impulse control disorder therapeutic areas. The company is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BOAA": {
        "short_name": "BIO AMERICA INC",
        "long_name": "Bio-America Inc.",
        "summary": "Bio-America Inc. operates as a biotechnology company that researches and develops drug- screening technologies for manufacturing anti-obesity, anti-infective, and oncology products. The company was founded in 1999 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "BRAXF": {
        "short_name": "BRAXIA SCIENTIFIC CORP",
        "long_name": "Braxia Scientific Corp.",
        "summary": "AltMed Capital Corp. operates as an alternative medicine business incubator, IP aggregator, and solutions provider. The company was founded in 2019 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BSYI": {
        "short_name": "BIOSYNTECH INC",
        "long_name": "BioSyntech, Inc.",
        "summary": "BioSyntech, Inc. develops biotherapeutic thermogels for tissue repair and therapeutic delivery. Its lead products in development include BST-CarGel, a biodegradable gel for cartilage repair; BST-InPod for heel pain relief; BST-DermOn for chronic wound healing; BST-Ossifil for bone filling; BST-Ossifix for bone structural support; and BST-Disc for intervertebral disc restoration. The company's products also comprise BST-Gel-based injectable products that deliver biotherapeutics to their targeted site of action; Arthro-BST, an arthroscopic device used for the non-destructive evaluation of cartilage degradation and/or repair; and Mach-1, a micromechanical testing system for evaluating the mechanical properties of tissues and materials. In addition, it manufactures ultra pure chitosans under the Ultrasan name; and offers manufacturing and analytical services. The company was incorporated in 1994 and is based in Laval, Canada. On May 12, 2010, Biosyntech Inc. filed for administration under the Bankruptcy and Insolvency Act. Biosyntech Inc. is in reorganization.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Laval"
    },
    "BVAXF": {
        "short_name": "BIOVAXYS TECHNOLOGY CORP",
        "long_name": "BioVaxys Technology Corp.",
        "summary": "BioVaxys Technology Corp., a clinical biotechnology company, develops antiviral and anticancer vaccine platforms. It develops BVX-0320, a monovalent SARS-CoV-2 vaccine; and BVX-0918A, a haptenized tumor antigen vaccine for ovarian cancer, as well as and Covid-T, which screens for an immune system response in patients exposed to SARS-CoV-2. The company is also developing Papilocare for human papilloma virus (HPV)-dependent cervical lesions; BVX-0918C for cervical cancer; BVX-0204 HPV viral vaccine; and BVX-0121, a multivalent SARS-CoV-2 vaccine. BioVaxys Technology Corp. has a bioproduction agreement with WuXi Biologics Limited that produces SARS-CoV-2 s-proteins for BVX-0320 and Covid-T; research collaboration with The Ohio State University, Wexner School of Medicine for BVX-0320; and agreement with Bioanalytical Systems, Inc. to conduct preclinical toxicology studies for its Covid-T immunodiagnostic. The company is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "CLXPF": {
        "short_name": "CYBIN INC",
        "long_name": "Cybin Inc.",
        "summary": "Cybin Inc., a life sciences company, focuses on developing psychedelic therapeutics to treat various psychiatric and neurological conditions. The company operates through two segments, Serenity Life and Natures Journey. The Serenity Life segment engages in the research and development of pharmaceutical and nutraceutical psilocybin products. The Natures Journey segment focuses on non-psychedelic medical mushroom nutraceutical products. The company offers its products through various form factors, such as capsules, powders, and effervescent tablets. Cybin Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "COTQF": {
        "short_name": "COTINGA PHARMACEUTICALS INC",
        "long_name": "Cotinga Pharmaceuticals Inc.",
        "summary": "Cotinga Pharmaceuticals Inc., a clinical-stage biopharmaceutical company, develops therapies for the treatment of cancer and other unmet medical needs. The company's lead compound is COTI-2, an oral small molecule targeting p53 a tumor suppressor gene. It also develops COTI-219, an oral small molecule compound targeting the mutant forms of KRAS without inhibiting normal KRAS functions. Cotinga Pharmaceuticals Inc. has a research collaboration with St. Vincent's University Hospital to evaluate COTI-2 in combination with eribulin in patients with triple negative metastatic breast cancer. The company was formerly known as Critical Outcome Technologies Inc. and changed its name to Cotinga Pharmaceuticals Inc. in January 2018. Cotinga Pharmaceuticals Inc. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "COV.V": {
        "short_name": "COVALON TECHNOLOGIES LTD",
        "long_name": "Covalon Technologies Ltd.",
        "summary": "Covalon Technologies Ltd. researches, develops, manufactures, commercializes, and licenses medical technologies and products in the United States, Canada, the United Kingdom, Europe, the Middle East, Asia, Latin America, and internationally. The company has five proprietary platform technologies, including collagen matrix platform that is used to manufacture a family of products to treat chronic and infected wounds, including diabetic ulcers, pressure ulcers, venous ulcers, donor and graft sites, traumatic wounds healing by secondary intention, dehisced surgical wounds, and first and second degree burns; antimicrobial silicone adhesive platform that is used for family of pre and post-surgical, and vascular access products that are designed to kill bacteria or yeast that comes into contact with the antimicrobial silicone providing broad-spectrum antimicrobial activity; medical coating platform, a proprietary process that utilizes photo-polymerization to create active grafting sites where new polymer chains are initiated and propagated from the surface of an existing medical device; aquaguard moisture barrier technology, an impermeable moisture barrier that allows the clinician or patient to cover wounds, dressings, and intravenous sites to keep them dry; and covaguard antimicrobial sanitizing technology that incorporates Benzalkonium Chloride into a lipid delivery system to surfaces and skin to kill viruses and bacteria. Its products include wound care dressings; surgical and peri-operative products; infection management products; moisture barriers; and antimicrobial sanitizers under the Covalon brand name. The company sells its products through third-party distribution networks and company's direct sales force. It serves hospitals, wound care centers, burn centers, extended/alternate care and acute care facilities, home health care agencies, and physicians' offices. The company is headquartered in Mississauga, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "CRPOF": {
        "short_name": "CEAPRO INC",
        "long_name": "Ceapro Inc.",
        "summary": "Ceapro Inc., a biotechnology company, engages in the development and commercialization of active ingredients in the United States, Germany, China, Canada, and internationally. It operates in two segments, The Active Ingredient Product Technology Industry and The Cosmeceutical Industry. The company is involved in the development and application of technology to the production of extracts and active ingredients from oats and other renewable plant resources. It adds value to its extracts by supporting their use in cosmeceutical, nutraceutical, and therapeutics products for humans and animals. The company's products include natural active ingredients comprising beta glucan, avenanthramides, oat powder, oat oil, oat peptides, and lupin peptides that are marketed to personal care, cosmetic, medical, and animal health industries through its distribution partners and direct sales; natural anti-aging skincare products; and veterinary therapeutic products, such as oat shampoos, ear cleansers, and dermal complexes/conditioners. Its products and technologies that are under research and development, or pre-commercial stage comprise a platform using its beta glucan formulations to deliver compounds for treatments in the personal and healthcare sectors; various novel enabling technologies, such as Pressurized Gas eXpanded drying technology; and technologies to enhance the content of avenanthramides. The company has a collaboration with the McMaster University to develop inhalable therapeutic for COVID-19; and a research project with the University of Alberta to expand the utilization of the PGX technology and generate ingredients targeting applications in functional food, dietary supplement, personal care, and pharmaceuticals. Ceapro Inc. was incorporated in 1997 and is headquartered in Edmonton, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "CURE.CN": {
        "short_name": "BiocureTechInc",
        "long_name": "Biocure Technology Inc.",
        "summary": "Biocure Technology Inc. develops and commercializes biopharmaceutical technologies for uses in recombinant and ranibizumab. The company is developing Interferons- Ã\u009f for the treatment of multiple sclerosis; Ranibizumab, a monoclonal antibody fragment for the treatment of macular degeneration, as well as to treat a type of eye problem known as macular edema; and Filgrastim to treat neutropenia, a lack of white blood cells caused by cancer, bone marrow transplant, chemotherapy, or by other conditions. It is also developing CAR T Cell Therapy that identifies and destroys cancer cells; a foot and mouth disease vaccine; and a hair growth production product. Biocure Technology Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "CVALF": {
        "short_name": "COVALON TECHNOLOGIES LTD",
        "long_name": "Covalon Technologies Ltd.",
        "summary": "Covalon Technologies Ltd. researches, develops, manufactures, commercializes, and licenses medical technologies and products in the United States, Canada, the United Kingdom, Europe, the Middle East, Asia, Latin America, and internationally. The company has five proprietary platform technologies, including collagen matrix platform that is used to manufacture a family of products to treat chronic and infected wounds, including diabetic ulcers, pressure ulcers, venous ulcers, donor and graft sites, traumatic wounds healing by secondary intention, dehisced surgical wounds, and first and second degree burns; antimicrobial silicone adhesive platform that is used for family of pre and post-surgical, and vascular access products that are designed to kill bacteria or yeast that comes into contact with the antimicrobial silicone providing broad-spectrum antimicrobial activity; medical coating platform, a proprietary process that utilizes photo-polymerization to create active grafting sites where new polymer chains are initiated and propagated from the surface of an existing medical device; aquaguard moisture barrier technology, an impermeable moisture barrier that allows the clinician or patient to cover wounds, dressings, and intravenous sites to keep them dry; and covaguard antimicrobial sanitizing technology that incorporates Benzalkonium Chloride into a lipid delivery system to surfaces and skin to kill viruses and bacteria. Its products include wound care dressings; surgical and peri-operative products; infection management products; moisture barriers; and antimicrobial sanitizers under the Covalon brand name. The company sells its products through third-party distribution networks and company's direct sales force. It serves hospitals, wound care centers, burn centers, extended/alternate care and acute care facilities, home health care agencies, and physicians' offices. The company is headquartered in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "CYBN.NE": {
        "short_name": "CYBIN INC.",
        "long_name": "Cybin Inc.",
        "summary": "Cybin Inc., a life sciences company, focuses on developing psychedelic therapeutics to treat various psychiatric and neurological conditions. The company operates through two segments, Serenity Life and Natures Journey. The Serenity Life segment engages in the research and development of pharmaceutical and nutraceutical psilocybin products. The Natures Journey segment focuses on non-psychedelic medical mushroom nutraceutical products. The company offers its products through various form factors, such as capsules, powders, and effervescent tablets. Cybin Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NEO",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "CZO.V": {
        "short_name": "Ceapro Inc",
        "long_name": "Ceapro Inc.",
        "summary": "Ceapro Inc., a biotechnology company, engages in the development and commercialization of active ingredients in the United States, Germany, China, Canada, and internationally. It operates in two segments, The Active Ingredient Product Technology Industry and The Cosmeceutical Industry. The company is involved in the development and application of technology to the production of extracts and active ingredients from oats and other renewable plant resources. It adds value to its extracts by supporting their use in cosmeceutical, nutraceutical, and therapeutics products for humans and animals. The company's products include natural active ingredients comprising beta glucan, avenanthramides, oat powder, oat oil, oat peptides, and lupin peptides that are marketed to personal care, cosmetic, medical, and animal health industries through its distribution partners and direct sales; natural anti-aging skincare products; and veterinary therapeutic products, such as oat shampoos, ear cleansers, and dermal complexes/conditioners. Its products and technologies that are under research and development, or pre-commercial stage comprise a platform using its beta glucan formulations to deliver compounds for treatments in the personal and healthcare sectors; various novel enabling technologies, such as Pressurized Gas eXpanded drying technology; and technologies to enhance the content of avenanthramides. The company has a collaboration with the McMaster University to develop inhalable therapeutic for COVID-19; and a research project with the University of Alberta to expand the utilization of the PGX technology and generate ingredients targeting applications in functional food, dietary supplement, personal care, and pharmaceuticals. Ceapro Inc. was incorporated in 1997 and is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "DOSE.CN": {
        "short_name": "RapidDose",
        "long_name": "Rapid Dose Therapeutics Corp.",
        "summary": "Rapid Dose Therapeutics Corp., a life sciences company, provides drug delivery technologies designed to enhance outcomes and quality of lives in Canada. The company offers QuickStrip, an oral fast-dissolving drug delivery system to rapidly release active ingredients into the blood stream, such as pharmaceuticals, emulsified oils, and over-the-counter medicines; QuickStrip energy to deliver energizing caffeine; QuickStrip B12 to deliver vitamin B12 in the system; and QuickStrip sleep that delivers melatonin in the system. It also offers PharmaStrip delivery system. The company also provides product innovation, production, and consultation services to the nutraceutical, cannabis healthcare, and pharmaceutical manufacturing industries. It has a research partnership program with McMaster University for developing biopolymer compositions that can offer enhanced drug delivery performance when formulated in oral dissolvable thin films. Rapid Dose Therapeutics Corp. is based in Burlington, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Burlington"
    },
    "DRUG.CN": {
        "short_name": "BrightMindsBio",
        "long_name": "Bright Minds Biosciences Inc.",
        "summary": "Bright Minds Biosciences Inc., a biotechnology company, develops 5-HT (serotonin) medicines to improve the lives of patients with severe and life-altering diseases. Its portfolio of selective 5-HT receptor agonists comprise 5-HT2C, 5-HT2A, and 5-HT2C/A for central nervous system -pediatric pharmacoresistant epilepsy, pain- cluster headache, migraine, fibromyalgia, chemotherapy induced neuropathy, neuropsychiatry-major depressive disorder, and impulse control disorder therapeutic areas. The company is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "E031.F": {
        "short_name": "ESSA PHARMA INC.",
        "long_name": "ESSA Pharma Inc.",
        "summary": "ESSA Pharma Inc., a clinical stage pharmaceutical company, focuses on developing novel and proprietary therapies for the treatment of prostate cancer. It develops EPI-7386, an oral candidate that is in a Phase I clinical study for the treatment of patients with metastatic castration-resistant prostate cancer. The company was founded in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "EBM.V": {
        "short_name": "EASTWOOD BIO MEDICAL CANADA INC",
        "long_name": "Eastwood Bio-Medical Canada Inc.",
        "summary": "Eastwood Bio-Medical Canada Inc. distributes natural health supplements under the Eleotin brand in Canada, the United States, and Asia. The company distributes Eleotin and related products. Its products provide natural sourced solutions for metabolic syndromes, such as blood glucose disorders, obesity, and hypertension. The company's licensed products include Eleotin A 700 for the treatment for spleen deficiency, lack of appetite, and fatigue; Eleotin AL88 for laxative; Eleotin Cal20 for bone and teeth maintenance; Eleotin V3D for development and maintenance of bones and teeth; Eleotin G2000 for cardiovascular health; Eleotin H55 for sedative and tension relief; and Eleotin Zn330 for tissue formation and metabolism. Its products also include Eleotin Bentley to promote healthy glucose levels; and Eleotin LBM for hypertension relief. Eastwood Bio-Medical Canada Inc. was incorporated in 2010 and is headquartered in Richmond, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Richmond"
    },
    "EDSA": {
        "short_name": "Edesa Biotech, Inc.",
        "long_name": "Edesa Biotech, Inc.",
        "summary": "Edesa Biotech, Inc., a clinical-stage biopharmaceutical company, engages in the research and development, manufacture, and commercialization of pharmaceutical products for inflammatory and immune-related diseases. Its lead product candidates are EB05, a monoclonal antibody, which is in Phase 2/Phase 3 clinical study for the treatment of acute respiratory distress syndrome in covid-19 patients; and EB01, a topical cream containing non-steroidal anti-inflammatory compound that is in Phase 2B clinical study to treat chronic allergic contact dermatitis. The company also develops EB02, an extension of sPLA2 anti-inflammatory cream for treating erythema, swelling, and exudation associated with hemorrhoids disease; and EB06, a monoclonal antibody candidate. It has a collaboration agreement with NovImmune SA to develop products containing toll-like receptor 4 and chemokine ligand 10 for therapeutic, prophylactic, and diagnostic applications in humans and animals; and Yissum Research Development Company for the development of products for therapeutic, prophylactic, and diagnostic uses in topical dermal and anorectal applications, as well as for the use in dermatologic and gastrointestinal conditions. Edesa Biotech, Inc. was founded in 2015 and is headquartered in Markham, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Canada",
        "city": "Markham"
    },
    "ENBI.CN": {
        "short_name": "Entheon Biomed",
        "long_name": "Entheon Biomedical Corp.",
        "summary": "Entheon Biomedical Corp., a biotechnology research and drug development company, engages in developing and commercializing various N,N-dimethyltryptamine based psychedelic therapeutic products for treating addiction and substance use disorders. The company is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "EPIX": {
        "short_name": "ESSA Pharma Inc.",
        "long_name": "ESSA Pharma Inc.",
        "summary": "ESSA Pharma Inc., a clinical stage pharmaceutical company, focuses on developing novel and proprietary therapies for the treatment of prostate cancer. It develops EPI-7386, an oral candidate that is in a Phase I clinical study for the treatment of patients with metastatic castration-resistant prostate cancer. The company was founded in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "EPRX.TO": {
        "short_name": "EUPRAXIA PHARMACEUTICALS INC",
        "long_name": "Eupraxia Pharmaceuticals Inc.",
        "summary": "Eupraxia Pharmaceuticals Inc., a clinical stage biotechnology company, engages in the discovery, development, and marketing of technologies in the biotechnology sector. The company's lead product candidate is EP-104IAR, which is in a Phase II clinical trial for the treatment of unmet medical needs and for pain relief for knee osteoarthritis, as well as under development for treating canine and equine osteoarthritis. Its products in development also include EP-201, an antibiotic for post-surgical site infections; and EP-105, an extended-release post-surgical anesthetic for post-surgical pain. The company was formerly known as Plaza Capital Partners Inc. and changed its name to Eupraxia Pharmaceuticals Inc. in May 2012. Eupraxia Pharmaceuticals Inc. was incorporated in 2011 and is headquartered in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "EWOOF": {
        "short_name": "EASTWOOD BIO-MED CDA INC",
        "long_name": "Eastwood Bio-Medical Canada Inc.",
        "summary": "Eastwood Bio-Medical Canada Inc. distributes natural health supplements under the Eleotin brand in Canada, the United States, and Asia. The company distributes Eleotin and related products. Its products provide natural sourced solutions for metabolic syndromes, such as blood glucose disorders, obesity, and hypertension. The company's licensed products include Eleotin A 700 for the treatment for spleen deficiency, lack of appetite, and fatigue; Eleotin AL88 for laxative; Eleotin Cal20 for bone and teeth maintenance; Eleotin V3D for development and maintenance of bones and teeth; Eleotin G2000 for cardiovascular health; Eleotin H55 for sedative and tension relief; and Eleotin Zn330 for tissue formation and metabolism. Its products also include Eleotin Bentley to promote healthy glucose levels; and Eleotin LBM for hypertension relief. Eastwood Bio-Medical Canada Inc. was incorporated in 2010 and is headquartered in Richmond, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Richmond"
    },
    "FUSN": {
        "short_name": "Fusion Pharmaceuticals Inc.",
        "long_name": "Fusion Pharmaceuticals Inc.",
        "summary": "Fusion Pharmaceuticals Inc., a clinical-stage oncology company, focuses on developing radiopharmaceuticals as precision medicines. The company has developed Targeted Alpha Therapies platform together with its proprietary Fast-Clear linker technology to enable us to connect alpha particle emitting isotopes to antibodies and other targeting molecules in order to selectively deliver the alpha particle payloads to tumors. Its lead product candidate is FPI-1434 that is in Phase 1 clinical trials as a monotherapy in patients with solid tumors expressing insulin-like growth factor 1 receptor. The company is also conducting additional preclinical studies of FPI-1434 in combination with approved checkpoint inhibitors and DNA damage response inhibitors to further assess the anti-tumor activity, and dosing schedule and pharmacodynamics of the combinations. In addition, it is involved in the progressing of its earlier-stage product candidate, FPI-1966 into clinical development for the treatment of head and neck, and bladder cancers expressing fibroblast growth factor receptor. Fusion Pharmaceuticals Inc. was incorporated in 2014 and is headquartered in Hamilton, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Hamilton"
    },
    "GLOW.CN": {
        "short_name": "GlowLifeTech",
        "long_name": "Glow Lifetech Corp.",
        "summary": "Glow Lifetech Corp., a biotechnology company, focuses on producing nutraceutical and cannabinoid-based products in North America. The company engages in the commercialization of two technologies, such as MyCell Enhanced technology, a nutraceutical and cannabis nutrient delivery technology; and a cannabis Smart Consumption System to assist users and patients to store, journal, control, consume, and manage cannabis related products. The company has the exclusive North American rights for the production, sale, and distribution rights for the certain micellization technology for cannabis and hemp derived ingredients, curcumin, vitamin K, and iron. It also engages in the business of secondary processing of ingredients to produce micellized materials from certain vitamins, nutraceuticals, and cannabis extracts that makes fat-soluble substances available for immediate absorption into the body reach near 100% bioavailability and water compatibility. The company was incorporated in 2018 and is based in Toronto, Canada. Glow Lifetech Corp. operates as a subsidiary of Relay Medical Corp.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GSD.V": {
        "short_name": "DEVONIAN HEALTH GROUP INC",
        "long_name": "Devonian Health Group Inc.",
        "summary": "Devonian Health Group Inc. engages in the development of botanical drugs. Its lead product candidate is Thykamine, a Phase IIa clinical trial product for the treatment of ulcerative colitis and atopic dermatitis. The company also develops Pantoprazole Magnesium for the treatment of gastric or duodenal ulcers; Cleo-35 for the treatment of hormonal acne in women; and value-added products for dermo-cosmetics. In addition, it acquires drug and health product licenses, as well as distributes pharmaceutical products. Devonian Health Group Inc. has a strategic alliance with CannTx Life Sciences Inc. for the development of cannabinoid-based pharmaceutical drugs. The company was incorporated in 2015 and is headquartered in QuÃ©bec, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "QuÃ©bec"
    },
    "HAVLF": {
        "short_name": "HAVN LIFE SCIENCES INC",
        "long_name": "HAVN Life Sciences Inc.",
        "summary": "HAVN Life Sciences Inc., a biotechnology company, engages in the research and development of psychopharmacological products from plants and fungi. The company was founded in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "HAVN.CN": {
        "short_name": "HAVNLifeSci",
        "long_name": "HAVN Life Sciences Inc.",
        "summary": "HAVN Life Sciences Inc., a biotechnology company, engages in the research and development of psychopharmacological products from plants and fungi. The company was founded in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "HBP.F": {
        "short_name": "HELIX BIOPHARMA CORP.",
        "long_name": "Helix BioPharma Corp.",
        "summary": "Helix BioPharma Corp. operates as an immune-oncology company in Canada. It is developing L-DOS47 for the treatment of non-small cell lung cancer; and V-DOS47 that targets the vascular epithelial growth factor receptor 2. Helix BioPharma Corp. has collaboration agreements with Moffitt Cancer Center to investigate the pharmacodynamics of L-DOS47 and determine the benefits of combining L-DOS47 with immune checkpoint inhibitors; and with ProMab Biotechnologies, Inc. to develop novel antibody and chimeric antigen receptor T-cell therapy to treat multiple myeloma, as well as a license agreements with Xisle Pharma Ventures Trust and National Research of Council Canada. The company is headquartered in Richmond Hill, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Richmond Hill"
    },
    "HBP.TO": {
        "short_name": "HELIX BIOPHARM",
        "long_name": "Helix BioPharma Corp.",
        "summary": "Helix BioPharma Corp. operates as an immune-oncology company in Canada. It is developing L-DOS47 for the treatment of non-small cell lung cancer; and V-DOS47 that targets the vascular epithelial growth factor receptor 2. Helix BioPharma Corp. has collaboration agreements with Moffitt Cancer Center to investigate the pharmacodynamics of L-DOS47 and determine the benefits of combining L-DOS47 with immune checkpoint inhibitors; and with ProMab Biotechnologies, Inc. to develop novel antibody and chimeric antigen receptor T-cell therapy to treat multiple myeloma, as well as a license agreements with Xisle Pharma Ventures Trust and National Research of Council Canada. The company is headquartered in Richmond Hill, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Richmond Hill"
    },
    "HEM.V": {
        "short_name": "HEMOSTEMIX INC",
        "long_name": "Hemostemix Inc.",
        "summary": "Hemostemix Inc., a clinical-stage biotechnology company, develops, manufactures, and commercializes blood-derived cell therapies for medical conditions. It develops cell therapy products from the patient's own blood, a relatively non-invasive source of therapeutic cells. The company's lead product is ACP-01, an autologous cell therapy for the treatment of critical limb ischemia, peripheral arterial disease, angina, ischemic cardiomyopathy, dilated cardiomyopathy, and other conditions of ischemia that is in Phase II clinical trial in Canada and the United States. It also offers various types of synergetic cell populations, such as angiogenic cell precursors, myocardial cell precursors, neural cell precursors, and bone cell precursors. Hemostemix Inc. is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "HMTXF": {
        "short_name": "HEMOSTEMIX INC",
        "long_name": "Hemostemix Inc.",
        "summary": "Hemostemix Inc., a clinical-stage biotechnology company, develops, manufactures, and commercializes blood-derived cell therapies for medical conditions. It develops cell therapy products from the patient's own blood, a relatively non-invasive source of therapeutic cells. The company's lead product is ACP-01, an autologous cell therapy for the treatment of critical limb ischemia, peripheral arterial disease, angina, ischemic cardiomyopathy, dilated cardiomyopathy, and other conditions of ischemia that is in Phase II clinical trial in Canada and the United States. It also offers various types of synergetic cell populations, such as angiogenic cell precursors, myocardial cell precursors, neural cell precursors, and bone cell precursors. Hemostemix Inc. is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "I4AA.F": {
        "short_name": "INTELLIPHARMACEUTICS INTL",
        "long_name": "Intellipharmaceutics International Inc.",
        "summary": "Intellipharmaceutics International Inc., a pharmaceutical company, researches, develops, and manufactures novel and generic controlled-release and targeted-release oral solid dosage drugs in the United States. It develops various drug delivery systems, product candidates, and a pipeline of products based on its patented Hypermatrix technology in various therapeutic areas, including neurology, cardiovascular, gastrointestinal tract, diabetes, and pain. The company offers Focalin XR, a dexmethylphenidate hydrochloride extended-release capsule for hyperactivity disorder; Keppra XR, a levetiracetam extended-release tablet for the treatment of partial onset seizures in patients with epilepsy; Glucophage XR, a metformin hydrochloride extended-release tablet that treats type 2 diabetes; and Effexor XR, a venlafaxine hydrochloride extended-release capsule to treat depression. It also provides Seroquel XR, a quetiapine fumarate extended-release tablet for the treatment of schizophrenia, bipolar disorder, and major depressive disorders; Pristiq, a desvenlafaxine extended-release tablet to treat depression; and Regabatin XR and Lyrica, a pregabalin extended-release capsule for the management of neuropathic pain. In addition, the company offers Protonix, a pantoprazole sodium delayed-release tablet to treat gastroesophageal reflux disease; Lamictal XR, a lamotrigine extended release tablet to treat epilepsy; Oleptro, a trazodone hydrochloride extended-release tablet to treat depression; Coreg CR, a carvedilol phosphate extended-release capsule for heart failure and hypertension; OxyContin, an oxycodone hydrochloride controlled-release capsule for pain; and Ranexa, a ranolazine extended release tablet for chronic angina. Further, it is developing Oxycodone ER, an extended release tablet for relief of pain. The company has a license and commercialization agreement with Par Pharmaceutical Inc. The company was founded in 1998 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "IBT.F": {
        "short_name": "IBEX TECHS INC.",
        "long_name": "IBEX Technologies Inc.",
        "summary": "IBEX Technologies Inc., through its subsidiaries, manufactures and markets enzymes for biomedical use in Canada, the United States, the United Kingdom, and internationally. It offers a portfolio of recombinant glycosaminoglycan lyases, including Heparinase I, Heparinase II, Heparinase III, Chondroitinase AC, and Chondroitinase B; cartilage assays for the study of synthesis and degradation of connective tissue components; collagen antibodies; and diamine oxidase liquid. The company also manufactures and markets a range of arthritis assays, which are used in osteoarthritis research. In addition, it provides services, such as filling and lyophilization for making disposable medical device components; and custom fermentation and micro dispensing of enzymes, as well as contract manufacturing. It serves manufacturers of medical devices, quality control labs, and academic research institutions. IBEX Technologies Inc. was founded in 1986 and is based in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "IBT.V": {
        "short_name": "IBEX TECHNOLOGIES INC.",
        "long_name": "IBEX Technologies Inc.",
        "summary": "IBEX Technologies Inc., through its subsidiaries, manufactures and markets enzymes for biomedical use in Canada, the United States, the United Kingdom, and internationally. It offers a portfolio of recombinant glycosaminoglycan lyases, including Heparinase I, Heparinase II, Heparinase III, Chondroitinase AC, and Chondroitinase B; cartilage assays for the study of synthesis and degradation of connective tissue components; collagen antibodies; and diamine oxidase liquid. The company also manufactures and markets a range of arthritis assays, which are used in osteoarthritis research. In addition, it provides services, such as filling and lyophilization for making disposable medical device components; and custom fermentation and micro dispensing of enzymes, as well as contract manufacturing. It serves manufacturers of medical devices, quality control labs, and academic research institutions. IBEX Technologies Inc. was founded in 1986 and is based in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "ICO.V": {
        "short_name": "ICO THERAPEUTICS INC.",
        "long_name": "iCo Therapeutics Inc.",
        "summary": "iCo Therapeutics Inc., a biotechnology company, focuses on the identification, development, and commercialization of drug candidates to treat ocular and infectious diseases. Its in-licensed product candidates include iCo-008, a human monoclonal antibody, which is in Phase II clinical trial to treat ulcerative colitis and bullous pemphigoid; and Oral AmpB Delivery System, an oral formulation of Amphotericin B that is in Phase 1b clinical trial for the treatment of systemic fungal and parasitic infections. The company was incorporated in 2005 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "IGX.V": {
        "short_name": "INTELGENX TECHNOLOGIES CORP.",
        "long_name": "IntelGenx Technologies Corp.",
        "summary": "IntelGenx Technologies Corp., a drug delivery company, focuses on the development and manufacturing of novel oral thin film products for the pharmaceutical market. It offers INT0008/2008, a Rizatriptan oral film product for the treatment of migraine. The company's products under development comprise INT0004/2006, an antidepressant; INT0046/2018 for adult use; INT0007/2006 for the treatment of erectile dysfunction; INT0010/2006 for the treatment of neuropathic pain and nausea in cancer patients; INT0027/2011 to treat opioid addition; INT0036/2013 for schizophrenia; and INT0043/2015 to treat Alzheimer's disease; and INT0048/2020 for animal health. It is also developing INT0039/2013, INT0040/2014, INT0052/2020, and INT0053/2020. The company has licensing, development, and supply agreement with Tilray, Inc. and Gensco Pharma; and development agreement with Cynapsus Therapeutics Inc. IntelGenx Technologies Corp. was founded in 2003 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "IGXT": {
        "short_name": "INTELGENX TECHNOLOGIES CORPORAT",
        "long_name": "IntelGenx Technologies Corp.",
        "summary": "IntelGenx Technologies Corp., a drug delivery company, focuses on the development and manufacturing of novel oral thin film products for the pharmaceutical market. It offers INT0008/2008, a Rizatriptan oral film product for the treatment of migraine. The company's products under development comprise INT0004/2006, an antidepressant; INT0046/2018 for adult use; INT0007/2006 for the treatment of erectile dysfunction; INT0010/2006 for the treatment of neuropathic pain and nausea in cancer patients; INT0027/2011 to treat opioid addition; INT0036/2013 for schizophrenia; and INT0043/2015 to treat Alzheimer's disease; and INT0048/2020 for animal health. It is also developing INT0039/2013, INT0040/2014, INT0052/2020, and INT0053/2020. The company has licensing, development, and supply agreement with Tilray, Inc. and Gensco Pharma; and development agreement with Cynapsus Therapeutics Inc. IntelGenx Technologies Corp. was founded in 2003 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "IKAP.F": {
        "short_name": "AURINIA PHARMACEUT.",
        "long_name": "Aurinia Pharmaceuticals Inc.",
        "summary": "Aurinia Pharmaceuticals Inc., a biopharmaceutical company, develops and commercializes therapies to treat various diseases with unmet medical need in Japan and China. The company offers LUPKYNIS for the treatment of adult patients with active lupus nephritis. It has a collaboration and license agreement with Otsuka Pharmaceutical Co., Ltd. The company is headquartered in Victoria, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "IMV": {
        "short_name": "IMV Inc.",
        "long_name": "IMV Inc.",
        "summary": "IMV Inc., a biopharmaceutical company, focuses on the development of cancer immunotherapies and vaccines against infectious diseases using its DPX delivery technology platform. The company's lead drug candidate includes maveropepimut-S (DPX-Survivac), a T cell therapy, which is in three Phase II clinical trials across 6 different cancer indications with and without Merck's Keytruda; and Phase II clinical trials for the treatment of ovarian cancer, and recurrent and refractory diffuse large B cell lymphoma. It is also developing DPX-COVID-19, a second-generation vaccine against severe acute respiratory syndrome coronavirus 2; and DPX-RSV, a vaccine candidate, which has completed Phase I clinical trials for the treatment of respiratory syncytial virus strain A, as well as DPX-SurMAGE for the treatment of bladder cancer and DPX-BRAF to treat melanoma patients. The company was formerly known as Immunovaccine Inc. and changed its name to IMV Inc. in May 2018. IMV Inc. was founded in 2000 and is headquartered in Dartmouth, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Canada",
        "city": "Dartmouth"
    },
    "IMV.TO": {
        "short_name": "IMV INC",
        "long_name": "IMV Inc.",
        "summary": "IMV Inc., a biopharmaceutical company, focuses on the development of cancer immunotherapies and vaccines against infectious diseases using its DPX delivery technology platform. The company's lead drug candidate includes maveropepimut-S (DPX-Survivac), a T cell therapy, which is in three Phase II clinical trials across 6 different cancer indications with and without Merck's Keytruda; and Phase II clinical trials for the treatment of ovarian cancer, and recurrent and refractory diffuse large B cell lymphoma. It is also developing DPX-COVID-19, a second-generation vaccine against severe acute respiratory syndrome coronavirus 2; and DPX-RSV, a vaccine candidate, which has completed Phase I clinical trials for the treatment of respiratory syncytial virus strain A, as well as DPX-SurMAGE for the treatment of bladder cancer and DPX-BRAF to treat melanoma patients. The company was formerly known as Immunovaccine Inc. and changed its name to IMV Inc. in May 2018. IMV Inc. was founded in 2000 and is headquartered in Dartmouth, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Dartmouth"
    },
    "INM": {
        "short_name": "InMed Pharmaceuticals Inc.",
        "long_name": "InMed Pharmaceuticals Inc.",
        "summary": "InMed Pharmaceuticals Inc., a clinical stage pharmaceutical company, researches and develops cannabinoid-based therapies. The company's lead product is INM-755, a cannabinol topical cream, which is in a second Phase I clinical trials for the treatment of epidermolysis bullosa. The company is also involved in developing INM-088, which is in preclinical studies for the treatment of glaucoma; and INM-405 for the treatment of orofacial pain. In addition, it engages in the development of cannabinoid-based treatments for various diseases, including dermatology and ocular diseases. Further, the company works on IND-enabling pharmacology and preclinical toxicology studies. It has a research collaboration agreement with BayMedica Inc. for the manufacturing and testing of novel cannabinoid therapeutics. The company was formerly known as Cannabis Technologies Inc. and changed its name to InMed Pharmaceuticals Inc. in October 2014. InMed Pharmaceuticals Inc. was incorporated in 1981 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "IOT.V": {
        "short_name": "INNOVOTECH INC.",
        "long_name": "Innovotech Inc.",
        "summary": "Innovotech Inc. provides solutions to medical, agricultural, and industrial problems caused by microbial biofilms in Canada, the United States, and internationally. The company offers InnovoSIL, an antimicrobial agents for coating onto or incorporation into medical devices; MBEC Assay, a screening assay used to determine the efficacy of antimicrobials against biofilms of various microorganisms; and Agress/AgreGuard, an environmentally friendly seed treatments and plant sprays to protect crops against both bacterial and fungal infections. It also provides implant medical devices; antibiotic, antimicrobial, and biocide resistance; bacteriophage, cytotoxicity, and in vitro antimicrobial testing; and analytical services. Innovotech Inc. serves customers in the areas of biofilm issues, including catheter and implant medical devices, antibiotic drug development, wound healing, paint and specialized coatings, water system antimicrobial agents, dental treatments and water line antimicrobial agents, and bacterial and fungal agricultural crop diseases, as well as disinfectants in food safety, transportation, and healthcare. The company was incorporated in 2001 is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "IPA": {
        "short_name": "ImmunoPrecise Antibodies Ltd.",
        "long_name": "ImmunoPrecise Antibodies Ltd.",
        "summary": "ImmunoPrecise Antibodies Ltd., together with its subsidiaries, engages in the antibody production and related services in the United States, Canada, Europe, and internationally. The company offers a range of antibodies, enzymes, enzyme activity assays, arthritis animal products, proteins, deiminated proteins, organoid growth factors, and hybridoma products for research purposes. Its services include custom antigen modeling, design, and manufacturing; B cell sorting, screening, and sequencing; custom, immune and naive phage display production and screening; hybridoma production with screening and clone-picking; transgenic animals and multi-species antibody discovery; antibody characterization studies, such as affinity measurements, functional assays and epitope mapping, and binning; bi-specific, tri-specific, VHH, and VNAR (shark) antibody manufacturing; DNA synthesis and cloning, protein and antibody downstream processing; antibody engineering; transient and stable cell line generation; antibody optimization and humanization; and cryopreservation. ImmunoPrecise Antibodies Ltd. was incorporated in 1983 and is based in Victoria, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "IPA.V": {
        "short_name": "IMMUNOPRECISE ANTIBODIES LTD",
        "long_name": "ImmunoPrecise Antibodies Ltd.",
        "summary": "ImmunoPrecise Antibodies Ltd., together with its subsidiaries, engages in the antibody production and related services in the United States, Canada, Europe, and internationally. The company offers a range of antibodies, enzymes, enzyme activity assays, arthritis animal products, proteins, deiminated proteins, organoid growth factors, and hybridoma products for research purposes. Its services include custom antigen modeling, design, and manufacturing; B cell sorting, screening, and sequencing; custom, immune and naive phage display production and screening; hybridoma production with screening and clone-picking; transgenic animals and multi-species antibody discovery; antibody characterization studies, such as affinity measurements, functional assays and epitope mapping, and binning; bi-specific, tri-specific, VHH, and VNAR (shark) antibody manufacturing; DNA synthesis and cloning, protein and antibody downstream processing; antibody engineering; transient and stable cell line generation; antibody optimization and humanization; and cryopreservation. ImmunoPrecise Antibodies Ltd. was incorporated in 1983 and is based in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "IPCI.TO": {
        "short_name": "INTELLIPHARMACEUTICS INTERNATIO",
        "long_name": "Intellipharmaceutics International Inc.",
        "summary": "Intellipharmaceutics International Inc., a pharmaceutical company, researches, develops, and manufactures novel and generic controlled-release and targeted-release oral solid dosage drugs in the United States. It develops various drug delivery systems, product candidates, and a pipeline of products based on its patented Hypermatrix technology in various therapeutic areas, including neurology, cardiovascular, gastrointestinal tract, diabetes, and pain. The company offers Focalin XR, a dexmethylphenidate hydrochloride extended-release capsule for hyperactivity disorder; Keppra XR, a levetiracetam extended-release tablet for the treatment of partial onset seizures in patients with epilepsy; Glucophage XR, a metformin hydrochloride extended-release tablet that treats type 2 diabetes; and Effexor XR, a venlafaxine hydrochloride extended-release capsule to treat depression. It also provides Seroquel XR, a quetiapine fumarate extended-release tablet for the treatment of schizophrenia, bipolar disorder, and major depressive disorders; Pristiq, a desvenlafaxine extended-release tablet to treat depression; and Regabatin XR and Lyrica, a pregabalin extended-release capsule for the management of neuropathic pain. In addition, the company offers Protonix, a pantoprazole sodium delayed-release tablet to treat gastroesophageal reflux disease; Lamictal XR, a lamotrigine extended release tablet to treat epilepsy; Oleptro, a trazodone hydrochloride extended-release tablet to treat depression; Coreg CR, a carvedilol phosphate extended-release capsule for heart failure and hypertension; OxyContin, an oxycodone hydrochloride controlled-release capsule for pain; and Ranexa, a ranolazine extended release tablet for chronic angina. Further, it is developing Oxycodone ER, an extended release tablet for relief of pain. The company has a license and commercialization agreement with Par Pharmaceutical Inc. The company was founded in 1998 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "IPCIF": {
        "short_name": "INTELLIPHARMACEUTICS INTL INC",
        "long_name": "Intellipharmaceutics International Inc.",
        "summary": "Intellipharmaceutics International Inc., a pharmaceutical company, researches, develops, and manufactures novel and generic controlled-release and targeted-release oral solid dosage drugs in the United States. It develops various drug delivery systems, product candidates, and a pipeline of products based on its patented Hypermatrix technology in various therapeutic areas, including neurology, cardiovascular, gastrointestinal tract, diabetes, and pain. The company offers Focalin XR, a dexmethylphenidate hydrochloride extended-release capsule for hyperactivity disorder; Keppra XR, a levetiracetam extended-release tablet for the treatment of partial onset seizures in patients with epilepsy; Glucophage XR, a metformin hydrochloride extended-release tablet that treats type 2 diabetes; and Effexor XR, a venlafaxine hydrochloride extended-release capsule to treat depression. It also provides Seroquel XR, a quetiapine fumarate extended-release tablet for the treatment of schizophrenia, bipolar disorder, and major depressive disorders; Pristiq, a desvenlafaxine extended-release tablet to treat depression; and Regabatin XR and Lyrica, a pregabalin extended-release capsule for the management of neuropathic pain. In addition, the company offers Protonix, a pantoprazole sodium delayed-release tablet to treat gastroesophageal reflux disease; Lamictal XR, a lamotrigine extended release tablet to treat epilepsy; Oleptro, a trazodone hydrochloride extended-release tablet to treat depression; Coreg CR, a carvedilol phosphate extended-release capsule for heart failure and hypertension; OxyContin, an oxycodone hydrochloride controlled-release capsule for pain; and Ranexa, a ranolazine extended release tablet for chronic angina. Further, it is developing Oxycodone ER, an extended release tablet for relief of pain. The company has a license and commercialization agreement with Par Pharmaceutical Inc. The company was founded in 1998 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "JAM1.F": {
        "short_name": "TETRA BIO-PHARMA INC.",
        "long_name": "Tetra Bio-Pharma Inc.",
        "summary": "Tetra Bio-Pharma Inc., a development stage biopharmaceutical company, engages in the discovery and development of immunomodulator drugs. It develops ARDS-003 for the treatment of sepsis and prevention of acute respiratory distress syndrome; Reduvo for chemotherapy-induced nausea and vomiting; PLENITUDE to treat advanced uncontrolled cancer pain; REBORN for the treatment of breakthrough cancer pain and fibromyalgia; and SERENITY to treat cancer cachexia. The company also develops PPP003 for painful dry eye and uveitis pain; and HCC011 for hepatocellular carcinoma. Tetra Bio-Pharma Inc. is headquartered in Orleans, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "OrlÃ©ans"
    },
    "KNBIF": {
        "short_name": "KANE BIOTECH INC",
        "long_name": "Kane Biotech Inc.",
        "summary": "Kane Biotech Inc., a biotechnology company, engages in the research, development, and commercialization of technologies and products that prevent and remove microbial biofilms in Canada and internationally. The company develops pet oral care products under the StrixNB and bluestem brands; animal and human wound care solutions under the DispersinB name; medical device coatings under the Aledex name; and shampoos for dogs, cats, and horses under the Alosera name. It also offers anti-itch shampoo under the silkstem name; scalp detoxifiers, shampoos, and shampoo bars under the DermaKB Biofilm brand name; and wound care products under the Coactiv+ name. The company was incorporated in 2001 and is based in Winnipeg, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "KNE.V": {
        "short_name": "KANE BIOTECH INC",
        "long_name": "Kane Biotech Inc.",
        "summary": "Kane Biotech Inc., a biotechnology company, engages in the research, development, and commercialization of technologies and products that prevent and remove microbial biofilms in Canada and internationally. The company develops pet oral care products under the StrixNB and bluestem brands; animal and human wound care solutions under the DispersinB name; medical device coatings under the Aledex name; and shampoos for dogs, cats, and horses under the Alosera name. It also offers anti-itch shampoo under the silkstem name; scalp detoxifiers, shampoos, and shampoo bars under the DermaKB Biofilm brand name; and wound care products under the Coactiv+ name. The company was incorporated in 2001 and is based in Winnipeg, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "LMNL": {
        "short_name": "Liminal BioSciences Inc.",
        "long_name": "Liminal BioSciences Inc.",
        "summary": "Liminal BioSciences Inc., a clinical-stage biopharmaceutical company, focuses on discovery, development, and commercialization of novel small molecule drug candidates for the treatment of patients suffering from respiratory fibrotic diseases and other fibrotic or inflammatory diseases that have high unmet medical needs. It operates through two segments, Small Molecule Therapeutics and Plasma-Derived Therapeutics. The Small Molecule Therapeutics segment's lead product candidate is fezagepras (PBI-4050), which is in Phase 1 for the treatment of idiopathic pulmonary fibrosis and respiratory diseases. The Plasma-Derived Therapeutics segment focused on the development of its plasma-derived product candidate Ryplazim, a purified glu-plasminogen derived from human plasma that acts as a plasminogen replacement therapy for patients deficient in plasminogen protein. The company operates in Canada, the United Kingdom, and the United States. The company was formerly known as Prometic Life Sciences Inc. and changed its name to Liminal BioSciences Inc. in October 2019. Liminal BioSciences Inc. was incorporated in 1994 and is headquartered in Laval, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Laval"
    },
    "LTIA.F": {
        "short_name": "APTOSE BIOSCIENCES NEW",
        "long_name": "Aptose Biosciences Inc.",
        "summary": "Aptose Biosciences Inc., a clinical-stage biotechnology company, discovers and develops personalized therapies addressing unmet medical needs in oncology in the United States. Its clinical programs is APTO-253, which is a Phase 1a/b clinical trial for the treatment of patients with relapsed or refractory blood cancers, including acute myeloid leukemia and high-risk myelodysplastic syndrome. It has an agreement with CrystalGenomics, Inc. to research, develop, and commercialize CG026806 and CG-806, which are in Phase 1a/b clinical trial for the treatment of patients with chronic lymphocytic leukemia, small lymphocytic lymphoma, and certain non-Hodgkin's lymphomas, as well as relapsed/refractory acute myeloid leukemia. The company also has an agreement with OHM Oncology for the development, manufacture, and commercialization of APL-581, a dual bromodomain and extra-terminal domain motif protein and kinase inhibitor program. The company was formerly known as Lorus Therapeutics Inc. and changed its name to Aptose Biosciences Inc. in August 2014. Aptose Biosciences Inc. was incorporated in 1986 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MBX.TO": {
        "short_name": "MICROBIX J",
        "long_name": "Microbix Biosystems Inc.",
        "summary": "Microbix Biosystems Inc., a life science company, manufactures viral and bacterial antigens and reagents for the diagnostics industry worldwide. The company produces infectious disease antigens, including viral, bacterial, and parasitic products, which are used in various applications, such as immunodiagnostic assays comprising ELISA, chemiluminescent automated immunoassays, immunohistochemistry, immunofluorescence, latex agglutination, rapid tests, and flow cytometry. Its infectious disease antigens also used in controls for diagnostic assays, basic and applied research in virology, microbiology, cell biology, immunology, and pathology, or for vaccine and antiviral research and development. The company also provides quality assessment products, including PROCEEDx Verification/Validation samples, which are research use only products for use in test system IQ/OQ/PQ, verification/validation, and training; PTDx proficiency testing products; and REDx Controls, which are designed to enhance the diagnostic quality outcome by early detection of the deviations from desired assay performance. In addition, it develops Kinlytic Urokinase for injection, a thrombolytic biologic drug used to treat blood clots; and LumiSort cell-sorting, a technology for sorting of particles that could be used to enrich cell populations of interest, such as in sexing semen. The company also offers viral transport media that stabilize the organisms in patient samples. Microbix Biosystems Inc. was founded in 1988 and is based in Mississauga, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "MBXBF": {
        "short_name": "MICROBIX BIOSYSTEMS",
        "long_name": "Microbix Biosystems Inc.",
        "summary": "Microbix Biosystems Inc., a life science company, manufactures viral and bacterial antigens and reagents for the diagnostics industry worldwide. The company produces infectious disease antigens, including viral, bacterial, and parasitic products, which are used in various applications, such as immunodiagnostic assays comprising ELISA, chemiluminescent automated immunoassays, immunohistochemistry, immunofluorescence, latex agglutination, rapid tests, and flow cytometry. Its infectious disease antigens also used in controls for diagnostic assays, basic and applied research in virology, microbiology, cell biology, immunology, and pathology, or for vaccine and antiviral research and development. The company also provides quality assessment products, including PROCEEDx Verification/Validation samples, which are research use only products for use in test system IQ/OQ/PQ, verification/validation, and training; PTDx proficiency testing products; and REDx Controls, which are designed to enhance the diagnostic quality outcome by early detection of the deviations from desired assay performance. In addition, it develops Kinlytic Urokinase for injection, a thrombolytic biologic drug used to treat blood clots; and LumiSort cell-sorting, a technology for sorting of particles that could be used to enrich cell populations of interest, such as in sexing semen. The company also offers viral transport media that stabilize the organisms in patient samples. Microbix Biosystems Inc. was founded in 1988 and is based in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "MCUJF": {
        "short_name": "MEDICURE INC",
        "long_name": "Medicure Inc.",
        "summary": "Medicure Inc., a biopharmaceutical company, engages in the research, development, and commercialization of human therapies for the cardiovascular market in the United States. The company markets and distributes AGGRASTAT injection, a glycoprotein GP IIb/IIIa receptor antagonist for the treatment of acute coronary syndrome, including unstable angina and non-Q-wave myocardial infarction. It also offers ZYPITAMAG to treat patients with primary hyperlipidemia or mixed dyslipidemia; and ReDS, a non-invasive medical device that offers measurement of lung fluid for the management of congestive heart failure, as well as Sodium Nitroprusside injection for the reduction of blood pressure for adult and pediatric patients in hypertensive crisis, as well as for producing controlled hypotension to reduce bleeding during surgery, and for the treatment of acute congestive heart failure. The company was founded in 1997 and is headquartered in Winnipeg, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "MCUR.CN": {
        "short_name": "MindCureHealth",
        "long_name": "Mind Cure Health Inc.",
        "summary": "Mind Cure Health Inc. engages in the development, manufacture, and distribution of a branded line of organic and functional mushroom powders. It also operates Mind Cure Health Center, which offers psychedelic-assisted mental health therapy to patients, as well as training to therapists. The company sells its products through online and retail stores in North America. Mind Cure Health Inc. was incorporated in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MCURF": {
        "short_name": "MIND CURE HEALTH INC",
        "long_name": "Mind Cure Health Inc.",
        "summary": "Mind Cure Health Inc. engages in the development, manufacture, and distribution of a branded line of organic and functional mushroom powders. It also operates Mind Cure Health Center, which offers psychedelic-assisted mental health therapy to patients, as well as training to therapists. The company sells its products through online and retail stores in North America. Mind Cure Health Inc. was incorporated in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MDFZF": {
        "short_name": "MEDIFOCUS INC",
        "long_name": "Medifocus Inc.",
        "summary": "Medifocus, Inc., a medical technology company, develops and commercializes minimally invasive focused heat systems for the treatment of cancerous and benign tumors, and enlarged prostate in Canada and the United States. The company owns technology platforms, including Endo-thermotherapy platform, a catheter-based focused heat technology platform that utilizes natural body openings to deliver microwave thermotherapy to the diseased sites; and Adaptive Phased Array (APA) Microwave Focusing platform, which directs focused microwave energy at tumor center to induce shrinkage or eradication of tumors without undue harm to surrounding tissue. It also offers Prolieve Thermodilatation system, a medical device based on endo-thermotherapy for the treatment of benign prostatic hyperplasia. In addition, the company is developing APA 1000, a minimally invasive breast cancer treatment system, which is in pivotal Phase-III clinical trials. The company has a license agreement with Duke University for the development of heat-activated and tumor-targeted immunotherapy and gene therapy technology for the treatment of cancers and other diseases. Medifocus, Inc. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MDNA": {
        "short_name": "Medicenna Therapeutics Corp.",
        "long_name": "Medicenna Therapeutics Corp.",
        "summary": "Medicenna Therapeutics Corp., a clinical stage immunotherapy company, develops and commercializes Empowered Cytokines (EC) and Superkines for the treatment of cancer. Its lead product is MDNA55, an interleukin- 4 (IL-4) EC that is in the Phase 2b clinical trial for the treatment of recurrent glioblastoma, as well as preclinical and clinical development stages for the treatment of other brain and non-brain tumors. The company also develops MDNA57 for solid tumors and non-malignant cells of the tumor micro-environment; MDNA109, an IL-2 agonist to treat cancer immunotherapies; MDNA209, an IL-2 antagonist for autoimmune diseases; MDNA413, a dual IL-4/IL-13 antagonist for the treatment of solid tumors, atopic dermatitis, asthma, and fibrosis; and MDNA132, an IL-13 agonist to treat solid tumors and IL 13Ralpha2 chimeric antigen receptor T cell. Medicenna Therapeutics Corp. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MDNA.TO": {
        "short_name": "MEDICENNA THERAPEUTICS CORP",
        "long_name": "Medicenna Therapeutics Corp.",
        "summary": "Medicenna Therapeutics Corp., a clinical stage immunotherapy company, develops and commercializes Empowered Cytokines (EC) and Superkines for the treatment of cancer. Its lead product is MDNA55, an interleukin- 4 (IL-4) EC that is in the Phase 2b clinical trial for the treatment of recurrent glioblastoma, as well as preclinical and clinical development stages for the treatment of other brain and non-brain tumors. The company also develops MDNA57 for solid tumors and non-malignant cells of the tumor micro-environment; MDNA109, an IL-2 agonist to treat cancer immunotherapies; MDNA209, an IL-2 antagonist for autoimmune diseases; MDNA413, a dual IL-4/IL-13 antagonist for the treatment of solid tumors, atopic dermatitis, asthma, and fibrosis; and MDNA132, an IL-13 agonist to treat solid tumors and IL 13Ralpha2 chimeric antigen receptor T cell. Medicenna Therapeutics Corp. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MIR.V": {
        "short_name": "MEDMIRA INC",
        "long_name": "MedMira Inc.",
        "summary": "MedMira Inc., a biotechnology company, researches, develops, manufactures, and commercializes rapid diagnostics and technology platforms in North America, Latin America, the Caribbean, Europe, and the Asia Pacific. The company's research is focused on specific areas of the diagnostics market, such as rapid, point-of-care, and in vitro sectors. It offers Reveal HIV that detects antibodies to HIV-1 and HIV-2 in whole blood, serum, or plasma; and Reveal HP, a rapid H. Pylori antibody test, which detects helicobacter pylori (HP) antibodies in serum, plasma, or whole blood produced in response to HP infection. The company also provides Reveal TP, a rapid syphilis antibody test that detects treponema pallidum antibodies in serum, plasma, or whole blood; Multiplo, a line of multiplex tests, including combination testing solutions for HIV-1/2, Hepatitis B and C, and Syphilis; and REVEALCOVID-19, an antibody test. In addition, it offers Miriad RVF toolkit that facilitates the development and commercialization of rapid diagnostics. MedMira Inc. sells its products through a network of medical distributors and strategic business development partners to customers in various sectors of the healthcare industry, including laboratories, hospitals, point-of-care clinics, governments, aid organizations, and public health agencies. The company was founded in 1993 and is headquartered in Halifax, Canada. MedMira Inc. is a subsidiary of MedMira Holding AG.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Halifax"
    },
    "MIST": {
        "short_name": "Milestone Pharmaceuticals Inc.",
        "long_name": "Milestone Pharmaceuticals Inc.",
        "summary": "Milestone Pharmaceuticals Inc., a biopharmaceutical company, focuses on the development and commercialization of cardiovascular medicines. It is developing etripamil, a novel channel blocker, which is in Phase III clinical trial for the treatment of paroxysmal supraventricular tachycardia in the United States and Canada, as well as in the Phase II clinical trial for the treatment of atrial fibrillation and rapid ventricular rate, and other cardiovascular indications. The company was incorporated in 2003 and is headquartered in MontrÃ©al, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "MMIRF": {
        "short_name": "MEDMIRA INC",
        "long_name": "MedMira Inc.",
        "summary": "MedMira Inc., a biotechnology company, researches, develops, manufactures, and commercializes rapid diagnostics and technology platforms in North America, Latin America, the Caribbean, Europe, and the Asia Pacific. The company's research is focused on specific areas of the diagnostics market, such as rapid, point-of-care, and in vitro sectors. It offers Reveal HIV that detects antibodies to HIV-1 and HIV-2 in whole blood, serum, or plasma; and Reveal HP, a rapid H. Pylori antibody test, which detects helicobacter pylori (HP) antibodies in serum, plasma, or whole blood produced in response to HP infection. The company also provides Reveal TP, a rapid syphilis antibody test that detects treponema pallidum antibodies in serum, plasma, or whole blood; Multiplo, a line of multiplex tests, including combination testing solutions for HIV-1/2, Hepatitis B and C, and Syphilis; and REVEALCOVID-19, an antibody test. In addition, it offers Miriad RVF toolkit that facilitates the development and commercialization of rapid diagnostics. MedMira Inc. sells its products through a network of medical distributors and strategic business development partners to customers in various sectors of the healthcare industry, including laboratories, hospitals, point-of-care clinics, governments, aid organizations, and public health agencies. The company was founded in 1993 and is headquartered in Halifax, Canada. MedMira Inc. is a subsidiary of MedMira Holding AG.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Halifax"
    },
    "MPH.V": {
        "short_name": "MEDICURE INC",
        "long_name": "Medicure Inc.",
        "summary": "Medicure Inc., a biopharmaceutical company, engages in the research, development, and commercialization of human therapies for the cardiovascular market in the United States. The company markets and distributes AGGRASTAT injection, a glycoprotein GP IIb/IIIa receptor antagonist for the treatment of acute coronary syndrome, including unstable angina and non-Q-wave myocardial infarction. It also offers ZYPITAMAG to treat patients with primary hyperlipidemia or mixed dyslipidemia; and ReDS, a non-invasive medical device that offers measurement of lung fluid for the management of congestive heart failure, as well as Sodium Nitroprusside injection for the reduction of blood pressure for adult and pediatric patients in hypertensive crisis, as well as for producing controlled hypotension to reduce bleeding during surgery, and for the treatment of acute congestive heart failure. The company was founded in 1997 and is headquartered in Winnipeg, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "MSET.CN": {
        "short_name": "MindsetPharma",
        "long_name": "Mindset Pharma Inc.",
        "summary": "Mindset Pharma Inc. operates as a neuro-pharmaceutical drug discovery and development platform company. It offers psychedelic compounds for treatment-resistant neurological and psychiatric disorders. The company is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MSSTF": {
        "short_name": "MINDSET PHARMA INC",
        "long_name": "Mindset Pharma Inc.",
        "summary": "Mindset Pharma Inc. operates as a neuro-pharmaceutical drug discovery and development platform company. It offers psychedelic compounds for treatment-resistant neurological and psychiatric disorders. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MWG.F": {
        "short_name": "INMED PHARMACEUT.",
        "long_name": "InMed Pharmaceuticals Inc.",
        "summary": "InMed Pharmaceuticals Inc., a clinical stage pharmaceutical company, researches and develops cannabinoid-based therapies. The company's lead product is INM-755, a cannabinol topical cream, which is in a second Phase I clinical trials for the treatment of epidermolysis bullosa. The company is also involved in developing INM-088, which is in preclinical studies for the treatment of glaucoma; and INM-405 for the treatment of orofacial pain. In addition, it engages in the development of cannabinoid-based treatments for various diseases, including dermatology and ocular diseases. Further, the company works on IND-enabling pharmacology and preclinical toxicology studies. It has a research collaboration agreement with BayMedica Inc. for the manufacturing and testing of novel cannabinoid therapeutics. The company was formerly known as Cannabis Technologies Inc. and changed its name to InMed Pharmaceuticals Inc. in October 2014. InMed Pharmaceuticals Inc. was incorporated in 1981 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MYND.CN": {
        "short_name": "MYNDLifeScien",
        "long_name": "MYND Lifesciencs Inc.",
        "summary": "MYND Life Science Inc. operates as a life sciences-based neuro-pharmaceutical drug development company, advancing medicines that leverage psychedelic compounds. It conducts research at the Michael Smith Laboratories at the University of British Columbia under a part J exemption granted by Health Canada to conduct research and development on restricted and controlled substances. The company has 38 licenses that allow for research into 38 different analogues of Psilocybin thereby determining which one is effective in modulating the Human Mycogene and subsequent decrease in inflammatory and immune responses leading to a reduction in depressive symptoms. MYND Life Science Inc. was incorporated in 2020 and is headquartered in Kelowna, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "NEON.CN": {
        "short_name": "NeonmindBio",
        "long_name": "NeonMind Biosciences Inc.",
        "summary": "NeonMind Biosciences Inc. engages in the discovery, development, and commercialization of medicinal and psychedelic mushrooms for mental illnesses. It is developing psilocybin based products comprising mushroom-infused beverages and other mushroom-infused products to treat weight loss and management, depression, cardiovascular, obesity, diabetes, and heart diseases. The company was formerly known as Flourish Mushroom Labs Inc. and changed its name to NeonMind Biosciences Inc. in April 2020. NeonMind Biosciences Inc. was incorporated in 2019 and is headquartered in Vancouver, Canada. NeonMind Biosciences Inc. is a subsidiary of The Yield Growth Corp.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NGEN.V": {
        "short_name": "NERVGEN PHARMA CORP",
        "long_name": "NervGen Pharma Corp.",
        "summary": "NervGen Pharma Corp., a biotech company, discovers and develops treatments for patients suffering from medical conditions related to nerve damage. Its lead product candidate is the NVG-291 that is in clinical studies for the treatment of spinal cord injuries (SCI), multiple sclerosis, and Alzheimer's disease. The company has a licensing agreement with Case Western Reserve University to research, develop, and commercialize a patented technology with therapeutic potential for SCI and other conditions associated with nerve damage. The company was incorporated in 2017 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NGENF": {
        "short_name": "NERVGEN PHARMA CORP",
        "long_name": "NervGen Pharma Corp.",
        "summary": "NervGen Pharma Corp., a biotech company, discovers and develops treatments for patients suffering from medical conditions related to nerve damage. Its lead product candidate is the NVG-291 that is in clinical studies for the treatment of spinal cord injuries (SCI), multiple sclerosis, and Alzheimer's disease. The company has a licensing agreement with Case Western Reserve University to research, develop, and commercialize a patented technology with therapeutic potential for SCI and other conditions associated with nerve damage. The company was incorporated in 2017 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NGQ1.F": {
        "short_name": "MEDICURE INC.",
        "long_name": "Medicure Inc.",
        "summary": "Medicure Inc., a biopharmaceutical company, engages in the research, development, and commercialization of human therapies for the cardiovascular market in the United States. The company markets and distributes AGGRASTAT injection, a glycoprotein GP IIb/IIIa receptor antagonist for the treatment of acute coronary syndrome, including unstable angina and non-Q-wave myocardial infarction. It also offers ZYPITAMAG to treat patients with primary hyperlipidemia or mixed dyslipidemia; and ReDS, a non-invasive medical device that offers measurement of lung fluid for the management of congestive heart failure, as well as Sodium Nitroprusside injection for the reduction of blood pressure for adult and pediatric patients in hypertensive crisis, as well as for producing controlled hypotension to reduce bleeding during surgery, and for the treatment of acute congestive heart failure. The company was founded in 1997 and is headquartered in Winnipeg, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "NMDBF": {
        "short_name": "NEONMIND BIOSCIENCES INC",
        "long_name": "NeonMind Biosciences Inc.",
        "summary": "NeonMind Biosciences Inc. engages in the discovery, development, and commercialization of medicinal and psychedelic mushrooms for mental illnesses. It is developing psilocybin based products comprising mushroom-infused beverages and other mushroom-infused products to treat weight loss and management, depression, cardiovascular, obesity, diabetes, and heart diseases. The company was formerly known as Flourish Mushroom Labs Inc. and changed its name to NeonMind Biosciences Inc. in April 2020. NeonMind Biosciences Inc. was incorporated in 2019 and is headquartered in Vancouver, Canada. NeonMind Biosciences Inc. is a subsidiary of The Yield Growth Corp.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NPAU.F": {
        "short_name": "BETTERLIFE PHARMA INC.",
        "long_name": "BetterLife Pharma Inc.",
        "summary": "BetterLife Pharma Inc., a biotechnology company, engages in the development and commercialization of psychedelic products for the treatment of mental disorders in Canada, the United States, Australia, and European Union. It is involved in refining and developing drug candidates from a set of complementary interferon-based technologies that have the potential to engage the immune system to fight virus infections, such as coronavirus disease and human papillomavirus, and/or to directly inhibit tumours to treat various types of cancer. BetterLife Pharma Inc. has a research agreement with the University of California San Diego for preclinical behavioral pharmacology studies of TD-0148A, a lysergic acid diethylamide derivative solution. The company was formerly known as Pivot Pharmaceuticals Inc. and changed its name to BetterLife Pharma Inc. in December 2019. BetterLife Pharma Inc. was founded in 2002 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NPCUF": {
        "short_name": "ALLON THERAPEUTICS INC",
        "long_name": "Allon Therapeutics Inc.",
        "summary": "Allon Therapeutics Inc., a clinical-stage biotechnology company, focuses on developing and marketing central nervous system therapies. Its preclinical drug candidate comprises AL-309 for the treatment of peripheral neuropathy. The company was formerly known as Neuro Discovery Inc. and changed its name to Allon Therapeutics Inc. in September 2004. Allon Therapeutics Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NSHS.CN": {
        "short_name": "NanoSphereHlth",
        "long_name": "NanoSphere Health Sciences Inc.",
        "summary": "Nanosphere Health Sciences Inc., a nano-biotechnology company, focuses on providing next generation delivery of biologically active compounds in the United States. Its nanoencapsulation technology delivers nutritive elements and medicants through licensing arrangements. The company was incorporated in 2005 is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NSHSF": {
        "short_name": "NANOSPHERE HEALTH SCIENCES INC",
        "long_name": "NanoSphere Health Sciences Inc.",
        "summary": "Nanosphere Health Sciences Inc., a nano-biotechnology company, focuses on providing next generation delivery of biologically active compounds in the United States. Its nanoencapsulation technology delivers nutritive elements and medicants through licensing arrangements. The company was incorporated in 2005 is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NSP.V": {
        "short_name": "NATURALLY SPLENDID ENTERPRISES ",
        "long_name": "Naturally Splendid Enterprises Ltd.",
        "summary": "Naturally Splendid Enterprises Ltd., a biotechnology and consumer products company, develops, produces, commercializes, sells, and licenses plant-derived, bio-active ingredients, nutrient dense foods, and related products in Canada, Japan, South Korea, Thailand, and Western Europe. The company offers nutrition for athletes under the Natera Sport brand; food energy bars under the WOODS WILD BAR; healthy snack bars under the ELEVATE ME brand; hemp for health under the CHII brand; products for dogs under the PawsitiveFX brand; and hemp and plant-based natural health products under the Natera FX brand. It also provides hemp processing, manufacturing, private label, and CBD extraction services; and distributes lifestyle and healthy meal replacement products. The company sells food and ingredients to commercial processors and consumers through grocery stores, health and nutrition stores, and online. Naturally Splendid Enterprises Ltd. was incorporated in 2010 and is headquartered in Pitt Meadows, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Pitt Meadows"
    },
    "NSPDF": {
        "short_name": "NATURALLY SPLENDID ENTERPRISES ",
        "long_name": "Naturally Splendid Enterprises Ltd.",
        "summary": "Naturally Splendid Enterprises Ltd., a biotechnology and consumer products company, develops, produces, commercializes, sells, and licenses plant-derived, bio-active ingredients, nutrient dense foods, and related products in Canada, Japan, South Korea, Thailand, and Western Europe. The company offers nutrition for athletes under the Natera Sport brand; food energy bars under the WOODS WILD BAR; healthy snack bars under the ELEVATE ME brand; hemp for health under the CHII brand; products for dogs under the PawsitiveFX brand; and hemp and plant-based natural health products under the Natera FX brand. It also provides hemp processing, manufacturing, private label, and CBD extraction services; and distributes lifestyle and healthy meal replacement products. The company sells food and ingredients to commercial processors and consumers through grocery stores, health and nutrition stores, and online. Naturally Splendid Enterprises Ltd. was incorporated in 2010 and is headquartered in Pitt Meadows, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Pitt Meadows"
    },
    "ONC.TO": {
        "short_name": "ONCOLYTICS BIOTECH INC",
        "long_name": "Oncolytics Biotech Inc.",
        "summary": "Oncolytics Biotech Inc., a development stage biopharmaceutical company, focuses on the discovery and development of pharmaceutical products for the treatment of cancer. Its lead product is pelareorep, an immuno-oncology viral-agent for the treatment of solid tumors and hematological malignancies. The company has collaboration agreements with Merck KGaA and Pfizer Inc. to co-develop pelareorep in combination with paclitaxel and avelumab, a human anti-PD-L1 antibody for the treatment of hormone-receptor positive, human epidermal growth factor 2-negative metastatic breast cancer; and PrECOG LLC. The company was incorporated in 1998 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "ONCY": {
        "short_name": "Oncolytics Biotech Inc.",
        "long_name": "Oncolytics Biotech Inc.",
        "summary": "Oncolytics Biotech Inc., a development stage biopharmaceutical company, focuses on the discovery and development of pharmaceutical products for the treatment of cancer. Its lead product is pelareorep, an immuno-oncology viral-agent for the treatment of solid tumors and hematological malignancies. The company has collaboration agreements with Merck KGaA and Pfizer Inc. to co-develop pelareorep in combination with paclitaxel and avelumab, a human anti-PD-L1 antibody for the treatment of hormone-receptor positive, human epidermal growth factor 2-negative metastatic breast cancer; and PrECOG LLC. The company was incorporated in 1998 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "ONYN.F": {
        "short_name": "ONCOLYTICS BIOTECH",
        "long_name": "Oncolytics Biotech Inc.",
        "summary": "Oncolytics Biotech Inc., a development stage biopharmaceutical company, focuses on the discovery and development of pharmaceutical products for the treatment of cancer. Its lead product is pelareorep, an immuno-oncology viral-agent for the treatment of solid tumors and hematological malignancies. The company has collaboration agreements with Merck KGaA and Pfizer Inc. to co-develop pelareorep in combination with paclitaxel and avelumab, a human anti-PD-L1 antibody for the treatment of hormone-receptor positive, human epidermal growth factor 2-negative metastatic breast cancer; and PrECOG LLC. The company was incorporated in 1998 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "P6P2.F": {
        "short_name": "REPLICEL LIFE SCIENCES",
        "long_name": "RepliCel Life Sciences Inc.",
        "summary": "RepliCel Life Sciences Inc., a regenerative medicine company, focuses on developing autologous cell therapies that treat functional cellular deficits. Its treatments use autologous cell therapy, which isolates an individual's own cells from harvested tissues and growing more in controlled conditions in a laboratory. The company's product candidates include RCT-01, which has completed Phase I clinical trials for the treatment of chronic tendinosis; RCS-01 that has completed Phase I clinical trials to treat aging and sun damaged skin; and RCH-01, which is in Phase II clinical trials for the treatment of hair loss. It is also developing RCI-02, a dermal injection device. The company has collaboration and technology transfer agreement with YOFOTO (China) Health Industry Co. Ltd. for establishing a clinical research program to develop and commercialize RCS-01 and RCT-01; and collaboration and technology transfer agreement with Shiseido Company, Limited for establishing a clinical research program for RCH-01. RepliCel Life Sciences Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PAS.V": {
        "short_name": "PASCAL BIOSCIENCES INC",
        "long_name": "Pascal Biosciences Inc.",
        "summary": "Pascal Biosciences Inc., a biotechnology company, researches and develops products for the treatment of cancer, and for the enhancement of immune system. Its development portfolio includes PAS-403, a small molecule therapeutic advancing into clinical trials for the treatment of glioblastoma; and PAS-393, an immuno-stimulatory cannabinoid to be used in combination with checkpoint inhibitor therapy for cancer treatment. The company is also developing a B-cell targeted antibody for acute lymphoblastic leukemia and B cell lymphomas; and cannabinoid therapeutic for the treatment of COVID-19. The company has an exclusive license agreement with the University of Washington to develop a cannabinoid-based product for the treatment of glioblastoma multiforme and brain metastases; and a collaborative research agreement with SoRSE Technology Corporation to advance PAS-393 into clinical testing. Pascal Biosciences Inc. was founded in 2013 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PHRM.CN": {
        "short_name": "PharmaTher",
        "long_name": "PharmaTher Holdings Ltd.",
        "summary": "Newscope Capital Corporation, through its subsidiary, PharmaTher Inc., a specialty life sciences company, focuses on the research and development of psychedelic pharmaceuticals to treat neuropsychiatric, neurological, and neuromuscular diseases. The company is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PHRRF": {
        "short_name": "PHARMATHER HOLDINGS LTD",
        "long_name": "PharmaTher Holdings Ltd.",
        "summary": "Newscope Capital Corporation, through its subsidiary, PharmaTher Inc., a specialty life sciences company, focuses on the research and development of psychedelic pharmaceuticals to treat neuropsychiatric, neurological, and neuromuscular diseases. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PJ2N.F": {
        "short_name": "LIMINAL BIOSCIENCES",
        "long_name": "Liminal BioSciences Inc.",
        "summary": "Liminal BioSciences Inc., a clinical-stage biopharmaceutical company, focuses on discovery, development, and commercialization of novel small molecule drug candidates for the treatment of patients suffering from respiratory fibrotic diseases and other fibrotic or inflammatory diseases that have high unmet medical needs. It operates through two segments, Small Molecule Therapeutics and Plasma-Derived Therapeutics. The Small Molecule Therapeutics segment's lead product candidate is fezagepras (PBI-4050), which is in Phase 1 for the treatment of idiopathic pulmonary fibrosis and respiratory diseases. The Plasma-Derived Therapeutics segment focused on the development of its plasma-derived product candidate Ryplazim, a purified glu-plasminogen derived from human plasma that acts as a plasminogen replacement therapy for patients deficient in plasminogen protein. The company operates in Canada, the United Kingdom, and the United States. The company was formerly known as Prometic Life Sciences Inc. and changed its name to Liminal BioSciences Inc. in October 2019. Liminal BioSciences Inc. was incorporated in 1994 and is headquartered in Laval, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Laval"
    },
    "PMN.TO": {
        "short_name": "PROMIS NEUROSCIENCES INC",
        "long_name": "ProMIS Neurosciences, Inc.",
        "summary": "ProMIS Neurosciences, Inc., a development stage biotech company, discovers and develops precision medicine solutions for the treatment of neurodegenerative diseases, primarily Alzheimer's disease (AD), amyotrophic lateral sclerosis (ALS), and Parkinson's disease (PD). Its proprietary target discovery engine is based on the use of two complementary techniques. The company applies its thermodynamic, computational discovery platformÂ\u0097ProMIS and Collective Coordinates to predict novel targets known as disease specific epitopes on the molecular surface of misfolded proteins. Its lead product candidates include PMN310, a monoclonal antibody (mAb); PMN350, a mAb targeting on toxic amyloid beta oligomers (AÃ\u009fO); and PMN330, a monoclonal antibody targeting toxic prion-like forms of AÃ\u009fO for AD. The company is also developing therapeutics targeting the neurotoxic form of the tau protein in AD; and superoxide dismustase 1 and TAR-DNA binding protein 43 in ALS, as well as alpha synuclein in PD and Lewy body dementia. The company has a collaboration with BC Neuroimmunology to develop and commercialize proprietary diagnostic assays; and BC Neuroimmunology to develop and offer blood-based diagnostic tests for Alzheimer's diseases. The company was formerly known as Amorfix Life Sciences Ltd. and changed its name to ProMIS Neurosciences, Inc. in July 2015. ProMIS Neurosciences, Inc. was incorporated in 2004 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "POLXF": {
        "short_name": "POLYDEX PHARMACEUTICALS INC",
        "long_name": "Polydex Pharmaceuticals Limited",
        "summary": "Polydex Pharmaceuticals Limited, through its subsidiaries, develops, manufactures, and markets biotechnology-based products for the human pharmaceutical market worldwide. The company also manufactures bulk pharmaceutical intermediates for the veterinary pharmaceutical industry. It primarily offers dextran and derivative products, including iron dextran, a derivative of dextran that is injected into pigs at birth as a treatment for anemia; and dextran sulphate, a specialty chemical derivative of dextran used in biotechnology applications and the pharmaceutical industry. In addition, the company develops Ushercell, a high molecular weight cellulose sulphate for topical vaginal use primarily in the prevention and transmission of AIDS and other sexually transmitted diseases, as well as unplanned pregnancies; and Usherdex 4, a low molecular weight dextran product to treat cystic fibrosis, a genetic disease. Further, it supplies ferric hydroxide and hydrogenated dextran solutions. Polydex Pharmaceuticals Limited sells its products through independent distributors and wholesalers, as well as directly to companies. The company was formerly known as Polydex Chemicals Limited and changed its name to Polydex Pharmaceuticals Limited in March 1984. Polydex Pharmaceuticals Limited was incorporated in 1979 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PREV.CN": {
        "short_name": "PreveCeuticalMe",
        "long_name": "PreveCeutical Medical Inc.",
        "summary": "PreveCeutical Medical Inc., a health sciences company, develops options for preventive and curative therapies utilizing organic and nature identical products in the United States and Canada. It has research and development programs, including dual gene therapy for curative and prevention therapies for type 2 diabetes and obesity; a soluble gel drug delivery program, which provide relief from pain, inflammation, seizures, and neurological disorders; Nature Identical peptide therapeutic applications; non-addictive analgesic peptides as a replacement to the addictive analgesics, such as morphine, fentanyl, and oxycodone; and a therapeutic product for treating athletes who suffer from concussions. It also provides medicinal cannabis-based products. PreveCeutical Medical Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PRVCF": {
        "short_name": "PREVECEUTICAL MEDICAL INC",
        "long_name": "PreveCeutical Medical Inc.",
        "summary": "PreveCeutical Medical Inc., a health sciences company, develops options for preventive and curative therapies utilizing organic and nature identical products in the United States and Canada. It has research and development programs, including dual gene therapy for curative and prevention therapies for type 2 diabetes and obesity; a soluble gel drug delivery program, which provide relief from pain, inflammation, seizures, and neurological disorders; Nature Identical peptide therapeutic applications; non-addictive analgesic peptides as a replacement to the addictive analgesics, such as morphine, fentanyl, and oxycodone; and a therapeutic product for treating athletes who suffer from concussions. It also provides medicinal cannabis-based products. PreveCeutical Medical Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "QPT.V": {
        "short_name": "QUEST PHARMATECH INC.",
        "long_name": "Quest PharmaTech Inc.",
        "summary": "Quest PharmaTech Inc., a biotechnology company, develops and commercializes antibody based immunotherapeutic products for cancer. The company focuses on combinatorial immunotherapeutic approaches to cancer by using monoclonal antibodies of the immunoglobulin G or E subclass in combination with chemotherapy/immune-adjuvant. Its lead product candidate is Oregovomab, a monoclonal antibody, which has completed Phase II clinical trial for the treatment of ovarian cancer. The company also owns the Photodynamic therapy technology for oncology and dermatology applications; and develops Mab AR 9.6 against truncated O-glycan on MUC16 for targeted cancer therapy applications. Quest PharmaTech Inc. is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "R5WP.F": {
        "short_name": "TRILLIUM THERAPEUTICS",
        "long_name": "Trillium Therapeutics Inc.",
        "summary": "Trillium Therapeutics Inc., a clinical stage immuno-oncology company, develops therapies for the treatment of cancer. Its include TTI-622, a SIRPa-IgG4 Fc fusion protein that is designed to enhance macrophage-mediated phagocytosis and anti-tumor activity by blocking the CD47, which is in Phase 1 clinical trials; and TTI-621, a SIRPa-IgG1 Fc fusion protein, which is in Phase 1 clinical trials and generates a signal blocking the CD47 for advanced relapsed or refractory hematologic malignancies, and solid tumors and mycosis fungoides. The company was formerly known as Stem Cell Therapeutics Corp. and changed its name to Trillium Therapeutics Inc. in June 2014. Trillium Therapeutics Inc. was incorporated in 2004 is based in Mississauga, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "R7E1.F": {
        "short_name": "CYBIN INC.",
        "long_name": "Cybin Inc.",
        "summary": "Cybin Inc., a life sciences company, focuses on developing psychedelic therapeutics to treat various psychiatric and neurological conditions. The company operates through two segments, Serenity Life and Natures Journey. The Serenity Life segment engages in the research and development of pharmaceutical and nutraceutical psilocybin products. The Natures Journey segment focuses on non-psychedelic medical mushroom nutraceutical products. The company offers its products through various form factors, such as capsules, powders, and effervescent tablets. Cybin Inc. is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "RDTCF": {
        "short_name": "RAPID DOSE THERAPEUTICS CORP",
        "long_name": "Rapid Dose Therapeutics Corp.",
        "summary": "Rapid Dose Therapeutics Corp., a life sciences company, provides drug delivery technologies designed to enhance outcomes and quality of lives in Canada. The company offers QuickStrip, an oral fast-dissolving drug delivery system to rapidly release active ingredients into the blood stream, such as pharmaceuticals, emulsified oils, and over-the-counter medicines; QuickStrip energy to deliver energizing caffeine; QuickStrip B12 to deliver vitamin B12 in the system; and QuickStrip sleep that delivers melatonin in the system. It also offers PharmaStrip delivery system. The company also provides product innovation, production, and consultation services to the nutraceutical, cannabis healthcare, and pharmaceutical manufacturing industries. It has a research partnership program with McMaster University for developing biopolymer compositions that can offer enhanced drug delivery performance when formulated in oral dissolvable thin films. Rapid Dose Therapeutics Corp. is based in Burlington, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Burlington"
    },
    "REPCF": {
        "short_name": "REPLICEL LIFE SCIENCES INC",
        "long_name": "RepliCel Life Sciences Inc.",
        "summary": "RepliCel Life Sciences Inc., a regenerative medicine company, focuses on developing autologous cell therapies that treat functional cellular deficits. Its treatments use autologous cell therapy, which isolates an individual's own cells from harvested tissues and growing more in controlled conditions in a laboratory. The company's product candidates include RCT-01, which has completed Phase I clinical trials for the treatment of chronic tendinosis; RCS-01 that has completed Phase I clinical trials to treat aging and sun damaged skin; and RCH-01, which is in Phase II clinical trials for the treatment of hair loss. It is also developing RCI-02, a dermal injection device. The company has collaboration and technology transfer agreement with YOFOTO (China) Health Industry Co. Ltd. for establishing a clinical research program to develop and commercialize RCS-01 and RCT-01; and collaboration and technology transfer agreement with Shiseido Company, Limited for establishing a clinical research program for RCH-01. RepliCel Life Sciences Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RFS.F": {
        "short_name": "RESVERLOGIX CORP",
        "long_name": "Resverlogix Corp.",
        "summary": "Resverlogix Corp. operates as a late-stage clinical biotechnology company. The company is developing apabetalone (RVX-208), a small molecule selective bromodomain and extra-terminal inhibitor that is in Phase III clinical trial for patients with cardiovascular, end-stage renal, chronic kidney, neurodegenerative, fabry, peripheral artery, and other orphan diseases, as well as diabetes mellitus. Resverlogix Corp. is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "RP.V": {
        "short_name": "REPLICEL LIFE SCIENCES INC",
        "long_name": "RepliCel Life Sciences Inc.",
        "summary": "RepliCel Life Sciences Inc., a regenerative medicine company, focuses on developing autologous cell therapies that treat functional cellular deficits. Its treatments use autologous cell therapy, which isolates an individual's own cells from harvested tissues and growing more in controlled conditions in a laboratory. The company's product candidates include RCT-01, which has completed Phase I clinical trials for the treatment of chronic tendinosis; RCS-01 that has completed Phase I clinical trials to treat aging and sun damaged skin; and RCH-01, which is in Phase II clinical trials for the treatment of hair loss. It is also developing RCI-02, a dermal injection device. The company has collaboration and technology transfer agreement with YOFOTO (China) Health Industry Co. Ltd. for establishing a clinical research program to develop and commercialize RCS-01 and RCT-01; and collaboration and technology transfer agreement with Shiseido Company, Limited for establishing a clinical research program for RCH-01. RepliCel Life Sciences Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RPTX": {
        "short_name": "Repare Therapeutics Inc.",
        "long_name": "Repare Therapeutics Inc.",
        "summary": "Repare Therapeutics Inc., a precision oncology company, discovers and develops novel therapeutics by using its synthetic lethality approach in Canada. The company use its SNIPRx, a proprietary, genome-wide, and CRISPR-enabled platform to systematically discover and develop highly targeted cancer therapies focused on genomic instability, including DNA damage repair. Its lead product candidate is RP-3500, an oral small molecule inhibitor for the treatment of solid tumors with specific DNA damage repair-related genomic alterations. It is also developing CCNE1-SL inhibitor, a proprietary drug discovery program for tumors with amplification of CCNE1; and Polymerase Theta program, a SL target associated with BRCA mutations and other genomic alterations. Repare Therapeutics Inc. was incorporated in 2016 and is headquartered in MontrÃ©al, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "RVX.TO": {
        "short_name": "RESVERLOGIX CORP.",
        "long_name": "Resverlogix Corp.",
        "summary": "Resverlogix Corp. operates as a late-stage clinical biotechnology company. The company is developing apabetalone (RVX-208), a small molecule selective bromodomain and extra-terminal inhibitor that is in Phase III clinical trial for patients with cardiovascular, end-stage renal, chronic kidney, neurodegenerative, fabry, peripheral artery, and other orphan diseases, as well as diabetes mellitus. Resverlogix Corp. is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "RVXCF": {
        "short_name": "RESVERLOGIX CORP",
        "long_name": "Resverlogix Corp.",
        "summary": "Resverlogix Corp. operates as a late-stage clinical biotechnology company. The company is developing apabetalone (RVX-208), a small molecule selective bromodomain and extra-terminal inhibitor that is in Phase III clinical trial for patients with cardiovascular, end-stage renal, chronic kidney, neurodegenerative, fabry, peripheral artery, and other orphan diseases, as well as diabetes mellitus. Resverlogix Corp. is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "SBM.V": {
        "short_name": "SIRONA BIOCHEM CORP.",
        "long_name": "Sirona Biochem Corp.",
        "summary": "Sirona Biochem Corp., a cosmetic ingredient and drug discovery company, develops and sells cosmetic and pharmaceutical active ingredients in Canada and France. It develops programs in the areas of diabetes, anti-inflammatories, and anti-infectives for therapeutics; and anti-aging and depigmenting agents in cosmeceuticals. The company was formerly known as High Rider Capital Inc. and changed its name to Sirona Biochem Corp. in May 2009. Sirona Biochem Corp. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "SP4P.F": {
        "short_name": "ACHIEVE LIFE SCIE. DL-001",
        "long_name": "Achieve Life Sciences, Inc.",
        "summary": "Achieve Life Sciences, Inc., a clinical-stage pharmaceutical company, develops and commercializes of cytisinicline for smoking cessation and nicotine addiction in the United States and internationally. The company offers cytisinicline, a plant-based alkaloid that interacts with nicotine receptors in the brain to help reduce the severity of nicotine withdrawal symptoms. It has license agreements with Sopharma AD and University of Bristol. The company is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "SRBCF": {
        "short_name": "SIRONA BIOCHEM CORPORATION",
        "long_name": "Sirona Biochem Corp.",
        "summary": "Sirona Biochem Corp., a cosmetic ingredient and drug discovery company, develops and sells cosmetic and pharmaceutical active ingredients in Canada and France. It develops programs in the areas of diabetes, anti-inflammatories, and anti-infectives for therapeutics; and anti-aging and depigmenting agents in cosmeceuticals. The company was formerly known as High Rider Capital Inc. and changed its name to Sirona Biochem Corp. in May 2009. Sirona Biochem Corp. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "TBP.TO": {
        "short_name": "TETRA BIO PHARMA INC",
        "long_name": "Tetra Bio-Pharma Inc.",
        "summary": "Tetra Bio-Pharma Inc., a development stage biopharmaceutical company, engages in the discovery and development of immunomodulator drugs. It develops ARDS-003 for the treatment of sepsis and prevention of acute respiratory distress syndrome; Reduvo for chemotherapy-induced nausea and vomiting; PLENITUDE to treat advanced uncontrolled cancer pain; REBORN for the treatment of breakthrough cancer pain and fibromyalgia; and SERENITY to treat cancer cachexia. The company also develops PPP003 for painful dry eye and uveitis pain; and HCC011 for hepatocellular carcinoma. Tetra Bio-Pharma Inc. is headquartered in Orleans, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "OrlÃ©ans"
    },
    "TBPMF": {
        "short_name": "TETRA BIO PHARMA INC",
        "long_name": "Tetra Bio-Pharma Inc.",
        "summary": "Tetra Bio-Pharma Inc., a development stage biopharmaceutical company, engages in the discovery and development of immunomodulator drugs. It develops ARDS-003 for the treatment of sepsis and prevention of acute respiratory distress syndrome; Reduvo for chemotherapy-induced nausea and vomiting; PLENITUDE to treat advanced uncontrolled cancer pain; REBORN for the treatment of breakthrough cancer pain and fibromyalgia; and SERENITY to treat cancer cachexia. The company also develops PPP003 for painful dry eye and uveitis pain; and HCC011 for hepatocellular carcinoma. Tetra Bio-Pharma Inc. is headquartered in Orleans, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "OrlÃ©ans"
    },
    "TQB.F": {
        "short_name": "IMMUNOPRECISE ANTIBOD.",
        "long_name": "ImmunoPrecise Antibodies Ltd.",
        "summary": "ImmunoPrecise Antibodies Ltd., together with its subsidiaries, engages in the antibody production and related services in the United States, Canada, Europe, and internationally. The company offers a range of antibodies, enzymes, enzyme activity assays, arthritis animal products, proteins, deiminated proteins, organoid growth factors, and hybridoma products for research purposes. Its services include custom antigen modeling, design, and manufacturing; B cell sorting, screening, and sequencing; custom, immune and naive phage display production and screening; hybridoma production with screening and clone-picking; transgenic animals and multi-species antibody discovery; antibody characterization studies, such as affinity measurements, functional assays and epitope mapping, and binning; bi-specific, tri-specific, VHH, and VNAR (shark) antibody manufacturing; DNA synthesis and cloning, protein and antibody downstream processing; antibody engineering; transient and stable cell line generation; antibody optimization and humanization; and cryopreservation. ImmunoPrecise Antibodies Ltd. was incorporated in 1983 and is based in Victoria, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Victoria"
    },
    "TRIL": {
        "short_name": "Trillium Therapeutics Inc.",
        "long_name": "Trillium Therapeutics Inc.",
        "summary": "Trillium Therapeutics Inc., a clinical stage immuno-oncology company, develops therapies for the treatment of cancer. Its include TTI-622, a SIRPa-IgG4 Fc fusion protein that is designed to enhance macrophage-mediated phagocytosis and anti-tumor activity by blocking the CD47, which is in Phase 1 clinical trials; and TTI-621, a SIRPa-IgG1 Fc fusion protein, which is in Phase 1 clinical trials and generates a signal blocking the CD47 for advanced relapsed or refractory hematologic malignancies, and solid tumors and mycosis fungoides. The company was formerly known as Stem Cell Therapeutics Corp. and changed its name to Trillium Therapeutics Inc. in June 2014. Trillium Therapeutics Inc. was incorporated in 2004 is based in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "TRIL.TO": {
        "short_name": "TRILLIUM THERAPEUTICS INC",
        "long_name": "Trillium Therapeutics Inc.",
        "summary": "Trillium Therapeutics Inc., a clinical stage immuno-oncology company, develops therapies for the treatment of cancer. Its include TTI-622, a SIRPa-IgG4 Fc fusion protein that is designed to enhance macrophage-mediated phagocytosis and anti-tumor activity by blocking the CD47, which is in Phase 1 clinical trials; and TTI-621, a SIRPa-IgG1 Fc fusion protein, which is in Phase 1 clinical trials and generates a signal blocking the CD47 for advanced relapsed or refractory hematologic malignancies, and solid tumors and mycosis fungoides. The company was formerly known as Stem Cell Therapeutics Corp. and changed its name to Trillium Therapeutics Inc. in June 2014. Trillium Therapeutics Inc. was incorporated in 2004 is based in Mississauga, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "TRYP.CN": {
        "short_name": "TrypTherapeutic",
        "long_name": "Tryp Therapeutics Inc.",
        "summary": "Tryp Therapeutics Inc., a clinical stage pharmaceutical company, focuses on developing compounds with known activity and/or safety profiles for the treatment of rare or orphan diseases and other diseases. The company's lead development program is psilocybin-for-neuropsychiatry (PFN), which is designed to treat neuropsychiatric disorders through the dosing of formulations of synthetic psilocybin. Its PFN program candidates include TRP-8802 for fibromyalgia, hyperphagia in prader-willi syndrome, and other therapies; and TRP-1001, an oral formulation of razoxane evaluating for the treatment of soft tissue sarcoma. The company was formerly known as Artos Pharma Corp. and changed its name to Tryp Therapeutics Inc. in June 2020. The company was founded in 2019 and is headquartered in Kelowna, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "TRYPF": {
        "short_name": "TRYP THERAPEUTICS INC",
        "long_name": "Tryp Therapeutics Inc.",
        "summary": "Tryp Therapeutics Inc., a clinical stage pharmaceutical company, focuses on developing compounds with known activity and/or safety profiles for the treatment of rare or orphan diseases and other diseases. The company's lead development program is psilocybin-for-neuropsychiatry (PFN), which is designed to treat neuropsychiatric disorders through the dosing of formulations of synthetic psilocybin. Its PFN program candidates include TRP-8802 for fibromyalgia, hyperphagia in prader-willi syndrome, and other therapies; and TRP-1001, an oral formulation of razoxane evaluating for the treatment of soft tissue sarcoma. The company was formerly known as Artos Pharma Corp. and changed its name to Tryp Therapeutics Inc. in June 2020. The company was founded in 2019 and is headquartered in Kelowna, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "VXL.V": {
        "short_name": "VAXIL BIO LTD",
        "long_name": "Vaxil Bio Ltd.",
        "summary": "Vaxil Bio Ltd., an immunotherapy biotech company, focuses on a novel drug discovery and development platform based on signal peptides for infectious diseases and cancer. The company's lead product is ImMucin that has completed a Phase I/II clinical trial for the treatment of multiple myeloma. It is also developing a tuberculosis vaccine/treatment and a coronavirus (COVID-19) vaccine. The company has a collaboration agreement with The Tel Aviv Sourasky Medical Center for the company's research program to develop a potential peptide vaccine against COVID-19; and cooperative research and development agreement with U.S. Army Medical Research Institute of Infectious Diseases for testing CorVax for its ability to prevent COVID-19 in mice. The company was founded in 2006 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "VXLLF": {
        "short_name": "VAXIL BIO LTD (CA)",
        "long_name": "Vaxil Bio Ltd.",
        "summary": "Vaxil Bio Ltd., an immunotherapy biotech company, focuses on a novel drug discovery and development platform based on signal peptides for infectious diseases and cancer. The company's lead product is ImMucin that has completed a Phase I/II clinical trial for the treatment of multiple myeloma. It is also developing a tuberculosis vaccine/treatment and a coronavirus (COVID-19) vaccine. The company has a collaboration agreement with The Tel Aviv Sourasky Medical Center for the company's research program to develop a potential peptide vaccine against COVID-19; and cooperative research and development agreement with U.S. Army Medical Research Institute of Infectious Diseases for testing CorVax for its ability to prevent COVID-19 in mice. The company was founded in 2006 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "WAVE.V": {
        "short_name": "WAVERLEY PHARMA INC",
        "long_name": "Waverley Pharma Inc.",
        "summary": "Waverley Pharma Inc., a biopharmaceutical company, researches, develops, and commercializes cancer therapeutics in the European Union and North America. It focuses on the generic oncology injectable products. The company sells generic oncology products comprising Capecitabine, Erlotinib, and Temozolomide. Its products under development include injectable generic chemotherapy drugs, such as WAV-101 for the treatment of non-small cell lung cancer and pleural mesothelioma; and WAV-102 to treat multiple myeloma and mantle cell lymphoma. The company has a collaboration with the University of Manitoba for the development of a synthetic library of chloroquine analogs to treat COVID-19. Waverley Pharma Inc. is headquartered in Winnipeg, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "WBIO.CN": {
        "short_name": "WPDPharma",
        "long_name": "WPD Pharmaceuticals Inc.",
        "summary": "WPD Pharmaceuticals Inc. engages in the research and development of medicinal products in the fields of oncology and infectious diseases. Its drug development pipeline includes WPD101 to treat brain cancers, including glioblastoma that is in the pre-clinical trial; WPD102 to treat Uval Melanoma, which is in the pre-clinical trial; Berubicin for the treatment of glioblastoma that us in phase 1 clinical trial; and WP1066 to treat central nervous system tumors, pancreatic cancer, and ocular tumors, which is in phase 1 clinical trial. The company's drug development pipeline also includes WP1732 for the treatment of pancreatic cancer; WP1220 to treat cutaneous T-cell lymphoma; WPD103 for the treatment of glioblastoma multiforme that is in the pre-clinical trial; and Annamycin to treat acute myeloid leukemia (AML) and metastasis to lungs, which is in Phase I/II clinical trials in AML. WPD Pharmaceuticals Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "XENE": {
        "short_name": "Xenon Pharmaceuticals Inc.",
        "long_name": "Xenon Pharmaceuticals Inc.",
        "summary": "Xenon Pharmaceuticals Inc., a clinical-stage biopharmaceutical company, engages in developing therapeutics to treat patients with neurological disorders in Canada. Its clinical development pipeline includes XEN496, A Kv7 potassium channel modulator that is Phase III clinical trials for the treatment of KCNQ2 epilepsy encephalopathy; and XEN1101, A Kv7 potassium channel modulator, which is in Phase II clinical trial for the treatment of epilepsy and other neurological disorders. The company's product candidates also comprise NBI-921352, a selective Nav1.6 sodium channel inhibitor that is in Phase II clinical trials for the treatment of epilepsy; and XEN007, A central nervous system-acting calcium channel modulator, which is in Phase II clinical trials. The company has a license and collaboration agreement with the Neurocrine Biosciences, Inc. to develop treatments for epilepsy; and with Flexion Therapeutics, Inc. to develop FX301 (XEN402, a Nav1.7 inhibitor) for the treatment of post-operative pain. The company was incorporated in 1996 and is headquartered in Burnaby, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "XP0.F": {
        "short_name": "XENON PHARMACEUTICALS",
        "long_name": "Xenon Pharmaceuticals Inc.",
        "summary": "Xenon Pharmaceuticals Inc., a clinical-stage biopharmaceutical company, engages in developing therapeutics to treat patients with neurological disorders in Canada. Its clinical development pipeline includes XEN496, A Kv7 potassium channel modulator that is Phase III clinical trials for the treatment of KCNQ2 epilepsy encephalopathy; and XEN1101, A Kv7 potassium channel modulator, which is in Phase II clinical trial for the treatment of epilepsy and other neurological disorders. The company's product candidates also comprise NBI-921352, a selective Nav1.6 sodium channel inhibitor that is in Phase II clinical trials for the treatment of epilepsy; and XEN007, A central nervous system-acting calcium channel modulator, which is in Phase II clinical trials. The company has a license and collaboration agreement with the Neurocrine Biosciences, Inc. to develop treatments for epilepsy; and with Flexion Therapeutics, Inc. to develop FX301 (XEN402, a Nav1.7 inhibitor) for the treatment of post-operative pain. The company was incorporated in 1996 and is headquartered in Burnaby, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Burnaby"
    },
    "XRTXF": {
        "short_name": "XORTX THERAPEUTICS INC",
        "long_name": "XORTX Therapeutics Inc.",
        "summary": "XORTX Therapeutics Inc., a bio-pharmaceutical company, engages in the development and commercialization of therapies to treat progressive kidney diseases, hypertension, insulin resistance, and diabetic nephropathy. It develops XRx-008, a late clinical stage program therapy for autosomal dominant polycystic kidney disease; XRx-101, an uric acid lowering agent used to treat patients infected with the coronavirus COVID-19 infection and suppression of acute kidney injury and associated health consequences; and XRx-221, a xanthine oxidase inhibitor candidates for the treatment of diabetic nephropathy. The company has a partnership with the Icahn School of Medicine to study the incidence of acute kidney injury and hyperuricemia in patients hospitalized with COVID-19. XORTX Therapeutics Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "XRX.CN": {
        "short_name": "XORTXTherap",
        "long_name": "XORTX Therapeutics Inc.",
        "summary": "XORTX Therapeutics Inc., a bio-pharmaceutical company, engages in the development and commercialization of therapies to treat progressive kidney diseases, hypertension, insulin resistance, and diabetic nephropathy. It develops XRx-008, a late clinical stage program therapy for autosomal dominant polycystic kidney disease; XRx-101, an uric acid lowering agent used to treat patients infected with the coronavirus COVID-19 infection and suppression of acute kidney injury and associated health consequences; and XRx-221, a xanthine oxidase inhibitor candidates for the treatment of diabetic nephropathy. The company has a partnership with the Icahn School of Medicine to study the incidence of acute kidney injury and hyperuricemia in patients hospitalized with COVID-19. XORTX Therapeutics Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ZENI-P.V": {
        "short_name": "ZENITH CAPITAL CORPORATION",
        "long_name": "Zenith Capital Corporation",
        "summary": "Zenith Capital Corporation does not have significant operations. It intends to identify and evaluate businesses or assets with a view to complete a qualifying transaction. The company was founded in 2019 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ZHCLF": {
        "short_name": "ZENITH CAPITAL CORPORATION",
        "long_name": "Zenith Capital Corp.",
        "summary": "Zenith Capital Corp., a biotechnology investment company, develops bromodomain inhibitors for the treatment of cancer and other disorders with unmet medical needs. Its lead compound ZEN-3694 which is in phase II clinical trials for the treatment of metastatic castration resistant prostate cancer and in a phase 1b/2 clinical trial for triple negative breast cancer. The company was incorporated in 2013 and is based in Calgary, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "ZSB.F": {
        "short_name": "SIRONA BIOCHEM CORP.",
        "long_name": "Sirona Biochem Corp.",
        "summary": "Sirona Biochem Corp., a cosmetic ingredient and drug discovery company, develops and sells cosmetic and pharmaceutical active ingredients in Canada and France. It develops programs in the areas of diabetes, anti-inflammatories, and anti-infectives for therapeutics; and anti-aging and depigmenting agents in cosmeceuticals. The company was formerly known as High Rider Capital Inc. and changed its name to Sirona Biochem Corp. in May 2009. Sirona Biochem Corp. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ZYME": {
        "short_name": "Zymeworks Inc.",
        "long_name": "Zymeworks Inc.",
        "summary": "Zymeworks Inc., a clinical-stage biopharmaceutical company, discovers, develops, and commercializes biotherapeutics for the treatment of cancer. The company's lead product candidates include zanidatamab, a novel bispecific antibody that is in Phase 1 and Phase 2 clinical trials for the treatment of biliary tract, gastroesophageal adenocarcinomas, and breast cancer; and ZW49, a biparatopic anti- human epidermal growth factor receptor 2 (HER2) antibody-drug conjugate that is in Phase 1 clinical trial for the treatment of advanced or metastatic HER2-expressing tumors. The company has strategic partnerships with Merck Sharp & Dohme Research Ltd.; Eli Lilly and Company; Bristol-Myers Squibb company; GlaxoSmithKline Intellectual Property Development Ltd.; Daiichi Sankyo Co., Ltd.; Janssen Biotech, Inc.; and BeiGene, Ltd. It also has licensing and research collaboration with LEO Pharma A/S to discover and develop bispecific antibodies; and Iconic Therapeutics, Inc. Zymeworks Inc. was founded in 2003 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    }
}