{
    "2FA.F": {
        "short_name": "GLOBAL CANNABIS APPL.",
        "long_name": "Global Cannabis Applications Corp.",
        "summary": "Global Cannabis Applications Corp. designs, develops, markets, and acquires data technologies and applications for the medical cannabis industry. The company offers Citizen Green platform, a medical cannabis data solution. It uses various technologies, such as mobile applications, artificial intelligence, regulatory, smart databases, blockchain, and digital reward tokens to qualify candidates for clinical studies. The company was formerly known as Fundamental Applications Corp. Global Cannabis Applications Corp. was founded in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4A6",
        "website": "http://cannappscorp.com",
        "market_cap": "Nano Cap"
    },
    "38H0.F": {
        "short_name": "HEALTHSPACE DATA SYS LTD",
        "long_name": "HealthSpace Data Systems Ltd.",
        "summary": "HealthSpace Data Systems Ltd. develops and sells information and communication management systems for health inspection departments of federal, provincial, state, and municipal governments in Canada and the United States. Its products include HSCloud product, a no-code data management platform for managing applications, licenses, permits, inspections, and virtually other data for operating state and local government agencies; and HSTouch for data collection, such as calendars, past inspections, regulatory codes, and violations, which works either connected to or disconnected from the internet to record observations is the field, as well as captures electronic signature, and insert photos and email inspection reports. The company also offers HealthSpace EnviroIntel EHS Manager, an internet-based client/server application used to fill out forms, request information, and view data, including real-time reports. HealthSpace Data Systems Ltd. was founded in 1998 and is headquartered in Chilliwack, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Chilliwack",
        "zipcode": "V2R 6E7",
        "website": "http://www.gethealthspace.com",
        "market_cap": "Nano Cap"
    },
    "3CT0.F": {
        "short_name": "LYNX GLOBAL DIGITAL FINL.",
        "long_name": "Lynx Global Digital Finance Corporation",
        "summary": "CannaOne Technologies Inc., a software development and technology company, develops and markets online e-commerce marketplace solution for the cannabis industry in Canada. It provides BloomKit, a software suite that delivers an online toolkit for various applications for companies in the cannabis sector; and BWell, which uses BloomKit to facilitate the sale of premium CBD products on its online marketplace. The company also operates Primo, a review driven marketplace that show a dispensary directory, brand pages, visual product attributes, and multi-varied cannabis centric reviews. CannaOne Technologies Inc. was incorporated in 2016 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 5C6",
        "website": "http://www.cannaonetechnologies.com",
        "market_cap": "Nano Cap"
    },
    "6OVA.F": {
        "short_name": "VITALHUB CORP..",
        "long_name": "Vitalhub Corp.",
        "summary": "Vitalhub Corp., together with its subsidiaries, develops technology solutions for health and human service providers in the hospital, regional health authority, mental health, long term care, home health, and community and social service sectors in Canada, the United Kingdom, and the United States. Its solutions include electronic healthcare record, case management, care coordination, patient flow and operational visibility, and DOCit mobile apps. Vitalhub Corp. is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5G 1V2",
        "website": "http://vitalhub.com",
        "market_cap": "Micro Cap"
    },
    "6PH.F": {
        "short_name": "CLOUDMD SOFTWARE+SERVICES",
        "long_name": "CloudMD Software & Services Inc.",
        "summary": "CloudMD Software & Services Inc., a healthcare technology company, provides SaaS based health technology solutions to medical clinics in North America. It offers CloudMD telemedicine application, a telemedicine platform that connects patients to licensed physician through videoconferencing technology; operates a network of inter-connected medical clinics; and Re:Function, an integrated network of 8 rehabilitation clinics that offers various rehabilitation services. The company also retails prescription drugs, over-the-counter drugs, and other front store items through two pharmacies, as well as provides clinical services, such as medical reviews and compounding; and provides cloud-based electronic medical records (EMR) software, medical billing and practice management software, and various telemedicine platforms to medical professionals, as well as digital platforms to serve individuals for their eyecare and specialty drug needs. In addition, it offers JunoEMR, a cloud-based EMR solution; MyHealthAccess, an online patient portal for online appointment booking and telemedicine visits; Benchmark, a suite of cloud-based medical practice solutions; and ClinicAid, a medical billing software. Further, the company provides Livecare Connect, a telemedicine platform; IDYA4, a health data integration and security technology platform; VisionPros, an online eyecare platform that offers contact lenses and eyeglasses under the KIND brand; Rxi, a specialty drug wholesaler, pharmacy, and technology/patient support program administrator. Additionally, it provides enterprise health solutions, including mental health support; employee and student assistance programs; healthcare navigation and specialist; rehabilitation and assessments; education; and absence management. The company was formerly known as Premier Health Group Inc. and changed its name to CloudMD Software & Services Inc. in February 2020. The company was incorporated in 2013 and is headquartered in Victoria, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://cloudmd.ca",
        "market_cap": "Micro Cap"
    },
    "ADK.V": {
        "short_name": "DIAGNOS INC.",
        "long_name": "DIAGNOS Inc.",
        "summary": "DIAGNOS Inc. provides software-based interpretation services primarily in Canada, the United States, Kenya, the United Arab Emirates, Bangladesh, Saudi Arabia, and Costa Rica. It offers image analysis services through Computer Assisted Retinal Analysis, a software tool that assists health specialists in the detection of diabetic retinopathy. The company was founded in 1998 and is headquartered in Brossard, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Brossard",
        "zipcode": "J4Z 1A7",
        "website": "http://www.diagnos.ca",
        "market_cap": "Nano Cap"
    },
    "AHGIF": {
        "short_name": "ALTERNATE HEALTH CORP",
        "long_name": "Alternate Health Corp.",
        "summary": "Alternate Health Corp., a diversified healthcare company, provides cloud based software solutions in Canada. It offers medical practice and controlled substance management software, blood analysis and toxicology labs, clinical research, continuing education programs, nutraceutical products, and security and control services to the medical cannabis industry. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5R 3K5",
        "website": "http://www.alternatehealth.com",
        "market_cap": "Nano Cap"
    },
    "APP.CN": {
        "short_name": "Global CannaApp",
        "long_name": "Global Cannabis Applications Corp.",
        "summary": "Global Cannabis Applications Corp. designs, develops, markets, and acquires data technologies and applications for the medical cannabis industry. The company offers Citizen Green platform, a medical cannabis data solution. It uses various technologies, such as mobile applications, artificial intelligence, regulatory, smart databases, blockchain, and digital reward tokens to qualify candidates for clinical studies. The company was formerly known as Fundamental Applications Corp. Global Cannabis Applications Corp. was founded in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4A6",
        "website": "http://cannappscorp.com",
        "market_cap": "Nano Cap"
    },
    "AUHP.F": {
        "short_name": "EGF THERAMED HEALTH CORP.",
        "long_name": "EGF Theramed Health Corp.",
        "summary": "EGF Theramed Health Corp., a consumer technology company, develops technologies, products, and diagnostic tools for personalized medical care. It engages in the provision of biomedical online services for monitoring and treating common health problems; and extraction and purification of botanical extracts and creation of extract formulations, as well as development of medical monitoring device technologies. The company also provides TULIP medical health system device. It offers services in the medical areas of mental health problems, weight loss, skin care, and heart diseases. The company was formerly known as Theramed Health Corporation and changed its name to EGF Theramed Health Corp. in October 2019. The company was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1C3",
        "website": "http://theramedhealthcorp.com",
        "market_cap": "Nano Cap"
    },
    "BNVIF": {
        "short_name": "BINOVI TECHNOLOGIES CORP",
        "long_name": "Binovi Technologies Corp.",
        "summary": "Binovi Technologies Corp. develops and commercializes visual and neuro-cognitive processing products, and hardware and software for diagnosing and remediating visual perception disorders in Canada, the United States, and internationally. Its products include Binovi Touch, a tool for vision therapy and vision training; Binovi Pro, which allows doctors/trainers to manage various aspects of patient/athlete's vision training regimens, track progress, and plan and assign protocols; Binovi Coach, a tool that allows users to complete their assigned activities through clear multimedia guidance; and Binovi Academy, an educational hub. The company was formerly known as Eyecarrot Innovations Corp. and changed its name to Binovi Technologies Corp. in June 2020. Binovi Technologies Corp. is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6Z 1S4",
        "website": "http://www.binovi.com",
        "market_cap": "Nano Cap"
    },
    "CARE.TO": {
        "short_name": "DIALOGUE HEALTH TECHNOLOGIES IN",
        "long_name": "Dialogue Health Technologies Inc.",
        "summary": "Dialogue Health Technologies Inc. operates a digital healthcare and wellness platform in Canada. Its Integrated Health Platform is a healthcare hub that provides access to virtual healthcare, stress management, mental wellbeing, and other orientation and counselling services. The company's platform also enables its members and their dependents to access an employee assistance program and an occupational health and safety program for customers in Germany. It serves employers and organizations. Dialogue Technologies Inc. was incorporated in 2016 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H2Y 1T9",
        "website": "http://dialogue.co",
        "market_cap": "Small Cap"
    },
    "CDX.V": {
        "short_name": "CLOUD DX INC",
        "long_name": "Cloud DX Inc.",
        "summary": "Cloud DX Inc. provides remote patient monitoring hardware and software solutions. The company offers Cloud DX Connected Health, an end-to-end virtual healthcare platform for monitoring patients with chronic illness, including COPD and CHF, as well as patients recovering from surgery to large hospitals and provincial health authorities in Canada, and physician practices and hospitals in the United States. Its Cloud DX Connected Health Kits includes its proprietary Pulsewave wrist cuff blood pressure monitor; Cloud DX Bluetooth pulse oximeter; and Cloud DX wireless weight scale and optionally, a digital thermometer and digital wireless glucose meter from 3rd party suppliers. The company also offers CPT Codes for Remote Patient Monitoring; and VITALITI, a vital sign monitor for measuring ECG, heart rate, oxygen saturation, respiration, core body temperature, blood pressure, movement, steps, and posture. Cloud DX Inc. is headquartered in Kitchener, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Kitchener",
        "zipcode": "N2G 4Y9",
        "website": "http://www.clouddx.com",
        "market_cap": "Nano Cap"
    },
    "CNONF": {
        "short_name": "LYNX GLOBAL DIGITAL FIN CORP",
        "long_name": "Lynx Global Digital Finance Corporation",
        "summary": "CannaOne Technologies Inc., a software development and technology company, develops and markets online e-commerce marketplace solution for the cannabis industry in Canada. It provides BloomKit, a software suite that delivers an online toolkit for various applications for companies in the cannabis sector; and BWell, which uses BloomKit to facilitate the sale of premium CBD products on its online marketplace. The company also operates Primo, a review driven marketplace that show a dispensary directory, brand pages, visual product attributes, and multi-varied cannabis centric reviews. CannaOne Technologies Inc. was incorporated in 2016 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 5C6",
        "website": "http://www.cannaonetechnologies.com",
        "market_cap": "Nano Cap"
    },
    "CRBK.V": {
        "short_name": "CAREBOOK TECHNOLGIES INC",
        "long_name": "Carebook Technologies Inc.",
        "summary": "Carebook Technologies Inc., digital health company, develops digital health solutions. The company provides COVID-19 application and pharmacy engagement platform. It also offers virtual care and COVID-19 vital signs screening for pharmacies, insurance providers, individuals, governments, and businesses. The company is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 2V4",
        "website": "http://www.carebook.com",
        "market_cap": "Nano Cap"
    },
    "CRBKF": {
        "short_name": "CAREBOOK TECHNOLOGIES INC",
        "long_name": "Carebook Technologies Inc.",
        "summary": "Carebook Technologies Inc., digital health company, develops digital health solutions. The company provides COVID-19 application and pharmacy engagement platform. It also offers virtual care and COVID-19 vital signs screening for pharmacies, insurance providers, individuals, governments, and businesses. The company is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 2V4",
        "website": "http://www.carebook.com",
        "market_cap": "Nano Cap"
    },
    "DOC.V": {
        "short_name": "CLOUDMD SOFTWARE AND SERVICES I",
        "long_name": "CloudMD Software & Services Inc.",
        "summary": "CloudMD Software & Services Inc., a healthcare technology company, provides SaaS based health technology solutions to medical clinics in North America. It offers CloudMD telemedicine application, a telemedicine platform that connects patients to licensed physician through videoconferencing technology; operates a network of inter-connected medical clinics; and Re:Function, an integrated network of 8 rehabilitation clinics that offers various rehabilitation services. The company also retails prescription drugs, over-the-counter drugs, and other front store items through two pharmacies, as well as provides clinical services, such as medical reviews and compounding; and provides cloud-based electronic medical records (EMR) software, medical billing and practice management software, and various telemedicine platforms to medical professionals, as well as digital platforms to serve individuals for their eyecare and specialty drug needs. In addition, it offers JunoEMR, a cloud-based EMR solution; MyHealthAccess, an online patient portal for online appointment booking and telemedicine visits; Benchmark, a suite of cloud-based medical practice solutions; and ClinicAid, a medical billing software. Further, the company provides Livecare Connect, a telemedicine platform; IDYA4, a health data integration and security technology platform; VisionPros, an online eyecare platform that offers contact lenses and eyeglasses under the KIND brand; Rxi, a specialty drug wholesaler, pharmacy, and technology/patient support program administrator. Additionally, it provides enterprise health solutions, including mental health support; employee and student assistance programs; healthcare navigation and specialist; rehabilitation and assessments; education; and absence management. The company was formerly known as Premier Health Group Inc. and changed its name to CloudMD Software & Services Inc. in February 2020. The company was incorporated in 2013 and is headquartered in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://cloudmd.ca",
        "market_cap": "Small Cap"
    },
    "DOCRF": {
        "short_name": "CLOUDMD SOFTWARE & SERVICES INC",
        "long_name": "CloudMD Software & Services Inc.",
        "summary": "CloudMD Software & Services Inc., a healthcare technology company, provides SaaS based health technology solutions to medical clinics in North America. It offers CloudMD telemedicine application, a telemedicine platform that connects patients to licensed physician through videoconferencing technology; operates a network of inter-connected medical clinics; and Re:Function, an integrated network of 8 rehabilitation clinics that offers various rehabilitation services. The company also retails prescription drugs, over-the-counter drugs, and other front store items through two pharmacies, as well as provides clinical services, such as medical reviews and compounding; and provides cloud-based electronic medical records (EMR) software, medical billing and practice management software, and various telemedicine platforms to medical professionals, as well as digital platforms to serve individuals for their eyecare and specialty drug needs. In addition, it offers JunoEMR, a cloud-based EMR solution; MyHealthAccess, an online patient portal for online appointment booking and telemedicine visits; Benchmark, a suite of cloud-based medical practice solutions; and ClinicAid, a medical billing software. Further, the company provides Livecare Connect, a telemedicine platform; IDYA4, a health data integration and security technology platform; VisionPros, an online eyecare platform that offers contact lenses and eyeglasses under the KIND brand; Rxi, a specialty drug wholesaler, pharmacy, and technology/patient support program administrator. Additionally, it provides enterprise health solutions, including mental health support; employee and student assistance programs; healthcare navigation and specialist; rehabilitation and assessments; education; and absence management. The company was formerly known as Premier Health Group Inc. and changed its name to CloudMD Software & Services Inc. in February 2020. The company was incorporated in 2013 and is headquartered in Victoria, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://cloudmd.ca",
        "market_cap": "Small Cap"
    },
    "EKG.V": {
        "short_name": "CARDIOCOMM SOLUTIONS, INC.",
        "long_name": "CardioComm Solutions, Inc.",
        "summary": "CardioComm Solutions, Inc. develops advanced software and hardware products, and core laboratory reading services related to electrocardiogram (ECG) and ambulatory arrhythmia monitoring systems for medical and consumer markets worldwide. The company's technology is used in a range of products for the recording, transmission, viewing, analyzing, reporting, and storage of ECGs for arrhythmia screening, diagnosis, and management of cardiac patients. Its systems enable medical professionals, patients, and other healthcare professionals, clinics, hospitals, and call centers to access and manage patient information. The company's software products include Global ECG Management System (GEMS), a software solution for cardiac event monitoring; GlobalCardio 12 Lead, a web enabled ECG device that is EMR compatible; and GEMS Lite for Windows, an electronic ECG receiving system. It also offers software modules, such as GEMS WIN Air, a live wireless ECG monitoring solution; AutoAttendant, which allows healthcare providers to focus on providing patient care; GEMS HL7 and EMR Interface that allows patient and follow-up information to be sent in an HL7 message format to other EMR systems that are HL7 compliant; and GlobalCardio EMR integration that enables bidirectional movement of data, including patient information, reports, and links. In addition, the company provides hardware products comprising HeartCheck PEN and HeartCheck, which are handheld ECG monitors; and Sirona telephonic and wireless event recorders. Further, it offers ASP services, including C4 ECG management services; and HeartCheck SMART Monitoring, an ECG reading service. Additionally, the company provides other products comprising GlobalCardio 3 Lead; ECG Viewer SDK; QRS Diagnostic; and QRS 12 Lead Universal products. CardioComm Solutions, Inc. was incorporated in 1989 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2J 0B5",
        "website": "http://www.cardiocommsolutions.com",
        "market_cap": "Nano Cap"
    },
    "EKGGF": {
        "short_name": "CARDIOCOMM SOLUTIONS INC",
        "long_name": "CardioComm Solutions, Inc.",
        "summary": "CardioComm Solutions, Inc. develops advanced software and hardware products, and core laboratory reading services related to electrocardiogram (ECG) and ambulatory arrhythmia monitoring systems for medical and consumer markets worldwide. The company's technology is used in a range of products for the recording, transmission, viewing, analyzing, reporting, and storage of ECGs for arrhythmia screening, diagnosis, and management of cardiac patients. Its systems enable medical professionals, patients, and other healthcare professionals, clinics, hospitals, and call centers to access and manage patient information. The company's software products include Global ECG Management System (GEMS), a software solution for cardiac event monitoring; GlobalCardio 12 Lead, a web enabled ECG device that is EMR compatible; and GEMS Lite for Windows, an electronic ECG receiving system. It also offers software modules, such as GEMS WIN Air, a live wireless ECG monitoring solution; AutoAttendant, which allows healthcare providers to focus on providing patient care; GEMS HL7 and EMR Interface that allows patient and follow-up information to be sent in an HL7 message format to other EMR systems that are HL7 compliant; and GlobalCardio EMR integration that enables bidirectional movement of data, including patient information, reports, and links. In addition, the company provides hardware products comprising HeartCheck PEN and HeartCheck, which are handheld ECG monitors; and Sirona telephonic and wireless event recorders. Further, it offers ASP services, including C4 ECG management services; and HeartCheck SMART Monitoring, an ECG reading service. Additionally, the company provides other products comprising GlobalCardio 3 Lead; ECG Viewer SDK; QRS Diagnostic; and QRS 12 Lead Universal products. CardioComm Solutions, Inc. was incorporated in 1989 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2J 0B5",
        "website": "http://www.cardiocommsolutions.com",
        "market_cap": "Nano Cap"
    },
    "EMYSF": {
        "short_name": "EASY TECHNOLOGIES INC",
        "long_name": "Easy Technologies Inc.",
        "summary": "Easy Technologies Inc. develops an Internet based platform in the online gaming area. It develops HouseTrivia.com, a platform that holds various trivia competitions. The company was formerly known as EasyMed Technologies Inc. and changed its name to Easy Technologies Inc. in January 2016. Easy Technologies Inc. was founded in 2005 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3P6",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "EVAHF": {
        "short_name": "EGF THERAMED HEALTH CORP",
        "long_name": "EGF Theramed Health Corp.",
        "summary": "EGF Theramed Health Corp., a consumer technology company, develops technologies, products, and diagnostic tools for personalized medical care. It engages in the provision of biomedical online services for monitoring and treating common health problems; and extraction and purification of botanical extracts and creation of extract formulations, as well as development of medical monitoring device technologies. The company also provides TULIP medical health system device. It offers services in the medical areas of mental health problems, weight loss, skin care, and heart diseases. The company was formerly known as Theramed Health Corporation and changed its name to EGF Theramed Health Corp. in October 2019. The company was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1C3",
        "website": "http://theramedhealthcorp.com",
        "market_cap": "Nano Cap"
    },
    "FUAPF": {
        "short_name": "GLOBAL CANNABIS APPLICATIONS CO",
        "long_name": "Global Cannabis Applications Corp.",
        "summary": "Global Cannabis Applications Corp. designs, develops, markets, and acquires data technologies and applications for the medical cannabis industry. The company offers Citizen Green platform, a medical cannabis data solution. It uses various technologies, such as mobile applications, artificial intelligence, regulatory, smart databases, blockchain, and digital reward tokens to qualify candidates for clinical studies. The company was formerly known as Fundamental Applications Corp. Global Cannabis Applications Corp. was founded in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4A6",
        "website": "http://cannappscorp.com",
        "market_cap": "Nano Cap"
    },
    "HDSLF": {
        "short_name": "HEALTHSPACE DATA SYSTEMS LTD",
        "long_name": "HealthSpace Data Systems Ltd.",
        "summary": "HealthSpace Data Systems Ltd. develops and sells information and communication management systems for health inspection departments of federal, provincial, state, and municipal governments in Canada and the United States. Its products include HSCloud product, a no-code data management platform for managing applications, licenses, permits, inspections, and virtually other data for operating state and local government agencies; and HSTouch for data collection, such as calendars, past inspections, regulatory codes, and violations, which works either connected to or disconnected from the internet to record observations is the field, as well as captures electronic signature, and insert photos and email inspection reports. The company also offers HealthSpace EnviroIntel EHS Manager, an internet-based client/server application used to fill out forms, request information, and view data, including real-time reports. HealthSpace Data Systems Ltd. was founded in 1998 and is headquartered in Chilliwack, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Chilliwack",
        "zipcode": "V2R 6E7",
        "website": "http://www.gethealthspace.com",
        "market_cap": "Nano Cap"
    },
    "HS.CN": {
        "short_name": "HealthSpace",
        "long_name": "HealthSpace Data Systems Ltd.",
        "summary": "HealthSpace Data Systems Ltd. develops and sells information and communication management systems for health inspection departments of federal, provincial, state, and municipal governments in Canada and the United States. Its products include HSCloud product, a no-code data management platform for managing applications, licenses, permits, inspections, and virtually other data for operating state and local government agencies; and HSTouch for data collection, such as calendars, past inspections, regulatory codes, and violations, which works either connected to or disconnected from the internet to record observations is the field, as well as captures electronic signature, and insert photos and email inspection reports. The company also offers HealthSpace EnviroIntel EHS Manager, an internet-based client/server application used to fill out forms, request information, and view data, including real-time reports. HealthSpace Data Systems Ltd. was founded in 1998 and is headquartered in Chilliwack, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Chilliwack",
        "zipcode": "V2R 6E7",
        "website": "http://www.gethealthspace.com",
        "market_cap": "Nano Cap"
    },
    "HSCHF": {
        "short_name": "H-SOURCE HOLDINGS LTD",
        "long_name": "H-Source Holdings Ltd.",
        "summary": "H-Source Holdings Ltd., a technology company, operates in the healthcare industry. It offers a hospital-to-hospital transaction platform that provides a marketplace for members to buy, sell, and transfer excess inventory supplies and capital equipment with each other. The company's platform allows members to conduct transactions within integrated delivery networks and group purchasing organizations. H-Source Holdings Ltd. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2E9",
        "website": "http://www.h-source.com",
        "market_cap": "Nano Cap"
    },
    "HSQ.F": {
        "short_name": "H-SOURCE HLDGS CL.A O.N.",
        "long_name": "H-Source Holdings Ltd.",
        "summary": "H-Source Holdings Ltd., a technology company, operates in the healthcare industry. It offers a hospital-to-hospital transaction platform that provides a marketplace for members to buy, sell, and transfer excess inventory supplies and capital equipment with each other. The company's platform allows members to conduct transactions within integrated delivery networks and group purchasing organizations. H-Source Holdings Ltd. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2E9",
        "website": "http://www.h-source.com",
        "market_cap": "Nano Cap"
    },
    "LFCOF": {
        "short_name": "LIFT & CO CORP",
        "long_name": "Lift & Co. Corp.",
        "summary": "Lift & Co. Corp. operates as a cannabis-focused technology and media company in Canada. The company monetizes a platform of advertising solutions, events, and data insights to cannabis businesses and consumers for making better-informed decisions. It operates a product-comparison resource of federally regulated cannabis products; provides customized marketing solutions and data-backed insights into consumer and product trends; offers a cannabis retail training program; and connects businesses and consumers through its digital platform and industry leading events. The company categorizes its platform of products in the categories of consumer marketing, trade marketing, data insights, and event marketing. Lift & Co. Corp. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 2G4",
        "website": "http://lift.co",
        "market_cap": "Nano Cap"
    },
    "LYNX.CN": {
        "short_name": "LynxGlDigitFin",
        "long_name": "Lynx Global Digital Finance Corporation",
        "summary": "CannaOne Technologies Inc., a software development and technology company, develops and markets online e-commerce marketplace solution for the cannabis industry in Canada. It provides BloomKit, a software suite that delivers an online toolkit for various applications for companies in the cannabis sector; and BWell, which uses BloomKit to facilitate the sale of premium CBD products on its online marketplace. The company also operates Primo, a review driven marketplace that show a dispensary directory, brand pages, visual product attributes, and multi-varied cannabis centric reviews. CannaOne Technologies Inc. was incorporated in 2016 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 5C6",
        "website": "http://www.cannaonetechnologies.com",
        "market_cap": "Nano Cap"
    },
    "MBCN.TO": {
        "short_name": "MINDBEACON HOLDINGS INC",
        "long_name": "MindBeacon Holdings Inc.",
        "summary": "MindBeacon Holdings Inc. designs and develops a platform for mental healthcare that includes self-guided psychoeducational, wellness content, therapist-assisted asynchronous therapies, and real-time synchronous therapies. The company was founded in 2015 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4W 3R8",
        "website": "http://ir.mindbeacon.com",
        "market_cap": "Micro Cap"
    },
    "MDRM": {
        "short_name": "MODERN MOBILITY AIDS INC",
        "long_name": "Modern Mobility Aids, Inc.",
        "summary": "Modern Mobility Aids, Inc. does not have significant operations. The company focuses on the production and distribution of medical marijuana in North America. Previously, it was engaged in the distribution of products for mobility challenged individuals. The company was formerly known as Galileo Life Sciences, Inc. and changed its name to Modern Mobility Aids, Inc. in October 2017. Modern Mobility Aids, Inc. was founded in 2007 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1C1",
        "website": "http://mdrminc.com",
        "market_cap": "Nano Cap"
    },
    "MHN2.F": {
        "short_name": "RELIQ HEALTH TECHS",
        "long_name": "Reliq Health Technologies Inc.",
        "summary": "Reliq Health Technologies Inc., a healthcare technology company, engages in the development of mobile software solutions for community care market. It offers iUGO Health technology platform, a hardware and software solution that allows complex patients to receive care in the home. The company was formerly known as Moseda Technologies Inc. and changed its name to Reliq Health Technologies Inc. in May 2016. Reliq Health Technologies Inc. was incorporated in 2005 is headquartered in Hamilton, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Hamilton",
        "zipcode": "L8P 0A1",
        "website": "http://www.reliqhealth.com",
        "market_cap": "Micro Cap"
    },
    "MNOW.V": {
        "short_name": "MEDNOW INC",
        "long_name": "Mednow Inc.",
        "summary": "Mednow Inc. develops a proprietary website and a web application for the sale and distribution of prescription medications. The company was founded in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V5V 3R3",
        "website": "http://www.mednow.ca",
        "market_cap": "Nano Cap"
    },
    "NEWU.V": {
        "short_name": "NEWTOPIA INC",
        "long_name": "Newtopia Inc.",
        "summary": "Newtopia Inc., a health technology company, operates a habit change platform. It offers a personalized habit change platform that focuses on metabolic risk reduction by developing and implementing personalized experiences based on social, behavioral, and genetic information. The company was incorporated in 2008 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2P 1N6",
        "website": "http://www.newtopia.com",
        "market_cap": "Nano Cap"
    },
    "NEWUF": {
        "short_name": "NEWTOPIA INC",
        "long_name": "Newtopia Inc.",
        "summary": "Newtopia Inc., a health technology company, operates a habit change platform. It offers a personalized habit change platform that focuses on metabolic risk reduction by developing and implementing personalized experiences based on social, behavioral, and genetic information. The company was incorporated in 2008 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2P 1N6",
        "website": "http://www.newtopia.com",
        "market_cap": "Nano Cap"
    },
    "OUGA.F": {
        "short_name": "CARDIOCOMM SOLUTIONS NEW",
        "long_name": "CardioComm Solutions, Inc.",
        "summary": "CardioComm Solutions, Inc. develops advanced software and hardware products, and core laboratory reading services related to electrocardiogram (ECG) and ambulatory arrhythmia monitoring systems for medical and consumer markets worldwide. The company's technology is used in a range of products for the recording, transmission, viewing, analyzing, reporting, and storage of ECGs for arrhythmia screening, diagnosis, and management of cardiac patients. Its systems enable medical professionals, patients, and other healthcare professionals, clinics, hospitals, and call centers to access and manage patient information. The company's software products include Global ECG Management System (GEMS), a software solution for cardiac event monitoring; GlobalCardio 12 Lead, a web enabled ECG device that is EMR compatible; and GEMS Lite for Windows, an electronic ECG receiving system. It also offers software modules, such as GEMS WIN Air, a live wireless ECG monitoring solution; AutoAttendant, which allows healthcare providers to focus on providing patient care; GEMS HL7 and EMR Interface that allows patient and follow-up information to be sent in an HL7 message format to other EMR systems that are HL7 compliant; and GlobalCardio EMR integration that enables bidirectional movement of data, including patient information, reports, and links. In addition, the company provides hardware products comprising HeartCheck PEN and HeartCheck, which are handheld ECG monitors; and Sirona telephonic and wireless event recorders. Further, it offers ASP services, including C4 ECG management services; and HeartCheck SMART Monitoring, an ECG reading service. Additionally, the company provides other products comprising GlobalCardio 3 Lead; ECG Viewer SDK; QRS Diagnostic; and QRS 12 Lead Universal products. CardioComm Solutions, Inc. was incorporated in 1989 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M2J 0B5",
        "website": "http://www.cardiocommsolutions.com",
        "market_cap": "Nano Cap"
    },
    "PAXH": {
        "short_name": "PREAXIA HEALTH CARE PAYMENT SYS",
        "long_name": "PreAxia Health Care Payment Systems Inc.",
        "summary": "PreAxia Health Care Payment Systems Inc. focuses on the development, distribution, marketing, and sale of health care payment processing services and products. It is developing an online access system creating a health spending account that allows card payments and processing services to third-party administrators, insurance companies, and others; and software systems for the issuing of health payment cards and financial transaction processing services. The company was founded in 2008 and is based in Calgary, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T3C 3W2",
        "website": "http://www.preaxia.com",
        "market_cap": "Nano Cap"
    },
    "PMM1.F": {
        "short_name": "CAREBOOK TECHNOLOGIES",
        "long_name": "Carebook Technologies Inc.",
        "summary": "Carebook Technologies Inc., digital health company, develops digital health solutions. The company provides COVID-19 application and pharmacy engagement platform. It also offers virtual care and COVID-19 vital signs screening for pharmacies, insurance providers, individuals, governments, and businesses. The company is headquartered in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 2V4",
        "website": "http://www.carebook.com",
        "market_cap": "Nano Cap"
    },
    "RHT.V": {
        "short_name": "RELIQ HEALTH TECHNOLOGIES INC",
        "long_name": "Reliq Health Technologies Inc.",
        "summary": "Reliq Health Technologies Inc., a healthcare technology company, engages in the development of mobile software solutions for community care market. It offers iUGO Health technology platform, a hardware and software solution that allows complex patients to receive care in the home. The company was formerly known as Moseda Technologies Inc. and changed its name to Reliq Health Technologies Inc. in May 2016. Reliq Health Technologies Inc. was incorporated in 2005 is headquartered in Hamilton, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Hamilton",
        "zipcode": "L8P 0A1",
        "website": "http://www.reliqhealth.com",
        "market_cap": "Micro Cap"
    },
    "RQHTF": {
        "short_name": "RELIQ HEALTH TECHNOLOGIES INC",
        "long_name": "Reliq Health Technologies Inc.",
        "summary": "Reliq Health Technologies Inc., a healthcare technology company, engages in the development of mobile software solutions for community care market. It offers iUGO Health technology platform, a hardware and software solution that allows complex patients to receive care in the home. The company was formerly known as Moseda Technologies Inc. and changed its name to Reliq Health Technologies Inc. in May 2016. Reliq Health Technologies Inc. was incorporated in 2005 is headquartered in Hamilton, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Hamilton",
        "zipcode": "L8P 0A1",
        "website": "http://www.reliqhealth.com",
        "market_cap": "Micro Cap"
    },
    "THNK.V": {
        "short_name": "THINK RESEARCH CORPORATION",
        "long_name": "Think Research Corporation",
        "summary": "Think Research Corp., an investment holding company, develops and provides clinical software and services for the health care industry. The company's products portfolio includes order sets that structures clinical pathway at the point of care; Progress Notes, which helps frontline clinical teams to align their documentation in a standardized digital note shared across all team members; eReferrals that allows physicians to find and refer specialists directly from EMR systems; VirtualCare, which allows clinicians and allied health professionals to replace in-person appointments with virtual visits; and eforms, a real-time analytics to track resident volumes, signature adherence, and compliance, as well as decision support tools for seniors living in long-term care and retirement homes. It serves in Canada, the United States, Latin America, Europe, Australia, and the Middle East. Think Research Corp. is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5A 0L6",
        "website": "http://www.thinkresearch.com/ca/",
        "market_cap": "Micro Cap"
    },
    "TMED.CN": {
        "short_name": "EGFThera",
        "long_name": "EGF Theramed Health Corp.",
        "summary": "EGF Theramed Health Corp., a consumer technology company, develops technologies, products, and diagnostic tools for personalized medical care. It engages in the provision of biomedical online services for monitoring and treating common health problems; and extraction and purification of botanical extracts and creation of extract formulations, as well as development of medical monitoring device technologies. The company also provides TULIP medical health system device. It offers services in the medical areas of mental health problems, weight loss, skin care, and heart diseases. The company was formerly known as Theramed Health Corporation and changed its name to EGF Theramed Health Corp. in October 2019. The company was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7Y 1C3",
        "website": "http://theramedhealthcorp.com",
        "market_cap": "Nano Cap"
    },
    "TRUE.CN": {
        "short_name": "Treatment.com",
        "long_name": "Treatment.Com International Inc.",
        "summary": "Treatment.Com International Inc. operates as a mobile health, telemedicine, and artificial intelligence (AI) company in Canada. The company offers MERLIN, a probabilistic medical reasoning engine to provide medical advice such that individuals can make decisions about available treatments for their health care problems; and GLM, a collaborative repository where care providers, researchers, and developers exchange and publish medical knowledge. It also provides CareBOT, an AI prompting agent mobile application platform for use by consumers; and ClinBOT, an enterprise clinic application for use as diagnostic tool for medical professionals. Treatment.Com International Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "West Vancouver",
        "zipcode": "V7V 1J6",
        "website": "http://www.treatment.com",
        "market_cap": null
    },
    "VEGN.CN": {
        "short_name": "Plant&Co.Brands",
        "long_name": "Plant & Co. Brands Ltd.",
        "summary": "Plant & Co. Brands Ltd. focuses on operating data-driven digital CBD marketplace. It operates as a vertically integrated enterprise focused on the health and wellness sector. Plant & Co. Brands has collaboration with the University of Manitoba to develop an all-natural hemp-based food line. The company was formerly known as Eurolife Brands Inc. and changed its name to Plant & Co. Brands Ltd. in December 2020. Plant & Co. Brands Ltd. was incorporated in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://plantandco.com",
        "market_cap": "Nano Cap"
    },
    "VGANF": {
        "short_name": "PLANT & CO. BRANDS LTD",
        "long_name": "Plant & Co. Brands Ltd.",
        "summary": "Plant & Co. Brands Ltd. focuses on operating data-driven digital CBD marketplace. It operates as a vertically integrated enterprise focused on the health and wellness sector. Plant & Co. Brands has collaboration with the University of Manitoba to develop an all-natural hemp-based food line. The company was formerly known as Eurolife Brands Inc. and changed its name to Plant & Co. Brands Ltd. in December 2020. Plant & Co. Brands Ltd. was incorporated in 2014 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://plantandco.com",
        "market_cap": "Nano Cap"
    },
    "VGL.V": {
        "short_name": "VIGIL HEALTH SOLUTIONS INC.",
        "long_name": "Vigil Health Solutions Inc.",
        "summary": "Vigil Health Solutions Inc. develops, markets, and distributes hardware and software solutions for care plans and monitoring the aged in Canada and the United States. The company offers The Vigil Integrated Care Management System, a non-invasive monitoring system for residents with dementia. It also offers vigil memory care systems; nurse care systems; vitality care systems; and cloud applications, as well as specialty monitoring and notification devices. The company serves customers, such as independent living, assisted living, skilled nursing facilities, and continuing care retirement communities or life plan communities. Vigil Health Solutions Inc. is headquartered in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Victoria",
        "zipcode": "V8Z 7X8",
        "website": "http://www.vigil.com",
        "market_cap": "Nano Cap"
    },
    "VHI.V": {
        "short_name": "VITALHUB CORP",
        "long_name": "Vitalhub Corp.",
        "summary": "Vitalhub Corp., together with its subsidiaries, develops technology solutions for health and human service providers in the hospital, regional health authority, mental health, long term care, home health, and community and social service sectors in Canada, the United Kingdom, and the United States. Its solutions include electronic healthcare record, case management, care coordination, patient flow and operational visibility, and DOCit mobile apps. Vitalhub Corp. is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5G 1V2",
        "website": "http://vitalhub.com",
        "market_cap": "Micro Cap"
    },
    "VHIBF": {
        "short_name": "VITALHUB CORP",
        "long_name": "Vitalhub Corp.",
        "summary": "Vitalhub Corp., together with its subsidiaries, develops technology solutions for health and human service providers in the hospital, regional health authority, mental health, long term care, home health, and community and social service sectors in Canada, the United Kingdom, and the United States. Its solutions include electronic healthcare record, case management, care coordination, patient flow and operational visibility, and DOCit mobile apps. Vitalhub Corp. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5G 1V2",
        "website": "http://vitalhub.com",
        "market_cap": "Micro Cap"
    },
    "VISN.V": {
        "short_name": "BINOVI TECHNOLOGIES CORP",
        "long_name": "Binovi Technologies Corp.",
        "summary": "Binovi Technologies Corp. develops and commercializes visual and neuro-cognitive processing products, and hardware and software for diagnosing and remediating visual perception disorders in Canada, the United States, and internationally. Its products include Binovi Touch, a tool for vision therapy and vision training; Binovi Pro, which allows doctors/trainers to manage various aspects of patient/athlete's vision training regimens, track progress, and plan and assign protocols; Binovi Coach, a tool that allows users to complete their assigned activities through clear multimedia guidance; and Binovi Academy, an educational hub. The company was formerly known as Eyecarrot Innovations Corp. and changed its name to Binovi Technologies Corp. in June 2020. Binovi Technologies Corp. is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6Z 1S4",
        "website": "http://www.binovi.com",
        "market_cap": "Nano Cap"
    }
}