{
    "000917.SZ": {
        "short_name": "HUNAN TV & BROADCA",
        "long_name": "Hunan TV & Broadcast Intermediary Co., Ltd.",
        "summary": "Hunan TV & Broadcast Intermediary Co., Ltd. engages in the advertising business in the People's Republic of China. It offers advertising agencies, Internet media, rail self-media advertising, online games, etc.; and engages in the investment business. The company also operates the cable TV network business; and amusement park and a five-star Saint Fitz Hotel. Hunan TV & Broadcast Intermediary Co., Ltd. was founded in 1998 and is based in Changsha, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "002712.SZ": {
        "short_name": "SIMEI MEDIA CO LTD",
        "long_name": "Simei Media Co.,Ltd.",
        "summary": "Simei Media Co., Ltd. operates as an advertising company in China. It offers brand management, creative advertising, entertainment content, digital interaction, full-borne media planning and buying, public relations promotion, and effectiveness measurement services. The company was founded in 2000 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "002878.SZ": {
        "short_name": "BEIJING YUANLONG Y",
        "long_name": "Beijing Yuanlong Yato Culture Dissemination Co.,Ltd.",
        "summary": "Beijing Yuanlong Yato Culture Dissemination Co.,Ltd. provides integrated marketing services and marketing material solutions in China, Hong Kong, and Macao. The company engages in the marketing plan creative planning; promotional items design, research, and development; commissioned processing and sale of promotional items; promotional items and other marketing materials logistics and warehousing, and distribution; and market terminal services. It is also involved in brand licensing and marketing activities. Beijing Yuanlong Yato Culture Dissemination Co.,Ltd. was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002995.SZ": {
        "short_name": "BEIJING QUANSHI WO",
        "long_name": "Beijing Quanshi World Online Network Information Co., Ltd.",
        "summary": "Beijing Quanshi World Online Network Information Co., Ltd. provides Internet marketing and SaaS services in China to integrate mainstream Internet media resources. It offers Internet marketing services. The company's product, 360-platform searches and navigates user usage and provides display advertisements, search advertising, and mobile promotions. It has strategic partnership with Qihoo 360, Tencent, Aiqiyi Technology, Netease, and Sina. The company was founded in 2005 and is headquartered in Beijing, China with additional offices in Shandong, Anhui, Shaanxi, Hebei, Guangdong, Zhejiang, Shanxi, and Jiangsu, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "003010.SZ": {
        "short_name": "GUANGZHOU RUOYUCHE",
        "long_name": "Guangzhou Ruoyuchen Technology Co.,Ltd.",
        "summary": "Guangzhou Ruoyuchen Technology Co.,Ltd. provides brand integrated marketing solutions in China. It offers multi-channel and multi-platform integration solutions. The company was founded in 2009 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "0623.HK": {
        "short_name": "SINOMEDIA",
        "long_name": "SinoMedia Holding Limited",
        "summary": "SinoMedia Holding Limited, an investment holding company, provides TV advertisement, creative content production, and digital marketing services for advertisers and advertising agents in Hong Kong, Singapore, and the People's Republic of China. The company provides TV media resources management services that covers programs, such as news, politics, culture, and children's programs; professional advertisement video production services comprising graphic design, advertising video shooting, and producing and editing services, as well as content creative communication services; and integrated communication services, including brand information, advertising placement, promotion planning, public relation services, and other multi-dimensional brand integrated communication services. It also provides digital marketing and internet media services. In addition, the company operates iBCP, an intelligent programming advertising placement platform; lotour.com, a travel inspiration site; boosj.com, an interactive video platform; and wugu.com.cn, an agricultural information services platform. Further, it is involved in the CCTV's advertising agency business, and investment and production of film and television programs, as well as provides public service advertising broadcast network services. SinoMedia Holding Limited was founded in 1999 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "0BF1.F": {
        "short_name": "WIMI HOLOGR.CLD B ADR/2",
        "long_name": "WiMi Hologram Cloud Inc.",
        "summary": "WiMi Hologram Cloud Inc. provides augmented reality (AR) based holographic services and products in China. It operates in two segments, Augmented Reality Advertising Service; and AR Entertainment. The company primarily offers holographic AR advertising services and holographic AR entertainment products. Its holographic AR advertising software enables users to insert into video footages real or animated three dimensional objects; and online holographic AR advertising solution embeds holographic AR ads into films and shows. The company's holographic AR entertainment products consist primarily of payment middleware software, game distribution platform, and holographic mixed reality software. WiMi Hologram Cloud Inc. was founded in 2015 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "1163.HK": {
        "short_name": "ADTIGER CORP",
        "long_name": "Adtiger Corporations Limited",
        "summary": "Adtiger Corps Ltd., an investment holding company, provides online advertising services in the People's Republic of China and internationally. Its online advertising platform connects advertisers with media publishers. The company provides overseas online advertising services to China-based advertisers. Its advertising platform provides one-stop services to advertisers for their needs of user acquisition, as well as to media publishers for their needs of monetization. The company was founded in 2015 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1490.HK": {
        "short_name": "CHESHI",
        "long_name": "Cheshi Holdings Limited",
        "summary": "Cheshi Holdings Limited, an investment holding company, operates online automobile vertical media platforms that offers automobile content through its PC websites, mobile websites and mobile applications, and business partner platforms in China. It operates in two segments, Online Advertising Service and Transaction Facilitation Service. The Online Advertising Service segment provides a range of advertising solutions, such as pre-launch assessment, advertising strategy formulation, design and production, and evaluation of advertisement performance to advertising agencies, automakers, and auto dealer customers. The Transaction Facilitation Services segment offers promotion services to the group-purchase events of auto dealers and an automobile insurance company. Cheshi Holdings Limited was founded in 1999 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1640.HK": {
        "short_name": "RUICHENG CHINA",
        "long_name": "Ruicheng (China) Media Group Limited",
        "summary": "Ruicheng (China) Media Group Limited, an investment holding company, provides various advertising services primarily in the People's Republic of China. The company offers television, online, outdoor, and other advertising services. It serves advertising companies and advertising agents. The company was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1736.HK": {
        "short_name": "PARENTING NET",
        "long_name": "China Parenting Network Holdings Limited",
        "summary": "China Parenting Network Holdings Limited, an investment holding company, engages in the provision of marketing and promotional services through its platforms in Mainland China. Its platforms include CI Web, mobile CI Web, mobile application software, and IPTV APPs. The company is also involved in the e-commerce business; licensing of smart-hardware devices; and provision of technical support and consultancy related services. It serves the children-babies-maternity market. China Parenting Network Holdings Limited was founded in 2005 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Nanjing"
    },
    "1753.HK": {
        "short_name": "DUIBA",
        "long_name": "Duiba Group Limited",
        "summary": "Duiba Group Limited, an investment holding company, operates as a user management software as a service (SaaS) provider for online businesses in the People's Republic of China. The company's SaaS platform offers user management tools, including reward points system operation, membership marketing operation, and gamification operation to enhance mobile app user activity and participation on apps. It also operates an interactive advertising platform. The company was founded in 2014 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "1762.HK": {
        "short_name": "WANKA ONLINE",
        "long_name": "Wanka Online Inc.",
        "summary": "Wanka Online Inc. provides android-based content distribution services. The company offers DAPG Platform, a proprietary platform that enables marketers to distribute contents, such as advertisements, games, and videos. It also provides mobile advertising, online-video distribution, and game co-publishing services. The company serves marketers from industries, including brand owners, advertising agencies, mobile app and game developers, and video content providers. Wanka Online Inc. was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "1831.HK": {
        "short_name": "SHIFANG HLDG",
        "long_name": "ShiFang Holding Limited",
        "summary": "ShiFang Holding Limited, an investment holding company, engages in the publishing and advertising businesses in the People's Republic of China. The company provides a series of newspaper advertising services; value-added advertising services, including target markets and readership analysis, content development and planning, layout development, editing, and event organization; digital publishing services; and tailor-made digital advertising services, such as the content draft, design, and production. It also offers TV advertising services for real estate and automotive clients, as well as designs and produces mini-programs and related advertisements for automotive industry. In addition, it provides integrated printed media services to advertising customers in various industries; various other services, including distribution management, publishing printed content by digital means, as well as market promotion values; printing and distribution consultancy services; publication distribution consultation and management services; and newspaper printing services. Further, the company offers integrated marketing services for web products, computer software development and sales, and technical services; corporate management information consultancy; marketing, agent, and economic information consultancy for the real estate industry; property management; advertising services; property marketing and agency; human resources; and technology promotion and consultancy services. Additionally, it is as involved in the tourism and entertainment business. The company serves consumer products, real estate, computer, communication, consumer products, telecommunications, home appliance retailing, automotive, home construction materials, healthcare and medicine, education, and classified advertisement sectors. ShiFang Holding Limited was founded in 2000 and is headquartered in Fuzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "1860.HK": {
        "short_name": "MOBVISTA",
        "long_name": "Mobvista Inc.",
        "summary": "Mobvista Inc. provides mobile advertising and mobile analytics services to the app developers worldwide. The company offers user acquisition and monetization services. Mobvista Inc. was founded in 2013 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "1917.HK": {
        "short_name": "DOUMOB",
        "long_name": "Doumob",
        "summary": "Doumob, a mobile advertising technology company, operates and maintains an advertising platform for advertisers and media publishers in the People's Republic of China. The company provides online advertising and sales services, as well as interactive and non-interactive advertising services. Doumob was founded in 2013 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "2131.HK": {
        "short_name": "NETJOY",
        "long_name": "Netjoy Holdings Limited",
        "summary": "Netjoy Holdings Limited, an investment holding company, principally engages in the provision of online advertising services in the People's Republic of China. It operates through two segments, Online Marketing Solutions Business and Pan-Entertainment Content Services Business. The company provides short video marketing solutions and online content services. It principally engages in operating its Huabian Platform, a pan entertainment-oriented content platform; planning and producing short videos for audiences and advertisers. The company also provides integrated services comprising creative design, production, programmatic precise distribution, performance tracking, and reporting of short video marketing content. In addition, it offers technical and consultation, as well as marketing services; and operates an entertainment-oriented content platform. The company's customers primarily include advertisers and advertising agencies for its online marketing solutions; and third-party ad networks and advertisers for advertising spaces on its Huabian Platform. It serves an advertiser base operating in a range of industry verticals, including online gaming, financial services, e-commerce, internet services, advertising, and culture and media. The company was founded in 2012 and is headquartered in Shanghai, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "300058.SZ": {
        "short_name": "BLUEFOCUS INTELLIG",
        "long_name": "BlueFocus Intelligent Communications Group Co., Ltd.",
        "summary": "BlueFocus Intelligent Communications Group Co., Ltd. provides marketing and brand management services in China and internationally. It offers marketing and brand management services across various disciplines, including strategy, digital, advertising, media, social, PR, design, branding, CRM, data, e-commerce, and mobile solutions to various multinational companies and Chinese enterprises, such as IT, automobile, consumer goods, real estate, finance, and entertainment industries. The company was formerly known as BlueFocus Communication Group Co., Ltd. and changed its name to BlueFocus Intelligent Communications Group Co., Ltd. in June 2018. BlueFocus Intelligent Communications Group Co., Ltd. was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300071.SZ": {
        "short_name": "SPEARHEAD INTEGR G",
        "long_name": "Spearhead Integrated Marketing Communication Group",
        "summary": "Spearhead Integrated Marketing Communication Group provides marketing services in China. It offers digital, experiential, content, big data, and public relation and communication marketing services. The company was founded in 2003 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300392.SZ": {
        "short_name": "BEIJING TENSYN DIG",
        "long_name": "Beijing Tensyn Digital Marketing Technology Joint Stock Company",
        "summary": "Beijing Tensyn Digital Marketing Technology Joint Stock Company operates as an integrated marketing services company in China. The company integrated data marketing services, including big data marketing, brand strategy and creativity, media strategy and purchasing, social and mobile marketing, content and search marketing, interactive experience optimization, and public opinion. It serves customers in various fields, such as games, Web services, home appliances, IT, finance, and automobiles. Beijing Tensyn Digital Marketing Technology Joint Stock Company was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300612.SZ": {
        "short_name": "SHUNYA INTERNATIO",
        "long_name": "Shunya International Martech (Beijing) Co., Ltd.",
        "summary": "Shunya International Martech (Beijing) Co., Ltd. operates as an integrated communications organization in China. The company offers various communication solutions for consumer insight system. The company was formerly known as Shunya International Brand Consulting (Beijing) Co., Ltd. and changed its name to Shunya International Martech (Beijing) Co., Ltd. in May 2019. Shunya International Martech (Beijing) Co., Ltd. was founded in 2007 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300805.SZ": {
        "short_name": "GUANGDONG BRANDMAX",
        "long_name": "Guangdong Brandmax Marketing Co.,Ltd.",
        "summary": "Guangdong Brandmax Marketing Co.,Ltd. provides electroacoustic marketing services in China. It offers regional marketing, public relation, conference and exhibition, offline brand planning, road show, tour, display, campus channel coverage, office building coverage, experience equipment, and promotion management services. The company is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "55U.F": {
        "short_name": "ADTIGER CORP.LTD.DL-,0005",
        "long_name": "Adtiger Corporations Limited",
        "summary": "Adtiger Corps Ltd., an investment holding company, provides online advertising services in the People's Republic of China and internationally. Its online advertising platform connects advertisers with media publishers. The company provides overseas online advertising services to China-based advertisers. Its advertising platform provides one-stop services to advertisers for their needs of user acquisition, as well as to media publishers for their needs of monetization. The company was founded in 2015 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "600234.SS": {
        "short_name": "GUANGHE LANDSCAPE CULTURE COMMU",
        "long_name": "Guanghe Landscape Culture Communication Co., Ltd.",
        "summary": "Guanghe Landscape Culture Communication Co., Ltd. engages in the media advertising, real estate leasing, and building decoration engineering services. The company was formerly known as Tai Yuan Tianlong Group Co., Ltd. and changed its name to Guanghe Landscape Culture Communication Co., Ltd. in March 2014. The company was founded in 1988 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "600242.SS": {
        "short_name": "ZHONGCHANG BIG DATA CORPORATION",
        "long_name": "Zhongchang Big Data Corporation Limited",
        "summary": "Zhongchang Big Data Corporation Limited, a big data intelligent marketing company, provides professional digital marketing services and software, and launching solutions in China. Its solutions include integrated marketing, international marketing, user loyalty management, customer relationship management, and data services. The company was formerly known as Zhong Chang Marine Company Ltd. and changed its name to Zhongchang Big Data Corporation Limited in October 2016. Zhongchang Big Data Corporation Limited was founded in 1993 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600826.SS": {
        "short_name": "DLG EXHIBITIONS & EVENTS CORP L",
        "long_name": "Shanghai Lansheng Corporation",
        "summary": "Shanghai Lansheng Corporation engages in the trade and industry, finance, real estate, and biopharmaceuticals businesses. The company offers footwear products, including sports, leather, canvas, baby, and indoor shoes, as well as slippers and rubber boots; and office supplies, such as typewriters, staplers, staples, punches, numbering machines, mathematical sets, paper clips, office pins, stamps, stamp pads, inks, rulers, artist brushes, and paint tools. It also provides student supplies comprising erasers, pencils, and pencil sharpeners; plastic products that include T-shirt, garbage, roll, seat, shopping, and ton packing bags, as well as PP sheets; and paper and paper products, which comprise playing cards, notebooks, and carbon papers. In addition, the company offers sporting products, including synthetic and mini balls, sporting gloves, golf equipment, and hardware and other products; camping goods, such as tents and sleeping bags; and musical instruments, toys, inflatable items, pet wear, garments, headwear, suitcases, kitchen accessories, flatware, towels, and sunglasses. Further, it provides garden and outdoor equipment; sanitary ware; bathroom and wooden products; cookware; kitchenware and utensils; shelving units and working tables; giftware; continuous casters, rolling mill equipment, and process line equipment; and canvas, hand, nylon, tapestry, and travel bags, as well as wallets. Additionally, the company offers stationery products; and sporting dresses, and electrical and mechanical goods. Shanghai Lansheng Corporation markets its products under brands, such as FORWARD, HISPO, LANHUA, NIEER, KOFA, ETERNA, PIONEER, SNOWFLAKE, LARK, GREAT WALL, etc. The company was formerly known as Shanghai Stationery & Sporting Goods Import & Export Corporation. Shanghai Lansheng Corporation was founded in 1983 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600986.SS": {
        "short_name": "ZHEWEN INTERACTIVE GROUP CO LTD",
        "long_name": "Zhewen Interactive Group Co., Ltd.",
        "summary": "Zhewen Interactive Group Co., Ltd. engages in the infrastructure construction, financial service, digital marketing, real estate development, and semiconductor businesses in China. The company invests in, constructs, manages, and operates various infrastructure projects. It offers general contracting services for municipal utilities and highway projects; water conservancy and hydroplant projects; railway engineering projects; bridge, road base, and pavement engineering projects; landscaping projects; transportation safety facilities; and power and electromechanical engineering projects. The company also provides financial support services, such as microcredit, finance lease, industrial fund, commercial banking, trade finance, etc. for companies; and operates nine digital marketing brands that offer brand management, creative planning, online marketing, offline implementation, advertising agency, online promotion, and other services. In addition, it develops various real estate projects in Dongying, Qingdao, Yantai, and Binzhou; and imports and exports various kinds of bulk stocks. Further, the company researches, develops, produces, and sells power semiconductor devices, chips, and modules, including IGBT, FRD, and MOSFET that are used in induction cookers, small power frequency converters, inverter welding machines, brushless motor controls, UPS, and other products. Additionally, it produces acrylamide, a biochemical using the microbiological method. The company was formerly known as Keda Group Co., Ltd. Zhewen Interactive Group Co., Ltd. was founded in 1984 and is headquartered in Dongying, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Dongying"
    },
    "603466.SS": {
        "short_name": "SHANGHAI FENGYUZHU CUL SCI AND ",
        "long_name": "Shanghai Fengyuzhu Exhibition Co., Ltd.",
        "summary": "Shanghai Fengyuzhu Exhibition Co., Ltd. operates in the exhibition industry in China. It operates approximately 500 theme exhibition halls that include provincial capitals, city pavilions, theme pavilions, museums, science and technology museums, park pavilions, corporate pavilions, memorial halls, tourist experience museums, and citizen cultural centers. Shanghai Fengyuzhu Exhibition Co., Ltd. was found in 2003 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603598.SS": {
        "short_name": "INLY MEDIA CO LTD",
        "long_name": "Inly Media Co., Ltd.",
        "summary": "Inly Media Co., Ltd. provides advertising, and market and media research services in China. It offers media agency services for television and Internet-based media; and data strategy consulting, product placement, Internet public relations, brand management, and other advertising services. The company was incorporated in 2005 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "603729.SS": {
        "short_name": "SHANGHAI LONGYUN MEDIA GROUP CO",
        "long_name": "Shanghai LongYun Media Group Co., Ltd.",
        "summary": "Shanghai LongYun Media Group Co., Ltd. provides integrated advertising and media resource management services in China. It offers advertising services, including market research, brand management, creative and design, TVC production, communication strategy, and execution and evaluation. The company was formerly known as Shanghai LongYun Advertising & Media Co., Ltd. and changed its name to Shanghai LongYun Media Group Co., Ltd. in February 2019. Shanghai LongYun Media Group Co., Ltd. was founded in 2003 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "603825.SS": {
        "short_name": "HYLINK DIGITAL SOLUTION CO LTD",
        "long_name": "Hylink Digital Solution Co., Ltd.",
        "summary": "Hylink Digital Solution Co., Ltd. provides digital advertising agency services in China and internationally. It offers brand strategy, creative, WeChat, and digital media services, as well as digital films; mobile, social/content, and search engine marketing services; and data analytics services. The company was founded in 1994 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "6833.HK": {
        "short_name": "SINCO PHARMA",
        "long_name": "Sinco Pharmaceuticals Holdings Limited",
        "summary": "Sinco Pharmaceuticals Holdings Limited, an investment holding company, provides marketing, promotion, and channel management services for imported pharmaceutical products and medical devices in China. The company offers Octapharma, a human albumin solution for use in premature infants; Axetine, which is used for the treatment of bacterial infections, including respiratory infections, urinary tract infections, soft tissue infections, gynecological and obstetrical infections, gonorrhea, and other infections, as well as for the prevention of post-surgery infections; and Medocef that is used for the treatment of bacterial infections, such as the infections of the lower respiratory tract comprising pneumonia, urinary tract, bile duct, peritoneum, skin, soft tissue, pelvic area, and sepsis. It also provides Esafosfina, which is used for treating hypophosphatemia and chronic diseases, including alcohol intoxication, malnutrition, and hypophosphatemic respiratory failure; Taurolite, a third generation oral cholic acid drug that is used for the treatment of gallstone diseases; and Tamifil injection for the treatment of metastatic prostate cancer, true precocious puberty, and endometriosis. In addition, the company engages in the purchase and sale of pharmaceutical products; and provides warehouse facilities for pharmaceutical products. The company was founded in 2011 and is headquartered in Chengdu, the People's Republic of China. Sinco Pharmaceuticals Holdings Limited is a subsidiary of Risun Investments Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Chengdu"
    },
    "6988.HK": {
        "short_name": "JOY SPREADER",
        "long_name": "Joy Spreader Interactive Technology Co. Ltd",
        "summary": "Joy Spreader Interactive Technology Co.,Ltd offers digital marketing services for online product providers and merchants in the People's Republic of China. It provides services to various applications, such as game, video, and utility apps; online literature products in various genres; and Html 5 game products in RPG, strategy, action, and adventure genres. The company was founded in 2008 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "8403.HK": {
        "short_name": "DOWWAY",
        "long_name": "Dowway Holdings Limited",
        "summary": "Dowway Holdings Limited, an investment holding company, operates as an integrated exhibition and event management company in the People's Republic of China. The company designs, plans, coordinates, and manages exhibitions and events; conducts liaison with suppliers and/or personnel for the construction of backdrops, stages, and exhibition booths, as well as installs audio, visual, and lighting equipment and facilities; and offers on-site supervision services. It provides integrated exhibition and event management services to domestic and overseas automobile brands primarily for facilitating showcases, promotion, and/or sales of their branded cars; and undertakes projects related to automobile exhibitions and events from non-automobile companies. Dowway Holdings Limited was founded in 2002 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "8627.HK": {
        "short_name": "ORANGE TOUR",
        "long_name": "Orange Tour Cultural Holding Limited",
        "summary": "Orange Tour Cultural Holding Limited, an investment holding company, provides marketing services in the People's Republic of China. It offers various event management services, such as cultural, artistic, recreational, and corporate promotional events. The company also designs, produces, and sells various sketches, graphics, and other marketing materials. It serves governmental and commercial sectors. The company was founded in 2006 and is headquartered in Wuxi, the People's Republic of China. Orange Tour Cultural Holding Limited is a subsidiary of QY Investment Holding Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Wuxi"
    },
    "9919.HK": {
        "short_name": "ACTIVATION GP",
        "long_name": "Activation Group Holdings Limited",
        "summary": "Activation Group Holdings Limited, an investment holding company, operates as an integrated marketing solutions provider in the People's Republic of China. The company offers integrated marketing solutions, including experiential marketing, digital and brand communication, and public relations services. It also provides sports intellectual property development services; manages and operates sport events; and invests in entertainment projects. The company was founded in 2013 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shanghai"
    },
    "ADMG": {
        "short_name": "ADAMANT DRI PROCESSING & MINLS ",
        "long_name": "Adamant DRI Processing and Minerals Group",
        "summary": "Adamant DRI Processing and Minerals Group, through its interest in Shenzhen Dingshang Technology Co., Ltd., provides a set of digital implementation plans for exhibition center display projects and display booths, and model designs for various exhibition centers and real estate. The company was incorporated in 2014 and is based in Shenzhen, the Peoples' Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "BAOS": {
        "short_name": "Baosheng Media Group Holdings L",
        "long_name": "Baosheng Media Group Holdings Limited",
        "summary": "Baosheng Media Group Holdings Limited operates as an online marketing solution provider in China. The company connects advertisers and online media, and helping advertisers to manage their online marketing activities in various ways, including advising on advertising strategies, budget, and choice of advertising channels; procuring ad inventory; offering ad optimization services; and administrating and fine-tuning the ad placement process. It also serves media businesses in various ways, including identifying advertisers to buy their ad inventory; facilitating payment arrangements with advertisers; assisting advertisers in handling ad deployment logistics with media; and engaging in other marketing and promotion activities aimed at educating and inducing advertisers to use online advertising. The company's advertising services comprise search engine marketing (SEM) services, such as the deployment of ranked search ads and other display search ads offered by search engine operators; and non-SEM services consisting of social media marketing, in-feed advertising, and mobile app advertising through deploying ads on media, such as social media platforms, short-video platforms, news portals, and mobile apps. Baosheng Media Group Holdings Limited was incorporated in 2018 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "C5N1.F": {
        "short_name": "ZW DATA ACT.TECH.DL -,001",
        "long_name": "ZW Data Action Technologies Inc.",
        "summary": "ZW Data Action Technologies Inc., through its subsidiaries, provides omni-channel advertising, precision marketing, and data analysis management systems in the People's Republic of China. It offers Internet advertising, precision marketing, and related data services through its Internet portals, including 28.com and liansuo.com that provide advertisers with tools to build sales channels in the form of franchisees, sales agents, distributors, and/or resellers. The company also develops and operates blockchain technology-based products and services. In addition, it provides; digital business promotion; and other e-commerce online to offline advertising and marketing and related value-added technical services, as well as research and development, and other technical support services for the block chain business. The company was formerly known as ChinaNet Online Holdings, Inc. and changed its name to ZW Data Action Technologies Inc. in October 2020. ZW Data Action Technologies Inc. was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "CNET": {
        "short_name": "ZW Data Action Technologies Inc",
        "long_name": "ZW Data Action Technologies Inc.",
        "summary": "ZW Data Action Technologies Inc., through its subsidiaries, provides omni-channel advertising, precision marketing, and data analysis services in the People's Republic of China. It offers Internet advertising, precision marketing, and related data and value added services through its Internet portals, including 28.com and liansuo.com that provide advertisers with tools to build sales channels in the form of franchisees, sales agents, distributors, and/or resellers; and distributes television shows comprising advertisements. The company is also involved in the technical services; and research and development, and other technical support services for the block chain business. ZW Data Action Technologies Inc. has a strategic cooperation agreement with Shenzhen WePay Technology Co., Ltd. The company was formerly known as ChinaNet Online Holdings, Inc. and changed its name to ZW Data Action Technologies Inc. in October 2020. ZW Data Action Technologies Inc. was founded in 2003 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "ENGA": {
        "short_name": "ENGAGE MOBILITY INC",
        "long_name": "Engage Mobility, Inc.",
        "summary": "Engage Mobility, Inc. does not have significant operations. The company intends to seek, investigate, and engage in a business combination with a private entity whose business presents an opportunity for its stockholders. Previously, it provided mobile marketing, online and mobile video production, distribution, and syndication and marketing services for business owners. The company was formerly known as Marketkast, Incorporated and changed its name to Engage Mobility, Inc. in March 2013. Engage Mobility, Inc. was founded in 2011 and is based in Shenzhen, China. Engage Mobility, Inc. is a subsidiary of Engage International Technology Co., Ltd.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "EZOO": {
        "short_name": "EZAGOO LIMITED",
        "long_name": "Ezagoo Limited",
        "summary": "Ezagoo Limited provides advertising services in China. It offers display advertisement services on TV screens mounted on public buses. Ezagoo Limited was incorporated in 2018 and is based in Changsha, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Changsha"
    },
    "SJY.F": {
        "short_name": "SINOM.HLDG LTD.",
        "long_name": "SinoMedia Holding Limited",
        "summary": "SinoMedia Holding Limited, an investment holding company, provides TV advertisement, creative content production, and digital marketing services for advertisers and advertising agents in Hong Kong, Singapore, and the People's Republic of China. The company provides TV media resources management services that covers programs, such as news, politics, culture, and children's programs; professional advertisement video production services comprising graphic design, advertising video shooting, and producing and editing services, as well as content creative communication services; and integrated communication services, including brand information, advertising placement, promotion planning, public relation services, and other multi-dimensional brand integrated communication services. It also provides digital marketing and internet media services. In addition, the company operates iBCP, an intelligent programming advertising placement platform; lotour.com, a travel inspiration site; boosj.com, an interactive video platform; and wugu.com.cn, an agricultural information services platform. Further, it is involved in the CCTV's advertising agency business, and investment and production of film and television programs, as well as provides public service advertising broadcast network services. SinoMedia Holding Limited was founded in 1999 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "SUHA.F": {
        "short_name": "SHIFANG HLDG LTD  HD -,01",
        "long_name": "ShiFang Holding Limited",
        "summary": "ShiFang Holding Limited, an investment holding company, engages in the publishing and advertising businesses in the People's Republic of China. The company provides a series of newspaper advertising services; value-added advertising services, including target markets and readership analysis, content development and planning, layout development, editing, and event organization; digital publishing services; and tailor-made digital advertising services, such as the content draft, design, and production. It also offers TV advertising services for real estate and automotive clients, as well as designs and produces mini-programs and related advertisements for automotive industry. In addition, it provides integrated printed media services to advertising customers in various industries; various other services, including distribution management, publishing printed content by digital means, as well as market promotion values; printing and distribution consultancy services; publication distribution consultation and management services; and newspaper printing services. Further, the company offers integrated marketing services for web products, computer software development and sales, and technical services; corporate management information consultancy; marketing, agent, and economic information consultancy for the real estate industry; property management; advertising services; property marketing and agency; human resources; and technology promotion and consultancy services. Additionally, it is as involved in the tourism and entertainment business. The company serves consumer products, real estate, computer, communication, consumer products, telecommunications, home appliance retailing, automotive, home construction materials, healthcare and medicine, education, and classified advertisement sectors. ShiFang Holding Limited was founded in 2000 and is headquartered in Fuzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "WIMI": {
        "short_name": "WiMi Hologram Cloud Inc.",
        "long_name": "WiMi Hologram Cloud Inc.",
        "summary": "WiMi Hologram Cloud Inc. provides augmented reality (AR) based holographic services and products in China. It operates in two segments, Augmented Reality Advertising Service; and AR Entertainment. The company primarily offers holographic AR advertising services and holographic AR entertainment products. Its holographic AR advertising software enables users to insert into video footages real or animated three dimensional objects; and online holographic AR advertising solution embeds holographic AR ads into films and shows. The company's holographic AR entertainment products consist primarily of payment middleware software, game distribution platform, and holographic mixed reality software. WiMi Hologram Cloud Inc. was founded in 2015 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "XNET": {
        "short_name": "Xunlei Limited",
        "long_name": "Xunlei Limited",
        "summary": "Xunlei Limited operates an Internet platform for digital media content in the People's Republic of China. The company's platform is based on cloud technology that enables users to access, manage, and consume digital media content. It offers Xunlei Accelerator, which enables users to accelerate digital transmission over the Internet; mobile acceleration plug-in, which provides mobile device users with benefits of download speed acceleration and download success rate improvements; and cloud acceleration subscription services that offer users premium services through various products, such as Green Channel. The company also provides Mobile Xunlei, a mobile application that allows users to search, download, and consume digital media content on their mobile devices; Xunlei Media Player, which supports online and offline play of digital media content, as well as simultaneous play of digital media content while it is being transmitted by Xunlei Accelerator; online games through online game Website and mobile app; live video streaming and online advertising services; and cloud computing and other Internet value-added services. As of December 2019, its platform had approximately 88.3 million monthly unique visitors. The company was formerly known as Giganology Limited and changed its name to Xunlei Limited in January 2011. Xunlei Limited was founded in 2003 and is based in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    }
}