{
  "000665.SZ": {
    "city": "Wuhan",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Broadcasting",
    "long_name": "Hubei Radio & Television Information Network Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "HUBEI BROADCASTING",
    "state": null,
    "summary": "Hubei Radio & Television Information Network Co., Ltd. engages in planning, designing, building, managing, operating, and developing of radio and television networks in China. The company is based in Wuhan, China.",
    "website": "http://www.hrtn.net",
    "zipcode": "430071"
  },
  "002238.SZ": {
    "city": "Shenzhen",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Broadcasting",
    "long_name": "Shenzhen Topway Video Communication Co., Ltd",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "SHENZHEN TOPWAY VI",
    "state": null,
    "summary": "Shenzhen Topway Video Communication Co., Ltd. constructs, operates, and maintains cable television (TV) networks that provide cable TV viewing and related value-added services in Shenzhen, China. It offers digital TV and broadband services. The company was founded in 1995 and is based in Shenzhen, China. Shenzhen Topway Video Communication Co., Ltd. is a subsidiary of Shenzhen Media Group Co. Ltd.",
    "website": "http://www.topway.com.cn",
    "zipcode": "518036"
  },
  "1024.HK": {
    "city": "Beijing",
    "country": "China",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Broadcasting",
    "long_name": "Kuaishou Technology",
    "market": "hk_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "KUAISHOU-W",
    "state": null,
    "summary": "Kuaishou Technology, an investment holding company, provides live streaming, online marketing, and e-commerce services. It offers Kuaishou Flagship, a short video and content based social networking platform; Kuaishou Concept; Kuaishou express; Yitian Camera, an app to create photograph, video, and vlogs; Kmovie, a shooting, editing, and production tool; AcFun, a video sharing website; and Kuaikandian, an information content aggregator. The company also develops and sells in-house mobile games, as well as games developed by third party game developers; and provides online knowledge contents through its platform. Kuaishou Technology was founded in 2011 and is headquartered in Beijing, China.",
    "website": "http://www.kuaishou.com",
    "zipcode": "100085"
  },
  "5Y0.F": {
    "city": "Beijing",
    "country": "China",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Broadcasting",
    "long_name": "Kuaishou Technology",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "KUAISHOU TECHNOLOGY CL.B",
    "state": null,
    "summary": "Kuaishou Technology, an investment holding company, provides live streaming, online marketing, and other services. It offers Kuaishou Flagship, a short video and content based social networking platform; Kuaishou Express; Kuaishou Concept; Yitian Camera, an app to create photographs, videos, and vlogs; Kmovie, a shooting, editing, and production tool; AcFun, a video sharing website; and Kuaikandian, an information content aggregator. The company also develops and sells in-house mobile games, as well as games developed by third party game developers; and provides online knowledge contents through its platform. In addition, it develops software, hardware, and network technology; and offers programming and advertising, internet information, and multimedia information services, as well as provides technology development, promotion, and other services. Kuaishou Technology was founded in 2011 and is headquartered in Beijing, China.",
    "website": "http://www.kuaishou.com",
    "zipcode": "100085"
  },
  "600037.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Broadcasting",
    "long_name": "Beijing Gehua CATV Network Co., LTD.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "BEIJING GEHUA CATV NETWORK",
    "state": null,
    "summary": "Beijing Gehua CATV Network Co., Ltd. engages in the construction, management, and operation of cable radio and television networks in China. The company offers radio and television programs transmission, video on demand, and network information services; Internet access services based on cable TV networks; value-added services for Internet data transmission; domestic IP telephony services; and cable TV advertising design, production, and distribution services. It serves by government agencies, enterprises, banks, schools, hospitals, communities, business districts, commercial office buildings, etc. The company was founded in 1999 and is based in Beijing, China.",
    "website": "http://www.bgctv.com.cn",
    "zipcode": "100191"
  },
  "600556.SS": {
    "city": "Beijing",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Broadcasting",
    "long_name": "Inmyshow Digital Technology (Group) Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Communication Services",
    "short_name": "INMYSHOW DIGITAL TECHNOLOGY (GR",
    "state": null,
    "summary": "Beijing ShowWorld Technology Co., Ltd. provides social marketing cloud computing solutions for brands, and small and micro enterprises. It offers WEIQ, a big data cloud delivery platform that establishes links for business users and red people who have advertising needs; SMART, a platform that helps large companies in various industries cope with the complex challenges; and provides market research, strategy formulation, resource integration, and technology development services. The company also provides Topklout, a platform for value ranking and copyright management agency services; and Imsocial Red Accelerator that provides solutions, such as training, business trusteeship, IP incubation, brand communication, capital docking, human legal affairs, and business consulting. It serves in FMCG, beauty, Internet, 3c digital, automotive, finance, and other industries. Beijing ShowWorld Technology Co., Ltd. was formerly known as INMYSHOW Inc. The company was founded in 2009 and is headquartered in Beijing, China.",
    "website": "http://www.inmyshow.com",
    "zipcode": "100027"
  },
  "600831.SS": {
    "city": "Xi'an",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Broadcasting",
    "long_name": "Shaanxi Broadcast & TV Network Intermediary (Group) Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "SHAANXI BROADCAST & TV NETWORK",
    "state": null,
    "summary": "Shaanxi Broadcast & TV Network Intermediary (Group) Co.,Ltd. provides digital TV, cable television, HD interactive TV, data service in the People's Republic of China. It offers digital and cable television services; and high-definition interactive TV services, including video programs and various interactive applications, as well as broadband services. Shaanxi Broadcast & TV Network Intermediary (Group) Co.,Ltd. is based in Xi'an, the People's Republic of China.",
    "website": "http://www.sxbctv.com",
    "zipcode": "710061"
  },
  "603721.SS": {
    "city": "Changsha",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Broadcasting",
    "long_name": "TVZone Media Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Communication Services",
    "short_name": "TVZONE MEDIA CO LTD",
    "state": null,
    "summary": "TVZone Media Co., Ltd. produces, distributes, and markets TV, Internet, and mobile Internet video content. It offers daily and weekly broadcast programs, and large season broadcast programs covering documentary stories, column dramas, and others. The company was founded in 2007 and is based in Changsha, China. TVZone Media Co., Ltd. is a subsidiary of Changsha Broadcast & Television Group.",
    "website": "http://www.tvzone.cn",
    "zipcode": "410005"
  },
  "GSMG": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Broadcasting",
    "long_name": "Glory Star New Media Group Holdings Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "Glory Star New Media Group Hold",
    "state": null,
    "summary": "Glory Star New Media Group Holdings Limited provides advertisement and content production services in China. The company also engages in the mobile and online advertising, digital media, and entertainment businesses. In addition, it offers CHEERS app, an e-commerce platform, which provides online store, live streaming, and online games, as well as online short videos, variety shows, and dramas. Glory Star New Media Group Holdings Limited was founded in 2016 and is headquartered in Beijing, China.",
    "website": "http://www.yaoshixinghui.com",
    "zipcode": "100016"
  },
  "KUASF": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Broadcasting",
    "long_name": "Kuaishou Technology",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Communication Services",
    "short_name": "KUAISHOU TECHNOLOGY",
    "state": null,
    "summary": "Kuaishou Technology, an investment holding company, provides live streaming, online marketing, and other services. It offers Kuaishou Flagship, a short video and content based social networking platform; Kuaishou Express; Kuaishou Concept; Yitian Camera, an app to create photographs, videos, and vlogs; Kmovie, a shooting, editing, and production tool; AcFun, a video sharing website; and Kuaikandian, an information content aggregator. The company also develops and sells in-house mobile games, as well as games developed by third party game developers; and provides online knowledge contents through its platform. In addition, it develops software, hardware, and network technology; and offers programming and advertising, internet information, and multimedia information services, as well as provides technology development, promotion, and other services. Kuaishou Technology was founded in 2011 and is headquartered in Beijing, China.",
    "website": "http://www.kuaishou.com",
    "zipcode": "100085"
  },
  "REBL": {
    "city": "Shanghai",
    "country": "China",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Broadcasting",
    "long_name": "Rebel Group, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "REBEL GROUP INC",
    "state": null,
    "summary": "Rebel Group Inc., through its subsidiaries, organizes, promotes, and hosts mixed martial arts (MMA) events in China and Singapore. It also produces and distributes videos of its MMA events, through the Internet and social media, as well as sells the rights to such videos to distribute to television stations. The company is headquartered in Xuhui, China.",
    "website": "http://www.rebelfightingchampionship.com",
    "zipcode": "200030"
  },
  "SJ": {
    "city": "Beijing",
    "country": "China",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Broadcasting",
    "long_name": "Scienjoy Holding Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Communication Services",
    "short_name": "Scienjoy Holding Corporation",
    "state": null,
    "summary": "Scienjoy Holding Corporation provides mobile live streaming platforms in the People's Republic of China. The company focuses on interactive show live streaming from broadcasters to users. Its platforms enable users to view and interact with broadcasters through online chat, virtual items, and playing games. As of December 31, 2020, the company had 332,410 paying users and 118,411 active broadcasters. It operates five platforms under the Showself, Lehai, Haixiu, BeeLive Chinese, and BeeLive International brands. The company also offers technical development and advisory services. Scienjoy Holding Corporation was founded in 2011 and is based in Beijing, the People's Republic of China.",
    "website": "http://www.scienjoy.com",
    "zipcode": "100029"
  }
}
