{
    "002174.SZ": {
        "short_name": "YOUZU INTERACTIVE",
        "long_name": "YOOZOO Interactive Co., Ltd.",
        "summary": "YOOZOO Interactive Co., Ltd. engages in the development, distribution, publishing, and operation of mobile and Internet games. Its browser-based games include The Legend of the Condor Heroes, Touken Ranbu-online, The Lost Tomb, League of Angels and League of Angels II, The Great Emperor, The General, and Thirty-Six Straragems. The company also offers mobile games, such as The Advisors Alliance, Junior Monkey King, Legacy of Discord-Furious Wings, Junior Three Kingdoms, The Great Emperor-online, Super Fighter, League of Angels, and Kongfu Fantasy, as well as Mob, a mobile developer platform. The company was formerly known as YOOZOO Games Co., Ltd. and changed its name to YOOZOO Interactive Co., Ltd. in April 2021. YOOZOO Interactive Co., Ltd. was founded in 2009 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.yoozoo.com",
        "market_cap": 15550691328
    },
    "002354.SZ": {
        "short_name": "DALIAN ZEUS ENTERT",
        "long_name": "Dalian Zeus Entertainment Co., Ltd.",
        "summary": "Dalian Zeus Entertainment Co., Ltd. develops and publishes games for mobile devices, PCs, and consoles. It is also involved in the Internet advertising, iOS app distribution, and film and TV production businesses. The company was founded in 2003 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100123",
        "website": "http://www.tianshenyule.com",
        "market_cap": 6336068096
    },
    "002425.SZ": {
        "short_name": "KAISER (CHINA) CUL",
        "long_name": "Kaiser (China) Culture Co., LTD",
        "summary": "Kaiser (China) Culture Co., Ltd operates in the Internet entertainment industry. The company is involved in the intellectual property operations; and research, development, and distribution of mobile games. It also produces and invests in films and television dramas, as well as animations; and invests in Internet culture industry. The company was formerly known as Kaiser (China) Holding Co., Ltd. and changed its name to Kaiser (China) Culture Co., Ltd in September 2016. Kaiser (China) Culture Co., Ltd was founded in 1994 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.kaiser.com.cn",
        "market_cap": 8609985536
    },
    "002447.SZ": {
        "short_name": "DALIAN MORNINGSTAR",
        "long_name": "Dalian Morningstar Network Technology Co., Ltd.",
        "summary": "Dalian Morningstar Network Technology Co., Ltd. engages in the mobile games and e-sports businesses. The company was formerly known as Dalian Yi Qiao Sea Cucumber Co., Ltd. and changed its name to Dalian Morningstar Network Technology Co., Ltd. in January 2018. Dalian Morningstar Network Technology Co., Ltd. was founded in 2001 and is based in Dalian, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116000",
        "website": "http://www.morningstarnet.com",
        "market_cap": 2925739520
    },
    "002517.SZ": {
        "short_name": "KINGNET NETWORK CO",
        "long_name": "Kingnet Network Co., Ltd.",
        "summary": "Kingnet Network Co., Ltd. engages in the development and operation of Web and mobile games. It operates various Internet platform products, such as XY games for Web games platforms; and XY Apple assistant, an application distribution platform, etc. The company also provides layout planning service for high-tech Internet business. In addition, it offers entertainment products. The company was founded in 2008 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201114",
        "website": "http://www.kingnet.com",
        "market_cap": 9793966080
    },
    "002619.SZ": {
        "short_name": "EGLS CO LTD",
        "long_name": "EGLS Co.,Ltd.",
        "summary": "EGLS Co.,Ltd. develops and operates wireless boutique online games. It is involved in the development, operation, and distribution of mobile games, including video games and game engines. The company was formerly known as Zhejiang Dragon Pipe Manufacturing Co., Ltd. and changed its name to EGLS Co.,Ltd. in August 2017. EGLS Co.,Ltd. was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.egls.cn",
        "market_cap": 2416818944
    },
    "0302.HK": {
        "short_name": "CMGE",
        "long_name": "CMGE Technology Group Limited",
        "summary": "CMGE Technology Group Limited develops, publishes, and operates intellectual property (IP) - based PC and mobile games in the People's Republic of China. The company offers games on IPs related to cultural products and art works, such as icons or characters from animations, novels, and motion pictures. As of December 31, 2020, it operated 81 games. The company was founded in 2009 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.cmge.com",
        "market_cap": 8559611392
    },
    "0434.HK": {
        "short_name": "BOYAA",
        "long_name": "Boyaa Interactive International Limited",
        "summary": "Boyaa Interactive International Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. Its Web-based and mobile games include board games; and casual shooting, casual virtual-pet-raising, 8-Ball Pool, and Mahjong games. As of December 31, 2019, the company had a portfolio of 78 online games in 11 versions of languages. It also provides advisory services relating to online game applications. Boyaa Interactive International Limited was founded in 2004 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.boyaa.com.hk",
        "market_cap": 405199328
    },
    "0484.HK": {
        "short_name": "FORGAME",
        "long_name": "Forgame Holdings Limited",
        "summary": "Forgame Holdings Limited, an investment holding company, develops, publishes, and operates webgames, and mobile and virtual reality games in the People's Republic of China and internationally. It operates in two segments, Game Business and Internet Micro-credit Business. The company also operates 91wan, a game publishing platform. In addition, it provides information technology; software development; and internet micro-credit services. The company was founded in 2009 and is headquartered in Shenzhen the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.forgame.com",
        "market_cap": 245030736
    },
    "0777.HK": {
        "short_name": "NETDRAGON",
        "long_name": "NetDragon Websoft Holdings Limited",
        "summary": "NetDragon Websoft Holdings Limited, an investment holding company, develops online and mobile games in the People's Republic of China, the United States, the United Kingdom, and internationally. It engages in the games design, programming and graphics, and online and mobile games operation; online education and related application business; and mobile solution, products, and marketing businesses. The company's games for kids include JumpStart, School of Dragons, Neopets, World of Madagascar, and Math Blaster; and other games comprise Eudemons Online, Conquer Online, Way of the Five, and Adventure Navigation. It also licenses and services developed games; develops and provides products in augmented reality and computer vision with machine learning technology; sells education hardware and software products; and develops properties. The company was formerly known as NetDragon Websoft Inc. and changed its name to NetDragon Websoft Holdings Limited in June 2016. NetDragon Websoft Holdings Limited was founded in 1999 and is headquartered in Fuzhou, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://www.netdragon.com",
        "market_cap": 12103006208
    },
    "08IA.F": {
        "short_name": "IDREAMSKY TECH. DL-,0001",
        "long_name": "iDreamSky Technology Holdings Limited",
        "summary": "iDreamSky Technology Holdings Limited operates as a digital entertainment platform in the game publishing market in the People's Republic of China. It operates through three segments: Game and Information Services; SaaS and Other Related Services; and Offline Entertainment. The company primarily publishes third party licensed games and self-developed games to the game players through various mobile application stores and software websites, as well as through other game publishers; and provides in-game information services. It also offers digital content services, such as games and animation, as well as online and offline integration of entertainment, and information services, including advertising services; and a series of software as a service (SaaS) tools and the related services to the content developers. In addition, the company operates WePlay offline stores that conducts offline game events; sells game consoles and designer toys; and develops internet and software technology and service. Further, it offers financing, culture and sports, leisure and entertainment, and internet information services. The company was founded in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.idreamsky.com",
        "market_cap": 793049984
    },
    "1022.HK": {
        "short_name": "FEIYU",
        "long_name": "Feiyu Technology International Company Ltd.",
        "summary": "Feiyu Technology International Company Ltd., an investment holding company, develops, operates, and distributes mobile, web, and personal computer games in Mainland China. Its game portfolio includes Shen Xian Dao, Carrot Fantasy, San Guo Zhi Ren, Super Phantom Cat, Neon Abyss, and Kaki Raid. As of December 31, 2020, it had approximately 228.5 million cumulative registered users, including 172.7 million web game users and 55.8 million mobile game users; 604.0 million cumulative activated downloads for casual games; and 36.5 million cumulative registered users for HTML5 games. The company was founded in 2009 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.feiyuhk.com",
        "market_cap": 1577878784
    },
    "1119.HK": {
        "short_name": "IDREAMSKY",
        "long_name": "iDreamSky Technology Holdings Limited",
        "summary": "iDreamSky Technology Holdings Limited operates as a digital entertainment platform in the game publishing market in the People's Republic of China. It operates through three segments: Game and Information Services; SaaS and Other Related Services; and Offline Entertainment. The company primarily publishes third party licensed games and self-developed games to the game players through various mobile application stores and software websites, as well as through other game publishers; and provides in-game information services. It also offers digital content services, such as games and animation, as well as online and offline integration of entertainment, and information services, including advertising services; and a series of software as a service (SaaS) tools and the related services to the content developers. In addition, the company operates WePlay offline stores that conducts offline game events; sells game consoles and designer toys; and develops internet and software technology and service. Further, it offers financing, culture and sports, leisure and entertainment, and internet information services. The company was founded in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.idreamsky.com",
        "market_cap": 6340255744
    },
    "13O.F": {
        "short_name": "OURGAME INT.HOL.DL-,00005",
        "long_name": "Ourgame International Holdings Limited",
        "summary": "Ourgame International Holdings Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. The company operates through three segments: Lianzhong Group, and AESE Group. It operates an integrated online game platform that offers personal computer (PC) games and provides services through its PC client portals, such as Ourgame Hall; and distributes mobile games and provides services primarily for Android and iOS operating systems through third-party distribution and payment channels, including mobile operators. The company also provides web games through its ourgame.com website; and hosts games and offers on-going updates and technical support services for the operation of self-developed and licensed games, as well as prevents, detects, and resolves in-game cheating and hacking activities. In addition, it distributes games developed and operated by third-party developers; provides computer related technical support services; offers television production, brand licensing, tour management, and consulting services in Gibraltar; and organizes and broadcasts online to offline mind-sports events, tournaments, TV shows, and contents. Ourgame International Holdings Limited was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.ourgame.com",
        "market_cap": 87450208
    },
    "1961.HK": {
        "short_name": "JIU ZUN DIGITAL",
        "long_name": "Jiu Zun Digital Interactive Entertainment Group Holdings Limited",
        "summary": "Jiu Zun Digital Interactive Entertainment Group Holdings Limited operates as a digital entertainment content provider in the People's Republic of China. The company develops and operates mobile games, primarily casual mobile games, as well as multi-player and boutique mobile games. It also distributes digital media content, such as e-magazines, comics, and music. The company was founded in 2011 and is headquartered in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.jiuzundigital.com",
        "market_cap": 305760000
    },
    "1BY.F": {
        "short_name": "BOYAA INTER.INTL DL-00005",
        "long_name": "Boyaa Interactive International Limited",
        "summary": "Boyaa Interactive International Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. Its Web-based and mobile games include board games; and casual shooting, casual virtual-pet-raising, 8-Ball Pool, and Mahjong games. As of December 31, 2019, the company had a portfolio of 78 online games in 11 versions of languages. It also provides advisory services relating to online game applications. Boyaa Interactive International Limited was founded in 2004 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.boyaa.com.hk",
        "market_cap": 43058760
    },
    "2022.HK": {
        "short_name": "DIGIT HOLLYWOOD",
        "long_name": "Digital Hollywood Interactive Limited",
        "summary": "Digital Hollywood Interactive Limited, an investment holding company, publishes online games for China-based game developers in North America, Europe, the People's Republic of China, and internationally. The company develops, operates, and publishes various games primarily consisting of casual games, and mid-and hardcore games in web and mobile formats to various demographic user communities; and provides game redesign, optimization, marketing, distribution, monetization, payment support, and other user-related services. It also offers marketing and technical support services. The company was founded in 2010 and is headquartered in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510260",
        "website": "http://www.gamehollywood.com",
        "market_cap": 180000000
    },
    "2100.HK": {
        "short_name": "BAIOO",
        "long_name": "BAIOO Family Interactive Limited",
        "summary": "BAIOO Family Interactive Limited, an investment holding company, develops and operates children's online entertainment destination and other businesses in the People's Republic of China. The company operates through Online Entertainment Business and Other Businesses segments. It primarily focuses on genres, including female-oriented, and pet and collection raising games, as well as comic adapted nijigen games. The company's principal products comprise Web-based virtual world, such as Aobi Island, Aola Star, Light of Aoya, and Legend of Aoqi, as well as mobile games comprising Zaowufaze, Shiwuyu, and Aola Star Mobile. It also operates various online comic series that include Aola Star: Parallel Universe and Shiwuyu. In addition, the company provides online interactive entertainment and education services for children; software and information technology services; and culture and art services, as well as researches and develops computer software. The company was incorporated in 2009 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.baioo.com.hk",
        "market_cap": 4782254080
    },
    "2660.HK": {
        "short_name": "ZENGAME",
        "long_name": "Zengame Technology Holding Limited",
        "summary": "Zengame Technology Holding Limited develops and operates mobile games in the People's Republic of China. The company offers card and board games, as well as other casual mobile games. It also provides technical services. As of December 31, 2020, it had a portfolio of 58 self-developed and 13 third party games, including 18 card games, 17 board games, and 36 other games. The company was founded in 2010 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.zen-game.com",
        "market_cap": 1261625600
    },
    "2B6.F": {
        "short_name": "BAIOO FAMILY INTERACTIVE",
        "long_name": "BAIOO Family Interactive Limited",
        "summary": "BAIOO Family Interactive Limited, an investment holding company, develops and operates children's online entertainment destination and other businesses in the People's Republic of China. The company operates through Online Entertainment Business and Other Businesses segments. It primarily focuses on genres, including female-oriented, and pet and collection raising games, as well as comic adapted nijigen games. The company's principal products comprise Web-based virtual world, such as Aobi Island, Aola Star, Light of Aoya, and Legend of Aoqi, as well as mobile games comprising Zaowufaze, Shiwuyu, and Aola Star Mobile. It also operates various online comic series that include Aola Star: Parallel Universe and Shiwuyu. In addition, the company provides online interactive entertainment and education services for children; software and information technology services; and culture and art services, as well as researches and develops computer software. The company was incorporated in 2009 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://www.baioo.com.hk",
        "market_cap": 517795424
    },
    "300052.SZ": {
        "short_name": "SZ ZHONGQINGBAO IN",
        "long_name": "SHENZHEN ZQGAME CO., LTD",
        "summary": "SHENZHEN ZQGAME CO., LTD engages in the development and operation of large-scale end-games, online games, mobile games, and social games in China. The company was founded in 2003 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.zqgame.com",
        "market_cap": 2261480704
    },
    "300113.SZ": {
        "short_name": "HANGZHOU SHUNWANG",
        "long_name": "Hangzhou Shunwang Technology Co,Ltd",
        "summary": "Hangzhou Shunwang Technology Co,Ltd provides Internet bar platform services in China. It develops gaming tournament platform for game players and Internet bar, as well as offers marketing services to Internet-based game companies. The company was founded in 2005 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310012",
        "website": "http://www.shunwang.com",
        "market_cap": 9858875392
    },
    "300315.SZ": {
        "short_name": "OURPALM CO LTD",
        "long_name": "Ourpalm Co., Ltd.",
        "summary": "Ourpalm Co., Ltd. develops, publishes, and operates smart mobile and social Web games, and Websites. It also engages in the TV, film, and music production, as well as celebrity representation activities. The company was founded in 2004 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100192",
        "website": "http://www.ourpalm.com",
        "market_cap": 11802014720
    },
    "300418.SZ": {
        "short_name": "BEIJING KUNLUN TEC",
        "long_name": "Beijing Kunlun Tech Co., Ltd.",
        "summary": "Beijing Kunlun Tech Co., Ltd. engages in the research, development, and distribution of mobile game platform in China and internationally. It also operates software store. The company was formerly known as Kunlun Ltd. and changed its name to Beijing Kunlun Tech Co., Ltd. in March 2011. Beijing Kunlun Tech Co., Ltd. was founded in 2008 and is based in Beijing, China. Beijing Kunlun Tech Co., Ltd. is a subsidiary of Beijing Kunlun World Wide Technology Share Co., Ltd.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.kunlun.com",
        "market_cap": 21953937408
    },
    "300459.SZ": {
        "short_name": "ZHEJIANG JINKE CUL",
        "long_name": "Zhejiang Jinke Culture Industry Co., LTD.",
        "summary": "Zhejiang Jinke Culture Industry Co., LTD. engages in the production, distribution, and operation of online early-childhood education business in China and internationally. The company primarily develops Talking Tom Cat Family and My Angela mobile applications for parents and children. It also researches, develops, produces, and sells SPC, the oxygen bleaching assistant used in chemical production. The company was formerly known as Zhejiang Jinke Entertainment Culture Co., Ltd. and changed its name to Zhejiang Jinke Culture Industry Co., LTD. in July 2017. Zhejiang Jinke Culture Industry Co., LTD. was founded in 2007 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311215",
        "website": "http://www.jinkeculture.com",
        "market_cap": 12692073472
    },
    "300467.SZ": {
        "short_name": "SICHUAN XUN YOU NE",
        "long_name": "Sichuan Xunyou Network Technology Co., Ltd.",
        "summary": "Sichuan Xunyou Network Technology Co., Ltd. develops and provides online games in China. It offers online games solving the problems of online game card machine, dropped calls, delay, login, and other issues. The company was founded in 2006 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.xunyou.com",
        "market_cap": 2830645504
    },
    "300518.SZ": {
        "short_name": "SHENZHEN SHENGXUND",
        "long_name": "Shen Zhen Shengxunda Technology Co.,Ltd",
        "summary": "Shen Zhen Shengxunda Technology Co.,Ltd engages in Internet content development activities in Thailand, Indonesia, China, and internationally. The company is involved in game research and development, agency publishing, platform operation, and mobile application development activities. Shen Zhen Shengxunda Technology Co.,Ltd was founded in 2006 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.gamexun.com",
        "market_cap": 6382213120
    },
    "300533.SZ": {
        "short_name": "SHENZHEN BINGCHUAN",
        "long_name": "Shenzhen Bingchuan Network Co.,Ltd.",
        "summary": "Shenzhen Bingchuan Network Co.,Ltd. operates as an online gaming company in China, Hong Kong, Taiwan, Malaysia, Vietnam, Thailand, Singapore, Japan, South Korea, Australia, and internationally. It develops games, such as Longwu and Expedition mobile games, Titan, Guigu and Shadow Warriors, expedition, Long Wu, and Undefeated legend. The company was founded in 2008 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.q1.com",
        "market_cap": 3124272896
    },
    "3798.HK": {
        "short_name": "HOMELAND ITL",
        "long_name": "Homeland Interactive Technology Ltd.",
        "summary": "Homeland Interactive Technology Ltd. engages in the development and operation of mobile games in the People's Republic of China. Its game portfolio consists of categories of games, such as mahjong, poker, and casual games. The company also distributes third-party mobile games. Homeland Interactive Technology Ltd. was founded in 2009 and is headquartered in Xiamen, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.jiaxianghudong.com",
        "market_cap": 6254880256
    },
    "3ND.F": {
        "short_name": "NETDRAGON WEBS.HLDG.DL-01",
        "long_name": "NetDragon Websoft Holdings Limited",
        "summary": "NetDragon Websoft Holdings Limited, an investment holding company, develops online and mobile games in the People's Republic of China, the United States, the United Kingdom, and internationally. It engages in the games design, programming and graphics, and online and mobile games operation; online education and related application business; and mobile solution, products, and marketing businesses. The company's games for kids include JumpStart, School of Dragons, Neopets, World of Madagascar, and Math Blaster; and other games comprise Eudemons Online, Conquer Online, Way of the Five, and Adventure Navigation. It also licenses and services developed games; develops and provides products in augmented reality and computer vision with machine learning technology; sells education hardware and software products; and develops properties. The company was formerly known as NetDragon Websoft Inc. and changed its name to NetDragon Websoft Holdings Limited in June 2016. NetDragon Websoft Holdings Limited was founded in 1999 and is headquartered in Fuzhou, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350001",
        "website": "http://www.netdragon.com",
        "market_cap": 1281245952
    },
    "603258.SS": {
        "short_name": "HANGZHOU ELECTRONIC SOUL NETWOR",
        "long_name": "Hangzhou Electronic Soul Network Technology Co., Ltd.",
        "summary": "Hangzhou Electronic Soul Network Technology Co., Ltd., develops and publishes online and mobile games in Asia. It offers h5 games, VR games, consoles, stand-alone games, and apps platforms, as well as comics and electric competitions. The company was founded in 2008 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.dianhun.cn",
        "market_cap": 6723089920
    },
    "6820.HK": {
        "short_name": "FRIENDTIMES",
        "long_name": "FriendTimes Inc.",
        "summary": "FriendTimes Inc., through its subsidiaries, develops, publishes, and operates mobile games in the People's Republic of China and internationally. The company offers mobile games and female-oriented mobile games that include the Legend of Empress, the Royal Chaos, the Rise of Queendom, the Fate of the Empress, and others. FriendTimes Inc. was founded in 2010 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.friendtimes.net",
        "market_cap": 4863295488
    },
    "6860.HK": {
        "short_name": "FINGERTANGO",
        "long_name": "FingerTango Inc.",
        "summary": "FingerTango Inc., an investment holding company, develops, operates, and publishes mobile games in the People's Republic of China. The company publishes and sells simulation mobile games. As of December 31, 2019, it had approximately 167.7 million cumulative registered users. FingerTango Inc. was founded in 2013 and is headquartered in Tianhe, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tianhe",
        "zipcode": null,
        "website": "http://www.fingertango.com",
        "market_cap": 492504416
    },
    "6899.HK": {
        "short_name": "OURGAME",
        "long_name": "Ourgame International Holdings Limited",
        "summary": "Ourgame International Holdings Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. The company operates through three segments: Lianzhong Group, and AESE Group. It operates an integrated online game platform that offers personal computer (PC) games and provides services through its PC client portals, such as Ourgame Hall; and distributes mobile games and provides services primarily for Android and iOS operating systems through third-party distribution and payment channels, including mobile operators. The company also provides web games through its ourgame.com website; and hosts games and offers on-going updates and technical support services for the operation of self-developed and licensed games, as well as prevents, detects, and resolves in-game cheating and hacking activities. In addition, it distributes games developed and operated by third-party developers; provides computer related technical support services; offers television production, brand licensing, tour management, and consulting services in Gibraltar; and organizes and broadcasts online to offline mind-sports events, tournaments, TV shows, and contents. Ourgame International Holdings Limited was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.ourgame.com",
        "market_cap": 819127936
    },
    "8267.HK": {
        "short_name": "LINEKONG",
        "long_name": "Linekong Interactive Group Co., Ltd.",
        "summary": "Linekong Interactive Group Co., Ltd., an investment holding company, researches, develops, and publishes online games in the People's Republic of China and internationally. It operates through two segments, Game Business and Film Business. The company publishes self-developed games and licensed games through its own game distribution channels, as well as third-party game distribution channels, payment collection channels, and prepaid game card distributors. It also produces and distributes film and television drama series, as well as provides technology consulting and services, and artist management services. The company was formerly known as Linekong Interactive Co., Ltd. and changed its name to Linekong Interactive Group Co., Ltd. in June 2015. Linekong Interactive Group Co., Ltd. was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.linekong.com",
        "market_cap": 228144512
    },
    "9626.HK": {
        "short_name": "BILIBILI-SW",
        "long_name": "Bilibili Inc.",
        "summary": "Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. Its platform offers a range of content, including video services, mobile games, and value-added service, as well as ACG-related comic and audio content. The company's video services include professional user generated videos, occupationally generated videos, and live broadcasting. Bilibili Inc. was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200433",
        "website": "http://www.bilibili.com",
        "market_cap": 289308639232
    },
    "9990.HK": {
        "short_name": "ARCHOSAUR GAMES",
        "long_name": "Archosaur Games Inc.",
        "summary": "Archosaur Games Inc., an investment holding company, engages in the development and operation of mobile games in the People's Republic of China and internationally. It primarily focuses on the development of massively multiplayer online role-playing games, SLGs, and other genre games. The company was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.zulong.com",
        "market_cap": 11005540352
    },
    "BHAT": {
        "short_name": "Blue Hat Interactive Entertainm",
        "long_name": "Fujian Blue Hat Interactive Entertainment Technology Ltd.",
        "summary": "Fujian Blue Hat Interactive Entertainment Technology Ltd. develops, produces, and operates augmented reality (AR) interactive entertainment games, toys, and educational materials primarily in China. Its products include AR Racer, a car-racing mobile game; AR Crazy Bug, a combat game played using a ladybug-shaped electronic toy; AR 3D Magic Box, which uses AR recognition technology to allow children to draw shapes or objects onto a physical card while the mobile game captures the drawings and animates them onto a set background; AR Dinosaur, an educational toy; Â\u0091Talking Tom and Friends' Bouncing Bubble, which enables children to bounce and play with bubbles; and AR Shake Bouncing Bubble, which helps children to improve concentration and reaction. The company also holds license to sell products with WUHUANGWANSHUI brand images. In addition, it is developing its Internet data center business. The company offers its educational products to pre-schools. Its distribution channels include domestic distributors, e-commerce platforms, supermarkets, and export distributors. The company was incorporated in 2010 and is based in Xiamen, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361009",
        "website": "http://bluehatgroup.com",
        "market_cap": 38173032
    },
    "BILI": {
        "short_name": "Bilibili Inc.",
        "long_name": "Bilibili Inc.",
        "summary": "Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. Its platform offers a range of content, including video services, mobile games, and value-added service, as well as ACG-related comic and audio content. The company's video services include professional user generated videos, occupationally generated videos, and live broadcasting. Bilibili Inc. was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200433",
        "website": "http://www.bilibili.com",
        "market_cap": 38361108480
    },
    "FH0.F": {
        "short_name": "FORGAME HLDGS LTD DL-0001",
        "long_name": "Forgame Holdings Limited",
        "summary": "Forgame Holdings Limited, an investment holding company, develops, publishes, and operates webgames, and mobile and virtual reality games in the People's Republic of China and internationally. It operates in two segments, Game Business and Internet Micro-credit Business. The company also operates 91wan, a game publishing platform. In addition, it provides information technology; software development; and internet micro-credit services. The company was founded in 2009 and is headquartered in Shenzhen the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.forgame.com",
        "market_cap": 25499488
    },
    "FZKA.F": {
        "short_name": "THE9 LTD.ADR/30 DL-,01",
        "long_name": "The9 Limited",
        "summary": "The9 Limited, together with its subsidiaries, operates and develops online games in the People's Republic of China. The company offers multiplayer online games, mobile games, and TV games. It also develops CrossFire New Mobile Game. The company was formerly known as GameNow.net Limited and changed its name to The9 Limited in February 2004. The9 Limited was incorporated in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://www.the9.com",
        "market_cap": 202735104
    },
    "NCTY": {
        "short_name": "The9 Limited - American Deposit",
        "long_name": "The9 Limited",
        "summary": "The9 Limited, together with its subsidiaries, operates and develops online games in the People's Republic of China. The company offers multiplayer online games, mobile games, and TV games. It also develops CrossFire New Mobile Game. The company was formerly known as GameNow.net Limited and changed its name to The9 Limited in February 2004. The9 Limited was incorporated in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://www.the9.com",
        "market_cap": 246343360
    },
    "STIE": {
        "short_name": "SANTARO INTERACTIVE ENTMT CO",
        "long_name": "Santaro Interactive Entertainment Company",
        "summary": "Santaro Interactive Entertainment Company designs, develops, and operates 3D online games primarily in the People's Republic of China and Korea. The company develops and operates Web-based massive multiplayer online role-playing games, mobile games, and browser game platforms, as well as provides related products and services. It also sells virtual and physical prepaid game cards with a range of game points through third-party distributors. In addition, the company provides game art design services for third-party game companies. Santaro Interactive Entertainment Company was founded in 2006 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100025",
        "website": null,
        "market_cap": 960781
    }
}