{
    "000156.SZ": {
        "short_name": "WASU MEDIA HOLDING",
        "long_name": "Wasu Media Holding Co.,Ltd",
        "summary": "Wasu Media Holding Co.,Ltd engages in media and cable network businesses in China. It offers interactive TV, 3G mobile TV, and Internet TV services. The company was formerly known as Zhejiang Genuine Unicom New Material Group Co., Ltd. and changed its name to Wasu Media Holding Co.,Ltd in October 2012. Wasu Media Holding Co.,Ltd was founded in 1994 and is based in Hangzhou, China. Wasu Media Holding Co.,Ltd is a subsidiary of Wasu Digital TV Media Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310012",
        "website": "http://www.wasu.com.cn",
        "market_cap": 14749323264
    },
    "000793.SZ": {
        "short_name": "HUAWEN MEDIA GROUP",
        "long_name": "Huawen Media Group",
        "summary": "Huawen Media Group operates in the media business in China. The company provides multi-screen interactive multimedia content on various media terminals that allows users to share content on various terminal display devices. It also engages in the provision of information transmission and printing services; and production and distribution of fuel gas, as well as wholesale of energy products, materials, mechanical, and electrical equipment. In addition, the company develops and operates natural gas pipelines; provides advertising services; distributes and dispatches commodities; and engages in bulk commodity trading activities, as well as publishes newspapers and magazines. The company was formerly known as China Media Group and changed its name to Huawen Media Group in June 2018. Huawen Media Group is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570208",
        "website": "http://www.000793.com",
        "market_cap": 5772052992
    },
    "000802.SZ": {
        "short_name": "BEIJING JINGXI CUL",
        "long_name": "Beijing Jingxi Culture & Tourism Co.,Ltd",
        "summary": "Beijing Jingxi Culture & Tourism Co.,Ltd engages in the tourism and cultural resources, and film and television entertainment production businesses in China. The company was formerly known as Beijing Jingxi Tourism Development Co., Ltd. and changed its name to Beijing Jingxi Culture & Tourism Co.,Ltd in October 2014. Beijing Jingxi Culture & Tourism Co.,Ltd was incorporated in 1997 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100016",
        "website": "http://bjwhmedia.com",
        "market_cap": 2899395328
    },
    "000839.SZ": {
        "short_name": "CITIC GUOAN INFO",
        "long_name": "CITIC Guoan Information Industry Co., Ltd.",
        "summary": "CITIC Guoan Information Industry Co., Ltd. primarily engages in the cable television (TV) network business in China. It offers digital TV system services, including interactive TV, Internet access, and PAY- HD-TV. The company also provides lithium-ion batteries, and telecom value-added and information system integration services, as well as develops Internet technology and application solutions. In addition, it develops and manages residential properties, hotels, office buildings, and tourism real estate projects. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.citicguoaninfo.com",
        "market_cap": 8662824960
    },
    "002071.SZ": {
        "short_name": "GREAT WALL MOVIE",
        "long_name": "Great Wall Movie and Television Co., Ltd.",
        "summary": "Great Wall Movie and Television Co., Ltd. engages in the investment, production, distribution, and advertising of films and television dramas in China. The company offers TV series, films, documentaries, classic repertoire, and TV drama posters. It also provides pre-screen and outdoor media advertising. The company was formerly known as Jiangsu Hongbao Hardware Co., Ltd. and changed its name to Great Wall Movie and Television Co., Ltd. in June 2014. The company is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310013",
        "website": "http://www.chinaccys.com",
        "market_cap": 162883312
    },
    "002343.SZ": {
        "short_name": "CIWEN MEDIA CO LTD",
        "long_name": "Ciwen Media Co.,Ltd.",
        "summary": "Ciwen Media Co., Ltd. engages in the investment, production, and distribution of TV series and films. It is also involved in the mobile leisure game development, promotions, and artist agency and related businesses. The company was formerly known as Zhejiang Hexin Industry Group Co. Ltd and changed its name to Ciwen Media Co., Ltd. in January 2016. Ciwen Media Co., Ltd. was founded in 2000 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.ciwen.com.cn",
        "market_cap": 2678717952
    },
    "002624.SZ": {
        "short_name": "PERFECT WORLD CO L",
        "long_name": "Perfect World Co., Ltd.",
        "summary": "Perfect World Co., Ltd., together with its subsidiaries, engages in the development, publishing, and operation of online games in China. It is also involved in engages in the production, distribution, and marketing of film and television content. The company produces approximately 600-800 episodes of TV dramas every year, which are aired on satellite TV stations at prime time, as well as Chinese language and foreign films. It is also involved in the content related advertising and merchandising business, as well as talent management business. The company was formerly known as Perfect World Pictures Co., Ltd. and changed its name to Perfect World Co., Ltd. in July 2016. Perfect World Co., Ltd. was founded in 2008 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100101",
        "website": "http://www.pwpic.com",
        "market_cap": 42543542272
    },
    "002739.SZ": {
        "short_name": "WANDA FILM HOLDING",
        "long_name": "Wanda Film Holding Co., Ltd.",
        "summary": "Wanda Film Holding Co., Ltd. engages in the investment, construction, and operation of movie theaters in China, Australia, and New Zealand. It is also involved in the movie distribution, movie screening, and related derivatives business. In addition, the company offers theme merchandising products related to movie characters, plots, and props; and food and beverage products. Further, its advertising business includes pre-roll ads and on-site ads. Wanda Film Holding Co., Ltd. operates 490 theaters with a total of 4340 screens, which include 437 theaters and 3930 screens in China; and 53 theaters and 437 screens internationally. The company was formerly known as Wanda Cinema Line Co., Ltd. and changed its name to Wanda Film Holding Co., Ltd. in May 2017. The company was founded in 2005 and is based in Beijing, the People's Republic of China. Wanda Film Holding Co., Ltd. is a subsidiary of Beijing Wanda Investment Co., Ltd.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100022",
        "website": "http://www.wandafilm.com",
        "market_cap": 35000152064
    },
    "002858.SZ": {
        "short_name": "SHANGHAI LISHENG R",
        "long_name": "Shanghai Lisheng Racing Co.,Ltd.",
        "summary": "Shanghai Lisheng Racing Co.,Ltd. operates as an automobile sports and racing culture company. It operates racing field and racing training center, as well as offers public relation services in car brand promotion. The company was founded in 2002 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201603",
        "website": "http://www.lsracing.cn",
        "market_cap": 1717952000
    },
    "002905.SZ": {
        "short_name": "GUANGZHOU JINYI ME",
        "long_name": "Guangzhou Jinyi Media Corporation",
        "summary": "Guangzhou Jinyi Media Corporation engages in the theater operation and film related businesses in China. The company was formerly known as Guangzhou Jin Yi Movie Investment Group Company Limited and changed its name to Guangzhou Jinyi Media Corporation in December 2010. Guangzhou Jinyi Media Corporation was founded in 2004 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.jycinema.com",
        "market_cap": 3228825600
    },
    "1616.HK": {
        "short_name": "STARRISE MEDIA",
        "long_name": "Starrise Media Holdings Limited",
        "summary": "Starrise Media Holdings Limited, an investment holding company, produces, distributes, licenses, and/or transfers drama series and films in the People's Republic of China and internationally. The company also leases equipment, costumes, and props relating to drama series and films production; and provides advertisement and promotion service relating to drama series and films. The company was formerly known as Silverman Holdings Limited and changed its name to Starrise Media Holdings Limited in October 2017. Starrise Media Holdings Limited was incorporated in 2010 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.starrise.cn",
        "market_cap": 238706240
    },
    "1970.HK": {
        "short_name": "IMAX CHINA",
        "long_name": "IMAX China Holding, Inc.",
        "summary": "IMAX China Holding, Inc., an investment holding company, provides digital and film-based motion picture technologies in the People's Republic of China, Hong Kong, and Taiwan. It operates through three groups: IMAX Technology Network, IMAX Technology Sales and Maintenance, and New Business Initiatives and Other. The company engages in the digital re-mastering of Hollywood and Chinese language films into the IMAX format through a proprietary IMAX DMR conversion process and the exhibition of these films on the IMAX theatre network. It also designs, procures, and provides digital theatre systems at its exhibitor partners' movie theatres, as well as provides related project management and maintenance services. In addition, the company provides technical research and development, consulting, service, training and marketing services for theatre systems and multimedia technology; and photographic equipment, virtual reality display equipment and relevant software and hardware, as well as provision of after-sales services, including installation. Further, it is involved in the wholesale, import, leasing, installing, maintenance, and repairing of movie theatre machinery, equipment, systems, photographic equipment, virtual reality display equipment, and relevant software; and research and development of software and hardware. Additionally, the company offers gift, handicraft, stationery commodity, clothing and apparel, and electronic product; and creative and conference, business consultation, and culture and art exchange and planning services, as well as operates ticket and publishing agency. It also engages in the design and production of advertising. The company was incorporated in 2010 and is headquartered in Shanghai, China. IMAX China Holding, Inc. operates as a subsidiary of Imax (Barbados) Holdings, Inc.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200003",
        "website": "http://www.imax.cn",
        "market_cap": 4315981312
    },
    "2125.HK": {
        "short_name": "STRAWBEAR ENT",
        "long_name": "Strawbear Entertainment Group",
        "summary": "Strawbear Entertainment Group produces and distributes drama series in the People's Republic of China. The company licenses the broadcasting rights of self-produced drama series to TV channels, online video platforms, and third-party distributors; and outright-purchased drama series from online video platforms or drama series producers to TV channels, third party distributors, and online video platforms. It also offers production services for made-to-order drama series per online video platforms' orders. The company was incorporated in 2018 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.strawbearentertainment.com",
        "market_cap": 5579411968
    },
    "300027.SZ": {
        "short_name": "HUAYI BROTHERS MED",
        "long_name": "Huayi Brothers Media Corporation",
        "summary": "Huayi Brothers Media Corporation operates as an entertainment media company in China. It is involved in film and television entertainment, Internet entertainment, brand licensing, real-estate entertainment, and industrial investment activities. The company was founded in 1994 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.huayimedia.com",
        "market_cap": 10144299008
    },
    "300133.SZ": {
        "short_name": "ZHEJIANG HUACE FIL",
        "long_name": "Zhejiang Huace Film & TV Co., Ltd.",
        "summary": "Zhejiang Huace Film & TV Co., Ltd. engages in the production and distribution of television(TV) dramas and films in China and internationally. The company offers its services through YouTube, JungoTV, Now TV, DailyMotion, Dramafever, Huawei, Aiqiyi, and other broadcast platforms. Zhejiang Huace Film & TV Co., Ltd. was founded in 2005 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310002",
        "website": "http://www.huacemedia.com",
        "market_cap": 11406419968
    },
    "300251.SZ": {
        "short_name": "BEIJING ENLIGHT ME",
        "long_name": "Beijing Enlight Media Co., Ltd.",
        "summary": "Beijing Enlight Media Co., Ltd. operates as an integrated media entertainment company in China. The company produces movies and TV series; animated films and live-action movies; and videos, music, dramas, and live entertainment, as well as operates a talent agency. It is also involved in industrial investment activities. The company was founded in 2000 and is based in Beijing, China. Beijing Enlight Media Co., Ltd. operates as a subsidiary of Enlight Holdings Co., Ltd.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100013",
        "website": "http://www.ewang.com",
        "market_cap": 33648506880
    },
    "300291.SZ": {
        "short_name": "BEIJING HUALUBAINA",
        "long_name": "Beijing HualuBaina Film&Tv Co., Ltd.",
        "summary": "Beijing HualuBaina Film&Tv Co., Ltd. operates as a media and entertainment company in China. The company produces television dramas, films, and reality TV shows. It also engages in the content and sport marketing, and talent management businesses. The company was founded in 2002 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100012",
        "website": "http://www.hlbn.cc",
        "market_cap": 4549035008
    },
    "300426.SZ": {
        "short_name": "ZHEJIANG TALENT TE",
        "long_name": "Zhejiang Talent Television and Film Co., Ltd.",
        "summary": "Zhejiang Talent Television and Film Co., Ltd., through its subsidiaries, operates as an entertainment company in China. The company is involved in the investment, production, and distribution of TV drama and films; artist management; ads production; post production; and cinema chain investment and management activities. It also engages in the performance consultancy and star agent business; frame and sound production; development and industrialization of movie and TV scripts and other screenwriting related activities; film and television arts and cultural exchange planning, television drama planning and literary creation, and film and television drama promotion and publicity, as well as talent agency and promotion businesses; Internet video production; and equipment leasing for films and TV drama. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100088",
        "website": "http://www.tangde.com.cn",
        "market_cap": 2538649088
    },
    "300528.SZ": {
        "short_name": "OMNIJOI MEDIA CORP",
        "long_name": "Omnijoi Media Corporation",
        "summary": "Omnijoi Media Corporation operates in the television and movie industry. The company produces and distributes drama series and movies. It also operates and franchises cineplexes with screens. The company was founded in 2005 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210033",
        "website": "http://www.omnijoi.com",
        "market_cap": 2291539200
    },
    "300556.SZ": {
        "short_name": "SILKROAD VISION TE",
        "long_name": "Silkroad Visual Technology Co., Ltd.",
        "summary": "Silkroad Visual Technology Co., Ltd. operates as a digital visual integrated services provider in China. The company engages in the digital marketing and exhibition display businesses, as well as offers computer graphics technology that is used in computer technology for designing digital images and creating visual arts. It serves architecture, design, pavilion, advertising, animation, film and television, and cultural and sports entertainment industries. The company was formerly known as Shenzhen Silkroad Digital Vision Co., Ltd and changed its name to Silkroad Visual Technology Co., Ltd. in February 2017. The company was founded in 2000 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.silkroadcg.com",
        "market_cap": 2088193024
    },
    "300860.SZ": {
        "short_name": "BEIJING FENGSHANGS",
        "long_name": "Beijing Funshine Culture Media Co., Ltd.",
        "summary": "Beijing FengShangShiJi Culture Media Co., Ltd. provides creative design, equipment rental, leasing, and related engineering services for art events and cultural activities. The company offers planning, art creation, and design; stage arts design; urban landscape construction; lighting and audio project design; events and stage lighting; multimedia creative production; live performances; cultural tourism; lighting, video, and sound equipment rental and leasing; and business management services. The company caters to theatre and art venues both domestically and internationally for events, including concerts, conferences, stage plays, art shows, commemoration, and literature fests. The company was founded in 2002 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.fssjart.com",
        "market_cap": 8458845184
    },
    "600136.SS": {
        "short_name": "WUHAN DDMC CULTURE & SPORTS CO ",
        "long_name": "Wuhan DDMC Culture & Sports Co.,Ltd.",
        "summary": "Wuhan DDMC Culture & Sports Co.,Ltd. operates in the film, television, sports, and cultural industries in China and internationally. It is involved in the production of films, television, and dramas; artist brokerage; cinema management; and film and television marketing, etc. The company was formerly known as Wuhan DDMC Culture Co., Ltd. and changed its name to Wuhan DDMC Culture & Sports Co.,Ltd. in September 2019. Wuhan DDMC Culture & Sports Co.,Ltd. was founded in 1992 and is headquartered in Wuhan, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430071",
        "website": "http://www.ddmcgroup.cn",
        "market_cap": 4361257984
    },
    "600576.SS": {
        "short_name": "ZHEJIANG SUNRIVER CULTURE CO LT",
        "long_name": "Zhejiang Sunriver Culture Co.,Ltd.",
        "summary": "Zhejiang Sunriver Culture Co.,Ltd. engages in the animation, film and television, game, and reading businesses in china. It offers Internet animation, such as new media, cultural travel, and original animations, as well as animation copyright authorization. The company also engages in the production and sale of animated films, TV series, short films, and ads. In addition, it provides Internet promotion and Internet finance services, as well as mobile boutique games. Further, the company offers Xiangyue APP, adigital reading platform; pan-psychological reading mentality service; and animation education services, such as vocational skills training, children animation educations, and other modules. The company was formerly known as Zhejiang Wanjia Co., Ltd. and changed its name to Zhejiang Sunriver Culture Co.,Ltd. in September 2017. Zhejiang Sunriver Culture Co.,Ltd. was founded in 1992 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310005",
        "website": "http://www.600576.com",
        "market_cap": 3344770816
    },
    "600892.SS": {
        "short_name": "DASHENG TIMES CULTURAL GROUP CO",
        "long_name": "Dasheng Times Cultural Investment Co., Ltd.",
        "summary": "Dasheng Times Cultural Investment Co., Ltd. engages in the game development, education, and film and television investment and production activities in China. The company was formerly known as Baocheng Investment Co., Ltd. and changed its name to Dasheng Times Cultural Investment Co., Ltd. in June 2016. Dasheng Times Cultural Investment Co., Ltd. was founded in 1990 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.600892.com.cn",
        "market_cap": 2467236096
    },
    "600936.SS": {
        "short_name": "GUANGXI RADIO & TELEVISION INFO",
        "long_name": "Guangxi Radio and Television Information Network Corporation Limited",
        "summary": "Guangxi Radio and Television Information Network Corporation Limited provides radio and television network services in China. The company provides broadcasting and television transmission; and development and services of information technology. It engages in the digital television; private network business; smart radio cloud; and big data businesses. The company was formerly known as Guangxi Broadcast Television Network Transmission Company. Guangxi Radio and Television Information Network Corporation Limited was founded in 2000 and is based in Nanning, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanning",
        "zipcode": "530028",
        "website": "http://www.96335.com",
        "market_cap": 4929538560
    },
    "601929.SS": {
        "short_name": "JISHI MEDIA CO LTD",
        "long_name": "JiShi Media Co., Ltd.",
        "summary": "JiShi Media Co., Ltd. engages in the radio and television (TV) business in China. The company offers radio and television transmission services, such as live channels, digital broadcasting, consulting, and program guide services; and digital TV value-added services, including paid channels, HD live channels, and interactive on-demand services, as well as interactive application services, such as online trading, TV lottery, TV communication, and family entertainment services. It also provides broadband two-way interactive services. The company is headquartered in Changchun, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130021",
        "website": "http://www.jishimedia.com",
        "market_cap": 6004442112
    },
    "603103.SS": {
        "short_name": "HENGDIAN ENTERTAINMENT CO LTD",
        "long_name": "Hengdian Entertainment Co., Ltd.",
        "summary": "Hengdian Entertainment Co., Ltd. operates theatres in China. It operates 424 theaters with 2,653 screens. The company was founded in 2015 and is based in Dongyang, China. Hengdian Entertainment Co., Ltd. is a subsidiary of Hengdian Group Holdings Limited.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongyang",
        "zipcode": "322118",
        "website": "http://www.hengdianfilm.com",
        "market_cap": 9887177728
    },
    "9958.HK": {
        "short_name": "LITIAN PICTURES",
        "long_name": "Litian Pictures Holdings Limited",
        "summary": "Litian Pictures Holdings Limited operates as a drama series distribution company, providing drama series development, production, marketing, and distribution services in the People's Republic of China. It engages in licensing the broadcasting rights of self-produced and outright-purchased drama series; selling script copyrights of drama series; and acting as a distribution agent of the broadcasting rights of TV series. The company also acts as a non-executive producer and enter into co-financing arrangements with the executive producers of the drama series. Its principal customers include TV channels, including satellite and terrestrial TV channels, as well as online media platforms. The company was founded in 2013 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.litian.tv",
        "market_cap": 467999968
    },
    "CHND": {
        "short_name": "CHINA MEDIA INC",
        "long_name": "China Media Inc.",
        "summary": "China Media Inc., through its subsidiaries, produces and distributes films, television series, and documentaries in China. The company sells television series to regional and national television stations. It distributes its films and television series through direct sales channel. The company was formerly known as Protecwerx Inc. China Media Inc. was incorporated in 2007 and is based in Xi'an, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710068",
        "website": "http://www.xatvm.com",
        "market_cap": 9937500
    },
    "HUYA": {
        "short_name": "HUYA Inc.",
        "long_name": "HUYA Inc.",
        "summary": "HUYA Inc., through its subsidiaries, operates game live streaming platforms in the People's Republic of China. Its platforms enable broadcasters and viewers to interact during live streaming. The company's live streaming content also covers other entertainment content, such as talent shows, anime, outdoor activities, live chats, online theatre, and other genres. In addition, it operates Nimo TV, a game live streaming platform primarily in Southeast Asia, the Middle East, and Latin America. Further, the company provides online advertising, software development, internet value added, and cultural and creative services. As of December 31, 2020, its live streaming content covered approximately 4,000 games. The company was founded in 2014 and is headquartered in Guangzhou, the People's Republic of China. HUYA Inc. is a subsidiary of Tencent Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511446",
        "website": "http://www.huya.com",
        "market_cap": 3978332416
    },
    "HY5A.F": {
        "short_name": "HUYA INC. SP.ADR/1 CL.A",
        "long_name": "HUYA Inc.",
        "summary": "HUYA Inc., through its subsidiaries, operates game live streaming platforms in the People's Republic of China. Its platforms enable broadcasters and viewers to interact during live streaming. The company's live streaming content also covers other entertainment content, such as talent shows, anime, outdoor activities, live chats, online theatre, and other genres. In addition, it operates Nimo TV, a game live streaming platform primarily in Southeast Asia, the Middle East, and Latin America. Further, the company provides online advertising, software development, internet value added, and cultural and creative services. As of December 31, 2020, its live streaming content covered approximately 4,000 games. The company was founded in 2014 and is headquartered in Guangzhou, the People's Republic of China. HUYA Inc. is a subsidiary of Tencent Holdings Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511446",
        "website": "http://www.huya.com",
        "market_cap": 3064164864
    },
    "IMK.F": {
        "short_name": "IMAX CHINA HLDG HD -,0001",
        "long_name": "IMAX China Holding, Inc.",
        "summary": "IMAX China Holding, Inc., an investment holding company, provides digital and film-based motion picture technologies in the People's Republic of China, Hong Kong, and Taiwan. It operates through three groups: IMAX Technology Network, IMAX Technology Sales and Maintenance, and New Business Initiatives and Other. The company engages in the digital re-mastering of Hollywood and Chinese language films into the IMAX format through a proprietary IMAX DMR conversion process and the exhibition of these films on the IMAX theatre network. It also designs, procures, and provides digital theatre systems at its exhibitor partners' movie theatres, as well as provides related project management and maintenance services. In addition, the company provides technical research and development, consulting, service, training and marketing services for theatre systems and multimedia technology; and photographic equipment, virtual reality display equipment and relevant software and hardware, as well as provision of after-sales services, including installation. Further, it is involved in the wholesale, import, leasing, installing, maintenance, and repairing of movie theatre machinery, equipment, systems, photographic equipment, virtual reality display equipment, and relevant software; and research and development of software and hardware. Additionally, the company offers gift, handicraft, stationery commodity, clothing and apparel, and electronic product; and creative and conference, business consultation, and culture and art exchange and planning services, as well as operates ticket and publishing agency. It also engages in the design and production of advertising. The company was incorporated in 2010 and is headquartered in Shanghai, China. IMAX China Holding, Inc. operates as a subsidiary of Imax (Barbados) Holdings, Inc.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200003",
        "website": "http://www.imax.cn",
        "market_cap": 450684928
    },
    "KUKE": {
        "short_name": "Kuke Music Holding Limited",
        "long_name": "Kuke Music Holding Limited",
        "summary": "Kuke Music Holding Limited, through its subsidiaries, provides classical music licensing, subscription, and education services in China. It operates through two segments, Subscription, Licensing and Smart Education Business; and Music Events Business. The Subscription, Licensing and Smart Education Business segment distributes commercial copyrights and offers music education solutions. The Music Events Business segment is involved in the provision of music festival events and music performance services. The company licenses its music content primarily to online music entertainment platforms and digital music service providers, as well as film and TV production companies, airlines, and smart hardware companies. As of September 30, 2020, it had 743 institutional subscribers, including 444 universities and music conservatories, as well as 299 public libraries. Kuke Music Holding Limited was founded in 2002 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.kuke.com",
        "market_cap": 152689056
    },
    "SO7.F": {
        "short_name": "NAN HAI CORP.LTD.  HD-,01",
        "long_name": "Nan Hai Corporation Limited",
        "summary": "Nan Hai Corporation Limited, an investment holding company, primarily provides culture and media, property development, and corporate information technology (IT) application services in Mainland China, Hong Kong, North America, Europe, Australia, and internationally. The company operates through five segments: Enterprise Cloud Services, Property Development, Culture and Media Services, News Media Business, and Innovative Business. It is involved in the investment, construction, and operation of the cinema; production and distribution of the movies; cinema digital media technology business; research and development, and operation of system integration service equipment; and cinema media transmission business. The company also offers real estate development and property management services. In addition, it provides e-commerce and IT application services, including Website building, virtual hosting, online shop, enterprise mailbox, network marketing promotion, etc.; and Internet basic services, such as domain name registration, Web hosting, enterprise communication, and SaaS-based enterprise operations and management services, as well as integrated solutions for SMEs, enterprises, institutions, and individuals through online direct sales and agent channels. Further, the company engages in the news media, securities and movie projectors trading, and debt issuance businesses. Additionally, it provides decoration, advertising, and digital media technology services; sells decoration materials; and manufactures, distributes, and retails toiletries. As of December 31, 2020, the company operated 449 cinemas with 2,828 screens. Nan Hai Corporation Limited is headquartered in Beijing, China. Nan Hai Corporation Limited is a subsidiary of Dadi Holdings Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.nanhaicorp.com",
        "market_cap": 425212992
    }
}