{
    "000681.SZ": {
        "short_name": "VISUAL CHINA GROUP",
        "long_name": "Visual China Group Co.,Ltd.",
        "summary": "Visual China Group Co.,Ltd. operates an Internet platform that offers copyrighted professionally generated content (PGC) and value-added services to content producers and users in China. Its platform offers PGC images, videos, and musical materials. The company also provides commissioned shooting, photo agency, visual and integrated marketing, rights clearance, and creative collection services. Visual China Group Co.,Ltd. was founded in 1994 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.visualchina.com",
        "market_cap": "Small Cap"
    },
    "0700.HK": {
        "short_name": "TENCENT",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "0772.HK": {
        "short_name": "CHINA LIT",
        "long_name": "China Literature Limited",
        "summary": "China Literature Limited, an investment holding company, operates an online literature platform in the People's Republic of China. The company's flagship product is QQ Reading, a unified mobile content aggregation and distribution platform. As of December 31, 2019, its library featured 8.1 million writers and 12.2 million works of literature, including 11.5 million original literary works created by writers on its platform, 400 thousand works that are sourced from third-party platforms, and 280 thousand e-books. It is also involved in the self-operated channels business on partner distribution platforms. In addition, the company licenses the content to third-party partners, such as Baidu, Sogou, JD.com, and Xiaomi Duokan for distribution, as well as offers online paid reading and content adaptations into various entertainment formats. Further, it provides reading, copyright commercialization, and writer cultivation and brokerage services; and operates text work reading and related open platform through technology methods and digital media, including personal computers, Internet, and mobile network. Additionally, the company engages in the production and distribution of television series, web series, and films; licensing and distribution of film and television properties; licensing copyrights; sale of physical books; and operation of in-house online games, etc. The company was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. China Literature Limited is a subsidiary of Tencent Holdings Limited.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://ir.yuewen.com",
        "market_cap": "Large Cap"
    },
    "1357.HK": {
        "short_name": "MEITU",
        "long_name": "Meitu, Inc.",
        "summary": "Meitu, Inc., an investment holding company, operates as a mobile Internet company in the People's Republic of China. It offers a portfolio of photo and community apps, including Meitu, BeautyCam, BeautyPlus, Meipai, MeituEve, Airbrush, and others. The company also provides online advertising, premium subscription and in-app purchases, Internet value-added, and other services. In addition, it offers information technology and online recruitment services; and develops and operates apps, as well as develops, manufactures, and sells smartphones. Meitu, Inc. was founded in 2008 and is headquartered in Xiamen, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.meitu.com",
        "market_cap": "Small Cap"
    },
    "1739.HK": {
        "short_name": "QEEKA HOME",
        "long_name": "Qeeka Home (Cayman) Inc.",
        "summary": "Qeeka Home (Cayman) Inc. operates online interior design and construction platform in the People's Republic of China. It engages in the provision of interior design and construction services to individual consumers, residential real-estate developers, and serviced apartments; order recommendation, advertising, and promotion services; and building and home decoration material supply chain services. The company also provides investment management, electronic commerce, financial information, and information technology services, as well as payment systems. In addition, it licenses its Dianshang brand, as well as supplies construction materials, accessories, and furnishings through its platform. The company was formerly known as China Home (Cayman) Inc. Qeeka Home (Cayman) Inc. was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201824",
        "website": "http://www.qeeka.com",
        "market_cap": "Micro Cap"
    },
    "1761.HK": {
        "short_name": "BABYTREE GROUP",
        "long_name": "BabyTree Group",
        "summary": "BabyTree Group, an investment holding company, engages in advertising, e-commerce, and content monetization businesses in the People's Republic of China. It operates Babytree Parenting mobile app and babytree.com, an online platform for expecting parents and young parents to communicate with each other and find the pregnancy and parenting advice; and WeTime, a platform that focuses on child development and provides social recording medium, and early education content and tools. The company also operates Meitun Mama, a maternity and child product focused e-commerce platform; and offers technology information and finance services. BabyTree Group was founded in 2007 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://ir.babytree.com",
        "market_cap": "Micro Cap"
    },
    "1896.HK": {
        "short_name": "MAOYAN ENT",
        "long_name": "Maoyan Entertainment",
        "summary": "Maoyan Entertainment operates a platform that provides internet-empowered entertainment services in the People's Republic of China. The company offers online entertainment ticketing, entertainment content, e-commerce, advertising, and other services. It provides online movie and entertainment event ticketing services; movie distribution and promotion services; entertainment content; computer technology research, film project technology advisory, and e-business services; film investment, as well as TV series investment and distribution services; economic and trade consultation; and network technology and commercial factoring services. In addition, the company engages in acting agent and literary creation and performance; production and operation of radio and TV programs; performance broking; technology and goods import and export; production, distribution, and promotion of movies, games, variety shows, cartoons, radio dramas, TV dramas, and advertisements; audio-visual distribution; and performance venue management activities. Its customers primarily include cinemas, entertainment content producers and distributors, and advertisers. Maoyan Entertainment was incorporated in 2017 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://maoyan.com",
        "market_cap": "Small Cap"
    },
    "1MOA.F": {
        "short_name": "MOMO UNSP.ADR A1 DL-,0001",
        "long_name": "Momo Inc.",
        "summary": "Momo Inc. provides mobile-based social and entertainment services in the People's Republic of China. It operates Momo platform that includes its Momo mobile application, as well as various related properties, features, functionalities, tools, and services. The company's Momo mobile application connects people and facilitates interactions based on location and interests; and various recreational activities, including live talent shows, short videos, and social games, as well as other video- and audio-based interactive experiences, such as live chats and mobile karaoke experience. It also operates Tantan, a social and dating application for younger generation, which enables users to find and establish romantic connections, and meet interesting people; and provides live video, value-added, mobile marketing, and other services, as well as mobile games. The company was formerly known as Momo Technology Company Limited and changed its name to Momo Inc. in July 2014. Momo Inc. was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.immomo.com",
        "market_cap": "Mid Cap"
    },
    "2518.HK": {
        "short_name": "AUTOHOME-S",
        "long_name": "Autohome Inc.",
        "summary": "Autohome Inc. operates as an online destination for automobile consumers in the People's Republic of China. The company, through its websites, autohome.com.cn and che168.com, and its mobile applications and mini apps, delivers interactive content and tools to automobile consumers. It provides media services, including automaker advertising services and regional marketing campaigns; and leads generation services comprising dealer subscription services, advertising services for individual dealers, and used automobile listing and other platform-based services. The company also offers Autohome Mall, an online transaction platform for users to review automotive-related information, purchase coupons offered by automakers for discounts, and make purchases to complete the transaction; data products; and online bidding platform for used automobiles, as well as collects commissions for facilitating transactions of auto-financing and insurance products on its platform. The company was formerly known as Sequel Limited and changed its name to Autohome Inc. in October 2011. Autohome Inc. was incorporated in 2008 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.autohome.com.cn",
        "market_cap": "Mid Cap"
    },
    "2SU.VI": {
        "short_name": "SOHU.COM LTD-ADR",
        "long_name": "Sohu.com Limited",
        "summary": "Sohu.com Limited provides online media, game, and search products and services on PCs and mobile devices in China. The company provides online news and information through the mobile phone application Sohu News APP, mobile portal m.sohu.com, and www.sohu.com for PCs; and online video contents and services through mobile phone application Sohu Video APP and tv.sohu.com, and ifox, a PC video application. The company is also involved in the development, operation, and licensing of online games for PCs and mobile devices, which include massive multiplayer online role-playing games; and casual games, strategy games, and collectible card games. In addition, it operates focus.cn, which provides online real estate information and services; and 17173.com website, which provides news, electronic forums, online videos, and other online game information services to game players, as well as offers mobile game distribution services. Further, the company provides paid subscription services, interactive broadcasting services, and sub-licensing of purchased video content to third parties. Sohu.com Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100190",
        "website": "http://www.sohu.com",
        "market_cap": "Small Cap"
    },
    "2WBA.F": {
        "short_name": "WEIBO SP.ADR A 1 DL-00025",
        "long_name": "Weibo Corporation",
        "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted marketing offerings, such as Fans Headline and Weibo Express, as well as promoted trends and search products that appear alongside user's trends discovery and search behaviors. In addition, the company offers products, such as trends, search, video/live streaming, and editing tools; content customization, copyright contents pooling, and user interaction development; and search list recommendation, trends list recommendation, and Weibo app opening advertisements for copyright content providers. Further, it provides back-end management, traffic support, and product solutions to MCNs, unions, and e-commerce partners; open application platform for other app developers that allows users to log into third-party applications with their Weibo account for sharing third-party content on its platform; and Weibo Wallet, a product that enables platform partners to conduct interest generation activities on Weibo, such as handing out red envelops and coupons. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://ir.weibo.com",
        "market_cap": "Large Cap"
    },
    "300226.SZ": {
        "short_name": "SHANGHAI GANGLIAN",
        "long_name": "Shanghai Ganglian E-Commerce Holdings Co., Ltd.",
        "summary": "Shanghai Ganglian E-Commerce Holdings Co., Ltd. provides market intelligence services related to the metals and mining industry in the People's Republic of China. The company offers bulk commodities information, consulting, upstream and downstream industry research, cloud warehousing, informational logistics, supply chain, and payment services, as well as steel product processing and distribution services. It also operates banksteel.com, an e-commerce platform for spot steel bidding, and offer and deal conclusion. In addition, the company provides various products and services for international finance, metals, commodities, telecoms, and other markets, including magazines, newsletters, electronic information, and data, as well as organizes seminars, conferences, training courses, and exhibitions for the financial markets industry. Its services covers various commodities, such as ferrous and nonferrous metals, energy, petrochemical, agricultural products, etc. The company was founded in 2000 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200444",
        "website": "http://www.mysteel.com",
        "market_cap": "Small Cap"
    },
    "300295.SZ": {
        "short_name": "EVERYDAY NETWORK",
        "long_name": "Everyday Network Co.,Ltd.",
        "summary": "Everyday Network Co.,Ltd. operates as an Internet service providers in China. The company provides network marketing services in the field of real estate properties through house365.com. Its platforms provide users with network integrated services, such as house buying, selling, and leasing. The company also offers Internet microfinance; and operates a platform to provide financing, renting houses, and operation of real estate. Everyday Network Co.,Ltd. was founded in 2006 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211505",
        "website": "http://www.house365.com",
        "market_cap": "Small Cap"
    },
    "300785.SZ": {
        "short_name": "BEIJING ZHIDEMAI T",
        "long_name": "Beijing Zhidemai Technology Co., Ltd.",
        "summary": "Beijing Zhidemai Technology Co., Ltd. integrates shopping, media, tools, and community attributes to introduce various products and services to users with consumer content. The company offers its services through smzdm.com Website. Beijing Zhidemai Technology Co., Ltd. was founded in 2011 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.smzdm.com",
        "market_cap": "Small Cap"
    },
    "3601.HK": {
        "short_name": "LUDASHI",
        "long_name": "360 Ludashi Holdings Limited",
        "summary": "360 Ludashi Holdings Limited, an investment holding company, develops a series of personal computer (PC) and mobile devices utility software in Mainland China and internationally. Its products include Ludashi Software (PC Version), a hardware and system benchmarking and monitoring services to PC users; Ludashi Software (Mobile Devices Version), a hardware and system benchmarking and monitoring services to mobile devices users; and develops software for mobile devices, including Dual Space, Easy Clean, and APP Lock. The company is also involved in online game, online advertising, homepage directory, Internet of Things, and smartphone and computer maintenance businesses; and the sale of certified pre-owned and factory smartphones, other electronic devices, and smart accessories through online and offline channels. 360 Ludashi Holdings Limited was founded in 2014 and is headquartered in Chengdu, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.ludashi.com",
        "market_cap": "Micro Cap"
    },
    "3700.HK": {
        "short_name": "INKE",
        "long_name": "Inke Limited",
        "summary": "Inke Limited, an investment holding company, operates mobile live streaming platforms in the People's Republic of China. Its primary products include Inke App, a mobile live streaming application; and Jimu App, a social networking product. The company provides online advertising, value-added telecommunication, internet cultural, online audio and video program, and talent agency services. The company also offers supporting services to the operation of mobile livestreaming platforms; technology and consulting services; and develops online games and invests in internet entities. The company was founded in 2015 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.inke.cn",
        "market_cap": "Small Cap"
    },
    "600637.SS": {
        "short_name": "ORIENTAL PEARL MEDIA CO LTD",
        "long_name": "Shanghai Oriental Pearl Group Co., Ltd.",
        "summary": "Shanghai Oriental Pearl Group Co., Ltd. operates a multi-channel video integration and distribution platform in China. The company offers video content services and media and entertainment products, including TV shopping, culture and entertainment themed tourism, TV drama production, digital marketing, and video game development. The company was formerly known as Shanghai Oriental Pearl Media Co., Ltd. Shanghai Oriental Pearl Group Co., Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200233",
        "website": "http://www.opg.cn",
        "market_cap": "Mid Cap"
    },
    "603000.SS": {
        "short_name": "PEOPLE.CN CO LTD",
        "long_name": "People.cn CO., LTD",
        "summary": "People.cn CO., LTD operates as an information exchange platform in China and internationally. The company publishes news to Internet users covering politics, economy, society, and culture in the form of text, picture, animation, audio and video, BBS, blog, microblog, podcast, talk bar, mobile phone, RSS, and Webcast 15 languages, including Chinese, Mongolian, Tibetan, Uygur, Kazakh, Korean, Yi, Zhuang, English, Japanese, French, Spanish, Russian, Arabic, and Korean. It operates in 200 countries and regions. The company was founded in 1997 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100733",
        "website": "http://www.people.com.cn",
        "market_cap": "Mid Cap"
    },
    "603888.SS": {
        "short_name": "XINHUANET CO LTD",
        "long_name": "Xinhuanet Co., Ltd.",
        "summary": "Xinhuanet Co., Ltd. operates a news information service portal in China. The company publishes news from 31 local channels; and from English, French, Russian, Arabic, Japanese, Korean, German, Portuguese, Tibetan, Victoria, and Mongolian language channels. It also provides online advertising and brand planning services; Website feed and big data intelligent analysis services; Website construction and technical services; and mobile Internet services. The company was founded in 1997 and is based in Beijing, China. Xinhuanet Co., Ltd. is a subsidiary of Xinhua News Agency.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100031",
        "website": "http://www.xinhuanet.com",
        "market_cap": "Small Cap"
    },
    "688004.SS": {
        "short_name": "BEIJING BOHUI SCIENCE & TECH CO",
        "long_name": "Beijing Bohui Science & Technology Co., Ltd.",
        "summary": "Beijing Bohui Science & Technology Co., Ltd. operates as an information technology company that focuses on the field of audiovisual big data. The company operates and maintains audiovisual business platforms, which include data collection, storage, analysis, and other technical applications primarily targeting broadcasters, such as IPTV/OTT operators, broadcast and television network companies, new media broadcast control platforms, Internet video content providers, radio and television stations, and related government departments. It also provides various media content security solutions for government regulatory agencies; and informatized audiovisual data management services for customers in civil air defense, meteorology, public security, armed police, transportation, energy, and other industries. The company was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100094",
        "website": "http://www.bohui.com.cn",
        "market_cap": "Small Cap"
    },
    "780.F": {
        "short_name": "SOGOU INC. CL.A  ADR/1",
        "long_name": "Sogou Inc.",
        "summary": "Sogou Inc. provides search and search-related services in the People's Republic of China. The company provides Sogou Search, a search engine; and Sogou Input Method, a Chinese language input software for PC and mobile users. It also offers other products that include Sogou Browser; Sogou Web Directory, a content aggregation and distribution platform that offers news aggregation, video content aggregation, and shopping assistance; Sogou Maps, which provides Internet-based map and navigation services related to traffic options, routing optimization, and positioning calculation for PCs, mobile devices, and smart wearables; Sogou Mobile Assistant that helps users find mobile applications and games related to their interests; Sogou Game Center, a gaming platform, which offers web and mobile games developed by third parties; and Sogou Translation, a multi-language translation solution. The company also provides Sogou AI, a voice-enabled hardware product; and Teemo, a smart hardware product for children, as well as offers Internet value-added, and search and search-related advertising services. Sogou Inc. was incorporated in 2005 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100084",
        "website": "http://www.sogou.com",
        "market_cap": "Mid Cap"
    },
    "8AHA.MU": {
        "short_name": "AUTOHOME INC.  A DL -,01",
        "long_name": "Autohome Inc.",
        "summary": "Autohome Inc. operates as an online destination for automobile consumers in the People's Republic of China. The company, through its websites, autohome.com.cn and che168.com, and its mobile applications and mini apps, delivers interactive content and tools to automobile consumers. It provides media services, including automaker advertising services and regional marketing campaigns; and leads generation services comprising dealer subscription services, advertising services for individual dealers, and used automobile listing and other platform-based services. The company also offers Autohome Mall, an online transaction platform for users to review automotive-related information, purchase coupons offered by automakers for discounts, and make purchases to complete the transaction; data products; and online bidding platform for used automobiles, as well as collects commissions for facilitating transactions of auto-financing and insurance products on its platform. The company was formerly known as Sequel Limited and changed its name to Autohome Inc. in October 2011. Autohome Inc. was incorporated in 2008 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.autohome.com.cn",
        "market_cap": "Large Cap"
    },
    "8AHB.F": {
        "short_name": "AUTOHOME SP.ADR A 4 DL-01",
        "long_name": "Autohome Inc.",
        "summary": "Autohome Inc. operates as an online destination for automobile consumers in the People's Republic of China. The company, through its websites, autohome.com.cn and che168.com, and its mobile applications and mini apps, delivers interactive content and tools to automobile consumers. It provides media services, including automaker advertising services and regional marketing campaigns; and leads generation services comprising dealer subscription services, advertising services for individual dealers, and used automobile listing and other platform-based services. The company also offers Autohome Mall, an online transaction platform for users to review automotive-related information, purchase coupons offered by automakers for discounts, and make purchases to complete the transaction; data products; and online bidding platform for used automobiles, as well as collects commissions for facilitating transactions of auto-financing and insurance products on its platform. The company was formerly known as Sequel Limited and changed its name to Autohome Inc. in October 2011. Autohome Inc. was incorporated in 2008 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.autohome.com.cn",
        "market_cap": "Mid Cap"
    },
    "9C0A.F": {
        "short_name": "CANGO INC. SP.ADR/2 CL.A",
        "long_name": "Cango Inc.",
        "summary": "Cango Inc. operates an automotive transaction service platform that connects dealers, original equipment manufacturer, financial institutions, car buyers, and other industry participants in the People's Republic of China. The company offers automobile trading solutions, including car sourcing, logistics, and warehousing support for dealers, as well as software as a service solutions; and facilitation of car purchases for car buyers. It also facilitates automotive financing services that include facilitating financing transactions from financial institutions to car buyers; and after-market services to car buyers, which includes facilitating the sale of insurance policies from insurance brokers or companies. The company was founded in 2010 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200124",
        "website": "http://www.cangoonline.com",
        "market_cap": "Small Cap"
    },
    "9ME.F": {
        "short_name": "MAOYAN ENTERTAINMENT",
        "long_name": "Maoyan Entertainment",
        "summary": "Maoyan Entertainment operates a platform that provides internet-empowered entertainment services in the People's Republic of China. The company offers online entertainment ticketing, entertainment content, e-commerce, advertising, and other services. It provides online movie and entertainment event ticketing services; movie distribution and promotion services; entertainment content; computer technology research, film project technology advisory, and e-business services; film investment, as well as TV series investment and distribution services; economic and trade consultation; and network technology and commercial factoring services. In addition, the company engages in acting agent and literary creation and performance; production and operation of radio and TV programs; performance broking; technology and goods import and export; production, distribution, and promotion of movies, games, variety shows, cartoons, radio dramas, TV dramas, and advertisements; audio-visual distribution; and performance venue management activities. Its customers primarily include cinemas, entertainment content producers and distributors, and advertisers. Maoyan Entertainment was incorporated in 2017 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://maoyan.com",
        "market_cap": "Small Cap"
    },
    "ATHM": {
        "short_name": "Autohome Inc.",
        "long_name": "Autohome Inc.",
        "summary": "Autohome Inc. operates as an online destination for automobile consumers in the People's Republic of China. The company, through its websites, autohome.com.cn and che168.com, and its mobile applications and mini apps, delivers interactive content and tools to automobile consumers. It provides media services, including automaker advertising services and regional marketing campaigns; and leads generation services comprising dealer subscription services, advertising services for individual dealers, and used automobile listing and other platform-based services. The company also offers Autohome Mall, an online transaction platform for users to review automotive-related information, purchase coupons offered by automakers for discounts, and make purchases to complete the transaction; data products; and online bidding platform for used automobiles, as well as collects commissions for facilitating transactions of auto-financing and insurance products on its platform. The company was formerly known as Sequel Limited and changed its name to Autohome Inc. in October 2011. Autohome Inc. was incorporated in 2008 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.autohome.com.cn",
        "market_cap": "Large Cap"
    },
    "B1C.F": {
        "short_name": "BAIDU A ADR DL-,000000625",
        "long_name": "Baidu, Inc.",
        "summary": "Baidu, Inc. provides internet search services primarily in China. Its Baidu Core segment offers products for users, including Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; Haokan short video app; and Quanmin flash video app for users to create and share short videos. It also offers Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post, a social media platform; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, this segment offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Its iQIYI segment provides online entertainment service, including original and licensed content; and other video content, membership; and online advertising services. Baidu, Inc. has a strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.baidu.com",
        "market_cap": "Large Cap"
    },
    "B1CB.F": {
        "short_name": "BAIDU INC. O.N.",
        "long_name": "Baidu, Inc.",
        "summary": "Baidu, Inc. provides internet search services primarily in China. Its Baidu Core segment offers products for users, including Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; Haokan short video app; and Quanmin flash video app for users to create and share short videos. It also offers Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post, a social media platform; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, this segment offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Its iQIYI segment provides online entertainment service, including original and licensed content; and other video content, membership; and online advertising services. Baidu, Inc. has a strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.baidu.com",
        "market_cap": "Large Cap"
    },
    "BCWG": {
        "short_name": "BCW GROUP HOLDINGS INC",
        "long_name": "BCW Group Holding Inc",
        "summary": "BCW Group Holding, Inc. engages in the Internet e-commerce platform business. It operates Taobaichi.com, an online-to-offline Website, which serves enterprises and consumers. The company was incorporated in 2015 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "10014",
        "website": "http://www.taobaichi.cn",
        "market_cap": null
    },
    "BIDU.BA": {
        "short_name": "BAIDU INC",
        "long_name": "Baidu, Inc.",
        "summary": "Baidu, Inc. provides internet search services primarily in China. Its Baidu Core segment offers products for users, including Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; Haokan short video app; and Quanmin flash video app for users to create and share short videos. It also offers Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post, a social media platform; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, this segment offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Its iQIYI segment provides online entertainment service, including original and licensed content; and other video content, membership; and online advertising services. Baidu, Inc. has a strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.baidu.com",
        "market_cap": "Large Cap"
    },
    "BIDU": {
        "short_name": "Baidu, Inc.",
        "long_name": "Baidu, Inc.",
        "summary": "Baidu, Inc. provides internet search services primarily in China. Its Baidu Core segment offers products for users, including Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; Haokan short video app; and Quanmin flash video app for users to create and share short videos. It also offers Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post, a social media platform; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, this segment offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Its iQIYI segment provides online entertainment service, including original and licensed content; and other video content, membership; and online advertising services. Baidu, Inc. has a strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.baidu.com",
        "market_cap": "Large Cap"
    },
    "BIDU.VI": {
        "short_name": "BAIDU INC - SPON ADR",
        "long_name": "Baidu, Inc.",
        "summary": "Baidu, Inc. provides internet search services primarily in China. Its Baidu Core segment offers products for users, including Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; Haokan short video app; and Quanmin flash video app for users to create and share short videos. It also offers Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post, a social media platform; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, this segment offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Its iQIYI segment provides online entertainment service, including original and licensed content; and other video content, membership; and online advertising services. Baidu, Inc. has a strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.baidu.com",
        "market_cap": "Large Cap"
    },
    "BIDUN.MX": {
        "short_name": "BAIDU INC",
        "long_name": "Baidu, Inc.",
        "summary": "Baidu, Inc. provides internet search services primarily in China. Its Baidu Core segment offers products for users, including Baidu App to access search, feed, and other services using mobile devices; Baidu Search to access its search and other services; Baidu Feed that provides users with personalized timeline based on their demographics and interests; Haokan short video app; and Quanmin flash video app for users to create and share short videos. It also offers Baidu Knows, an online community where users can ask questions to other users; Baidu Wiki; Baidu Healthcare Wiki; Baidu Wenku; Baidu Scholar; Baidu Experience; Baidu Post, a social media platform; Baidu Maps, a voice-enabled mobile app that provides travel-related services; Baidu Drive; Baijiahao; and DuerOS, a smart assistant platform. In addition, this segment offers online marketing services, which include pay for performance, an auction-based services that allow customers to bid for priority placement of paid sponsored links and reach users who search for information related to their products or services; other marketing services that include display-based marketing services and other online marketing services based on performance criteria other than cost per click; mobile ecosystem, a portfolio of apps, including Baidu App, Haokan, and Baidu Post; various cloud services and solutions, such as platform as a service, software as a service, and infrastructure as a service; self-driving services, including maps, automated valet parking, autonomous navigation pilot, electric vehicles, and robotaxi fleets, as well as Xiaodu smart devices. Its iQIYI segment provides online entertainment service, including original and licensed content; and other video content, membership; and online advertising services. Baidu, Inc. has a strategic partnership with Zhejiang Geely Holding Group. The company was formerly known as Baidu.com, Inc. Baidu, Inc. was incorporated in 2000 and is headquartered in Beijing, China.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100085",
        "website": "http://www.baidu.com",
        "market_cap": "Large Cap"
    },
    "BLCT": {
        "short_name": "BlueCity Holdings Limited",
        "long_name": "BlueCity Holdings Limited",
        "summary": "BlueCity Holdings Limited operates a platform for LGBTQ community primarily under BlueCity brand in the People's Republic of China, India, South Korea, Thailand, and Vietnam. It operates Blued, a mobile app that offers various services to LGBTQ community, including live streaming, advertising, membership, merchandise sales, and other services. It also offers online health services. BlueCity Holdings Limited was founded in 2011 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100022",
        "website": "http://www.blue-city.com",
        "market_cap": "Micro Cap"
    },
    "BTR.F": {
        "short_name": "BABYTREE GROUP",
        "long_name": "BabyTree Group",
        "summary": "BabyTree Group, an investment holding company, engages in advertising, e-commerce, and content monetization businesses in the People's Republic of China. It operates Babytree Parenting mobile app and babytree.com, an online platform for expecting parents and young parents to communicate with each other and find the pregnancy and parenting advice; and WeTime, a platform that focuses on child development and provides social recording medium, and early education content and tools. The company also operates Meitun Mama, a maternity and child product focused e-commerce platform; and offers technology information and finance services. BabyTree Group was founded in 2007 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://ir.babytree.com",
        "market_cap": "Micro Cap"
    },
    "BYLG": {
        "short_name": "BYLOG GROUP CORP",
        "long_name": "Bylog Group Corp.",
        "summary": "Bylog Group Corp. does not have significant operations. It intends to seek and consummate a combination transaction with a profitable, privately held operating business. Previously, the company was engaged in the provision of Web development and online advertising services. Bylog Group Corp. was incorporated in 2015 and is based in Dalian, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116013",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "C2X.F": {
        "short_name": "CHINA LITERAT.  HD-,00002",
        "long_name": "China Literature Limited",
        "summary": "China Literature Limited, an investment holding company, operates an online literature platform in the People's Republic of China. The company's flagship product is QQ Reading, a unified mobile content aggregation and distribution platform. As of December 31, 2019, its library featured 8.1 million writers and 12.2 million works of literature, including 11.5 million original literary works created by writers on its platform, 400 thousand works that are sourced from third-party platforms, and 280 thousand e-books. It is also involved in the self-operated channels business on partner distribution platforms. In addition, the company licenses the content to third-party partners, such as Baidu, Sogou, JD.com, and Xiaomi Duokan for distribution, as well as offers online paid reading and content adaptations into various entertainment formats. Further, it provides reading, copyright commercialization, and writer cultivation and brokerage services; and operates text work reading and related open platform through technology methods and digital media, including personal computers, Internet, and mobile network. Additionally, the company engages in the production and distribution of television series, web series, and films; licensing and distribution of film and television properties; licensing copyrights; sale of physical books; and operation of in-house online games, etc. The company was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. China Literature Limited is a subsidiary of Tencent Holdings Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://ir.yuewen.com",
        "market_cap": "Large Cap"
    },
    "CANG": {
        "short_name": "Cango Inc.",
        "long_name": "Cango Inc.",
        "summary": "Cango Inc. operates an automotive transaction service platform that connects dealers, original equipment manufacturer, financial institutions, car buyers, and other industry participants in the People's Republic of China. The company offers automobile trading solutions, including car sourcing, logistics, and warehousing support for dealers, as well as software as a service solutions; and facilitation of car purchases for car buyers. It also facilitates automotive financing services that include facilitating financing transactions from financial institutions to car buyers; and after-market services to car buyers, which includes facilitating the sale of insurance policies from insurance brokers or companies. The company was founded in 2010 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200124",
        "website": "http://www.cangoonline.com",
        "market_cap": "Small Cap"
    },
    "CHLLF": {
        "short_name": "CHINA LITERATURE LTD",
        "long_name": "China Literature Limited",
        "summary": "China Literature Limited, an investment holding company, operates an online literature platform in the People's Republic of China. The company's flagship product is QQ Reading, a unified mobile content aggregation and distribution platform. As of December 31, 2019, its library featured 8.1 million writers and 12.2 million works of literature, including 11.5 million original literary works created by writers on its platform, 400 thousand works that are sourced from third-party platforms, and 280 thousand e-books. It is also involved in the self-operated channels business on partner distribution platforms. In addition, the company licenses the content to third-party partners, such as Baidu, Sogou, JD.com, and Xiaomi Duokan for distribution, as well as offers online paid reading and content adaptations into various entertainment formats. Further, it provides reading, copyright commercialization, and writer cultivation and brokerage services; and operates text work reading and related open platform through technology methods and digital media, including personal computers, Internet, and mobile network. Additionally, the company engages in the production and distribution of television series, web series, and films; licensing and distribution of film and television properties; licensing copyrights; sale of physical books; and operation of in-house online games, etc. The company was founded in 2002 and is headquartered in Shanghai, the People's Republic of China. China Literature Limited is a subsidiary of Tencent Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://ir.yuewen.com",
        "market_cap": "Large Cap"
    },
    "CNNM": {
        "short_name": "CHINA NETWORK MEDIA INC",
        "long_name": "China Network Media Inc.",
        "summary": "China Network Media Inc. operates a multi-lingual portal Website that provides advertising opportunities, technical support, and industrial information and community function services to science and technology companies and entrepreneurs in China. It also offers various technical support services comprising business management software, Internet infrastructure services, and export-related services, as well as educational services for enterprise management and e-commerce professionals. In addition, the company provides industrial information and online community services to technicians, and science and technology professionals for accessing industrial information, job openings, and social opportunities through its Website. Further, it operates two interactive and information sharing platforms, including bulletin board system (BBS) and Blog, which enables users to upload and download software and data, read news and bulletins, and exchange messages with other users through emails, as well as on public message board. The company was formerly known as Metha Energy Solutions Inc. China Network Media Inc. was founded in 2008 and is headquartered in Dalian, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116023",
        "website": "http://www.twwtn.com",
        "market_cap": "Nano Cap"
    },
    "CXKJ": {
        "short_name": "CX NETWORK GROUP INC",
        "long_name": "CX Network Group, Inc.",
        "summary": "CX Network Group, Inc. develops and operates mobile gaming products in China. Its product includes Magician Hero, a non-stop-3D real action and battle game based on Greek mythology; and Shu Mountain Fantasy, a role-playing game of Xian Xia theme based on the period of the fairy magic war. The company is based in Dongguan, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523000",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "DAO": {
        "short_name": "Youdao, Inc.",
        "long_name": "Youdao, Inc.",
        "summary": "Youdao, Inc., an internet technology company, provides online services in content, community, communication, and commerce in China. The company provides various learning content, applications, and solutions, which covers topics and targets people from various age groups for their learning needs through its websites and mobile applications; Youdao Dictionary with range of products and services addressing lifelong learning needs of pre-school, K-12 and college students as well as adult learners; and other online dictionary and translation tools comprising Youdao Translation, U-Dictionary, and Youdao Kids' Dictionary. It also offers smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, Youdao Cloud Pen, and Youdao Super Dictionary. In addition, the company provides online courses comprising Youdao Premium Courses, NetEase Cloud Classroom, and China University MOOC; interactive learning apps, such as Youdao Fun Reading, Youdao Math, and Youdao Vocabulary Builder catering to various age groups' learning needs; and enterprise services, which include technologies and solutions licensed to enterprise customers through Youdao Smart Cloud. It offers learning services and products primarily include online courses, fee-based premium services, and others, as well as online marketing services; technical support to the VIEs; and consulting services. Youdao, Inc. was founded in 2006 and is headquartered in Hangzhou, China. Youdao, Inc. is a subsidiary of NetEase, Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310051",
        "website": "http://www.youdao.com",
        "market_cap": "Mid Cap"
    },
    "DOYU": {
        "short_name": "DouYu International Holdings Li",
        "long_name": "DouYu International Holdings Limited",
        "summary": "DouYu International Holdings Limited, together with its subsidiaries, operates a platform on PC and mobile apps that provides interactive games and entertainment live streaming services in China. Its platform connects game developers and publishers, professional eSports teams or players and eSports tournament organizers, advertisers, and viewers. The company also sponsors eSports teams and organizes eSports tournaments. In addition, it streams other content to include a spectrum of live streaming entertainment options, such as talent shows, music, outdoor, and travel. Further, the company records and offers video clips to allow users to watch replays of selective live streaming content; and allows viewers and streamers to edit and upload short video clips by themselves. DouYu International Holdings Limited was founded in 2014 and is headquartered in Wuhan, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430073",
        "website": "http://www.douyu.com",
        "market_cap": "Mid Cap"
    },
    "DY8A.F": {
        "short_name": "DOUYU INT.HLDG. SP.ADR/1",
        "long_name": "DouYu International Holdings Limited",
        "summary": "DouYu International Holdings Limited, together with its subsidiaries, operates a platform on PC and mobile apps that provides interactive games and entertainment live streaming services in China. Its platform connects game developers and publishers, professional eSports teams or players and eSports tournament organizers, advertisers, and viewers. The company also sponsors eSports teams and organizes eSports tournaments. In addition, it streams other content to include a spectrum of live streaming entertainment options, such as talent shows, music, outdoor, and travel. Further, the company records and offers video clips to allow users to watch replays of selective live streaming content; and allows viewers and streamers to edit and upload short video clips by themselves. DouYu International Holdings Limited was founded in 2014 and is headquartered in Wuhan, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430073",
        "website": "http://www.douyu.com",
        "market_cap": "Mid Cap"
    },
    "ELRE": {
        "short_name": "YINFU GOLD CORP",
        "long_name": "Yinfu Gold Corporation",
        "summary": "Yinfu Gold Corporation focuses on establishing and building a peer-to-peer online lending service platform in China. It intends to provide an online lending platform that matches lenders directly with the borrowers. The company was formerly known as Element92 Resources Corp. and changed its name to Yinfu Gold Corporation in November 2010. Yinfu Gold Corporation was incorporated in 2005 and is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.uselre.com",
        "market_cap": "Nano Cap"
    },
    "FENG": {
        "short_name": "Phoenix New Media Limited",
        "long_name": "Phoenix New Media Limited",
        "summary": "Phoenix New Media Limited provides content on an integrated Internet platform in the People's Republic of China. The company operates in two segments, Net Advertising Services and Paid Services. It offers content and services through three channels, including PC channel, mobile channel, and telecom operators, as well as transmits content to TV viewers, primarily through Phoenix TV. The company, through its website, ifeng.com, provides approximately 40 interest-based verticals, such as news, finance, fashion, entertainment, automobiles, live broadcasting, we-media, military affairs, sports, history, PC digital reading, and real estate; offers interactive services, including comments posting and user surveys; and operates play.ifeng.com, a third-party developed web-based game platform and v.ifeng.com, a free online video on demand vertical. Its mobile channel consists of ifeng News, a news application that provides newsfeeds and other contents in the form of text, image, live broadcasting, and video; ifeng Video, a video application, which offers video news, live broadcasting, Phoenix TV programs content, etc.; and i.ifeng.com mobile Internet website. In addition, the company offers mobile newspaper, mobile video, and mobile game services, as well as wireless value-added services. The company was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China. Phoenix New Media Limited is a subsidiary of Phoenix Satellite Television (B.V.I) Holding Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.ifeng.com",
        "market_cap": "Micro Cap"
    },
    "IQ": {
        "short_name": "iQIYI, Inc.",
        "long_name": "iQIYI, Inc.",
        "summary": "iQIYI, Inc., together with its subsidiaries, provides online entertainment services under the iQIYI brand in the People's Republic of China. The company offers various products and services comprising internet video, online games, live broadcasting, online literature, animations, e-commerce, and social media platform. It operates a platform that provides a collection of internet video content, including professionally-produced content licensed from professional content providers and self-produced content. The company also provides membership, content distribution, and online advertising services. In addition, it operates iQIYI Mall, an e-commerce platform that focuses on entertainment-related merchandise, such as VR glasses, as well as sells electronics, apparel and accessories, and beauty and skincare products; iQIYI Show, a live broadcasting service that enables users to follow their favorite hosts, celebrities, and shows in real time through live broadcasting; and iQIYI Paopao, a social platform. Further, it is involved in the talent agency and IP licensing activities, as well as in developing Suike, a video community app. The company was formerly known as Qiyi.com, Inc. and changed its name to iQIYI, Inc. in November 2017. iQIYI, Inc. was incorporated in 2009 and is headquartered in Beijing, China. iQIYI, Inc. is a subsidiary of Baidu Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.iqiyi.com",
        "market_cap": "Large Cap"
    },
    "IQ8.F": {
        "short_name": "IQIYI INC. ADR  DL-,00001",
        "long_name": "iQIYI, Inc.",
        "summary": "iQIYI, Inc., together with its subsidiaries, provides online entertainment services under the iQIYI brand in the People's Republic of China. The company offers various products and services comprising internet video, online games, live broadcasting, online literature, animations, e-commerce, and social media platform. It operates a platform that provides a collection of internet video content, including professionally-produced content licensed from professional content providers and self-produced content. The company also provides membership, content distribution, and online advertising services. In addition, it operates iQIYI Mall, an e-commerce platform that focuses on entertainment-related merchandise, such as VR glasses, as well as sells electronics, apparel and accessories, and beauty and skincare products; iQIYI Show, a live broadcasting service that enables users to follow their favorite hosts, celebrities, and shows in real time through live broadcasting; and iQIYI Paopao, a social platform. Further, it is involved in the talent agency and IP licensing activities, as well as in developing Suike, a video community app. The company was formerly known as Qiyi.com, Inc. and changed its name to iQIYI, Inc. in November 2017. iQIYI, Inc. was incorporated in 2009 and is headquartered in Beijing, China. iQIYI, Inc. is a subsidiary of Baidu Holdings Limited.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.iqiyi.com",
        "market_cap": "Large Cap"
    },
    "JFIN": {
        "short_name": "Jiayin Group Inc.",
        "long_name": "Jiayin Group Inc.",
        "summary": "Jiayin Group Inc. operates as an online individual finance marketplace that connects individual investors and individual borrowers in China. It operates a secure and open platform that facilitates transparent, secure, and fast connections between investors and borrowers. The company was founded in 2011 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200122",
        "website": "http://www.jiayinfintech.cn",
        "market_cap": "Small Cap"
    },
    "JOYY.VI": {
        "short_name": "JOYY INC ADR",
        "long_name": "JOYY Inc.",
        "summary": "JOYY Inc., through its subsidiaries, operates a social media platform in the People's Republic of China and internationally. The company operates live streaming platforms, including YY Live, an interactive and comprehensive live streaming social media platform offering music and dance shows, talk shows, outdoor activities, and sports and anime; Bigo Live, which enables users to live stream their specific moments and talk live with each other; and Huya, a game live streaming platform. It also operates short-form video platform, such as Likee, a short-form video social platform that produces, uploads, views, shares, and comments on short-form videos on a daily basis. In addition, the company operates imo, a video communication platform; and Hago, a casual-game-oriented social platform that integrates various social features, such as live streaming chatrooms and karaoke. The company was formerly known as YY Inc. and changed its name to JOYY Inc. in December 2019. JOYY Inc. was founded in 2005 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511442",
        "website": "http://www.huanju.cn",
        "market_cap": "Mid Cap"
    },
    "KRKR": {
        "short_name": "36Kr Holdings Inc.",
        "long_name": "36Kr Holdings Inc.",
        "summary": "36Kr Holdings Inc. offers content and business services to new economy participants in the People's Republic of China. It creates and distributes various content, including insightful reports on companies and timely market updates, as well as editorials and commentaries in various industries, such as technology, consumer and retail, and healthcare. The company's business services include online advertising services; enterprise value-added services, such as integrated marketing, offline events, and consulting services; and subscription services to individuals, institutional investors, and enterprises. 36Kr Holdings Inc. was founded in 2010 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100026",
        "website": "http://www.36Kr.com",
        "market_cap": "Micro Cap"
    },
    "LIZI": {
        "short_name": "LIZHI INC.",
        "long_name": "Lizhi Inc.",
        "summary": "Lizhi Inc. operates an online user-generated content audio community, interactive audio entertainment platform, and online audio platform in China and the United States. It provides podcasts, live streaming, and audio entertainment products. The company also offers Lizhi app that allows users to record and share their voices on mobile devices; Tiya App, an audio-based social networking product; and LIZHI Podcast, a podcast app to provide curated podcast content. The company has collaboration agreements with Xpeng Motors, GAC AION New Energy Automobile, and GAC Motor, as well as with BYD DiLink and Huawei Mobile Services. Lizhi Inc. was incorporated in 2010 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510655",
        "website": "http://www.lizhiinc.com",
        "market_cap": "Micro Cap"
    },
    "LKCO": {
        "short_name": "Luokung Technology Corp",
        "long_name": "Luokung Technology Corp.",
        "summary": "Luokung Technology Corp., through its subsidiaries, provides location-based services and mobile application products for long distance travelers in the People's Republic of China. It offers Luokuang mobile application, a content and service distribution platform that provides content and services, such as information, entertainment, travel, e-commerce, online to offline, advertisement, and other marketing features. The company also offers software development kits and application-programming interfaces, which provide spatial-temporal big data analysis and customized map to software and mobile application developers; and spatial temporal indexing cloud service, a data-level virtualization technology. In addition, it offers information SuperEngine that includes the server engine, which enables to store, manage, and index the spatial temporal big data on the server side; and Web graphics image engine that supports transmission of graphics images, as well as display and edge computing for multi-terminal and cross-platform. Further, the company provides spatial temporal cloud platform that offers cloud services, including data storage, data resource, and platform support services, as well as supports users to aggregate multi-source spatial data, map services, and Internet of Things streaming data. Luokung Technology Corp. has a strategic partnership with Jiangsu Dianyu Information Technology Co., Ltd. to expand mobile commercial big data services in the 5G era. Luokung Technology Corp. is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.luokung.com",
        "market_cap": "Small Cap"
    },
    "M5U.F": {
        "short_name": "MEITU INC.  DL-,00001",
        "long_name": "Meitu, Inc.",
        "summary": "Meitu, Inc., an investment holding company, operates as a mobile Internet company in the People's Republic of China. It offers a portfolio of photo and community apps, including Meitu, BeautyCam, BeautyPlus, Meipai, MeituEve, Airbrush, and others. The company also provides online advertising, premium subscription and in-app purchases, Internet value-added, and other services. In addition, it offers information technology and online recruitment services; and develops and operates apps, as well as develops, manufactures, and sells smartphones. Meitu, Inc. was founded in 2008 and is headquartered in Xiamen, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.meitu.com",
        "market_cap": "Small Cap"
    },
    "MEIUF": {
        "short_name": "MEITU INC",
        "long_name": "Meitu, Inc.",
        "summary": "Meitu, Inc., an investment holding company, operates as a mobile Internet company in the People's Republic of China. It offers a portfolio of photo and community apps, including Meitu, BeautyCam, BeautyPlus, Meipai, MeituEve, Airbrush, and others. The company also provides online advertising, premium subscription and in-app purchases, Internet value-added, and other services. In addition, it offers information technology and online recruitment services; and develops and operates apps, as well as develops, manufactures, and sells smartphones. Meitu, Inc. was founded in 2008 and is headquartered in Xiamen, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.meitu.com",
        "market_cap": "Small Cap"
    },
    "MOMO": {
        "short_name": "Momo Inc.",
        "long_name": "Momo Inc.",
        "summary": "Momo Inc. provides mobile-based social and entertainment services in the People's Republic of China. It operates Momo platform that includes its Momo mobile application, as well as various related properties, features, functionalities, tools, and services. The company's Momo mobile application connects people and facilitates interactions based on location and interests; and various recreational activities, including live talent shows, short videos, and social games, as well as other video- and audio-based interactive experiences, such as live chats and mobile karaoke experience. It also operates Tantan, a social and dating application for younger generation, which enables users to find and establish romantic connections, and meet interesting people; and provides live video, value-added, mobile marketing, and other services, as well as mobile games. The company was formerly known as Momo Technology Company Limited and changed its name to Momo Inc. in July 2014. Momo Inc. was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.immomo.com",
        "market_cap": "Mid Cap"
    },
    "MOMO.VI": {
        "short_name": "MOMO INC ADR",
        "long_name": "Momo Inc.",
        "summary": "Momo Inc. provides mobile-based social and entertainment services in the People's Republic of China. It operates Momo platform that includes its Momo mobile application, as well as various related properties, features, functionalities, tools, and services. The company's Momo mobile application connects people and facilitates interactions based on location and interests; and various recreational activities, including live talent shows, short videos, and social games, as well as other video- and audio-based interactive experiences, such as live chats and mobile karaoke experience. It also operates Tantan, a social and dating application for younger generation, which enables users to find and establish romantic connections, and meet interesting people; and provides live video, value-added, mobile marketing, and other services, as well as mobile games. The company was formerly known as Momo Technology Company Limited and changed its name to Momo Inc. in July 2014. Momo Inc. was incorporated in 2011 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.immomo.com",
        "market_cap": "Mid Cap"
    },
    "NEH.F": {
        "short_name": "NETEASE INC. ADR/5",
        "long_name": "NetEase, Inc.",
        "summary": "NetEase, Inc. provides online services focusing on gaming, communication, and commerce in the Peoples' Republic of China and internationally. The company operates in three segments: Online Games Services, Youdao, and Innovative Businesses and Others. It develops and operates PC and mobile games, as well as offers games licensed from other game developers. The company's products and services include Youdao Dictionary, an online knowledge tool; smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, and Youdao Cloud Pen; online courses; interactive learning apps; and enterprise services, such as Youdao Smart Cloud, a cloud-based platform that helps third-party app developers, smart device brands, and manufacturers to access its optical character recognition capability and neural machine translation engine. Its products and services also include NetEase Cloud Music, a music streaming platform; Yanxuan, an e-commerce platform, which sells private label products, including consumer electronics, food, apparel, homeware, kitchenware, and other general merchandise; NetEase Media, an internet media platform; NetEase Mail, an email service; NetEase CC Live streaming, a live streaming platform with a focus on game broadcasting; and NetEase Pay, a payment platform. The company was formerly known as NetEase.com, Inc. and changed its name to NetEase, Inc. in March 2012. NetEase, Inc. was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.netease.com",
        "market_cap": "Large Cap"
    },
    "NETTF": {
        "short_name": "NETEASE INC",
        "long_name": "NetEase, Inc.",
        "summary": "NetEase, Inc. provides online services focusing on gaming, communication, and commerce in the Peoples' Republic of China and internationally. The company operates in three segments: Online Games Services, Youdao, and Innovative Businesses and Others. It develops and operates PC and mobile games, as well as offers games licensed from other game developers. The company's products and services include Youdao Dictionary, an online knowledge tool; smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, and Youdao Cloud Pen; online courses; interactive learning apps; and enterprise services, such as Youdao Smart Cloud, a cloud-based platform that helps third-party app developers, smart device brands, and manufacturers to access its optical character recognition capability and neural machine translation engine. Its products and services also include NetEase Cloud Music, a music streaming platform; Yanxuan, an e-commerce platform, which sells private label products, including consumer electronics, food, apparel, homeware, kitchenware, and other general merchandise; NetEase Media, an internet media platform; NetEase Mail, an email service; NetEase CC Live streaming, a live streaming platform with a focus on game broadcasting; and NetEase Pay, a payment platform. The company was formerly known as NetEase.com, Inc. and changed its name to NetEase, Inc. in March 2012. NetEase, Inc. was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.netease.com",
        "market_cap": "Large Cap"
    },
    "NNN1.F": {
        "short_name": "TENCENT HDGS ADR/1DL-0001",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "NNN1.VI": {
        "short_name": "TENCENT HOLDINGS LTD-UNS ADR",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "NNND.F": {
        "short_name": "TENCENT HLDGS  HD-,00002",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "NNND.VI": {
        "short_name": "TENCENT HOLDINGS LTD",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "NTES.BA": {
        "short_name": "NETEASE INC",
        "long_name": "NetEase, Inc.",
        "summary": "NetEase, Inc. provides online services focusing on gaming, communication, and commerce in the Peoples' Republic of China and internationally. The company operates in three segments: Online Games Services, Youdao, and Innovative Businesses and Others. It develops and operates PC and mobile games, as well as offers games licensed from other game developers. The company's products and services include Youdao Dictionary, an online knowledge tool; smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, and Youdao Cloud Pen; online courses; interactive learning apps; and enterprise services, such as Youdao Smart Cloud, a cloud-based platform that helps third-party app developers, smart device brands, and manufacturers to access its optical character recognition capability and neural machine translation engine. Its products and services also include NetEase Cloud Music, a music streaming platform; Yanxuan, an e-commerce platform, which sells private label products, including consumer electronics, food, apparel, homeware, kitchenware, and other general merchandise; NetEase Media, an internet media platform; NetEase Mail, an email service; NetEase CC Live streaming, a live streaming platform with a focus on game broadcasting; and NetEase Pay, a payment platform. The company was formerly known as NetEase.com, Inc. and changed its name to NetEase, Inc. in March 2012. NetEase, Inc. was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.netease.com",
        "market_cap": null
    },
    "NTES": {
        "short_name": "NetEase, Inc.",
        "long_name": "NetEase, Inc.",
        "summary": "NetEase, Inc. provides online services focusing on gaming, communication, and commerce in the Peoples' Republic of China and internationally. The company operates in three segments: Online Games Services, Youdao, and Innovative Businesses and Others. It develops and operates PC and mobile games, as well as offers games licensed from other game developers. The company's products and services include Youdao Dictionary, an online knowledge tool; smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, and Youdao Cloud Pen; online courses; interactive learning apps; and enterprise services, such as Youdao Smart Cloud, a cloud-based platform that helps third-party app developers, smart device brands, and manufacturers to access its optical character recognition capability and neural machine translation engine. Its products and services also include NetEase Cloud Music, a music streaming platform; Yanxuan, an e-commerce platform, which sells private label products, including consumer electronics, food, apparel, homeware, kitchenware, and other general merchandise; NetEase Media, an internet media platform; NetEase Mail, an email service; NetEase CC Live streaming, a live streaming platform with a focus on game broadcasting; and NetEase Pay, a payment platform. The company was formerly known as NetEase.com, Inc. and changed its name to NetEase, Inc. in March 2012. NetEase, Inc. was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.netease.com",
        "market_cap": "Large Cap"
    },
    "NTES.VI": {
        "short_name": "NETEASE INC-ADR",
        "long_name": "NetEase, Inc.",
        "summary": "NetEase, Inc. provides online services focusing on gaming, communication, and commerce in the Peoples' Republic of China and internationally. The company operates in three segments: Online Games Services, Youdao, and Innovative Businesses and Others. It develops and operates PC and mobile games, as well as offers games licensed from other game developers. The company's products and services include Youdao Dictionary, an online knowledge tool; smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, and Youdao Cloud Pen; online courses; interactive learning apps; and enterprise services, such as Youdao Smart Cloud, a cloud-based platform that helps third-party app developers, smart device brands, and manufacturers to access its optical character recognition capability and neural machine translation engine. Its products and services also include NetEase Cloud Music, a music streaming platform; Yanxuan, an e-commerce platform, which sells private label products, including consumer electronics, food, apparel, homeware, kitchenware, and other general merchandise; NetEase Media, an internet media platform; NetEase Mail, an email service; NetEase CC Live streaming, a live streaming platform with a focus on game broadcasting; and NetEase Pay, a payment platform. The company was formerly known as NetEase.com, Inc. and changed its name to NetEase, Inc. in March 2012. NetEase, Inc. was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.netease.com",
        "market_cap": "Large Cap"
    },
    "NTESN.MX": {
        "short_name": "NETEASE INC",
        "long_name": "NetEase, Inc.",
        "summary": "NetEase, Inc. provides online services focusing on gaming, communication, and commerce in the Peoples' Republic of China and internationally. The company operates in three segments: Online Games Services, Youdao, and Innovative Businesses and Others. It develops and operates PC and mobile games, as well as offers games licensed from other game developers. The company's products and services include Youdao Dictionary, an online knowledge tool; smart devices, such as Youdao Smart Pen, Youdao Dictionary Pen, Youdao Pocket Translator, and Youdao Cloud Pen; online courses; interactive learning apps; and enterprise services, such as Youdao Smart Cloud, a cloud-based platform that helps third-party app developers, smart device brands, and manufacturers to access its optical character recognition capability and neural machine translation engine. Its products and services also include NetEase Cloud Music, a music streaming platform; Yanxuan, an e-commerce platform, which sells private label products, including consumer electronics, food, apparel, homeware, kitchenware, and other general merchandise; NetEase Media, an internet media platform; NetEase Mail, an email service; NetEase CC Live streaming, a live streaming platform with a focus on game broadcasting; and NetEase Pay, a payment platform. The company was formerly known as NetEase.com, Inc. and changed its name to NetEase, Inc. in March 2012. NetEase, Inc. was founded in 1997 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310052",
        "website": "http://ir.netease.com",
        "market_cap": "Large Cap"
    },
    "QTT": {
        "short_name": "Qutoutiao Inc.",
        "long_name": "Qutoutiao Inc.",
        "summary": "Qutoutiao Inc. operates mobile platforms for the distribution, consumption, and sharing of light entertainment content in the People's Republic of China. The company operates Qutoutiao, a mobile application that aggregates articles and videos from content providers and presents real-time customized feeds to users; and Quduopai mobile application, as well as provides online data processing and transaction processing services. It also offers Midu Novels, a mobile literature application that offers users free literature supported by advertising, as well as Midu Lite mobile literature application. The company was formerly known as Qtech Ltd. and changed its name to Qutoutiao Inc. in July 2018. Qutoutiao Inc. was founded in 2016 and is headquartered in Shanghai, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200124",
        "website": "http://www.qutoutiao.net",
        "market_cap": "Small Cap"
    },
    "SFUN": {
        "short_name": "Fang Holdings Limited",
        "long_name": "Fang Holdings Limited",
        "summary": "Fang Holdings Limited operates a real estate Internet portal in the People's Republic of China. The company's portal offers marketing, listing, financial, and e-commerce, as well as other value-added services. It supports active online communities and networks of users seeking information on and other value-added services for the real estate, and home furnishing and improvement sectors. The company was formerly known as SouFun Holdings Limited and changed its name to Fang Holdings Limited in September 2016 Fang Holdings Limited was founded in 1999 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.fang.com",
        "market_cap": "Micro Cap"
    },
    "SOGO": {
        "short_name": "Sogou Inc.",
        "long_name": "Sogou Inc.",
        "summary": "Sogou Inc. provides search and search-related services in the People's Republic of China. The company provides Sogou Search, a search engine; and Sogou Input Method, a Chinese language input software for PC and mobile users. It also offers other products that include Sogou Browser; Sogou Web Directory, a content aggregation and distribution platform that offers news aggregation, video content aggregation, and shopping assistance; Sogou Maps, which provides Internet-based map and navigation services related to traffic options, routing optimization, and positioning calculation for PCs, mobile devices, and smart wearables; Sogou Mobile Assistant that helps users find mobile applications and games related to their interests; Sogou Game Center, a gaming platform, which offers web and mobile games developed by third parties; and Sogou Translation, a multi-language translation solution. The company also provides Sogou AI, a voice-enabled hardware product; and Teemo, a smart hardware product for children, as well as offers Internet value-added, and search and search-related advertising services. Sogou Inc. was incorporated in 2005 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100084",
        "website": "http://www.sogou.com",
        "market_cap": "Mid Cap"
    },
    "SOHU": {
        "short_name": "Sohu.com Limited",
        "long_name": "Sohu.com Limited",
        "summary": "Sohu.com Limited provides online media, game, and search products and services on PCs and mobile devices in China. The company provides online news and information through the mobile phone application Sohu News APP, mobile portal m.sohu.com, and www.sohu.com for PCs; and online video contents and services through mobile phone application Sohu Video APP and tv.sohu.com, and ifox, a PC video application. The company is also involved in the development, operation, and licensing of online games for PCs and mobile devices, which include massive multiplayer online role-playing games; and casual games, strategy games, and collectible card games. In addition, it operates focus.cn, which provides online real estate information and services; and 17173.com website, which provides news, electronic forums, online videos, and other online game information services to game players, as well as offers mobile game distribution services. Further, the company provides paid subscription services, interactive broadcasting services, and sub-licensing of purchased video content to third parties. Sohu.com Limited was founded in 1996 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100190",
        "website": "http://www.sohu.com",
        "market_cap": "Small Cap"
    },
    "TC": {
        "short_name": "TuanChe Limited",
        "long_name": "TuanChe Limited",
        "summary": "TuanChe Limited, through its subsidiaries, operates as an omni-channel automotive marketplace in China. It organizes auto shows and group-purchase events that attract various consumers; and provides integrated marketing solutions to industry customers, which include automakers, franchised dealerships, secondary dealers, and automotive service providers, as well as enable interactions between participants on both sides of a potential transaction. It also provides virtual dealership services by connecting automakers and franchised dealerships with secondary dealers by providing a suite of services traditionally undertaken by franchised dealerships without setting up permanent physical presence. In addition, the company offers business and technical support, and consulting services. As of December 31, 2020, the company organized 499 auto shows in 172 cities across China. TuanChe Limited has a strategic partnership with Beijing Easyhome Furnishing Chain Group Co., Ltd. to jointly establish a one-stop retail experience that combines home decoration products and automotive services. The company was founded in 2010 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100038",
        "website": "http://www.tuanche.com",
        "market_cap": "Micro Cap"
    },
    "TCEHY": {
        "short_name": "TENCENT HOLDINGS LIMITED",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "TCTZF": {
        "short_name": "TENCENT HOLDINGS LIMITED",
        "long_name": "Tencent Holdings Limited",
        "summary": "Tencent Holdings Limited, an investment holding company, provides value-added services (VAS) and Online advertising services in Mainland China and internationally. The company operates through VAS, Online Advertising, FinTech and Business Services, and Others segments. It offers online games and social network services; FinTech and cloud services, and online advertising services, such as media, social, and others advertisement services. The company is also involved in production, investment, and distribution of films and television programs for third parties, as well as copyrights licensing, merchandise sales, and other activities. In addition, it develops software; develops and operates online games; and provides information technology, information system integration, asset management, online literature, and online music entertainment services. Tencent Holdings Limited company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518054",
        "website": "http://www.tencent.com",
        "market_cap": "Mega Cap"
    },
    "TGRVF": {
        "short_name": "TIAN GE INTERACTIVE HOLDINGS LT",
        "long_name": "Tian Ge Interactive Holdings Limited",
        "summary": "Tian Ge Interactive Holdings Limited, an investment holding company, operates live social video platforms, and mobile and online games in the People's Republic of China, Thailand, Taiwan, and internationally. The company operates through Online Interactive Entertainment Service, Advertising Service, and Others segments. It operates mobile live streaming applications, including Miao Broadcasting, Crystal Live Broadcasting, Happy Live Broadcasting, and Feng Broadcasting. The company also operates many-to-many live social video communities, which provides content, such as karaoke and singing competitions; and talk shows on comedy, sports, and pop culture, as well as lectures about finance, education, or personal health. In addition, it operates Sina Showcase, a one-to-many live social video community, where host perform to a group of audience through a one-way video stream. Further, the company offers vehicle mortgage loans through Jiurong.com; and software research and development, technical and consulting, and online entertainment and advertising services, as well as develops and sells mobile games. Tian Ge Interactive Holdings Limited was incorporated in 2008 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.tiange.com",
        "market_cap": "Micro Cap"
    },
    "TME": {
        "short_name": "Tencent Music Entertainment Gro",
        "long_name": "Tencent Music Entertainment Group",
        "summary": "Tencent Music Entertainment Group operates online music entertainment platforms that provides music streaming, online karaoke, and live streaming services in the People's Republic of China. It offers QQ Music, Kugou Music, and Kuwo Music that enable users to discover and listen to music in personalized ways; and WeSing, which enables users to have fun by singing and interacting with friends, sharing their singing performances with friends, and discovering songs that others have sung. The company also operates Kugou Music, Kuwo Music, WeSing, QQ Music, Kugou Live, and Kuwo Live that provides an interactive online stage for performers and users to showcase their talent and engage with those interested in their performance; and Kuwo Changting, an audio platform that offers users various audio content, including audio books, cross-talks, radio dramas, and other entertainment. In addition, it sells music-related merchandise, including Kugou headsets, smart speakers, WeSing karaoke microphones, and Hi-Fi systems; and offers online music event ticketing services, as well as services to smart device and automobile makers to build and operate music services on devices and vehicles. Tencent Music Entertainment Group has a strategic partnership with China Literature. The company was formerly known as China Music Corporation. The company was incorporated in 2012 and is headquartered in Shenzhen, China. Tencent Music Entertainment Group is a subsidiary of Tencent Holdings Limited.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.tencentmusic.com",
        "market_cap": "Large Cap"
    },
    "UX0.SG": {
        "short_name": "UXIN Ltd. Reg.Shs A (ADRs)/3 YC",
        "long_name": "Uxin Limited",
        "summary": "Uxin Limited, an investment holding company, operates a used car e-commerce platform in China. It provides selection of used cars, evaluation of car condition, various car-related value-added products and services, and supporting services to online used car transactions under the Uxin Used Car brand; and operates Uxin Auction, an application that helps business buyers to source vehicles through online auctions. The company also facilitates used car transaction services, and financing solutions offered by third-party financing partners to buyers for their used car purchases through websites, xin.com and youxinpai.com. Uxin Limited was founded in 2011 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.xin.com",
        "market_cap": "Small Cap"
    },
    "UXIN": {
        "short_name": "Uxin Limited",
        "long_name": "Uxin Limited",
        "summary": "Uxin Limited, an investment holding company, operates a used car e-commerce platform in China. It provides selection of used cars, evaluation of car condition, various car-related value-added products and services, and supporting services to online used car transactions under the Uxin Used Car brand; and operates Uxin Auction, an application that helps business buyers to source vehicles through online auctions. The company also facilitates used car transaction services, and financing solutions offered by third-party financing partners to buyers for their used car purchases through websites, xin.com and youxinpai.com. Uxin Limited was founded in 2011 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.xin.com",
        "market_cap": "Small Cap"
    },
    "WB": {
        "short_name": "Weibo Corporation",
        "long_name": "Weibo Corporation",
        "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted marketing offerings, such as Fans Headline and Weibo Express, as well as promoted trends and search products that appear alongside user's trends discovery and search behaviors. In addition, the company offers products, such as trends, search, video/live streaming, and editing tools; content customization, copyright contents pooling, and user interaction development; and search list recommendation, trends list recommendation, and Weibo app opening advertisements for copyright content providers. Further, it provides back-end management, traffic support, and product solutions to MCNs, unions, and e-commerce partners; open application platform for other app developers that allows users to log into third-party applications with their Weibo account for sharing third-party content on its platform; and Weibo Wallet, a product that enables platform partners to conduct interest generation activities on Weibo, such as handing out red envelops and coupons. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://ir.weibo.com",
        "market_cap": "Large Cap"
    },
    "WBO.VI": {
        "short_name": "WEIBO CORP ADR",
        "long_name": "Weibo Corporation",
        "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, distribute, and discover content in the People's Republic of China. It operates in two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery products to help users discover content on its platform; self-expression products that enable its users to express themselves on its platform; and social products to promote social interaction between users on its platform. It also provides advertising and marketing solutions, such as social display advertisements; and promoted marketing offerings, such as Fans Headline and Weibo Express, as well as promoted trends and search products that appear alongside user's trends discovery and search behaviors. In addition, the company offers products, such as trends, search, video/live streaming, and editing tools; content customization, copyright contents pooling, and user interaction development; and search list recommendation, trends list recommendation, and Weibo app opening advertisements for copyright content providers. Further, it provides back-end management, traffic support, and product solutions to MCNs, unions, and e-commerce partners; open application platform for other app developers that allows users to log into third-party applications with their Weibo account for sharing third-party content on its platform; and Weibo Wallet, a product that enables platform partners to conduct interest generation activities on Weibo, such as handing out red envelops and coupons. The company was formerly known as T.CN Corporation and changed its name to Weibo Corporation in 2012. The company was founded in 2009 and is headquartered in Beijing, China. Weibo Corporation is a subsidiary of Sina Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://ir.weibo.com",
        "market_cap": "Large Cap"
    },
    "YITD": {
        "short_name": "YINHANG INTERNET TECH DEV INC",
        "long_name": "Yinhang Internet Technologies Development, Inc.",
        "summary": "Yinhang Internet Technologies Development, Inc., through its subsidiaries, operates an online marketplace for merchants and consumers that enables them to connect, share information, and conduct business in China. The company offers an Internet information service, which provides a classified information platform to end user merchants who advertise their products or services on its Website; and operates a virtual online Web mall that enables merchants and manufacturers to sell their products to online customers through an online store, as well as provides hardware and software assistance. It also distributes a Chinese language agricultural magazine, as well as sells advertising space in its magazine and on the Website, qianxianhuinong.com that provides information and news regarding urban and rural areas, such as agriculture polices and agriculture related videos. The company is based in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": null,
        "market_cap": "Nano Cap"
    },
    "YY.BA": {
        "short_name": "JOYY INC",
        "long_name": "JOYY Inc.",
        "summary": "JOYY Inc., through its subsidiaries, operates a social media platform in the People's Republic of China and internationally. The company operates live streaming platforms, including YY Live, an interactive and comprehensive live streaming social media platform offering music and dance shows, talk shows, outdoor activities, and sports and anime; Bigo Live, which enables users to live stream their specific moments and talk live with each other; and Huya, a game live streaming platform. It also operates short-form video platform, such as Likee, a short-form video social platform that produces, uploads, views, shares, and comments on short-form videos on a daily basis. In addition, the company operates imo, a video communication platform; and Hago, a casual-game-oriented social platform that integrates various social features, such as live streaming chatrooms and karaoke. The company was formerly known as YY Inc. and changed its name to JOYY Inc. in December 2019. JOYY Inc. was founded in 2005 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "ARS",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511442",
        "website": "http://www.huanju.cn",
        "market_cap": null
    },
    "YY": {
        "short_name": "JOYY Inc.",
        "long_name": "JOYY Inc.",
        "summary": "JOYY Inc., through its subsidiaries, operates a social media platform in the People's Republic of China and internationally. The company operates live streaming platforms, including YY Live, an interactive and comprehensive live streaming social media platform offering music and dance shows, talk shows, outdoor activities, and sports and anime; Bigo Live, which enables users to live stream their specific moments and talk live with each other; and Huya, a game live streaming platform. It also operates short-form video platform, such as Likee, a short-form video social platform that produces, uploads, views, shares, and comments on short-form videos on a daily basis. In addition, the company operates imo, a video communication platform; and Hago, a casual-game-oriented social platform that integrates various social features, such as live streaming chatrooms and karaoke. The company was formerly known as YY Inc. and changed its name to JOYY Inc. in December 2019. JOYY Inc. was founded in 2005 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511442",
        "website": "http://www.huanju.cn",
        "market_cap": "Mid Cap"
    },
    "ZH": {
        "short_name": "Zhihu Inc.",
        "long_name": "Zhihu Inc.",
        "summary": "Zhihu Inc. operates an online content community platform in the People's Republic of China. The company's community allows people to seek inspiration, find solutions, make decisions, and have fun. It also offers technology, business support, and consulting services; information and marketing services; and Internet services. The company was founded in 2011 and is based in Beijing, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100083",
        "website": null,
        "market_cap": "Mid Cap"
    }
}