{
    "002148.SZ": {
        "short_name": "BEIJING BEWINNER C",
        "long_name": "Beijing Bewinner Communications Co., Ltd.",
        "summary": "Beijing Bewinner Communications Co., Ltd. operates as a mobile Internet service provider in China. The company offers mobile value-added services; virtual operator services; and mobile game distribution services. It also engages in the Internet of things and mobile resale businesses. The company was founded in 1997 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002467.SZ": {
        "short_name": "NET263 LTD",
        "long_name": "NET263 Ltd.",
        "summary": "NET263 Ltd. operates as a communication service provider. The company offers SaaS services to corporate customers in China; corporate communication and collaborative office services, such as integrated enterprise email, enterprise network disk, telephone conference, Web conference, video conference, and enterprise live broadcast services; cloud communication services; integrated communication services for enterprise customers; and IDC services. It also provides corporate virtual private networks and business voice services; corporate private network services; and enterprise wireless, messaging, and mobility services. In addition, the company offers integrated communication services comprising VoIP home phone and IPTV services for overseas Chinese families; mobile data roaming and cross-border mobile communication services Chinese outbound business travelers, Chinese immigrants, and international students; long-distance telephone services; and virtual mobile communications services. The company was founded in 1999 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002929.SZ": {
        "short_name": "RUNJIAN CO LTD",
        "long_name": "Runjian Co., Ltd.",
        "summary": "Runjian Co., Ltd. engages in the communication network construction business in China. The company offers communication network engineering, design, construction, and operation and management services; and information technology and communication integration, and cloud and data center services. It also provides communication technology application research and development, and big data application services, as well as industry information platform, communication equipment hardware, and other smart city solutions. The company was formerly known as Runjian Communication Co., Ltd. and changed its name to Runjian Co., Ltd. in April 2019. The company was founded in 2003 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "300025.SZ": {
        "short_name": "HANGZHOU HUAXING C",
        "long_name": "Hangzhou Huaxing Chuangye Communication Technology Co., Ltd.",
        "summary": "Hangzhou Huaxing Chuangye Communication Technology Co., Ltd. provides mobile communication technology and Internet data services in China. It provides capacity planning, network coverage and site planning, wireless parameter planning, and survey design services; and communication pipeline engineering, power supply engineering, communication equipment engineering, and mobile equipment installation engineering services, as well as room engineering services, such as planning, designing, construction, and maintenance of signal cover systems. The company also offers base station inspection, power supply, transmission, iron tower, and fault commission maintenance services; 2G/3G/4G network measurement and evaluation, network performance monitoring and maintenance, and 2G/3G/4G cooperative network performance analysis and optimization services, as well as power generation protection services. In addition, it provides server trusteeship, server leasing, and cloud services, including data backup, Website migration and protection, network and system architecture planning, and security architecture planning services, as well as project integration implementation, site flow analysis and equalization, emergency response services, etc. Further, the company offers wireless test systems, a test product for collecting, analyzing, and optimizing analysis reports for wireless network data; wireless test terminal for mobile communication; and signaling collection platform, and network analysis and optimization software products. Additionally, it provides after-sales services. The company was founded in 2003 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "300050.SZ": {
        "short_name": "DINGLI CORP LTD",
        "long_name": "Dingli Corp., Ltd.",
        "summary": "Dingli Corp., Ltd. provides mobile network test and measurement solutions. It offers network performance benchmarking, autonomous network testing and monitoring, indoor network testing and verification, post processing and analytics, network tuning and optimization, and technology and testing evolution solutions. The company also provides handheld test solutions, such as Pilot Walktour, Pilot Walktour Pack, and Liteprobe; autonomous platform solutions comprising Pilot Fleet Unify, Pilot Scout 3.0, and Pilot RCU; and drive test solutions consisting of Pilot Pioneer and Pilot Pioneer Expert. It serves customers in 63 countries and regions worldwide. The company was formerly known as DingLi Communications Corp., Ltd. and changed its name to Dingli Corp., Ltd. in October 2015. Dingli Corp., Ltd. was founded in 2001 and is headquartered in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Zhuhai"
    },
    "300299.SZ": {
        "short_name": "FUCHUN TECHNOLOGY",
        "long_name": "Fuchun Technology Co., Ltd.",
        "summary": "Fuchun Technology Co., Ltd. provides network construction, planning, designing, construction management, and business support services for communication operators, governments, and enterprises in China. It operates through two segments, Communication Technology Services and Cultural Consumption Services. The company provides communication network construction and big data services, as well as operation and technical support services. In addition, it engages in the game, network literature, audio-visual reading, and animation businesses; and film and television production activities. The company was formerly known as Fuchun Communications Co., Ltd. and changed its name to Fuchun Technology Co., Ltd. in April 2017. Fuchun Technology Co., Ltd. was founded in 2001 and is headquartered in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "300959.SZ": {
        "short_name": "WUXI ONLINE OFFLIN",
        "long_name": "Wuxi Online Offline Communication Information Technology Co., Ltd.",
        "summary": "Wuxi Online Offline Communication Information Technology Co., Ltd. provides mobile Internet operation support services in China. The company offers mobile information services; and data traffic services. It serves customers in finance, Internet, supermarkets, logistics, and other fields. The company was founded in 2012 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuxi"
    },
    "4ARB.F": {
        "short_name": "AIRNET TECHN.  ADR 10",
        "long_name": "AirNet Technology Inc.",
        "summary": "AirNet Technology Inc. operates out-of-home advertising platforms in the People's Republic of China. The company operates a network of digital (television) TV screens on planes operated by 7 airlines; and gas station media network, as well as other outdoor media advertising platforms in gas stations. It also displays non-advertising content, such as weather, sports, comedy clips, local attractions, documentaries, commentaries, and reality shows. In addition, the company holds concession rights to install and operate Wi-Fi systems on railway administration bureaus, long-haul buses, and airlines; and operates advertising platforms, such as light boxes, billboards, and LED screens. Further, it operates CIBN-AirMedia channel to broadcast network TV programs to air travelers. The company was formerly known as AirMedia Group Inc. AirNet Technology Inc. was founded in 2005 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    },
    "600640.SS": {
        "short_name": "BESTTONE HOLDING CO",
        "long_name": "Besttone Holding Co.,Ltd",
        "summary": "Besttone Holding Co.,Ltd engages in travel booking, hotel, and telecommunication management and integration operations. The company primarily provides business travel and mall integrated business e-commerce services. Its travel reservations business provides air tickets, hotels, catering, tourism, and business and other ticket services through voice platforms, and Internet and mobile terminals. The company also operates and manages hotels and telecommunications integration platforms. In addition, it offers property management, exhibition, information, advertising design, industrial investment, and asset management services, as well as acts as ticketing and card/terminal agent. The company was formerly known as China Satcom Guomai Communications Co., Ltd. and changed its name to Besttone Holding Co.,Ltd in August 2012. Besttone Holding Co.,Ltd was founded in 1992 and is based in Shanghai, China. Besttone Holding Co.,Ltd is a subsidiary of China Telecommunications Corporation.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "600804.SS": {
        "short_name": "DR. PENG TELECOM&MEDIA GROUP CO",
        "long_name": "Dr. Peng Telecom & Media Group Co., Ltd.",
        "summary": "Dr. Peng Telecom & Media Group Co., Ltd. provides big data cloud network, broadband, and internet value-added services. It offers integrated cloud network solutions, varied cloud network interconnection scenarios, multi-cloud networking solutions, and multi-cloud management solutions for government administration, healthcare, education, and other industries; and data centers services. The company also provides home and business broadband services; and operates Damai OTT Platform that offers content related to games, education, fitness, entertainment, and life, as well as real-time interactive cloud platform for video communication. In addition, it operates as a virtual network operator of China Mobile; and owns fiber optic cable networks. It serves approximately 14 million residential users and 500,000 business users in 210 cities across China and North America. The company was formerly known as Chengdu Dr. Peng Telecom & Media Group Co., Ltd. Dr. Peng Telecom & Media Group Co., Ltd. was founded in 1985 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "603220.SS": {
        "short_name": "CHINA BESTER GROUP TELECOM CO L",
        "long_name": "China Bester Group Telecom Co., Ltd.",
        "summary": "China Bester Group Telecom Co., Ltd. engages in the planning, design, construction, maintenance, and optimization of communications networks for telecom operators in China. It also provides communication and information services for enterprises and government. In addition, the company offers mobile communication network construction, switching and intelligent system network construction, optical network transmission line construction, and communication infrastructure engineering services; and technical consulting and network planning, and survey design services. Further, it provides computer technology development services; software development services; network technology research and development services; communication system technology services; and information electronic technology services. China Bester Group Telecom Co., Ltd. was founded in 1992 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Wuhan"
    },
    "603602.SS": {
        "short_name": "HANGZHOU FREELY COMMUNICATION C",
        "long_name": "Hangzhou Freely Communication Co., Ltd.",
        "summary": "Hangzhou Freely Communication Co., Ltd. provides communication network technology services in China. It offers indoor distribution system technical services; integrated access technology services; base station installation engineering services; antenna engineering services; and communication network services. The company provides its services to telecom operators. Hangzhou Freely Communication Co., Ltd. was founded in 2006 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "ANTE": {
        "short_name": "AirNet Technology Inc.",
        "long_name": "AirNet Technology Inc.",
        "summary": "AirNet Technology Inc. operates out-of-home advertising platforms in the People's Republic of China. The company operates a network of digital (television) TV screens on planes operated by 7 airlines; and gas station media network, as well as other outdoor media advertising platforms in gas stations. It also displays non-advertising content, such as weather, sports, comedy clips, local attractions, documentaries, commentaries, and reality shows. In addition, the company holds concession rights to install and operate Wi-Fi systems on railway administration bureaus, long-haul buses, and airlines; and operates advertising platforms, such as light boxes, billboards, and LED screens. Further, it operates CIBN-AirMedia channel to broadcast network TV programs to air travelers. The company was formerly known as AirMedia Group Inc. AirNet Technology Inc. was founded in 2005 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "CHWRF": {
        "short_name": "CHINA TOWER CORP LTD",
        "long_name": "China Tower Corporation Limited",
        "summary": "China Tower Corporation Limited provides telecommunication tower infrastructure services in the People's Republic of China. The company offers towers, and shelters or cabinets; and ancillary equipment to telecommunication services providers for installation of their telecommunications equipment. It also provides maintenance services, including monitoring equipment operation, routine inspection, device breakdown handling, property upkeep, working environment protection, and operation analysis services. In addition, the company offers power access, batteries, or back up power generation to the customers' telecommunications equipment; and indoor distributed antenna systems connecting telecommunication equipment, enabling them to receive and send indoor mobile telecommunication network signals, as well as mobile telecommunication network signals covering buildings, large venues, and tunnels. Further, it provides trans-sector site application and information services. The company was formerly known as China Communications Facilities Services Corporation Limited and changed its name to China Tower Corporation Limited in September 2014. China Tower Corporation Limited was incorporated in 2014 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "CMW.F": {
        "short_name": "CHINA CMNCTS SRVCS H YC 1",
        "long_name": "China Communications Services Corporation Limited",
        "summary": "China Communications Services Corporation Limited provides telecommunications support services worldwide. It offers telecommunications infrastructure services, including communications network consultation, planning, design, construction, and supervision for fixed-line, mobile, broadband networks, and supporting systems; construction services of ancillary communications networks; and integrated solutions for informatization, as well as intelligentization solutions of industries. The company also provides business process outsourcing services comprising network maintenance services that include fiber optic and electric cables, mobile base stations, network equipment, and terminals; property management services for customers data centers, cloud computing bases, commercial and residential buildings, high-speed railway stations, airports, etc.; and supply chain services, including logistics and transportation, warehousing and distribution, inspection service and tender agent, digital procurement, repair and disposition to domestic telecommunications operators, government, and enterprises customers. In addition, it offers applications, content, and other services, such as system integration, software development and system support, value-added, and other services. Further, the company provides submarine cable installation and other related services. It serves telecommunications operators; and non-telecom operator customers, such as government, construction, transportation, power, financial institutions, and broadcasting, as well as overseas customers. The company was founded in 2006 and is headquartered in Beijing, China. China Communications Services Corporation Limited is a subsidiary of China Telecommunications Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Beijing"
    }
}