{"002003.SZ": {"short_name": "ZHEJIANG WEIXING I", "long_name": "Zhejiang Weixing Industrial Development Co., Ltd.", "summary": "Zhejiang Weixing Industrial Development Co., Ltd. engages in research and development, production, and sale of clothing accessories in China and internationally. Its products include buttons, zippers, metal parts, and other clothing accessories used in clothing, textile, garment, and other supporting industries. The company is based in Linhai, China. Zhejiang Weixing Industrial Development Co., Ltd. is a subsidiary of Weixing Group Co., Ltd.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Linhai"}, "002029.SZ": {"short_name": "FUJIAN SEPTWOLVES", "long_name": "Fujian Septwolves Industry Co., Ltd.", "summary": "Fujian Septwolves Industry Co., Ltd. provides men's clothing products. It offers T-shirts, jackets, shirts, suits, trousers, and accessories under the Septwolves, Wolf Totem, 16N, and Karl Lagerfeld brands. The company also offers its products through online. In addition, it is involved in the finance, real estate, and investment businesses. The company was formerly known as Fujian Septwolves Garment Industry Co., Ltd. and changed its name to Fujian Septwolves Industry Co., Ltd. in July 2001. The company was founded in 1990 and is based in Jinjiang, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Jinjiang"}, "002154.SZ": {"short_name": "BAOXINIAO HOLDING", "long_name": "Baoxiniao Holding Co., Ltd.", "summary": "Baoxiniao Holding Co., Ltd. engages in the manufacture and sale of clothing products in China. Its products include men's suit, jackets, shirts, single pants, coats, suit pants, and vests. The company sells its products through approximately 1,500 sales outlets and online sales network. The company was founded in 2001 and is headquartered in Wenzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Wenzhou"}, "002269.SZ": {"short_name": "SH/METERSBONWE F&A", "long_name": "Shanghai Metersbonwe Fashion and Accessories Co., Ltd.", "summary": "Shanghai Metersbonwe Fashion and Accessories Co., Ltd. researches, designs, develops, produces, and distributes casual wear products in the People's Republic of China. The company is also involved in the franchisee distribution activity. It offers its products under the Metersbonwe, ME&CITY, MooMmoo, Me&City Kids, and CH'IN brand names. The company was founded in 1933 and is based in Shanghai, the People's Republic of China. Shanghai Metersbonwe Fashion and Accessories Co., Ltd. operates as a subsidiary of Shanghai Huafu Investment Ltd.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shanghai"}, "002404.SZ": {"short_name": "ZHEJIANG JIAXIN SI", "long_name": "Zhejiang Jiaxin Silk Corp., Ltd.", "summary": "Zhejiang Jiaxin Silk Corp., Ltd. manufactures and sells silk fabrics and garments, and other silk-related products. It is involved in cocoon purchasing and drying, throwing, fabric manufacturing, and printing and dyeing, as well as the manufacture and export of garments primarily under the brand names of BCBG, Max Studio, Michael Kors, UESS, Armani Exchange, Mac & Jac, Marmaxx, Buffalo, Massimo Dutti, Zara, Max & Co., Bimba & Lola, French Connection, Lindex, Kookai, Marc Jacobs, Cavalli, Trussardi, etc. in Europe, the United States, Japan, and internationally. The company is based in Jiaxing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Jiaxing"}, "002485.SZ": {"short_name": "SINOER MENS WEAR C", "long_name": "Sinoer Men's Wear Co., Ltd.", "summary": "Sinoer Men's Wear Co., Ltd. designs, produces, and sells clothing products primarily in China. Its products include men's suits, shirts, and coats; T-shirts, jackets, and long-sleeved shirts; and women's coats. The company was formerly known as Zhucheng Pulanniao Clothing Co., Ltd. Sinoer Men's Wear Co., Ltd. was founded in 2003 and is based in Zhucheng, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Zhucheng"}, "002494.SZ": {"short_name": "HUASI HOLDING COMP", "long_name": "Huasi Holding Company Limited", "summary": "Huasi Holding Company Limited manufactures and sells fur and leather clothing and accessories in China. It also operates stores. The company was formerly known as Huasi Agricultural Development Company Limited and changed its name to Huasi Holding Company Limited in June 2015. Huasi Holding Company Limited is based in Cangzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Cangzhou"}, "002503.SZ": {"short_name": "SOUYUTE GROUP CO", "long_name": "Souyute Group Co.,Ltd", "summary": "Souyute Group Co.,Ltd. engages in the research, design, development, marketing, and brand promotion of apparel products. It provides casual wear and leisure apparel products under the CELUCASN brand. The company operates approximately 2,000 clothing stores. It also provides supply chain management, brand management, and commercial factoring, etc. The company was founded in 2005 and is based in Dongguan, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Dongguan"}, "002563.SZ": {"short_name": "ZHEJIANG SEMIR GAR", "long_name": "Zhejiang Semir Garment Co., Ltd.", "summary": "Zhejiang Semir Garment Co., Ltd. produces and sells casual wear and children's wear in China. The company offers infants and young children's apparel; and children's shoes, underwear, and accessories. It offers its products under the Senma, Balabala, TCP, MarColor, IT MICHAA, Sarabanda, Kidiliz, Brother to buy, Marc O'Polo, GSON, UTB, and COCOTREE brands. The company offers its products through stores and online. Zhejiang Semir Garment Co., Ltd. was founded in 1996 and is based in Shanghai, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shanghai"}, "002569.SZ": {"short_name": "ZHEJIANG BUSEN GAR", "long_name": "Zhejiang Busen Garments Co., Ltd.", "summary": "Zhejiang Busen Garments Co., Ltd. designs, manufactures, and distributes men's wear, casual wear, and accessories in China and internationally. The company's products include suits, shirts, trousers, jackets and accessories, uniform, etc. It serves banks, telecoms, police, airlines, financial institutions, and government clients. The company was founded in 1985 and is based in Zhuji, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Zhuji"}, "002612.SZ": {"short_name": "LANCY CO LTD", "long_name": "Lancy Co., Ltd.", "summary": "Lancy Co., Ltd. provides women's wear in China and internationally. The company offers women's wear under the LANCY FROM25, MOJO.S.PHINE, LIME FLARE, marie n mary, JIGOTT, liaalancy, FABIANA FILIPPI, and DeWL brand names. It also provides clothes for the infants and kids under the Agabang brand; and cosmetics under the BRAVOU, FRESKIN, and Gonice brand names. The company markets its products through stores, as well as online. Lancy Co., Ltd. is based in Beijing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Beijing"}, "002634.SZ": {"short_name": "ZHEJIANG BANGJIE H", "long_name": "Zhejiang Bangjie Holding Group Co., Ltd.", "summary": "Zhejiang Bangjie Holding Group Co.,Ltd. researches and develops, designs, weaves, markets, and sells garments in China and internationally. It offers sportswear, casual clothes, and underwear series of products. The company was formerly known as Zhejiang Bangjie Digital Knitting Share Co., Ltd. Zhejiang Bangjie Holding Group Co.,Ltd. was founded in 2008 and is based in Yiwu, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Yiwu"}, "002687.SZ": {"short_name": "ZHEJIANG GIUSEPPE", "long_name": "Zhejiang Giuseppe Garment Co., Ltd", "summary": "Zhejiang Giuseppe Garment Co., Ltd. manufactures and sells apparel in China. The company offers men's suits, coats, and shirts under the G73, JZZ, and G52 brands. It also provides uniforms under the GIUSEPPE brand. The company serves finance, energy, communications, electricity, tobacco, and other industries. Zhejiang Giuseppe Garment Co., Ltd. was founded in 1989 and is based in Pingyang, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Pingyang"}, "002699.SZ": {"short_name": "MEISHENG CULTURAL", "long_name": "Meisheng Cultural & Creative Corp., Ltd.", "summary": "Meisheng Cultural & Creative Corp., Ltd. engages in the design and development of IP derivatives, animation, games, film, television, etc. in China. It also offers content production, distribution; and other cultural products and services, such as light gaming service platform services. The company was founded in 2002 and is headquartered in Hangzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "002762.SZ": {"short_name": "JINFA LABI MATERNI", "long_name": "Jinfa Labi Maternity & Baby Articles Co., Ltd", "summary": "Jinfa Labi Maternity & Baby Articles Co., Ltd. engages in the design, research and development, production, and sale of infant and toddler cotton clothing and consumer products in China. It offers LABI BABY, a brand that targets mid-to-high-end infant and toddler consumer goods market with product categories ranging from apparel cotton to maternal and infant daily necessities; I LOVE BABY, a mid-range infant consumer brand for apparel cotton; and BABY LABI brand that offers baby care products made from plant-derived raw materials. The company markets and sells its products through a network of approximately 1,400 brand stores. Jinfa Labi Maternity & Baby Articles Co., Ltd. was founded in 1996 and is based in Shantou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shantou"}, "002776.SZ": {"short_name": "GUANGDONG BOBAOLON", "long_name": "Guangdong Bobaolon Co.,Ltd.", "summary": "Guangdong Bobaolon Co.,Ltd., together with its subsidiaries, engages in the apparel design, fabric research and development, and organization production activities in China and internationally. It also provides industrial chain, capital, and training and education support services to designers; and integrates buyers, materials suppliers, ready-to-wear production enterprises, and consumers. The company was formerly known as Puning Bobaolon Clothing Co., Ltd. and changed its name to Guangdong Bobaolon Co.,Ltd. in April 2009. Guangdong Bobaolon Co.,Ltd. was founded in 2006 and is headquartered in Puning, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Puning"}, "002832.SZ": {"short_name": "BIEM L FDLKK GARME", "long_name": "BIEM.L.FDLKK Garment Co.,Ltd.", "summary": "BIEM.L.FDLKK Garment Co.,Ltd. engages in the research and development, brand promoting, and marketing of golf apparel in China. It offers products in life, fashion, golf, and holiday travel series categories under the Biyinlefin brand name. The company operates 600 terminal stores primarily in shopping malls, airports, golf clubs, etc. The company was founded in 2003 and is headquartered in Guangzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Guangzhou"}, "0540.HK": {"short_name": "SPEEDY GLOBAL", "long_name": "Speedy Global Holdings Limited", "summary": "Speedy Global Holdings Limited, an investment holding company, engages in the provision of apparel supply chain services in the People's Republic of China. Its apparel supply chain services include product design and development, fashion trend ascertaining and sampling, raw material sourcing, production order and merchandise sourcing management, quality control, packaging, inventory management, and logistics management for the production of a range of men's and women's woven wear, cut-and-sewn knitwear, and sweater knitwear products to owners or agents of various apparel brands. The company was founded in 2003 and is headquartered in Dongguan, the People's Republic of China. Speedy Global Holdings Limited is a subsidiary of Sky Halo Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Dongguan"}, "1234.HK": {"short_name": "CHINA LILANG", "long_name": "China Lilang Limited", "summary": "China Lilang Limited, together with its subsidiaries, engages in the manufacture and wholesale of branded menswear and related accessories in the People's Republic of China. The company designs, sources, manufactures, and sells business and casual apparel for men under the LILANZ brand name across a distribution network covering 31 provinces, autonomous regions, and municipalities. It also provides management services. As of December 31, 2019, it had a total of 2,815 retail stores operated through distributors and sub-distributors. The company was founded in 1987 and is headquartered in Jinjiang, the People's Republic of China. China Lilang Limited is a subsidiary of Xiao Sheng International Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Jinjiang"}, "1247.HK": {"short_name": "MIKO INTL", "long_name": "Miko International Holdings Limited", "summary": "Miko International Holdings Limited engages in the design, manufacture, and sale of children's and infant apparel, footwear, and accessories primarily in Mainland China. The company sells its products through distributors; and self-operated stores under the redkids brand. As of December 31, 2019, it had 28 self-operated stores. The company was incorporated in 2013 and is headquartered in Quanzhou, the People's Republic of China. Miko International Holdings Limited is a subsidiary of Think Wise Holdings Investment Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Quanzhou"}, "1425.HK": {"short_name": "JUSTIN ALLEN H", "long_name": "Justin Allen Holdings Limited", "summary": "Justin Allen Holdings Limited, an investment holding company, manufactures and sells sleepwear and loungewear products, and greige fabrics. The company also provides men's and women's casualwear, and processing services. It operates in the People's Republic of China, the Unites States, the United Kingdom, Ireland, Spain, Canada, and Cambodia. The company was founded in 1983 and is headquartered in Shanghai, the People's Republic of China. Justin Allen Holdings Limited is a subsidiary of Strategic King Holdings Limited.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Shanghai"}, "1532.HK": {"short_name": "CHINA PARTYTIME", "long_name": "China Partytime Culture Holdings Limited", "summary": "China Partytime Culture Holdings Limited, an investment holding company, designs, develops, produces, markets, and sells cosplay products and lingerie in the People's Republic of China. The company operates through Wigs, Clothing and Others, and Leasing of Factory Premises segments. It offers roleplaying products, which include party costumes and roleplaying clothes, and wigs inspired by animation characters comprising popular animation, comics, cartoons, traditional fairy tales, films, games, and party, as well as Halloween and Christmas holiday themes, as well as underwear. The company markets its products under the Party Time, Secret Temptation, and Styler brand names. It also exports its products to approximately 20 countries and regions, including the United States, Germany, the United Kingdom, and Australia. The company was formerly known as China Animation Culture Group Holding Co., Ltd. and changed its name to China Partytime Culture Holdings Limited in April 2015. China Partytime Culture Holdings Limited was founded in 2004 and is headquartered in Yichun, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Yichun"}, "1749.HK": {"short_name": "SHANSHAN", "long_name": "Shanshan Brand Management Co., Ltd.", "summary": "Shanshan Brand Management Co., Ltd. engages in the design, marketing, and sale of formal and casual business menswear in the People's Republic of China. The company primarily offers its products under the Firs, Shanshan, and Lubiam brand names. As of December 31, 2019, it had 1,280 retail outlets operated by its distributors and franchisees, as well as self-operated. The company is also involved in the sub-licensing of trademark. The company was founded in 1989 and is headquartered in Ningbo, the People's Republic of China. Shanshan Brand Management Co., Ltd. is a subsidiary of Ningbo Shanshan Co., Ltd.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Ningbo"}, "2030.HK": {"short_name": "CABBEEN", "long_name": "Cabbeen Fashion Limited", "summary": "Cabbeen Fashion Limited, a fashion casual menswear company, engages in the design, wholesale, and retail of menswear and related accessories in the People's Republic of China. The company offers apparel, shoes, and accessories for men, women, and children under the Cabbeen, Cabbeen Urban, Cabbeen Love, and 2AM brands. As of December 31, 2019, it operated approximately 887 retail shops through a network of 6 wholesale distributors, 19 consignment distributors, and 135 sub distributors. The company also sells its products through online shops, such as T-mall, JD.com, WeChat mall, and vipshop, as well as franchise stores; and a wholesale and consignment basis to other online distributors. It is also involved in the real estate development and trademark holding activities. The company is headquartered in Guangzhou, China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Guangzhou"}, "2298.HK": {"short_name": "COSMO LADY", "long_name": "Cosmo Lady (China) Holdings Company Limited", "summary": "Cosmo Lady (China) Holdings Company Limited, an investment holding company, engages in the design, research, development, and sale of branded intimate wear products in the PeopleÂ\u0091s Republic of China. It offers bras, underpants, sleepwear and loungewear, and thermal clothes, as well as other products, such as leggings and tights, vests, hosiery, and accessories under the Cosmo Lady, Cosmo Elegance, Cosmo Blossom, Cosmo Esquire, Secret of City Beauty, Freeday, Rubii, IlsÃ©e, Ordifen, and Ordifen+ brands. The company also provides corporate consulting services. As of December 31, 2019, it operated a network of 5,970 stores, including 1,269 self-managed stores, and 4,701 franchised stores. The company was founded in 1998 and is headquartered in Dongguan, China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Dongguan"}, "2399.HK": {"short_name": "FORDOO", "long_name": "China Fordoo Holdings Limited", "summary": "China Fordoo Holdings Limited designs, sources, manufactures, and wholesales a range of menswear products under the FORDOO brand in the People's Republic of China. It offers men's trousers, tops, and blazers, as well as accessories. The company sells its products on a wholesale basis to third-party distributors and online distributors, as well as through self-operated retail outlets. As of December 31, 2019, it had 498 retail outlets, including 2 self-operated retail stores located in Quanzhou and 28 self-operated retail outlets located in Beijing. The company was incorporated in 2013 and is headquartered in Quanzhou, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Quanzhou"}, "300840.SZ": {"short_name": "QINGDAO KUTESMART", "long_name": "Qingdao Kute Smart Co Ltd.", "summary": "Qingdao Kute Smart Co Ltd. manufactures and sells men's and women's wear in China and internationally. It also operates stores. The company was founded in 2007 and is based in Qingdao, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Qingdao"}, "3306.HK": {"short_name": "JNBY", "long_name": "JNBY Design Limited", "summary": "JNBY Design Limited, together with its subsidiaries, engages in the design, marketing, retail, and sale of fashion apparels, accessory products, and household goods in Mainland China, Hong Kong, Taiwan, and internationally. It offers contemporary apparel, footwear, and accessories for women, men, and children, as well as household products under the JNBY, CROQUIS, jnby by JNBY, less, Pomme de terre, JNBYHOME, REVERB, and PERSONAL NOTE 73 brands. As of June 30, 2020, the company operated 1,855 retail stores. It also offers its products through online and social media interactive marketing service platforms. The company was formerly known as Croquis Investment Limited and changed its name to JNBY Design Limited in June 2016. JNBY Design Limited was founded in 1994 and is headquartered in Hangzhou, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Hangzhou"}, "3709.HK": {"short_name": "EEKA FASHION", "long_name": "EEKA Fashion Holdings Limited", "summary": "EEKA Fashion Holdings Limited, together with its subsidiaries, engages in the design, promotion, marketing, and sale of self-owned branded ladies' wear products in the People's Republic of China. It offers dresses, skirts, trousers, shirts, knitwear, vests, jackets, overcoats, scarves, and accessories under the Koradior, La Koradior, Koradior elsewhere, and De Kora brand names. The company offers its products through retail stores and third party e-commerce platforms; and distributors, as well as direct sales through promotional activities. As of December 31, 2018, it had 862 retail stores. The company was formerly known as Koradior Holdings Limited and changed its name to EEKA Fashion Holdings Limited in June 2019. The company was founded in 2007 and is headquartered in Shenzhen, China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Shenzhen"}, "3FU1.F": {"short_name": "FUXING CHINA GRP  SD 5", "long_name": "Fuxing China Group Limited", "summary": "Fuxing China Group Limited, an investment holding company, manufactures and markets zipper products in the People's Republic of China. The company operates through Zippers, Processing, and Trading segments. It offers zipper chains and sliders; provides processing services, such as color dyeing of fabric tapes for zippers, and electroplating services for zipper sliders; manufactures and sells dyed yarns; and trades in raw materials, including rubber threads, nylon fabrics, and nylon yarn. The company is also involved in the real estate development activities. Fuxing China Group Limited sells its zipper products primarily to manufacturers of apparels, shoes, bags, and camping equipment. The company also exports its zipper products to Australia, the European Union, Russia, Turkey, Korea, Thailand, Vietnam, Indonesia, and other countries. Fuxing China Group Limited was founded in 1993 and is headquartered in Jinjiang, the People's Republic of China.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Jinjiang"}, "5LX.F": {"short_name": "CHINA LILANG  REGS HD-,10", "long_name": "China Lilang Limited", "summary": "China Lilang Limited, together with its subsidiaries, engages in the manufacture and wholesale of branded menswear and related accessories in the People's Republic of China. The company designs, sources, manufactures, and sells business and casual apparel for men under the LILANZ brand name across a distribution network covering 31 provinces, autonomous regions, and municipalities. It also provides management services. As of December 31, 2019, it had a total of 2,815 retail stores operated through distributors and sub-distributors. The company was founded in 1987 and is headquartered in Jinjiang, the People's Republic of China. China Lilang Limited is a subsidiary of Xiao Sheng International Limited.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Jinjiang"}, "600107.SS": {"short_name": "HUBEI MAILYARD SHARE CO LTD", "long_name": "Hubei Mailyard Share Co.,Ltd", "summary": "Hubei Mailyard Share Co., Ltd. manufactures, processes, and sells fine wool textile products, garments, and accessories in China and internationally. The company is based in Huangshi, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Huangshi"}, "600137.SS": {"short_name": "SICHUAN LANGSHA HOLDING LTD.", "long_name": "Sichuan Langsha Holding Ltd.", "summary": "Sichuan Langsha Holding Ltd. designs, develops, manufactures, produces, and sells knitted cotton and apparels in China, rest of Asia, the United States, Europe, and the Middle East. It offers spring and summer stockings; medical, men, women, children, and sports socks; and knitted underwear, clothing ties, medical and sanitary materials and dressings, cotton products, and knitted fabrics. The company also provides skin care products. Sichuan Langsha Holding Ltd. sells its products through approximately 2,000 specialty stores; 100,000 sales terminal outlets; and online. The company was formerly known as Sichuan Changjiang Packaging Holding Co., Ltd. Sichuan Langsha Holding Ltd. was founded in 1995 and is based in Yibin, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Yibin"}, "600241.SS": {"short_name": "LIAONING SHIDAI WANHENG CO. LTD", "long_name": "Liaoning Shidai Wanheng Co.,Ltd.", "summary": "Liaoning Shidai Wanheng Co.,Ltd. imports and exports clothing and apparel products. The company offers its clothing products under the bee and butterfly trademarks. It is also involved in the provision of clothing processing, fabric printing and dyeing, and freight forwarding services. In addition, the company engages in the development and sale of real estate properties; and equity investment activities. The company sells its products to approximately 60 countries and regions, including Europe, the United States, Japan, and Southeast Asia. The company was formerly known as Liaoning Clothing Import and Export Company. The company was founded in 1955 and is based in Dalian, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Dalian"}, "600398.SS": {"short_name": "HLA CORP LTD", "long_name": "HLA CORP., Ltd.", "summary": "HLA CORP., Ltd., a garment company, manufactures and sells suits and professional clothing products. The company offers men's, women's, and children's clothing, as well as accessories and home furniture. It provides its clothing products under the brands, such as HLA, Sancanal, EICHITOO, EICHITOO KIDS, HLA JEANS, Heilan Home, AEX, and OVV. The company was formerly known as Heilan Home Co., Ltd. and changed its name to HLA CORP., Ltd. in March 2018. HLA CORP., Ltd., was founded in 1997 and is based in Jiangyin, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Jiangyin"}, "600400.SS": {"short_name": "JIANGSU HONGDOU INDUSTRY", "long_name": "Jiangsu Hongdou Industrial Co., Ltd", "summary": "Jiangsu Hongdou Industrial Co., Ltd manufactures and sells clothing products. The company's clothing products include men's suits, shirts, T-shirts, jackets, trousers, and sweaters. The company was founded in 1995 and is based in Wuxi, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Wuxi"}, "601566.SS": {"short_name": "JOEONE CO LTD", "long_name": "Joeone Co., Ltd.", "summary": "Joeone Co., Ltd. manufactures and sells men's business and casual wear under the JOEONE brand in China. The company offers trousers, jackets, suits, etc. The company is headquartered in Quanzhou, China. JOEONE Co., Ltd. is a subsidiary of Joeone International Investments Holdings Limited.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Quanzhou"}, "603196.SS": {"short_name": "RIBO FASHION GROUP CO LTD", "long_name": "Ribo Fashion Group Co., Ltd.", "summary": "Ribo Fashion Group Co., Ltd. designs and sells clothing products for women in China. The company offers women's wear under the Broadcast, Personal Point, and TAORAY WANG brands. Ribo Fashion Group Co., Ltd. was founded in 1997 and is headquartered in Shanghai, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "603518.SS": {"short_name": "JINHONG FASHION GROUP CO LTD", "long_name": "Jinhong Fashion Group Co., Ltd.", "summary": "Jinhong Fashion Group Co., Ltd. engages in the design, production, and sale of women's apparel products. The company offers woven apparel products, which include dresses, pants, jackets, shirts, coats, half skirts, cotton-padded clothes, down coats, and windbreakers; knitwear products, such as sweater coats, and sweater dresses and jackets; and accessories, including bags, jewelry, and scarves. It also provides shoes, hats, and synthetic leather and fur products. V-Grass Fashion Co.,Ltd. offers its clothing products and accessories under the V-Grass brand name. The company operates in Taiwan, Hong Kong, Macau, and China. As of June 30, 2014, it operated 356 boutiques. The company was formerly known as V-Grass Fashion Co.,Ltd. and changed its name to Jinhong Fashion Group Co., Ltd. in June 2019. Jinhong Fashion Group Co., Ltd. was founded in 2003 and is based in Nanjing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Nanjing"}, "603557.SS": {"short_name": "QIBU CO LTD", "long_name": "Qibu Co.,Ltd.", "summary": "Qibu Co.,Ltd. engages in the design, development, production, and sale of children's shoes, children's wear, and children's clothing accessories under the ABC KIDS brand name primarily in China. It also operates approximately 2,000 sales outlets. The company is based in Lishui, China. As of October 28, 2020, Qibu Co.,Ltd. operates as a prior subsidiary of Hong Kong Qibu International Group Limited.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Lishui"}, "603558.SS": {"short_name": "ZHEJIANG JASAN HOLDING GROUP CO", "long_name": "Zhejiang Jasan Holding Group Co., Ltd.", "summary": "Zhejiang Jasan Holding Group Co., Ltd. engages in the research, design, development, manufacture, and service of knitwear in China. The company offers cotton socks, stockings, underwear, and briefs. It also exports its products to international markets, including Japan, Europe, and Australia. The company was founded in 1994 and is based in Hangzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "603587.SS": {"short_name": "DAZZLE FASHION CO LTD", "long_name": "Dazzle Fashion Co., Ltd", "summary": "Dazzle Fashion Co., Ltd. designs and develops women's wear in China and internationally. It offers coats, pants, skirts, and other women's wear directly, as well as through dealership and online channels. As of December 31, 2018, the company had 1,062 retail outlets, including 378 direct terminals and 684 dealers. The company was formerly known as Shanghai Dazzle Business Trading Company Limited and changed its name to Dazzle Fashion Co., Ltd. in May 2013. Dazzle Fashion Co., Ltd. was founded in 2002 and is based in Shanghai, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "603665.SS": {"short_name": "ZHEJIANG KANGLONGDA SPECIAL PRO", "long_name": "ZheJiang KangLongDa Special Protection Technology Co., Ltd", "summary": "ZheJiang KangLongDa Special Protection Technology Co., Ltd. designs, develops, produces, and sells labor protective solutions primarily in Europe, the United States, and Japan. The company offers various gloves, such as wear-resistant, cut-resistant, tear-resistant, impact-resistant, chemical-resistant, anti-static, heat- and cold-resistant gloves, as well as other functional labor protective gloves used in construction, power, electronics, automobile, machinery manufacturing, metallurgy, petrochemical, mining, and other industries. It also provides labor protection gloves, glasses, shoes, hats, clothing, etc. The company was formerly known as Shangyu Dongda knit Co.,Ltd. ZheJiang KangLongDa Special Protection Technology Co., Ltd. was founded in 2000 and is based in Shaoxing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shaoxing"}, "603808.SS": {"short_name": "SHENZHEN ELLASSAY FASHION CO LT", "long_name": "Shenzhen Ellassay Fashion Co., Ltd.", "summary": "Shenzhen Ellassay Fashion Co., Ltd. designs, produces, and sells branded women's clothing in China and internationally. It offers products under the ELLASSAY, LAURÃ\u0088L, IRO PARIS, ED HARDY, and VIVIENNE TAM brand names through its retail outlets. The company has a strategic alliance with The Carlyle Group. The company was founded in 1996 and is based in Shenzhen, China. Shenzhen Ellassay Fashion Co., Ltd. is a subsidiary of Shenzhen Ellassay Investment Management Ltd.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shenzhen"}, "603839.SS": {"short_name": "ANZHENG FASHION GROUP CO LTD", "long_name": "Anzheng Fashion Group Co., Ltd.", "summary": "Anzheng Fashion Group Co., Ltd. engages in the research and development, production, and brand management of apparel in China. The company sells its products under the JZ, IMM, Anzheng, MOISSAC, and FIONACHEN brand names. The company was formerly known as Zhejiang Haozi Industrial Co., Ltd. and changed its name to Anzheng Fashion Group Co., Ltd. in July 2010. Anzheng Fashion Group Co., Ltd. was founded in 1998 and is based in Haining, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Haining"}, "603908.SS": {"short_name": "COMEFLY OUTDOOR CO LTD", "long_name": "Comefly Outdoor Co., Ltd.", "summary": "Comefly Outdoor Co., Ltd. engages in the research, design, and sale of outdoor products in China. It offers outdoor sports and camping equipment, clothing, shoes, backpacks, and RV camping products. The company is based in Quzhou, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Quzhou"}, "7MK.F": {"short_name": "MIKO INTL HLDGS  HD-,01", "long_name": "Miko International Holdings Limited", "summary": "Miko International Holdings Limited engages in the design, manufacture, and sale of children's and infant apparel, footwear, and accessories primarily in Mainland China. The company sells its products through distributors; and self-operated stores under the redkids brand. As of December 31, 2019, it had 28 self-operated stores. The company was incorporated in 2013 and is headquartered in Quanzhou, the People's Republic of China. Miko International Holdings Limited is a subsidiary of Think Wise Holdings Investment Limited.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Quanzhou"}, "AWK.SI": {"short_name": "Fuxing China", "long_name": "Fuxing China Group Limited", "summary": "Fuxing China Group Limited, an investment holding company, manufactures and markets zipper products in the People's Republic of China. The company operates through Zippers, Processing, and Trading segments. It offers zipper chains and sliders; provides processing services, such as color dyeing of fabric tapes for zippers, and electroplating services for zipper sliders; manufactures and sells dyed yarns; and trades in raw materials, including rubber threads, nylon fabrics, and nylon yarn. The company is also involved in the real estate development activities. Fuxing China Group Limited sells its zipper products primarily to manufacturers of apparels, shoes, bags, and camping equipment. The company also exports its zipper products to Australia, the European Union, Russia, Turkey, Korea, Thailand, Vietnam, Indonesia, and other countries. Fuxing China Group Limited was founded in 1993 and is headquartered in Jinjiang, the People's Republic of China.", "currency": "SGD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "SES", "market": "sg_market", "country": "China", "city": "Jinjiang"}, "CDGXF": {"short_name": "CHINA DONGXIANG (GROUP) CO LTD", "long_name": "China Dongxiang (Group) Co., Ltd.", "summary": "China Dongxiang (Group) Co., Ltd., together with its subsidiaries, designs, develops, markets, and sells sport-related apparel, footwear, and accessories in the People's Republic of China, Japan, and internationally. The company offers its products under the Kappa, Phenix, X-NIX, and INHABITANT brands. It is also involved in the retail sale of sportswear through a network of retail shops and outlets, as well as online. In addition, the company invests in various financial assets and treasury products issued by commercial banks; and designs, purchases, and sells children's clothing products, as well as engages in the import and export, and purchasing and selling of company activities. As of March 31, 2020, it had 1,372 Kappa retail stores, including 243 Kappa Kid's stores. China Dongxiang (Group) Co., Ltd. was founded in 2002 and is headquartered in Beijing, the People's Republic of China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}, "CDGXY": {"short_name": "CHINA DONGXIANG (GROUP) CO LTD", "long_name": "China Dongxiang (Group) Co., Ltd.", "summary": "China Dongxiang (Group) Co., Ltd., together with its subsidiaries, designs, develops, markets, and sells sport-related apparel, footwear, and accessories in the People's Republic of China, Japan, and internationally. The company offers its products under the Kappa, Phenix, X-NIX, and INHABITANT brands. It is also involved in the retail sale of sportswear through a network of retail shops and outlets, as well as online. In addition, the company invests in various financial assets and treasury products issued by commercial banks; and designs, purchases, and sells children's clothing products, as well as engages in the import and export, and purchasing and selling of company activities. As of March 31, 2020, it had 1,372 Kappa retail stores, including 243 Kappa Kid's stores. China Dongxiang (Group) Co., Ltd. was founded in 2002 and is headquartered in Beijing, the People's Republic of China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}, "CFO.F": {"short_name": "CHINA OUTFITTERS H. HD-10", "long_name": "China Outfitters Holdings Limited", "summary": "China Outfitters Holdings Limited, an investment holding company, designs, manufactures, markets, and sells apparels and accessories in the People's Republic of China. It offers men's casual wear, including smart casual wear, outdoor casual wear, leisure wear, and accessories under licensed and self-owned brands targeting consumers in the mid-to-high income bracket. The company also offers womenswear and accessories. Its licensed brands include Barbour, Jeep, Santa Barbara Polo & Racquet Club, Maxim's, Sideout, and Koyo Jeans; self-owned brands comprise Artful Dodger, Doright, London Fog, Zoo York, and MCS; and joint venture brands include Henry Cotton's, Marina Yachting, LINCS, and Manhattan. In addition, it develops, operates, and manages properties; and sells software products. As of December 31, 2019, the company's sales network included 543 self-operated retail points and 298 retail points operated by third-party retailers. The company was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Shanghai"}, "CPY.F": {"short_name": "COSMO LADY CHINA  DL-,01", "long_name": "Cosmo Lady (China) Holdings Company Limited", "summary": "Cosmo Lady (China) Holdings Company Limited, an investment holding company, engages in the design, research, development, and sale of branded intimate wear products in the PeopleÂ\u0091s Republic of China. It offers bras, underpants, sleepwear and loungewear, and thermal clothes, as well as other products, such as leggings and tights, vests, hosiery, and accessories under the Cosmo Lady, Cosmo Elegance, Cosmo Blossom, Cosmo Esquire, Secret of City Beauty, Freeday, Rubii, IlsÃ©e, Ordifen, and Ordifen+ brands. The company also provides corporate consulting services. As of December 31, 2019, it operated a network of 5,970 stores, including 1,269 self-managed stores, and 4,701 franchised stores. The company was founded in 1998 and is headquartered in Dongguan, China.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Dongguan"}, "E4GA.F": {"short_name": "EVER-GLORY INTL NEW", "long_name": "Ever-Glory International Group, Inc.", "summary": "Ever-Glory International Group, Inc., together with its subsidiaries, manufactures, supplies, and retails apparel in Mainland China, Hong Kong, Germany, the United Kingdom, Europe, Japan, and the United States. It operates in two segments, Wholesale and Retail. The company primarily offers casual wear, outerwear, and sportswear. Its products include coats, jackets, slacks, skirts, shirts, trousers, and jeans for women; vests, jackets, trousers, skiwear, shirts, coats, and jeans for men; and coats, vests, down jackets, trousers, knitwear, and jeans for children. The company offers its woman apparel under the La go go, Velwin, Sea To Sky, and idole brands. It also engages in the import and export of apparel, fabric, and accessories. The company provides its products directly to consumers through retail stores, as well as online stores at Tmall, Dangdang mall, JD.com, VIP.com, etc. As of December 31, 2019, it operated 1,101 stores, which included 131 flagship stores located in approximately 20 provinces in China. The company is based in Nanjing, China.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Nanjing"}, "EVK": {"short_name": "Ever-Glory International Group,", "long_name": "Ever-Glory International Group, Inc.", "summary": "Ever-Glory International Group, Inc., together with its subsidiaries, manufactures, supplies, and retails apparel in Mainland China, Hong Kong, Germany, the United Kingdom, Europe, Japan, and the United States. It operates in two segments, Wholesale and Retail. The company primarily offers casual wear, outerwear, and sportswear. Its products include coats, jackets, slacks, skirts, shirts, trousers, and jeans for women; vests, jackets, trousers, skiwear, shirts, coats, and jeans for men; and coats, vests, down jackets, trousers, knitwear, and jeans for children. The company offers its woman apparel under the La go go, Velwin, Sea To Sky, and idole brands. It also engages in the import and export of apparel, fabric, and accessories. The company provides its products directly to consumers through retail stores, as well as online stores at Tmall, Dangdang mall, JD.com, VIP.com, etc. As of December 31, 2019, it operated 1,101 stores, which included 131 flagship stores located in approximately 20 provinces in China. The company is based in Nanjing, China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Nanjing"}, "JNBYF": {"short_name": "JNBY DESIGN LTD", "long_name": "JNBY Design Limited", "summary": "JNBY Design Limited, together with its subsidiaries, engages in the design, marketing, retail, and sale of fashion apparels, accessory products, and household goods in Mainland China, Hong Kong, Taiwan, and internationally. It offers contemporary apparel, footwear, and accessories for women, men, and children, as well as household products under the JNBY, CROQUIS, jnby by JNBY, less, Pomme de terre, JNBYHOME, REVERB, and PERSONAL NOTE 73 brands. As of June 30, 2020, the company operated 1,855 retail stores. It also offers its products through online and social media interactive marketing service platforms. The company was formerly known as Croquis Investment Limited and changed its name to JNBY Design Limited in June 2016. JNBY Design Limited was founded in 1994 and is headquartered in Hangzhou, the People's Republic of China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Hangzhou"}, "KBP.F": {"short_name": "KBS FASHION GRP  DL-,0001", "long_name": "KBS Fashion Group Limited", "summary": "KBS Fashion Group Limited, a casual menswear company, designs, markets, and sells fashion menswear products in the People's Republic of China. The company operates through three segments: Distribution Network, Corporate Stores, and OEM. It offers apparel products, including cotton and down jackets, sweaters, suits, shirts, T-shirts, jeans, and trousers; accessories, such as shoes, bags, belts, socks, and caps; and footwear for urban males between the ages of 20 and 40 under the KBS brand name. As of December 31, 2019, the company operated 1 corporate store and 29 franchised stores. The company is headquartered in Shishi, the People's Republic of China.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Shishi"}, "KBSF": {"short_name": "KBS Fashion Group Limited", "long_name": "KBS Fashion Group Limited", "summary": "KBS Fashion Group Limited, a casual menswear company, designs, markets, and sells fashion menswear products in the People's Republic of China. The company operates through three segments: Distribution Network, Corporate Stores, and OEM. It offers apparel products, including cotton and down jackets, sweaters, suits, shirts, T-shirts, jeans, and trousers; accessories, such as shoes, bags, belts, socks, and caps; and footwear for urban males between the ages of 20 and 40 under the KBS brand name. As of December 31, 2019, the company operated 1 corporate store and 29 franchised stores. The company is headquartered in Shishi, the People's Republic of China.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "NMS", "market": "us_market", "country": "China", "city": "Shishi"}}