{
    "000030.SZ": {
        "short_name": "FAWER AUTOMOTIVE P",
        "long_name": "FAWER Automotive Parts Limited Company",
        "summary": "FAWER Automotive Parts Limited Company manufactures and sells automotive parts and components of environment control systems, chassis systems, steering and transmission systems, safety systems, engine accessory systems, etc. in China. The company offers climate control systems; steering and driving systems; engine accessory systems, such as differential locks, electric fuel pumps, oil pumps, clutch master cylinders, water pumps, and throttle bodies; chassis accessory systems, including engine beam, sub-bracket, rear axis welding, control arm, front frame, and oil pan assembly systems; and suspension and running systems comprising subframe-passenger, leaf spring commercial trucks, rear suspension passenger, passenger strut assemblies, shock absorbers for commercial vehicles, coil springs, torque rods, and control arm assemblies; braking systems; and other products consisting of fasteners, airbags, body control modules, grip brakes, torsion bars, brake camshafts, wiring harnesses, sun visors, gear controls, and automotive instrument clusters. It also exports its products to the United States, France, Italy, South Korea, Japan, and countries in the Middle East. The company was formerly known as Fawer Automotive Parts Company Ltd. and changed its name to FAWER Automotive Parts Limited Company in December 2007. FAWER Automotive Parts Limited Company is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130033",
        "website": "http://www.fawer.com.cn",
        "market_cap": 12105415680
    },
    "000559.SZ": {
        "short_name": "WANXIANG QIANCHAO",
        "long_name": "Wanxiang Qianchao Co.,Ltd.",
        "summary": "Wanxiang Qianchao Co.,Ltd. manufactures and sells auto parts in China and internationally. The company offers roller, needle, seal, wheel bearing units, shock absorber assembly, precision forging, bearing, fuel tank, exhaust muffler system, automotive electronics, universal joint assembly, brake system, constant speed drive shaft, and drive shaft products. The company was founded in 1969 and is based in Hangzhou, China. Wanxiang Qianchao Co.,Ltd. is a subsidiary of Wanxiang Group Corporation.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311215",
        "website": "http://www.wxqc.com.cn",
        "market_cap": 16386798592
    },
    "000581.SZ": {
        "short_name": "WEIFU HIGH-TECH",
        "long_name": "Weifu High-Technology Group Co., Ltd.",
        "summary": "Weifu High-Technology Group Co., Ltd. develops, manufactures, and sells diesel fuel injection, exhaust after-treatment, and air management system products primarily in the People's Republic of China. It operates through three segments: Auto Fuel Injection System, Air Management System, and Automotive Post Processing System. The company's fuel injection system products include inline pumps, injectors, distribution pumps, spare parts, and filter products, as well as delivery valves, nozzles, and plungers. Its air management system products comprise gasoline and diesel turbo chargers; and exhaust after-treatment system products consist of catalysts, catalytics, and mufflers. The company also produces and sells engine accessories and purifiers. It offers diesel fuel injection systems that are used in diesel engines for trucks, passenger cars, buses, construction machinery, marine products, and generator sets; exhaust after-treatment system products for the manufacturers of automobile, motorcycle, and general machinery; and air management system products for small-bore diesel engine plants, six-cylinder diesel engine manufacturers, light and heavy commercial vehicles, and passenger cars. The company also exports its products to the Americas, Southeast Asia, and the Middle East. Weifu High-Technology Group Co., Ltd. was founded in 1958 and is headquartered in Wuxi, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214028",
        "website": "http://www.weifu.com.cn",
        "market_cap": 20716296192
    },
    "000589.SZ": {
        "short_name": "GUI ZHOU TYRE CO",
        "long_name": "Guizhou Tyre Co.,Ltd.",
        "summary": "Guizhou Tyre Co.,Ltd. manufactures and sells tires in China. It offers passenger car tires; light truck and urban rail transit tires; tires for engineering, agricultural, and forestry machineries; industrial vehicle tires; and mining tires. It also exports its products to approximately 120 countries and regions, such as the United Kingdom, Italy, South Africa, and South America. The company was founded in 1958 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": null,
        "website": "http://www.gztyre.com",
        "market_cap": 5651845120
    },
    "000599.SZ": {
        "short_name": "QINGDAO DOUBLESTAR",
        "long_name": "Qingdao Doublestar Co.,Ltd",
        "summary": "Qingdao Doublestar Co.,Ltd manufactures and sells tires in China and internationally. The company is also involved in the research, design, manufacturing, installation, and consultation of casting machinery and equipment, rubber and plastics machinery and equipment, environmental protection machinery, and digital tire molds. In addition, it engages in the real estate business. The company is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": "http://www.doublestar.com.cn",
        "market_cap": 3552158976
    },
    "000622.SZ": {
        "short_name": "HENGLI INDUSTRIAL",
        "long_name": "Hengli Industrial Development Group Co., Ltd.",
        "summary": "Hengli Industrial Development Group Co., Ltd. researches and develops, manufactures, and sells automobile air conditioning equipment in China. The company offers car, truck and engineering vehicle, and special vehicle air conditioning equipment; and air conditioning compressors and other products. It is also involved in real estate management and investment management activities. The company is based in Yueyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueyang",
        "zipcode": "414000",
        "website": "http://www.hlsyfzjt.com",
        "market_cap": 1501047680
    },
    "000678.SZ": {
        "short_name": "XIANGYANG AUTO BGS",
        "long_name": "Xiangyang Automobile Bearing Co., Ltd.",
        "summary": "Xiangyang Automobile Bearing Co., Ltd. researches, develops, manufactures, and sells automobile bearings in China. The company offers ball, TRB, NRB, CRB, CHB, CVJ, CJ, and other bearings. It also provides various bearing products in the areas of machinery, agricultural machinery, household appliances, wind power, etc. The company serves various heavy-duty, middle-duty, light-duty, and original equipment markets, as well as aftermarket. It also exports its products to Europe, the United States, Southeast Asia, and other countries and regions. The company was founded in 1968 and is based in Xiangyang, China. Xiangyang Automobile Bearing Co., Ltd. is a subsidiary of Tri-Ring Group Co.,Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiangyang",
        "zipcode": "441057",
        "website": "http://www.zxy.com.cn",
        "market_cap": 2321040640
    },
    "000700.SZ": {
        "short_name": "JIANGNAN MOULD AND",
        "long_name": "Jiangnan Mould & Plastic Technology Co., Ltd.",
        "summary": "Jiangnan Mould & Plastic Technology Co., Ltd. develops, manufactures, and sells auto components. The company offers bumpers, moldings, grilles, license plates, spoilers, body side moldings, wheel opening products, rocker panels, fuel door covers, engine cover strips, and panels. Jiangnan Mould & Plastic Technology Co., Ltd. was founded in 1988 and is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214423",
        "website": "http://www.jnmpt.com",
        "market_cap": 4686192128
    },
    "000757.SZ": {
        "short_name": "SICHUAN HAOWU ELEC",
        "long_name": "Sichuan Haowu Electromechanical Co., Ltd.",
        "summary": "Sichuan Haowu Electromechanical Co., Ltd. produces and sells automobile crankshafts in China. It offers passenger car and commercial vehicle crankshafts. The company is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.hwgf757.com",
        "market_cap": 2605678848
    },
    "000887.SZ": {
        "short_name": "ANHUI ZHONGDING SE",
        "long_name": "Anhui Zhongding Sealing Parts Co., Ltd.",
        "summary": "Anhui Zhongding Sealing Parts Co., Ltd. manufactures and sells non-tire rubber products in China and internationally. The company offers sealing products, including O-rings, gaskets, and encoders, as well as oil, mechanic, bearing, PTFE, special, and air spring seals; and anti-vibration control technologies, such as engine and top mounts, chassis and torque bushings, exhaust hangers, dampers, stabilized bar bushings, spring pads, bumpers, and radiator isolators. It also provides fluid management solutions comprising power steering, cooling system, fuel system, clean system, and drainage pipes, as well as air intake and exhaust ducts; metal products, including stamping and casting aluminum products, and metal pipes; customized products for transportation, household, and other industries; and air beds. In addition, the company offers charging piles, cooling systems, and gas purifying equipment for new energy vehicles. It serves automotive, construction machinery, petrochemical processing, office automation, railway, and shipping industries primarily under the Dinghu brand name. Anhui Zhongding Sealing Parts Co., Ltd. was founded in 1980 and is based in Ningguo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningguo",
        "zipcode": null,
        "website": "http://www.zhongdinggroup.com",
        "market_cap": 14552412160
    },
    "000980.SZ": {
        "short_name": "ZOTYE AUTOMOBILE C",
        "long_name": "Zotye Automobile Co., Ltd",
        "summary": "Zotye Automobile Co., Ltd engages in the research, development, manufacture, and sale of automobiles in China, Iran, Chile, Russia, and internationally. It offers sedan, SUVs, MPVs, and new energy vehicles. The company also provides parts of new energy cars and engines; transmission products; batteries; motors; and electronic control products. It offers its products primarily under the Zotye, Jiangnan, and Traum brands. The company was formerly known as Anhui Zotye Automobile Co., Ltd and changed its name to Zotye Automobile Co., Ltd in November 2017. The company was founded in 1998 is based in Huangshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huangshan",
        "zipcode": null,
        "website": "http://www.zotye.com",
        "market_cap": 12003806208
    },
    "001696.SZ": {
        "short_name": "CHONGQING ZONGSHEN",
        "long_name": "Chongqing Zongshen Power Machinery Co.,Ltd",
        "summary": "Chongqing Zongshen Power Machinery Co.,Ltd. develops, manufactures, and sells motorcycle engines, gasoline and diesel engines, and various agricultural and forestry machinery in China. The company's products include two-wheel, tricycle, ATV, and scooter engines; horizontal and vertical shaft gasoline engines; diesel and automobile engines; mini power tillers and water pumps; and lawn mowers, cleaning machines, and brush cutters. It also provides small size generator sets, lawn machines, high pressure washers, and hedge trimmers. The company exports its products to approximately 100 countries and regions in Europe, the United States, the Middle-East, Southeast Asia, and Africa. Chongqing Zongshen Power Machinery Co.,Ltd. is based in Chongqing, China. Chongqing Zongshen Power Machinery Co.,Ltd., is a subsidiary of Zongshen Industrial Group.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400054",
        "website": "http://www.zse.cc",
        "market_cap": 7957958144
    },
    "002031.SZ": {
        "short_name": "GREATOO INTELLIGEN",
        "long_name": "Greatoo Intelligent Equipment Inc.",
        "summary": "Greatoo Intelligent Equipment Inc. researches, produces, and sells radial tire molds, hydraulic curing presses, precision machine tools, and industrial robots for automobile sector. The company also offers radial segmented and two-piece molds, and giant industrial segmented tire molds. In addition, it provides integrated flexible production line for vehicle milling; automatic electrode flexible production line; and drilling and milling processing automation unit consisting of drilling and milling automatic machining center, robots, material racks, loading and unloading station, and control system. It provides its products in China, the United States, Europe, the Southeast Asia, and South America. The company was formerly known as Greatoo Inc. and changed its name to Greatoo Intelligent Equipment Inc. in October 2015. Greatoo Intelligent Equipment Inc. is based in Jiedong, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiedong",
        "zipcode": "515500",
        "website": "http://www.greatoo.com",
        "market_cap": 3980913664
    },
    "002048.SZ": {
        "short_name": "NINGBO HUAXIANG EL",
        "long_name": "Ningbo Huaxiang Electronic Co., Ltd.",
        "summary": "Ningbo Huaxiang Electronic Co., Ltd. designs, develops, produces, and sells passenger car parts in the People's Republic of China and internationally. It offers vehicle interiors and exteriors, metal parts, automotive electronics, trims, and other related products and services. The company was founded in 1988 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200122",
        "website": "http://www.nbhx.com.cn",
        "market_cap": 10789891072
    },
    "002085.SZ": {
        "short_name": "ZHEJIANG WANFENG A",
        "long_name": "Zhejiang Wanfeng Auto Wheel Co., Ltd.",
        "summary": "Zhejiang Wanfeng Auto Wheel Co., Ltd. manufactures and sells aluminum alloy wheels for the automotive industry in China. The company also exports its products to Europe, the United States, Asia, and other countries and regions. Zhejiang Wanfeng Auto Wheel Co., Ltd. was founded in 1997 and is based in Xinchang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinchang",
        "zipcode": "312500",
        "website": "http://www.wfaw.com.cn",
        "market_cap": 11852890112
    },
    "002108.SZ": {
        "short_name": "CANGZHOU MINGZHU P",
        "long_name": "Cangzhou Mingzhu Plastic Co., Ltd.",
        "summary": "Cangzhou Mingzhu Plastic Co., Ltd. manufactures and sells pressure and non-pressure pipeline systems, and films in China, the United States, Europe, the Middle East, Southeast Asia, and internationally. It offers gas pipes, water supply pipes, biaxially-oriented polyamide films, pipe fittings, and lithium ion battery separators. The company was founded in 1995 and is based in Cangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Cangzhou",
        "zipcode": "061001",
        "website": "http://www.cz-mz.com/English/home.asp",
        "market_cap": 7500796928
    },
    "002126.SZ": {
        "short_name": "ZHEJIANG YINLUN MA",
        "long_name": "Zhejiang Yinlun Machinery Co.,Ltd.",
        "summary": "Zhejiang Yinlun Machinery Co.,Ltd. offers oil, water, and gas heat exchange products. It provides oil coolers, including stainless steel, aluminum, and copper-tube oil coolers; and cooling modules comprising charge air coolers, water-air intercoolers, radiator, commercial vehicle cooling, engineering machinery cooling, car front-end, and other cooling module products. The company also offers exhaust gas recirculation systems, urea-SCR systems and aluminum die-casting parts. Its products are used in automobiles, engineering machinery, agricultural machinery, locomotives, wind power generation, generator units, ships, compressors, and industry and civil use applications. The company is based in Tiantai County, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tiantai",
        "zipcode": "317200",
        "website": "http://www.yinlun.cn",
        "market_cap": 8285313536
    },
    "002190.SZ": {
        "short_name": "SICHUAN CHENGFEI I",
        "long_name": "Sichuan Chengfei Integration Technology Corp.Ltd",
        "summary": "Sichuan Chengfei Integration Technology Corp.Ltd designs, develops, manufactures, and sells tools and dies in China. It offers dies for outer skin panels, such as the body side, roof, doors, and fenders used in cars; auto panel dies and panels; and stamping dies. The company was founded in 2000 and is based in Chengdu, China. Sichuan Chengfei Integration Technology Corp.Ltd is a subsidiary of Aviation Industry Corporation of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610091",
        "website": "http://www.cac-citc.com",
        "market_cap": 8889305088
    },
    "002213.SZ": {
        "short_name": "SHENZHEN DAWEI INN",
        "long_name": "Shenzhen Dawei Innovation Technology Co., Ltd.",
        "summary": "Shenzhen Dawei Innovation Technology Co., Ltd. develops, produces, and sells auxiliary brake products in China. The company primarily offers hydraulic and current retarders, and controllers. It also exports its products to Italy, Australia, South Korea, Thailand, the Philippines, Vietnam, Ghana, Panama, Cuba, Turkey, Tunisia, Chile, the United Arab Emirates, and Oman. The company was formerly known as Shenzhen Terca Technology Co., Ltd and changed its name to Shenzhen Dawei Innovation Technology Co., Ltd. in August 2020. Shenzhen Dawei Innovation Technology Co., Ltd. was founded in 2000 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518110",
        "website": "http://www.terca.cn",
        "market_cap": 3374279936
    },
    "002239.SZ": {
        "short_name": "AOTECAR NEW ENERGY",
        "long_name": "Aotecar New Energy Technology Co., Ltd.",
        "summary": "Aotecar New Energy Technology Co., Ltd. engages in the research and development, production, and sale of automotive a/c compressors. It offers scroll compressors, electric compressors, fixed displacement piston compressors, and variable displacement piston compressors. The company was formerly known as Jiangsu Kingfield Garments Co., Ltd. and changed its name to Aotecar New Energy Technology Co., Ltd. in August 2015. Aotecar New Energy Technology Co., Ltd. is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "2100022",
        "website": "http://en.aotecar.com",
        "market_cap": 12259522560
    },
    "002249.SZ": {
        "short_name": "ZHONGSHAN BROAD OC",
        "long_name": "Zhongshan Broad-Ocean Motor Co., Ltd.",
        "summary": "Zhongshan Broad-Ocean Motor Co., Ltd. engages in the research and development, manufacture, and marketing of micro motors and energy vehicle powertrain systems in China. It offers construction and home electrical motors, new energy vehicle powertrain systems drive motors and controllers, and vehicle rotating electrical appliances, as well as hydrogen fuel cell modules and engine systems under the Dayang Motor brand. The company also leases new energy vehicles. It also exports its products to 40 countries on 5 continents. The company was founded in 1994 and is based in Zhongshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": "528411",
        "website": "http://www.broad-ocean.com",
        "market_cap": 12419033088
    },
    "002265.SZ": {
        "short_name": "YUNNAN XIYI INDUST",
        "long_name": "Yunnan Xiyi Industry Co., Ltd.",
        "summary": "Yunnan Xiyi Industry Co., Ltd. manufactures and sells automobile engine connecting rod-based automotive components, machine tools, and other industrial products primarily in China. It offers rod assemblies, CNC machining centers, rod blanks, expansion broken links, link molds, ray machines, vertical rocker millings, vertical milling heads, aprons, machine tailstocks, aluminum rods, expansion broken links, linear guide rail gantry machining centers, vertical universal rocker millings, CNC gantry millings, and ream column products. The company provides its products under the XiYi brand name. It also exports its products to the United States, Japan, and internationally. Yunnan Xiyi Industry Co., Ltd. was founded in 1939 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650114",
        "website": "http://www.ynxygf.com",
        "market_cap": 2284118272
    },
    "002283.SZ": {
        "short_name": "TIANRUN INDUSTRY T",
        "long_name": "Tianrun Industry Technology Co., Ltd.",
        "summary": "Tianrun Industry Technology Co., Ltd. manufactures and sells crankshafts in China. It offers crankshafts that are used in marine, heavy-duty and light-duty, and passenger car applications, as well as in connecting rods, and castings and forgings; and con-rods, forgings, and precision machines. The company markets and sells its products through a network of agents and distributors under the TIAN brand. It also exports its products to South Korea, India, Turkey, the United Kingdom, Italy, Japan, the United States, etc. The company was formerly known as Tianrun Crankshaft Co., Ltd. and changed its name to Tianrun Industry Technology Co., Ltd. in April 2020. The company was founded in 1954 and is based in Weihai, China. Tianrun Industry Technology Co., Ltd. is a subsidiary of thyssenKrupp AG.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weihai",
        "zipcode": null,
        "website": "http://www.tianrun.com",
        "market_cap": 6536678912
    },
    "002284.SZ": {
        "short_name": "ZHEJIANG ASIA-PACI",
        "long_name": "Zhejiang Asia-Pacific Mechanical & Electronic Co.,Ltd",
        "summary": "Zhejiang Asia-Pacific Mechanical & Electronic Co.,Ltd develops, manufactures, and sells automotive brake systems in China, North America, Europe, Australia, and internationally. The company offers brake calipers, vacuum boosters, brake discs, disc brake assemblies, drum brake assemblies, clutch lines and pumps, and other products. Its products are used in cars and heavy-duty trucks. Zhejiang Asia-Pacific Mechanical & Electronic Co.,Ltd was founded in 1979 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.chinaapg.com",
        "market_cap": 5148671488
    },
    "002355.SZ": {
        "short_name": "XINGMIN INTELLIGEN",
        "long_name": "Xingmin Intelligent Transportation Systems (Group) Co., Ltd.",
        "summary": "Xingmin Intelligent Transportation Systems (Group) Co., Ltd. designs, manufactures, and distributes steel wheels in China. The company offers tubeless, snow wheel, steel, and agricultural and forestry engineering series products. Its products include steel wheels for passenger cars, light trucks, heavy trucks, trailers, and agricultural and forestry machineries, as well as snow wheels. The company offers its products under the Xingmin brand name. It also exports its products to approximately 40 countries and regions. The company was formerly known as Shandong Xingmin Wheel Co., Ltd. and changed its name to Xingmin Intelligent Transportation Systems (Group) Co., Ltd. in July 2016. Xingmin Intelligent Transportation Systems (Group) Co., Ltd. was founded in 1999 and is based in Longkou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Longkou",
        "zipcode": "265716",
        "website": "http://www.xingmin.com",
        "market_cap": 3785476864
    },
    "002363.SZ": {
        "short_name": "SHANDONG LONGJI MA",
        "long_name": "Shandong Longji Machinery Co., Ltd.",
        "summary": "Shandong Longji Machinery Co., Ltd. develops, produces, and sells automotive brake parts in China. Its products include brake rotors, drums, calipers, and pads, as well as heavy duty drums and discs; and hubs. The company also exports its products. Shandong Longji Machinery Co., Ltd. was founded in 1994 and is based in Longkou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Longkou",
        "zipcode": "265700",
        "website": "http://www.sdljjx.com.cn",
        "market_cap": 2038889984
    },
    "002406.SZ": {
        "short_name": "XUCHANG YUANDONG D",
        "long_name": "Xuchang Yuandong Drive Shaft Co., Ltd.",
        "summary": "Xuchang Yuandong Drive Shaft Co., Ltd. manufactures and sells drive shafts in China. The company provides small drive and tractors shafts, and drive shaft parts, as well as products for pickup trucks, SUVs, and powered mechanical cars. Its products are also used in construction machineries. The company was founded in 1954 and is based in Xuchang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xuchang",
        "zipcode": "461111",
        "website": "http://www.yodonchina.com",
        "market_cap": 3913401856
    },
    "002434.SZ": {
        "short_name": "ZHEJIANG WANLIYANG",
        "long_name": "Zhejiang Wanliyang Co., Ltd.",
        "summary": "Zhejiang Wanliyang Co., Ltd. operates in the automobile transmission industry in China and internationally. The company develops, manufactures, and sells automotive products, including passenger car transmission and commercial vehicle transmission for use in sedans, SUVs, MPVs, micro trucks, light trucks, mid trucks, heavy trucks, buses, and other models. It also provides automotive interior products, such as dashboards, door panels, center consoles, columns, guards, bumpers, steering wheels, etc. The company was formerly known as Zhejiang Wanliyang Transmission Company Ltd. and changed its name to Zhejiang Wanliyang Co., Ltd. in January 2016. Zhejiang Wanliyang Co., Ltd. was founded in 2003 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.zjwly.com",
        "market_cap": 11443600384
    },
    "002448.SZ": {
        "short_name": "ZYNP CORP",
        "long_name": "ZYNP Corporation",
        "summary": "ZYNP Corporation designs, develops, manufactures, tests, and supplies cylinder liners and power piston assembly systems in China and internationally. The company provides engine parts, automotive electronics, smart driving products, and smart equipment, as well as international trade services. It offers cylinder liners for the passenger car, commercial vehicle, construction machinery, agricultural machinery, shipbuilding, garden machinery, air compressor, military, and other power fields. The company primarily serves OEMs. ZYNP Corporation was founded in 1958 and is headquartered in Mengzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Mengzhou",
        "zipcode": "454750",
        "website": "http://www.hnzynp.com",
        "market_cap": 3540455168
    },
    "002454.SZ": {
        "short_name": "SONGZ AUTOMOBILE A",
        "long_name": "Songz Automobile Air Conditioning Co., Ltd.",
        "summary": "Songz Automobile Air Conditioning Co., Ltd. engages in the research, development, manufacture, and marketing of air-conditioners for use in the commercial and passenger vehicles in China. The company offers air-conditioning systems that are used in various types of large and medium-sized passenger vehicles, passenger cars and commercial vehicles, trucks, light-duty buses, rail vehicles, and bus rapid transit system buses, as well as in transport refrigeration. It also provides spare parts, such as compressors, condenser fans, evaporator fans, and accessories. In addition, the company offers repair, maintenance, and technical support services. It also exports its products. The company was founded in 2002 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201108",
        "website": "http://www.shsongz.com.cn",
        "market_cap": 3318913280
    },
    "002472.SZ": {
        "short_name": "ZHEJIANG SHUANGHUA",
        "long_name": "Zhejiang Shuanghuan Driveline Co., Ltd.",
        "summary": "Zhejiang Shuanghuan Driveline Co., Ltd. researches and develops, designs, manufactures, and sells gears in China and internationally. The company offers passenger and commercial vehicle, engineering and agricultural machinery, electric tool, and rail transit gears. It provides its products for conventional cars, electric cars, high-speed rail traffic, off-road machinery, motorcycles, ATVs, electric tools, industrial robots, and others. The company was founded in 1980 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310030",
        "website": "http://www.gearsnet.com",
        "market_cap": 9276681216
    },
    "002488.SZ": {
        "short_name": "ZHEJIANG JINGU CO",
        "long_name": "Zhejiang Jingu Company Limited",
        "summary": "Zhejiang Jingu Company Limited researches, designs, develops, manufactures, and sells steel wheels in China. It offers high vent, semi-fullface, full face, and light wheels; passenger car wheels; tubeless truck/bus wheels; trailer wheels; snow car wheels; UTV wheels; and agricultural vehicle wheels. It is involved in the production and sale of tubeless drop well steel wheels and auto parts; sale of automobile and motorcycle accessories; and provision of services, such as changing and repairing tires, dynamic balance, and four wheel alignment, as well as import-export business. The company also exports its products to Europe, the United States, and Southeast Asia. Zhejiang Jingu Company Limited was founded in 1986 and is headquartered in Fuyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuyang",
        "zipcode": null,
        "website": "http://www.jgwheel.com",
        "market_cap": 6412224000
    },
    "002510.SZ": {
        "short_name": "TIANJIN MOTOR DIES",
        "long_name": "Tianjin Motor Dies Co., Ltd.",
        "summary": "Tianjin Motor Dies Co., Ltd. provides dies for the automotive industry in China and internationally. It offers aluminum, body side, skin, inner, HSS, inner, progressive, stamping, and welding parts; and hot forming products. The company was founded in 1965 and is headquartered in Tianjin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300308",
        "website": "http://www.tqm.com.cn",
        "market_cap": 3909082880
    },
    "002516.SZ": {
        "short_name": "KUANGDA TECHNOLOGY",
        "long_name": "Kuangda Technology Group Co., Ltd.",
        "summary": "Kuangda Technology Group Co., Ltd. engages in the research, development, production, and sale of automotive interior fabrics and seat covers in China. The company offers woven, weft knitted, and warp knitted fabrics; chemical fibers; auto seat covers; and auto seat cushions. It is also involved in the investment, construction, and operation of solar photovoltaic power generation stations in various regions, including Qinghai, Yunnan, Jiangsu, Xinjiang, Inner Mongolia, Shanxi, and Shaanxi. The company was formerly known as Jiangsu Kuangda Automobile Textile Group Co., Ltd. and changed its name to Kuangda Technology Group Co., Ltd. in August 2015. Kuangda Technology Group Co., Ltd. was founded in 1993 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": null,
        "website": "http://www.kuangdacn.com",
        "market_cap": 6662905856
    },
    "002536.SZ": {
        "short_name": "FEILONG AUTO COMPO",
        "long_name": "Feilong Auto Components Co., Ltd.",
        "summary": "Feilong Auto Components Co., Ltd., through its subsidiaries, manufactures and sells automobile parts in the People's Republic of China and internationally. The company offers automobile water pumps, engine intake and exhaust manifolds, electronic pumps, electronic switch pumps, turbine housing, flywheel housings, and oil pumps. It serves automobile, construction, agriculture, marine, and generating set industries. The company was formerly known as Henan Province Xixia Automobile Water Pump Co., Ltd. and changed its name to Feilong Auto Components Co., Ltd. in May 2019. Feilong Auto Components Co., Ltd. was founded in 1952 and is based in Xixia, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xixia",
        "zipcode": "474500",
        "website": "http://www.xixia-waterpump.com",
        "market_cap": 4376222720
    },
    "002537.SZ": {
        "short_name": "HYUNION HOLDING CO",
        "long_name": "HyUnion Holding Co.,Ltd",
        "summary": "HyUnion Holding Co., Ltd. manufactures and sells automobile parts, special vehicles, electrical machines, and electromechanical components primarily in China. It also provides financial information, third-party payment, big data risk control, trans-border, and telephone operator charge settlement services. The company was formerly known as Qingdao Haili Metal One Co., Ltd. and changed its name to HyUnion Holding Co., Ltd. in August 2017. HyUnion Holding Co., Ltd. was founded in 2004 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266200",
        "website": "http://www.haili.com.cn",
        "market_cap": 7117579776
    },
    "002553.SZ": {
        "short_name": "JIANGSU NANFANG BE",
        "long_name": "Jiangsu Nanfang Bearing Co.,Ltd.",
        "summary": "Jiangsu Nanfang Bearing Co.,Ltd. designs, develops, and sells needle roller bearings, clutches, and auto parts in China. It offers needle bearings, such as drawn cup needle bearings, thrust needle bearings, and one-way clutch needle bearings, as well as cages and needle assemblies. The company also develops and produces one-way clutch for engines of motorcycles; and sleeve and inner race for auto parts and overrunning alternator pulleys. In addition, the company's needle bearings are used in ABS, gearbox, throttle valve, and starter motor; and thrust bearings in automatic transmission and compressor. Jiangsu Nanfang Bearing Co.,Ltd. was founded in 1988 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213164",
        "website": "http://www.nf-bearings.com",
        "market_cap": 3664439808
    },
    "002555.SZ": {
        "short_name": "WUHU SANQI INTERAC",
        "long_name": "Wuhu 37 Interactive Entertainment Network Technology Group Co.,Ltd.",
        "summary": "Wuhu Sanqi Interactive Entertainment Network Technology Group Co., Ltd. focuses on the development and publication of mobile, browser, and html5 games. The company was founded in 1995 and is headquartered in Wuhu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241000",
        "website": "http://www.37wan.net",
        "market_cap": 57819611136
    },
    "002602.SZ": {
        "short_name": "ZHEJIANG CENTURY G",
        "long_name": "Zhejiang Century Huatong Group Co.,Ltd",
        "summary": "Zhejiang Century Huatong Group Co.,Ltd engages in the auto parts and Internet games business in China and internationally. The company manufactures and sells plastic parts and associated molds for vehicles, such as heat exchange and air conditioning plastic parts; lamp plastic parts; interior and exterior parts; safety systems; metal and non-ferrous metal stamping parts; and water assisted plastic parts. It also offers various gaming platforms, as well as mobile gaming products. The company was founded in 2005 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312300",
        "website": "http://www.sjhuatong.com",
        "market_cap": 51273613312
    },
    "002625.SZ": {
        "short_name": "KUANG-CHI TECHNOLO",
        "long_name": "Kuang-Chi Technologies Co., Ltd.",
        "summary": "Kuang-Chi Technologies Co., Ltd. manufactures and sells seat functional components for automobiles in the People's Republic of China. The company was formerly known as Zhejiang Longsheng Auto Parts Co., Ltd. and changed its name to Kuang-Chi Technologies Co., Ltd. in June 2017. Kuang-Chi Technologies Co., Ltd. was founded in 2001 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.kc-t.cn",
        "market_cap": 46000496640
    },
    "002662.SZ": {
        "short_name": "BEIJING WKW AUTOMO",
        "long_name": "Beijing WKW Automotive Parts Co.,Ltd.",
        "summary": "Beijing WKW Automotive Parts Co.,Ltd. manufactures and sells automotive interior and exterior trim systems, functional components, and electronic systems in China. Its products include quarter light moldings, B-pillar covers, fenders, wheel brows, roof racks, window moldings, roof side moldings, door frame moldings, beltline moldings, sunroof frames, C-pillar covers, instrument panels, center console trims, interior trims, interior door frames, door handle trim frames, ashtray covers, stereo trim strips, and center console frames, as well as plating decorative rings for instrument panels. The company also provides skylight frames, luggage racks, roof drip rails, side beam moldings, car exterior moldings, pillar plaques, aluminum interior ornaments, air conditioning controllers, air conditioning console and outlets, and seat heating controllers. Beijing WKW Automotive Parts Co.,Ltd. was founded in 2002 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.beijing-wkw.com",
        "market_cap": 5220000256
    },
    "002664.SZ": {
        "short_name": "CHANGYING XINZHI T",
        "long_name": "Changying Xinzhi Technology Co.,Ltd.",
        "summary": "Changying Xinzhi Technology Co.,Ltd. produces and sells stator cores and lamination cores for use in the motor field of automobiles, electric bikes, and air-conditioners in China and internationally. It offers stator cores of automobile alternators, armatures of micro-motors, stator assemblies of automobiles, armatures of e-bikes, fans of automobile alternators, stator frames of automobile starters, stator cores of elevator traction machines, and others. The company was formerly known as Xinzhi Motor Co.,Ltd. and changed its name to Changying Xinzhi Technology Co.,Ltd. in December 2017. Changying Xinzhi Technology Co.,Ltd. was founded in 1990 and is based in Jiaojiang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiaojiang",
        "zipcode": "318016",
        "website": "http://www.chinaxinzhi.com",
        "market_cap": 5888278528
    },
    "002703.SZ": {
        "short_name": "ZHEJIANG SHIBAO",
        "long_name": "Zhejiang Shibao Company Limited",
        "summary": "Zhejiang Shibao Company Limited, together with its subsidiaries, researches, designs, develops, produces, and sells automotive steering system and components in the People's Republic of China. The company offers automotive steering gears, and other components and parts of steering system. It also provides power recirculating ball steering gears for use in light, medium, and heavy duty trucks and buses; power rack-and-pinion steering gears and steering knuckles for passenger cars; and EPS systems for use in energy-saving and new energy vehicles. Zhejiang Shibao Company Limited supplies steering products to automakers. The company was founded in 1993 and is headquartered in Hangzhou, China. Zhejiang Shibao Company Limited is a subsidiary of Zhejiang Shibao Holding Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310018",
        "website": "http://www.zjshibao.com",
        "market_cap": 3729706496
    },
    "002708.SZ": {
        "short_name": "CHANGZHOU NRB CORP",
        "long_name": "Changzhou Nrb Corporation",
        "summary": "Changzhou Nrb Corporation engages in the research, development, manufacture, and sale of auto precision bearing products. The company's primary products include needle roller bearings, roller bearings, clutch release bearings, and hub bearings. It also provides hydraulic clutch release, robot, single and double row cylindrical roller, push and pull type clutch release, deep groove ball, joint, and four-point contact ball bearings, as well as synchronizer intermediate ring and large size industrial bearings. It provides its products primarily for application to assemblies, such as automotive transmissions, clutches, heavy truck axles, and hubs. The company was formerly known as Changzhou Guangyang Bearing Co., Ltd. and changed its name to Changzhou Nrb Corporation in May 2014. Changzhou Nrb Corporation was founded in 1994 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213022",
        "website": "http://www.nrb.com.cn",
        "market_cap": 2953710592
    },
    "002715.SZ": {
        "short_name": "HUAIJI DENGYUN AUT",
        "long_name": "Huaiji Dengyun Auto-parts (Holding) Co.,Ltd.",
        "summary": "Huaiji Dengyun Auto-parts (Holding) Co.,Ltd. engages in the research, production, and sale of automobile engine exhaust door series products for domestic vehicle and engine manufacturers in the People's Republic of China. The company offers valves for passenger cars, marine diesel engines, diesel engines, racing cars, industrial diesel engines, motorcycles, heavy duty trucks, and military vehicles, as well as generator units, engineering machineries, light trucks, buses, mini cars, hybrid cars, etc. It also provides threaded, special shaped, and shape specific valves. In addition, the company exports its products to the United States, Italy, Britain, Japan, Brazil, Argentina, Mexico, the Middle East, Southeast Asia, and other countries and regions. The company was founded in 1971 and is based in Huaiji, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huaiji",
        "zipcode": "526400",
        "website": "http://www.huaijivalve.com",
        "market_cap": 2056199936
    },
    "002725.SZ": {
        "short_name": "ZHEJIANG YUELING C",
        "long_name": "Zhejiang Yueling Co., Ltd.",
        "summary": "Zhejiang Yueling Co., Ltd. develops, produces, and sells aluminum alloy wheels in China. The company offers classic, flow forming, low pressure, motorcycle, and ATV/kart wheels under the YUELING, ARTKA, FORZUTO, and DAUNTLESS brands. It also exports its products. Zhejiang Yueling Co., Ltd. was formerly known as Zhejiang Yueling Wheel Hub Making Co., Ltd. The company was founded in 1982 and is based in Wenling, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenling",
        "zipcode": null,
        "website": "http://www.yuering.com",
        "market_cap": 1789440000
    },
    "002765.SZ": {
        "short_name": "LANDAI TECHNOLOGY",
        "long_name": "Landai Technology Group Corp., Ltd.",
        "summary": "Landai Technology Group Corp., Ltd. primarily engages in the research, design, development, manufacture, and sale of power transmission assemblies, transmission parts, and die-casting products for the automotive, textile machinery, and general machinery markets in China. It offers manual, automatic, and new energy transmission assemblies; automotive transmission gears, engine gears, engine blocks, and steering gear housings; balance boxes and shafts; synchronizers, transmission housings, mechanical die-cast parts, transmission cases/cylinders, tooth products, and other components; and textile machinery components. The company also develops, produces, and sells touch screens, touch display integrated modules, capacitive touch screens, and touch display modules and cover glasses. Its touch sensors are primarily used in information terminals, such as tablet and notebook computers, industrial control terminals, automotive electronics, and IoT smart devices, as well as touch input interfaces. The company also exports its products to the Middle East. The company was formerly known as Chongqing Landai Powertrain Corp., Ltd. and changed its name to Landai Technology Group Corp., Ltd. in October 2020. Landai Technology Group Corp., Ltd. was founded in 1996 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "402760",
        "website": "http://www.cqld.com",
        "market_cap": 3738637312
    },
    "002813.SZ": {
        "short_name": "SHENZHEN ROADROVER",
        "long_name": "ShenZhen RoadRover Technology Co.,Ltd",
        "summary": "ShenZhen RoadRover Technology Co.,Ltd provides automotive electronic products and solutions for car manufacturers worldwide. The company offers in-vehicle infotainment systems; car audio solutions; power tailgate systems; digital multifunctional instrument panels; smart seating systems; Internet of vehicles; and telematics solutions. It also provides advanced driver assistance systems, HD digital video recorders for cars, tire pressure monitoring systems, smart rear view mirror systems, parking sensors, head-up displays, headrest entertainment systems, and camera systems. The company was formerly known as Shenzhen Roadrover Technology Limited and changed its name to ShenZhen RoadRover Technology Co.,Ltd in March 2012. ShenZhen RoadRover Technology Co.,Ltd was founded in 2006 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.roadrover.cn",
        "market_cap": 3377999872
    },
    "002863.SZ": {
        "short_name": "ZHEJIANG JINFEI KA",
        "long_name": "Zhejiang Jinfei Kaida Wheel Co.,Ltd.",
        "summary": "Zhejiang Jinfei Kaida Wheel Co.,Ltd. manufactures and sells aluminum alloy auto wheels in China. The company offers motorcycle and automobile wheels, bicycle and motorcycle rims, and electric motorcycle wheels. It also exports its products to approximately 10 countries, including the United States, Japan, the United Kingdom, Southeast Asia, the Middle East, etc. The company is based in Jinhua, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321016",
        "website": "http://www.jfkd.com.cn",
        "market_cap": 2598810624
    },
    "002906.SZ": {
        "short_name": "FORYOU CORPORATION",
        "long_name": "Foryou Corporation",
        "summary": "Foryou Corporation, together with its subsidiaries, engages in the automotive electronics, precision electronic components, precision die casting, and LED lighting businesses in China and internationally. The company offers car electronics, which include car audio, video, interconnection, and navigation products, as well as driving assistance systems, digital clusters, streaming-media rearview mirrors, 360Â°around views, head-up display products, car climate controllers, car air purifiers, vehicle cameras, and wireless charging and tire pressure monitoring systems. It also provides precision electronic components, such as mechanisms, smart projectors, and optical pick up heads and components; and precision die casting products, including automotive parts and components, precision 3C components, etc. In addition, the company offers LED lighting products comprising LED packages, power, lamps, etc. Foryou Corporation was founded in 1993 and is based in Huizhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huizhou",
        "zipcode": null,
        "website": "http://www.foryougroup.com",
        "market_cap": 14420087808
    },
    "002920.SZ": {
        "short_name": "HUIZHOU DESAY SV A",
        "long_name": "Huizhou Desay SV Automotive Co., Ltd.",
        "summary": "Huizhou Desay SV Automotive Co., Ltd. engages in the research, development, manufacture, and sale of automotive electronic products in China and internationally. It offers in-vehicle infotainment systems, climate control systems, driver information display systems, automotive display modules/systems, and driver assistance systems. The company was founded in 1986 and is based in Huizhou, the People's Republic of China. Huizhou Desay SV Automotive Co., Ltd. is a subsidiary of Continental Automotive UK Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huizhou",
        "zipcode": null,
        "website": "http://www.desaysv.com",
        "market_cap": 59537498112
    },
    "002970.SZ": {
        "short_name": "STREAMAX TECHNOLOG",
        "long_name": "Streamax Technology Co., Ltd.",
        "summary": "Streamax Technology Co., Ltd. researches and develops, manufactures, and sells artificial intelligence (AI) powered mobile surveillance and industrial management solutions for commercial vehicles worldwide. The company offers mobile digital video recorders and MDVR accessories; and artificial, IP, AHD, and analog cameras. It also provides AI, refuse vehicle, transit bus video surveillance, school bus vehicles tracking management, taxi fleet management surveillance, vehicles tracking management, fleet management and surveillance, fuel stolen proof, trains and trams surveillance, police motorcycle recording, and intelligent transportation systems. In addition, the company offers technical support services. Its products focus on safety and operational management for commercial vehicles in various industries, such as taxis, buses, dump trucks, transportation trucks, and others. The company was founded in 2002 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518055",
        "website": "http://www.streamax.com",
        "market_cap": 7966079488
    },
    "002984.SZ": {
        "short_name": "QINGDAO SENTURY TI",
        "long_name": "Qingdao Sentury Tire Co., Ltd.",
        "summary": "Qingdao Sentury Tire Co., Ltd. develops, produces, and sells tires in China. It offers car, 4x4 and SUV, business light truck, winter, run-flat, field racing, and cross country tires, as well as aviation tires under the SENTURY, LANDSAIL, DELINTE, and GROUNDSPEED brands. The company is headquartered in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": null,
        "website": "http://www.senturytire.com.cn",
        "market_cap": 23232161792
    },
    "002997.SZ": {
        "short_name": "RAYHOO MOTOR DIES",
        "long_name": "Rayhoo Motor Dies Co.,Ltd.",
        "summary": "Rayhoo Motor Dies Co.,Ltd. designs, develops, manufactures, and sells automobile stamping dies, checking fixtures, and jigs for automobiles. It serves automobile self-brand enterprises. The company was founded in 2002 and is based in Wuhu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": "241006",
        "website": "http://www.rayhoo.net",
        "market_cap": 3433320192
    },
    "003033.SZ": {
        "short_name": "QINGDAO CHOHO INDU",
        "long_name": "Qingdao CHOHO Industrial Co., Ltd",
        "summary": "Qingdao Choho Industrial Co., Ltd. develops, manufactures, and sells automobile chains worldwide. The company offers motorcycle, automotive, king, garage, agricultural, and industrial chains; and PTO driveline shafts for use in heavy torque and agricultural machinery, such as round balers, hayrakes, and rotary cutters and tillers. It offers its products under the CHOHO brand. The company was founded in 1987 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266705",
        "website": "http://chohogroup.com",
        "market_cap": 2864520192
    },
    "0096.HK": {
        "short_name": "YUSEI",
        "long_name": "Yusei Holdings Limited",
        "summary": "Yusei Holdings Limited, an investment holding company, primarily engages in the design, development, and fabrication of precision plastic injection molds in the People's Republic of China. The company also manufactures and trades in moulds and plastic components, as well as offers services for the assembly and processing of plastic components; and system designing and technical support services. It serves the manufacturers of branded auto parts and components, office equipment, and plastic components. The company was founded in 1992 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.yusei.cn",
        "market_cap": 668377472
    },
    "0425.HK": {
        "short_name": "MINTH GROUP",
        "long_name": "Minth Group Limited",
        "summary": "Minth Group Limited, an investment holding company, designs, develops, manufactures, processes, and sells automobile body parts and molds of passenger cars in the People's Republic of China, the United States, Japan, Thailand, Germany, and Mexico. The company also manufactures, develops, and sells batteries and motor systems for electric vehicles, as well as optical parts, metal molds, automation machines, software, and production lines; manufactures buses, modified cars, and electric vehicles; develops and manages real estate properties; and offers bookkeeping services. In addition, it engages in the import and export trading, packaging materials wholesale, logistics, and technology import activities; trade and manufacture of metal products; manufacture and sale of electrical and electronic equipment; and design, development, import, and export of robots. Further, the company provides automobile glass, light metals casting, customer service and market development, agriculture, and management consulting services. The company was founded in 1992 and is headquartered in Jiaxing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Jiaxing",
        "zipcode": "314006",
        "website": "http://www.minthgroup.com",
        "market_cap": 35949461504
    },
    "0564.HK": {
        "short_name": "ZMJ",
        "long_name": "Zhengzhou Coal Mining Machinery Group Company Limited",
        "summary": "Zhengzhou Coal Mining Machinery Group Company Limited, together with its subsidiaries, manufactures and sells coal mining and excavating equipment in the People's Republic of China, Germany, and internationally. It operates through Manufacture of Coal Mining Machinery and Manufacture of Auto Parts segments. The company offers shearer and intelligent longwall face equipment that are used in ultra-thin, thin, thin-medium, thick, and ultra-thick coal seams; armored face conveyors, which are used in conventional mining, fully-mechanized mining, and fully-mechanized top coal caving; hydraulic roof supports; and intelligent control system that encompasses hydraulic support electro-hydraulic control, shearer control and navigation, longwall face video monitoring, intelligent pumping, gate road centralized control, and surface remote monitoring systems, as well as intelligent longwall face big data platform and intelligent mine app. It also provides boost recuperation machine, generators, and starter motors. In addition, the company engages in the manufacture of hydraulic products; trading of raw materials; commercial factoring activities; and research and development, manufacture, sale, and service of auto parts. Further, the company is involved in hotel management and construction services; sale of molding and metal materials; the provision of aftermarket service of mining machinery, software and IT services, and technology services; and research, development, and manufacture of mining products. Zhengzhou Coal Mining Machinery Group Company Limited was founded in 1958 and is headquartered in Zhengzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450016",
        "website": "http://www.zzmj.com",
        "market_cap": 20887744512
    },
    "0951.HK": {
        "short_name": "CHAOWEI POWER",
        "long_name": "Chaowei Power Holdings Limited",
        "summary": "Chaowei Power Holdings Limited, together with its subsidiaries, manufactures and sells lead-acid motive batteries, lithium-ion batteries, and other related products for use in electric bikes, electric tricycles, and special-purpose electric vehicles in the People's Republic of China. The company also manufactures and sells storage batteries; and electrode plate dividing papers and plastic battery cases. In addition, it is involved in the research and development of solar energy generating systems, and durathon batteries, as well as property investment activities. As of December 31, 2020, the company sold its products under the CHILWEE brand through a network of 1,978 independent distributors. Chaowei Power Holdings Limited was founded in 1998 and is headquartered in Changxing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changxing",
        "zipcode": "313100",
        "website": "http://www.chaowei.com.hk",
        "market_cap": 2948027392
    },
    "1057.HK": {
        "short_name": "ZHEJIANG SHIBAO",
        "long_name": "Zhejiang Shibao Company Limited",
        "summary": "Zhejiang Shibao Company Limited, together with its subsidiaries, researches, designs, develops, produces, and sells automotive steering system and components in the People's Republic of China. The company offers automotive steering gears, and other components and parts of steering system. It also provides power recirculating ball steering gears for use in light, medium, and heavy duty trucks and buses; power rack-and-pinion steering gears and steering knuckles for passenger cars; and EPS systems for use in energy-saving and new energy vehicles. Zhejiang Shibao Company Limited supplies steering products to automakers. The company was founded in 1993 and is headquartered in Hangzhou, China. Zhejiang Shibao Company Limited is a subsidiary of Zhejiang Shibao Holding Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310018",
        "website": "http://www.zjshibao.com",
        "market_cap": 5941025280
    },
    "1241.HK": {
        "short_name": "SHUANGHUA H",
        "long_name": "Shuanghua Holdings Limited",
        "summary": "Shuanghua Holdings Limited, an investment holding company, designs, develops, manufactures, and sells auto air-conditioner parts and components in Mainland China, other Asian countries, the United States, Canada, and internationally. It also manufactures and sells heaters, intercoolers, liquid-gas separators, evaporators, condenser cores, pipes, and thermostats. In addition, the company is involved in the sale of automotive lubricants; and import and export of automobile air-conditioner parts and components. It offers its products under the Shuanghua and Youshen brand names to domestic original equipment manufacturers and international aftermarket customers. The company was formerly known as Shanghai Shuanghua Autoparts Co., Ltd. Shuanghua Holdings Limited was founded in 1997 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200122",
        "website": "http://www.shshuanghua.com",
        "market_cap": 58500004
    },
    "1338.TW": {
        "short_name": "HIROCA HOLDINGS LTD",
        "long_name": "Hiroca Holdings Ltd.",
        "summary": "Hiroca Holdings Ltd., through its subsidiaries, manufactures and sells automobile accessories in China. The company offers various solutions for process design and development, video frames, airbag covers, steering wheel, console, decorative door systems, and outside decoration. It also engages in the surface printing, surface coating, plating, real wood processing, and in-mold injection of vehicle interiors, as well as offers velvet stickers, paste paper, restructuring, and other products. In addition, the company exports its products in Japan, the Americas, Europe, Africa, and internationally. Hiroca Holdings Ltd. was founded in 2009 and is based in Dongguan, China.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": null,
        "website": "http://www.hirosawa.com.cn",
        "market_cap": 5365760000
    },
    "1809.HK": {
        "short_name": "PRINX CHENGSHAN",
        "long_name": "Prinx Chengshan Holdings Limited",
        "summary": "Prinx Chengshan (Cayman) Holding Limited, an investment holding company, together with its subsidiaries designs, manufactures, trades in, and distributes tires in the People's Republic of China, Thailand, rest of Asia, the Americas, Africa, the Middle East, and internationally. The company offers steel radial, semi-steel radial, and bias tires for trucks and buses, passenger, agricultural, and industrial sectors under the Prinx, ChengShan, Austone, and Fortune brand names. It also engages in the research and development of tire technology and equipment, as well as provision of related technical services; trading of inflatable products and related products; and provides tire rentals. The company was formerly known as Prinx (Cayman) Holdings Limited. The company was founded in 1976 and headquartered in Rongcheng, the People's Republic of China. Prinx Chengshan (Cayman) Holding Limited is a subsidiary of Chengshan Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Rongcheng",
        "zipcode": null,
        "website": "http://www.prinxchengshan.com",
        "market_cap": 5576509952
    },
    "1899.HK": {
        "short_name": "XINGDA INT'L",
        "long_name": "Xingda International Holdings Limited",
        "summary": "Xingda International Holdings Limited, an investment holding company, manufactures and trades radial tire cords, steel cords, bead wires, and other wires in the People's Republic of China and Thailand. The company's steel cords and bead wires are used in car, light truck, cargo truck, and heavy equipment tires, as well as other rubber products. Xingda International Holdings Limited is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200062",
        "website": "http://www.xingda.com.cn",
        "market_cap": 3551315456
    },
    "1930.HK": {
        "short_name": "SHINELONG",
        "long_name": "Shinelong Automotive Lightweight Application Limited",
        "summary": "Shinelong Automotive Lightweight Application Limited, an investment holding company, designs, manufactures, and sells precision moulds in the People's Republic of China and internationally. It offers automotive and electrical appliance moulds, including hot-pressing, hydroforming, automotive injection, bicolour injection, and TV injection moulds; and parts processing services. The company was founded in 2002 and is based in Kunshan, China. Shinelong Automotive Lightweight Application Limited is a subsidiary of Shine Art International Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": null,
        "website": "http://www.shinlone.com.cn",
        "market_cap": 257399984
    },
    "200030.SZ": {
        "short_name": "FAWER AUTOMOTIVE P",
        "long_name": "FAWER Automotive Parts Limited Company",
        "summary": "FAWER Automotive Parts Limited Company manufactures and sells automotive parts and components of environment control systems, chassis systems, steering and transmission systems, safety systems, engine accessory systems, etc. in China. The company offers climate control systems; steering and driving systems; engine accessory systems, such as differential locks, electric fuel pumps, oil pumps, clutch master cylinders, water pumps, and throttle bodies; chassis accessory systems, including engine beam, sub-bracket, rear axis welding, control arm, front frame, and oil pan assembly systems; and suspension and running systems comprising subframe-passenger, leaf spring commercial trucks, rear suspension passenger, passenger strut assemblies, shock absorbers for commercial vehicles, coil springs, torque rods, and control arm assemblies; braking systems; and other products consisting of fasteners, airbags, body control modules, grip brakes, torsion bars, brake camshafts, wiring harnesses, sun visors, gear controls, and automotive instrument clusters. It also exports its products to the United States, France, Italy, South Korea, Japan, and countries in the Middle East. The company was formerly known as Fawer Automotive Parts Company Ltd. and changed its name to FAWER Automotive Parts Limited Company in December 2007. FAWER Automotive Parts Limited Company is based in Changchun, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130033",
        "website": "http://www.fawer.com.cn",
        "market_cap": 16328850432
    },
    "200054.SZ": {
        "short_name": "CHONGQING JIANSHE",
        "long_name": "Chongqing Jianshe Vehicle System Co., Ltd.",
        "summary": "Chongqing Jianshe Vehicle System Co., Ltd., together with its subsidiaries, engages in the research, development, manufacture, distribution, and sale of motorcycles, auto parts, accessories, and machinery products in China and internationally. Its products include motorcycles engines; and automotive air conditioning compressors. The company is also involved in the research, development, wholesale, retail, and processing of mechanical and electrical products, home appliances, bicycles, and environmental protection products. The company was formerly known as Chongqing Jianshe Motorcycle Co., Ltd. and changed its name to Chongqing Jianshe Vehicle System Co., Ltd. in December 2017. The company was founded in 1889 and is headquartered in Chongqing, China. Chongqing Jianshe Vehicle System Co., Ltd. is a subsidiary of Chongqing Jianshe mechanical and electrical co., LTD.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400054",
        "website": "http://www.jianshe.com.cn",
        "market_cap": 537187520
    },
    "200581.SZ": {
        "short_name": "WEIFU HIGH-TECH",
        "long_name": "Weifu High-Technology Group Co., Ltd.",
        "summary": "Weifu High-Technology Group Co., Ltd. develops, manufactures, and sells diesel fuel injection, exhaust after-treatment, and air management system products primarily in the People's Republic of China. It operates through three segments: Auto Fuel Injection System, Air Management System, and Automotive Post Processing System. The company's fuel injection system products include inline pumps, injectors, distribution pumps, spare parts, and filter products, as well as delivery valves, nozzles, and plungers. Its air management system products comprise gasoline and diesel turbo chargers; and exhaust after-treatment system products consist of catalysts, catalytics, and mufflers. The company also produces and sells engine accessories and purifiers. It offers diesel fuel injection systems that are used in diesel engines for trucks, passenger cars, buses, construction machinery, marine products, and generator sets; exhaust after-treatment system products for the manufacturers of automobile, motorcycle, and general machinery; and air management system products for small-bore diesel engine plants, six-cylinder diesel engine manufacturers, light and heavy commercial vehicles, and passenger cars. The company also exports its products to the Americas, Southeast Asia, and the Middle East. Weifu High-Technology Group Co., Ltd. was founded in 1958 and is headquartered in Wuxi, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214028",
        "website": "http://www.weifu.com.cn",
        "market_cap": 24952487936
    },
    "2025.HK": {
        "short_name": "RUIFENG POWER",
        "long_name": "Ruifeng Power Group Company Limited",
        "summary": "Ruifeng Power Group Company Limited, an investment holding company, engages in design, development, production, and sale of cylinder blocks and heads in the People's Republic of China. The company also offers structural components of cylinder blocks, including bearing caps and flywheels. It serves manufacturers of vehicles, including passenger, commercial, and industrial vehicles, as well as engine producers. The company was founded in 2002 and is headquartered in Shenzhou, the People's Republic of China. Ruifeng Power Group Company Limited is a subsidiary of Dragon Rise Ventures Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhou",
        "zipcode": null,
        "website": "http://www.hbsgt.com",
        "market_cap": 800000000
    },
    "2243.TW": {
        "short_name": "HORNG SHIUE HOLDING CO LTD",
        "long_name": "HORNG SHIUE HOLDING Co., Ltd.",
        "summary": "HORNG SHIUE HOLDING Co., Ltd. manufactures and supplies automobile body-in-white molds and inspection tools. It also offers tooling and technical consulting services. The company was founded in 2015 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201611",
        "website": "http://www.horngshiue.com",
        "market_cap": 504642464
    },
    "2488.HK": {
        "short_name": "LAUNCH TECH",
        "long_name": "Launch Tech Company Limited",
        "summary": "Launch Tech Company Limited, together with its subsidiaries, provides products and services to the automotive aftermarket and the automobile industry in the People's Republic of China and internationally. It operates through three segments: Automotive Diagnosis, Lift, and Overseas Sales. The company is involved in the research and development, production, and sale of car diagnosis, testing, and maintenance equipment; development, production, and sale of automotive diagnosis, inspection, repair, and maintenance software; development, production, and sale of auto electronic products; and provision of information network services. It also develops, trades in, and sells computer software and hardware, and peripherals; provides consulting services of electronic products and technical; and provides health care management consultation and health care products development services. In addition, the company provides mobile phones and communication products; electronic products development and distribution; chip development and distribution; goods and technologies import and export, and agent services; computer software and hardware technology development, distribution, and sale; computer network projects; computer graphic design; corporate image planning; and Internet information consultation services. Further, it engages in the production of automobiles maintenance machines and equipment, and automobile warranty machines, such as automobile spray booths, tire balancers, tire changers, 4-wheel aligners, frame racks, and automobile testing lines; and development and sale of computer software, information system software, and car sharing technology. The company was founded in 1992 and is based in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.cnlaunch.com",
        "market_cap": 1836922240
    },
    "300095.SZ": {
        "short_name": "JIANGXI HUAWU BRAK",
        "long_name": "Jiangxi Huawu Brake Co.,Ltd.",
        "summary": "Jiangxi Huawu Brake Co.,Ltd. manufactures and sells industrial brakes, wind proof devices, and electro-hydraulic driving equipment in China. The company's products are used in metallurgy, hydraulic structure, railway, vessel, hoisting transportation, and other industries, as well as in ports. It also exports its products to approximately 100 ports and wharfs in 5 continents. Jiangxi Huawu Brake Co.,Ltd. was founded in 1992 and is based in Fengcheng, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fengcheng",
        "zipcode": "331100",
        "website": "http://www.hua-wu.com",
        "market_cap": 3533373696
    },
    "300100.SZ": {
        "short_name": "NINGBO SHUANGLIN A",
        "long_name": "Ningbo Shuanglin Auto Parts Co.,Ltd.",
        "summary": "Ningbo Shuanglin Auto Parts Co.,Ltd. manufactures and sells auto parts in China. It offers powertrain solutions, which include automatic transmission systems; permanent magnet synchronous DC motors; and motor, vehicle, and battery control systems. The company also provides hub bearings; automobile accessories, such as interiors and exteriors comprises instrument and door panel, bumper, center control, and vertical column assemblies; and precision injection molding products, including SRS injection molding parts, precision plastic gears, air conditioner parts, fuel system precision injection molding parts, ignition coils, and speakers. In addition, it offers mechanic and electronic devices consist of seat motors, door and window motors, seat drivers, flexible shafts, electronic control modules, and automobile stamping parts, as well as aftersales services. The company was founded in 2010 and is based in Shanghai, China. Ningbo Shuanglin Auto Parts Co.,Ltd. is a subsidiary of Shuanglin Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201799",
        "website": "http://www.shuanglin.com",
        "market_cap": 4037101312
    },
    "300151.SZ": {
        "short_name": "SHENZHEN C/H TECHN",
        "long_name": "Shenzhen Changhong Technology Co., Ltd.",
        "summary": "Shenzhen Changhong Technology Co., Ltd. manufactures and sells plastic molds and precision injection molded parts worldwide. The company offers high-precision molds, plastic parts, medical parts and consumables, and stamping dies. It also provides design for manufacture, mold-flow analysis, assembly pad printing, spray painting, hot stamping, ultra-sonic welding, warehousing, and customs and logistics services. The company was founded in 2001 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518118",
        "website": "http://www.sz-changhong.com",
        "market_cap": 14582550528
    },
    "300176.SZ": {
        "short_name": "GUANGDONG PAISHENG",
        "long_name": "GuangDong PaiSheng Intelligent Technology Co.,Ltd",
        "summary": "Guangdong Paisheng Intelligent Technology Co., Ltd. produces and sells precision aluminum alloy castings for automobile engines in China. Its products include cylinder blocks, differential housings, gearbox housings, oil filters, thermostat seats, oil sumps, gear housings, lower cylinders, cam brackets, front covers, intake pipes, flywheel shells, oil filter cooler chambers, drain pipe cover assemblies, and ignition coil housings. The company also exports its products to Europe and the United States. The company was formerly known as Guangdong Hongteo Technology Co., Ltd. and changed its name to Guangdong Paisheng Intelligent Technology Co., Ltd. in February 2019. The company was founded in 2003 and is based in Zhaoqing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhaoqing",
        "zipcode": "526070",
        "website": "http://www.hongteo.com.cn",
        "market_cap": 2606401024
    },
    "300230.SZ": {
        "short_name": "SHANGHAI YONGLI BE",
        "long_name": "Shanghai YongLi Belting Co., Ltd",
        "summary": "Shanghai YongLi Belting Co., Ltd manufactures and sells conveyor belts in South Africa, China, Europe, Asia, the United States, and internationally. The company provides polyvinyl chloride, polyurethane, polyethylene, polyester plastic, silicon, flame retardant, high temperature, anti-abrasive, anti-static, knife edge, and turning belts. It also offers patterns; and fabrication tools, including spice machines, tooth punches, separators, and air heaters. The company's products are used in material handling, tobacco, textile, food, building material, automobile, fitness, agriculture, and other industries. Shanghai YongLi Belting Co., Ltd was founded in 1989 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.yonglibelt.com",
        "market_cap": 3934113024
    },
    "300237.SZ": {
        "short_name": "SHANDONG MEICHEN E",
        "long_name": "Shandong Meichen Ecology & Environment Co.,Ltd.",
        "summary": "Shandong Meichen Ecology & Environment Co.,Ltd. engages in garden greening and rubber non-tire business. It is involved in the garden ancient architecture and municipal utilities engineering, ecological restoration, soil and water conservation, technology development of ecological and environmental protection products, technical services, technical advice, achievement transfer, etc. The company also provides ecological gardening, soil repair, minerals, ecological water management, and air detection management services. In addition, it researches, develops, manufactures, and sells suspension, engineering plastic, and fluid pipe products; and elastic products damping noise reduction, as well as provision of system integration services. The company was formerly known as Shandong Meichen Science & Technology Co., Ltd. and changed its name to Shandong Meichen Ecology & Environment Co.,Ltd. in December 2017. Shandong Meichen Ecology & Environment Co.,Ltd. was founded in 2004 and is headquartered in Weifang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": null,
        "website": "http://www.meichen.cc",
        "market_cap": 3676267008
    },
    "300304.SZ": {
        "short_name": "JIANGSU YUNYI ELEC",
        "long_name": "Jiangsu Yunyi Electric Co., Ltd.",
        "summary": "Jiangsu Yunyi Electric Co., Ltd. develops, manufactures, and sells automotive rectifiers, regulators, and other car electronic products in China and internationally. It offers charging, wiper, and motor control systems. The company was founded in 2001 and is based in Xuzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xuzhou",
        "zipcode": null,
        "website": "http://www.yunyi-china.com",
        "market_cap": 4503386624
    },
    "300320.SZ": {
        "short_name": "JIANGYIN HAIDA RUB",
        "long_name": "Jiangyin Haida Rubber And Plastic Co., Ltd.",
        "summary": "Jiangyin Haida Rubber and Plastic Co., Ltd. engages in the research, development, production, and sale of rubber and plastic materials in China and internationally. It offers solutions for sealing and vibration damping systems for use in rail transit, construction, automobile, and shipping applications. The company offers its products under the Haida brand. Jiangyin Haida Rubber and Plastic Co., Ltd. is based in Jiangyin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangyin",
        "zipcode": "214424",
        "website": "http://www.haida.cn",
        "market_cap": 3336848640
    },
    "300375.SZ": {
        "short_name": "TIANJIN PENGLING G",
        "long_name": "Tianjin Pengling Group Co., Ltd",
        "summary": "Tianjin Pengling Group Co., Ltd. researches, develops, designs, produces, and sells automotive fluid pipelines in China and internationally. It provides automotive coolant, fuel, air-condition, power steering, and turbo charger hose assemblies; automotive sunroof drain hoses; and automotive molding press hose assemblies. The company was formerly known as Tianjin Pengling Rubber Hose Co., Ltd. and changed its name to Tianjin Pengling Group Co., Ltd. in June 2018. Tianjin Pengling Group Co., Ltd. was founded in 1988 and is headquartered in Tianjin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300270",
        "website": "http://www.pengling.cn",
        "market_cap": 2887159296
    },
    "300391.SZ": {
        "short_name": "KANGYUE TECHNOLOGY",
        "long_name": "Kangyue Technology Co., Ltd.",
        "summary": "Kangyue Technology Co., Ltd. engages in the research, development, manufacture, and marketing of turbochargers for OE engine manufacturers and aftermarket customers primarily in China. It offers turbos for automotive, truck and bus, construction and agricultural machinery, and marine applications, as well as for stationary power in diesel, gas, and natural gas engines; and spare kits for turbochargers, such as compressor wheels, turbine wheels and shafts, bearings, housings, rings, actuators, etc. Kangyue Technology Co., Ltd. also exports its products. The company was formerly known as Shouguang Kangyue Turbocharger Co., Ltd. Kangyue Technology Co., Ltd. was founded in 1963 and is based in Shouguang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shouguang",
        "zipcode": "262718",
        "website": "http://www.chinakangyue.com",
        "market_cap": 4985281024
    },
    "300432.SZ": {
        "short_name": "MIANYANG FULIN PRE",
        "long_name": "Mianyang Fulin Precision Machining Co., Ltd.",
        "summary": "Mianyang Fulin Precision Machining Co., Ltd. researches and develops, manufactures, and sells automotive engine parts. Its products include hydraulic tappets, mechanical valve tappets, hydraulic tensioners, rocker arms, hydraulic automatic tensers, valve rockers, variable valve systems, nozzles, variable valve actuation systems, direct injection systems, VVT and OCV products, piston cooling jets, auto-tensioners, and high precision machining parts, as well as precise components of automatic transmission and fuel injectors. The company manufactures lithium-ion battery cathode materials. Mianyang Fulin Precision Machining Co., Ltd. was founded in 1997 and is based in Mianyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Mianyang",
        "zipcode": null,
        "website": "http://www.fulinpm.com",
        "market_cap": 10952454144
    },
    "300473.SZ": {
        "short_name": "FUXIN DARE AUTOMOT",
        "long_name": "Fuxin Dare Automotive Parts Co., Ltd.",
        "summary": "Fuxin Dare Automotive Parts Co., Ltd. engages in the research and development, manufacture, and sale of automotive components in China. Its principal products include pumps and electric pumps, motors, electronic control and automotive electronics, noise reduction insulation, and lightweight products used in steering, transmission, braking, automotive electronics, and body. The company was founded in 2004 and is based in Fuxin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuxin",
        "zipcode": "123004",
        "website": "http://www.dare-auto.com",
        "market_cap": 2272604416
    },
    "300507.SZ": {
        "short_name": "JIANGSU OLIVE SENS",
        "long_name": "Jiangsu Olive Sensors High-Tech Co., Ltd.",
        "summary": "Jiangsu Olive Sensors High-Tech Co., Ltd. researches, develops, produces, and sells auto parts. It offers sensors and accessories, fuel system accessories, and automotive interior parts. The company was formerly known as Jiangsu Hi-Tech Co., Ltd. and changed its name to Jiangsu Olive Sensors High-Tech Co., Ltd. in October 2010. The company was founded in 1993 and is based in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": "225127",
        "website": null,
        "market_cap": 2578793472
    },
    "300547.SZ": {
        "short_name": "SICHUAN CHUANHUAN",
        "long_name": "Sichuan Chuanhuan Technology Co.,Ltd.",
        "summary": "Sichuan Chuanhuan Technology Co.,Ltd. produces and sells rubber hoses in China. It provides oil cooling pipes, fuel hoses, body attachment systems, cooling system hoses, turbocharger pipes, braking system hoses, power steering system hoses, in and out of the system hose, and nylon tubes, as well as assemblies. The company's products are used in automobiles, motorcycles, and other machinery. It also exports its products in the United States, Canada, Japan, Vietnam, India, South Africa, Italy, Croatia, and internationally. The company is based in Dazhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dazhou",
        "zipcode": null,
        "website": "http://www.chuanhuan.com",
        "market_cap": 2307879936
    },
    "300585.SZ": {
        "short_name": "NANJING AOLIAN AE",
        "long_name": "NanJing AoLian AE&EA Co.,Ltd",
        "summary": "NanJing AoLian AE&EA Co., Ltd. engages in researching, developing, manufacturing, and marketing automobile electronics and electrical accessory products. It provides low-temp starters that include flame preheating devices, grid heaters, PTC, SCR, and glow plugs; AC control panels that comprise electronic, automatic, and manual AC controllers; and accelerator pedals, such as electronic throttles, floor type electronic accelerators, remote electronic throttles, and mechanical electronic accelerators. The company also offers shift levers that include AMT shift handle, MT shift handle, knob type change gear, electric gearshift handle, and AT shift lever assemblies; and other products, which comprises of ATS EGR valve systems, electronic throttles, door and window controllers, and right and left control panels. In addition, it provides transmission controllers, and other electromechanical vehicle accessories, as well as plastic molds. NanJing AoLian AE&EA Co.,Ltd was founded in 2001 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211153",
        "website": "http://www.njaolian.com",
        "market_cap": 2035200000
    },
    "300594.SZ": {
        "short_name": "SHANDONG LONGERTEK",
        "long_name": "Shandong Longertek Technology Co., Ltd.",
        "summary": "Shandong Longertek Technology Co., LTD designs, manufactures, and sells vehicle air conditioners in China. The company was founded in 2000 and is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "271100",
        "website": "http://www.longertek.com",
        "market_cap": 1728548352
    },
    "300652.SZ": {
        "short_name": "HANGZHOU RADICAL E",
        "long_name": "HangZhou Radical Energy Saving Technology Co., Ltd.",
        "summary": "HangZhou Radical Energy Saving Technology Co., Ltd. engages in the research, design, manufacture, and sale of automotive bearings. It offers wheel bearings and hub units, tapered roller bearings, belt tensioners and pulleys, clutch release bearings, tripods for C.V. joints, and other products. The company was founded in 1998 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311231",
        "website": "http://www.radical.cn",
        "market_cap": 1815745792
    },
    "300680.SZ": {
        "short_name": "WUXI LONGSHENG TEC",
        "long_name": "Wuxi Longsheng Technology Co., Ltd.",
        "summary": "Wuxi Longsheng Technology Co., Ltd. researches and develops, produces, and sells engine exhaust gas recirculation (EGR) systems in China. It offers low pressure, diesel, and gasoline EGR valves; throttles; EGR coolers and modules; sensors; and controllers. The company was founded in 2004 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": null,
        "website": "http://www.china-lsh.com",
        "market_cap": 4161035008
    },
    "300681.SZ": {
        "short_name": "ZHUHAI ENPOWER ELE",
        "long_name": "Zhuhai Enpower Electric Co.,Ltd.",
        "summary": "Zhuhai Enpower Electric Co.,Ltd. engages in the research and development, production, and sale of electric vehicle motor control systems. The company offers motor controllers, car chargers, DC-DC converters, and electronics. Its products are used in energy vehicles, low and medium speed electric vehicles, field electric vehicles, and other fields. The company was founded in 2009 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": null,
        "website": "http://www.in-powercar.com",
        "market_cap": 2639951872
    },
    "300695.SZ": {
        "short_name": "ZHEJIANG ZHAOFENG",
        "long_name": "Zhejiang Zhaofeng Mechanical and Electronic Co.,Ltd.",
        "summary": "Zhejiang Zhaofeng Mechanical and Electronic Co., Ltd. manufactures and sells wheel hub assemblies and precision bearings in China. Its products are used in middle and senior class sedans, commercial vehicles, and trucks. The company also sells its products in the United States, Canada, Germany, Italy, and South Korea. Zhejiang Zhaofeng Mechanical and Electronic Co., Ltd. is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311232",
        "website": "http://www.hzfb.com",
        "market_cap": 3486576896
    },
    "300733.SZ": {
        "short_name": "CHENGDU XILING POW",
        "long_name": "Chengdu Xiling Power Science & Technology Incorporated Company",
        "summary": "Chengdu Xiling Power Science & Technology Incorporated Company produces and sells automotive engine components for high-tech enterprises in China. The company offers camshafts, damper pulleys, connecting rods, and other components. It also exports its products to Europe, the United States, Southeast Asia, and other countries and regions. The company was founded in 1999 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.xlqp.com",
        "market_cap": 4094722304
    },
    "300742.SZ": {
        "short_name": "NANJNG YUEBOO POWE",
        "long_name": "Nanjing Yueboo Power System Co., Ltd.",
        "summary": "Nanjing Yueboo Power System Co., Ltd. manufactures commercial vehicles, passenger cars, power train systems, and buses. The company was founded in 2012 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.yuebooemt.com",
        "market_cap": 1905946112
    },
    "300745.SZ": {
        "short_name": "SHINRY TECHNOLOGIE",
        "long_name": "Shinry Technologies Co., Ltd.",
        "summary": "Shinry Technologies Co., Ltd. manufactures and supplies charging and distribution solutions in NEV market worldwide. It offers DC/DC converters, on-board chargers, D+C integration products, CDU integrated products, and high power charging products, such as non-isolated type, isolated type, and bidirectional conversion chargers for passenger cars, buses, special purpose vehicles, and mini cars. The company also offers technical support services, including on-site technical support, services network, and lifecycle management services. Shinry Technologies Co., Ltd. was founded in 2005 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.shinry.com",
        "market_cap": 2573736192
    },
    "300816.SZ": {
        "short_name": "ACTBLUE CO LTD",
        "long_name": "ActBlue Co., Ltd.",
        "summary": "ActBlue Co., Ltd. researches, develops, and sells diesel, gasoline, and natural gas engine exhaust after-treatment products. Its products are used for emission testing and calibration applications in vehicles. The company is headquartered in Chizhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chizhou",
        "zipcode": null,
        "website": "http://www.act-blue.com",
        "market_cap": 6201599488
    },
    "300893.SZ": {
        "short_name": "ZHEJIANG SONGYUAN",
        "long_name": "Zhejiang Songyuan Automotive Safety Systems Co.,Ltd.",
        "summary": "Zhejiang Songyuan Automotive Safety Systems Co.,Ltd. provides safety systems for automobiles in China and internationally. It engages in the research and development, design, production, sale, and service of automotive passive safety system products and seat safety devices, such as automobile seat belt assemblies and parts. The company provides products for mainstream automakers and seat factories. The company is based in Yuyao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": "315456",
        "website": "http://www.songyuansafety.com",
        "market_cap": 2318000128
    },
    "300926.SZ": {
        "short_name": "JIANGSU BOJUN INDU",
        "long_name": "Jiangsu Bojun Industrial Technology Co., Ltd",
        "summary": "Jiangsu Bojun Industrial Technology Co., Ltd engages in the research and development, production, and sale of automotive molds and parts in China and internationally. It offers roof, steering, vehicle seating, powertrain, interior and exterior, electronic, and door systems. The company was founded in 2004 and is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215300",
        "website": "http://www.sh-bojun.com",
        "market_cap": 3180936192
    },
    "300928.SZ": {
        "short_name": "HAXC HOLDINGS (BEI",
        "long_name": "HAXC Holdings (Beijing) Co., Ltd.",
        "summary": "HAXC Holdings (Beijing) Co., Ltd. manufactures and sells automotive cockpit electronics. The company is involved in customization and selection of core display devices, software system development, and sales of supporting devices for automotive central control and LCD instrumentation; and design of human-computer interaction, and user interaction/interface, in-vehicle Ethernet system, and other software and hardware products and solutions that are in line with the development of intelligent and electronic car cabins, as well as other general-purpose component products. Its products and services include automotive display screens, full LCD instrument software and hardware systems, and integrated cockpit display systems. The company was founded in 2013 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101102",
        "website": "http://www.haxc.com.cn",
        "market_cap": 3483200000
    },
    "3606.HK": {
        "short_name": "FUYAO GLASS",
        "long_name": "Fuyao Glass Industry Group Co., Ltd.",
        "summary": "Fuyao Glass Industry Group Co., Ltd., together with its subsidiaries, provides solutions of safety glass for various transportation vehicles in China and internationally. It designs, manufactures, sells, and services automotive grade float glass, automotive glass, locomotive glass, luggage racks, and vehicle window trims, as well as offers relevant services. The company provides thermal insulation, sound insulation, head-up display, dimmable, ultraviolet-proof, water proof, solar energy, semi-tempered laminated, acoustic, heating, hydrophobic, dimming, antenna, heat insulation, lightweight, ambient, light transmittance, coated, and ultraviolet-cut glasses. It also offers photovoltaic and panoramic sunroofs; exterior decoration products; flush styling windows; and encapsulated glass and sliding window assemblies, as well as enveloping edge modularization products. The company was formerly known as Fujian Yaohua Glass Industry Group Co., Ltd. and changed its name to Fuyao Glass Industry Group Co., Ltd. in June 1992. Fuyao Glass Industry Group Co., Ltd. was founded in 1987 and is headquartered in Fuqing, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Fuqing",
        "zipcode": null,
        "website": "http://www.fuyaogroup.com",
        "market_cap": 172047204352
    },
    "3663.HK": {
        "short_name": "XIEZHONG INTL",
        "long_name": "Xiezhong International Holdings Limited",
        "summary": "Xiezhong International Holdings Limited, together with its subsidiaries, engages in the designing, production, and sale of automotive heating, ventilation, and cooling (HVAC) systems for sport utility vehicles, pickup trucks, sedans, and heavy trucks in Mainland China, the Kingdom of Morocco, France, Spain, and Slovakia. The company operates in two segments, HVAC Business and 4S Dealership Business. The company offers HVAC components, including evaporators, condensers, heater cores, radiators, intercoolers, oil coolers, and HVAC hoses and housings, as well as technical testing and related services. It also supplies HVAC systems and HVAC components for new energy vehicles and construction machinery, as well as other vehicles, such as light trucks and buses. In addition, the company engages in the sale of automobiles and automobile components, and spare parts and accessories, as well as provision of after-sales services, such as repair and maintenance services. Xiezhong International Holdings Limited was incorporated in 2011 and is headquartered in Nanjing, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211100",
        "website": "http://www.xiezhonginternational.hk",
        "market_cap": 608000000
    },
    "4FG.F": {
        "short_name": "FUYAO GLASS IND.GP -H-YC1",
        "long_name": "Fuyao Glass Industry Group Co., Ltd.",
        "summary": "Fuyao Glass Industry Group Co., Ltd., together with its subsidiaries, provides solutions of safety glass for various transportation vehicles in China and internationally. It designs, manufactures, sells, and services automotive grade float glass, automotive glass, locomotive glass, luggage racks, and vehicle window trims, as well as offers relevant services. The company provides thermal insulation, sound insulation, head-up display, dimmable, ultraviolet-proof, water proof, solar energy, semi-tempered laminated, acoustic, heating, hydrophobic, dimming, antenna, heat insulation, lightweight, ambient, light transmittance, coated, and ultraviolet-cut glasses. It also offers photovoltaic and panoramic sunroofs; exterior decoration products; flush styling windows; and encapsulated glass and sliding window assemblies, as well as enveloping edge modularization products. The company was formerly known as Fujian Yaohua Glass Industry Group Co., Ltd. and changed its name to Fuyao Glass Industry Group Co., Ltd. in June 1992. Fuyao Glass Industry Group Co., Ltd. was founded in 1987 and is headquartered in Fuqing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Fuqing",
        "zipcode": null,
        "website": "http://www.fuyaogroup.com",
        "market_cap": 18328256512
    },
    "600099.SS": {
        "short_name": "LINHAI COMPANY",
        "long_name": "Linhai Co.,Ltd.",
        "summary": "Linhai Co.,Ltd. develops, manufactures, and sells motorcycles, all-terrain vehicles, mini tractors, generators, and multi-purpose engines in China and internationally. It primarily offers motorcycle-engines, small gasoline engines, mopeds, forestry machineries, fire-fighting machineries, and sprinklers for sports ground. The company was founded in 1956 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": null,
        "website": "http://www.linhai.cn",
        "market_cap": 1360735232
    },
    "600114.SS": {
        "short_name": "NBTM NEW MATERIALS GROUP CO. LT",
        "long_name": "NBTM New Materials Group Co., Ltd.",
        "summary": "NBTM New Materials Group Co., Ltd. produces and sells powder metal structural parts and magnetic materials components in China. It provides car parts, such as car engine, auto transmission, auto chassis, and other products; new energy parts; air condition compressor and refrigerator compressor parts for home appliances; and motorcycle engines, clutches, driven gears, and other components. The company also offers soft magnetic materials, including alloy powders, iron powder cores, and alloy powder cores for use in electric vehicles, charging piles, solar energy, UPS, white goods, and other fields. It serves automotive, home appliance, motorcycle, mechanical engineering, and other industries. The company was formerly known as Ningbo Tongmuo new materials Group Co., Ltd. and changed its name to NBTM New Materials Group Co., Ltd. in March 2007. NBTM New Materials Group Co., Ltd. is based in Ningbo, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315191",
        "website": "http://www.pm-china.com",
        "market_cap": 4912620032
    },
    "600148.SS": {
        "short_name": "CHANGCHUN YIDONG CLUTCH",
        "long_name": "Changchun Yidong Clutch CO.,LTD",
        "summary": "Changchun Yidong Clutch CO.,LTD engages in the development, production, and sales of automobile clutches in China and internationally. Its products include clutches, including driven desk and cover assembly products; and hydraulic lifting products, such as hydraulic locks and cylinders, and manual and electric pumps. The company was founded in 1992 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.ccyd.com.cn",
        "market_cap": 1843953408
    },
    "600151.SS": {
        "short_name": "SHANGHAI AEROSPACE AUTOMOBILE E",
        "long_name": "Shanghai Aerospace Automobile Electromechanical Co., Ltd.",
        "summary": "Shanghai Aerospace Automobile Electromechanical Co., Ltd. develops, sells, and installs aerospace photovoltaic products in China and internationally. It also engages in the sale of solar cells and modules; marketing and industrial platform management; provision of design and installation contracting services for photovoltaic distributed systems; and provision of photovoltaic and energy storage system integration services. In addition, the company provides various automobile thermal systems, such as automobile HVAC modules, powertrain cooling modules, charge air coolers, liquid cooled condensers, radiators, T&C evaporators, fixed swashplate compressors, variable swashplate compressors, oil coolers, HCAC controllers, and automatic control panels. Further, it provides research and development, production, and sale of application products in the civil-military integration fields. The company was founded in 1998 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.ht-saae.com",
        "market_cap": 12951276544
    },
    "600182.SS": {
        "short_name": "GITI TIRE CORP",
        "long_name": "Giti Tire Corporation",
        "summary": "Giti Tire Corporation produces and sells automobile tires. The company was formerly known as Hualin Tyre Co., Ltd. and changed its name to Giti Tire Corporation in May 2005. Giti Tire Corporation was founded in 1993 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.gititirecorp.com",
        "market_cap": 4464200192
    },
    "600218.SS": {
        "short_name": "ANHUI QUANCHAI ENGINE CO",
        "long_name": "Anhui Quanchai Engine Co., Ltd.",
        "summary": "Anhui Quanchai Engine Co., Ltd. researches, develops, manufactures, and sells diesel engines in China, Southeast Asia, Europe, and internationally. Its products include vehicle diesel, low-speed truck diesel, non road diesel, fire fighting/water pump, and generator engines. The company provides diesel engines for automobiles, forklifts, agricultural equipment, construction machineries, and generating sets. Anhui Quanchai Engine Co., Ltd. was founded in 1998 and is based in Chuzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chuzhou",
        "zipcode": "239500",
        "website": "http://www.quanchai.com.cn",
        "market_cap": 3359357952
    },
    "600386.SS": {
        "short_name": "BEIJING BASHI MEDIA CO. LTD.",
        "long_name": "Beijing Bashi Media Co., Ltd.",
        "summary": "Beijing Bashi Media Co., Ltd. engages in the media, automobile services, and investment and financing businesses. The company was formerly known as Beijing Bus Co., Ltd. Beijing Bashi Media Co., Ltd. was founded in 1999 and is based in Beijing, China. Beijing Bashi Media Co., Ltd. is a subsidiary of Beijing Public Transport Holdings (Group) Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100048",
        "website": "http://www.bbcm.com.cn",
        "market_cap": 2870784000
    },
    "600469.SS": {
        "short_name": "AEOLUS TYRE CO",
        "long_name": "Aeolus Tyre Co., Ltd.",
        "summary": "Aeolus Tyre Co., Ltd. engages in the manufacture and sale of tires for trucks, buses, earthmoving, and agricultural machinery. The company was founded in 1965 and is headquartered in Jiaozuo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiaozuo",
        "zipcode": null,
        "website": "http://www.aeolustyre.com",
        "market_cap": 3611816960
    },
    "600501.SS": {
        "short_name": "AEROSUN CORPORATION LTD",
        "long_name": "Aerosun Corporation",
        "summary": "Aerosun Corporation manufactures and sells special purpose vehicles in China and internationally. The company offers special vehicle products, such as aircraft refueller, oil refueller, and other fuel transportation vehicles; and sanitation vehicles, including compression garbage, garbage dump, detachable container garbage, road sweeper, washing sweeper, flushing vehicle, high pressure washing, sewerage collect, and fertilizer collection vehicles. It also provides flexible piping products, such as expansion joints and reinforced thermal plastic piping products; pressure vessel products; and art engineering products. In addition, the company offers metal hoses, which are used in various fields, such as automobile, air conditioner, construction, gas, and decration. Further, it develops and produces mobile satellite communication systems, laser gyro, and other related products. Aerosun Corporation was founded in 1999 and is headquartered in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211100",
        "website": "http://www.aerosun.cn",
        "market_cap": 3850535936
    },
    "600523.SS": {
        "short_name": "GUIZHOU GUIHANG AUTOMOTIVE COMP",
        "long_name": "Guizhou Guihang Automotive Components Co.,Ltd",
        "summary": "Guizhou Guihang Automotive Components Co.,Ltd develops, manufactures, and distributes automobile and motorcycle components in China and internationally. Its automobile components include air filter and radiator series; car key assembly and switch series; and automobile door and window glass lifters, as well as aerospace product series and plastic extrusions. The company exports its products. It also engages in the technology development and research activities. Guizhou Guihang Automotive Components Co.,Ltd is headquartered in Guiyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": "550009",
        "website": "http://www.gzghgf.com",
        "market_cap": 5555233280
    },
    "600660.SS": {
        "short_name": "FUYAO GLASS INDUSTRY GROUP CO. ",
        "long_name": "Fuyao Glass Industry Group Co., Ltd.",
        "summary": "Fuyao Glass Industry Group Co., Ltd., together with its subsidiaries, provides solutions of safety glass for various transportation vehicles in China and internationally. It designs, manufactures, sells, and services automotive grade float glass, automotive glass, locomotive glass, luggage racks, and vehicle window trims, as well as offers relevant services. The company provides thermal insulation, sound insulation, head-up display, dimmable, ultraviolet-proof, water proof, solar energy, semi-tempered laminated, acoustic, heating, hydrophobic, dimming, antenna, heat insulation, lightweight, ambient, light transmittance, coated, and ultraviolet-cut glasses. It also offers photovoltaic and panoramic sunroofs; exterior decoration products; flush styling windows; and encapsulated glass and sliding window assemblies, as well as enveloping edge modularization products. The company was formerly known as Fujian Yaohua Glass Industry Group Co., Ltd. and changed its name to Fuyao Glass Industry Group Co., Ltd. in June 1992. Fuyao Glass Industry Group Co., Ltd. was founded in 1987 and is headquartered in Fuqing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuqing",
        "zipcode": null,
        "website": "http://www.fuyaogroup.com",
        "market_cap": 137657237504
    },
    "600676.SS": {
        "short_name": "SHANGHAI JIAO YUN GROUP CO LTD",
        "long_name": "Shanghai Jiao Yun Group Co., Ltd.",
        "summary": "Shanghai Jiao Yun Group Co., Ltd. manufactures and sells automobile parts in China. It also offers road freight and logistics, road passenger transport, tourism, and automotive sales and after-sales services. The company was founded in 1993 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200070",
        "website": "http://www.cnsjy.com",
        "market_cap": 4587065344
    },
    "600699.SS": {
        "short_name": "NINGBO JOYSON ELECTRONIC CORP",
        "long_name": "Ningbo Joyson Electronic Corp.",
        "summary": "Ningbo Joyson Electronic Corp. researches, develops, and manufactures automotive components in China, and internationally. It offers automotive safety products; driver control systems, air conditioning control systems, electronic control units, and sensor systems; new energy vehicle power control units; and smart car link products. The company was founded in 2004 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.joyson.cn",
        "market_cap": 21916641280
    },
    "600715.SS": {
        "short_name": "CULTURAL INVESTMENT HOLDINGS CO",
        "long_name": "Cultural Investment Holdings Co.,Ltd",
        "summary": "Cultural Investment Holdings Co., Ltd. engages in film and online game operations. The company is involved in the cinema film screenings and related derivatives business; investments in film and television production and distribution; the provision of entertainment brokerage and related services; and development and operation of online games. It also engages in the development, production, and sale of automobile bodies, and provision of other automobile production support services. The company was formerly known as Song Liao Automotive Co., Ltd. and changed its name to Cultural Investment Holdings Co., Ltd. in April 2016. Cultural Investment Holdings Co., Ltd. was founded in 1993 and is based in Shenyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenyang",
        "zipcode": "110101",
        "website": null,
        "market_cap": 5898423296
    },
    "600741.SS": {
        "short_name": "HUAYU AUTOMOTIVE SYSTEMS CO LTD",
        "long_name": "HUAYU Automotive Systems Company Limited",
        "summary": "HUAYU Automotive Systems Company Limited researches and develops, manufactures, and sells automotive parts worldwide. The company offers intelligent driving and vision products, and smart cabins; electric drive systems, thermal and battery management systems, and pump products; and automotive fuel systems. It also provides chassis systems comprising suspension, steering, braking, and transmission systems; and interior and exterior parts, seats, and passive safety systems. HUAYU Automotive Systems Company Limited was formerly known as Shanghai Bus Industry (Group) Co., Ltd. and changed its name as HUAYU Automotive Systems Company Limited on April 20, 2009. The company was founded in 1992 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200041",
        "website": "http://www.hasco-group.com",
        "market_cap": 78786469888
    },
    "600742.SS": {
        "short_name": "CHANGCHUN FAWAY AUTOMOBILE COMP",
        "long_name": "Changchun FAWAY Automobile Components Co.,Ltd",
        "summary": "Changchun FAWAY Automobile Components Co.,Ltd designs, develops, manufactures, and sells auto parts in China. It offers car seats, instrument panels, door panels, seat frames, bumpers, grilles, mirrors, automotive filters, automotive lighting and stamping products, wheel assemblies, automotive electronics, and other automotive components. The company was formerly known as Changchun FAW Sihuan Automobile Co., Ltd. and changed its name to Changchun FAWAY Automobile Components Co.,Ltd in December 2008. Changchun FAWAY Automobile Components Co.,Ltd was founded in 1993 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": "130011",
        "website": "http://www.fawfw.com.cn",
        "market_cap": 6610915840
    },
    "600933.SS": {
        "short_name": "IKD CO LTD",
        "long_name": "IKD Co., Ltd.",
        "summary": "Ikd Co., Ltd. researches, develops, produces, and sells auto high-precision aluminum die casting products for automobile industry in the United States, Europe, and Asia. The company offers wiper, filter, air condition, damper, steering, mirror, braking, engine lubrication, auto engine intake air control, auto transmission, engine electronic control, heuristic motor, and engine cooling systems, as well as oil pumps and cylinder blocks for auto parts suppliers. Ikd Co., Ltd. was founded in 2003 and is headquartered in Ningbo, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315033",
        "website": "http://www.ikd-china.com",
        "market_cap": 12651909120
    },
    "600960.SS": {
        "short_name": "BOHAI AUTOMOTIVE SYSTEMS CO LTD",
        "long_name": "Bohai Automotive Systems CO., LTD.",
        "summary": "Bohai Automotive Systems Co., Ltd. manufactures and sells pistons in China and internationally. Its pistons are used in passenger and commercial, engineering, marine, agriculture, general motor, and other vehicles. The company was formerly known as Shandong Binzhou Bohai Piston Co., Ltd. and changed its name to Bohai Automotive Systems Co., Ltd. in October 2017. Bohai Automotive Systems Co., Ltd. is based in Binzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Binzhou",
        "zipcode": "256602",
        "website": "http://www.bhpiston.com",
        "market_cap": 4039692800
    },
    "601058.SS": {
        "short_name": "SAILUN GROUP CO LTD",
        "long_name": "Sailun Group Co., Ltd.",
        "summary": "Sailun Group Co., Ltd. researches and develops, produces, sells, and services tires in China. It provides car, SUV, LTR, winter, explosion-proof, and racing tires; truck, bus, and snow tires; and construction machinery, mining giant, and agricultural tires. The company was formerly known as Sailun Jinyu Group Co., Ltd. Sailun Group Co., Ltd. was founded in 2002 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266045",
        "website": "http://www.sailuntyre.com",
        "market_cap": 28312930304
    },
    "601163.SS": {
        "short_name": "TRIANGLE TYRE CO LTD",
        "long_name": "Triangle Tyre Co., Ltd",
        "summary": "Triangle Tyre Co., Ltd researches, develops, designs, manufactures, and markets various tire products. Its products include commercial tires, passenger tires, bias off-the-road (OTR) tires, radial OTR tires, jumbo OTR tires, etc., as well as specialty tires. The company provides its products through branches, as well as dealers and online in North America, Europe, Australia, Russia, and India covering 180 countries and regions. Triangle Tyre Co., Ltd was founded in 1976 and is based in Weihai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weihai",
        "zipcode": "264200",
        "website": "http://www.triangle.com.cn",
        "market_cap": 12064000000
    },
    "601689.SS": {
        "short_name": "NINGBO TUOPU GROUP CO LTD",
        "long_name": "Ningbo Tuopu Group Co., Ltd.",
        "summary": "Ningbo Tuopu Group Co., Ltd. researches, develops, manufactures, and sells automobile parts to automobile manufacturers in China and internationally. The company offers vibration control products, including powertrain mounting systems, chassis bushings, rubber metal parts, torsional vibrational dampers, and aluminum die-casting products; interior and trunk trims, interior trim materials, and acoustic and insulation products; and power chassis systems, such as sub-frames, control arms, and steering knuckles. It also provides mechatronic systems comprising intelligent brake systems, electric power steering columns, automotive mechanical steering gears, electronic vacuum pumps, brake vacuum switches, electric wastegate actuators, electronic water and purge pumps, seat pneumatic comfort systems, and electronic stability controls; and light alloy structural parts, including shock towers, torsion beams, chassis brackets, longitudinal beams, and B-pillars. The company was founded in 1983 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315800",
        "website": "http://www.tuopu.com",
        "market_cap": 43674243072
    },
    "601717.SS": {
        "short_name": "ZHENGZHOU COAL MINING MACHINERY",
        "long_name": "Zhengzhou Coal Mining Machinery Group Company Limited",
        "summary": "Zhengzhou Coal Mining Machinery Group Company Limited, together with its subsidiaries, manufactures and sells coal mining and excavating equipment in the People's Republic of China, Germany, and internationally. It operates through Manufacture of Coal Mining Machinery and Manufacture of Auto Parts segments. The company offers shearer and intelligent longwall face equipment that are used in ultra-thin, thin, thin-medium, thick, and ultra-thick coal seams; armored face conveyors, which are used in conventional mining, fully-mechanized mining, and fully-mechanized top coal caving; hydraulic roof supports; and intelligent control system that encompasses hydraulic support electro-hydraulic control, shearer control and navigation, longwall face video monitoring, intelligent pumping, gate road centralized control, and surface remote monitoring systems, as well as intelligent longwall face big data platform and intelligent mine app. It also provides boost recuperation machine, generators, and starter motors. In addition, the company engages in the manufacture of hydraulic products; trading of raw materials; commercial factoring activities; and research and development, manufacture, sale, and service of auto parts. Further, the company is involved in hotel management and construction services; sale of molding and metal materials; the provision of aftermarket service of mining machinery, software and IT services, and technology services; and research, development, and manufacture of mining products. Zhengzhou Coal Mining Machinery Group Company Limited was founded in 1958 and is headquartered in Zhengzhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450016",
        "website": "http://www.zzmj.com",
        "market_cap": 16790212608
    },
    "601799.SS": {
        "short_name": "CHANGZHOU XINGYU AUTOMOTIVE LIG",
        "long_name": "Changzhou Xingyu Automotive Lighting Systems Co.,Ltd.",
        "summary": "Changzhou Xingyu Automotive Lighting Systems Co.,Ltd. engages in the research and development, manufacture, and sale of automotive lamps in China. It develops and offers LED light source systems and domestic lamp assemblies. The company was founded in 1993 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213022",
        "website": "http://xyl.cn",
        "market_cap": 57727442944
    },
    "601966.SS": {
        "short_name": "SHANDONG LINGLONG TYRE CO LTD",
        "long_name": "Shandong Linglong Tyre Co., Ltd.",
        "summary": "Shandong Linglong Tyre Co., Ltd. manufactures and sells tires in the People's Republic of China. The company offers passenger car, SUV, winter, truck and bus, and specialty tires. It also exports its products to approximately 180 countries and regions, such as Europe, the Middle East, the United States, Africa, and the Asia-Pacific. The company was founded in 1975 and is based in Zhaoyuan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhaoyuan",
        "zipcode": "265406",
        "website": "http://www.linglong.cn",
        "market_cap": 61038784512
    },
    "603006.SS": {
        "short_name": "SHANGHAI LIANMING MACHINERY CO ",
        "long_name": "Shanghai Lianming Machinery Co., Ltd.",
        "summary": "Shanghai Lianming Machinery Co., Ltd. engages in the development and sale of auto parts to the automotive industry in China. It offers auto body parts, and automotive stampings and welding assembly parts. The company also provides supply chain management of third-party logistics services. The company was founded in 2003 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.shanghailmjx.com",
        "market_cap": 1801865600
    },
    "603009.SS": {
        "short_name": "SHANGHAI BEITE TECHNOLOGY CO LT",
        "long_name": "Shanghai Beite Technology Co., Ltd.",
        "summary": "Shanghai Beite Technology Co., Ltd. provides metal products for steering and shock absorber piston rod customers primarily in China. Its products include rack blanks, semi-finished racks, finished racks, finished valve sleeves, semi-finished input shafts, semi-finished worm shafts, pinion blanks, semi-finished pinions, piston rod blanks, semi-finished piston rods, and finished piston rods. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201816",
        "website": "http://www.sh-beite.com",
        "market_cap": 2132471808
    },
    "603013.SS": {
        "short_name": "YAPP AUTOMOTIVE SYSTEMS CO LTD",
        "long_name": "YAPP Automotive Systems Co., Ltd.",
        "summary": "YAPP Automotive Systems Co., Ltd. researches, develops, manufactures, and markets automotive fuel systems to auto manufacturer in China and internationally. It offers plastic fuel systems and emission control systems. The company is headquartered in Yangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yangzhou",
        "zipcode": "225009",
        "website": "http://www.yapp.com",
        "market_cap": 7538538496
    },
    "603023.SS": {
        "short_name": "VITI EELECTRONICS CO LTD",
        "long_name": "Harbin VITI Electronics Co., Ltd.",
        "summary": "Harbin VITI Electronics Co., Ltd. researches, manufactures, and sells electronic products for cars and buses in China. It offers bus switch, bus slave, bus bridge, bus processor, bus management, bus door control, bus fuel data acquisition, and bus signal distribution modules, as well as vehicle remote wireless monitoring systems and tire pressure monitoring systems. The company also provides combination, bus, and bus digital color LCD instruments; recorder display and printing, recorder identification, and vehicle traveling data recorder display and print modules, as well as vehicle traveling data recorders; central processors; central electric boxes; and retarder power switches. In addition, it offers ECU control units, including LED trunk light control modules, retarder control units, speed controllers, wiper intermittent controllers, flash relays, water level alarm controllers, rocker switch light boxes, overvoltage protection controllers, retarder foot controllers, and engine stall delay relays. Further, the company provides sensor products comprising liquid level alarm switches, capacitive and resistive fuel level sensors, temperature sensors, odometer sensors, air pressure sensors, water level alarms, low air pressure alarms, electronic speed sensors, oil pressure alarm sensors, temperature alarm sensors, magnetic reed oil level sensors, and swing arm oil level sensors. Harbin VITI Electronics Co., Ltd. was founded in 2000 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150060",
        "website": "http://www.viti.net.cn",
        "market_cap": 2540601600
    },
    "603035.SS": {
        "short_name": "JIANGSU CHANGSHU AUTOMOTIVE TRI",
        "long_name": "Jiangsu Changshu Automotive Trim Group Co., Ltd.",
        "summary": "Jiangsu Changshu Automotive Trim Group Co., Ltd. manufactures and sells automotive interiors in China and internationally. It offers instrument panels, center consoles, door panel systems, pillars and sills, seating products, other interior components, and exterior components. The company was formerly known as Changshu Automotive Trim Co., Ltd. and changed its name to Jiangsu Changshu Automotive Trim Group Co., Ltd. In September 2020. The company was founded in 1992 and is headquartered in Changshu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changshu",
        "zipcode": "215500",
        "website": "http://www.caip.com.cn",
        "market_cap": 5406831616
    },
    "603037.SS": {
        "short_name": "SHANGHAI CARTHANE CO LTD",
        "long_name": "Shanghai Carthane Co.,Ltd.",
        "summary": "Shanghai Carthane Co.,Ltd. researches, develops, manufactures, and sells suspension related PUR products in China. It offers suspension products comprising plastic parts, dust covers, polyurethane buffer bit blocks, lower spring cushions, spring sheaths, recovery buffer stoppers, and spring upper support products; and control products, such as pedal assemblies. The company also provides polyurethanes products, including high-bearing polyurethane rubber tires; polyurethane elastomer products; and elastic wear resistant materials and high-load wheels. It exports its products to North America, Europe, Japan, Korea, etc. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.carthane.com",
        "market_cap": 1709886208
    },
    "603040.SS": {
        "short_name": "HANGZHOU XZB TECH CO LTD",
        "long_name": "Hangzhou XZB Tech Co.,Ltd",
        "summary": "Hangzhou XZB Tech Co.,Ltd researches, develops, manufactures, and sells valve train systems and parts for the car industry. The company provides valve cotters, valve spring retainers, hydraulic lash adjusters and finger followers, push rods, and tappets for heavy duty diesel engines. It also offers precision cold forming components for power tool, household electrical appliance, aerospace, machinery, and other applications. The company was founded in 2002 and is based in Hangzhou, China. Hangzhou XZB Tech Co.,Ltd is a subsidiary of Hangzhou Zuofeng Investment Management Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.xzbco.com",
        "market_cap": 2176657408
    },
    "603085.SS": {
        "short_name": "ZHEJIANG TIANCHENG CONTROLS CO",
        "long_name": "Zhejiang Tiancheng Controls Co., Ltd.",
        "summary": "Zhejiang Tiancheng Controls Co., Ltd. engages in the research and development, production, sale, and service of automobile seats in China and internationally. The company's products include construction machinery seats, commercial vehicle seats, passenger car seats, aviation seats, and child safety seats. Zhejiang Tiancheng Controls Co., Ltd. was founded in 1992 and is based in Tiantai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tiantai",
        "zipcode": null,
        "website": "http://www.china-tc.com",
        "market_cap": 2706344704
    },
    "603121.SS": {
        "short_name": "SHANGHAI SINOTEC CO LTD",
        "long_name": "Shanghai Sinotec (Group) Co., Ltd.",
        "summary": "Shanghai Sinotec (Group) Co., Ltd. engages in the development and production of automobile and turbocharger parts in China. The company offers bushings, turbine housings, turbocharger middle cases, turbine, and pull rods, as well as connecting and cover plate assemblies. It also provides import and export customs clearance, foreign exchange settlement, trade financing, logistics, export rebates, and other import and export services. The company also exports its products to North America and Europe. It serves automobile and turbocharger manufacturer companies. The company was formerly known as Shanghai Sinotec (Group) Co., Ltd. The company was founded in 2006 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.sinotec.cn",
        "market_cap": 2822688000
    },
    "603158.SS": {
        "short_name": "CHANGZHOU TENGLONG AUTO PARTS C",
        "long_name": "Changzhou Tenglong AutoPartsCo.,Ltd.",
        "summary": "Changzhou Tenglong AutoPartsCo.,Ltd. researches, develops, manufactures, and sells auto parts in China. The company offers air-conditioning pipe lines, such as compressor suction, IHX, compressor exhaust, expansion valve inlet and outlet, and condenser connecting pipe assemblies; auto heat exchange connecting tubes, including heater and oil cooling inlet and outlet pipes, and evaporator inlet pipes; and auto heat exchange accessories comprising filling valves, connectors, covers, flanges, and brackets. It also provides receiving driers; auto sensors consisting of diesel engine exhaust temperature, water temperature, and sunlight sensors; EGR cooling parts; auto precision aluminum tubes, such as intercooler, afflux, and flat tubes, as well as KOMO pipes; and reservoir package in master cylinder for automobile brake systems. The company also exports its products to North America, South America, Europe, Japan, and South Asia regions. Changzhou Tenglong AutoPartsCo.,Ltd. was founded in 1997 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213149",
        "website": "http://www.cztl.com",
        "market_cap": 3632094720
    },
    "603166.SS": {
        "short_name": "GUILIN FUDA CO LTD",
        "long_name": "GUILIN FUDA Co.,Ltd.",
        "summary": "GUILIN FUDA Co.,Ltd. develops, produces, and sells auto parts and components in China. Its products include engine crankshafts, automobile clutches, gears, precision forgings, and bolts. The company is based in Guilin, China. GUILIN FUDA Co.,Ltd. is a subsidiary of Fuda Holdings Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guilin",
        "zipcode": "541199",
        "website": "http://www.glfoto.cn",
        "market_cap": 4007968768
    },
    "603179.SS": {
        "short_name": "JIANGSU XINQUAN AUTOMOTIVE TRIM",
        "long_name": "Jiangsu Xinquan Automotive Trim Co.,Ltd.",
        "summary": "Jiangsu Xinquan Automotive Trim Co.,Ltd. designs, develops, manufactures, sells, and supplies auto parts in China. The company offers interior and exterior trim components and molds; and dashboards, passenger car cockpit system assemblies, and heavy truck top cabinets. Jiangsu Xinquan Automotive Trim Co.,Ltd. was founded in 2001 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": null,
        "website": "http://www.xinquan.cn",
        "market_cap": 12541271040
    },
    "603197.SS": {
        "short_name": "SHANGHAI BAOLONG AUTOMOTIVE COR",
        "long_name": "Shanghai Baolong Automotive Corporation",
        "summary": "Shanghai Baolong Automotive Corporation manufactures and sells automotive parts and components in China. It offers tire pressure monitoring systems (TPMS) for passenger cars and commercial vehicles, TPMS service kits, TPMS OE replacement sensors, pressure and temperature sensors, rain sensors, view systems, etc. The company also provides tire and wheel service products comprising tire valves and accessories, wheel balancing weights and related tools, wheel bolts and nuts, and others; and multi-functional steel exhaust components, such as tailpipes, cones, mufflers, etc., as well as air springs, hydro-forming automotive body parts, and aluminum parts. It serves car makers and Tier 1 suppliers, as well as the tuning market. Shanghai Baolong Automotive Corporation was founded in 1997 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201619",
        "website": "http://www.baolong.biz",
        "market_cap": 4871423488
    },
    "603239.SS": {
        "short_name": "ZHEJIANG XIANTONG RUBBER AND PL",
        "long_name": "Zhejiang Xiantong Rubber&Plastic Co.,Ltd",
        "summary": "Zhejiang Xiantong Rubber&Plastic Co.,Ltd. produces and sells automotive seals in China. The company's products include door and window seals; decorative parts; and metal rolls, as well as rolled parts. The company was founded in 1994 and is based in Xianju, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xianju",
        "zipcode": null,
        "website": "http://www.zjxtgf.cn",
        "market_cap": 4261132800
    },
    "603266.SS": {
        "short_name": "NINGBO TIANLONG ELECTRONICS CO ",
        "long_name": "Ningbo Tianlong Electronics Co., Ltd.",
        "summary": "Ningbo Tianlong Electronics Co., Ltd. produces and sells plastic parts for electronic products in China. The company offers industrial parts for use in medium-low and low voltage products, adapters, and low-voltage terminals and distribution cabinets. It also provides plastic casings for cellular phones and digital cameras; and high precision plastic parts, such as car cooling fans, gears, gear housings, BCM housings, GID/TID housings, brush holders, filter components, and other small components for vehicles. In addition, the company produces molds for consumer products, precision automotive parts, precision industrial products, etc.; and plastic parts for printers and other consumer products, wall plates, and power sockets, as well as engages in the turnkey assembly of cell phone and digital camera mockup. Further, it offers plastic bobbins for deflector yolks, transformers, and ballasts, as well as PCM parts, control wall plates, and other precision plastic components. The company also exports its products to Japan, North America, Germany, and other countries. Ningbo Tianlong Electronics Co., Ltd. is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315336",
        "website": "http://www.ptianlong.com",
        "market_cap": 2297422080
    },
    "603286.SS": {
        "short_name": "JIANGSU RIYING ELECTRONICS CO L",
        "long_name": "Jiangsu Riying Electronics Co., Ltd.",
        "summary": "Jiangsu Riying Electronics Co., Ltd. designs, manufactures, and sells automotive washing systems and wiring harnesses. It offers washing systems for front and rear windshields, headlights, and sensors; precision injections; vehicle electronics, such as rain, temperature, and sunlight light sensors, as well as sunroof controllers; and automotive wiring harnesses and connectors. The company was founded in 1998 and is headquartered in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": null,
        "website": "http://www.riyingcorp.com",
        "market_cap": 1278863616
    },
    "603305.SS": {
        "short_name": "NINGBO XUSHENG AUTO TECHNOLOGY ",
        "long_name": "Ningbo Xusheng Auto Technology Co., Ltd.",
        "summary": "Ningbo Xusheng Auto Technology Co., Ltd. produces and sells auto parts and industrial parts. The company offers gearshift system, and transmission and battery systems; and heavy truck clutch, battery pack, motor, transmission, and reducer housings, as well as motor and reducer integrated cases. The company was formerly known as Ningbo Xusheng Machinery Co., Ltd. and changed its name to Ningbo Xusheng Auto Technology Co., Ltd. in August 2015. The company was founded in 2003 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315806",
        "website": "http://www.nbxus.com",
        "market_cap": 14662846464
    },
    "603331.SS": {
        "short_name": "ZHEJIANG BAIDA PRECISION MANUFA",
        "long_name": "Zhejiang Baida Precision Manufacturing Corp.",
        "summary": "Zhejiang Baida Precision Manufacturing Corp. produces and sells air-conditioning compressor parts, refrigerator compressor parts, auto parts, cold extrusion parts, and other products in China. The company also exports its products to approximately 10 countries and regions in Europe, the United States, Southeast Asia, etc. Zhejiang Baida Precision Manufacturing Corp. was founded in 1995 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318000",
        "website": "http://www.baidapm.com",
        "market_cap": 1818162432
    },
    "603335.SS": {
        "short_name": "GUANGDONG DCENTI AUTO-PARTS STO",
        "long_name": "Guangdong Dcenti Auto-Parts Stock Limited Company",
        "summary": "Guangdong Dcenti Auto-Parts Stock Limited Company researches and develops, manufactures, and sells auto-parts in China. It provides aluminum alloy wheels to chain stores. The company offers STW, LM, and DCTL wheels under the DCENTI brand name; Borghini, Red Sport, U2, Velocity, and GIMA wheels under the Velocity series; and RDR wheels under the RDR series. It also exports its products. The company was formerly known as Stonewell International Corporation and changed its name to Guangdong Dcenti Auto-Parts Stock Limited Company in July 2014. Guangdong Dcenti Auto-Parts Stock Limited Company was founded in 1999 and is based in Taishan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taishan",
        "zipcode": null,
        "website": "http://www.dcenti.cn",
        "market_cap": 1879556480
    },
    "603348.SS": {
        "short_name": "GUANGDONG WENCAN DIE CASTING CO",
        "long_name": "Guangdong Wencan Die Casting Co., Ltd.",
        "summary": "Guangdong Wencan Die Casting Co., Ltd. researches, develops, produces, and sells automobile aluminum alloy precision die castings worldwide. Its automobile castings include engine systems, electronic control systems, transmission systems, chassis steering systems, brake systems, air management systems, wiper systems, and body structure parts. The company also provides non-automotive pressure castings, including yacht driving axle housings, yacht engine covers, and heat sinks. Guangdong Wencan Die Casting Co., Ltd. was founded in 1998 and is headquartered in Foshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": null,
        "website": "http://www.wencan.com",
        "market_cap": 8307392000
    },
    "603358.SS": {
        "short_name": "HUADA AUTOMOTIVE TECHNOLOGY CO ",
        "long_name": "Huada Automotive Technology Corp.,Ltd",
        "summary": "Huada Automotive Technology Corp.,Ltd produces and sells car parts and components primarily in China. The company was founded in 1990 and is based in Jingjiang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingjiang",
        "zipcode": "214500",
        "website": "http://www.hdqckj.com",
        "market_cap": 5205760000
    },
    "603489.SS": {
        "short_name": "BAFANG ELECTRIC (SUZHOU) CO LTD",
        "long_name": "Bafang Electric (Suzhou) Co.,Ltd.",
        "summary": "Bafang Electric (Suzhou) Co., Ltd. manufactures e-mobility components and complete systems for e-bikes and electric scooters in Europe, China, and the United States. It offers mid, front, rear, BBS, e-kickboard, and e-tricycle drive systems; front, mid, rear, and complete wheel motors; LED and LCD human machine interface products; carrier, frame downtube, and seat tube batterie, as well as chargers; speed detection and pedal sensor products; sine and square wave controllers; and bus, light, power, and motor extension cables. The company also provides various accessories, such as bash guards, carriers, throttles, e-brakes, chain wheels, cranks, fixation parts, handle lock nuts, chain cases, and motor covers. Bafang Electric (Suzhou) Co., Ltd. was founded in 2003 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215122",
        "website": "http://www.bafang-e.com",
        "market_cap": 28634970112
    },
    "603596.SS": {
        "short_name": "BETHEL AUTOMOTIVE SAFETY SYSTEM",
        "long_name": "Bethel Automotive Safety Systems Co., Ltd",
        "summary": "Bethel Automotive Safety Systems Co., Ltd develops, manufactures, and sells vehicle braking systems for commercial vehicles in China. The company offers front and rear disc brakes, drum brakes, rear integrated parking brakes, brake master cylinders, vacuum boosters, cast aluminum steering knuckles, electronic parking systems, anti-lock braking systems (ABS), vehicle stability control systems, brake assemblies, brake caliper assemblies, air pressure ABS, pneumatic disc brakes, and pressure casting aluminum alloy products. Bethel Automotive Safety Systems Co., Ltd was founded in 2004 and is based in Wuhu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhu",
        "zipcode": null,
        "website": "http://www.btl-auto.com",
        "market_cap": 14687767552
    },
    "603655.SS": {
        "short_name": "CHANGZHOU LANGBO SEAL POLYTRON ",
        "long_name": "Changzhou Langbo Sealing Technologies Co.,Ltd.",
        "summary": "Changzhou Langbo Sealing Technologies Co.,Ltd. produces and sells rubber sealing parts and rubber products in China. The company provides oil seals, O-rings, damping parts, and other rubber products. It also offers automotive products, such as automotive fuel system sealing parts, auto turbo tubes, auto gearbox fuel tanks, and auto engine oil seals; seal parts for automotive main cylinder of brakes and air conditioning compressor system; and rubber parts for automotive power steering and lamp systems, brake boosters and systems, and air conditioning piping systems. In addition, the company provides railway sleeper pads, positioning sleeves for bogie systems, motor air duct rubber parts, engineering machinery rubber parts, and aviation series rubber products. It serves rail transportation, machinery manufacturing, urban construction, and other fields, as well as automotive industry under the JMP brand. The company was founded in 1985 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": null,
        "website": "http://www.jmp-seal.com",
        "market_cap": 2398779904
    },
    "603677.SS": {
        "short_name": "QIJING MACHINERY CO LTD",
        "long_name": "Qijing Machinery Co., Ltd.",
        "summary": "Qijing Machinery Co., Ltd. researches and develops, manufactures, and sells washing machine gear cases, home appliance parts, auto parts, and power tools. The company was founded in 1996 and is headquartered in Ningbo, China. Qijing Machinery Co., Ltd. is a subsidiary of Ningbo Qijing Holdings Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.qijing-m.com",
        "market_cap": 2165383936
    },
    "603701.SS": {
        "short_name": "ZHEJIANG DEHONG AUTOMOTIVE ELEC",
        "long_name": "Zhejiang Dehong Automotive Electronic & Electrical Co.,Ltd.",
        "summary": "Zhejiang Dehong Automotive Electronic & Electrical Co.,Ltd. manufactures and sells automobile alternators for commercial vehicles and passenger cars, aftermarket products, and electronic vacuum pump products. The company was founded in 1978 and is based in Huzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huzhou",
        "zipcode": "313000",
        "website": "http://www.dehong.com.cn",
        "market_cap": 2358982912
    },
    "603730.SS": {
        "short_name": "SHANGHAI DAIMAY AUTOMOTIVE INTE",
        "long_name": "Shanghai Daimay Automotive Interior Co., Ltd",
        "summary": "Shanghai Daimay Automotive Interior Co., Ltd researches, develops, produces, and sells passenger car components for OEMs and auto makers in China and internationally. The company offers sun visors, seats and headrests, steering wheels, and roof consoles. Its products include rare vanities, EPP parts, arm rests, gear knobs, seating assemblies, reading and dome lamps, overhead consoles, rear and front headrests, PU steering wheels, leather wrapping steering wheels, wood rim steering wheels, heavy truck visors, unlit and lit vanity visors, and multi-function visors. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://en.daimay.com",
        "market_cap": 11619616768
    },
    "603767.SS": {
        "short_name": "ZHEJIANG ZOMAX TRANSMISSION CO ",
        "long_name": "Zhejiang Zomax Transmission Co., Ltd.",
        "summary": "Zhejiang Zomax Transmission Co., Ltd. researches, develops, produces, and sells automotive transmission and gear products in China. It offers automotive gears, motorcycle gears, and agricultural machinery gears. The company's automotive transmission products are primarily used in light vehicles, such as pickup trucks, SUVs, MPVs, and light passenger vehicles. The company was founded in 2005 and is based in Wenling, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenling",
        "zipcode": null,
        "website": "http://www.zomaxcd.com",
        "market_cap": 2078405248
    },
    "603768.SS": {
        "short_name": "HEFEI CHANGQING MACHINERY COMPA",
        "long_name": "Changqing Machinery Company Limited",
        "summary": "Changqing Machinery Company Limited engages in the research and development, production, and sale of automotive stamping and welding parts. Its products are used in passenger cars, VIP cars, commercial vehicles, and electrophoresis. The company was founded in 2004 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230022",
        "website": "http://www.hfcqjx.com",
        "market_cap": 3035520000
    },
    "603786.SS": {
        "short_name": "KEBODA TECHNOLOGY CO  LTD",
        "long_name": "KEBODA TECHNOLOGY Co., Ltd.",
        "summary": "Keboda Technology Corp. develops and manufactures automotive electronics for automotive industry in China. The company's products include lighting control systems, motor control systems, energy management systems, etc.; cigarette lighters, power outlets, washing systems, automotive sensors, AVS actuators, liquid control valves, and others; electric pumps, preheaters, clamps, and others; and auto wiring harness, engine pre-assembled wiring harness, and special wiring harness, etc. It also exports its products internationally. The company was formerly known as Shanghai Oubao Electric Technology Corp. and changed its name to Keboda Technology Corp. in November 2007. The company was founded in 2003 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.keboda.com",
        "market_cap": 28043008000
    },
    "603788.SS": {
        "short_name": "NINGBO GAOFA AUTOMOTIVE CONTROL",
        "long_name": "Ningbo Gaofa Automotive Control System Co., Ltd.",
        "summary": "Ningbo Gaofa Automotive Control System Co., Ltd. designs, develops, manufactures, and operates automotive control products in China. The company offers variable speed control systems, electronic accelerator pedals, electronic shifters, and automotive cables. It supplies its products to automotive industry. The company was founded in 1999 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315105",
        "website": "http://www.gaofacable.com",
        "market_cap": 3018069248
    },
    "603809.SS": {
        "short_name": "CHENGDU HAONENG TECHNOLOGY CO L",
        "long_name": "Chengdu Haoneng Technology Co., Ltd.",
        "summary": "Chengdu Haoneng Technology Co., Ltd. produces and sells auto parts in China and internationally. It primarily offers synchronizer gear rings, synchronizers, combined tooth, and clutch main hubs and support. The company was founded in 2006 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610100",
        "website": "http://www.cdhntech.com",
        "market_cap": 4192824064
    },
    "603926.SS": {
        "short_name": "ZHEJIANG TIELIU CLUTCH CO LTD",
        "long_name": "Zhejiang Tieliu Clutch Co., Ltd.",
        "summary": "Zhejiang Tieliu Clutch Co., Ltd. engages in the manufacture and sale of clutch products for automobile transmission systems in China. The company provides cover assemblies, driven disk assemblies, release bearing products, four-piece sets, hydraulic bearing products, flywheel torsion dampers, hydraulic torque converters, self-adjusting clutches, brake pads, boosters, clutch master cylinders, and double acting clutches. It offers its products for passenger cars and commercial vehicles under the Iron Flow, Desa, and WESTLAKE brands. The company also exports its products to the United States, Europe, Asia, Africa, the Middle East, and other countries. Zhejiang Tieliu Clutch Co., Ltd. was founded in 2009 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311100",
        "website": "http://www.chinaclutch.com",
        "market_cap": 2367933440
    },
    "603950.SS": {
        "short_name": "XIANGYANG CHANGYUANDONGGU INDUS",
        "long_name": "Xiangyang Changyuandonggu Industry Co., Ltd.",
        "summary": "Xiangyang Changyuandonggu Industry Co., Ltd. engages in the design, manufacture, and sale of diesel engine parts to companies and manufacturers. It primarily offers cylinder blocks, heads, flywheel housings, connecting rods, engine covers, exhaust pipes, and gearboxes. The company was founded in 2001 and is based in Xiangyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiangyang",
        "zipcode": "441104",
        "website": "http://www.cydgsy.com",
        "market_cap": 4479950848
    },
    "603982.SS": {
        "short_name": "NANJING CHERVON AUTO PRECISION ",
        "long_name": "Nanjing Chervon Auto Precision Technology Co., Ltd",
        "summary": "Nanjing Chervon Auto Precision Technology Co., Ltd. engages in the research, development, production, and sale of automotive components. The company offers engine parts, such as sprocket and throttle parts; compressor parts, including swashplates and air conditioning compressor housings; transmission products comprising valve body, shift housing, hub, and gearbox hub products; new energy products that include electric motor shafts and electric vehicle motor assemblies; and steering and brake parts for use in high-end cars. It also provides gloss panels, outlets, drum tripods, drying out the air ducts, panel linings, and panels for washing machines; gears for agricultural machinery; valve lifters, pull rod heads, left and right taps, and hook up products for use in high-speed rails; and other parts. The company was founded in 2012 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211106",
        "website": "http://www.chervonauto.com",
        "market_cap": 3345519872
    },
    "603997.SS": {
        "short_name": "NINGBO JIFENG AUTO PARTS CO LTD",
        "long_name": "Ningbo Jifeng Auto Parts Co., Ltd.",
        "summary": "Ningbo Jifeng Auto Parts Co., Ltd. provides automotive headrests, armrests, headrest stems, and door stems to seating manufacturers in China and internationally. The company was founded in 1996 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315821",
        "website": "http://www.nb-jf.com",
        "market_cap": 9732226048
    },
    "605018.SS": {
        "short_name": "ZHEJIANG CHANGHUA AUTOPARTS CO ",
        "long_name": "Zhejiang Changhua Auto Parts Co., Ltd.",
        "summary": "Zhejiang Changhua Auto Parts Co., Ltd. manufactures and sells automotive fasteners and stamping parts. The company was founded in 1985 and is based in Cixi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Cixi City",
        "zipcode": "315324",
        "website": "http://www.zjchanghua.com",
        "market_cap": 5712683008
    },
    "605088.SS": {
        "short_name": "GSP AUTOMOTIVE GROUP WENZHOU CO",
        "long_name": "GSP Automotive Group Wenzhou Co.,Ltd.",
        "summary": "GSP Automotive Group Wenzhou Co.,Ltd. manufactures and sells automotive driveline components for the aftermarket worldwide. It offers drive shafts, constant velocity joints, boot kits, hub assemblies, wheel bearings, rubber mountings, and steering and suspension products. The company was founded in 1985 and is headquartered in Wenzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wenzhou",
        "zipcode": "325006",
        "website": "http://www.gsp.cn",
        "market_cap": 2734608896
    },
    "605128.SS": {
        "short_name": "SHANGHAI YANPU METAL PRODUCTS C",
        "long_name": "Shanghai YanPu Metal Products Co.,Ltd",
        "summary": "Shanghai YanPu Metal Products Co., Ltd. designs and manufactures stamping parts, assembly and welding parts, and stamping dies in China. Its products include seat, skylight, engine, and car lock stampings; and seat assembly and window roller stamping parts. The company was founded in 1999 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.shyanpu.com",
        "market_cap": 2709600000
    },
    "605228.SS": {
        "short_name": "SHENTONG TECHNOLOGY GROUP CO LT",
        "long_name": "Shentong Technology Group Co., Ltd",
        "summary": "Shentong Technology Group Co., Ltd develops, manufactures, and sells automotive parts in China. It offers automotive interiors and exteriors of plastic parts, including automobile vice-instrument boards, glove box assemblies, door handle assemblies, air outlets, air inlet grilles, A/B/C columns, wheel covers, drawer seat assemblies, engine plastic intake manifolds, engine covers, etc., as well as power train parts. The company was founded in 1972 and is based in Yuyao, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": null,
        "website": "http://www.shentong-china.com",
        "market_cap": 4267200000
    },
    "605333.SS": {
        "short_name": "KUNSHAN HUGUANG AUTO HARNESS CO",
        "long_name": "Kunshan Huguang Auto Harness Co.,Ltd.",
        "summary": "Kunshan Huguang Auto Harness Co.,Ltd. engages in the research and development, and production of automotive high and low voltage wiring harness assembly products in China. It offers engine, KSK, door, HV, front cabin, instrument, cable, and ABS wire harness products. The company is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": "215326",
        "website": "http://www.kshg.com",
        "market_cap": 5726279680
    },
    "6162.HK": {
        "short_name": "TR INTERIORS",
        "long_name": "China Tianrui Automotive Interiors Co., LTD",
        "summary": "China Tianrui Automotive Interiors Co., LTD, an investment holding company, engages in the research, development, manufacture, and sale of automotive interior and exterior decorative components and parts in the People's Republic of China. Its products are designed to be installed on heavy trucks and passenger vehicles. The company also offers design and development solutions for automotive interior decorative products, including functional specifications and appearance. It serves truck and passenger vehicle manufacturers. The company was founded in 2009 and is headquartered in Xi'an, the People's Republic of China. China Tianrui Automotive Interiors Co., LTD is a subsidiary of H&C Group Holding Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": "http://www.trqcns.com",
        "market_cap": 318000000
    },
    "6830.HK": {
        "short_name": "HUAZHONG IN-V",
        "long_name": "Huazhong In-Vehicle Holdings Company Limited",
        "summary": "Huazhong In-Vehicle Holdings Company Limited, an investment holding company, manufactures and sells automobile body parts in Mainland China and internationally. It offers internal, external structural, and decorative automobile parts covering front/rear bumpers, frontend carriers, dashboards, ABCD-pillars, air inlet grilles, and rocker panels; automobile precision moulds and tooling products; air conditioning unit casings and liquid tanks; and other non-automobile products, such as top cowl covers for engine of motorboat and office chair parts. The company also manufactures and sells plastic and automotive parts; imports and exports various products and technologies; processes and sells plastic and latex products, and spare and accessory parts; and develops in-vehicle systems and equipment. It serves automakers and automobile body parts manufacturers, as well as suppliers for automakers. The company was formerly known as Huazhong Holdings Company Limited and changed its name to Huazhong In-Vehicle Holdings Company Limited in January 2015. The company was founded in 1993 and is headquartered in Xiangshan, China. Huazhong In-Vehicle Holdings Company Limited is a subsidiary of Huayou Holdings Company Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xiangshan",
        "zipcode": null,
        "website": "http://www.cn-huazhong.com",
        "market_cap": 3662223104
    },
    "688208.SS": {
        "short_name": "UTEL INTELLIGENT TECHNOLOGY COR",
        "long_name": "Autel Intelligent Technology Corp., Ltd.",
        "summary": "Autel Intelligent Technology Corp., Ltd. engages in the research and development, production, sale, and servicing of automotive intelligent diagnostics equipment, detection and analysis systems, and automotive electronic components. It offers professional diagnostic tools, automotive tire pressure monitoring systems, ADAS series products for automotive intelligent assisted driving systems, and special and IMMO tools. The company also provides integrated intelligent maintenance cloud services; and diagnostic software. It primarily sells its products to approximately 50 countries and regions, including the United States, Germany, the United Kingdom, and Australia. The company was founded in 2004 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518055",
        "website": "http://www.autel.com",
        "market_cap": 37804498944
    },
    "688567.SS": {
        "short_name": "FARASIS ENERGY (GAN ZHOU) CO LT",
        "long_name": "Farasis Energy (Gan Zhou) Co., Ltd.",
        "summary": "Farasis Energy (Gan Zhou) Co., Ltd. engages in the power battery business. The company was founded in 2009 and is based in Ganzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ganzhou",
        "zipcode": "341000",
        "website": "http://www.farasisenergy.com.cn",
        "market_cap": 30203600896
    },
    "688819.SS": {
        "short_name": "TIANNENG BATTERY GROUP CO LTD",
        "long_name": "Tianneng Battery Group Co., Ltd.",
        "summary": "Tianneng Battery Group Co., Ltd., through its subsidiaries, engages in the research and development, production, sale, and service of lithium batteries for new energy vehicles, start-stop batteries for vehicles, and wind energy and solar energy storage batteries. The company offers lead-acid and lithium-ion power, traction, industrial backup, electric and mobile energy storage, starter, start-stop, on and off-grid, grid-connected, smart microgrid, and composite energy storage batteries. Its products are used in the fields of transportation, tourism and leisure, logistics and express delivery, sanitation cleaning, storage, communications, power, railways, ships, radio and television, UPS, digital and consumer products, and energy storage systems. The company was founded in 1986 and is headquartered in Changxing, China. Tianneng Battery Group Co., Ltd. operates as a subsidiary of Tianneng Power International Limited.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changxing",
        "zipcode": "313100",
        "website": "http://www.cn-tn.com",
        "market_cap": 42004439040
    },
    "8135.HK": {
        "short_name": "ZMFY GLASS",
        "long_name": "ZMFY Automobile Glass Services Limited",
        "summary": "ZMFY Automobile Glass Services Limited, an investment holding company, engages in the sale of automobile glass with installation/repair services for private and public motor vehicles in the People's Republic of China. The company operates through four segments: Automobile Glass, Photovoltaic System, Business Consultancy Services, and Finance Lease Services. It also trades in automobile glass to industry peers and the traders of automobile glass; and provides photovoltaic system installation, business consultancy, and finance leasing services. The company primarily serves insurance companies, car rental companies, and corporate and individual customers. It operates 29 service centers. ZMFY Automobile Glass Services Limited was founded in 1999 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.zmfy.com.hk",
        "market_cap": 261756016
    },
    "CAAS": {
        "short_name": "China Automotive Systems, Inc.",
        "long_name": "China Automotive Systems, Inc.",
        "summary": "China Automotive Systems, Inc., through its subsidiaries, manufactures and sells automotive systems and components in the People's Republic of China. It produces rack and pinion power steering gears for cars and light duty vehicles; integral power steering gears for heavy-duty vehicles; power steering parts for light duty vehicles; sensor modules; automobile steering systems and columns; and automobile electronic and hydraulic power steering systems and parts. China Automotive Systems, Inc. also markets automotive parts in North America and Brazil, as well as provides after sales services, and research and development support services. The company primarily sells its products to the original equipment manufacturing customers. China Automotive Systems, Inc. was incorporated in 1999 and is headquartered in Jingzhou City, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jingzhou",
        "zipcode": "434000",
        "website": "http://www.caasauto.com",
        "market_cap": 139450128
    },
    "CXDC": {
        "short_name": "China XD Plastics Company Limit",
        "long_name": "China XD Plastics Company Limited",
        "summary": "China XD Plastics Company Limited, together with its subsidiaries, engages in the research, development, manufacture, and sale of modified plastics primarily for automotive applications in the People's Republic of China, and Dubai, the United Arab Emirates. Its modified plastics are used to fabricate various auto components, including exteriors consisting of automobile bumpers, rearview and sideview mirrors, and license plate parts; interiors, such as door panels, dashboards, steering wheels, glove compartments, and safety belt components; and functional components comprising air conditioner casings, heating and ventilation casings, engine covers, and air ducts. The company also offers engineered plastics and environment-friendly plastics for use in oilfield equipment, mining equipment, vessel propulsion systems, and power station equipment; and polymer composite materials. Its products are also used in high-speed railways, airplanes, ships, and electronic appliances. The company sells its products through distributors, as well as directly to end customers. China XD Plastics Company Limited was founded in 1985 and is headquartered in Harbin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150060",
        "website": "http://www.chinaxd.net",
        "market_cap": 45144180
    },
    "EWC.SG": {
        "short_name": "Chaowei Power Holdings Ltd Regi",
        "long_name": "Chaowei Power Holdings Limited",
        "summary": "Chaowei Power Holdings Limited, together with its subsidiaries, manufactures and sells lead-acid motive batteries, lithium-ion batteries, and other related products for use in electric bikes, electric tricycles, and special-purpose electric vehicles in the People's Republic of China. The company also manufactures and sells storage batteries; and electrode plate dividing papers and plastic battery cases. In addition, it is involved in the research and development of solar energy generating systems, and durathon batteries, as well as property investment activities. As of December 31, 2020, the company sold its products under the CHILWEE brand through a network of 1,978 independent distributors. Chaowei Power Holdings Limited was founded in 1998 and is headquartered in Changxing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Changxing",
        "zipcode": "313100",
        "website": "http://www.chaowei.com.hk",
        "market_cap": 305418144
    },
    "GU5.SI": {
        "short_name": "$ ChinaKundaTech",
        "long_name": "China Kunda Technology Holdings Limited",
        "summary": "China Kunda Technology Holdings Limited, an investment holding company, engages in the in-mold decoration and plastic injection parts, and furniture businesses in the People's Republic of China, Europe, and internationally. It is involved in the design, development, and supply of furniture and fittings that includes cabinets, appliances, surfaces, woodwares, decorative products, and other related activities, as well as provides consultancy services. The company also supplies raw materials and machineries; offers moulds products; and provides technical and management services. It primarily serves electronics manufacturers. The company was founded in 1998 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.chinakunda.com",
        "market_cap": 10245000
    },
    "JBZY": {
        "short_name": "JB&ZJMY HOLDING COMPANY INC",
        "long_name": "JB&ZJMY Holding Company, Inc.",
        "summary": "JB&ZJMY Holding Company, Inc. focuses on developing electrical cars and their support systems. The company was formerly known as Dolat Ventures, Inc. and changed its name to JB&ZJMY Holding Company, Inc. in October 2017. JB&ZJMY Holding Company, Inc. is based in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "89128",
        "website": null,
        "market_cap": 8181
    },
    "K8A.DE": {
        "short_name": "KANDI TECHNOL.GRP DL-,001",
        "long_name": "Kandi Technologies Group, Inc.",
        "summary": "Kandi Technologies Group, Inc. develops, produces, and distributes electric vehicle (EV) products and parts, and off-road vehicles in the People's Republic of China and internationally. It offers off-road vehicles, including all-terrain vehicles, utility vehicles, go-karts, electric scooters, and electric self-balancing scooters, as well as related parts; and EV parts comprising battery packs, body parts, EV drive motors, EV controllers, air conditioners, and other auto parts. The company was formerly known as Kandi Technologies, Corp. and changed its name to Kandi Technologies Group, Inc. in December 2012. Kandi Technologies Group, Inc. was founded in 2002 and is headquartered in Jinhua, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "GER",
        "market": "de_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321016",
        "website": "http://www.kandivehicle.com",
        "market_cap": 305947776
    },
    "K8A.F": {
        "short_name": "KANDI TECHNOL.GRP DL-,001",
        "long_name": "Kandi Technologies Group, Inc.",
        "summary": "Kandi Technologies Group, Inc. develops, produces, and distributes electric vehicle (EV) products and parts, and off-road vehicles in the People's Republic of China and internationally. It offers off-road vehicles, including all-terrain vehicles, utility vehicles, go-karts, electric scooters, and electric self-balancing scooters, as well as related parts; and EV parts comprising battery packs, body parts, EV drive motors, EV controllers, air conditioners, and other auto parts. The company was formerly known as Kandi Technologies, Corp. and changed its name to Kandi Technologies Group, Inc. in December 2012. Kandi Technologies Group, Inc. was founded in 2002 and is headquartered in Jinhua, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321016",
        "website": "http://www.kandivehicle.com",
        "market_cap": 371707840
    },
    "KNDI": {
        "short_name": "Kandi Technologies Group, Inc.",
        "long_name": "Kandi Technologies Group, Inc.",
        "summary": "Kandi Technologies Group, Inc. develops, produces, and distributes electric vehicle (EV) products and parts, and off-road vehicles in the People's Republic of China and internationally. It offers off-road vehicles, including all-terrain vehicles, utility vehicles, go-karts, electric scooters, and electric self-balancing scooters, as well as related parts; and EV parts comprising battery packs, body parts, EV drive motors, EV controllers, air conditioners, and other auto parts. The company was formerly known as Kandi Technologies, Corp. and changed its name to Kandi Technologies Group, Inc. in December 2012. Kandi Technologies Group, Inc. was founded in 2002 and is headquartered in Jinhua, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Jinhua",
        "zipcode": "321016",
        "website": "http://www.kandivehicle.com",
        "market_cap": 381461248
    },
    "M3I.F": {
        "short_name": "MINTH GROUP LTD  HD-,10",
        "long_name": "Minth Group Limited",
        "summary": "Minth Group Limited, an investment holding company, designs, develops, manufactures, processes, and sells automobile body parts and molds of passenger cars in the People's Republic of China, the United States, Japan, Thailand, Germany, and Mexico. The company also manufactures, develops, and sells batteries and motor systems for electric vehicles, as well as optical parts, metal molds, automation machines, software, and production lines; manufactures buses, modified cars, and electric vehicles; develops and manages real estate properties; and offers bookkeeping services. In addition, it engages in the import and export trading, packaging materials wholesale, logistics, and technology import activities; trade and manufacture of metal products; manufacture and sale of electrical and electronic equipment; and design, development, import, and export of robots. Further, the company provides automobile glass, light metals casting, customer service and market development, agriculture, and management consulting services. The company was founded in 1992 and is headquartered in Jiaxing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jiaxing",
        "zipcode": "314006",
        "website": "http://www.minthgroup.com",
        "market_cap": 4194995200
    },
    "RYV.F": {
        "short_name": "CHINA AUTOM. SYS DL-,0001",
        "long_name": "China Automotive Systems, Inc.",
        "summary": "China Automotive Systems, Inc., through its subsidiaries, manufactures and sells automotive systems and components in the People's Republic of China. It produces rack and pinion power steering gears for cars and light duty vehicles; integral power steering gears for heavy-duty vehicles; power steering parts for light duty vehicles; sensor modules; automobile steering systems and columns; and automobile electronic and hydraulic power steering systems and parts. China Automotive Systems, Inc. also markets automotive parts in North America and Brazil, as well as provides after sales services, and research and development support services. The company primarily sells its products to the original equipment manufacturing customers. China Automotive Systems, Inc. was incorporated in 1999 and is headquartered in Jingzhou City, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Jingzhou",
        "zipcode": "434000",
        "website": "http://www.caasauto.com",
        "market_cap": 124439096
    },
    "XDH.F": {
        "short_name": "XINGDA INTL HLDGS HD -,10",
        "long_name": "Xingda International Holdings Limited",
        "summary": "Xingda International Holdings Limited, an investment holding company, manufactures and trades radial tire cords, steel cords, bead wires, and other wires in the People's Republic of China and Thailand. The company's steel cords and bead wires are used in car, light truck, cargo truck, and heavy equipment tires, as well as other rubber products. Xingda International Holdings Limited is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200062",
        "website": "http://www.xingda.com.cn",
        "market_cap": 308725792
    },
    "XNGIF": {
        "short_name": "XINGDA INTERNATIONAL HOLDINGS L",
        "long_name": "Xingda International Holdings Limited",
        "summary": "Xingda International Holdings Limited, an investment holding company, manufactures and trades radial tire cords, steel cords, bead wires, and other wires in the People's Republic of China and Thailand. The company's steel cords and bead wires are used in car, light truck, cargo truck, and heavy equipment tires, as well as other rubber products. Xingda International Holdings Limited is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200062",
        "website": "http://www.xingda.com.cn",
        "market_cap": 422082016
    },
    "ZGC.F": {
        "short_name": "ZHENGZHOU COAL M.+M.H YC1",
        "long_name": "Zhengzhou Coal Mining Machinery Group Company Limited",
        "summary": "Zhengzhou Coal Mining Machinery Group Company Limited, together with its subsidiaries, manufactures and sells coal mining and excavating equipment in the People's Republic of China, Germany, and internationally. It operates through Manufacture of Coal Mining Machinery and Manufacture of Auto Parts segments. The company offers shearer and intelligent longwall face equipment that are used in ultra-thin, thin, thin-medium, thick, and ultra-thick coal seams; armored face conveyors, which are used in conventional mining, fully-mechanized mining, and fully-mechanized top coal caving; hydraulic roof supports; and intelligent control system that encompasses hydraulic support electro-hydraulic control, shearer control and navigation, longwall face video monitoring, intelligent pumping, gate road centralized control, and surface remote monitoring systems, as well as intelligent longwall face big data platform and intelligent mine app. It also provides boost recuperation machine, generators, and starter motors. In addition, the company engages in the manufacture of hydraulic products; trading of raw materials; commercial factoring activities; and research and development, manufacture, sale, and service of auto parts. Further, the company is involved in hotel management and construction services; sale of molding and metal materials; the provision of aftermarket service of mining machinery, software and IT services, and technology services; and research, development, and manufacture of mining products. Zhengzhou Coal Mining Machinery Group Company Limited was founded in 1958 and is headquartered in Zhengzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450016",
        "website": "http://www.zzmj.com",
        "market_cap": 2104481152
    },
    "ZXAIY": {
        "short_name": "CHINA ZENIX AUTO INTL LTD",
        "long_name": "China Zenix Auto International Limited",
        "summary": "China Zenix Auto International Limited designs, manufactures, and sells commercial vehicle wheels to aftermarket and original equipment manufacturers in the People's Republic of China and internationally. The company offers tubed, tubeless, and off-road steel wheels; aluminum wheels; and wheel components, including wheel discs. It sells its products directly and through a network of distributors under the Zhengxing, Zhengxing Prince, Haixia, Zhengchang, Lianxing, and CZX brands. The company was formerly known as Richwheel Limited and changed its name to China Zenix Auto International Limited in November 2010. The company was founded in 2003 and is headquartered in Zhangzhou, the People's Republic of China. China Zenix Auto International Limited is a subsidiary of Newrace Limited.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Zhangzhou",
        "zipcode": "363000",
        "website": "http://www.zenixauto.com",
        "market_cap": 17036250
    }
}