{
    "013A.F": {
        "short_name": "JD.COM SP.ADR A1 DL-00002",
        "long_name": "JD.com, Inc.",
        "summary": "JD.com, Inc. operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; pharmaceutical and healthcare products, including OCT pharmaceutical products, nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing, and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2020, JD.com, Inc. operated fulfillment centers with a network of approximately 900 warehouses in various counties and districts in China. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.jd.com",
        "market_cap": "Large Cap"
    },
    "0NE.F": {
        "short_name": "ECMOHO LTD  ADS/1 CL.A",
        "long_name": "ECMOHO Limited",
        "summary": "ECMOHO Limited, an investment holding company, operates as an integrated solution provider in the non-medical health and wellness market. The company offers health supplements and food, mother and child care products, personal care products, and household healthcare equipment and cleaning products. It also operates an online e-commerce platform. The company is also involved in the provision of bonded area warehousing; online store operating services; and promotion and marketing services to its brand partners and other brand customers. It serves consumers and retailers. The company was founded in 2011 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200030",
        "website": "http://ecmoho.com",
        "market_cap": "Micro Cap"
    },
    "1S8.F": {
        "short_name": "SECOO HLDG UNSP.ADR/1/2",
        "long_name": "Secoo Holding Limited",
        "summary": "Secoo Holding Limited, through its subsidiaries, operates an integrated online and offline shopping platform in the People's Republic of China, Hong Kong, and internationally. The company provides upscale brand products and services, including bags, watches, women's and men's wear, footwear, children's wear, sportswear, cosmetics and skin care products, jewelry, accessories, home goods, fine food and beverage products, arts, 3C electronic devices, and Chinese original products, as well as lifestyle services through its Website, mobile applications, and offline experience centers. It also offers its Website as a marketplace to third party merchants to facilitate their sales of upscale products and services. Secoo Holding Limited has a strategic alliance with Parkson Group. The company was founded in 2011 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://www.secoo.com",
        "market_cap": "Micro Cap"
    },
    "1VPA.F": {
        "short_name": "VIPSHOP HLDGS LTD S.ADR/2",
        "long_name": "Vipshop Holdings Limited",
        "summary": "Vipshop Holdings Limited operates as an online discount retailer for various brands in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company offers women's apparel, such as casual wear, jeans, dresses, outerwear, lingerie, pajamas, and maternity clothes; men's apparel comprising casual and smart-casual T-shirts, polo shirts, jackets, pants, and underwear; skin care and cosmetic products, including cleansers, lotions, face and body creams, face masks, sunscreen, foundations, lipsticks, eye shadows, and other cosmetics-related items; and accessories that include belts, jewelry, watches, and glasses for women and men. It also provides handbags, which comprise purses, satchels, luggage, duffel bags, and wallets; apparel, gears and accessories, furnishings and decor, toys, and games for boys, girls, infants, and toddlers; sportswear, sports gear, and footwear for tennis, badminton, soccer, swimming, and other sporting activities; home furnishings, such as bed and bath products, home decor, kitchen and tabletop items, and small household appliances; and consumer electronic products. Further, it provides designer apparel, footwear, and accessories; food and snacks, beverages, health supplements; home appliances; beauty products, fresh produce, and pet goods; and internet finance services, which comprise consumer and supplier financing, and microcredit. The company offers its branded products through its vip.com and vipshop.com online platforms, as well as through its internet website and cellular phone application. Additionally, it offers warehousing, logistics, product procurement, research and development, technology development, and consulting services. Vipshop Holdings Limited was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510220",
        "website": "http://www.vip.com",
        "market_cap": "Large Cap"
    },
    "2101.HK": {
        "short_name": "FULU HOLDINGS",
        "long_name": "Fulu Holdings Limited",
        "summary": "Fulu Holdings Limited, an investment holding company, operates a third-party virtual goods and services platform in the People's Republic of China. It operates through four segments: Leisure and Entertainment, Games, Telecommunications, and Lifestyle. The company's platform connects virtual goods vendors and virtual goods sales channels. It engages in the provision of services to facilitate digital goods transactions and online stores operating services to leisure and entertainment content providers, game producers, telecom providers, and lifestyle service providers. The company also operates online stores for virtual goods vendors. The company was founded in 2009 and is headquartered in Wuhan, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": null,
        "website": "http://www.fulu.com",
        "market_cap": "Small Cap"
    },
    "2148.HK": {
        "short_name": "VESYNC",
        "long_name": "Vesync Co., Ltd",
        "summary": "Vesync Co., Ltd. designs, develops, and sells small home appliances and smart home devices in North America, Europe, and Asia. The company offers air purifiers, humidifiers, essential oil diffusers, and vacuum cleaners under the Levoit brand name; and smart home gadgets and outdoor recreation products, as well as health monitoring devices and personal care products, such as smart fitness scales, smart WiFi outlets, smart LED dimmable light bulbs, digital laser infrared thermometers, and smart nutrition scales under the Etekcity brand names. It also provides kitchen appliances and dining ware, including air fryers, toaster ovens, glass kettles, gooseneck kettles, and food dehydrators under the Cosori brand name, as well as offers a range of cooking recipes on the website, www.cosori.com. The company offers products through Amazon Seller Central and Vendor Central programs; and its websites and other e-commerce marketplaces, as well as directly to other individual or enterprise customers. Vesync Co., Ltd. was founded in 2011 and is based in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.vesync.com",
        "market_cap": "Small Cap"
    },
    "2BZA.F": {
        "short_name": "BAOZUN SP.ADR A 3 DL-0001",
        "long_name": "Baozun Inc.",
        "summary": "Baozun Inc. provides e-commerce solutions to brand partners in the People's Republic of China. The company's integrated end-to-end brand e-commerce capabilities encompass various aspects of the e-commerce value chain, including IT solutions, online store operations, digital marketing, customer services, warehousing, and fulfillment. It serves brand partners in various categories, including apparel and accessories; appliances; electronics; home and furnishings; food and health products; beauty and cosmetics; fast moving consumer goods, and mother and baby products; and insurance and automobiles. The company was formerly known as Baozun Cayman Inc. and changed its name to Baozun Inc. in March 2015. Baozun Inc. was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200436",
        "website": "http://www.baozun.com",
        "market_cap": "Mid Cap"
    },
    "300413.SZ": {
        "short_name": "MANGO EXCELLENT ME",
        "long_name": "Mango Excellent Media Co., Ltd.",
        "summary": "Mango Excellent Media Co., Ltd. provides planning, production, and operation of radio and television programs. The company operates through New Media Platform Operation, New Media Interactive Entertainment Content Production, Media Retail, and Other segments. It operates Mango TV, an internet video platform, which provides content-on-demand, advertising, and membership services. The company also engages in content production and operation; music copyright; development of customized games; and media retail activities. In addition, it offers technology and operation support; integrated marketing; and internet consumer and supply chain finance services. The company is headquartered in Changsha, China. Mango Excellent Media Co., Ltd. is a subsidiary of Mango Media Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410003",
        "website": "http://www.mgtv.com",
        "market_cap": "Large Cap"
    },
    "300740.SZ": {
        "short_name": "SYOUNG GROUP CO",
        "long_name": "SYoung Group Co., Ltd.",
        "summary": "SYoung Group Co., Ltd. engages in the research and development, manufacture, and sales of skin care products in China. The company offers its products under Yunifang, Xiaomazu, Dadihui, Huayaohua, and Yumen brands. The company was formerly known as Yujiahui Co., Ltd. and changed its name to SYoung Group Co., Ltd. in April 2021. SYoung Group Co., Ltd. was founded in 2006 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": "410205",
        "website": "http://www.syounggroup.com",
        "market_cap": "Small Cap"
    },
    "300792.SZ": {
        "short_name": "HANGZHOU ONECHANCE",
        "long_name": "Hangzhou Onechance Tech Crop.",
        "summary": "Hangzhou Onechance Tech Crop. designs and operates FMCG vertical marketing e-commerce Websites. It operates Tmall, a beauty product e-commerce Website, as well as provides product orientation, competitive products analysis, product development, brand visualization improvement, price strategy making, SKU planning, selling point exploration, product selection, hot product making, and other services. The company also offers distribution service on the TAOBAO platform, as well as provides platform contract negotiation, storage and delivery management, platform account period management, distributors recruit, changing or refunding, and other services. In addition, it provides material design, product development, and surprise marketing services. The company was founded in 2012 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310018",
        "website": "http://www.topwinchance.com",
        "market_cap": "Small Cap"
    },
    "3690.HK": {
        "short_name": "MEITUAN-W",
        "long_name": "Meituan",
        "summary": "Meituan, an investment holding company, provides an e-commerce platform that uses technology to connect consumers and merchants. It operates through Food Delivery; In-store, Hotel & Travel; and New Initiatives and Others segments. The Food Delivery segment offers food ordering and delivery service through its platform. The In-Store, Hotel & Travel segment enables merchants to sell vouchers, coupons, tickets, and reservations through the company's platform. The New Initiatives and Others segment offers restaurant management system, supply chain, Meituan Instashopping, integrated payment, micro loan, local transportation, non-food delivery, and other products and services, as well as pilot car-hailing and bike-sharing services. The company also offers multimedia information technology, cloud computing, merchant information advisory, online payment, and marketing services. The company was formerly known as Meituan Dianping and changed its name to Meituan in October 2020. Meituan was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://about.meituan.com",
        "market_cap": "Mega Cap"
    },
    "605136.SS": {
        "short_name": "SHANGHAI LILY&BEAUTY COSMETICS ",
        "long_name": "Shanghai Lily&Beauty Cosmetics Co.,Ltd.",
        "summary": "Shanghai Lily&Beauty Cosmetics Co.,Ltd. provides online cosmetics marketing and retailing services in China. The company sells cosmetics to end consumers through its stores on the Tmall platform, which is authorized by approximately 50 brands. It also offers brand marketing and cosmetics distribution services. The company was founded in 2007 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200021",
        "website": "http://www.lrlz.com",
        "market_cap": "Mid Cap"
    },
    "9988.HK": {
        "short_name": "BABA-SW",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "9MD.F": {
        "short_name": "MEITUAN CL.B",
        "long_name": "Meituan",
        "summary": "Meituan, an investment holding company, provides an e-commerce platform that uses technology to connect consumers and merchants. It operates through Food Delivery; In-store, Hotel & Travel; and New Initiatives and Others segments. The Food Delivery segment offers food ordering and delivery service through its platform. The In-Store, Hotel & Travel segment enables merchants to sell vouchers, coupons, tickets, and reservations through the company's platform. The New Initiatives and Others segment offers restaurant management system, supply chain, Meituan Instashopping, integrated payment, micro loan, local transportation, non-food delivery, and other products and services, as well as pilot car-hailing and bike-sharing services. The company also offers multimedia information technology, cloud computing, merchant information advisory, online payment, and marketing services. The company was formerly known as Meituan Dianping and changed its name to Meituan in October 2020. Meituan was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://about.meituan.com",
        "market_cap": "Large Cap"
    },
    "9MDA.F": {
        "short_name": "MEITUAN UNSP.ADR/2B",
        "long_name": "Meituan",
        "summary": "Meituan, an investment holding company, provides an e-commerce platform that uses technology to connect consumers and merchants. It operates through Food Delivery; In-store, Hotel & Travel; and New Initiatives and Others segments. The Food Delivery segment offers food ordering and delivery service through its platform. The In-Store, Hotel & Travel segment enables merchants to sell vouchers, coupons, tickets, and reservations through the company's platform. The New Initiatives and Others segment offers restaurant management system, supply chain, Meituan Instashopping, integrated payment, micro loan, local transportation, non-food delivery, and other products and services, as well as pilot car-hailing and bike-sharing services. The company also offers multimedia information technology, cloud computing, merchant information advisory, online payment, and marketing services. The company was formerly known as Meituan Dianping and changed its name to Meituan in October 2020. Meituan was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://about.meituan.com",
        "market_cap": "Large Cap"
    },
    "9PDA.F": {
        "short_name": "PINDUODUO INC. SP.ADR/4",
        "long_name": "Pinduoduo Inc.",
        "summary": "Pinduoduo Inc., through its subsidiaries, operates an e-commerce platform in the People's Republic of China. It operates Pinduoduo, a mobile platform that offers a range of products, including apparel, shoes, bags, mother and childcare products, food and beverage, fresh produce, electronic appliances, furniture and household goods, cosmetics and other personal care items, sports and fitness items, and auto accessories. The company was formerly known as Walnut Street Group Holding Limited and changed its name to Pinduoduo Inc. in July 2018. Pinduoduo Inc. was founded in 2015 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200051",
        "website": "http://www.pinduoduo.com",
        "market_cap": "Large Cap"
    },
    "AHLA.DE": {
        "short_name": "ALIBABA GR.HLDG SP.ADR 8",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "GER",
        "market": "de_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "AHLA.F": {
        "short_name": "ALIBABA GR.HLDG SP.ADR 8",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "AHLA.VI": {
        "short_name": "ALIBABA GROUP HOLDING-SP ADR",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "BABA.BA": {
        "short_name": "ALIBABA GROUP HLDG",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "ARS",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "BABA": {
        "short_name": "Alibaba Group Holding Limited",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "BABAF": {
        "short_name": "ALIBABA GROUP HOLDING LTD",
        "long_name": "Alibaba Group Holding Limited",
        "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides online and mobile commerce businesses in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a mobile commerce destination; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alibaba Health Internet platforms for pharmaceutical and healthcare products; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, an e-commerce platform; and Tmall Global, an import e-commerce platform. It also operates Lingshoutong, a digital sourcing platform; Cainiao Network logistic services platform; Ele.me, a delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance and display marketing services; and Taobao Ad Network and Exchange, a real-time bidding online marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, and Internet of Things and other services for enterprises; payment and escrow services; and movies, television series, variety shows, animations, and other video content. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-powered smart speaker. The company was founded in 1999 and is based in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311121",
        "website": "http://www.alibabagroup.com",
        "market_cap": "Mega Cap"
    },
    "BZUN": {
        "short_name": "Baozun Inc.",
        "long_name": "Baozun Inc.",
        "summary": "Baozun Inc. provides e-commerce solutions to brand partners in the People's Republic of China. The company's integrated end-to-end brand e-commerce capabilities encompass various aspects of the e-commerce value chain, including IT solutions, online store operations, digital marketing, customer services, warehousing, and fulfillment. It serves brand partners in various categories, including apparel and accessories; appliances; electronics; home and furnishings; food and health products; beauty and cosmetics; fast moving consumer goods, and mother and baby products; and insurance and automobiles. The company was formerly known as Baozun Cayman Inc. and changed its name to Baozun Inc. in March 2015. Baozun Inc. was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200436",
        "website": "http://www.baozun.com",
        "market_cap": "Mid Cap"
    },
    "D0A.MU": {
        "short_name": "DADA NEXUS LTD  ADS",
        "long_name": "Dada Nexus Limited",
        "summary": "Dada Nexus Limited operates platform of local on-demand retail and delivery in China. It operates JDDJ, a local on-demand retail platform for consumers, retailers, and brand owners; and Dada Now, a local on-demand delivery platform for merchants and individual senders in various industries and product categories. The company was incorporated in 2014 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200082",
        "website": "http://about.imdada.cn",
        "market_cap": "Mid Cap"
    },
    "DADA": {
        "short_name": "Dada Nexus Limited",
        "long_name": "Dada Nexus Limited",
        "summary": "Dada Nexus Limited operates platform of local on-demand retail and delivery in China. It operates JDDJ, a local on-demand retail platform for consumers, retailers, and brand owners; and Dada Now, a local on-demand delivery platform for merchants and individual senders in various industries and product categories. The company was incorporated in 2014 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200082",
        "website": "http://about.imdada.cn",
        "market_cap": "Mid Cap"
    },
    "HJGP": {
        "short_name": "HANJIAO GROUP INC",
        "long_name": "Hanjiao Group, Inc.",
        "summary": "AS Capital, Inc. sells healthcare and other related products to the middle-aged and elderly market segments through its online to offline platform in the People's Republic of China. It primarily sells smart watches, health foods, and cosmetics products. The company is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": null,
        "market_cap": "Nano Cap"
    },
    "HX": {
        "short_name": "Xiaobai Maimai Inc.",
        "long_name": "Xiaobai Maimai Inc.",
        "summary": "Xiaobai Maimai Inc. operates a social e-commerce platform in China. Its platform collaborates with domestic e-commerce platforms and offers users a range of products on its social e-commerce platform. The company was formerly known as Hexindai Inc. and changed its name to Xiaobai Maimai Inc. in December 2020. Xiaobai Maimai Inc. was founded in 2013 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100020",
        "website": "http://www.ir.xiaobaimaimai.com/Investor-Home",
        "market_cap": "Nano Cap"
    },
    "JD.BA": {
        "short_name": "JD.COM INC",
        "long_name": "JD.com, Inc.",
        "summary": "JD.com, Inc. operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; pharmaceutical and healthcare products, including OCT pharmaceutical products, nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing, and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2020, JD.com, Inc. operated fulfillment centers with a network of approximately 900 warehouses in various counties and districts in China. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, China.",
        "currency": "ARS",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.jd.com",
        "market_cap": "Large Cap"
    },
    "JD": {
        "short_name": "JD.com, Inc.",
        "long_name": "JD.com, Inc.",
        "summary": "JD.com, Inc. operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; pharmaceutical and healthcare products, including OCT pharmaceutical products, nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing, and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2020, JD.com, Inc. operated fulfillment centers with a network of approximately 900 warehouses in various counties and districts in China. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.jd.com",
        "market_cap": "Large Cap"
    },
    "JD.VI": {
        "short_name": "JD.COM INC-ADR",
        "long_name": "JD.com, Inc.",
        "summary": "JD.com, Inc. operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; pharmaceutical and healthcare products, including OCT pharmaceutical products, nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing, and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2020, JD.com, Inc. operated fulfillment centers with a network of approximately 900 warehouses in various counties and districts in China. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "VIE",
        "market": "at_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.jd.com",
        "market_cap": "Large Cap"
    },
    "JDCMF": {
        "short_name": "JD.COM INC",
        "long_name": "JD.com, Inc.",
        "summary": "JD.com, Inc. operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; pharmaceutical and healthcare products, including OCT pharmaceutical products, nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing, and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2020, JD.com, Inc. operated fulfillment centers with a network of approximately 900 warehouses in various counties and districts in China. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. was incorporated in 2006 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.jd.com",
        "market_cap": "Large Cap"
    },
    "JWEL": {
        "short_name": "Jowell Global Ltd.",
        "long_name": "Jowell Global Ltd.",
        "summary": "Jowell Global Ltd. engages in the online retail of cosmetics, health and nutritional supplements, and household products in China. It also sells skin care, body care, and baby and children products; washing items; fragrances; food products; electronics; and apparel. In addition, it sells its products through retail stores under the Love Home brand name. As of October 31, 2020, it operated 23,727 Love Home Stores. The company was founded in 2012 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200082",
        "website": "http://www.1juhao.com",
        "market_cap": "Micro Cap"
    },
    "L4XA.F": {
        "short_name": "LIGHTINTHEBOX HLDGS S.ADR",
        "long_name": "LightInTheBox Holding Co., Ltd.",
        "summary": "LightInTheBox Holding Co., Ltd. operates as a cross-border e-commerce platform that delivers products directly from manufacturers to its customers worldwide. The company provides customized, special occasion, and fast fashion apparel products; and other general merchandise products, such as accessories and gadgets, home garden products, electronics and communication devices, and other products. It also provides supplier chain management, research and development, customer, marketing, administrative and general support, logistic, warehouse management, and local delivery services, as well as technology research and development, mobile application software development, and information technology support services. The company offers its products through www.lightinthebox.com, www.miniinthebox.com, www.ezbuy.com, and other websites and mobile applications, which are available in 25 languages and cover approximately 140 countries and regions. LightInTheBox Holding Co., Ltd. was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.lightinthebox.com",
        "market_cap": "Micro Cap"
    },
    "LITB": {
        "short_name": "LightInTheBox Holding Co., Ltd.",
        "long_name": "LightInTheBox Holding Co., Ltd.",
        "summary": "LightInTheBox Holding Co., Ltd. operates as a cross-border e-commerce platform that delivers products directly from manufacturers to its customers worldwide. The company provides customized, special occasion, and fast fashion apparel products; and other general merchandise products, such as accessories and gadgets, home garden products, electronics and communication devices, and other products. It also provides supplier chain management, research and development, customer, marketing, administrative and general support, logistic, warehouse management, and local delivery services, as well as technology research and development, mobile application software development, and information technology support services. The company offers its products through www.lightinthebox.com, www.miniinthebox.com, www.ezbuy.com, and other websites and mobile applications, which are available in 25 languages and cover approximately 140 countries and regions. LightInTheBox Holding Co., Ltd. was founded in 2007 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201203",
        "website": "http://www.lightinthebox.com",
        "market_cap": "Small Cap"
    },
    "MOGU": {
        "short_name": "MOGU Inc.",
        "long_name": "MOGU Inc.",
        "summary": "MOGU Inc., through its subsidiaries, operates in the online fashion and lifestyle business in the People's Republic of China. The company operates an online platform that primarily offers a range of fashion apparel and other products provided by third party merchants, including beauty products and accessories. It also provides online marketing, commission, financing, and other services to merchants and users. The company offers its products through mobile apps, including flagship Mogujie app, mini-programs on Weixin, Weixin pay and QQ Wallet entryways, and Mogujie.com and Meilishuo.com websites to users. The company was formerly known as Meili Inc. and changed its name to MOGU Inc. in November 2018. MOGU Inc. was founded in 2011 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310012",
        "website": "http://www.mogu-inc.com",
        "market_cap": "Micro Cap"
    },
    "MOHO": {
        "short_name": "ECMOHO Limited",
        "long_name": "ECMOHO Limited",
        "summary": "ECMOHO Limited, an investment holding company, operates as an integrated solution provider in the non-medical health and wellness market. The company offers health supplements and food, mother and child care products, personal care products, and household healthcare equipment and cleaning products. It also operates an online e-commerce platform. The company is also involved in the provision of bonded area warehousing; online store operating services; and promotion and marketing services to its brand partners and other brand customers. It serves consumers and retailers. The company was founded in 2011 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200030",
        "website": "http://ecmoho.com",
        "market_cap": "Micro Cap"
    },
    "MPNGF": {
        "short_name": "MEITUAN",
        "long_name": "Meituan",
        "summary": "Meituan, an investment holding company, provides an e-commerce platform that uses technology to connect consumers and merchants. It operates through Food Delivery; In-store, Hotel & Travel; and New Initiatives and Others segments. The Food Delivery segment offers food ordering and delivery service through its platform. The In-Store, Hotel & Travel segment enables merchants to sell vouchers, coupons, tickets, and reservations through the company's platform. The New Initiatives and Others segment offers restaurant management system, supply chain, Meituan Instashopping, integrated payment, micro loan, local transportation, non-food delivery, and other products and services, as well as pilot car-hailing and bike-sharing services. The company also offers multimedia information technology, cloud computing, merchant information advisory, online payment, and marketing services. The company was formerly known as Meituan Dianping and changed its name to Meituan in October 2020. Meituan was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://about.meituan.com",
        "market_cap": "Mega Cap"
    },
    "MPNGY": {
        "short_name": "MEITUAN",
        "long_name": "Meituan",
        "summary": "Meituan, an investment holding company, provides an e-commerce platform that uses technology to connect consumers and merchants. It operates through Food Delivery; In-store, Hotel & Travel; and New Initiatives and Others segments. The Food Delivery segment offers food ordering and delivery service through its platform. The In-Store, Hotel & Travel segment enables merchants to sell vouchers, coupons, tickets, and reservations through the company's platform. The New Initiatives and Others segment offers restaurant management system, supply chain, Meituan Instashopping, integrated payment, micro loan, local transportation, non-food delivery, and other products and services, as well as pilot car-hailing and bike-sharing services. The company also offers multimedia information technology, cloud computing, merchant information advisory, online payment, and marketing services. The company was formerly known as Meituan Dianping and changed its name to Meituan in October 2020. Meituan was founded in 2003 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://about.meituan.com",
        "market_cap": "Large Cap"
    },
    "OCG": {
        "short_name": "Oriental Culture Holding LTD",
        "long_name": "Oriental Culture Holding LTD",
        "summary": "Oriental Culture Holding LTD, through its subsidiaries, operates an online platform to facilitate e-commerce of artwork trading in China. The company facilitates trading by individual customers of various kinds of collectibles, artworks, and commodities on its online platforms. It also offers online and offline integrated marketing, storage, and technical maintenance services, as well as industry solutions and related software products and system development services. As of June 30, 2020, the company provided services for the online trading of 140 types of collectibles, artworks, and commodity products, including stamps, coins, postage seals, collectible cards, paintings, clay teapots, jade sculptures, and teas and similar products. Oriental Culture Holding LTD was founded in 2018 and is headquartered in Nanjing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210000",
        "website": "http://www.ocgroup.hk",
        "market_cap": "Micro Cap"
    },
    "PDD": {
        "short_name": "Pinduoduo Inc.",
        "long_name": "Pinduoduo Inc.",
        "summary": "Pinduoduo Inc., through its subsidiaries, operates an e-commerce platform in the People's Republic of China. It operates Pinduoduo, a mobile platform that offers a range of products, including apparel, shoes, bags, mother and childcare products, food and beverage, fresh produce, electronic appliances, furniture and household goods, cosmetics and other personal care items, sports and fitness items, and auto accessories. The company was formerly known as Walnut Street Group Holding Limited and changed its name to Pinduoduo Inc. in July 2018. Pinduoduo Inc. was incorporated in 2015 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200051",
        "website": "http://www.pinduoduo.com",
        "market_cap": "Large Cap"
    },
    "SECO": {
        "short_name": "Secoo Holding Limited",
        "long_name": "Secoo Holding Limited",
        "summary": "Secoo Holding Limited, through its subsidiaries, operates an integrated online and offline shopping platform in the People's Republic of China, Hong Kong, and internationally. The company provides upscale brand products and services, including bags, watches, women's and men's wear, footwear, children's wear, sportswear, cosmetics and skin care products, jewelry, accessories, home goods, fine food and beverage products, arts, 3C electronic devices, and Chinese original products, as well as lifestyle services through its Website, mobile applications, and offline experience centers. It also offers its Website as a marketplace to third party merchants to facilitate their sales of upscale products and services. Secoo Holding Limited has a strategic alliance with Parkson Group. The company was founded in 2011 and is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://www.secoo.com",
        "market_cap": "Micro Cap"
    },
    "VIPS": {
        "short_name": "Vipshop Holdings Limited",
        "long_name": "Vipshop Holdings Limited",
        "summary": "Vipshop Holdings Limited operates as an online discount retailer for various brands in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company offers women's apparel, such as casual wear, jeans, dresses, outerwear, lingerie, pajamas, and maternity clothes; men's apparel comprising casual and smart-casual T-shirts, polo shirts, jackets, pants, and underwear; skin care and cosmetic products, including cleansers, lotions, face and body creams, face masks, sunscreen, foundations, lipsticks, eye shadows, and other cosmetics-related items; and accessories that include belts, jewelry, watches, and glasses for women and men. It also provides handbags, which comprise purses, satchels, luggage, duffel bags, and wallets; apparel, gears and accessories, furnishings and decor, toys, and games for boys, girls, infants, and toddlers; sportswear, sports gear, and footwear for tennis, badminton, soccer, swimming, and other sporting activities; home furnishings, such as bed and bath products, home decor, kitchen and tabletop items, and small household appliances; and consumer electronic products. Further, it provides designer apparel, footwear, and accessories; food and snacks, beverages, health supplements; home appliances; beauty products, fresh produce, and pet goods; and internet finance services, which comprise consumer and supplier financing, and microcredit. The company offers its branded products through its vip.com and vipshop.com online platforms, as well as through its internet website and cellular phone application. Additionally, it offers warehousing, logistics, product procurement, research and development, technology development, and consulting services. Vipshop Holdings Limited was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510220",
        "website": "http://www.vip.com",
        "market_cap": "Large Cap"
    },
    "YJ": {
        "short_name": "Yunji Inc. - American Depositor",
        "long_name": "Yunji Inc.",
        "summary": "Yunji Inc. operates a social e-commerce platform in the People's Republic of China. It offers a range of product categories that cater various daily needs of users and their households, including beauty and personal care, household goods, cloths, food and fresh produce, computer and electronics, apparel, bags and cases, baby and maternity products, and home appliances. The company was founded in 2015 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310000",
        "website": "http://www.yunjiglobal.com",
        "market_cap": "Small Cap"
    }
}