{
    "000007.SZ": {
        "short_name": "SHENZHEN QUANXINHA",
        "long_name": "Shenzhen Quanxinhao Co., Ltd.",
        "summary": "Shenzhen Quanxinhao Co., Ltd. owns and operates hotels in China. The company operates the Grand hotel located in Shenzhen and the Asia Gulf hotel located in Xiamen. It also provides property management, financial information consulting, venture capital, financial investment, equity investment, and investment management services. The company was founded in 1983 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "000428.SZ": {
        "short_name": "HUATIAN HOTEL GP",
        "long_name": "Huatian Hotel Group Co.,Ltd.",
        "summary": "Huatian Hotel Group Co.,Ltd. operates hotels in China. The company operates hotels that offer mall, food, banquet, spa, and other services. Huatian Hotel Group Co.,Ltd. is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "000524.SZ": {
        "short_name": "GUANGZHOU LINGNAN",
        "long_name": "Guangzhou Lingnan Group Holdings Company Limited",
        "summary": "Guangzhou Lingnan Group Holdings Company Limited engages in the tourism, hotel, exhibition, and travel businesses in China. It provides outbound tourism, domestic tourism, inbound tourism, etc.; operates international and domestic air ticketing agents, conventions, scenic spot development and management, overseas study consultation, property management, information technology consulting services, computer technology development, technical, and other services; and travel agency. The company also operates hotels. In addition, it engages in the planning, organizing, and reception of various exhibitions and conferences. Additionally, the company offers various imported or domestic cars, commercial vehicles, station wagons, and taxis on long-term and temporary rental basis, as well as for conferences, travel, wedding banquets, and guest transfers; and other car services. The company was formerly known as Guangzhou Dongfang Hotel Co., Ltd. and changed its name to Guangzhou Lingnan Group Holdings Company Limited in May 2015. Guangzhou Lingnan Group Holdings Company Limited is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "000613.SZ": {
        "short_name": "HAINAN DADONGHAI",
        "long_name": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd.",
        "summary": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd. provides hotel accommodation and catering services in the People's Republic of China. The company was founded in 1993 and is based in Sanya, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Sanya"
    },
    "000978.SZ": {
        "short_name": "GUILIN TOURISM COR",
        "long_name": "Guilin Tourism Corporation Limited",
        "summary": "Guilin Tourism Corporation Limited provides tourism and related services in China. It is also involved in the cruise passenger, scenic tourism, hotel, road travel passenger transportation, and taxi businesses. Guilin Tourism Corporation Limited is based in Guilin, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guilin"
    },
    "002033.SZ": {
        "short_name": "LIJIANG YULONG TOU",
        "long_name": "LiJiang YuLong Tourism Co., LTD.",
        "summary": "LiJiang YuLong Tourism Co., LTD. operates hotels in China. It operates the Intercontinental Hotel, the Hotel Indigo, and Lijiang Lishi Hotel; Impression Lijiang; Lijiang 5596; White Deer Tour; Longde Tourism; Long Yue Restaurant; and Lijiang Longtu Travel Agency located in the city of Lijiang, as well as provides cableway services. The company was founded in 2001 and is based in Lijiang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Lijiang"
    },
    "200613.SZ": {
        "short_name": "HAINAN DADONGHAI",
        "long_name": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd.",
        "summary": "Hainan Dadonghai Tourism Centre (Holdings) Co., Ltd. provides hotel accommodation and catering services in the People's Republic of China. The company was founded in 1993 and is based in Sanya, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Sanya"
    },
    "600054.SS": {
        "short_name": "HUANGSHAN TOURISM DEVELOPMENT C",
        "long_name": "Huangshan Tourism Development Co., Ltd.",
        "summary": "Huangshan Tourism Development Co., Ltd. engages in the tourism business in China. It is also involved in the hotel, Huizhou cuisine catering, cableways, garden development, travel agencies, and environmental sanitation and cleaning of scenic spots businesses. The company was founded in 1996 and is based in Huangshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Huangshan"
    },
    "600138.SS": {
        "short_name": "CHINA CYTS TOURS HOLDING CO. LT",
        "long_name": "China Cyts Tours Holding Co., Ltd.",
        "summary": "China Cyts Tours Holding Co., Ltd. operates as a tour operator in China. It offers inbound, domestic, and outbound travel services; conferences and exhibitions services; and technical support, travel-affiliated resources development, and online information services. The company also operates ChinaTravelDepot.com, a travel Website that offers a range of travel services, such as tour packages, cruise, hotel, flight, car rental, and international travel services; and offers airport transfer, tour guides, and fleet of luxury buses. It operates through a network of approximately 60 chain stores and outlets in China, as well as 3 branch offices in Hong Kong, Japan, and North America. The company was founded in 1980 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600258.SS": {
        "short_name": "BTG HOTELS (GROUP) CO LTD",
        "long_name": "BTG Hotels (Group) Co., Ltd.",
        "summary": "BTG Hotels (Group) Co., Ltd. engages in the operation and management of hotels in the People's Republic of China. The company was formerly known as Beijing Capital Tourism Co.,Ltd. and changed its name to BTG Hotels (Group) Co., Ltd. in August 2013. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. BTG Hotels (Group) Co., Ltd. operates as a subsidiary of Beijing Tourism Group.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "600749.SS": {
        "short_name": "TIBET TOURISM CO. LTD.",
        "long_name": "Tibet Tourism Co.,Ltd",
        "summary": "Tibet Tourism Co.,Ltd provides tourism services in China. The company operates scenic spots, including the Yarlung Zangbo Grand Canyon in Linzhi City, Tibet Autonomous Region, the Shenshen Lake Ba Songcuo, the Benzri Mountain, the Lulang Huahai Ranch, and the Ali Area of the Tibet Autonomous Region. It also operates hotels, such as Himalaya Lhasa, Himalaya Grand Canyon, Himalaya Bazoncuo, Himalayan Pran, Himalaya Gang Rinpoche, Tarchin Xixia Bangma Xiangke, and Payang Town Xixiabangma, as well as Lulang Huahai Forest Villa Resort, and Ba Songcuo self-driving and outdoor camp. In addition, the company provides travel agency, tourist passenger transportation, and other tourism services. Tibet Tourism Co.,Ltd was founded in 1996 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Lhasa"
    },
    "601007.SS": {
        "short_name": "JINLING HOTEL CORPORATION LTD.",
        "long_name": "Jinling Hotel Corporation, Ltd.",
        "summary": "Jinling Hotel Corporation, Ltd. operates hotels in China. The company also operates business building; develops tourism ecological parks; hotel materials trade business; and distributes wine. Jinling Hotel Corporation, Ltd. was founded in 1983 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Nanjing"
    },
    "603136.SS": {
        "short_name": "JIANGSU TIANMU LAKE TOURISM CO ",
        "long_name": "Jiangsu Tianmu Lake Tourism Co.,Ltd",
        "summary": "Jiangsu Tianmu Lake Tourism Co.,Ltd. operates a tourism resort in China. Its resort has three sightseeing and leisure facilities with hotel and food facilities under the names of Tianmu Lake Landscape Park Scenic Spot, Tianmu Lake Nanshan Bamboo Sea Scenic Spot, and Tianmu Lake Yushui Hot Spring. The company is based in Liyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Liyang"
    },
    "900929.SS": {
        "short_name": "SHANGHAI JINJIANG INTL TRAVEL C",
        "long_name": "Shanghai Jinjiang International Travel Co., Ltd.",
        "summary": "Shanghai Jinjiang International Travel Co., Ltd. provides travel agency services. It organizes outbound and domestic tourism for Chinese citizens; and inbound tourism for international travelers; and conferences and exhibitions. The company is based in Shanghai, China. Shanghai Jinjiang International Travel Co., Ltd. is a subsidiary of Shanghai Jinjiang International Hotels (Group) Co., Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "900942.SS": {
        "short_name": "HUANGSHAN TOURISM DEVELOPMENT C",
        "long_name": "Huangshan Tourism Development Co., Ltd.",
        "summary": "Huangshan Tourism Development Co., Ltd. engages in the tourism business in China. It is also involved in the hotel, Huizhou cuisine catering, cableways, garden development, travel agencies, and environmental sanitation and cleaning of scenic spots businesses. The company was founded in 1996 and is based in Huangshan, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Huangshan"
    },
    "CL4A.F": {
        "short_name": "HUAZHU GROUP SP.ADR/1",
        "long_name": "Huazhu Group Limited",
        "summary": "Huazhu Group Limited, together with its subsidiaries, develops leased and owned, manachised, and franchised hotels primarily in the People's Republic of China. It operates hotels under its own brands, such as Hi Inn, Elan Hotel, HanTing Hotel, JI Hotel, Starway Hotel, Orange Hotel, Crystal Orange Hotel, Manxin Hotel, Madison Hotel, Joya Hotel, and Blossom Hill Hotels & Resorts. The company also operates hotels under brand franchise agreements that include Ibis, Ibis Styles, Mercure, Novotel, and Grand Mercure. As of March 31, 2020, it operated 5,953 hotels with 575,488 rooms in 15 countries. The company was formerly known as China Lodging Group, Limited and changed its name to Huazhu Group Limited in June 2018. Huazhu Group Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "GHG": {
        "short_name": "GreenTree Hospitality Group Ltd",
        "long_name": "GreenTree Hospitality Group Ltd.",
        "summary": "GreenTree Hospitality Group Ltd., through its subsidiaries, develops leased-and-operated, and franchised-and-managed hotels under the GreenTree brand in the People's Republic of China. As of December 31, 2019, it operated 34 leased-and-operated hotels; and had franchised-and-managed hotels network consisting of 3,957 hotels with 290,026 rooms in operation covering 339 cities in China, and an additional 949 hotels with 68,522 rooms that were contracted for or under development. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China. GreenTree Hospitality Group Ltd. is a subsidiary of GreenTree Inns Hotel Management Group, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "HTHT": {
        "short_name": "Huazhu Group Limited",
        "long_name": "Huazhu Group Limited",
        "summary": "Huazhu Group Limited, together with its subsidiaries, develops leased and owned, manachised, and franchised hotels primarily in the People's Republic of China. It operates hotels under its own brands, such as Hi Inn, Elan Hotel, HanTing Hotel, JI Hotel, Starway Hotel, Orange Hotel, Crystal Orange Hotel, Manxin Hotel, Madison Hotel, Joya Hotel, and Blossom Hill Hotels & Resorts. The company also operates hotels under brand franchise agreements that include Ibis, Ibis Styles, Mercure, Novotel, and Grand Mercure. As of March 31, 2020, it operated 5,953 hotels with 575,488 rooms in 15 countries. The company was formerly known as China Lodging Group, Limited and changed its name to Huazhu Group Limited in June 2018. Huazhu Group Limited was founded in 2005 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    }
}