{
    "000659.SZ": {
        "short_name": "ZHUHAI ZHONGFU ENT",
        "long_name": "Zhuhai Zhongfu Enterprise Co.,Ltd",
        "summary": "Zhuhai Zhongfu Enterprise Co.,Ltd manufactures and sells beverage packaging solutions in China. It offers polyethylene terephthalate (PET) bottles for carbonated soft drinks, drinking water, beer, sauces and jams, edible oils, and wine; PET preforms; PVC/OPP labels; heat shrinkable plastic films; caps; and cartons, as well as OEM services. The company was founded in 1982 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519030",
        "website": "http://www.zhongfu.com.cn",
        "full_time_employees": null
    },
    "002014.SZ": {
        "short_name": "HUANGSHAN NOVEL CO",
        "long_name": "Huangshan Novel Co.,Ltd",
        "summary": "Huangshan Novel Co., Ltd., together with its subsidiaries, manufactures and sells packaging materials primarily in China. The company's packaging materials include plastic color-printing, laminating flexible, vacuum metallized and multi-functional film, medical packaging, breathable and protective membrane, and injection molding materials. Its products are used in foodstuff, daily chemicals, pharmaceutical, agrochemicals, electronics, building materials, and other fields. The company also exports its products to Europe, the United States, Mexico, Japan, the Middle East, and rest of Asia. Huangshan Novel Co., Ltd. was founded in 1992 and is based in Huangshan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Huangshan",
        "zipcode": null,
        "website": "http://www.novel.com.cn",
        "full_time_employees": 2148
    },
    "002191.SZ": {
        "short_name": "SHENZHEN JINJIA GR",
        "long_name": "Shenzhen Jinjia Group Co.,Ltd.",
        "summary": "Shenzhen Jinjia Group Co.,Ltd. engages in the research, development, and production of packaging products and packaging materials in China. The company's products include cigarette packets, and products for electronic supplies and daily necessities. It also develops materials, such as laser holographic transfer anti-counterfeiting papers and transfer films. The company was formerly known as Shenzhen Jinjia Color Printing Group Co., Ltd. and changed its name to Shenzhen Jinjia Group Co.,Ltd. in April 2016. Shenzhen Jinjia Group Co.,Ltd. was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518057",
        "website": "http://www.jinjia.com",
        "full_time_employees": 5047
    },
    "002228.SZ": {
        "short_name": "XIAMEN HEXING PACK",
        "long_name": "Xiamen Hexing Packaging Printing Co., Ltd.",
        "summary": "Xiamen Hexing Packaging Printing Co., Ltd. manufactures and sells packaging materials in China. It offers corrugated cartons that are primarily used as packaging products for protecting products, facilitating transportation, and handling and improving publicity; pre-printed corrugated paperboards; color printing used in middle-to-high-end commodity packaging; pearl foams; honeycomb paperboards; and molded pulp. The company also provides designing and manufacturing services for various kinds of books, periodicals, instructions, and other products. It serves customers in household appliance, electronics, food products, beverages, cosmetics, daily-use chemical products, pharmaceuticals, automobile parts, kitchen and sanitary wares, and other areas. The company was founded in 1993 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361006",
        "website": "http://www.hxpp.com.cn",
        "full_time_employees": 10362
    },
    "002243.SZ": {
        "short_name": "SHENZHEN LEAGUER C",
        "long_name": "Shenzhen Leaguer Co., Ltd.",
        "summary": "Shenzhen Leaguer Co., Ltd. produces and sells packaging products in China and internationally. The company develops packaging materials; designs packaging concepts; produces and sells cosmetic and food plastic packaging products; designs and manufactures technological equipment and molds; offers cosmetic additives and cosmetics; designs battery packaging products; and designs and manufactures automobile light weighting products. It is also involved in packaging recycling and RFID tag customization activities; and offers multilayer tubes, injection products, blowing bottles, injection blowing-molds, and coating and vacuum metalizing products. The company was formerly known as Shenzhen Beauty Star Co., Ltd. and changed its name to Shenzhen Leaguer Co., Ltd. in January 2021. Shenzhen Leaguer Co., Ltd. was founded in 1995 is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518117",
        "website": "http://www.beautystar.cn",
        "full_time_employees": 4658
    },
    "002245.SZ": {
        "short_name": "JIANGSU AZURE CORP",
        "long_name": "Jiangsu Azure Corporation",
        "summary": "Jiangsu Azure Corporation operates as a metal logistics and distribution company. It provides supply chain services, including warehousing, sorting, cutting, packaging, distribution, and processing of metal materials. The company is also involved in the research and development, production, and sale of LED chips. In addition, it offers lithium-ion batteries used in power tools, smart homes, new energy power travel, and other products. The company was formerly known as Jiangsu Aucksun Co., Ltd. Jiangsu Azure Corporation is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215618",
        "website": "http://www.aucksun.com",
        "full_time_employees": 2641
    },
    "002374.SZ": {
        "short_name": "SHANDONG CHIWAY IN",
        "long_name": "Shandong Chiway Industry Development Co.,Ltd.",
        "summary": "Shandong Chiway Industry Development Co.,Ltd. produces and sells aluminum anti-counterfeit caps and composite anti-counterfeit printing aluminum plates. It also offers combined anti-counterfeit caps, cold-punching molds, injection molds, aluminum anti-counterfeit bottle covers, aluminum plate composites, and anti-counterfeiting printing bases. The company also provides garden planning and design, engineering construction, antique construction, green maintenance, and flower seedling services. The company was formerly known as Shandong Lipeng Co.,Ltd. and changed its name to Shandong Chiway Industry Development Co.,Ltd. in February 2021. Shandong Chiway Industry Development Co.,Ltd. was founded in 1995 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "264114",
        "website": "http://www.lp.com.cn",
        "full_time_employees": 1635
    },
    "002522.SZ": {
        "short_name": "ZHEJIANG ZHONGCHEN",
        "long_name": "Zhejiang Zhongcheng Packing Material Co., Ltd.",
        "summary": "Zhejiang Zhongcheng Packing Material Co., Ltd. engages in the research, design, production, sale, and after sale servicing of shrink films. It offers polyolefin, anti fog cross-linked, high performance, economical cross-linked, and low temperature cross-linked shrink films, as well as printed films. The company also provides special shrink films, such as macroperforated and regular perforated shrink films, single-wound high-speed packing films, cross-linked films, shrink bags, and antistatic shrink films. It sells its products under the name Zhongda in approximately 60 countries worldwide. The company was founded in 1996 and is based in Jiashan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiashan",
        "zipcode": "314100",
        "website": "http://www.zjzhongda.com",
        "full_time_employees": 928
    },
    "002565.SZ": {
        "short_name": "SHANGHAI SHUNHO NE",
        "long_name": "Shanghai Shunho New Materials Technology Co.,Ltd.",
        "summary": "Shanghai Shunho New Materials Technology Co.,Ltd. engages in the development, manufacture, and sale of environmental packaging materials in China. The company provides gold and silver paper boards for use in cigarette, gifts, cosmetics, liquor, food, medicine, toothpaste, sports products, electronic products packaging, etc.; and aluminum-coated and laminating papers, acrylic fibers, printed materials, optical anti-counterfeiting membranes, and printing equipment. It also offers cloud printing and vertical e-commerce institutions, etc. services; and electronic cigarettes. The company was formerly known as Shanghai Luxin Packing Materials Science & Technology Co., Ltd. and changed its name to Shanghai Shunho New Materials Technology Co.,Ltd. in December 2016. Shanghai Shunho New Materials Technology Co.,Ltd. is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200331",
        "website": "http://www.shunhaostock.com",
        "full_time_employees": null
    },
    "002585.SZ": {
        "short_name": "JIANGSU SHUANGXING",
        "long_name": "Jiangsu Shuangxing Color Plastic New Materials Co., Ltd.",
        "summary": "Jiangsu Shuangxing Color Plastic New Materials Co., Ltd. engages in the research, processing, production, import, export, and sale of packaging films, composite packaging materials, functional polymers, and new materials and other products in China. It offers metallized, polyester, hot stamping, transfer, card protection, yarn grade, reflective, decorative, laser, insulation, shrinkable, PVC heat shrink, high transparent, thermal sealable, and solar films brands. The company also exports its products to the Middle East, Europe, the United States, Southeast Asia, Hong Kong, Taiwan, and internationally. Jiangsu Shuangxing Color Plastic New Materials Co., Ltd. is based in Suqian, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suqian",
        "zipcode": "223808",
        "website": "http://www.cpp.com.cn",
        "full_time_employees": 1591
    },
    "002615.SZ": {
        "short_name": "ZHEJIANG HAERS VAC",
        "long_name": "ZheJiang Haers Vacuum Containers Co.,Ltd.",
        "summary": "ZheJiang Haers Vacuum Containers Co.,Ltd. engages in the research and development, design, production, and sale of stainless steel vacuum insulation vessels in China. The company offers vacuum flasks, insulation pots, insulated lunch boxes, stew pots, vacuum insulation electric kettles, aluminum bottles, glass cups, PP, Tritan, and other plastic cups under the Hals, SIGG, and NONOO brands. It also provides glass ceramic products, silicone products, corn fiber, grain fiber, and bamboo fiber products; and sells baby bottles, pacifiers, and grinders. In addition, the company researches, develops, and sells outdoor leisure sports products; and manufactures, sells, and repairs CNC machine tools and accessories. ZheJiang Haers Vacuum Containers Co.,Ltd. also exports its products to approximately 80 countries worldwide. The company was formerly known as Zhejiang Hals Industry & Trade Co., Ltd. and changed its name to ZheJiang Haers Vacuum Containers Co.,Ltd in 2008. ZheJiang Haers Vacuum Containers Co.,Ltd. was founded in 1996 and is based in Yongkang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yongkang",
        "zipcode": "321300",
        "website": "http://www.haersgroup.com",
        "full_time_employees": null
    },
    "002787.SZ": {
        "short_name": "SUZHOU HYCAN HOLDI",
        "long_name": "Suzhou Hycan Holdings Co., Ltd.",
        "summary": "Suzhou Hycan Holdings Co., Ltd. provides metal and plastic packaging solutions in China and internationally. The company offers food grade metal cover, cans round can, tank square can, and can products; chemical tank round can and steel bucket; chemical tank square barrel; chemical tank square tank and can; chemical tank; steel bucket; cap; round can; and square can products. It also provides blow molded packaging and container; injection packaging straight can and spiral barrel; injection molding drum and oval barrel; and injection molding plastic box products. The company was formerly known as Suzhou Huayuan Packaging Co., Ltd. and changed its name to Suzhou Hycan Holdings Co., Ltd. in January 2017. Suzhou Hycan Holdings Co., Ltd. is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215236",
        "website": "http://www.huayuan-print.com",
        "full_time_employees": 1916
    },
    "002803.SZ": {
        "short_name": "XIAMEN JIHONG PACK",
        "long_name": "Xiamen Jihong Technology Co., Ltd.",
        "summary": "Xiamen Jihong Technology Co., Ltd. provides integrated packing solutions in China. The company designs, pre-presses, produces, and distributes various packaging products, including cardboard packing, corrugate packing, rigid box, and plastic packing products. It also offers folding boxes for high automation assembly; window patching boxes; cold and humidity resistant boxes; and displays. The company was formerly known as Xiamen Jihong Package Technology Corp. and changed its name to Xiamen Jihong Technology Co., Ltd. in September 2019. Xiamen Jihong Technology Co., Ltd. was founded in 2003 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361027",
        "website": "http://www.jihong.cc",
        "full_time_employees": 3429
    },
    "002812.SZ": {
        "short_name": "YUNNAN ENERGY NEW",
        "long_name": "Yunnan Energy New Material Co., Ltd.",
        "summary": "Yunnan Energy New Material Co., Ltd. engages in the production, processing, and sale of plastic films, modified plastics, laser transfer paper, printing materials, cardboard, and liquid packaging paper in China and internationally. Its products include smoke film flat membrane products, such as special films, ordinary packaging with BOPP thin, and BOPP for cigarette packaging; liquid boxes, such as red creative packaging and liquid food packaging paper-based aluminum plastic products; and smoke standard products. The company's products also consist of special paper special films, including seamless plane red laser arcade aluminum, seamless platinum gold laser aluminum, ordinary golden alumina, seamless face laser transfer paper, red fiber frame paper, cross beam laser composite paper, aluminum foil, and transfer liner paper; and electrochemical aluminum, liner paper, frame paper series, and special paper series products. The company was formerly known as Yunnan Chuangxin New Material Co., Ltd. and changed its name to Yunnan Energy New Material Co., Ltd. in October 2018. Yunnan Energy New Material Co., Ltd. was founded in 2001 and is based in Yuxi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yuxi",
        "zipcode": "653100",
        "website": "http://www.cxxcl.cn",
        "full_time_employees": 5040
    },
    "002831.SZ": {
        "short_name": "SHENZHEN YUTO PACK",
        "long_name": "ShenZhen YUTO Packaging Technology Co., Ltd.",
        "summary": "ShenZhen YUTO Packaging Technology Co., Ltd. engages in the design, manufacture, and supply of printing and packaging solutions in China and internationally. It offers color boxes, gift boxes, manuals, stickers, corrugated boxes, and molded pulp trays. The company serves consumer electronics, health, tobacco, cosmetics, food, and other industries. ShenZhen YUTO Packaging Technology Co., Ltd. was founded in 2002 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szyuto.com",
        "full_time_employees": 21728
    },
    "002836.SZ": {
        "short_name": "GUANGDONG NEW GRAN",
        "long_name": "Guangdong New Grand Long Packing Co., Ltd.",
        "summary": "Guangdong New Grand Long Packing Co., Ltd. engages in the research, design, manufacture, marketing, and service of cigarette packing products for various brands primarily in China. The company was formerly known as Chaozhou New Grand Long Packing Co., Ltd and changed its name to Guangdong New Grand Long Packing Co., Ltd. in 2010. The company was founded in 2006 and is based in Chaozhou, China. Guangdong New Grand Long Packing Co., Ltd. is a subsidiary of Yize Holding Group Limited.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chaozhou",
        "zipcode": "521000",
        "website": "http://www.newglp.com",
        "full_time_employees": 689
    },
    "002846.SZ": {
        "short_name": "GUANGDONG ENPACK P",
        "long_name": "Guangdong Enpack Packaging Co., Ltd.",
        "summary": "Guangdong Enpack Packaging Co., Ltd. engages in the research, development, production, and sale of EOE products in metal packaging in China. It offers canned food, dried food, beverage, and daily chemicals easy open end products. Guangdong Enpack Packaging Co., Ltd. is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515000",
        "website": "http://www.enpackcorp.com.cn",
        "full_time_employees": 1310
    },
    "002951.SZ": {
        "short_name": "SICHUAN JINSHI TEC",
        "long_name": "Sichuan Jinshi Technology Co.,Ltd",
        "summary": "Sichuan Jinshi Technology Co., Ltd. engages in the development, production, and sale of cigarette labels for cigarette manufacturers in China. The company is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610101",
        "website": "http://www.jinshigp.com",
        "full_time_employees": 528
    },
    "002969.SZ": {
        "short_name": "JIAMEI FOOD PACKAG",
        "long_name": "Jiamei Food Packaging (Chuzhou) Co.,Ltd",
        "summary": "Jiamei Food Packaging (Chuzhou) Co.,Ltd produces and sells beverage packaging products in China. It offers three-piece beverage cans, two-piece beverage cans, aseptic paper packaging products, and PET bottles, as well as filling services. The company was founded in 2004 and is based in Cangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Cangzhou",
        "zipcode": "239000",
        "website": "http://www.chinafoodpack.com",
        "full_time_employees": null
    },
    "003003.SZ": {
        "short_name": "GUANGDONG TENGEN I",
        "long_name": "Guangdong Tengen Industrial Group Co.,Ltd.",
        "summary": "Guangdong Tengen Industrial Group Co.,Ltd. manufactures and sells packaging supplies and logistic equipment in China. The company offers poly mailers, cardboard envelopes, security bags, label stickers, packing list envelopes, bubble mailers, security seals, packaging tapes, and waybills. It serves express, e-commerce, post, finance, and telecommunication industries. The company was formerly known as Guangdong Tengen Printing Co., Ltd. and changed its name to Guangdong Tengen Industrial Group Co.,Ltd. in November 2015. Guangdong Tengen Industrial Group Co.,Ltd. was founded in 2010 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523640",
        "website": "http://www.gdtengen.com",
        "full_time_employees": 994
    },
    "003018.SZ": {
        "short_name": "JINFU TECHNOLOGY C",
        "long_name": "JinFu Technology Co., Ltd.",
        "summary": "JinFu Technology Co., Ltd. primarily engages in the research, development, and processing of liquid crystal display modules, and intelligent detection and automation equipment in China and internationally. The company is also involved in the material processing of precision parts of electronic products. Its products are used in consumer electronics, automobiles, medical, new energy, and other industries. The company was founded in 1998 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.szjin-fu.com",
        "full_time_employees": 546
    },
    "0468.HK": {
        "short_name": "GAPACK",
        "long_name": "Greatview Aseptic Packaging Company Limited",
        "summary": "Greatview Aseptic Packaging Company Limited, an investment holding company, manufactures, distributes, and sells paper packaging products and filling machines to dairy and non-carbonated soft drink producers in the People's Republic of China and internationally. The company sells its aseptic packaging materials under the GREATVIEW trademark, which includes Greatview Brick, Greatview Pillow, Greatview Crown, Greatview Octagon, and Greatview Blank-Fed. It also provides spare parts, technical services, digital marketing, and product traceability solutions to the liquid food industry; packaging related equipment and technical development services; and rubber and plastic films. In addition, the company is involved in the technical research and development; software research and development; and research and development of multi-layer food packaging materials. Greatview Aseptic Packaging Company Limited was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.greatviewpack.com",
        "full_time_employees": 1673
    },
    "0906.HK": {
        "short_name": "COFCO PACKAGING",
        "long_name": "CPMC Holdings Limited",
        "summary": "CPMC Holdings Limited, an investment holding company, manufactures and sells packaging products for various consumer goods in the People's Republic of China. The company operates through Tinplate Packaging, Aluminum Packaging, and Plastic Packaging units. The Tinplate Packaging unit offers three-piece beverage cans; food cans, including milk powder cans; aerosol cans; metal caps; printed and coated tinplates; steel barrels; round and square shaped cans; and other metal packaging products. The Aluminum Packaging unit provides aluminum packaging products, such as two-piece beverage cans and one-piece bottles. The Plastic Packaging unit offers plastic packaging products for milk bottles, shampoo bottles, plastic devices of electronic products, daily use hardware, package printing, sports drink bottles, and related plastic-made products. In addition, the company offers packaging solutions, including packaging design, printing, logistics, and customer services. CPMC Holdings Limited was incorporated in 2009 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.cofco-pack.com",
        "full_time_employees": 6131
    },
    "1626.HK": {
        "short_name": "JIA YAO HLDGS",
        "long_name": "Jia Yao Holdings Limited",
        "summary": "Jia Yao Holdings Limited, an investment holding company, designs, prints, and sells paper cigarette and social product paper packages in the People's Republic of China. It offers various paper cigarette packages, including hard and soft cigarette packets; cigarette cartons; and gift sets to pack and carry various sets of cigarette packets. The company also provides social product paper packages, such as colored boxes, labels, gift sets, and paper bags for packaging drugs and medicines, liquor and alcoholic beverages, and food and other social products. In addition, it engages in the trading of goods, which includes mainboards for cell phones. The company was formerly known as Tourism International Holdings Limited and changed its name to Jia Yao Holdings Limited in July 2019. Jia Yao Holdings Limited was founded in 1992 and is headquartered in Yichang, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yichang",
        "zipcode": null,
        "website": "http://www.jiayaoholdings.com",
        "full_time_employees": 550
    },
    "200986.SZ": {
        "short_name": "FOSHAN HUAXIN PACK",
        "long_name": "Foshan Huaxin Packaging Co., Ltd.",
        "summary": "Foshan Huaxin Packaging Co., Ltd. researches, develops, produces, and sells coated ivory boards, chemicals for paper making, and color printing products in the People's Republic of China. It offers ivory board, which is used in various fields, such as cigarette packaging, food packaging, medicine packaging, cosmetic packaging, and living supplies packaging; carboxylic butadiene-styrene latex, styrene-acrylic latex, and calcium carbonate products for the paper making industry; and color printing products, including color boxes, various labels, barcode printing, brochures, books, and periodicals for use in terminal consumption industry. The company is based in Foshan, the People's Republic of China. Foshan Huaxin Packaging Co., Ltd. is a subsidiary of Foshan Huaxin Development Co., Ltd.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528061",
        "website": "http://www.fshxp.com",
        "full_time_employees": 1639
    },
    "300057.SZ": {
        "short_name": "SHANTOU WANSHUN NE",
        "long_name": "Shantou Wanshun New Material Group Co., Ltd.",
        "summary": "Shantou Wanshun New Material Group Co., Ltd. engages in the packaging material, aluminum foil, and functional film businesses in China. Its products include smart optical-controlled window films, ITO conductive films, barrier films, self-adhesive switchable transparent films, packaging cardboards, aluminum foils, and aluminized products. The company was founded in 1998 and is headquartered in Shantou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shantou",
        "zipcode": "515078",
        "website": "http://www.wanshun.cn",
        "full_time_employees": null
    },
    "300501.SZ": {
        "short_name": "SHANGHAI HAISHUN N",
        "long_name": "Shanghai Haishun New Pharmaceutical Packaging Co.,Ltd.",
        "summary": "Shanghai Haishun New Pharmaceutical Packaging Co.,Ltd. manufactures, sells, and exports primarily pharmaceutical packaging films in China and internationally. It offers cold-forming aluminum foils, PVC/Aclar high barrier thermoformable films, tropical blister foils, lidding foils for PTP blisters, AL/PE suppository laminates, child-resistant packaging, complex laminated flexible films, AL/PE strip packs, and PVC/PVDC transparent films under the HiPack brand name. The company is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201619",
        "website": "http://www.haishunpackaging.com",
        "full_time_employees": 569
    },
    "300955.SZ": {
        "short_name": "JAHEN HOUSEHOLD PR",
        "long_name": "Jahen Household Products Co., Ltd.",
        "summary": "Jahen Household Products Co., Ltd. engages in the design, development, and manufacture of plastic packaging containers; and research, development, and manufacture of cosmetics, and personal care and household chemical products in China and internationally. The company offers plastic packaging materials, such as injection and extrusion molding products, and extrusion tubes for use in cosmetics, lubricants, and the FMCG industry. It also provides cream, lotion, cleanser, mask, skin care, essence, and other full range of products; shampoo and bath products; perfume, toilet water, talcum powder, and other products; and laundry liquid and other products. The company was founded in 2005 and is based in Quanzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Quanzhou",
        "zipcode": "362000",
        "website": "http://www.jahenjh.com",
        "full_time_employees": null
    },
    "600210.SS": {
        "short_name": "SHANGHAI ZIJIANG ENTERPRISE GRO",
        "long_name": "Shanghai Zijiang Enterprise Group Co., Ltd.",
        "summary": "Shanghai Zijiang Enterprise Group Co., Ltd. operates in the packaging and printing industry in China. The company offers PET performs and bottles, crown caps, plastic labels, sanitary article packaging products, PP closures, metallization paper and film products, printing ink products, plastic printing products, pail and jerry cans, film products, beverage products, paper printing products, and magnesium products, as well as BOPET and CPP films, PA film inks, and plastic containers for industrial products. It is also involved in the construction of scientific parks; and real estate activities. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200336",
        "website": "http://www.zijiangqy.com",
        "full_time_employees": 7069
    },
    "601968.SS": {
        "short_name": "SHANGHAI BAOSTEEL PACKAGING CO ",
        "long_name": "Shanghai Baosteel Packaging Co., Ltd.",
        "summary": "Shanghai Baosteel Packaging Co., Ltd. engages in can-making, iron printing, and EOE-making businesses. It provides steel cans for Coca Cola; and UV metal color coating and printing line services for food and beverage industries. The company is based in Shanghai, China. Shanghai Baosteel Packaging Co., Ltd. is a subsidiary of Baosteel Metal Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200949",
        "website": "http://www.baosteelpackaging.com",
        "full_time_employees": 1297
    },
    "603021.SS": {
        "short_name": "SHANGDONG HUAPENG GLASS CO LTD",
        "long_name": "Shandong Huapeng Glass Co.,Ltd.",
        "summary": "Shandong Huapeng Glass Co.,Ltd. researches and develops, produces, and sells various glassware products and glass bottles primarily in China. It offers ware products, including lead-free crystal glass products and molding goblets; fawles; and bottle products, such as food, wine, liquor, brandy, champagne, beverage, and olive oil bottles under the Shidao brand name. The company also exports its products to South Korea, Japan, the United States, Canada, Russia, and other countries. Shandong Huapeng Glass Co.,Ltd. is headquartered in Rongcheng, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Rongcheng",
        "zipcode": null,
        "website": "http://www.huapengglass.com",
        "full_time_employees": 2355
    },
    "603022.SS": {
        "short_name": "SHANGHAI XINTONGLIAN PACKAGING ",
        "long_name": "Shanghai Xintonglian Packaging Co., Ltd.",
        "summary": "Shanghai Xintonglian Packaging Co., Ltd. engages in the production and sale of packaging products in China and internationally. The company offers paper, wood, and plastic and cushioning packaging products. It also provides iron box packaging products, hollow board packaging boxes, stickers, desiccants, shockproof labels, shockwatch tilt displays, and single angle anti-tilts. In addition, the company offers inventory management and packaging services. The company was formerly known as Shanghai Xinliantong Packacing Materials Company and changed its name to Shanghai Xintonglian Packaging Co., Ltd. in June 2011. The company was founded in 1999 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.xtl.sh.cn",
        "full_time_employees": 1086
    },
    "603058.SS": {
        "short_name": "YONGJI PRINTING CO LTD",
        "long_name": "GuiZhou YongJi Printing CO.,LTD",
        "summary": "GuiZhou YongJi Printing CO.,LTD engages in packaging and printing business in China. The company offers support services for smoke printing supplies, such as cigarette boxes and wrapping paper strips. It also engages in paper packaging design, plate making, gravure, offset printing, laser transfer, bronzing, holographic anti-counterfeiting, and other printing processes. The company was founded in 1997 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": null,
        "website": "http://www.yongjigf.com",
        "full_time_employees": null
    },
    "603165.SS": {
        "short_name": "ZHEJIANG RONGSHENG ENVIRONMENTA",
        "long_name": "Zhejiang Rongsheng Environmental Protection Paper Joint Stock Co., Ltd.",
        "summary": "Zhejiang Rongsheng Environmental Protection Paper Joint Stock Co., Ltd. produces and sells recycled paper products in China. The company offers kraft cardboard paper, corrugated base paper, corrugated cardboard, and kraft board paper, as well as packaging products. It also produces steam. The company exports its products. The company was founded in 1980 and is based in Pinghu, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Pinghu",
        "zipcode": "314213",
        "website": "http://www.rszy.com",
        "full_time_employees": 827
    },
    "603429.SS": {
        "short_name": "ANHUI GENUINE NEW MATERIALS CO ",
        "long_name": "Anhui Genuine New Materials Co.,Ltd.",
        "summary": "Anhui Genuine New Materials Co.,Ltd. researches and develops, manufactures, and deals in printing and packaging materials in China and internationally. It offers cigarette sealing and cigarette tipping paper products; printed aluminum castling papers; and thermal transfer foils for use in cigarette tipping papers, gifts, and other decoration packages, as well as thermal transfer films. The company was formerly known as Taihu Jiyou Paper Industry Co., Ltd. and changed its name to Anhui Genuine New Materials Co.,Ltd. in March 2016. Anhui Genuine New Materials Co.,Ltd. was founded in 1998 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": "230601",
        "website": "http://www.genuinepacking.com",
        "full_time_employees": 951
    },
    "603499.SS": {
        "short_name": "SHANGHAI SUNGLOW PACKAGING TECH",
        "long_name": "Shanghai Sunglow Packaging Technology Co.,Ltd",
        "summary": "Shanghai Sunglow Packaging Technology Co.,Ltd manufactures and sells packaging products in China. It offers gift boxes, labels, handbags, blisters, and cartons. The company was founded in 2006 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201306",
        "website": "http://www.sunglow-tec.com",
        "full_time_employees": 1083
    },
    "603607.SS": {
        "short_name": "ZHEJIANG JINGHUA LASER TECHNOLO",
        "long_name": "Zhejiang Jinghua Laser Technology Co.,Ltd",
        "summary": "Zhejiang Jinghua Laser Technology Co., Ltd. develops, manufactures, and sells laser holographic molded products. The company's principal products include laser holographic anti-counterfeiting films and anti-counterfeiting papers. Its products are used in laser holographic anti-counterfeiting packaging for cigarettes, wine, cosmetics, food, and other fields. The company was formerly known as Shaoxing Jinghua Laser Products Co., Ltd. Zhejiang Jinghua Laser Technology Co., Ltd. was founded in 1992 and is based in Shaoxing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312000",
        "website": "http://www.sx-jhjg.com",
        "full_time_employees": 567
    },
    "603615.SS": {
        "short_name": "CHAHUA MODERN HOUSEWARES CO LTD",
        "long_name": "Chahua Modern Housewares Co., Ltd.",
        "summary": "Chahua Modern Housewares Co., Ltd. engages in the design, development, production, and sale of various plastic housewares in China. The company offers kitchen products, such as lunch boxes, food containers, vacuum lunch boxes, microwave products, condiment sets, cooking oil pots, cutting boards, rice buckets, chopsticks boxes, peelers, cupboards, ice cube trays and ice-lolly molds, sifters, trays, fruit trays, water ladles, table mats, and others; storage products, including storage boxes and drawers, organizers, shoe racks, and others; and water bottles comprising cups, sport bottles, coolpots, thermos, tumblers, and kid cups. It also provides cleaning items that include mops, cleaning pails, dustpans and brooms, brushes, cleaning rags, scourer pads, aprons and over-sleeves, and others; and bathroom products consisting of soap trays, bathroom racks, bath lily's, potty products, and others. In addition, the company offers disposal products that comprise fresh keeping bags, cling wraps, paper and plastic cups, garbage bags, and others; hangers, pegs, mesh laundry bags, hooks, and others; and daily used items, such as basins, pails, baskets, chairs and stools, tissue boxes, and others. It sells its products through supermarkets under the CHAHUA brand. The company was formerly known as Fujian Chahua Household Plastics Co., Ltd. and changed its name to Chahua Modern Housewares Co., Ltd. in 2013. Chahua Modern Housewares Co., Ltd. was founded in 1997 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350014",
        "website": "http://www.chahuajj.com",
        "full_time_employees": 1565
    },
    "603976.SS": {
        "short_name": "CHONGQING ZHENGCHUAN PHARMACEUT",
        "long_name": "ChongQing Zhengchuan Pharmaceutical Packaging Co.,Ltd.",
        "summary": "ChongQing Zhengchuan Pharmaceutical Packaging Co.,Ltd. engages in the research and development, manufacturing, and selling of pharmaceutical glass packaging materials in China. It offers injection and oral liquid bottles; ampoules and medicinal glass tubes; and plastic flip off and aluminum caps. The company also offers various borosilicate glass bottles and soda lime glass tubes. The company was founded in 1988 and is headquartered in Chongqing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400700",
        "website": "http://www.cqzcjt.com",
        "full_time_employees": 1556
    },
    "6898.HK": {
        "short_name": "CHINA ALUMCAN",
        "long_name": "China Aluminum Cans Holdings Limited",
        "summary": "China Aluminum Cans Holdings Limited, an investment holding company, primarily manufactures and sells aluminum aerosol cans in Mainland China, Africa, the United States, rest of Asia, and the Middle East. The company offers aluminum aerosol cans for packaging personal care products, such as body deodorant, hair styling products, and shaving creams; and pharmaceutical products, including pain relieving and antiseptic sprays, and spray dressings. It is also involved in the trading of aluminum aerosol cans. The company was incorporated in 2012 and is headquartered in Zhongshan, the People's Republic of China. China Aluminum Cans Holdings Limited is a subsidiary of Wellmass International Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Zhongshan",
        "zipcode": null,
        "website": "http://www.6898hk.com",
        "full_time_employees": 258
    },
    "8C3.F": {
        "short_name": "CPMC HOLDINGS LTD",
        "long_name": "CPMC Holdings Limited",
        "summary": "CPMC Holdings Limited, an investment holding company, manufactures and sells packaging products for various consumer goods in the People's Republic of China. The company operates through Tinplate Packaging, Aluminum Packaging, and Plastic Packaging units. The Tinplate Packaging unit offers three-piece beverage cans; food cans, including milk powder cans; aerosol cans; metal caps; printed and coated tinplates; steel barrels; round and square shaped cans; and other metal packaging products. The Aluminum Packaging unit provides aluminum packaging products, such as two-piece beverage cans and one-piece bottles. The Plastic Packaging unit offers plastic packaging products for milk bottles, shampoo bottles, plastic devices of electronic products, daily use hardware, package printing, sports drink bottles, and related plastic-made products. In addition, the company offers packaging solutions, including packaging design, printing, logistics, and customer services. CPMC Holdings Limited was incorporated in 2009 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.cofco-pack.com",
        "full_time_employees": 6131
    },
    "8GA.F": {
        "short_name": "GREATVIEW ASEP.PAC.HD-,01",
        "long_name": "Greatview Aseptic Packaging Company Limited",
        "summary": "Greatview Aseptic Packaging Company Limited, an investment holding company, manufactures, distributes, and sells paper packaging products and filling machines to dairy and non-carbonated soft drink producers in the People's Republic of China and internationally. The company sells its aseptic packaging materials under the GREATVIEW trademark, which includes Greatview Brick, Greatview Pillow, Greatview Crown, Greatview Octagon, and Greatview Blank-Fed. It also provides spare parts, technical services, digital marketing, and product traceability solutions to the liquid food industry; packaging related equipment and technical development services; and rubber and plastic films. In addition, the company is involved in the technical research and development; software research and development; and research and development of multi-layer food packaging materials. Greatview Aseptic Packaging Company Limited was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.greatviewpack.com",
        "full_time_employees": 1673
    },
    "BQP.SI": {
        "short_name": "Southern Pkg",
        "long_name": "Southern Packaging Group Limited",
        "summary": "Southern Packaging Group Limited, an investment holding company, produces and trades in flexible and rigid packaging products in the People's Republic of China, Europe, the United States, Australia, and internationally. Its Flexible Packaging segment manufactures plastic packaging bags with design supplied by the customers for the pharmaceutical, food and beverage, and hygiene industries. The company's Rigid Packaging segment manufactures polythylene terephthalate bottles, as well as prints design onto the bottles for the pharmaceutical, food and beverage, and hygiene industries. Its Property Development segment develops properties for future sale. The company also engages in the sub-contract processing business. Southern Packaging Group Limited was incorporated in 2003 and is based in Foshan, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Foshan",
        "zipcode": "528251",
        "website": "http://www.southern-packaging.com",
        "full_time_employees": null
    },
    "F4B1.F": {
        "short_name": "FUWEI FILMS HLDGS DL-,01",
        "long_name": "Fuwei Films (Holdings) Co., Ltd.",
        "summary": "Fuwei Films (Holdings) Co., Ltd., through its subsidiaries, engages in the development, manufacture, and distribution of biaxially oriented polyethylene-terephthalate films in the People's Republic of China. The company offers dry film, which is used in circuit boards production, nameplate, and crafts etching; chemically treated films used to enhance properties, such as barrier resistance, printing properties, and electrostatic resistance; stamping foil base films and transfer base films for packaging of luxury items, including cigarettes and alcohol; and printing base films for use in printing and lamination. It also provides metallized films or aluminum plating base films for use in vacuum aluminum plating for flexible plastic lamination; high-gloss films for aesthetically enhanced packaging purposes; heat-sealable films for construction, printing, and making heat sealable bags; and laser holographic base films used as anti-counterfeit films for food, medicine, cosmetics, cigarettes, and alcohol packaging; and heat shrinkable films used for special-shaped packaging for beverage and cosmetics. The company markets and sells its products under Fuwei Films brand for packaging, imaging, electronics, electrical, and magnetic products. It also exports its products to end-users and distributors primarily in Europe, Asia, and North America. The company was formerly known as Neo-Luck Plastic Holdings Co., Ltd. and changed its name to Fuwei Films (Holdings) Co., Ltd. in April 2005. The company was founded in 2003 and is headquartered in Weifang, the People's Republic of China. Fuwei Films (Holdings) Co., Ltd. is a subsidiary of Hongkong Ruishang International Trade Co., Ltd.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": "261061",
        "website": "http://www.fuweiholdings.com",
        "full_time_employees": 208
    },
    "FFHL": {
        "short_name": "Fuwei Films (Holdings) Co., Ltd",
        "long_name": "Fuwei Films (Holdings) Co., Ltd.",
        "summary": "Fuwei Films (Holdings) Co., Ltd., through its subsidiaries, engages in the development, manufacture, and distribution of biaxially oriented polyethylene-terephthalate films in the People's Republic of China. The company offers dry film, which is used in circuit boards production, nameplate, and crafts etching; chemically treated films used to enhance properties, such as barrier resistance, printing properties, and electrostatic resistance; stamping foil base films and transfer base films for packaging of luxury items, including cigarettes and alcohol; and printing base films for use in printing and lamination. It also provides metallized films or aluminum plating base films for use in vacuum aluminum plating for flexible plastic lamination; high-gloss films for aesthetically enhanced packaging purposes; heat-sealable films for construction, printing, and making heat sealable bags; and laser holographic base films used as anti-counterfeit films for food, medicine, cosmetics, cigarettes, and alcohol packaging; and heat shrinkable films used for special-shaped packaging for beverage and cosmetics. The company markets and sells its products under Fuwei Films brand for packaging, imaging, electronics, electrical, and magnetic products. It also exports its products to end-users and distributors primarily in Europe, Asia, and North America. The company was formerly known as Neo-Luck Plastic Holdings Co., Ltd. and changed its name to Fuwei Films (Holdings) Co., Ltd. in April 2005. The company was founded in 2003 and is headquartered in Weifang, the People's Republic of China. Fuwei Films (Holdings) Co., Ltd. is a subsidiary of Hongkong Ruishang International Trade Co., Ltd.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": "261061",
        "website": "http://www.fuweiholdings.com",
        "full_time_employees": 208
    },
    "GRVWF": {
        "short_name": "GREATVIEW ASEPTIC PACKAGING CO ",
        "long_name": "Greatview Aseptic Packaging Company Limited",
        "summary": "Greatview Aseptic Packaging Company Limited, an investment holding company, manufactures, distributes, and sells paper packaging products and filling machines to dairy and non-carbonated soft drink producers in the People's Republic of China and internationally. The company sells its aseptic packaging materials under the GREATVIEW trademark, which includes Greatview Brick, Greatview Pillow, Greatview Crown, Greatview Octagon, and Greatview Blank-Fed. It also provides spare parts, technical services, digital marketing, and product traceability solutions to the liquid food industry; packaging related equipment and technical development services; and rubber and plastic films. In addition, the company is involved in the technical research and development; software research and development; and research and development of multi-layer food packaging materials. Greatview Aseptic Packaging Company Limited was founded in 2001 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.greatviewpack.com",
        "full_time_employees": 1673
    }
}