{"1448.HK": {"short_name": "FU SHOU YUAN", "long_name": "Fu Shou Yuan International Group Limited", "summary": "Fu Shou Yuan International Group Limited, together with its subsidiaries, primarily provides burial and funeral services in the People's Republic of China. It operates through three segments: Burial Services, Funeral Services, and Other Services. The Burial Services segment sells burial plots; and offers cemetery maintenance services. The Funeral services segment engages in the planning of funeral arrangement; and interment, organizing, and hosting of the funeral. The Other Services segment manufactures and sells cremation machines; and provides auxiliary services, such as landscape and garden design. It also offers flowers and related designing services; sales and after-sales service for cremation devices; management services to cemeteries; and consulting services to burial and cemetery maintainers. In addition, the company sells agricultural products. As of December 31, 2019, it had approximately 24 cemeteries and 26 funeral facilities. Fu Shou Yuan International Group Limited was founded in 1994 and is headquartered in Shanghai, the People's Republic of China.", "currency": "HKD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Shanghai"}, "600421.SS": {"short_name": "HUBEI HUARONG HOLDING CO LTD", "long_name": "Hubei Huarong Holding Co.,Ltd.", "summary": "Hubei Huarong Holding Co.,Ltd. produces and distributes pharmaceutical products in China. The company's principal pharmaceutical products include Gucining Capsules and Huoxue Tongmai Capsules. It also develops biological products, pharmaceuticals, environment-protection, and agricultural products, as well as related technologies. The company was formerly known as Hubei Yangfan Holding Co., Ltd. and changed its name to Hubei Huarong Holding Co.,Ltd. in November 2020. Hubei Huarong Holding Co.,Ltd. was founded in 1997 and is headquartered in Wuhan, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Wuhan"}, "603377.SS": {"short_name": "EASTERN PIONEER DRIVING SCHOOL ", "long_name": "Eastern Pioneer Driving School Co., Ltd", "summary": "Eastern Pioneer Driving School Co., Ltd operates a driving school primarily in China. It provides driver training services for large passenger cars, medium-sized passenger cars, large trucks, tractors, motorcycles, and other vehicles. The company is headquartered in Beijing, China.", "currency": "CNY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Beijing"}}