{
    "603129.SS": {
        "short_name": "ZHEJIANG CF MOTO POWER CO LTD",
        "long_name": "Zhejiang Cfmoto Power Co.,Ltd",
        "summary": "Zhejiang Cfmoto Power Co.,Ltd develops, manufactures, and markets motorcycles, all-terrain vehicles, side-by-side utility vehicles, power sports engines, parts, gears, and apparel and accessories worldwide. The company was founded in 1989 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Recreational Vehicles",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "603766.SS": {
        "short_name": "LONCIN MOTOR CO LTD",
        "long_name": "Loncin Motor Co., Ltd.",
        "summary": "Loncin Motor Co., Ltd. engages in the manufacture and sale of generating sets, agricultural machinery equipment, light-duty power units, and two-wheeled motorcycles in Japan. It offers motorcycles, motorcycle engines, recreational vehicles, premium engines, farm machinery; and engine parts. The company also provides large displacement engines; gasoline generators, water pumps, and tillers, as well as repair and maintenance services. It also exports its products. The company was founded in 1993 and is based in Chongqing, China. Loncin Motor Co., Ltd. is a subsidiary of Loncin Holdings Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Recreational Vehicles",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "603787.SS": {
        "short_name": "JIANGSU XINRI E-VEHICLE CO LTD",
        "long_name": "Jiangsu Xinri E-Vehicle Co., Ltd.",
        "summary": "Jiangsu Xinri E-Vehicle Co., Ltd. engages in the research and development, production, and distribution of electric vehicles, and spare parts and components in China. It offers electric bikes, electric scooters, electric motorcycles, electric tricycles, and electric cars, as well as electric motors, batteries, controllers, and battery chargers. The company also exports its products to approximately 70 countries and regions. Jiangsu Xinri E-Vehicle Co., Ltd. was founded in 1999 and is headquartered in Wuxi, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Recreational Vehicles",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Wuxi"
    },
    "EZGO": {
        "short_name": "EZGO TECHNOLOGIES LTD",
        "long_name": "EZGO Technologies Ltd. Ordinary Shares",
        "summary": "EZGO Technologies Ltd., through its subsidiaries, engages in the trading, sale, and rental of lithium batteries in the People's Republic of China. It also engages in the design, manufacture, rental, and sale of e-bicycles and e-tricycles; and sale, franchising, and operation of smart charging piles for e-bicycles and other electronic devices. The company offers its e-bicycles and e-tricycles under the Dilang and Cenbird brand name; and smart charging piles under the Hengdian brand name. It also sells battery packs and cells. The company was formerly known as EZGO IOT Tech & Services Co., Ltd. The company was incorporated in 2019 and is headquartered in Changzhou, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Recreational Vehicles",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Changzhou"
    }
}