{
    "1902.HK": {
        "short_name": "YINCHENG INTL",
        "long_name": "Yincheng International Holding Co., Ltd.",
        "summary": "Yincheng International Holding Co., Ltd., an investment holding company, engages in the property development activities in Mainland China. It develops and sells residential properties, including high-rise and multi-story apartments, and low-density houses, as well as commercial properties; operates exhibitions; provides property management services; operates hotels; and leasing of investment properties. The company also engages in medical management and consulting activities. Yincheng International Holding Co., Ltd. was founded in 1993 and is headquartered in Nanjing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.yincheng.hk",
        "market_cap": 5049890304
    },
    "2231.HK": {
        "short_name": "JY GRANDMARK",
        "long_name": "JY Grandmark Holdings Limited",
        "summary": "JY Grandmark Holdings Limited, an investment holding company, engages in the property development activities in the People's Republic of China. The company operates through four segments: Property Development and Sales, Commercial Properties Investment, Hotel Operations, and Property Management. It develops residential properties; operates hotels, such as Just Stay Hotel and Just Stay Resort; offers property management and health management services; and owns and operates commercial properties. JY Grandmark Holdings Limited was founded in 2013 and is headquartered in Guangzhou, the People's Republic of China. JY Grandmark Holdings Limited is a subsidiary of IQ EQ (BVI) Limited.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.jygrandmark.com",
        "market_cap": 5234820608
    }
}