{
    "000796.SZ": {
        "short_name": "CAISSA TOSUN DEVEL",
        "long_name": "Caissa Tosun Development Co., Ltd.",
        "summary": "Caissa Tosun Development Co., Ltd. provides travel and tourism related services in China and internationally. It offers Chinese citizens tourism, foreign citizens inbound tour, business travel, incentive travel, international cooperation and exchange, international conference and exhibition, aviation, railway passenger transportation agency, tourism and information consulting, and online services. The company was formerly known as Hna-Caissa Travel Group Co., Ltd. and changed its name to Caissa Tosun Development Co., Ltd. in December 2019. The company was founded in 1993 and is headquartered in Beijing, China. Caissa Tosun Development Co., Ltd. is a subsidiary of HNA Tourism Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://s.caissa.com.cn",
        "market_cap": "Mid Cap"
    },
    "000888.SZ": {
        "short_name": "EMEI SHAN TOURISM",
        "long_name": "Emei Shan Tourism Co.,Ltd",
        "summary": "Emei Shan Tourism Co.,Ltd operates as a tourism company primarily in Sichuan province, China. It provides travel services, online booking tickets, hotel booking, purchase products, seasonal weather analysis, sight analysis, and others. The company also offers personalized professional services to business travelers. Emei Shan Tourism Co., Ltd is based in Emeishan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Emeishan City",
        "zipcode": "614200",
        "website": "http://www.ems517.com",
        "market_cap": "Mid Cap"
    },
    "002159.SZ": {
        "short_name": "W/SANTE CABLEWAYS",
        "long_name": "Wuhan Sante Cableway Group Co., Ltd.",
        "summary": "Wuhan Sante Cableway Group Co., Ltd. operates in the tourism industry in China. The company invests in, constructs, and operates approximately 20 sightseeing ropeway and scenic spots projects, including Huashan cableway in Shaanxi; Qiandao Lake cableway in Zhejiang; Fanjing Mountain scenic spot in Guizhou; and Monkey Island scenic spot in Hainan. It also operates a tourism complex. The company was founded in 1989 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "4300000",
        "website": "http://www.sante.com.cn",
        "market_cap": "Mid Cap"
    },
    "002707.SZ": {
        "short_name": "UTOUR GROUP CO LTD",
        "long_name": "UTour Group Co., Ltd.",
        "summary": "UTour Group Co., Ltd. provides outbound travel agency services in China and internationally. Its outbound travel services include study tours, immigration and real estate, tourism finance, health care travel, etc. The company also provides integrated marketing services. It operates through a network of 120 company-operated retail stores and 2,000 agents. The company was formerly known as Beijing UTour International Travel Service Co., Ltd. and changed its name to UTour Group Co., Ltd. in July 2016. UTour Group Co., Ltd. was founded in 1992 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100125",
        "website": "http://www.uzai.com",
        "market_cap": "Mid Cap"
    },
    "0780.HK": {
        "short_name": "TONGCHENG-ELONG",
        "long_name": "Tongcheng-Elong Holdings Limited",
        "summary": "Tongcheng-Elong Holdings Limited, an investment holding company, provides travel related services in the People's Republic of China. It offers various products and services covering a range of aspects of travel, including transportation ticketing, accommodation reservation, and various ancillary value-added products and services. The company also provides online advertising services, technology consulting and services, and insurance agency services. It provides its travel products and services through its tencent-based online platforms, mobile apps, and websites. The company was formerly known as China E-Dragon Holdings Limited and changed its name to Tongcheng-Elong Holdings Limited in March 2018. Tongcheng-Elong Holdings Limited was founded in 1999 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.tcelir.com",
        "market_cap": "Large Cap"
    },
    "0TUA.F": {
        "short_name": "TUNIU SP.ADR 1  DL-,0001",
        "long_name": "Tuniu Corporation",
        "summary": "Tuniu Corporation operates as an online leisure travel company. The company offers a selection of packaged tours, including organized and self-guided tours; and other travel-related services, such as tourist attraction tickets selling, visa application services, accommodation reservation, financial services, and hotel booking services, as well as air, train, and bus ticketing for leisure travelers. It also provides car rental and insurance services, as well as advertising services to tourism boards and bureaus. The company offers its products and services through various online and offline channels comprising the tuniu.com website; mobile platform; a primary call center in Nanjing; a regional call center in Suqian; and other offline retail stores in China. Tuniu Corporation was founded in 2006 and is headquartered in Nanjing, China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210042",
        "website": "http://www.tuniu.com",
        "market_cap": "Small Cap"
    },
    "1745.HK": {
        "short_name": "LVJI TECH",
        "long_name": "Lvji Technology Holdings Inc.",
        "summary": "Lvji Technology Holdings Inc. operates as an online tour guide provider in Mainland China. The company develops and deploys proprietary online tour guides, which can be purchased and accessed by tourists from its cloud system through OTAs, travel agencies, or Lvji APP. Its online tour guides include illustrated maps of tourist attractions; and editorial contents and voice-over commentaries for points of interest in the tourist attractions. The company also sells customized online tour guide products and services to administrators of tourist attractions and local government offices. The company was founded in 2013 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.lvji.cn",
        "market_cap": "Small Cap"
    },
    "1901.HK": {
        "short_name": "FEIYANG GROUP",
        "long_name": "Feiyang International Holdings Group Limited",
        "summary": "Feiyang International Holdings Group Limited, an investment holding company, provides travel related products and services in the People's Republic of China. It offers package tours; free independent traveler (FIT) products, including air tickets and hotel accommodations; and ancillary travel-related products and services, such as visa application processing, conferencing services, and arranging purchase of travel insurance for customers, as well as admission tickets to tourist attractions. The company also provides technical support, business information consultancy, and exhibition services, as well as software research and development. The company offers its products for retail, corporate, and institutional customers. Feiyang International Holdings Group Limited was founded in 2001 and is headquartered in Ningbo, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.iflying.com",
        "market_cap": "Small Cap"
    },
    "300178.SZ": {
        "short_name": "TEMPUS GLOBAL BUSI",
        "long_name": "Tempus Global Business Service Group Holding Ltd.",
        "summary": "Tempus Global Business Service Group Holding Ltd. provides tourism and vacation, aviation operations, business travel management, and financial services in the People's Republic of China. The company was founded in 1998 and is based in Shenzhen, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518038",
        "website": "http://www.feiren.com",
        "market_cap": "Small Cap"
    },
    "600706.SS": {
        "short_name": "XI'AN QUJIANG CULTURAL TOURISM ",
        "long_name": "Xi'an Qujiang Cultural Tourism Co., Ltd.",
        "summary": "Xi'an Qujiang Cultural Tourism Co., Ltd. engages in the tourism business in China. The company is involved in the operation and management of scenic spots; and hotel catering management and tourism brand marketing activities. The company was founded in 1984 and is based in Xi'an, China. Xi'an Qujiang Cultural Tourism Co., Ltd. is a subsidiary of Xi'an Qujiang Tourism Investment (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710061",
        "website": "http://www.qjtourism.com",
        "market_cap": "Small Cap"
    },
    "601888.SS": {
        "short_name": "CHINA TOURISM GROUP DUTY FREE C",
        "long_name": "China Tourism Group Duty Free Corporation Limited",
        "summary": "China Tourism Group Duty Free Corporation Limited provides travel and tourism services in China. The company offers special interest and adventures tours, business forums or formulization inspection tours, governmental relation visiting tours, incentive and conference tours, educational training or study programs, science and technology exchange programs, VIP or application for special treatment, society exploration tours, and inbound and outbound tours. It also operates duty free shops, which provides imported commodities and domestic masterpieces with approximately 20 categories and 1,000 varieties. The company was formerly known as China International Travel Service Corporation Limited and changed its name to China Tourism Group Duty Free Corporation Limited in June 2020. The company was founded in 1954 and is based in Beijing, China. China Tourism Group Duty Free Corporation Limited operates as a subsidiary of China Tourism Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100027",
        "website": "http://www.cits.net",
        "market_cap": "Large Cap"
    },
    "603099.SS": {
        "short_name": "CHANGBAI MOUNTAIN TOURISM CO LT",
        "long_name": "Changbai Mountain Tourism Co., Ltd.",
        "summary": "Changbai Mountain Tourism Co., Ltd. operates in the tourism industry in China. It engages in the tourist passenger transportation, hotel management, travel agency management, hot spring water development, scenic area management, and other activities. The company is based in Changbai, China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changbai",
        "zipcode": "133613",
        "website": "http://www.cbmt.com.cn",
        "market_cap": "Mid Cap"
    },
    "603199.SS": {
        "short_name": "ANHUI JIUHUASHAN TOURISM GROUP ",
        "long_name": "Anhui Jiuhuashan Tourism Development Co., Ltd.",
        "summary": "Anhui Jiuhuashan Tourism Development Co., Ltd. provides tourism services in the People's Republic of China. It is involved in the cableway, hotel, travel agency, tourist passenger transportation, and e-commerce businesses. Anhui Jiuhuashan Tourism Development Co., Ltd. was founded in 2000 and is based in Chizhou, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chizhou",
        "zipcode": "242813",
        "website": "http://www.jiuhuashan.cc",
        "market_cap": "Mid Cap"
    },
    "8095.HK": {
        "short_name": "BEIDA JADE BIRD",
        "long_name": "Beijing Beida Jade Bird Universal Sci-Tech Company Limited",
        "summary": "Beijing Beida Jade Bird Universal Sci-Tech Company Limited, an investment holding company, trades in metallic products in the People's Republic of China and the United States. It operates through four segments: Tourism Development, Investment Holding, Trading of Metallic Products, and All Other. The company offers purchases and sells metallic products; and produces and sells wine and related products. It also markets and sells embedded system products and related products; and provides investment management and advisory services. In addition, the company engages in travel and leisure, fund holding, debt and equity investment, land development, and urban infrastructure project development businesses. The company was founded in 2000 and is headquartered in Beijing, China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100871",
        "website": "http://www.jbu.com.cn",
        "market_cap": "Small Cap"
    },
    "9961.HK": {
        "short_name": "TRIP.COM-S",
        "long_name": "Trip.com Group Limited",
        "summary": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally. It acts as an agent for hotel-related transactions and selling air tickets, as well as provides train, long-distance bus, and ferry tickets; travel insurance products, including flight delay insurance, air accident insurance, and baggage loss coverage; and air-ticket delivery, online check-in and seat selection, express security screening, real-time flight status tracker, and airport VIP lounge services. The company also provides independent leisure travelers bundled packaged-tour products comprising group, semi-group, and customized and packaged tours with various transportation arrangements, such as air, cruises, buses, and car rental services. It offers integrated transportation and accommodation services; various value-added services, such as transportation at destinations and tickets, activities, insurance, visa services, and tour guides; user support, supplier management, and customer relationship management services; and in-destination products and services. The company also provides its corporate clients with business visits, incentive trips, meetings and conferences, travel data collection and analysis, industry benchmark, cost saving analysis, and travel management solutions; and Corporate Travel Management System, an online platform that integrates information management, online booking and authorization, online enquiry, and travel reporting systems. It offers online advertising and financial services. It operates under the Ctrip, Qunar, Trip.com, and Skyscanner brands. The company was formerly known as Ctrip.com International, Ltd. and changed its name to Trip.com Group Limited in October 2019. Trip.com Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.trip.com",
        "market_cap": "Large Cap"
    },
    "CLV.F": {
        "short_name": "TRIP.COM.GROUP  SP.ADR 1",
        "long_name": "Trip.com Group Limited",
        "summary": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally. It acts as an agent for hotel-related transactions and selling air tickets, as well as provides train, long-distance bus, and ferry tickets; travel insurance products, including flight delay insurance, air accident insurance, and baggage loss coverage; and air-ticket delivery, online check-in and seat selection, express security screening, real-time flight status tracker, and airport VIP lounge services. The company also provides independent leisure travelers bundled packaged-tour products comprising group, semi-group, and customized and packaged tours with various transportation arrangements, such as air, cruises, buses, and car rental services. It offers integrated transportation and accommodation services; various value-added services, such as transportation at destinations and tickets, activities, insurance, visa services, and tour guides; user support, supplier management, and customer relationship management services; and in-destination products and services. The company also provides its corporate clients with business visits, incentive trips, meetings and conferences, travel data collection and analysis, industry benchmark, cost saving analysis, and travel management solutions; and Corporate Travel Management System, an online platform that integrates information management, online booking and authorization, online enquiry, and travel reporting systems. It offers online advertising and financial services. It operates under the Ctrip, Qunar, Trip.com, and Skyscanner brands. The company was formerly known as Ctrip.com International, Ltd. and changed its name to Trip.com Group Limited in October 2019. Trip.com Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.trip.com",
        "market_cap": "Large Cap"
    },
    "CLVB.F": {
        "short_name": "TRIP.COM GROUP  DL-,00125",
        "long_name": "Trip.com Group Limited",
        "summary": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally. It acts as an agent for hotel-related transactions and selling air tickets, as well as provides train, long-distance bus, and ferry tickets; travel insurance products, including flight delay insurance, air accident insurance, and baggage loss coverage; and air-ticket delivery, online check-in and seat selection, express security screening, real-time flight status tracker, and airport VIP lounge services. The company also provides independent leisure travelers bundled packaged-tour products comprising group, semi-group, and customized and packaged tours with various transportation arrangements, such as air, cruises, buses, and car rental services. It offers integrated transportation and accommodation services; various value-added services, such as transportation at destinations and tickets, activities, insurance, visa services, and tour guides; user support, supplier management, and customer relationship management services; and in-destination products and services. The company also provides its corporate clients with business visits, incentive trips, meetings and conferences, travel data collection and analysis, industry benchmark, cost saving analysis, and travel management solutions; and Corporate Travel Management System, an online platform that integrates information management, online booking and authorization, online enquiry, and travel reporting systems. It offers online advertising and financial services. It operates under the Ctrip, Qunar, Trip.com, and Skyscanner brands. The company was formerly known as Ctrip.com International, Ltd. and changed its name to Trip.com Group Limited in October 2019. Trip.com Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.trip.com",
        "market_cap": "Large Cap"
    },
    "TCOM": {
        "short_name": "Trip.com Group Limited",
        "long_name": "Trip.com Group Limited",
        "summary": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally. It acts as an agent for hotel-related transactions and selling air tickets, as well as provides train, long-distance bus, and ferry tickets; travel insurance products, including flight delay insurance, air accident insurance, and baggage loss coverage; and air-ticket delivery, online check-in and seat selection, express security screening, real-time flight status tracker, and airport VIP lounge services. The company also provides independent leisure travelers bundled packaged-tour products comprising group, semi-group, and customized and packaged tours with various transportation arrangements, such as air, cruises, buses, and car rental services. It offers integrated transportation and accommodation services; various value-added services, such as transportation at destinations and tickets, activities, insurance, visa services, and tour guides; user support, supplier management, and customer relationship management services; and in-destination products and services. The company also provides its corporate clients with business visits, incentive trips, meetings and conferences, travel data collection and analysis, industry benchmark, cost saving analysis, and travel management solutions; and Corporate Travel Management System, an online platform that integrates information management, online booking and authorization, online enquiry, and travel reporting systems. It offers online advertising and financial services. It operates under the Ctrip, Qunar, Trip.com, and Skyscanner brands. The company was formerly known as Ctrip.com International, Ltd. and changed its name to Trip.com Group Limited in October 2019. Trip.com Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200335",
        "website": "http://www.trip.com",
        "market_cap": "Large Cap"
    },
    "TEM.DU": {
        "short_name": "TONGCHENG-ELONG DL-,0005",
        "long_name": "Tongcheng-Elong Holdings Limited",
        "summary": "Tongcheng-Elong Holdings Limited, an investment holding company, provides travel related services in the People's Republic of China. It offers various products and services covering a range of aspects of travel, including transportation ticketing, accommodation reservation, and various ancillary value-added products and services. The company also provides online advertising services, technology consulting and services, and insurance agency services. It provides its travel products and services through its tencent-based online platforms, mobile apps, and websites. The company was formerly known as China E-Dragon Holdings Limited and changed its name to Tongcheng-Elong Holdings Limited in March 2018. Tongcheng-Elong Holdings Limited was founded in 1999 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "DUS",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.tcelir.com",
        "market_cap": "Mid Cap"
    },
    "TEM.F": {
        "short_name": "TONGCHENG-ELONG DL-,0005",
        "long_name": "Tongcheng-Elong Holdings Limited",
        "summary": "Tongcheng-Elong Holdings Limited, an investment holding company, provides travel related services in the People's Republic of China. It offers various products and services covering a range of aspects of travel, including transportation ticketing, accommodation reservation, and various ancillary value-added products and services. The company also provides online advertising services, technology consulting and services, and insurance agency services. It provides its travel products and services through its tencent-based online platforms, mobile apps, and websites. The company was formerly known as China E-Dragon Holdings Limited and changed its name to Tongcheng-Elong Holdings Limited in March 2018. Tongcheng-Elong Holdings Limited was founded in 1999 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": null,
        "website": "http://www.tcelir.com",
        "market_cap": "Mid Cap"
    },
    "TOUR": {
        "short_name": "Tuniu Corporation",
        "long_name": "Tuniu Corporation",
        "summary": "Tuniu Corporation operates as an online leisure travel company. The company offers a selection of packaged tours, including organized and self-guided tours; and other travel-related services, such as tourist attraction tickets selling, visa application services, accommodation reservation, financial services, and hotel booking services, as well as air, train, and bus ticketing for leisure travelers. It also provides car rental and insurance services, as well as advertising services to tourism boards and bureaus. The company offers its products and services through various online and offline channels comprising the tuniu.com website; mobile platform; a primary call center in Nanjing; a regional call center in Suqian; and other offline retail stores in China. Tuniu Corporation was founded in 2006 and is headquartered in Nanjing, China.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "NGM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210042",
        "website": "http://www.tuniu.com",
        "market_cap": "Small Cap"
    }
}