{
    "ATRS.AS": {
        "short_name": "ATRIUM EUR REALEST",
        "long_name": "Atrium European Real Estate Limited",
        "summary": "Atrium European Real Estate Limited, together with its subsidiaries, owns, manages, and operates commercial real estate properties in the retail sector primarily in Poland, the Czech Republic, Slovakia, and Russia. The company operates in two segments, Standing Investment and Development. Its property portfolio includes food, fashion, and entertainment shopping centers. As of December 31, 2020, the company had 26 properties with a gross lettable area of approximately 809,000 thousand square meters. It is also involved in redevelopment activities, as well as activities related to land plots. The company was formerly known as Meinl European Land Limited and changed its name to Atrium European Real Estate Limited in May 2008. The company was incorporated in 1997 and is based in St. Helier, Jersey. Atrium European Real Estate Limited is a subsidiary of Gazit-Globe Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Jersey",
        "state": null,
        "city": "St. Helier",
        "zipcode": "JE2 4UH",
        "website": "http://www.aere.com",
        "market_cap": "Small Cap"
    },
    "CRC.L": {
        "short_name": "CIRCLE PROPERTY PLC ORD NPV",
        "long_name": "Circle Property Plc",
        "summary": "Circle is amongst the best performing quoted UK real estate companies by NAV total return (NAV growth and dividend) having delivered consistent returns with 87% NAV growth since IPO in 2016 in absolute terms. Circle focusses on acquiring assets in regional cities, many of which have significant office supply constraints, and on office assets with active management potential (refurbishment opportunities, under-rented or vacant properties or short leases), rather than just maximising initial rental yields. Circle is not a Real Estate Investment Trust (REIT) and can actively recycle proceeds from asset sales into its refurbishment and redevelopment pipeline, as well as future investment opportunities, therefore targeting a broader range of returns for shareholders, which are primarily driven by NAV growth. As well as already delivering substantial increases in NAV, the Company's portfolio has significant reversionary potential with current total estimated rental values of approximately Â£10.9 million per annum, compared to contracted rent of Â£8.2 million at 30 September 2019. The Company has a portfolio of 15 regional commercial property investment and development assets in the UK valued at Â£135.6 million as at 30 September 2019.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE2 4SZ",
        "website": "http://www.circleproperty.co.uk",
        "market_cap": "Small Cap"
    }
}