{"DHBK.QA": {"short_name": "Doha Bank QPSC", "long_name": "Doha Bank Q.P.S.C.", "summary": "Doha Bank Q.P.S.C. provides various banking products and services to individual, commercial, corporate, and institutional clients. The company operates in two segments, Conventional Banking and Insurance Activities. The Conventional Banking segment offers a range of products and services to business and corporate customers, including funded and non-funded credit facilitates deposits to corporate customers. It also undertakes funding and centralized risk management activities through borrowings; issues debt securities; uses derivatives for risk management purposes; and invests in liquid assets, such as short-term placements, and corporate and government debt securities. In addition, this segment provides loans, credit cards, deposits, and other transactions to individuals. The Insurance Activities segment offers contracts of insurance, arranges deals in investments, and advises on investments. The company operates 24 branches in Qatar; and six overseas branches in the United Arab Emirates, State of Kuwait, and the Republic of India, as well as representative offices in the United Kingdom, Singapore, Turkey, China, Japan, South Korea, Germany, Australia, Hong Kong, Canada, Bangladesh, South Africa, Sri Lanka, and Nepal. Doha Bank Q.P.S.C. was founded in 1979 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "QNBK.QA": {"short_name": "Qatar National Bank QPSC", "long_name": "Qatar National Bank (Q.P.S.C.)", "summary": "Qatar National Bank (Q.P.S.C.), together with its subsidiaries, provides commercial and Islamic banking products and services in Qatar and internationally. The company operates through four segments: Corporate Banking, Consumer banking, Asset and Wealth Management, and International Banking. It offers personal banking products and services, such as current, savings, fixed deposit, and call-notice deposit accounts; credit, debit, and pre-paid cards; personal, top-up, vehicle, vehicle lease, and mortgage loans; insurance products, including life, salary continuation, critical illness, motor, mortgage, and travel insurance; asset management services; and mobile, Internet, ATM, SMS, and USSD banking services. The company also provides business banking products and services, including current, call, fixed deposit, and non-resident accounts; working capital, project, and vehicle loans; structured and project finance; transaction banking services; and credit cards. In addition, it offers financial institutions, treasury, investment banking, and advisory services; and brokerage and custody services. The company serves individuals and corporates, as well as high net worth customers. It has a network of approximately 1,113 branches and approximately 4,335 ATMs. The company was formerly known as Qatar National Bank S.A.Q. and changed its name to Qatar National Bank (Q.P.S.C.) in January 2016. Qatar National Bank (Q.P.S.C.) was founded in 1964 and is headquartered in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Banks—Diversified", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}}