{
    "ABQK.QA": {
        "short_name": "Ahli BanK QPSC",
        "long_name": "Ahli Bank Q.P.S.C.",
        "summary": "Ahli Bank Q.P.S.C., together with its subsidiaries, provides corporate and retail banking services in Qatar. The company operates through two segments, Retail and Private Banking and Wealth Management; and Corporate Banking Treasury, Investments and Brokerage Subsidiary. It also provides brokerage services. The company offers account products, such as savings, current, and call accounts; loan products that include salary advance, overdrafts, auto loans, personal loans, and mortgage loans; term deposits; and card products, such as credit, debit, cash back, contactless, and payroll cards. It also provides insurance services and various savings and investment products and services. In addition, the company offers financing solutions that include medium and long term loans, syndicated loans, contractor, working capital, equipment and fleet, real estate and project, and structured finances; wage protection systems; and corporate solutions, such as hedging solutions, forwards, swaps, options, interest rate hedging's, interest rate swaps, interest caps and floors, ISDA agreements, investment solutions, fixed income products, and structured deposits and notes. Further, it provides import services that include documentary credits and collections, and shipping guarantees; export services, such as LC advising and confirmation, and documentary collections; and guarantee services that include big bonds, performance bonds, advance payment and payment guarantees, counter guarantees for other banks, and avalisation of promissory notes/checks. Additionally, the company offers financing products, such as pre and post shipment finance, open account finance, and invoice discounting. It serves customers through 14 branches and ATMs comprising 20 in branches and 55 off-site ATMs, as well as contact centers, mobile and online banking. The company was founded in 1983 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "CBQK.QA": {
        "short_name": "The Commercial Bank PSQC",
        "long_name": "The Commercial Bank (P.S.Q.C.)",
        "summary": "The Commercial Bank (P.S.Q.C.), together with its subsidiaries, engages in the conventional banking, brokerage services, and credit card businesses. The company operates through four segments Wholesale Banking, Retail Banking, Alternatifbank A.S. (ABank), and Other Principal Subsidiaries. The Wholesale Banking segment provides demand and time deposit services; various conventional funded and non-funded credit facilities; currency exchange facilities; interest rate swaps and other derivative trading services; loan syndication and structured financing services; corporate lending; trade finance; other deposits; and letters of credit and guarantees, as well as manages money market funds and proprietary investment portfolio. This segment serves corporate, commercial, and multinational customers, as well as large, medium, and small enterprises. The Retail Banking segment offers personal current, savings, time, and investment account services; credit card and debit card services; consumer, personal, and vehicle loans, and residential mortgage services; and custodial and wealth management services to retail and individual customers. The ABank segment provides corporate, commercial, and retail banking products and services through a network of 48 branches in Turkey. The Other Principal Subsidiaries segment offers brokerage services; and issues debts for banks. The company also provides insurance products. It operates in Qatar, other GCC countries, rest of the Middle East, Europe, North America, and internationally. The company operates a network of 29 full service branches and 173 ATMs. The Commercial Bank (P.S.Q.C.) was incorporated in 1974 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "KCBK.QA": {
        "short_name": "Al Khalij Commercial Bank PQSC",
        "long_name": "Al Khalij Commercial Bank (al khaliji) P.Q.S.C.",
        "summary": "Al Khalij Commercial Bank (al khaliji) P.Q.S.C., together with its subsidiaries, provides commercial banking products and services in Qatar, the United Arab Emirates, and France. It operates through Wholesale Banking and Personal Banking segments. The company offers personal banking products, such as current, savings, and fusion accounts; fixed deposit accounts; personal, mortgage, and auto loans; ATMs; credit life insurance; credit cards; and cross mortgage services. It also provides corporate banking products and services, such as corporate lending products comprising working capital finance, overdrafts, short term loans, and medium and long term loans; club and syndicated loans; structured finance products that include project finance and contract financing; and trade finance products, such as documentary credit, documentary collections, and guarantees. The company's corporate banking products and services also include cash management; and advisory services in the areas of risk management, liquidity management, and treasury and debt capital markets. In addition, the company offers treasury services, such as funding and liquidity, and treasury sales; and premium and private banking, and debt issuance services, as well as Internet, phone, and SMS banking services. It operates 40 ATMs and 9 branches. The company serves premium, business, corporate, and international customers. Al Khalij Commercial Bank (al khaliji) P.Q.S.C. was founded in 2007 and is headquartered in Lusail, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Lusail"
    },
    "MARK.QA": {
        "short_name": "Masraf Al Rayan QPSC",
        "long_name": "Masraf Al Rayan (Q.P.S.C.)",
        "summary": "Masraf Al Rayan (Q.P.S.C.) engages in the Islamic banking, financing, investing, and brokerage activities in Qatar and internationally. It operates through four segments: Corporate Banking, Retail Banking, Asset Management, and International Operations segments. The company's corporate banking products and services include corporate finance and advisory services, such as capital restructuring, capital raising, corporate valuation, transformation of business products, mergers and acquisitions, specialized investment, structured finance, project finance, and IPO; financing products comprising Murabaha, Ijarah, Ijarah Muntahia Bittamleek, Istisna'a, and Mudaraba; cash management services; treasury services; profit rate swaps, financing syndication, and other services; and trade finance products, such as letters of credit and guarantee, as well as deposit services, currency exchange, and other services. Its retail banking products and services comprise current, savings, investment, term deposit, and kids accounts, as well as other investment products; personal, car, and home finance products; and credit cards and prepaid cards. The company also provides private banking products and services, such as investment planning and asset management, wealth protection, credit planning and management, cash management, and business planning. In addition, it offers investment banking and financial brokerage services; and real estate consulting services. The company serves retail and individual customers, as well as corporate, commercial, and multinational customers. It operates through 17 branches and 96 ATMs in Qatar. Masraf Al Rayan (Q.P.S.C.) was incorporated in 2006 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "QFBQ.QA": {
        "short_name": "Qatar First Bank LLC",
        "long_name": "Qatar First Bank L.L.C (Public)",
        "summary": "Qatar First Bank L.L.C (Public), an Islamic bank, provides alternative investment, private banking and wealth management, corporate and institutional banking, and treasury and investment management services to individuals and corporates in Qatar and internationally. The company operates through three segments: Alternative Investments, Private Bank, and Other. It offers deposit accounts, treasury forex products, and plain vanilla and specialized financing solutions; and advisory, brokerage, fund and investment, credit facilities, and custody services. The company also engages in the direct investment in venture capital business and real estate asset classes. In addition, it engages in financing, catering, construction, and money market fund businesses, as well as owns and leases real estate properties. The company was formerly known as Qatar First Investment Bank L.L.C. Qatar First Bank L.L.C (Public) was founded in 2008 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "QIBK.QA": {
        "short_name": "Qatar Islamic Bank QPSC",
        "long_name": "Qatar Islamic Bank (Q.P.S.C.)",
        "summary": "Qatar Islamic Bank (Q.P.S.C.), together with its subsidiaries, offers banking products and services in Qatar and internationally. The company operates through four segments: Corporate Banking, Retail Banking, Other Group Units, and Local & International Subsidiaries. It offers current, savings/call, multicurrency, and time deposit accounts; certificate of deposit; and credit and debit cards. The company also provides personal, car, home, working capital, asset, mortgage and real estate, project, contracting, start-up business, trade, luxury goods, and fleet and heavy equipment finance, as well as finance for general corporate purposes. In addition, it offers trade finance services, such as letters of credit, letters of guarantee, documentary/bills collection, shipping guarantees, and tariff trade services; and treasury services, including liquidity management, Sukuk, foreign exchange, and hedging services, as well as investment products. Further, the company provides education, auto, family shield, travel, group credit life, and saving Takaful programs; payroll, cash and cheque collection, overnight vaulting, and wealth management services; and Internet, phone, SMS, mobile, and automated teller machines and cash deposit machines banking services, as well as invests in real estate. It serves individual customers, institutional investors, corporates, small and medium enterprises, financial institutions, and investment entities. The company operates 29 branches in Qatar and 1 branch in Sudan. Qatar Islamic Bank (Q.P.S.C.) was founded in 1982 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "QIIK.QA": {
        "short_name": "Qatar International Islamic Ban",
        "long_name": "Qatar International Islamic Bank (Q.P.S.C)",
        "summary": "Qatar International Islamic Bank (Q.P.S.C) engages in banking, financing, and investing activities. The company operates through three segments: Corporate Banking, Personal Banking, and Treasury & Investments. It offers current, saving, and term deposit accounts; personal, vehicle, and home finance; debit and credit cards; mobile, Internet, and phone banking; call center; ATM; safe deposit; and credit life and vehicle insurance products and services. The company also provides working capital, real estate, contracting, and project finance, as well as corporate finance and syndication services; and treasury and investment banking services, including equity participation, private equity, investment funds, Sukuk, and international finance and syndications. It operates 19 branches in Qatar. The company serves corporate and retail customers, government and semi government institutions, and small and medium-sized enterprises. It operates in Qatar, the Middle East, other Gulf Cooperation Council countries, Europe, North America, and internationally. Qatar International Islamic Bank (Q.P.S.C) was incorporated in 1990 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Banks—Regional",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    }
}