{"DBIS.QA": {"short_name": "Dlala Brokerage and Investment ", "long_name": "Dlala Brokerage and Investment Holding Company Q.P.S.C.", "summary": "Dlala Brokerage and Investment Holding Company Q.P.S.C., together with its subsidiaries, engages in the brokerage activities at the Qatar Exchange. The company operates through Stock Broking, Real Estate, and Information Technology segments. It offers brokerage services in equity markets for companies listed on various financial markets, as well as for Shari'a-compliant listed companies. The company also provides property management services, including monthly rent collection, maintenance, and general services; residential, commercial, and industrial property rental services; marketing and sales services for properties through sales points, exhibitions, and database; and acts as a broker to find buyers for properties, as well as finalizes registrations and settlements. In addition, it engages in the provision of information technology management and consultation services; and developing and programming of programs, as well as investment activities. Dlala Brokerage and Investment Holding Company Q.P.S.C. was founded in 2005 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}, "IHGS.QA": {"short_name": "Inma Holding QPSC", "long_name": "Islamic Holding Group (Q.P.S.C)", "summary": "Islamic Holding Group (Q.P.S.C) invests in shares and bonds in Qatar. It operates through Brokerage and Real Estate segments. The company provides financial brokerage services. It provides property management, marketing, and sales services for real estate. The company was formerly known as Islamic Financial Securities Company (Q.S.C) and changed its name to Islamic Holding Group (Q.P.S.C) in July 2010. Islamic Holding Group (Q.P.S.C) was founded in 2003 and is based in Doha, Qatar.", "currency": "QAR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "DOH", "market": "qa_market", "country": "Qatar", "city": "Doha"}}