{
    "1H4.SI": {
        "short_name": "$ Memories",
        "long_name": "Memories Group Limited",
        "summary": "Memories Group Limited, together with its subsidiaries, operates as a tourism company in Myanmar. It operates through three segments: Experiences, Services, and Hotels. The Experiences segment engages in the full service commercial hot air balloon business under the Balloons over Bagan brand in Bagan and Inle Lake area. It also provides cruising services on luxury yacht in the Mergui Archipelago in southern Myanmar under the Burma Boating brand. The Services segment engages in the provision of travel and destination management services, including designing and preparing customized itineraries for tour packages; organizing various excursions, activities, and cultural experiences; managing tour logistics, such as recommending and booking of accommodations, restaurants, and transportation; organizing meetings, incentives, travel, conventions, and exhibition events; and provision of travel guides of various languages in Myanmar. It provides its services under the Asia Holiday brand. The Hotels segment owns and operates hotels, resorts, and lodges at various tourist and business destinations. It operates hotels under the Awei, Keinnara, and Suggati brands; lodges under the Pun Hlaing, Hpa An, and Loikaw brands; and resorts under the Kayah brand, as well as an integrated tourism platform. The company also develops and manages hotels and related hospitality businesses; operates restaurant and related services; and provides tour operator and travel agency services. Memories Group Limited is headquartered in Yangon, Myanmar.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Myanmar",
        "state": null,
        "city": "Yangon",
        "zipcode": "11401",
        "website": "http://www.memoriesgroup.com",
        "full_time_employees": null
    }
}