{
    "H4L1.F": {
        "short_name": "HALYK SAV.BK.GDRS/40 KT15",
        "long_name": "JSC Halyk bank",
        "summary": "JSC Halyk Bank, together with its subsidiaries, provides corporate and retail banking services primarily in the Republic of Kazakhstan, Russia, Kyrgyzstan, Tajikistan, Georgia, and Uzbekistan. It operates through four segments: Corporate Banking, Small and Medium Enterprises Banking (SME), Retail Banking, and Investment Banking. The company originates loans and guarantees; collects deposits; trades in securities and foreign currencies; executes transfers; and offers cash and payment card processing, and other banking services. Its products and services include current and correspondent accounts; various deposit products; investment savings products; credit and debit cards; consumer loans and mortgages; custody, cash, and foreign currency related services; overdrafts; other credit facilities; and letters of credit, trade finance products, foreign exchange, and documentary services. In addition, it offers leasing, telecommunications, broker and dealer, cash collection, and asset management services; and property and casualty, liability, personal, and life insurance products, as well as online banking services. The company serves individuals, corporate clients and financial organizations, and SME clients and individual entrepreneurs. As of December 31, 2020, it operated through its head office in Almaty and its 24 regional branches, 120 sub-regional offices, and 467 cash settlement units. The company was founded in 1923 and is headquartered in Almaty, the Republic of Kazakhstan. JSC Halyk Bank is a subsidiary of JSC HG Almex.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "state": null,
        "city": "Almaty",
        "zipcode": "A26M3K5",
        "website": "http://halykbank.kz",
        "full_time_employees": 16991
    }
}