{
  "HAG.F": {
    "city": "Taufkirchen",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aerospace & Defense",
    "long_name": "Hensoldt AG",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "HENSOLDT AG INH O.N.",
    "state": null,
    "summary": "HENSOLDT AG, together with its subsidiaries, provides defense and security electronic sensor solutions worldwide. It offers air surveillance, airborne, ground based, security, naval and coastal, and space radars; identification friend or foe and secure data links; and commercial shipping solutions. The company also provides airborne, vehicle, surveillance, and maritime optronics; space optics; optronic sensor devices; and sights, scopes, and night-vision attachments. In addition, it offers electronic support/SIGINT products, receivers, direction finders, electronic attackers/jammers, self-protection EW software suites and ground support stations, and electronic warfare systems. Further, the company provides avionics, including airborne computing, flight and mission data record management, connectivity mission management/pilot assistance, video management, unmanned, mission planning support, data analysis and evaluation, cloud, and active sensing products and solutions, as well as integrated solutions; and counter UAV solutions, and command and control software products. Additionally, it offers products and system support, simulation, and training services; and antenna, cabling, shelter, and tester solutions. The company is headquartered in Taufkirchen, Germany",
    "website": "http://www.hensoldt.net",
    "zipcode": "82024"
  },
  "MLHK.PA": {
    "city": "Oberndorf am Neckar",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Aerospace & Defense",
    "long_name": "H&K AG",
    "market": "fr_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "HK",
    "state": null,
    "summary": "H&K AG, together with its subsidiary, develops, manufactures, markets, and distributes infantry and sidearms for federal, state, or local governmental agencies in NATO countries and the European Union. It offers a range of small arms for military and law enforcement, and civil markets, such as pistols, submachine guns and pistols, assault rifles, precision rifles, machine guns, training systems, 40 MM systems, grenade launchers, and specialist equipment, as well as provides related accessories and services. The company was founded is 1949 and is based in Oberndorf am Neckar, Germany. H&K AG is a subsidiary of Compagnie de Développement de l'Eau S.A.",
    "website": "http://www.heckler-koch.com",
    "zipcode": "78727"
  },
  "OHB.DE": {
    "city": "Bremen",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Aerospace & Defense",
    "long_name": "OHB SE",
    "market": "de_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "OHB SE  O.N.",
    "state": null,
    "summary": "OHB SE operates as a space and technology company in Germany, rest of Europe, and internationally. It produces and distributes products and projects, as well as provides technology services primarily in the areas of space and aeronautic technology, telematics, and satellite services. The company operates through two segments, Space Systems and Aerospace + Industrial Products. The Space Systems segment focuses on developing and executing space projects. This segment primarily develops and manufactures low-orbiting and geostationary small satellites for navigation, research, communications, and earth and weather observation and reconnaissance, including scientific payloads; undertakes projects for the assembly and outfitting of the International Space Station; and prepares studies and models for exploring solar system, such as the moon, asteroids, and Mars. The Aerospace + Industrial Products segment is involved in fabricating aerospace space products; and other industrial activities. This segment provides mechatronic systems for antennas and telescopes; various radio telescope projects; and transport management and shipping tracking facilities for logistics industry, as well as supplies aerospace structures for the aviation and space industry. The company is headquartered in Bremen, Germany.",
    "website": "http://www.ohb.de",
    "zipcode": "28359"
  },
  "OHB.F": {
    "city": "Bremen",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Aerospace & Defense",
    "long_name": "OHB SE",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "OHB SE  O.N.",
    "state": null,
    "summary": "OHB SE operates as a space and technology company in Germany, rest of Europe, and internationally. It produces and distributes products and projects, as well as provides technology services primarily in the areas of space and aeronautic technology, telematics, and satellite services. The company operates through two segments, Space Systems and Aerospace + Industrial Products. The Space Systems segment focuses on developing and executing space projects. This segment primarily develops and manufactures low-orbiting and geostationary small satellites for navigation, research, communications, and earth and weather observation and reconnaissance, including scientific payloads; undertakes projects for the assembly and outfitting of the International Space Station; and prepares studies and models for exploring solar system, such as the moon, asteroids, and Mars. The Aerospace + Industrial Products segment is involved in fabricating aerospace space products; and other industrial activities. This segment provides mechatronic systems for antennas and telescopes; various radio telescope projects; and transport management and shipping tracking facilities for logistics industry, as well as supplies aerospace structures for the aviation and space industry. The company is headquartered in Bremen, Germany.",
    "website": "http://www.ohb.de",
    "zipcode": "28359"
  }
}
