{
  "DE1.HM": {
    "city": "Hofheim",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "HAM",
    "industry": "Packaging & Containers",
    "long_name": "Deufol SE",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "DEUFOL SE NA O.N.",
    "state": null,
    "summary": "Deufol SE provides packaging and distribution solutions to businesses in Germany, the Rest of Europe, the United States, and internationally. It offers industrial packaging, such as crating, haulage, hazmat packaging, plant relocation, packaging hub, military packaging, and assisting services for power generation, oil and gas, automotive, and aviation packaging industries. The company also provides supply chain services, including inbound and outbound material logistics management, onsite kitting and fulfillment, integrated and customizable technology solutions, and others, as well as quality process development, control, and documentation services; and digital solutions, such as D-SCS, photo documentation, warehouse management system, load balancer, CPC tracker, and ERP support. Deufol SE was founded in 1979 and is based in Hofheim, Germany. Deufol SE is a subsidiary of Lion's Place GmbH.",
    "website": "http://www.deufol.com",
    "zipcode": "65719"
  },
  "OLG.F": {
    "city": "Bad Wurzach",
    "country": "Germany",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaging & Containers",
    "long_name": "Verallia Deutschland AG",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "VERALLIA DTLD AG  O.N.",
    "state": null,
    "summary": "Verallia Deutschland AG manufactures and sells glass bottles and jars for the beverages and food sectors in Germany and internationally. The company was formerly known as Saint-Gobain Oberland AG. The company was founded in 1946 and is headquartered in Bad Wurzach, Germany.",
    "website": "http://de.verallia.com",
    "zipcode": "88410"
  }
}
