{
    "N7G.DE": {
        "short_name": "NANOGATE SE I.A.INH. O.N.",
        "long_name": "Nanogate AG",
        "summary": "Nanogate AG provides integrated systems for high-performance surfaces and components in Germany and internationally. It offers systems equipping plastic, metal, and other surfaces with various functions and properties, such as scratchproof, chemical resistance, UV protection, easy cleaning, hygienic features, de-misting, anti-static, or various tribological properties. The company is also involved in the industrial implementation of various high-performance surfaces, primarily for metal surfaces; provision of do-it-yourself systems for the cleaning, care, and protection of textiles under the feldten and Empire brands; and technical and optical enhancement of plastic and metal surface geometries. In addition, it engages in coating transparent plastics for buildings/interiors, aviation, and automotive/mechanical engineering sectors; surfaces on two-dimensional components; processing plastics; and the production, enhancement, and molding of flat glazing components used in special-purpose forestry vehicles. Further, the company offers coatings for decorative multifunctional surfaces for automotive industry and building services, as well as appliance manufacturers; provides services for the manufacture and processing of smaller and medium-sized design-oriented plastic components, as well as plastic surfaces and components; and develops and produces plastic articles for medical technology. Additionally, it manufactures traditional applications, such as leisure, home appliance, interior, and medical sectors. Its products are also used in various applications, including electrical and automation technology, construction, communication, and security applications. The company produces and sells its systems and applications in metals under the N-Metals brand; and sells applications with plastics primarily under the N-Glaze brand. Nanogate AG has a strategic collaboration agreement with ERBIWA GmbH. Nanogate AG is headquartered in Quierschied, Germany.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Rubber & Plastics",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "Quierschied",
        "zipcode": "66287",
        "website": "http://www.nanogate.de",
        "market_cap": "Nano Cap"
    }
}