{
    "ATP30-R.BK": {
        "short_name": "ATP30 PUBLIC COMPANY LIMITED",
        "long_name": "ATP 30 Public Company Limited",
        "summary": "ATP 30 Public Company Limited provides transport services in Thailand. The company offers shuttle services to factory employees of industrial estate. As of December 31, 2020, it owned and operated 347 vehicles, including 211 buses, 38 mini-buses, 91 vans, and 7 VIP vans, as well as 66 affiliated vehicles comprising 61 vans and 5 buses. The company was formerly known as Amata Transport 30 Limited Company. ATP 30 Public Company Limited was founded in 2005 and is headquartered in Chonburi, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Chonburi"
    },
    "ATP30.BK": {
        "short_name": "ATP30 PUBLIC COMPANY LIMITED",
        "long_name": "ATP 30 Public Company Limited",
        "summary": "ATP 30 Public Company Limited provides transport services in Thailand. The company offers shuttle services to factory employees of industrial estate. As of December 31, 2020, it owned and operated 347 vehicles, including 211 buses, 38 mini-buses, 91 vans, and 7 VIP vans, as well as 66 affiliated vehicles comprising 61 vans and 5 buses. The company was formerly known as Amata Transport 30 Limited Company. ATP 30 Public Company Limited was founded in 2005 and is headquartered in Chonburi, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Chonburi"
    },
    "B4X.F": {
        "short_name": "BANGKOK EXPR.+METR. FGN",
        "long_name": "Bangkok Expressway and Metro Public Company Limited",
        "summary": "Bangkok Expressway and Metro Public Company Limited, together with its subsidiaries, engages in the construction and management of expressways and rail mass rapid transit system projects in Thailand. The company operates through Expressway Business, Rail Business, and Commercial Development Business segments. It is involved in the operation of metro services, including commercial development relating to the expressway and metro systems. The company also operates and manages the Si Rat Expressway, the Si Rat - Outer Ring Road Expressway, and the Udon Ratthaya Expressway, as well as the M.R.T. Chaloem Ratchamongkhon Line and MRT Chalong Ratchadham Line projects. In addition, it engages in the leasing of retail space, and provision of advertising services, as well as offers service and maintenance telecommunication systems equipment inside metro stations. The company was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BEM.BK": {
        "short_name": "BANGKOK EXPRESSWAY AND METRO",
        "long_name": "Bangkok Expressway and Metro Public Company Limited",
        "summary": "Bangkok Expressway and Metro Public Company Limited, together with its subsidiaries, engages in the construction and management of expressways and rail mass rapid transit system projects in Thailand. The company operates through Expressway Business, Rail Business, and Commercial Development Business segments. It is involved in the operation of metro services, including commercial development relating to the expressway and metro systems. The company also operates and manages the Si Rat Expressway, the Si Rat - Outer Ring Road Expressway, and the Udon Ratthaya Expressway, as well as the M.R.T. Chaloem Ratchamongkhon Line and MRT Chalong Ratchadham Line projects. In addition, it engages in the leasing of retail space, and provision of advertising services, as well as offers service and maintenance telecommunication systems equipment inside metro stations. The company was founded in 1998 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "BTS.BK": {
        "short_name": "BTS GROUP HOLDINGS PUBLIC COMPA",
        "long_name": "BTS Group Holdings Public Company Limited",
        "summary": "BTS Group Holdings Public Company Limited, together with its subsidiaries, engages in mass transit, property, media, and service businesses in Thailand, Hong Kong, and Malaysia. The company's Mass Transit segment operates and maintains BTS Sky Train system and bus rapid transit line, as well as offers electric and mechanical installation services. Its Media segment manages and provides advertising spaces on the BTS stations and existing extensions, department stores, and office and commercial buildings, as well as in the street furniture media sector; offers design and installation services for multimedia display systems; and provides outdoor advertising media services. The company's Property segment develops and sells real estate properties. Its Services segment provides installation and construction services; and Rabbit Card services. It also invests in the securities of other companies; provides architecture and engineering work consultancy services; and manages food and beverage businesses. In addition, the company rents advertising spaces; purchases/sells electronic billboards; provides electronic payment, electronic money, and bill payment services; and produces and sells tri-vision equipment. Further, it provides Web portal and design services, as well as various e-commerce-related services, including online marketing services; engages in the provision of online insurance price comparison services; develops software and provides technology and system integration services; and offers CRM loyalty program and coupon kiosks. The company was formerly known as Tanayong Public Company Limited and changed its name to BTS Group Holdings Public Company Limited in May 2010. BTS Group Holdings Public Company Limited was founded in 1968 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    }
}