{
    "AENF.DE": {
        "short_name": "AEGON NV EO 0,12 NY REG.1",
        "long_name": "Aegon N.V.",
        "summary": "Aegon N.V. provides a range of financial services in the Americas, Europe, and Asia. Its insurance products include life, accident, and health insurance; property and casualty insurance; and household and car insurance, as well as pension products. The company also offers savings products, such as retirement plan services; annuities; mutual funds; and stable value solutions. In addition, it provides retail and institutional investment management solutions, retirement savings vehicles, residential mortgages, and digital banking services. The company markets its products through brokers, agents, banks, employee benefit consultants, independent financial advisors, bancassurance channels, and advice centers. Aegon N.V. was founded in 1983 and is headquartered in The Hague, the Netherlands.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Property & Casualty Insurance",
        "exchange": "GER",
        "market": "de_market",
        "country": "Netherlands",
        "state": null,
        "city": "The Hague",
        "zipcode": "2591 TV",
        "website": "http://www.aegon.com",
        "market_cap": 8356700672
    },
    "INNA.DE": {
        "short_name": "ING GP NV SP.ADR/1 EO-,24",
        "long_name": "ING Groep N.V.",
        "summary": "ING Groep N.V., a financial institution, provides various banking products and services to individuals, small and medium-sized enterprises, and mid-corporates. It operates in Retail Netherlands, Retail Belgium, Retail Germany, Retail Other, and Wholesale Banking segments. The company accepts various deposits, such as current and savings accounts; and offers business lending products, as well as consumer lending products, such as residential mortgage loans, term loans, and revolver and personal loans. It also provides range products and services that covers payment, saving, insurance, investment, and secured and unsecured lending. In addition, the company offers specialized lending, corporate finance, and debt and equity markets solutions, as well as working capital, cash management, and trade and treasury services; and financial market, trade finance, and overdraft services. The company operates in the Netherlands, Belgium, North America, Latin America, Asia, Australia, and rest of Europe. ING Groep N.V. was founded in 1762 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Property & Casualty Insurance",
        "exchange": "GER",
        "market": "de_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1102 CT",
        "website": "http://www.ing.com",
        "market_cap": 39115886592
    }
}