{
    "CTPNV.AS": {
        "short_name": "CTP",
        "long_name": "CTP B.V.",
        "summary": "CTP B.V., a commercial real estate developer, engages in the development and ownership of multi-use industrial and logistics business parks and properties in the Central and Eastern Europe. It offers its properties primarily for warehousing, light production, or office spaces. As of March 17, 2021, the company owned and operated a network of 70 multi-use business parks with approximately 450 buildings; and owned three hotels in the Czech Republic. It primarily operates in the Czech Republic, Romania, Hungary, and Slovakia with presence in Serbia, Poland, Bulgaria, Germany, and Austria. The company was founded in 1998 and is headquartered in Utrecht, the Netherlands. CTP B.V. operates as a subsidiary of CTP Holding B.V.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "AMS",
        "market": "nl_market",
        "country": "Netherlands",
        "state": null,
        "city": "Utrecht",
        "zipcode": "3528 AG",
        "website": "http://www.ctp.eu",
        "market_cap": "Mid Cap"
    },
    "PLAZ.L": {
        "short_name": "PLAZA CENTERS N.V. ORD EUR1.00",
        "long_name": "Plaza Centers N.V.",
        "summary": "Plaza Centers N.V. does not have significant operations. Previously, it was involved in the establishment, operation, and sale of shopping and entertainment centers, as well as other mixed-use projects, such as retail, office, and residential projects in Central and Eastern Europe, and India. The company was formerly known as Plaza Centers (Europe) B.V. and changed its name to Plaza Centers N.V. in October 2006. Plaza Centers N.V. was incorporated in 1993 and is based in Amsterdam, the Netherlands.",
        "currency": "GBp",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Netherlands",
        "state": null,
        "city": "Amsterdam",
        "zipcode": "1105 BM",
        "website": "http://www.plazacenters.com",
        "market_cap": "Small Cap"
    }
}