{
  "ICLR": {
    "city": "Dublin",
    "country": "Ireland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Diagnostics & Research",
    "long_name": "ICON Public Limited Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ICON plc",
    "state": null,
    "summary": "ICON Public Limited Company, a clinical research organization, provides outsourced development and commercialization services in Ireland, rest of Europe, the United States, and internationally. The company specializes in the strategic development, management, and analysis of programs that support various stages of the clinical development process from compound selection to Phase I-IV clinical studies. It offers clinical development services, including product development planning, strategic consulting, study protocol preparation, clinical pharmacology, pharmacokinetic and pharmacodynamic analysis, site feasibility, patient recruitment and retention, digital patient and site, project management, clinical operations/monitoring, patient centric monitoring, data management, and adaptive and virtual trial services. The company's clinical development services also comprise medical imaging, biostatistics, medical affairs, pharmacovigilance, strategic regulatory, electronic endpoint adjudication, medical writing and publishing, interactive response technologies, functional solutions, strategic resourcing central laboratory, bioanalytical laboratory, biomarket development, strategy and analytics, late phase research, patient centered science, and medical device and diagnostics research services, as well as access, commercialization, and communication services, and research trials for us government agencies. It serves pharmaceutical, biotechnology, and medical device industries, as well as government and public health organizations. The company was incorporated in 1990 and is headquartered in Dublin, Ireland.",
    "website": "http://www.iconplc.com",
    "zipcode": "18"
  },
  "IJF.F": {
    "city": "Dublin",
    "country": "Ireland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Diagnostics & Research",
    "long_name": "ICON Public Limited Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "ICON PLC  EO-,06",
    "state": null,
    "summary": "ICON Public Limited Company, a clinical research organization, provides outsourced development and commercialization services in Ireland, rest of Europe, the United States, and internationally. The company specializes in the strategic development, management, and analysis of programs that support various stages of the clinical development process from compound selection to Phase I-IV clinical studies. It offers clinical development services, including product development planning, strategic consulting, study protocol preparation, clinical pharmacology, pharmacokinetic and pharmacodynamic analysis, site feasibility, patient recruitment and retention, digital patient and site, project management, clinical operations/monitoring, patient centric monitoring, data management, and adaptive and virtual trial services. The company's clinical development services also comprise medical imaging, biostatistics, medical affairs, pharmacovigilance, strategic regulatory, electronic endpoint adjudication, medical writing and publishing, interactive response technologies, functional solutions, strategic resourcing central laboratory, bioanalytical laboratory, biomarket development, strategy and analytics, late phase research, patient centered science, and medical device and diagnostics research services, as well as access, commercialization, and communication services, and research trials for us government agencies. It serves pharmaceutical, biotechnology, and medical device industries, as well as government and public health organizations. The company was incorporated in 1990 and is headquartered in Dublin, Ireland.",
    "website": "http://www.iconplc.com",
    "zipcode": "18"
  },
  "TRBA.F": {
    "city": "Bray",
    "country": "Ireland",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Diagnostics & Research",
    "long_name": "Trinity Biotech plc",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TRINITY BIOTEC.ADR NEW A",
    "state": null,
    "summary": "Trinity Biotech plc acquires, develops, manufactures, and markets medical diagnostic products for the clinical laboratory and point-of-care (POC) segments of the diagnostic market in the United States, Africa, Asia, and Europe. The company offers clinical laboratory products, including diagnostic tests and instrumentation, which detect infectious diseases, such as lyme disease; sexually transmitted diseases consisting syphilis and herpes; and epstein barr, measles, mumps, toxoplasmosis, cytomegalovirus, rubella, varicella and other viral pathogens, as well as products for the in-vitro diagnostic testing for haemoglobin A1c used in the monitoring and diagnosis of diabetes, and identifying those who are at a risk of developing diabetes. It also develops, manufactures, and distributes products in the immunofluorescence assay, enzyme-linked immunosorbent, western blot, and line immunoassay formats; and provides reagent products, such as ACE, bile acids, lactate, oxalate, and glucose-6-phosphate dehydrogenase for diagnosis of liver and kidney diseases, as well as haemolytic anaemia. In addition, the company sells raw materials to the life sciences industry and research institutes. The company sells its products through its direct sales force; and a network of independent distributors and strategic partners. Its customers include public health facilities, hospitals, and other outreach facilities, as well as clinical and reference laboratories. Trinity Biotech plc was founded in 1992 and is headquartered in Bray, Ireland.",
    "website": "http://www.trinitybiotech.com",
    "zipcode": null
  },
  "TRIB": {
    "city": "Bray",
    "country": "Ireland",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Diagnostics & Research",
    "long_name": "Trinity Biotech plc",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Trinity Biotech plc",
    "state": null,
    "summary": "Trinity Biotech plc acquires, develops, manufactures, and markets medical diagnostic products for the clinical laboratory and point-of-care (POC) segments of the diagnostic market in the United States, Africa, Asia, and Europe. The company offers clinical laboratory products, including diagnostic tests and instrumentation, which detect infectious diseases, such as lyme disease; sexually transmitted diseases consisting syphilis and herpes; SARS-CoV-2; and epstein barr, measles, mumps, toxoplasmosis, cytomegalovirus, rubella, varicella and other viral pathogens, as well as products for the in-vitro diagnostic testing for haemoglobin A1c used in the monitoring and diagnosis of diabetes, and identifying those who are at a risk of developing diabetes. It also develops, manufactures, and distributes products in the immunofluorescence assay, enzyme-linked immunosorbent, western blot, and line immunoassay formats; and provides reagent products, such as ACE, bile acids, lactate, oxalate, and glucose-6-phosphate dehydrogenase for diagnosis of liver and kidney diseases, as well as haemolytic anaemia. In addition, the company sells raw materials to the life sciences industry and research institutes. The company sells its products through its direct sales force; and a network of independent distributors and strategic partners. Its customers include public health facilities, hospitals, and other outreach facilities, as well as clinical and reference laboratories. Trinity Biotech plc was incorporated in 1992 and is headquartered in Bray, Ireland.",
    "website": "http://www.trinitybiotech.com",
    "zipcode": null
  }
}
