{
    "ENDPN.MX": {
        "short_name": "ENDO INTERNATIONAL PLC",
        "long_name": "Endo International plc",
        "summary": "Endo International plc, a specialty pharmaceutical company, manufactures and sells generic and branded pharmaceuticals in the United States and internationally. Its Branded Pharmaceuticals segment provides branded prescription products, including XIAFLEX to treat adult patients with Dupuytren's contracture; SUPPRELIN LA to treat central precocious puberty in children; NASCOBAL nasal spray to treat vitamin B12 deficiency; AVEED to treat hypogonadism; PERCOCET to treat moderate-to-moderately-severe pain; TESTOPEL an implantable pellet indicated for TRT in conditions associated with a deficiency or absence of endogenous testosterone; EDEX to treat erectile dysfunction; LIDODERM a topical patch product containing lidocaine for the relief of pain; and products for the pain management and urology. The company's Sterile Injectables segment manufactures VASOSTRICT, a vasopressin injection; ADRENALIN, a non-selective adrenergic agonist; and APLISOL, which is a sterile aqueous solution, as well as generic sterile injectable products, including ertapenem for injections and ephedrine sulfate injections. Its Generic Pharmaceuticals segment offers solid oral extended-release, solid oral immediate-release, liquids, semi-solids, patches, powders, ophthalmic products, and sprays. The company's International Pharmaceuticals segment offers specialty pharmaceutical products in various therapeutic areas comprising attention deficit hyperactivity disorder, pain, women's health, oncology, and transplantation. The company sells its branded pharmaceuticals and generics to specialty physicians, retailers, clinics, government agencies, doctors, retail and specialty pharmacies, and specialty distributors. Endo International plc was founded in 1920 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Drugs - Generic",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "city": "Dublin"
    }
}