{
    "979.F": {
        "short_name": "ZUTEC HOLDING AB",
        "long_name": "Zutec Holding AB (publ)",
        "summary": "Zutec Holding AB (publ), a cloud-based construction management software company, provides cloud-based software solutions for the construction, healthcare, infrastructure, and government sectors. The company provides Zutec Cloud, an integrated platform that offers asset register, digital operations and maintenance manuals, digital health and safety files, document management, workflow management, smart data and content search, submittals and transmittals, RFI management, and reports modules for data, handover, and team collaboration. It also provides Zutec Field, a mobile app, which offers snagging and defect management, site diaries, QA/QC inspections, construction activity progress tracking, 2D/3D drawings, safety inspections, and firewall penetrations modules to capture and manage site based data and photos. In addition, the company provides Zutec BIM that offers field BIM, 4D progress tracking, and 6D asset information tracking modules for the storage and management all of project 3D models; and Zutec Analytics, a real-time construction analytics functionality for informed decision making and project tracking that allows either to use standard reports or to create own customized reports based on the specific requirements of a construction project. It operates in Ireland, the United Kingdom, Australia, the Middle East, and Hong Kong. Zutec Holding AB (publ) was founded in 1999 and is headquartered in Dun Laoghaire, Ireland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "state": null,
        "city": "Dun Laoghaire",
        "zipcode": "A94 T927",
        "website": "http://www.zutec.com",
        "market_cap": "Nano Cap"
    },
    "DLE.IR": {
        "short_name": "DATALEX PLC",
        "long_name": "Datalex plc",
        "summary": "Datalex plc develops and sells various distribution and retailing software products and solutions to the airline industry worldwide. The company operates through two segments, E-Business and TPF Consulting. Its digital commerce platform allows to optimize the retailing of offers and to complete retail transactions from start to finish across various digital sales channels. The company also delivers professional and hosting services; and provides online payment processing connectivity services, as well as provides IT consultancy services to airlines. Datalex plc was founded in 1985 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "ISE",
        "market": "ie_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "3",
        "website": "http://www.datalex.com",
        "market_cap": "Micro Cap"
    },
    "FCL.AX": {
        "short_name": "FINEOS CDI 1:1",
        "long_name": "FINEOS Corporation Holdings plc",
        "summary": "FINEOS Corporation Holdings plc engages in the development and sale of enterprise claims and policy management software for the life, accident, and health insurance industry worldwide. The company offers FINEOS Platform, a module-based core system solution that is designed and delivered through the cloud as a Software-as-a-Service solution. The FINEOS Platform comprises FINEOS AdminSuite, a Comprehensive core insurance suite; FINEOS Engage, a digital tool that offers role based portals for employees, employers, intermediaries, and providers; and FINEOS Insight that offers real-time analytics and embed predictive insights in core business processes. It also offers professional and customer support services. FINEOS Corporation Holdings plc was founded in 1993 and is headquartered in Dublin, Ireland.",
        "currency": "AUD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "DO3 FT97",
        "website": "http://www.fineos.com",
        "market_cap": "Small Cap"
    },
    "VRE.L": {
        "short_name": "VR EDUCATION HOLDINGS PLC ORD E",
        "long_name": "VR Education Holdings Plc",
        "summary": "VR Education Holdings Plc, through its subsidiary Immersive VR Education Limited, operates as a virtual/augmented reality software company in education and simulated training sector worldwide. The company offers ENGAGE, an online virtual learning and corporate training platform that provides educators and corporate trainers the tools they need to create their own content in virtual classrooms or virtual training environments. Its products also include 1943: Berlin Blitz, a VR education based on Second World War; Titanic VR, a solution that allows users to explore the shipwreck of RMS Titanic; Apollo 11 HD, a documentary on the events of 1969; RCSI medical training simulator designed for medical professionals and trainees, where users experience and simulate a traumatic scenario following a road traffic accident and work through the critical decisions; Shuttle Commander that allows you to take part in the hubble space telescope missions; and Raid on the Ruhr game application. VR Education Holdings Plc was incorporated in 2017 and is based in Waterford, Ireland.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "state": null,
        "city": "Waterford",
        "zipcode": "X91 AX83",
        "website": "http://immersivevreducation.com",
        "market_cap": null
    },
    "ZUTEC.ST": {
        "short_name": "Zutec Holding AB",
        "long_name": "Zutec Holding AB (publ)",
        "summary": "Zutec Holding AB (publ), a cloud-based construction management software company, provides cloud-based software solutions for the construction, healthcare, infrastructure, and government sectors. The company provides Zutec Cloud, an integrated platform that offers asset register, digital operations and maintenance manuals, digital health and safety files, document management, workflow management, smart data and content search, submittals and transmittals, RFI management, and reports modules for data, handover, and team collaboration. It also provides Zutec Field, a mobile app, which offers snagging and defect management, site diaries, QA/QC inspections, construction activity progress tracking, 2D/3D drawings, safety inspections, and firewall penetrations modules to capture and manage site based data and photos. In addition, the company provides Zutec BIM that offers field BIM, 4D progress tracking, and 6D asset information tracking modules for the storage and management all of project 3D models; and Zutec Analytics, a real-time construction analytics functionality for informed decision making and project tracking that allows either to use standard reports or to create own customized reports based on the specific requirements of a construction project. It operates in Ireland, the United Kingdom, Australia, the Middle East, and Hong Kong. Zutec Holding AB (publ) was founded in 1999 and is headquartered in Dun Laoghaire, Ireland.",
        "currency": "SEK",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "STO",
        "market": "se_market",
        "country": "Ireland",
        "state": null,
        "city": "Dun Laoghaire",
        "zipcode": "A94 T927",
        "website": "http://www.zutec.com",
        "market_cap": "Nano Cap"
    }
}