{
    "NOS.LS": {
        "short_name": "NOS, SGPS",
        "long_name": "NOS, S.G.P.S., S.A.",
        "summary": "NOS, S.G.P.S., S.A. offers integrated telecommunications services worldwide. It operates through Telco and Audiovisuals segments. The company offers cable and satellite television; voice, data, and Internet access; consulting services for IT; electronic communications services, including data and multimedia communication services; IP voice services; and voice and SMS traffic transport services, as well as associated support signaling. In addition, it is involved in the video production and sale, advertising on Pay TV channels, cinema exhibition and distribution, production of channels for Pay TV, and management of data centers; cable and satellite television distribution, operation of mobile communication network and mobile virtual network; television and content production; production of films and series channels; management of advertising space on Pay TV channels and in the cinemas; and acquisition/negotiation of Pay TV and video-on-demand rights. Further, the company invests in and support the development of companies that aim to commercialize technologies and products; manages investments; commercializes public events; manages social participations in other companies; import, distribution, editing, commercialization, and production of audiovisual products; and offers accounting, logistics, administrative, financial, tax, and human resources services. Additionally, it engages in the design, implementation, operation, and exploitation of electronic communications networks, and equipment and infrastructure; achievement and promotion of scientific, and research and development activities; management of technologic assets, and rendering of related services; and provides demonstration, dissemination, technology transfer, and formation services in the field of services and information systems. The company was founded in 1999 and is headquartered in Lisbon, Portugal. NOS, SGPS, S.A. is a subsidiary of ZOPT, SGPS, S.A.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "LIS",
        "market": "pt_market",
        "country": "Portugal",
        "city": "Lisbon"
    },
    "PHR.LS": {
        "short_name": "PHAROL",
        "long_name": "Pharol, SGPS S.A.",
        "summary": "Pharol, SGPS S.A., through its investment and partnership with Oi, S.A., provides fixed-mobile convergent, mobile broadband, pay-TV, and triple play services to corporate customers in Brazil. The company was formerly known as Portugal Telecom, SGPS, SA and changed its name to Pharol, SGPS S.A. in May 2015. Pharol, SGPS S.A. was founded in 1994 and is headquartered in Lisbon, Portugal.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "LIS",
        "market": "pt_market",
        "country": "Portugal",
        "city": "Lisbon"
    },
    "PHRZF": {
        "short_name": "PHAROL SGPS SA",
        "long_name": "Pharol, SGPS S.A.",
        "summary": "Pharol, SGPS S.A., through its investment and partnership with Oi, S.A., provides fixed-mobile convergent, mobile broadband, pay-TV, and triple play services to corporate customers in Brazil. The company was formerly known as Portugal Telecom, SGPS, SA and changed its name to Pharol, SGPS S.A. in May 2015. Pharol, SGPS S.A. was founded in 1994 and is headquartered in Lisbon, Portugal.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Portugal",
        "city": "Lisbon"
    },
    "PTCA.F": {
        "short_name": "PHAROL SGPS SA  EO 0,03",
        "long_name": "Pharol, SGPS S.A.",
        "summary": "Pharol, SGPS S.A., through its investment and partnership with Oi, S.A., provides fixed-mobile convergent, mobile broadband, pay-TV, and triple play services to corporate customers in Brazil. The company was formerly known as Portugal Telecom, SGPS, SA and changed its name to Pharol, SGPS S.A. in May 2015. Pharol, SGPS S.A. was founded in 1994 and is headquartered in Lisbon, Portugal.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Portugal",
        "city": "Lisbon"
    }
}