{
    "1438.TW": {
        "short_name": "SANDI PROPERTIES CO LTD",
        "long_name": "SanDi Properties Co.,Ltd.",
        "summary": "SanDi Properties Co.,Ltd. engages in the construction of commercial and industrial buildings. It also engages in residential rental and sale, real estate trading, and distribution of other department stores businesses. The company was formerly known as Yu Foong International Corporation. SanDi Properties Co.,Ltd. was founded in 1949 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "802",
        "website": "http://www.sandirealestate.com.tw",
        "market_cap": 797530304
    },
    "1442.TW": {
        "short_name": "ADVANCETEK ENTERPRICE",
        "long_name": "Advancetek Enterprise Co.,Ltd.",
        "summary": "Advancetek Enterprise Co.,Ltd. engages in the construction and development of villas, residential buildings, and other projects in Taiwan. The company was founded in 1974 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.advancetek.com.tw",
        "market_cap": 6317156864
    },
    "2348.TW": {
        "short_name": "HIYES INTERNATIONAL CO LTD",
        "long_name": "Hiyes International Co., Ltd.",
        "summary": "Hiyes International Co., Ltd. engages in the real estate agency and brokerage businesses in Taiwan. Its real estate agency and brokerage business include pre-sale housing, new housing, remaining housing, general office, and land and parking space, as well as product planning and advice, integrated marketing, and transaction intermediary transfer services. The company also offers engineering construction; architectural design and interior decoration; building materials; hydropower configuration; financial communication; and valuation and book services. The company was formerly known as Veutron Corp and changed its name to Hiyes International Co., Ltd. in April 2013. Hiyes International Co., Ltd. is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.hiyes-group.com.tw",
        "market_cap": 9146088448
    },
    "2509.TW": {
        "short_name": "CHAINQUI CONSTRUCTION DEVELOPME",
        "long_name": "Chainqui Construction Development Co.,Ltd",
        "summary": "Chainqui Construction Development Co.,Ltd engages in the construction business in Taiwan. The company constructs commercial buildings and construction firms; and offers cement. It is also involved in the public housing rental and sales business. The company was formerly known as Chain Qui Development Co. Ltd. Chainqui Construction Development Co.,Ltd was founded in 1972 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "329",
        "website": "http://www.gtg.com.tw",
        "market_cap": 4322607104
    },
    "2511.TW": {
        "short_name": "PRINCE HOUSING DEVELOPMENT CORP",
        "long_name": "Prince Housing & Development Corp.",
        "summary": "Prince Housing & Development Corp. engages in the construction business primarily in Taiwan. The company constructs, leases, and sells public housings, commercial buildings, and parking lots/parking towers, as well as tourism/recreation places, such as children's playgrounds, water parks, etc. It is also involved in the hotels and catering, plywood manufacturing, real estate management, real estate trading and leasing, apartment management, security, electricity and water pipe maintenance, and general investment activities, as well as offers integrate security and guard services. The company was founded in 1973 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.prince.com.tw",
        "market_cap": 19228639232
    },
    "2520.TW": {
        "short_name": "KINDOM DEVELOPMENT CO LTD",
        "long_name": "Kindom Development Co., Ltd.",
        "summary": "Kindom Development Co., Ltd. engages in the real estate development business. The company develops residential properties; leases and sells commercial buildings; undertakes construction projects, such as corporate headquarters, civil workshops, medical buildings and residential buildings, as well as civil projects, including land preparation and rezoning, roads and bridges; and operates department stores and supermarkets. It also engages in the installation and engineering of electrical and fire safety equipment; and investment and operation of shopping malls, as well as non-store retailing business. In addition, the company offers business management and consulting; corporate marketing planning; conference; exhibition; parking lot operation and management services. Further, it is involved in the general investment activities. Kindom Development Co., Ltd. was founded in 1979 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.kindom.com.tw",
        "market_cap": 18518382592
    },
    "2527.TW": {
        "short_name": "HUNG CHING DEVELOPMENT & CONSTR",
        "long_name": "Hung Ching Development & Construction Co. Ltd.",
        "summary": "Hung Ching Development & Construction Co. Ltd. constructs residential and commercial buildings for rent and sale in Taiwan. It provides residential buildings, villas, apartments, shops, factories, and offices, as well as parking space. Hung Ching Development & Construction Co. Ltd. is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://mis281.wixsite.com/asehcc",
        "market_cap": 5941906944
    },
    "2528.TW": {
        "short_name": "CROWELL DEVELOPMENT CORP",
        "long_name": "Crowell Development Corp.",
        "summary": "Crowell Development Corp. engages in the construction of commercial and residential buildings for rental and sale in Taiwan. It also constructs parking lots and villas; operates children's playgrounds, amusement parks, integrated sports stadiums, supermarkets, storage operations, restaurants, cafes, and hotels; develops industrial zones; purchases and sells building materials; and manufactures electronic components, and data storage and processing equipment. In addition, the company is involved in the land re-allocating, advertising art design, and department store trading businesses. Further, it operates in crop and flower cultivation, and strain industries. Crowell Development Corp. was founded in 1974 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://crowell.com.tw",
        "market_cap": 7259933696
    },
    "2530.TW": {
        "short_name": "DELPHA CONSTRUCTION CORP",
        "long_name": "Delpha Construction Co.,Ltd.",
        "summary": "Delpha Construction Co., Ltd., together with its subsidiaries, constructs commercial buildings. It is also involved in the sale and lease of public housing; development of land; upholstery industry; and real estate agency, rental, and investment activities. The company was founded in 1960 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11490",
        "website": "http://www.delpha.com.tw",
        "market_cap": 7082241024
    },
    "2539.TW": {
        "short_name": "SAKURA DEVELOPMENT CO",
        "long_name": "Sakura Development Co.,Ltd",
        "summary": "Sakura Development Co.,Ltd engages in the sale and lease of residential properties with focus on the Zhongzhangtou area in Taiwan. The company was founded in 1976 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.sakurad.com.tw",
        "market_cap": 17648062464
    },
    "2542.TW": {
        "short_name": "HIGHWEALTH CONSTRUCTION CORP",
        "long_name": "Highwealth Construction Corp.",
        "summary": "Highwealth Construction Corp. engages in the construction of commercial buildings in Taiwan. The company operates through four segments: Developing, Constructing, Department Store, and Ecotechnology. The Developing segment develops new constructing or lease opportunities. The Constructing segment is involved in constructing buildings. The Department Store segment manages various shops within the store, supermarkets, and international import and export trade. The Ecotechnology segment provides services for clearing waste. Its apartment buildings include apartments, suites, and parking spaces; and office buildings comprise offices, storefronts, parking lots, and suites. The company is also involved in the construction, lease, and sale of residential and commercial buildings. In addition, it provides real estate broker agent and real estate commerce services; construction material wholesale services; and investment services. The company was founded in 1980 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10462",
        "website": "http://www.highwealth.com.tw",
        "market_cap": 54578417664
    },
    "2545.TW": {
        "short_name": "HUANG HSIANG CONSTRUCTION",
        "long_name": "Huang Hsiang Construction Corporation",
        "summary": "Huang Hsiang Construction Corporation builds, sells, and rents public housing and commercial building in Taiwan. The company's product portfolio includes home, shops, offices, shopping malls, and parking spaces. It also imports/exports and sells building materials. The company was formerly known as Huang Ming Construction Corporation, LCC and changed its name to Huang Hsiang Construction Corporation in April 1996. Huang Hsiang Construction Corporation was founded in 1991 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.hhe.com.tw",
        "market_cap": 13633775616
    },
    "2547.TW": {
        "short_name": "RADIUM LIFE TECH CO",
        "long_name": "Radium Life Technology Co., Ltd.",
        "summary": "Radium Life Technology Co., Ltd. develops real estate projects in Taiwan. It develops and operates T9 BOT project, which consists of a bus terminal, four residential buildings, two office towers, a shopping center, a hotel, and a movie theatre; MEHAS project covering an area of 22,000 square meters; BOND 18 project; and E.A.T project. The company also engages in retail, luxury hotel, bus terminal management, property management, biotech and skin care, sewage treatment, renewable energy, property leasing, and elderly care businesses. Radium Life Technology Co., Ltd. was founded in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "103",
        "website": "http://www.radium.com.tw",
        "market_cap": 10846144512
    },
    "2548.TW": {
        "short_name": "HUAKU DEVELOPMENT CO. LTD.",
        "long_name": "Huaku Development Co., Ltd.",
        "summary": "Huaku Development Co., Ltd. constructs, leases, and sells public housings and commercial buildings in Taiwan and China. The company also engages in the leasing and sale of general-purpose plants and warehouses; and contracting of civil and hydraulic engineering projects. The company was formerly known as Huaku Construction Co., Ltd. Huaku Development Co., Ltd. was founded in 1989 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.huaku.com.tw",
        "market_cap": 25782755328
    },
    "2596.TWO": {
        "short_name": "REALY DEVELOPMENT & CONSTRUCTIO",
        "long_name": "ReaLy Development & Construction Corp.",
        "summary": "ReaLy Development & Construction Corp. engages in the land development and administration, and construction management businesses in Taiwan. The company is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.realycorp.com.tw",
        "market_cap": 2180000000
    },
    "2701.TW": {
        "short_name": "WAN HWA ENTERPRISE",
        "long_name": "Wanhwa Enterprise Company",
        "summary": "Wanhwa Enterprise Company engages in the rental of commercial buildings, and operation of cinemas and mobile amusement parks in Taiwan. The company provides leasing services for business hotels, offices, supermarkets, restaurants, shopping malls, department stores, and bookstores. It also offers roof playground, including the playgrounds, sports, and educational and other areas; and operates digital cinemas. The company was founded in 1958 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.wanhwa.com.tw",
        "market_cap": 5467110912
    },
    "3056.TW": {
        "short_name": "ZONGTAI REAL ESTATE DEVELOPMENT",
        "long_name": "ZongTai Real Estate Development Co., Ltd.",
        "summary": "ZongTai Real Estate Development Co., Ltd. engages in the real estate development business in Taiwan. It is involved in the development of building, leisure, energy, government, and other projects. The company is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": null,
        "website": "http://www.zongtai.com.tw",
        "market_cap": 8141303296
    },
    "3266.TW": {
        "short_name": "SUNTY DEVELOPMENT CO LTD",
        "long_name": "Sunty Development Co., LTD",
        "summary": "Sunty Development Co., LTD builds, rents, and sells residential and commercial building projects in Greater Taipei, Taiwan. It undertakes residential unit, office space, and parking facility projects. The company was founded in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.sunty.com.tw",
        "market_cap": 4368693248
    },
    "3512.TWO": {
        "short_name": "HUANG LONG DEVELOPMENT CO LTD",
        "long_name": "Huang Long Development Co.,Ltd.",
        "summary": "Huang Long Development Co.,Ltd. manufactures electronic components in Taiwan. It is also involved in the development, leasing, and sale of residential buildings; and real estate trading business. The company was formerly known as Neng Tyi Precision Industries Co., Ltd. and changed its name to Huang Long Development Co.,Ltd. in June 2018. Huang Long Development Co.,Ltd. was founded in 1981 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.hldc.com.tw",
        "market_cap": 2734199808
    },
    "4416.TWO": {
        "short_name": "SHANYUAN CO. LTD.",
        "long_name": "Shanyuan Co., Ltd.",
        "summary": "Shanyuan Co., Ltd. engages in the construction of residential buildings in Taiwan. It also engages in the rental of office buildings and storefronts, and other properties. The company was formerly known as Fu Chan Industrial Co., Ltd. and changed its name to Shanyuan Co., Ltd. in January 2008. The company was founded in 1979 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.shanyuan.com.tw",
        "market_cap": 5775155200
    },
    "5206.TWO": {
        "short_name": "KUNYUE DEVELOPMENT CO. LTD.",
        "long_name": "Kunyue Development Co., Ltd.",
        "summary": "Kunyue Development Co., Ltd. provides real estate development and maintenance services. The company is involved in the land development, building construction, residential development, home sales, and customer service activities. It also offers structural, hydropower, waterproof, and intimate engineering services. The company was founded in 1975 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.kunyue.com.tw",
        "market_cap": 2744279808
    },
    "5213.TWO": {
        "short_name": "YEASHIN INTERNATIONAL DEVELOPME",
        "long_name": "YeaShin International Development Co., Ltd.",
        "summary": "YeaShin International Development Co., Ltd. engages in the business of residential and building development in Taiwan. The company was founded in 1995 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.yeashin.com.tw",
        "market_cap": 7789387776
    },
    "5508.TWO": {
        "short_name": "YUNSHIN CONSTRUCTION & DEVELOPM",
        "long_name": "Yungshin Construction & Development Co.,Ltd.",
        "summary": "Yungshin Construction & Development Co., Ltd. engages in the construction and sale of residential and commercial buildings in Taiwan. It is also involved in the sale of building materials; and rental business. In addition, the company offers interior design services. Yungshin Construction & Development Co., Ltd. is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.ys-construction.com.tw",
        "market_cap": 10545258496
    },
    "5514.TWO": {
        "short_name": "SUN FON CONSTRUCTION CO",
        "long_name": "Sunfon Construction Co., Ltd.",
        "summary": "Sunfon Construction Co., Ltd. engages in the construction of national residences. It also leases and sells commercial buildings. The company was founded in 1977 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.sunfon.com.tw",
        "market_cap": 4121826816
    },
    "5522.TW": {
        "short_name": "FARGLORY LAND DEVELOPMENT CO. L",
        "long_name": "Farglory Land Development Co., Ltd.",
        "summary": "Farglory Land Development Co., Ltd. operates as a construction company in Taiwan. The company builds residential buildings and commercial buildings for sale and investment; undertakes public construction projects; and develops professional areas. The company was formerly known as Metropolitan Construction Co., Ltd. and changed its name to Farglory Land Development Co., Ltd. in December 2005. Farglory Land Development Co., Ltd. was founded in 1969 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.farglory-land.com.tw",
        "market_cap": 45098090496
    },
    "5523.TWO": {
        "short_name": "FONG CHIEN CONSTRUCTION CO LTD",
        "long_name": "Fong-Chien Construction Co.,LTD.",
        "summary": "Fong-Chien Construction Co.,LTD. engages in construction business. The company was formerly known as Hongdu Construction Co., Ltd. Fong-Chien Construction Co.,LTD. was founded in 1973 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.fong-chien.com.tw",
        "market_cap": 4518278656
    },
    "5525.TW": {
        "short_name": "SWEETEN REAL ESTATE DEVELOPMENT",
        "long_name": "Sweeten Real Estate Development Co.,Ltd.",
        "summary": "Sweeten Real Estate Development Co.,Ltd. constructs and develops residential, commercial, and industrial projects. It is also involved in urban renewal development and land development activities. The company was founded in 1987 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.sweeten.com.tw",
        "market_cap": 6300367360
    },
    "5531.TW": {
        "short_name": "SHINING BUILDING BUSINESS CO LT",
        "long_name": "Shining Building Business Co.,Ltd.",
        "summary": "Shining Building Business Co., Ltd. engages in the subcontract construction, leasing, and sale of commercial buildings and residential buildings in Taiwan. It also offers hotel management services. The company was founded in 1980 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.shininggroup.com.tw",
        "market_cap": 14126160896
    },
    "5533.TW": {
        "short_name": "FOUNDING CONSTRUCTION DEVELOPME",
        "long_name": "Founding Construction & Development Co., Ltd.",
        "summary": "Founding Construction & Development Co., Ltd. engages in the construction of housings and factory buildings in Taiwan. The company was founded in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.founding.com.tw",
        "market_cap": 4421297152
    },
    "6171.TWO": {
        "short_name": "TAIWAN ARIES CO LTD",
        "long_name": "Taiwan Aries Co.,Ltd.",
        "summary": "Taiwan Aries Co.,Ltd. manufactures, processes, and trades in various electronic parts in Taiwan. It is also involved in residential and building development, rental, and sales; building materials wholesale and retail, landscape and interior design, import and export trading, real estate trading and leasing, and other businesses. The company was founded in 1984 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.aries-net.com.tw",
        "market_cap": 2000595584
    },
    "6186.TWO": {
        "short_name": "SHIN RUENN DEVELOPMENT CO LTD",
        "long_name": "Shin Ruenn development Co., LTD",
        "summary": "Shin Ruenn development Co., LTD. engages in the development and rental of housing and buildings. It is also involved in the sale, leasing, and purchase of real estate properties. The company was formerly known as Jinglay, Inc. and changed its name to Shin Ruenn development Co., LTD. in July 2011. Shin Ruenn development Co., LTD. was founded in 1998 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.shinruenn.com",
        "market_cap": 3744979200
    },
    "6264.TWO": {
        "short_name": "KINGLAND REAL ESTATE CO LTD",
        "long_name": "Kingland Property Corporation Ltd.",
        "summary": "Kingland Property Corporation Ltd. engages in the construction business. The company was formerly known as DSG Technology Co., Ltd. The company was founded in 1997 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110050",
        "website": "http://www.kingland.com.tw",
        "market_cap": 1101881856
    },
    "9902.TW": {
        "short_name": "TIDEHOLD DEVELOPMENT CO",
        "long_name": "Tidehold Development Co., Ltd.",
        "summary": "Tidehold Development Co., Ltd. engages in the international trade business in Taiwan. It sells oil, gas, garbage, and resource recycling trucks; rents small passenger cars; and develops and sells residential and other buildings. The company was formerly known as Tidehold Co., Ltd. and changed its name to Tidehold Development Co., Ltd. in 1998. Tidehold Development Co., Ltd. was founded in 1949 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tidehold.com",
        "market_cap": 1337895168
    },
    "9940.TW": {
        "short_name": "SINYI REALTY INC.",
        "long_name": "Sinyi Realty Inc.",
        "summary": "Sinyi Realty Inc., together with its subsidiaries, engages in the real-estate brokerage and development businesses in Taiwan, Mainland China, and internationally. The company develops, constructs, rents, and sells residential buildings and factories. It is also involved in the real estate management and identification, and real estate marketing planning activities; market information consultation; provision of management consulting, information software, data processing, and electronic information services; and publication business. In addition, the company offers professional construction, building decoration construction, interior decoration, hardware, and general merchandise products and services; and construction materials, furniture, sanitary ware, and ceramic products, as well as engages in the wholesale of building materials. Further, it develops commercial buildings and auxiliary facilities. The company was founded in 1987 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.sinyi.com.tw",
        "market_cap": 23136995328
    }
}