{"2539.TW": {"short_name": "SAKURA DEVELOPMENT CO", "long_name": "Sakura Development Co.,Ltd", "summary": "Sakura Development Co.,Ltd engages in the sale and lease of residential properties with focus on the Zhongzhangtou area in Taiwan. The company was founded in 1976 and is based in Taichung City, Taiwan.", "currency": "TWD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2542.TW": {"short_name": "HIGHWEALTH CONSTRUCTION CORP", "long_name": "Highwealth Construction Corp.", "summary": "Highwealth Construction Corp. engages in the construction of commercial buildings in Taiwan. The company operates through four segments: Developing, Constructing, Department Store, and Ecotechnology. The Developing segment develops new constructing or lease opportunities. The Constructing segment is involved in constructing buildings. The Department Store segment manages various shops within the store, supermarkets, and international import and export trade. The Ecotechnology segment provides services for clearing waste. Its apartment buildings include apartments, suites, and parking spaces; and office buildings comprise offices, storefronts, parking lots, and suites. The company is also involved in the construction, lease, and sale of residential and commercial buildings. In addition, it provides real estate broker agent and real estate commerce services; construction material wholesale services; and investment services. The company was founded in 1980 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2548.TW": {"short_name": "HUAKU DEVELOPMENT CO. LTD.", "long_name": "Huaku Development Co., Ltd.", "summary": "Huaku Development Co., Ltd. constructs, leases, and sells public housings and commercial buildings in Taiwan and China. The company also engages in the leasing and sale of general-purpose plants and warehouses; and contracting of civil and hydraulic engineering projects. The company was formerly known as Huaku Construction Co., Ltd. Huaku Development Co., Ltd. was founded in 1989 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "5522.TW": {"short_name": "FARGLORY LAND DEVELOPMENT CO. L", "long_name": "Farglory Land Development Co., Ltd.", "summary": "Farglory Land Development Co., Ltd. operates as a construction company in Taiwan. The company builds residential buildings and commercial buildings for sale and investment; undertakes public construction projects; and develops professional areas. The company was formerly known as Metropolitan Construction Co., Ltd. and changed its name to Farglory Land Development Co., Ltd. in December 2005. Farglory Land Development Co., Ltd. was founded in 1969 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}}