{
    "0JJ0.F": {
        "short_name": "BLACKHAWK GROWTH CORP.",
        "long_name": "Blackhawk Growth Corp.",
        "summary": "Blackhawk Growth Corp. is a publicly owned investment manager. It invests in public equity and fixed income markets across North America. It focuses on investing in cannabis and CBD industries, in both Canada and the United States. The company was formerly known as Blackhawk Resource Corp. Blackhawk Growth Corp. was incorporated in 1986 and is based in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1A1",
        "website": "http://www.blackhawkcorp.ca",
        "market_cap": "Small Cap"
    },
    "0MLA.MU": {
        "short_name": "TORRENT CAPITAL LTD.",
        "long_name": "Torrent Capital Ltd.",
        "summary": "Torrent Capital Ltd. focuses on investments in private and public company securities. It also provides merchant banking services to small scale companies, as well as advisory services for corporate finance and capital markets. The company was formerly known as Metallum Resources Inc. and changed its name to Torrent Capital Ltd. in February 2017. Torrent Capital Ltd. is based in Halifax, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Canada",
        "state": "NS",
        "city": "Halifax",
        "zipcode": "B3J 3R7",
        "website": "http://torrentcapital.ca",
        "market_cap": "Small Cap"
    },
    "0Q4.F": {
        "short_name": "QUINSAM CAPITAL CORP.",
        "long_name": "Quinsam Capital Corporation",
        "summary": "Quinsam Capital Corporation operates as an investment and merchant banking firm in small-cap market in Canada. It primarily focuses on cannabis-related investments. The company's activities include acquisitions, advisory services, lending activities, and portfolio investments. Quinsam Capital Corporation was incorporated in 2004 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1H1",
        "website": "http://www.quinsamcapital.com",
        "market_cap": "Small Cap"
    },
    "0SC.SG": {
        "short_name": "SENVEST CAPITAL INC. Registered",
        "long_name": "Senvest Capital Inc.",
        "summary": "Senvest Capital Inc., through its subsidiaries, holds investments in equity and real estate holdings primarily in the United States. It invests in derivative financial instruments consisting primarily of options and warrants to purchase or sell equities, equity indices and currencies, equity swaps, foreign currency forward contracts, and foreign currency futures contracts. The company also has investments as minority interests in private entities whose main assets are real estate properties; and real estate income trusts and partnerships. It also operates in Canada, European Union, Argentina, and internationally. The company was formerly known as Sensormatic Canada Limited and changed its name to Senvest Capital Inc. in April 1991. Senvest Capital Inc. was incorporated in 1968 and is headquartered in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3G4",
        "website": "http://www.senvest.com",
        "market_cap": "Small Cap"
    },
    "31T.F": {
        "short_name": "GOBIMIN INC.",
        "long_name": "GobiMin Inc.",
        "summary": "GobiMin Inc., together with its subsidiaries, invests in equity, debt, or other securities in China. The company operates through two segments, Investment Business and Mining Business. It is also involved in the development and exploration of gold and mineral properties; and property holding and leasing activities, as well as in the provision of business and consultancy services. The company is based in Montreal, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3G4",
        "website": "http://www.gobimin.com",
        "market_cap": "Small Cap"
    },
    "4NC.F": {
        "short_name": "MEDIVOLVE INC.",
        "long_name": "Medivolve Inc.",
        "summary": "Medivolve Inc. is a principal investment firm. It is a social-impact investment focused company Investing resources, funds and bandwidth for the betterment of the human condition through medical sciences, climate change and technology. The firm was formerly known as Continent Resources Inc. and changed its name to Copper One Inc. in October 2009. Copper One Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2M5",
        "website": "http://www.questcapinc.com",
        "market_cap": "Small Cap"
    },
    "6BC.F": {
        "short_name": "ROCKSHIELD CAPITAL CORP.",
        "long_name": "Rockshield Capital Corp.",
        "summary": "Rockshield Capital Corp. is a venture capital firm specializing in early-stage, seed and emerging growth investments. The firm seeks to invest at various stages of development, including pre-initial public offering, and/or early stage companies requiring start-up or development capital. The firm seeks to invest in marketable securities comprising common shares and other equity instruments of companies in the mining, oil and gas, media technology, and medical technology industries that are listed on various Canadian stock exchanges or the OTCBB in the United States. It considers to invest over a number of sectors, including but not limited to: cannabis, fintech, healthcare, the resource sector, information and communications technology, and energy & clean technology. The firm seeks to invest between $0.25 million to $2 million. The firm is also involved in assisting financing, identifying acquisition targets, developing strategic plans, supporting operations, and implementing exit strategies. The firm also works with co-investors. It typically invests in Canada and the United States. Rockshield Capital Corp. was founded in 2007 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3V7",
        "website": "http://www.rockshield.ca",
        "market_cap": "Small Cap"
    },
    "A1DC.F": {
        "short_name": "BRAND X LIFESTYLE CORP.",
        "long_name": "Brand X Lifestyle Corp.",
        "summary": "Brand X Lifestyle Corp. does not have significant operations. The company intends to evaluate and invests in early-stage to mid-level emerging growth companies. Previously, it was involved in acquiring and investing in companies that operate in the blockchain technology industry. The company was formerly known as Block X Capital Corp. and changed its name to Brand X Lifestyle Corp. in March 2020. Brand X Lifestyle Corp. was incorporated in 1980 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.block-x.co",
        "market_cap": "Small Cap"
    },
    "A3J.F": {
        "short_name": "AGF MGMT B PFD NV",
        "long_name": "AGF Management Limited",
        "summary": "AGF Management Limited is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to public and corporate DB pension plans, endowments and foundations, sovereign wealth funds, corporate plans, insurance companies, and sub-advised mandates. Through its subsidiaries, it manages separate client-focused equity, fixed income, and balanced mutual funds along with separate client-focused equity, fixed income, and balanced portfolios. Through its subsidiaries, the firm invests in the public equity and fixed income markets across the globe. For its equity portion, it invests in growth stocks of companies. The firm employs fundamental analysis to make its investments. AGF Management Limited was founded in 1957 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1E9",
        "website": "http://www.agf.com",
        "market_cap": "Small Cap"
    },
    "A781.F": {
        "short_name": "SPROTT INC.",
        "long_name": "Sprott Inc.",
        "summary": "Sprott Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides asset management, portfolio management, wealth management, fund management, and administrative and consulting services to its clients. It offers mutual funds, hedge funds, and offshore funds, along with managed accounts. Further, the firm also provides broker-dealer activities. Sprott Inc. was formed on February 13, 2008 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2J1",
        "website": "http://www.sprott.com",
        "market_cap": "Small Cap"
    },
    "A8H.F": {
        "short_name": "ABERDEEN INTL INC.",
        "long_name": "Aberdeen International Inc.",
        "summary": "Aberdeen International Inc., together with its subsidiaries, operates as a resource investment company and a merchant bank focusing on small capitalization companies in the metals and mining sector. It intends to acquire equity participation in pre-IPO and early stage public resource companies with undeveloped or undervalued resources. The company was formerly known as International Catalyst Ventures Inc. and changed its name to Aberdeen International Inc. in November 2001. Aberdeen International Inc. was incorporated in 1987 and is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2M5",
        "website": "http://www.aberdeeninternational.ca",
        "market_cap": "Small Cap"
    },
    "AAB.TO": {
        "short_name": "ABERDEEN INTERNATIONAL INC.",
        "long_name": "Aberdeen International Inc.",
        "summary": "Aberdeen International Inc., together with its subsidiaries, operates as a resource investment company and a merchant bank focusing on small capitalization companies in the metals and mining sector. It intends to acquire equity participation in pre-IPO and early stage public resource companies with undeveloped or undervalued resources. The company was formerly known as International Catalyst Ventures Inc. and changed its name to Aberdeen International Inc. in November 2001. Aberdeen International Inc. was incorporated in 1987 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2M5",
        "website": "http://www.aberdeeninternational.ca",
        "market_cap": "Small Cap"
    },
    "AABVF": {
        "short_name": "ABERDEEN INTERNATIONAL INC",
        "long_name": "Aberdeen International Inc.",
        "summary": "Aberdeen International Inc., together with its subsidiaries, operates as a resource investment company and a merchant bank focusing on small capitalization companies in the metals and mining sector. It intends to acquire equity participation in pre-IPO and early stage public resource companies with undeveloped or undervalued resources. The company was formerly known as International Catalyst Ventures Inc. and changed its name to Aberdeen International Inc. in November 2001. Aberdeen International Inc. was incorporated in 1987 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2M5",
        "website": "http://www.aberdeeninternational.ca",
        "market_cap": "Small Cap"
    },
    "AD-UN.TO": {
        "short_name": "ALARIS EQUITY PARTNERS INCOME T",
        "long_name": "Alaris Equity Partners Income Trust",
        "summary": "Alaris Equity Partners Income Trust is a private equity firm specializing in management buyouts, growth capital, lower & middle market, later stage, industry consolidation, growth capital, and mature investments. The firm does not invest in turnarounds and start-ups. It prefers to invest in the companies based in all industries except for those with a declining asset base, such as oil and gas resource companies, or any industry that carry the risk of obsolescence such as high tech and focuses on business services, professional services, information services, healthcare services, distribution & logistics, industrials, consumer products. The firm seeks to invest in companies raising capital for a partial liquidity, generational transfer, recapitalization, and growth and who do not want to give up control or chance the added risk that comes with high leverage levels. It prefers to invest in companies that are mostly individual or family controlled. The firm typically provides alternative financing for a diversified group of private businesses (\"Private Company Partners\") in exchange for royalties or distributions from the Private Company Partners, with the principal objective of generating stable and predictable cash flows for dividend payments to its shareholders. It seeks to invest in the companies based in Europe, North America with the focus on Canada, and United States. It typically invests between $5 million and $100 million in companies with an enterprise values between $10 million and $400 million and EBITDA between $5 million and $50 million, historical EBITDA in excess of $10 million, and Low levels of debt and capital expenditure. The firm also makes small cap investments upto $20 million in private companies that have historical EBITDA in excess of $2 million. However, for larger companies, transactions can be structured to include additional investments. The firm seeks to invest in industries that do not experience large cyclical swings. It does not own any shares and does not require board representation. The firm invests through balance sheet and seeks equity dividend distribution from portfolios. It prefers to make non control equity, minority and majority investments in its portfolio companies. Alaris Royalty Corp. was founded in 2008 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2S 3E6",
        "website": "http://www.alarisroyalty.com",
        "market_cap": "Small Cap"
    },
    "AGFMF": {
        "short_name": "AGF MANAGEMENT LTD",
        "long_name": "AGF Management Limited",
        "summary": "AGF Management Limited is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to public and corporate DB pension plans, endowments and foundations, sovereign wealth funds, corporate plans, insurance companies, and sub-advised mandates. Through its subsidiaries, it manages separate client-focused equity, fixed income, and balanced mutual funds along with separate client-focused equity, fixed income, and balanced portfolios. Through its subsidiaries, the firm invests in the public equity and fixed income markets across the globe. For its equity portion, it invests in growth stocks of companies. The firm employs fundamental analysis to make its investments. AGF Management Limited was founded in 1957 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1E9",
        "website": "http://www.agf.com",
        "market_cap": "Small Cap"
    },
    "ASXSF": {
        "short_name": "ELYSEE DEVELOPMENT CORP",
        "long_name": "Elysee Development Corp.",
        "summary": "Elysee Development Corp. operates as an investment and venture capital firm that makes growth capital investments. The firm makes investments, with a focus on the natural resource sector. Its investment portfolio consists of equity investments in small and medium sized public companies, with a focus on precious and specialty metals; and investments in convertible debentures of mining companies. The company was formerly known as Alberta Star Development Corp. and changed its name to Elysee Development Corp. in July 2015. Elysee Development Corp. was incorporated in 1996 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3X2",
        "website": "http://www.elyseedevelopment.com",
        "market_cap": "Small Cap"
    },
    "B1AM34.SA": {
        "short_name": "BROOKFIELD ADRN",
        "long_name": "Brookfield Asset Management Inc.",
        "summary": "Brookfield Asset Management is a leading global alternative asset manager and one of the largest investors in real assets. Our investment focus is on real estate, renewable power, infrastructure and private equity assets. Our objective is to generate attractive long-term risk-adjusted returns for the benefit of our clients and shareholders. We manage a range of public and private investment products and services for institutional and retail clients. We earn asset management income for doing so and align our interests with our clients by investing alongside them. We have an exceptionally strong balance sheet, with over $30 billion of capital invested, primarily in our four listed partnerships: Brookfield Property Partners, Brookfield Infrastructure Partners, Brookfield Renewable Partners and Brookfield Business Partners. This access to large-scale capital enables us to make investments in sizeable, premier assets across geographies and asset classes that few managers are able to do. We create value for BAM shareholders in the following ways: As an asset manager Â\u0096 by investing both our own capital and that of our investors Â\u0096 this enables us to increase the scale of our operations, and enhances our financial returns through base management fees and performance-based income; as an investor and capital allocator Â\u0096 we strive to invest at attractive valuations, particularly in value-oriented situations that create opportunities for superior valuation gains and cash flow returns, or by monetizing assets at appropriate times to realize value; and as an owner-operator Â\u0096 we constantly work to increase the value of the assets within our operating businesses and the cash flows they produce through our operating expertise, development capabilities and effective financing.",
        "currency": "BRL",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.brookfield.com",
        "market_cap": "Large Cap"
    },
    "B5K3.F": {
        "short_name": "THREED CAPITAL INC.",
        "long_name": "ThreeD Capital Inc.",
        "summary": "ThreeD Capital Inc., formerly known as Brownstone Energy Inc., is a venture capital firm specializing in seed, early stage and growth capital opportunistic investments. The firm seeks to invest in technology; biotechnology; renewable technology, Nanotechnology, Electric Vehicles,Internet of things, electronic sports, junior resources with an emphasis on the precious-metal and battery-metal sectors; artificial intelligence with a focus on disruptive data science technologies, machine learning, and neuro networks; and blockchain sectors with a focus on blockchain assets. ThreeD Capital Inc. was founded in 1987 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 2L4",
        "website": "http://www.threedcapital.com",
        "market_cap": "Small Cap"
    },
    "BAM": {
        "short_name": "Brookfield Asset Management Inc",
        "long_name": "Brookfield Asset Management Inc.",
        "summary": "Brookfield Asset Management is a leading global alternative asset manager and one of the largest investors in real assets. Our investment focus is on real estate, renewable power, infrastructure and private equity assets. Our objective is to generate attractive long-term risk-adjusted returns for the benefit of our clients and shareholders. We manage a range of public and private investment products and services for institutional and retail clients. We earn asset management income for doing so and align our interests with our clients by investing alongside them. We have an exceptionally strong balance sheet, with over $30 billion of capital invested, primarily in our four listed partnerships: Brookfield Property Partners, Brookfield Infrastructure Partners, Brookfield Renewable Partners and Brookfield Business Partners. This access to large-scale capital enables us to make investments in sizeable, premier assets across geographies and asset classes that few managers are able to do. We create value for BAM shareholders in the following ways: As an asset manager Â\u0096 by investing both our own capital and that of our investors Â\u0096 this enables us to increase the scale of our operations, and enhances our financial returns through base management fees and performance-based income; as an investor and capital allocator Â\u0096 we strive to invest at attractive valuations, particularly in value-oriented situations that create opportunities for superior valuation gains and cash flow returns, or by monetizing assets at appropriate times to realize value; and as an owner-operator Â\u0096 we constantly work to increase the value of the assets within our operating businesses and the cash flows they produce through our operating expertise, development capabilities and effective financing.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.brookfield.com",
        "market_cap": "Large Cap"
    },
    "BIK-PA.TO": {
        "short_name": "BIP INVESTMENT CORP PREF SER 1",
        "long_name": "BIP Investment Corporation",
        "summary": "BIP Investment Corporation is an investment holding company. The company was incorporated in 2018 and is based in Vancouver, Canada. BIP Investment Corporation operates as a subsidiary of Brookfield Infrastructure Holdings (Canada) Inc.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4N7",
        "website": null,
        "market_cap": null
    },
    "BK.TO": {
        "short_name": "CANADIAN BANC CORP",
        "long_name": "Canadian Banc Corp.",
        "summary": "Canadian Banc Corp. is a close-ended equity mutual fund launched by Quadravest Inc. The fund is managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund invests in stocks of companies engaged in the banking sector. It benchmarks the performance of its portfolio against the S&P TSX Financial Index. The fund was formerly known as Canadian Banc Recovery Corp. Canadian Banc Corp. was formed on May 25, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/canadian-banc-home",
        "market_cap": "Small Cap"
    },
    "BKAA.F": {
        "short_name": "BROOKFIELD ASSET MAN.A LV",
        "long_name": "Brookfield Asset Management Inc.",
        "summary": "Brookfield Asset Management is a leading global alternative asset manager and one of the largest investors in real assets. Our investment focus is on real estate, renewable power, infrastructure and private equity assets. Our objective is to generate attractive long-term risk-adjusted returns for the benefit of our clients and shareholders. We manage a range of public and private investment products and services for institutional and retail clients. We earn asset management income for doing so and align our interests with our clients by investing alongside them. We have an exceptionally strong balance sheet, with over $30 billion of capital invested, primarily in our four listed partnerships: Brookfield Property Partners, Brookfield Infrastructure Partners, Brookfield Renewable Partners and Brookfield Business Partners. This access to large-scale capital enables us to make investments in sizeable, premier assets across geographies and asset classes that few managers are able to do. We create value for BAM shareholders in the following ways: As an asset manager Â\u0096 by investing both our own capital and that of our investors Â\u0096 this enables us to increase the scale of our operations, and enhances our financial returns through base management fees and performance-based income; as an investor and capital allocator Â\u0096 we strive to invest at attractive valuations, particularly in value-oriented situations that create opportunities for superior valuation gains and cash flow returns, or by monetizing assets at appropriate times to realize value; and as an owner-operator Â\u0096 we constantly work to increase the value of the assets within our operating businesses and the cash flows they produce through our operating expertise, development capabilities and effective financing.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.brookfield.com",
        "market_cap": "Large Cap"
    },
    "BLGV.CN": {
        "short_name": "BelgraviaHart",
        "long_name": "Belgravia Hartford Capital Inc.",
        "summary": "Belgravia Hartford Capital Inc. focuses on incubation, investments, and royalty and management services businesses. The company offers services to support the development of early-stage companies. It also invests in various private and public companies with a focus on licit cannabis, technology, and resources; money market and bond funds; and develops healthcare products, as well as provides merchant banking services. The company was formerly known as Belgravia Capital International Inc. and changed its name to Belgravia Hartford Capital Inc. in December 2019. Belgravia Hartford Capital Inc. is based in Kelowna, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Kelowna",
        "zipcode": "V1V 2A7",
        "website": "http://www.belgraviahartford.com",
        "market_cap": "Small Cap"
    },
    "BLGVF": {
        "short_name": "BELGRAVIA HARTFORD CAPITAL INC",
        "long_name": "Belgravia Hartford Capital Inc.",
        "summary": "Belgravia Hartford Capital Inc. focuses on incubation, investments, and royalty and management services businesses. The company offers services to support the development of early-stage companies. It also invests in various private and public companies with a focus on licit cannabis, technology, and resources; money market and bond funds; and develops healthcare products, as well as provides merchant banking services. The company was formerly known as Belgravia Capital International Inc. and changed its name to Belgravia Hartford Capital Inc. in December 2019. Belgravia Hartford Capital Inc. is based in Kelowna, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Kelowna",
        "zipcode": "V1V 2A7",
        "website": "http://www.belgraviahartford.com",
        "market_cap": "Small Cap"
    },
    "BLR.CN": {
        "short_name": "BlackhawkGrow",
        "long_name": "Blackhawk Growth Corp.",
        "summary": "Blackhawk Growth Corp. is a publicly owned investment manager. It invests in public equity and fixed income markets across North America. It focuses on investing in cannabis and CBD industries, in both Canada and the United States. The company was formerly known as Blackhawk Resource Corp. Blackhawk Growth Corp. was incorporated in 1986 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 1A1",
        "website": "http://www.blackhawkcorp.ca",
        "market_cap": "Small Cap"
    },
    "BNK.TO": {
        "short_name": "BIG BANC SPLIT CORP",
        "long_name": "Big Banc Split Corp.",
        "summary": "Big Banc Split Corp. is an equity fund launched and managed by Purpose Investments Inc. The fund invests in the public equity markets of Canada. Big Banc Split Corp. was formed on May 15, 2020 and is based in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3P5",
        "website": null,
        "market_cap": "Small Cap"
    },
    "BSO-UN.TO": {
        "short_name": "BROOKFIELD SELECT OPPORTUNITIES",
        "long_name": "Brookfield Select Opportunities Income Fund",
        "summary": "Brookfield Select Opportunities Income Fund is a closed ended balanced mutual fund launched by Brookfield Investment Management (Canada) Inc. The fund is managed by Brookfield Investment Management Inc. It invests in public equity and fixed income markets across the globe. For its equity portion, the fund seeks to invest in stocks of companies that are operating in the infrastructure and real estate sectors. It primarily invests in value stocks of companies, as well as in high yield corporate debt securities. The fund employs fundamental analysis with a bottom-up security selection approach to create its portfolio. It is actively managed. The fund benchmarks the performance of its portfolio against the S&P/TSX Composite Total Return Index and DEX Universe Bond Index. Brookfield Select Opportunities Income Fund was formed on May 23, 2014 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Toronto",
        "zipcode": "ON M5J 2T3",
        "website": "http://www.brookfieldim.com/content/brookfield_select_opportunities_income_fund_tsx_/overview-39840.html",
        "market_cap": "Small Cap"
    },
    "BXXX.CN": {
        "short_name": "BrandXLifestyle",
        "long_name": "Brand X Lifestyle Corp.",
        "summary": "Brand X Lifestyle Corp. does not have significant operations. The company intends to evaluate and invests in early-stage to mid-level emerging growth companies. Previously, it was involved in acquiring and investing in companies that operate in the blockchain technology industry. The company was formerly known as Block X Capital Corp. and changed its name to Brand X Lifestyle Corp. in March 2020. Brand X Lifestyle Corp. was incorporated in 1980 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.block-x.co",
        "market_cap": "Small Cap"
    },
    "C7G.F": {
        "short_name": "IGM FINANCIAL INC.",
        "long_name": "IGM Financial Inc.",
        "summary": "IGM Financial Inc. operates as a wealth and asset management company in Canada. It operates through Wealth Management, Asset Management, and Strategic Investments and Other segments. The company offers financial advisory services; IG Living Plan that provides financial planning services, such as investment vehicles, insurance products, mortgage and banking solutions, and charitable giving program; IG Wealth Management Advisor Portal, a customer relationship management platform; and IG Wealth Management's dealer platform, which provides increased automation and supports both MFDA and IIROC licensed advisors, as well as new products on its investment dealer platform. It also provides mutual funds; portfolios; IG Advisory Account, a fee-based account that enhances client experience by offering the ability to simplify and consolidate selected investments into a single account; iProfile Private portfolios, a portfolio management program for households with investments; iProfile Portfolios, a suite of four managed solutions; segregated funds; separately managed and fee-based brokerage accounts; insurance products; and securities services. In addition, the company offers management and related services; global private equity, private credit, and infrastructure investment solutions; and exchange traded funds. The company was incorporated in 1978 and is headquartered in Winnipeg, Canada. IGM Financial Inc. is a subsidiary of Power Financial Corporation.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "MB",
        "city": "Winnipeg",
        "zipcode": "R3B 3H5",
        "website": "http://www.igmfinancial.com",
        "market_cap": "Mid Cap"
    },
    "CEP.V": {
        "short_name": "CLIFFSIDE CAPITAL LTD",
        "long_name": "Cliffside Capital Ltd.",
        "summary": "Cliffside Capital Ltd., through CAL LP and ACC LP III, invests in retail sales contracts originated by CanCap Management Inc. and secured by collateral charges on motor vehicles. Cliffside Capital Ltd. was incorporated in 2013 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5E 1W1",
        "website": "http://www.cliffsidecapital.ca",
        "market_cap": "Small Cap"
    },
    "CF7.F": {
        "short_name": "CI FINANCIAL CORP.",
        "long_name": "CI Financial Corp",
        "summary": "CI Financial Corp. is a publicly owned asset management holding company. Through its subsidiaries, the firm manages separate client focused equity, fixed income, and alternative investments portfolios. It also manages mutual funds, hedge funds, and fund of funds for its clients through its subsidiaries. The firm was founded in 1965 and is based in Toronto, Canada with additional offices in Vancouver, Canada; Calgary, Canada; and Montreal, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 3G7",
        "website": "http://www.cifinancial.com",
        "market_cap": "Mid Cap"
    },
    "CIQ-UN.TO": {
        "short_name": "CANADIAN HIGH INCOME EQUITY FUN",
        "long_name": "Canadian High Income Equity Fund",
        "summary": "Canadian High Income Equity Fund is a closed-ended equity mutual fund launched by Brompton Funds Limited. The fund is managed by Bloom Investment Counsel, Inc. It invests in the public equity markets of Canada. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in dividend paying value stocks of companies. The fund focuses on such factors as strong cash flows and investor demand to create its portfolio. It benchmarks the performance of its portfolio against the S&P/TSX Composite Index. Canadian High Income Equity Fund as formed on February 18, 2010 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3S5",
        "website": "http://www.bromptongroup.com/funds/fund/ciq/overview",
        "market_cap": "Small Cap"
    },
    "CIX.TO": {
        "short_name": "CI FINANCIAL CORP.",
        "long_name": "CI Financial Corp",
        "summary": "CI Financial Corp. is a publicly owned asset management holding company. Through its subsidiaries, the firm manages separate client focused equity, fixed income, and alternative investments portfolios. It also manages mutual funds, hedge funds, and fund of funds for its clients through its subsidiaries. The firm was founded in 1965 and is based in Toronto, Canada with additional offices in Vancouver, Canada; Calgary, Canada; and Montreal, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 3G7",
        "website": "http://www.cifinancial.com",
        "market_cap": "Mid Cap"
    },
    "CIXX": {
        "short_name": "CI Financial Corp.",
        "long_name": "CI Financial Corp",
        "summary": "CI Financial Corp. is a publicly owned asset management holding company. Through its subsidiaries, the firm manages separate client focused equity, fixed income, and alternative investments portfolios. It also manages mutual funds, hedge funds, and fund of funds for its clients through its subsidiaries. The firm was founded in 1965 and is based in Toronto, Canada with additional offices in Vancouver, Canada; Calgary, Canada; and Montreal, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 3G7",
        "website": "http://www.cifinancial.com",
        "market_cap": "Mid Cap"
    },
    "CLSPF": {
        "short_name": "CANADIAN LIFE COS SPLIT CORP",
        "long_name": "Canadian Life Companies Split Corp.",
        "summary": "Canadian Life Companies Split Corp. is a closed-ended equity mutual fund launched and managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund seeks to invest in stocks of companies operating in the life insurance sector. It primarily invests in stocks of four publicly traded life insurance companies namely Great-West Lifeco Inc., Industrial Alliance Insurance and Financial Services Inc., Manulife Financial Corporation, and Sun Life Financial Inc. The fund employs fundamental analysis with a focus on such factors as a firm's earning history, relative price-earnings multiple, cash flow, dividend yield, market position, and growth prospects to create its portfolio. It benchmarks the performance of its portfolio against the S&P TSX Financial Index. Canadian Life Companies Split Corp. was formed on April 18, 2005 and is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/#!lifesplit-home/cuny",
        "market_cap": "Small Cap"
    },
    "COO.V": {
        "short_name": "NATUREBANK ASSET MANAGEMENT INC",
        "long_name": "NatureBank Asset Management Inc.",
        "summary": "NatureBank Asset Management Inc. engages in sourcing, financing, development, and commercialization of sustainable commodity projects in the agro-forestry and carbon sectors in Canada, Germany, rest of Europe, the United States, and internationally. Its agroforestry services include sustainable forest management, process improvement, and arid lands, as well as solutions for cocoa production; and ecosystem services comprise feasibility assessments, evaluation tools, forest restoration, and GIS and modeling. The company also provides carbon management services, such as project development, CCBA development, forest restoration, indigenous communities, and certification, as well as forestry, community based land management, remote sensing, and geospatial analysis services; and supply chain risk analysis, climate risk services of natural resource planning, life cycle assessment, policy and market analysis, offset project development, clean technology, and event impact management services. In addition, it offers advisory, technology, and impact investment services to public and private organizations; sells verified emission reduction units; and provides project development consulting services, and other environmental consulting services. The company was formerly known as Offsetters Climate Solutions Inc. and changed its name to NatureBank Asset Management Inc. in October 2015. NatureBank Asset Management Inc. was founded in 2004 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 2W7",
        "website": "http://www.naturebank.com",
        "market_cap": "Small Cap"
    },
    "COPRF": {
        "short_name": "MEDIVOLVE INC",
        "long_name": "Medivolve Inc.",
        "summary": "Medivolve Inc. is a principal investment firm. It is a social-impact investment focused company Investing resources, funds and bandwidth for the betterment of the human condition through medical sciences, climate change and technology. The firm was formerly known as Continent Resources Inc. and changed its name to Copper One Inc. in October 2009. Copper One Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2M5",
        "website": "http://www.questcapinc.com",
        "market_cap": "Small Cap"
    },
    "CRSWF": {
        "short_name": "CROSSWINDS HOLDINGS INC",
        "long_name": "Crosswinds Holdings Inc.",
        "summary": "Crosswinds Holdings Inc., formerly known as C.A. Bancorp Inc., is a private equity firm specializing in management buyouts, acquisitions, expansions, restructurings, leveraged buy-out, refinancing, distressed securities, bankruptcy exits, growth capital, turnarounds, PIPE transactions of middle-market companies, and other alternative investment opportunities. The firm focuses its investments in small and middle capitalization public and private companies. It also participates in open market purchases, equity investments in private issuers, and privatization of public companies. The firm seeks to invest in industrials, real estate, infrastructure, asset management, and financial services with a particular focus on the insurance industry including reinsurance. Within industrials, it seeks to invest in mature industrial companies with a focus on manufacturing, distribution, and service sectors. Its infrastructure investment opportunities focus on power generation, transportation, and utilities. The firm's investment in real estate includes industrial, commercial, healthcare, hospitality, and retail properties. Within financial services, it invests in Canadian and international financial services businesses, including asset managers and investment counselors. The firm also invests in electric power generation by nuclear fuels and fossil fuels. From time to time, it will seek to invest in Capital Pool Companies within the real estate, infrastructure, and other asset-rich areas. The firm seeks to invest in the undervalued North American private and public companies based in Canada and the Unites States. Its public investments will focus on mid-market companies trading on the Toronto Stock Exchange. It typically invests between $0.5 million and $20 million in companies with enterprise values between $25 million and $200 million. The firm seeks to pursue investments that offer returns between 1.5 percent and three percent. The firm has a preference for dislocations and underfollowed sectors of the market. It seeks a board seat in its portfolio companies. The firm exits its investments through sale to strategic buyers or financial investors, open market sales, normal course retirement of securities, refinancing, and public offerings. Crosswinds Holdings Inc. is based in Toronto, Canada with an additional office in New York, New York. As of March 08, 2013, it operates as a subsidiary of CDJ Global Catalyst LLC.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 0R2",
        "website": null,
        "market_cap": "Small Cap"
    },
    "CSOC-A.V": {
        "short_name": "CANSO SELECT OPPORTUNITIES CORP",
        "long_name": "Canso Select Opportunities Corporation",
        "summary": "Canso Select Opportunities Corporation is a publicly owned hedge fund manager. The firm invests in the public equity and fixed Income markets of Canada and across the globe. For fixed Income securities, the firm invests in governments, government agencies, bank loans, supranational agencies and companies. It conducts in-house research to make its investments. It is a private equity, venture capital and distressed firm specializing in investments focused in Canada. Canso Select Opportunities Corporation was founded on February 16, 2018 and is based in Richmond Hill, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Richmond Hill",
        "zipcode": "L4B 1J8",
        "website": "http://www.selectopportunitiescorporation.com",
        "market_cap": "Small Cap"
    },
    "CSOC-B.V": {
        "short_name": "CANSO SELECT OPPORTUNITIES CORP",
        "long_name": "Canso Select Opportunities Corporation",
        "summary": "Canso Select Opportunities Corporation is a publicly owned hedge fund manager. The firm invests in the public equity and fixed Income markets of Canada and across the globe. For fixed Income securities, the firm invests in governments, government agencies, bank loans, supranational agencies and companies. It conducts in-house research to make its investments. It is a private equity, venture capital and distressed firm specializing in investments focused in Canada. Canso Select Opportunities Corporation was founded on February 16, 2018 and is based in Richmond Hill, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Richmond Hill",
        "zipcode": "L4B 1J8",
        "website": "http://www.selectopportunitiescorporation.com",
        "market_cap": "Small Cap"
    },
    "CVG.TO": {
        "short_name": "CLAIRVEST GROUP",
        "long_name": "Clairvest Group Inc.",
        "summary": "Clairvest Group Inc. is a private equity firm specializing in mid market, growth equity investments, buyouts, and consolidating industries and add-on acquisitions. It seeks to invest in small and mid-sized gaming and casino, local market gaming, healthcare, equipment rental, oilfield services, waste management, business services, consumer services, aerospace, automotive aftermarket, collision repair, co-packing, defense, document management, warranty, contact manufacturing, environmental services, rental services, gaming, healthcare services, insurance services, IT services, logistics and transportation, mining services, packaging, pest control, specialty aviation, education, software (mature), textile rental, utility services, water, building products, government services, industrial services, media, non-destructive testing, renewable energy, property management, and restaurants. The firm typically invests in companies based in North America including United States and Canada. It seeks to make equity investments between CAD$15 million ($15.03 million) and CAD$100 million ($76.32 million) in its portfolio company with EBITDA between CAD$5 million ($3.81 million) and CAD$50 million ($38.16 million). The firm can make either majority or controlling or minority investments and seeks to acquire between 20 percent and 80 percent stake. It invests its own capital and seeks to take a board seat on its portfolio companies. The firm typically exits its investments through market share offering, a strategic sale or sale to a financial buyer. Clairvest Group Inc. was founded in 1987 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M4T 2S3",
        "website": "http://www.clairvest.com",
        "market_cap": "Small Cap"
    },
    "CYB.TO": {
        "short_name": "CYMBRIA CORPORATION CL A",
        "long_name": "Cymbria Corporation",
        "summary": "Cymbria Corporation is a closed ended equity fund launched and managed by EdgePoint Investment Group Inc. The fund invests in the public equity markets across the globe. It also invests some portion of its portfolio in derivative instruments, privately held businesses or leverage its investments. The fund holds a substantial amount of investment in EdgePoint Wealth Management. Inc. It invests in the stocks of companies operating across diversified sectors. The fund invests in the value stocks of companies across all market capitalizations. It focuses on factors like proprietary insights, long term views, focus on growth, extensive research, incisive analysis, and assessment of value sums up to create its portfolio. The fund benchmarks the performance of its portfolio against the MSCI World Index (C$). Cymbria Corporation was formed on September 4, 2008 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2X9",
        "website": "http://www.edgepointwealth.com/Cymbria/",
        "market_cap": "Small Cap"
    },
    "CYOA.F": {
        "short_name": "CYMBRIA CORP. CLASS A",
        "long_name": "Cymbria Corporation",
        "summary": "Cymbria Corporation is a closed ended equity fund launched and managed by EdgePoint Investment Group Inc. The fund invests in the public equity markets across the globe. It also invests some portion of its portfolio in derivative instruments, privately held businesses or leverage its investments. The fund holds a substantial amount of investment in EdgePoint Wealth Management. Inc. It invests in the stocks of companies operating across diversified sectors. The fund invests in the value stocks of companies across all market capitalizations. It focuses on factors like proprietary insights, long term views, focus on growth, extensive research, incisive analysis, and assessment of value sums up to create its portfolio. The fund benchmarks the performance of its portfolio against the MSCI World Index (C$). Cymbria Corporation was formed on September 4, 2008 and is domiciled in Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5S 2X9",
        "website": "http://www.edgepointwealth.com/Cymbria/",
        "market_cap": "Small Cap"
    },
    "DDWWF": {
        "short_name": "DIVIDEND GROWTH SPLIT CORP",
        "long_name": "Dividend Growth Split Corp.",
        "summary": "Dividend Growth Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It invests in stocks of companies operating across diversified sectors. The fund primarily invests in stocks of large-cap companies. It benchmarks the performance of its portfolio against the S&P/TSX Composite Index. Dividend Growth Split Corp. was formed on September 25, 2007 and is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/dgs/overview",
        "market_cap": "Small Cap"
    },
    "DF.TO": {
        "short_name": "DIVIDEND 15 SPLIT CORP. II",
        "long_name": "Dividend 15 Split Corp. II",
        "summary": "Dividend 15 Split Corp. II is a close ended equity mutual fund launched by Quadravest Inc. The fund is managed by Quadravest Capital Management. It invests in public equity markets of Canada. The fund invests in stocks of companies operating across the diversified sectors. It benchmarks the performance of its portfolio against the S&P TSX 60 Index. Dividend 15 Split Corp. II was formed on September 28, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.dividend15.com/split_II/fund_info.html",
        "market_cap": "Small Cap"
    },
    "DFN.TO": {
        "short_name": "DIVIDEND 15 SPLIT CORP",
        "long_name": "Dividend 15 Split Corp.",
        "summary": "Dividend 15 Split Corp. is a close ended equity mutual fund launched by Quadravest Inc. The fund is managed by Quadravest Capital Management. It invests in public equity markets of Canada. The fund spreads its investments across diversified sectors. It benchmarks the performance of its portfolio against the S&P TSX 60 Index. Dividend 15 Split Corp. was formed on January 9, 2004 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.dividend15.com",
        "market_cap": "Small Cap"
    },
    "DGS.TO": {
        "short_name": "DIVIDEND GROWTH SPLIT CORP. CLA",
        "long_name": "Dividend Growth Split Corp.",
        "summary": "Dividend Growth Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It invests in stocks of companies operating across diversified sectors. The fund primarily invests in stocks of large-cap companies. It benchmarks the performance of its portfolio against the S&P/TSX Composite Index. Dividend Growth Split Corp. was formed on September 25, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/dgs/overview",
        "market_cap": "Small Cap"
    },
    "DS.TO": {
        "short_name": "DIVIDEND SELECT 15 CORP.",
        "long_name": "Dividend Select 15 Corp.",
        "summary": "Dividend Select 15 Corp. is a closed ended equity mutual fund launched and managed by Quadravest Capital Management Inc. The fund invests in public equity markets of Canada. It invests in stocks of companies engaged in the financial services sector. Dividend Select 15 Corp. was formed on August 26, 2010 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.dividendselect15.com/quick_facts.html",
        "market_cap": "Small Cap"
    },
    "DVVDF": {
        "short_name": "DIVIDEND SELECT 15 CORP",
        "long_name": "Dividend Select 15 Corp.",
        "summary": "Dividend Select 15 Corp. is a closed ended equity mutual fund launched and managed by Quadravest Capital Management Inc. The fund invests in public equity markets of Canada. It invests in stocks of companies engaged in the financial services sector. Dividend Select 15 Corp. was formed on August 26, 2010 and is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.dividendselect15.com/quick_facts.html",
        "market_cap": "Small Cap"
    },
    "ECA.F": {
        "short_name": "BELGRAVIA HARTFORD CAP.",
        "long_name": "Belgravia Hartford Capital Inc.",
        "summary": "Belgravia Hartford Capital Inc. focuses on incubation, investments, and royalty and management services businesses. The company offers services to support the development of early-stage companies. It also invests in various private and public companies with a focus on licit cannabis, technology, and resources; money market and bond funds; and develops healthcare products, as well as provides merchant banking services. The company was formerly known as Belgravia Capital International Inc. and changed its name to Belgravia Hartford Capital Inc. in December 2019. Belgravia Hartford Capital Inc. is based in Kelowna, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Kelowna",
        "zipcode": "V1V 2A7",
        "website": "http://www.belgraviahartford.com",
        "market_cap": "Small Cap"
    },
    "ECOM.V": {
        "short_name": "EMERGE COMMERCE LTD",
        "long_name": "Emerge Commerce Ltd.",
        "summary": "Emerge Commerce Ltd. acquires and operates e-commerce websites and applications in North America. Its portfolio houses of online destinations, including trulocal.ca, UnderPar.com, WagJag.com, JustGolfStuff.ca, and BeRightBack.ca. The company was founded in 2016 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5T 2R7",
        "website": "http://www.emerge-commerce.com",
        "market_cap": "Small Cap"
    },
    "EIT-UN.TO": {
        "short_name": "CANOE EIT INCOME FUND UNITS",
        "long_name": "Canoe EIT Income Fund",
        "summary": "Canoe EIT Income Fund is a closed-ended balanced fund launched and managed by Canoe Financial LP. It is co-managed by Haber Trilix Advisors, LP. The fund invests in the public equity and fixed income markets of Canada and the United States. Its equity portion seeks to invest in the stocks of companies operating across diversified sectors. The fund primarily invests in growth and value stocks of mid-cap and large-cap companies. It invests in equity and debt securities of royalty and income trusts, corporations, partnerships, or other issuers. The fund was formerly known as EnerVest Diversified Income Trust. Canoe EIT Income Fund was formed on August 5, 1997 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 3N9",
        "website": "http://www.canoefinancial.com/products/closed-end-funds/enervest-divesified-income-trust/overview6/",
        "market_cap": "Small Cap"
    },
    "ELC.V": {
        "short_name": "ELYSEE DEVELOPMENT CORP",
        "long_name": "Elysee Development Corp.",
        "summary": "Elysee Development Corp. operates as an investment and venture capital firm that makes growth capital investments. The firm makes investments, with a focus on the natural resource sector. Its investment portfolio consists of equity investments in small and medium sized public companies, with a focus on precious and specialty metals; and investments in convertible debentures of mining companies. The company was formerly known as Alberta Star Development Corp. and changed its name to Elysee Development Corp. in July 2015. Elysee Development Corp. was incorporated in 1996 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3X2",
        "website": "http://www.elyseedevelopment.com",
        "market_cap": "Small Cap"
    },
    "ES3G.F": {
        "short_name": "ESG GLOBAL IMPACT CAP. I.",
        "long_name": "ESG Global Impact Capital Inc.",
        "summary": "ESG Global Impact Capital Inc., formerly known as Block One Capital Inc., is a venture capital and private equity firm specializing in early stage, growth capital, debt and equity investing. The firm does not invest in distressed situations, turnarounds, and seed investments in start-ups. It only seeks minority stakes. The firm typically invests in the following sectors: wellness and healthcare; business services and logistics; education and training; and emerging technologies. It seeks to invest in companies that have capital requirement between CAD 0.25 million ($0.26 million) and CAD 2 million ($2.04 million) and have Asset to Revenue ratio of less than 40%. The firm seeks to invest a minimum of $0.25 million in it's portfolio companies. It seeks to invest in the form of convertible debentures and also prefers to take a board seat or observation rights in it's portfolio companies. ESG Global Impact Capital Inc. was founded in February 2010 and is based in Vancouver, Canada with an additional office in Windsor, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 1T7",
        "website": "http://www.blockonecap.com",
        "market_cap": "Small Cap"
    },
    "ESGW.V": {
        "short_name": "ESG GLOBAL IMPACT CAPITAL INC",
        "long_name": "ESG Global Impact Capital Inc.",
        "summary": "ESG Global Impact Capital Inc., formerly known as Block One Capital Inc., is a venture capital and private equity firm specializing in early stage, growth capital, debt and equity investing. The firm does not invest in distressed situations, turnarounds, and seed investments in start-ups. It only seeks minority stakes. The firm typically invests in the following sectors: wellness and healthcare; business services and logistics; education and training; and emerging technologies. It seeks to invest in companies that have capital requirement between CAD 0.25 million ($0.26 million) and CAD 2 million ($2.04 million) and have Asset to Revenue ratio of less than 40%. The firm seeks to invest a minimum of $0.25 million in it's portfolio companies. It seeks to invest in the form of convertible debentures and also prefers to take a board seat or observation rights in it's portfolio companies. ESG Global Impact Capital Inc. was founded in February 2010 and is based in Vancouver, Canada with an additional office in Windsor, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 1T7",
        "website": "http://www.blockonecap.com",
        "market_cap": "Small Cap"
    },
    "ESIFF": {
        "short_name": "ESG GLOBAL IMPACT CAPITAL INC",
        "long_name": "ESG Global Impact Capital Inc.",
        "summary": "ESG Global Impact Capital Inc., formerly known as Block One Capital Inc., is a venture capital and private equity firm specializing in early stage, growth capital, debt and equity investing. The firm does not invest in distressed situations, turnarounds, and seed investments in start-ups. It only seeks minority stakes. The firm typically invests in the following sectors: wellness and healthcare; business services and logistics; education and training; and emerging technologies. It seeks to invest in companies that have capital requirement between CAD 0.25 million ($0.26 million) and CAD 2 million ($2.04 million) and have Asset to Revenue ratio of less than 40%. The firm seeks to invest a minimum of $0.25 million in it's portfolio companies. It seeks to invest in the form of convertible debentures and also prefers to take a board seat or observation rights in it's portfolio companies. ESG Global Impact Capital Inc. was founded in February 2010 and is based in Vancouver, Canada with an additional office in Windsor, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 1T7",
        "website": "http://www.blockonecap.com",
        "market_cap": "Small Cap"
    },
    "FB0.F": {
        "short_name": "FORTRESS TECHS INC.",
        "long_name": "Fortress Technologies Inc.",
        "summary": "Fortress Technologies Inc. does not have significant operations. The company is evaluating opportunities in technology sectors. Previously, it was involved in the cryptocurrency mining operations in the North American green-energy regions. Fortress Technologies Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6G 3K3",
        "website": "http://www.fortresstechnologies.io",
        "market_cap": "Small Cap"
    },
    "FFN.TO": {
        "short_name": "NORTH AMERICAN FINANCIAL 15 SPL",
        "long_name": "North American Financial 15 Split Corp.",
        "summary": "North American Financial 15 Split Corp. is an equity mutual fund launched by Quadravest Inc. It is managed by Quadravest Capital Management Inc. The fund invests in public equity markets of United States and Canada. It invests in high quality portfolio of preferred shares and Class A shares of 15 financial services companies. The fund employs investment strategy along with fundamental based equity investing with covered call writing to create its portfolio. It was formerly known as Financial 15 Split Corp. II. North American Financial 15 Split Corp. was formed on October 15, 2004 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.financial15.com/Split_ll/fund_info.html",
        "market_cap": "Small Cap"
    },
    "FFP.V": {
        "short_name": "Consolidated Firstfund Capital ",
        "long_name": "Consolidated Firstfund Capital Corp.",
        "summary": "Consolidated Firstfund Capital Corp. is a venture capital and property management company. The firm makes growth capital and mezzanine investments. It invests in public and private companies in Canada and West Coast United States. The firm also engages in financial consulting relating to merchant banking and real estate development activities. It enables companies operating primarily in the real estate and resort development, high technology, manufacturing, and tourism sectors to raise operating funds through secondary financing, equity, debt, or tax-favoured investments; syndication; and marketing of investments. The firm also provides marketing, strategic planning, and financial services to management of companies. In addition, the firm markets and sells vacation ownership intervals; develops and rents real estate properties; and manages retail space at Ocean Breezes in Birch Bay, Washington. Consolidated Firstfund Capital Corp. was founded in 1985 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3N6",
        "website": null,
        "market_cap": "Small Cap"
    },
    "FFXDF": {
        "short_name": "FAIRFAX INDIA HOLDINGS CORPORAT",
        "long_name": "Fairfax India Holdings Corporation",
        "summary": "Fairfax India Holdings Corporation, an investment holding company, engages in the investment activities in India. It invests in public and private equity securities and debt instruments in India and Indian businesses, or other businesses with customers, suppliers, or business primarily conducted in, or dependent on, India. The company was founded in 2014 and is headquartered in Toronto, Canada. Fairfax India Holdings Corporation is a subsidiary of Fairfax Financial Holdings Limited.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2N7",
        "website": "http://www.fairfaxindia.ca",
        "market_cap": "Small Cap"
    },
    "FFXXF": {
        "short_name": "HELIOS FAIRFAX PARTNERS CORP",
        "long_name": "Helios Fairfax Partners Corporation",
        "summary": "Helios Fairfax Partners Corporation, an investment holding company, engages in the investment activities in Africa. It focuses on investing in public and private equity securities and debt instruments of African businesses or other businesses with customers, suppliers, or business primarily conducted in, or dependent on, Africa. The company was formerly known as Fairfax Africa Holdings Corporation and changed its name to Helios Fairfax Partners Corporation in December 2020. Helios Fairfax Partners Corporation was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2N7",
        "website": "http://www.heliosinvestment.com/helios-fairfax-partners",
        "market_cap": "Small Cap"
    },
    "FNR.V": {
        "short_name": "49 NORTH RESOURCES INC.",
        "long_name": "49 North Resources Inc.",
        "summary": "49 North Resources Inc. is a venture capital firm specializing in seed capital and early stage investments. The firm typically invests in a diversified portfolio of common shares and other securities of resource issuers including all sectors of mineral exploration as well as oil and gas exploration and production around the globe. It focuses on resource issuers with exploration programs in Saskatchewan. The firm also seeks to co-invest. 49 North Resources Inc. was founded in 2005 and is based in Saskatoon, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "SK",
        "city": "Saskatoon",
        "zipcode": "S7K 5M5",
        "website": "http://www.fnr.ca",
        "market_cap": "Small Cap"
    },
    "FORT.V": {
        "short_name": "FORTRESS TECHNOLOGIES INC",
        "long_name": "Fortress Technologies Inc.",
        "summary": "Fortress Technologies Inc. does not have significant operations. The company is evaluating opportunities in technology sectors. Previously, it was involved in the cryptocurrency mining operations in the North American green-energy regions. Fortress Technologies Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6G 3K3",
        "website": "http://www.fortresstechnologies.io",
        "market_cap": "Small Cap"
    },
    "FRTTF": {
        "short_name": "FORTRESS TECHNOLOGIES INC",
        "long_name": "Fortress Technologies Inc.",
        "summary": "Fortress Technologies Inc. does not have significant operations. The company is evaluating opportunities in technology sectors. Previously, it was involved in the cryptocurrency mining operations in the North American green-energy regions. Fortress Technologies Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6G 3K3",
        "website": "http://www.fortresstechnologies.io",
        "market_cap": "Small Cap"
    },
    "FSZ.TO": {
        "short_name": "FIERA CAPITAL CORP",
        "long_name": "Fiera Capital Corporation",
        "summary": "Fiera Capital Corporation is an employee owned investment manager. The firm primarily provides its services to institutional investors, mutual funds, charitable organizations, and private clients. It manages separate client-focused equity, fixed income, and balanced portfolios. The firm also launches and manages equity, fixed income, and balanced mutual funds and income trusts for its clients. It invests in the public equity and fixed income markets across the globe with a focus on Canada. The firm primarily invests in growth and value stocks of small-cap companies. It also invests in G.A.R.P. and value stocks of large-cap companies. The firm also makes investments in income trusts and preferred shares. It also applies exclusions to be fossil fuel free, integrates environmental, social, and governance considerations, and applies an ethical filter while making its investments. The firm employs fundamental and quantitative analysis along with bottom-up stock picking approach to create its equity portfolios. It employs a top-down macro-economic research to make its fixed income investments. The firm also makes alternative investments, including the use of long/short equity strategy. It benchmarks the performance of its portfolio against the S&P/TSX Index, MSCI ACWI Index, S&P/TSX Composite FFF Index, and S&P 500 indices. The firm conducts in-house research to make its investments. It makes investments in social infrastructure with a focus on affordable housing and community health care facilities and also makes investment in solar and wind power generation, transport, and mid-market assets. It typically invests in Canada. It was formerly known as Fiera Sceptre Inc. Fiera Capital Corporation was founded in 2002 and is based in MontrÃ©al, Canada with an additional office in Toronto, Canada, Calgary, Canada, and Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3M8",
        "website": "http://www.fieracapital.com",
        "market_cap": "Small Cap"
    },
    "FTN.TO": {
        "short_name": "FINANCIAL 15 SPLIT CORP",
        "long_name": "Financial 15 Split Corp.",
        "summary": "Financial 15 Split Corp. is an close ended equity mutual fund launched by Quadravest Inc. It is managed by Quadravest Capital Management Inc. It invests in the public equity markets of the United States and Canada. The fund primarily invests in stocks of companies operating in the financials sector. Financial 15 Split Corp. was formed on Nov 14, 2003 and is domiciled in the Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/#!financial15-home/cs0n",
        "market_cap": "Small Cap"
    },
    "FTU.TO": {
        "short_name": "US FINANCIAL 15 SPLIT CORP.",
        "long_name": "US Financial 15 Split Corp",
        "summary": "US Financial 15 Split Corp is a closed ended equity mutual fund launched by Quadravest Inc. It is managed by Quadravest Capital Management Inc. The fund invests in the public equity markets of the United States. It seeks to invest in companies operating in the financial services sector. US Financial 15 Split Corp was formed on December 17, 2004 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/#!usfinancial15-home/c153w",
        "market_cap": "Small Cap"
    },
    "FUND": {
        "short_name": "Sprott Focus Trust, Inc. - Clos",
        "long_name": "Sprott Focus Trust, Inc.",
        "summary": "Sprott Focus Trust, Inc. is a closed-ended equity mutual fund launched and managed by Sprott Asset Management, LP. The fund is co-managed by Sprott Asset Management USA Inc. It invests in the public equity markets of the United States. The fund seeks to invest in stocks of companies operating across diversified sectors. It primarily invests in value stocks of companies across all market capitalizations. The fund benchmarks the performance of its portfolio against the Russell 3000 Index. It was formerly known as Royce Focus Trust, Inc. Sprott Focus Trust, Inc. was formed on March 2, 1988 and is domiciled in the United States.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2J1",
        "website": "http://sprottfocustrust.com",
        "market_cap": "Small Cap"
    },
    "FW.V": {
        "short_name": "FLOW CAPITAL CORP",
        "long_name": "Flow Capital Corp.",
        "summary": "Flow Capital Corp. operates as an alternative asset investor and advisor in Canada and the United States. It offers revenue-linked, venture debt, and other cash flow-oriented investments to businesses; and various advisory services. The company was formerly known as LOGiQ Asset Management Inc. and changed its name to Flow Capital Corp. in June 2018. Flow Capital Corp. is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V7X 1L3",
        "website": "http://www.flowcap.com",
        "market_cap": "Small Cap"
    },
    "GCG.TO": {
        "short_name": "GUARDIAN CAPITAL",
        "long_name": "Guardian Capital Group Limited",
        "summary": "Guardian Capital Group Limited, together with its subsidiaries, operates as a diversified financial services company in Canada and internationally. The company manages institutional assets for pension plans, insurers, foundations, endowments, third-party mutual funds, and ETFs; and provides private wealth management services to individuals, families, charitable organizations, and family foundations. It also offers trust and corporate administration, investment management, and banking services for international clients; and an integrated wealth management platform for financial advisors to deliver professional advice on mutual funds, securities, and insurance. In addition, the company sells life insurance products, mutual funds, and other securities. Guardian Capital Group Limited was incorporated in 1962 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5L 1E8",
        "website": "http://www.guardiancapital.com",
        "market_cap": "Small Cap"
    },
    "GDV-PA.TO": {
        "short_name": "GLOBAL DIVIDEND GROWTH SPLIT CO",
        "long_name": "Global Dividend Growth Split Corp.",
        "summary": "Global Dividend Growth Split Corp. is an equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets across the globe. It invests in the growth stocks of companies with large-capitalization. Global Dividend Growth Split Corp. was formed on April 24, 2018 and is domiciled in Canada",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/gdv/overview",
        "market_cap": null
    },
    "GDV.TO": {
        "short_name": "GLOBAL DIVIDEND GROWTH SPLIT CO",
        "long_name": "Global Dividend Growth Split Corp.",
        "summary": "Global Dividend Growth Split Corp. is an equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets across the globe. It invests in the growth stocks of companies with large-capitalization. Global Dividend Growth Split Corp. was formed on April 24, 2018 and is domiciled in Canada",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/gdv/overview",
        "market_cap": "Small Cap"
    },
    "GDVM": {
        "short_name": "GLOBAL DEVELOPMENT INC",
        "long_name": "Global Developments, Inc.",
        "summary": "Global Developments, Inc. is no longer investing. It is a principal investment firm specializing in acquisitions and early stage financing of emerging growth companies. It acquires portfolio companies as a wholly owned subsidiary or as an investment in a minority stake. The firm seeks to be the lead investor with substantial management control. It also helps its portfolio companies grow through mergers and acquisitions before spinning them out through an initial public offering or direct sale. The firm does not confine its investments to any particular industry or geography. Global Developments, Inc. was founded in 2006 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 4P7",
        "website": null,
        "market_cap": "Small Cap"
    },
    "GFP.V": {
        "short_name": "GREENFIRST FOREST PRODUCTS INC",
        "long_name": "GreenFirst Forest Products Inc.",
        "summary": "GreenFirst Forest Products Inc. focuses on investments in the forest products industry in Canada. It owns a sawmill in Kenora. The company was formerly known as Itasca Capital Ltd. and changed its name to GreenFirst Forest Products Inc. in January 2021. GreenFirst Forest Products Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.gffp.ca",
        "market_cap": "Small Cap"
    },
    "GMN.V": {
        "short_name": "GOBIMIN INC",
        "long_name": "GobiMin Inc.",
        "summary": "GobiMin Inc., together with its subsidiaries, invests in equity, debt, or other securities in China. The company operates through two segments, Investment Business and Mining Business. It is also involved in the development and exploration of gold and mineral properties; and property holding and leasing activities, as well as in the provision of business and consultancy services. The company is based in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3G4",
        "website": "http://www.gobimin.com",
        "market_cap": "Small Cap"
    },
    "HFPC-U.TO": {
        "short_name": "HELIOS FAIRFAX PARTNERS CORPORA",
        "long_name": "Helios Fairfax Partners Corporation",
        "summary": "Helios Fairfax Partners Corporation, an investment holding company, engages in the investment activities in Africa. It focuses on investing in public and private equity securities and debt instruments of African businesses or other businesses with customers, suppliers, or business primarily conducted in, or dependent on, Africa. The company was formerly known as Fairfax Africa Holdings Corporation and changed its name to Helios Fairfax Partners Corporation in December 2020. Helios Fairfax Partners Corporation was founded in 2016 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2N7",
        "website": "http://www.heliosinvestment.com/helios-fairfax-partners",
        "market_cap": "Small Cap"
    },
    "HGI-UN.TO": {
        "short_name": "GLOBAL TELECOM AND UTILITIES IN",
        "long_name": "Global Telecom & Utilities Income Fund",
        "summary": "Global Telecom & Utilities Income Fund is a closed ended equity mutual fund launched and managed by Harvest Portfolios Group Inc. It invests in public equity markets across the globe. The fund invests in stocks of companies operating in the telecom and utilities sector. It employs fundamental analysis with bottom-up and top-down approach focusing on factors like global economic health and trends, state of the economy, and strong financial position stocks to create its portfolio. The fund benchmarks the performance of its portfolio against the Bloomberg World Index and the S&P/TSX Composite Index. The fund was formerly known as Global Advantaged Telecom & Utilities Income Fund. Global Telecom & Utilities Income Fund was formed on March 23, 2011 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Oakville",
        "zipcode": "L6j 4A5",
        "website": "http://harvestportfolios.com/closed-end-funds/global-advantaged-telecom-utilities-income/",
        "market_cap": "Small Cap"
    },
    "HLTH.CN": {
        "short_name": "GlobalCare",
        "long_name": "Global Care Capital Inc.",
        "summary": "Global Care Capital Inc., formerly known as, Resinco Capital Partners Inc., is a venture capital and a private equity firm specializing in investments in early stage companies, buyout, private and public or undervalued assets, and assists them in the going public process. The firm prefers to invest in acquisitions and provides mezzanine financing. It also provides consulting, corporate administration and finance, marketing, and investor relations services to the companies operating in the resource sector. The firm prefers to invest in healthcare, medical marijuana pharma sector, natural resource, exploration, and mining sector with a focus on hard rock minerals, precious metals, rare-earth minerals, oil, gas, water, and renewable energy markets. It prefer to have majority stake in companies. It generally exits by making portfolio companies go public. Global Care Capital Inc. was founded in September, 2005 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.globalcarecapital.com",
        "market_cap": "Small Cap"
    },
    "IC.CN": {
        "short_name": "ICCapitalight",
        "long_name": "IC Capitalight Corp.",
        "summary": "IC Capitalight Corp. operates as a merchant bank in Canada. The company holds investments in Murenbeeld, which operates a subscription research business focusing on the gold sector; and invests in debentures. It also holds interests in the Blue Lake project with 263 claims covering 12,724 hectares located to the northeast of Schefferville, QuÃ©bec; and 100% interest in the Ashuanipi Gold Property near Schefferville, Quebec. The company was formerly known as International Corona Capital Corp. and changed its name to IC Capitalight Corp. in October 2019. IC Capitalight Corp. was incorporated in 2008 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 3E8",
        "website": "http://www.capitalight.co",
        "market_cap": "Small Cap"
    },
    "ICLTF": {
        "short_name": "GREENFIRST FOREST PRODUCTS INC",
        "long_name": "GreenFirst Forest Products Inc.",
        "summary": "GreenFirst Forest Products Inc. focuses on investments in the forest products industry in Canada. It owns a sawmill in Kenora. The company was formerly known as Itasca Capital Ltd. and changed its name to GreenFirst Forest Products Inc. in January 2021. GreenFirst Forest Products Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.gffp.ca",
        "market_cap": "Small Cap"
    },
    "IDK.CN": {
        "short_name": "ThreeDCap",
        "long_name": "ThreeD Capital Inc.",
        "summary": "ThreeD Capital Inc., formerly known as Brownstone Energy Inc., is a venture capital firm specializing in seed, early stage and growth capital opportunistic investments. The firm seeks to invest in technology; biotechnology; renewable technology, Nanotechnology, Electric Vehicles,Internet of things, electronic sports, junior resources with an emphasis on the precious-metal and battery-metal sectors; artificial intelligence with a focus on disruptive data science technologies, machine learning, and neuro networks; and blockchain sectors with a focus on blockchain assets. ThreeD Capital Inc. was founded in 1987 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 2L4",
        "website": "http://www.threedcapital.com",
        "market_cap": "Small Cap"
    },
    "IDKFF": {
        "short_name": "THREED CAPITAL INC",
        "long_name": "ThreeD Capital Inc.",
        "summary": "ThreeD Capital Inc., formerly known as Brownstone Energy Inc., is a venture capital firm specializing in seed, early stage and growth capital opportunistic investments. The firm seeks to invest in technology; biotechnology; renewable technology, Nanotechnology, Electric Vehicles,Internet of things, electronic sports, junior resources with an emphasis on the precious-metal and battery-metal sectors; artificial intelligence with a focus on disruptive data science technologies, machine learning, and neuro networks; and blockchain sectors with a focus on blockchain assets. ThreeD Capital Inc. was founded in 1987 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 2L4",
        "website": "http://www.threedcapital.com",
        "market_cap": "Small Cap"
    },
    "IGIFF": {
        "short_name": "IGM FINANCIAL INC",
        "long_name": "IGM Financial Inc.",
        "summary": "IGM Financial Inc. operates as a wealth and asset management company in Canada. It operates through Wealth Management, Asset Management, and Strategic Investments and Other segments. The company offers financial advisory services; IG Living Plan that provides financial planning services, such as investment vehicles, insurance products, mortgage and banking solutions, and charitable giving program; IG Wealth Management Advisor Portal, a customer relationship management platform; and IG Wealth Management's dealer platform, which provides increased automation and supports both MFDA and IIROC licensed advisors, as well as new products on its investment dealer platform. It also provides mutual funds; portfolios; IG Advisory Account, a fee-based account that enhances client experience by offering the ability to simplify and consolidate selected investments into a single account; iProfile Private portfolios, a portfolio management program for households with investments; iProfile Portfolios, a suite of four managed solutions; segregated funds; separately managed and fee-based brokerage accounts; insurance products; and securities services. In addition, the company offers management and related services; global private equity, private credit, and infrastructure investment solutions; and exchange traded funds. The company was incorporated in 1978 and is headquartered in Winnipeg, Canada. IGM Financial Inc. is a subsidiary of Power Financial Corporation.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "MB",
        "city": "Winnipeg",
        "zipcode": "R3B 3H5",
        "website": "http://www.igmfinancial.com",
        "market_cap": "Mid Cap"
    },
    "IGM.TO": {
        "short_name": "IGM FINANCIAL INC.",
        "long_name": "IGM Financial Inc.",
        "summary": "IGM Financial Inc. operates as a wealth and asset management company in Canada. It operates through Wealth Management, Asset Management, and Strategic Investments and Other segments. The company offers financial advisory services; IG Living Plan that provides financial planning services, such as investment vehicles, insurance products, mortgage and banking solutions, and charitable giving program; IG Wealth Management Advisor Portal, a customer relationship management platform; and IG Wealth Management's dealer platform, which provides increased automation and supports both MFDA and IIROC licensed advisors, as well as new products on its investment dealer platform. It also provides mutual funds; portfolios; IG Advisory Account, a fee-based account that enhances client experience by offering the ability to simplify and consolidate selected investments into a single account; iProfile Private portfolios, a portfolio management program for households with investments; iProfile Portfolios, a suite of four managed solutions; segregated funds; separately managed and fee-based brokerage accounts; insurance products; and securities services. In addition, the company offers management and related services; global private equity, private credit, and infrastructure investment solutions; and exchange traded funds. The company was incorporated in 1978 and is headquartered in Winnipeg, Canada. IGM Financial Inc. is a subsidiary of Power Financial Corporation.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "MB",
        "city": "Winnipeg",
        "zipcode": "R3B 3H5",
        "website": "http://www.igmfinancial.com",
        "market_cap": "Mid Cap"
    },
    "IMT.F": {
        "short_name": "GREENFIRST FOR.PROD.INC.",
        "long_name": "GreenFirst Forest Products Inc.",
        "summary": "GreenFirst Forest Products Inc. focuses on investments in the forest products industry in Canada. It owns a sawmill in Kenora. The company was formerly known as Itasca Capital Ltd. and changed its name to GreenFirst Forest Products Inc. in January 2021. GreenFirst Forest Products Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6B 0M3",
        "website": "http://www.gffp.ca",
        "market_cap": "Small Cap"
    },
    "L01.F": {
        "short_name": "LANEBURY GROWTH CAP.",
        "long_name": "Lanebury Growth Capital Ltd.",
        "summary": "Lanebury Growth Capital Ltd. operates as an investment company. It focuses on building a portfolio of investments in technology start-ups. The company was formerly known as NU2U Resources Corp. and changed its name to Lanebury Growth Capital Ltd. in April 2017. Lanebury Growth Capital Ltd. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": null,
        "market_cap": "Small Cap"
    },
    "L6V2.F": {
        "short_name": "GLOBAL CARE CAPITAL INC.",
        "long_name": "Global Care Capital Inc.",
        "summary": "Global Care Capital Inc., formerly known as, Resinco Capital Partners Inc., is a venture capital and a private equity firm specializing in investments in early stage companies, buyout, private and public or undervalued assets, and assists them in the going public process. The firm prefers to invest in acquisitions and provides mezzanine financing. It also provides consulting, corporate administration and finance, marketing, and investor relations services to the companies operating in the resource sector. The firm prefers to invest in healthcare, medical marijuana pharma sector, natural resource, exploration, and mining sector with a focus on hard rock minerals, precious metals, rare-earth minerals, oil, gas, water, and renewable energy markets. It prefer to have majority stake in companies. It generally exits by making portfolio companies go public. Global Care Capital Inc. was founded in September, 2005 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.globalcarecapital.com",
        "market_cap": "Small Cap"
    },
    "LBI.V": {
        "short_name": "LIONS BAY CAPITAL INC",
        "long_name": "Lions Bay Capital Inc.",
        "summary": "Lions Bay Capital Inc., an investment holding company, focuses on acquiring strategic stakes in companies operating in the resource, energy, and resource related technology sectors. The company is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3Z3",
        "website": "http://www.lionsbaycapital.com",
        "market_cap": "Small Cap"
    },
    "LBS.TO": {
        "short_name": "LIFE & BANC SPLIT CORP.",
        "long_name": "Life & Banc Split Corp.",
        "summary": "Life & Banc Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It seeks to invest in stocks of companies operating across banking and life insurance sector. The fund primarily invests in the stocks of the six largest banks of the country, as well as of life insurance companies, utilizing a split share structure on a low cost basis. It benchmarks the performance of its portfolio against the S&P/TSX Capped Financials Index and S&P/TSX Composite Index. Life & Banc Split Corp. was formed on September 6, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/lbs/overview",
        "market_cap": "Small Cap"
    },
    "LCS.TO": {
        "short_name": "BROMPTON LIFECO SPLIT CORP, CLA",
        "long_name": "Brompton Lifeco Split Corp.",
        "summary": "Brompton Lifeco Split Corp. is a close-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It invests in companies primarily engaged in the life insurance sector. The fund benchmarks the performance of its portfolio against the S&P/TSX Capped Financials Index and S&P/TSX Composite Index. Brompton Lifeco Split Corp. was formed on January 19, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/lcs/overview",
        "market_cap": "Small Cap"
    },
    "LFE.TO": {
        "short_name": "CANADIAN LIFE COMPANIES SPLIT C",
        "long_name": "Canadian Life Companies Split Corp.",
        "summary": "Canadian Life Companies Split Corp. is a closed-ended equity mutual fund launched and managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund seeks to invest in stocks of companies operating in the life insurance sector. It primarily invests in stocks of four publicly traded life insurance companies namely Great-West Lifeco Inc., Industrial Alliance Insurance and Financial Services Inc., Manulife Financial Corporation, and Sun Life Financial Inc. The fund employs fundamental analysis with a focus on such factors as a firm's earning history, relative price-earnings multiple, cash flow, dividend yield, market position, and growth prospects to create its portfolio. It benchmarks the performance of its portfolio against the S&P TSX Financial Index. Canadian Life Companies Split Corp. was formed on April 18, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/#!lifesplit-home/cuny",
        "market_cap": "Small Cap"
    },
    "LITT.V": {
        "short_name": "ROADMAN INVESTMENTS CORP",
        "long_name": "Roadman Investments Corp.",
        "summary": "Roadman Investments Corp. is a venture capital, private equity and advisory firm specializing in incubation, seed, start-ups, later stage, strategic advisory, global partnership development, breakthrough products, devices, treatments, health supplement, corporate restructuring, Corporate recapitalization and growth capital investments. It focuses on managing and facilitating foreign investment and investing in private and public companies whose businesses involve later-stage. The firm prefers to invest in health & wellness, agricultural, medicinal mushroom, media, retail, financial services, pharmaceutical products, nutrition, medicine, technology, healthcare, clean tech, energy, consumer product, and consumer services and identify an exit strategy in China or North America. The firm invests into companies across the Pan-Pacific region. It prefers to take majority stake in its portfolio companies. Roadman Investments Corp. is previously known as Urban Select Capital Corporation and formerly known as China Select Capital Partners Corp, was incorporated in September 12, 2007 and is based in Vancouver, Canada with an additional office in Beijing, China, Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.roadmancorp.com",
        "market_cap": "Small Cap"
    },
    "LLL.CN": {
        "short_name": "LaneburyGrowCap",
        "long_name": "Lanebury Growth Capital Ltd.",
        "summary": "Lanebury Growth Capital Ltd. operates as an investment company. It focuses on building a portfolio of investments in technology start-ups. The company was formerly known as NU2U Resources Corp. and changed its name to Lanebury Growth Capital Ltd. in April 2017. Lanebury Growth Capital Ltd. was incorporated in 2011 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": null,
        "market_cap": "Small Cap"
    },
    "LPC.V": {
        "short_name": "LORNE PARK CAPITAL PARTNERS INC",
        "long_name": "Lorne Park Capital Partners Inc.",
        "summary": "Lorne Park Capital Partners Inc., through with its subsidiaries, provides portfolio management services in Canada. It serves investors, estates, trusts, endowments, foundations, individuals, and institutional clients. The company was founded in 2013 and is based in Oakville, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Oakville",
        "zipcode": "L6J 7T5",
        "website": "http://www.lpcp.ca",
        "market_cap": "Small Cap"
    },
    "M.V": {
        "short_name": "MOSAIC CAPITAL CORPORATION",
        "long_name": "Mosaic Capital Corporation",
        "summary": "Mosaic Capital Corporation is a private equity firm specializing in acquisitions, growth capital, mature, buyouts, and middle market investments. It prefers to invest in consumer discretionary, consumer staples, energy, financials, healthcare, industrials, information technology, materials, telecommunication services, utilities sectors and infrastructure, distribution, construction, business services, oil and gas services, manufacturing and real estate industries. The firm seeks to invest in all sectors in Canada. It seeks to invest in companies with an annual cash flow of between $3 million and $15 million, revenues between $5 million and $50 million, and EBIDTA $2 million and $10 million. It seeks to make long term investments and also take majority stakes in its portfolio companies. Mosaic Capital Corporation was founded in May 2011 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2S 2T4",
        "website": "http://www.mosaiccapitalcorp.com",
        "market_cap": "Small Cap"
    },
    "MBN.TO": {
        "short_name": "MBN CORPORATION",
        "long_name": "MBN Corporation",
        "summary": "MBN Corporation is a closed-ended equity mutual fund launched by Middlefield Fund Management Limited. The fund is managed by Middlefield Capital Corporation and Groppe, Long & Littell. It invests in the public equity markets of Canada. The fund invests in stocks of companies operating across energy related sectors with a focus on oil sands sector. It benchmarks the performance of its portfolio against the S&P/TSX Composite Index. The fund was formerly known as OilSands Canada Corporation. It was formerly known as Middlefield Tactical Energy Corporation. MBN Corporation was formed on June 1, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1A6",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MDS-UN.TO": {
        "short_name": "HEALTHCARE SPECIAL OPP FUND",
        "long_name": "Healthcare Special Opportunities Fund",
        "summary": "Healthcare Special Opportunities Fund is a closed-ended balanced mutual fund launched and managed by LDIC Inc. The fund invests into public equity and fixed income developed markets. It seeks to invest in stocks of companies that are operating in medical and healthcare sectors. The fund primarily invests in growth stocks of companies having mid and small market capitalizations. It employs fundamental and quantitative analysis, with focus on top-down and bottom-up approach to create its portfolio. The fund benchmarks the performance of its portfolio against the MSCI World Healthcare Index. It emp[loys in-house research to manage its portfolio. Healthcare Special Opportunities Fund was formed on June 26, 2015 and is domiciled in the United States.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1E2",
        "website": "http://www.ldic.ca/healthcare-special-opportunities-fund",
        "market_cap": "Small Cap"
    },
    "MEDI.CN": {
        "short_name": "MyconicCap",
        "long_name": "Myconic Capital Corp.",
        "summary": "Myconic Capital Corp. intends to identify, evaluate, and acquire assets, properties or businesses with a view to completing a qualifying transaction. The company was formerly known as Auralite Investments Inc. and changed its name to Myconic Capital Corp. in July 2020. Myconic Capital Corp. was founded in 2017 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6J 1M7",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MEDV.NE": {
        "short_name": "MEDIVOLVE INC.",
        "long_name": "Medivolve Inc.",
        "summary": "Medivolve Inc. is a principal investment firm. It is a social-impact investment focused company Investing resources, funds and bandwidth for the betterment of the human condition through medical sciences, climate change and technology. The firm was formerly known as Continent Resources Inc. and changed its name to Copper One Inc. in October 2009. Copper One Inc. was incorporated in 2005 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NEO",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2M5",
        "website": "http://www.questcapinc.com",
        "market_cap": "Small Cap"
    },
    "MGHCF": {
        "short_name": "MINCO CAPITAL CORP",
        "long_name": "Minco Capital Corp.",
        "summary": "Minco Capital Corp. operates as an investment company. It invests in public and private companies and assets. The company was formerly known as Minco Gold Corporation and changed its name to Minco Capital Corp. in February 2019. Minco Capital Corp. was founded in 1982 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3R5",
        "website": "http://www.mincocapitalcorp.com",
        "market_cap": "Small Cap"
    },
    "MI5.F": {
        "short_name": "MINCO CAPITAL CORP.",
        "long_name": "Minco Capital Corp.",
        "summary": "Minco Capital Corp. operates as an investment company. It invests in public and private companies and assets. The company was formerly known as Minco Gold Corporation and changed its name to Minco Capital Corp. in February 2019. Minco Capital Corp. was founded in 1982 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3R5",
        "website": "http://www.mincocapitalcorp.com",
        "market_cap": "Small Cap"
    },
    "MKZ-UN.TO": {
        "short_name": "MACKENZIE MSTR UN",
        "long_name": "Mackenzie Master Limited Partnership",
        "summary": "Mackenzie Master Limited Partnership pays selling commissions to financial advisors who sell redemption charge securities of Mackenzie mutual funds for specific periods. MMLP GP Inc. serves as the general partner of Mackenzie Master Limited Partnership. Mackenzie Master Limited Partnership was founded in 1995 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5V 3K1",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MLC.NE": {
        "short_name": "MOUNT LOGAN CAPITAL INC.",
        "long_name": "Mount Logan Capital Inc.",
        "summary": "Mount Logan Capital Inc.is an investment firm primarily focused on investing in public and private debt securities. The Company holds and actively manages and monitors a seed portfolio of loans and other investments with credit-oriented characteristics. The company was formerly known as Marret Resource Corp. and changed its name to Mount Logan Capital Inc. in October 2018. Mount Logan Capital Inc. is based in New York, New York.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NEO",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2V1",
        "website": "http://www.mountlogancapital.ca",
        "market_cap": "Small Cap"
    },
    "MMM.V": {
        "short_name": "MINCO CAPITAL CORP",
        "long_name": "Minco Capital Corp.",
        "summary": "Minco Capital Corp. operates as an investment company. It invests in public and private companies and assets. The company was formerly known as Minco Gold Corporation and changed its name to Minco Capital Corp. in February 2019. Minco Capital Corp. was founded in 1982 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3R5",
        "website": "http://www.mincocapitalcorp.com",
        "market_cap": "Small Cap"
    },
    "MMP-UN.TO": {
        "short_name": "PRECIOUS METALS AND MINING TRUS",
        "long_name": "Precious Metals and Mining Trust",
        "summary": "Precious Metals and Mining Trust is a closed ended equity fund launched and managed CI Investments Inc. The fund invests in public equity markets of Canada. It invests in stocks of companies in Metals and Mining sector. The fund invests in value stocks of small capitalization companies. The fund employs fundamental analysis with top-down and bottom-up stock picking approach focusing on factors like use of computer based research incorporating and rating a number of factors including profitability, liquidity, operating and administrative costs, cash flow and management. Precious Metals and Mining Trust was formed on May 29, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 3G7",
        "website": "http://ci.com/en/funds/alternative_investments/PreciousMetalsandMiningTrust.html?currencySelector=1&seriesId=7537",
        "market_cap": "Small Cap"
    },
    "MNX.V": {
        "short_name": "MANITEX CAPITAL INC.",
        "long_name": "Manitex Capital Inc.",
        "summary": "Manitex Capital Inc. focuses on acquiring interests in life sciences, cleantech, and sustainable products/technologies companies. The company also holds a portfolio of marketable securities. The company is headquartered in Kirkland, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Kirkland",
        "zipcode": "H9H 4R9",
        "website": "http://www.manitexcapital.com",
        "market_cap": "Small Cap"
    },
    "NFD-A.V": {
        "short_name": "NORTHFIELD CAPITAL CORP., CL.A,",
        "long_name": "Northfield Capital Corporation",
        "summary": "Northfield Capital Corporation serves as an investment company that invests in companies operating in the glass, manufacturing, oil and gas, mining, and technology industries. Its subsidiaries manufacture insulating glass sealed units, aluminum, and indoor air filtration and purification units. The group also owns several holdings for exploration of oil and gas in major oil and gas producing regions in the United States and Canada. In addition, it involves in exploration for precious metals in Canada and Guyana. In the technology industry, Northfield Capital has investment in an applied research and technology company that develops and markets products for the global marine transportation community. It also holds interest in a company that provides educational software and distance learning solutions in the People's Republic of China. The company was formed and incorporated in 1981 under the name Puissance Resources Limited. It changed its name to Puissance Corporation in 1983 and to Northfield Capital Corporation in 1987. Northfield Capital is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3L5",
        "website": "http://www.northfieldcapital.com",
        "market_cap": "Small Cap"
    },
    "O49.F": {
        "short_name": "49 NORTH RESOURCES INC",
        "long_name": "49 North Resources Inc.",
        "summary": "49 North Resources Inc. is a venture capital firm specializing in seed capital and early stage investments. The firm typically invests in a diversified portfolio of common shares and other securities of resource issuers including all sectors of mineral exploration as well as oil and gas exploration and production around the globe. It focuses on resource issuers with exploration programs in Saskatchewan. The firm also seeks to co-invest. 49 North Resources Inc. was founded in 2005 and is based in Saskatoon, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "SK",
        "city": "Saskatoon",
        "zipcode": "S7K 5M5",
        "website": "http://www.fnr.ca",
        "market_cap": "Small Cap"
    },
    "OLY.TO": {
        "short_name": "OLYMPIA FINANCIAL GROUP INC",
        "long_name": "Olympia Financial Group Inc.",
        "summary": "Olympia Financial Group Inc., through its subsidiary Olympia Trust Company, operates as a non-deposit taking trust corporation in Canada. The company operates through Private Health Services Plan, Registered Plans, Currency and Global Payments, Corporate and Shareholder Services, and Exempt Edge divisions. The Private Health Services Plan division markets, sells, and administers health and dental benefits to business owners. The Registered Plans division administers self-directed registered plans. The Currency and Global Payments division provides personalized services, such as buying and selling foreign currencies for corporations and private clients. The Corporate and Shareholder Services division provides transfer agency and corporate trust services to public and private issuers. The Exempt Edge division focuses on the provision of information technology services to exempt market dealers, registrants, and issuers. Olympia Financial Group Inc. was incorporated in 1994 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2G 0P6",
        "website": "http://www.olympiafinancial.com",
        "market_cap": "Small Cap"
    },
    "ONE.F": {
        "short_name": "ONEX CORP. (SUB. VTG)",
        "long_name": "Onex Corporation",
        "summary": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; Boston, Massachusetts and London, United Kingdom.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.onex.com",
        "market_cap": "Mid Cap"
    },
    "ONEX.TO": {
        "short_name": "ONEX CORPORATION",
        "long_name": "Onex Corporation",
        "summary": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; Boston, Massachusetts and London, United Kingdom.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.onex.com",
        "market_cap": "Mid Cap"
    },
    "ONEXF": {
        "short_name": "ONEX CORP",
        "long_name": "Onex Corporation",
        "summary": "Onex Corporation is a private equity firm specializing in acquisitions and platform acquisitions. The firm makes investments in buyouts, large- middle market, large-cap, mid-cap, and small-cap market and distressed companies. It also invests in recapitalization, growth capital, corporate carve-outs of subsidiaries and mission-critical supply divisions from multinational corporations, operational restructurings of undervalued businesses, and builds up. The firm seeks to invest in technology, electronics manufacturing services, industrial, aerospace, healthcare, retail, restaurants, industrials products, customer care services, metal services, building products, entertainment, gaming, cabinetry products, commercial vehicles, commercial and investment banking, financial services, commercial and multi-unit residential real estate. It invests in global businesses headquartered in North America, including United States and Canada, or Europe. The firm seeks to invest between $125 million and $1 billion in companies that have minimum revenues of $300 million. It does not consider size if the company is in an industry in which the firm already has presence. The firm seeks to make direct as well as co-investments through managed private equity, real estate and credit funds. It seeks to acquire a control position in its portfolio companies. Onex Corporation was founded in 1984 and is based in Toronto, Canada with additional offices in New York, New York; Englewood Cliffs, New Jersey; Boston, Massachusetts and London, United Kingdom.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2S1",
        "website": "http://www.onex.com",
        "market_cap": "Mid Cap"
    },
    "OSP-PA.TO": {
        "short_name": "BROMPTON OIL SPLIT CORP PREFERR",
        "long_name": "Brompton Oil Split Corp.",
        "summary": "Brompton Oil Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in public equity markets of North America. It primarily invests in dividend paying stocks of large-cap companies having market capitalization of at least $2 billion. The fund invests in stocks of companies which are a constituent of the S&P 500 Index and S&P/TSX Composite Index. It invests in stocks of companies operating in the oil and gas sectors. Brompton Oil Split Corp. was formed on February 24, 2015 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/osp/overview",
        "market_cap": null
    },
    "OSP.TO": {
        "short_name": "BROMPTON OIL SPLIT CORP",
        "long_name": "Brompton Oil Split Corp.",
        "summary": "Brompton Oil Split Corp. is a closed-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in public equity markets of North America. It primarily invests in dividend paying stocks of large-cap companies having market capitalization of at least $2 billion. The fund invests in stocks of companies which are a constituent of the S&P 500 Index and S&P/TSX Composite Index. It invests in stocks of companies operating in the oil and gas sectors. Brompton Oil Split Corp. was formed on February 24, 2015 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/osp/overview",
        "market_cap": "Small Cap"
    },
    "P31Q.MU": {
        "short_name": "MOUNT LOGAN CAP. INC.",
        "long_name": "Mount Logan Capital Inc.",
        "summary": "Mount Logan Capital Inc.is an investment firm primarily focused on investing in public and private debt securities. The Company holds and actively manages and monitors a seed portfolio of loans and other investments with credit-oriented characteristics. The company was formerly known as Marret Resource Corp. and changed its name to Mount Logan Capital Inc. in October 2018. Mount Logan Capital Inc. is based in New York, New York.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 2V1",
        "website": "http://www.mountlogancapital.ca",
        "market_cap": "Small Cap"
    },
    "P6U1.F": {
        "short_name": "PLANET VENTURES",
        "long_name": "Planet Ventures Inc.",
        "summary": "Planet Ventures Inc. a venture capital firm specializing in early stage investments. The firm focuses on holding investments in the resource, biotechnology, and technology companies. The firm seeks to invest in disruptive and emerging growth companies and industries with focus on technology, blockchain, crypto-currencies, fantasy and sports betting markets. The company also focuses on investing in undervalued resource projects and companies in the precious metals, uranium and coal, oil and gas, base metals, potash, lithium, and rare earths sectors. The firm makes investment in both public or private companies in form of equity or debt respectively. The firm typically takes an active management role as part of its investment strategy by participating at the Board/Advisory levels. The company was formerly known as Planet Exploration Inc. and changed its name to Planet Mining Exploration Inc. in April 2012. Planet Ventures Inc. was founded in 1996 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://www.planetventuresinc.com",
        "market_cap": "Small Cap"
    },
    "PDH.V": {
        "short_name": "PREMIER DIVERSIFIED HOLDINGS IN",
        "long_name": "Premier Diversified Holdings Inc.",
        "summary": "Premier Diversified Holdings Inc. operates an online social platform in Canada. Its platform is used for volunteer management by organizations, and to find relevant volunteer opportunities by individuals. Premier Diversified Holdings Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2R1",
        "website": "http://www.pdh-inc.com",
        "market_cap": "Small Cap"
    },
    "PDV.TO": {
        "short_name": "PRIME DIVIDEND CORP. CL A",
        "long_name": "Prime Dividend Corp.",
        "summary": "Prime Dividend Corp. is an open ended equity mutual fund launched by Quadravest Inc. The fund is managed by Quadravest Capital Management Inc. It invests in public equity markets of Canada. The fund invests in stocks of companies across diversified sectors. Prime Dividend Corp. was formed on November 16, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.primedividend.com",
        "market_cap": "Small Cap"
    },
    "PNER.CN": {
        "short_name": "PioneerMedia",
        "long_name": "Pioneer Media Holdings Inc.",
        "summary": "Pioneer Media Holdings Inc. is a principle investment firm identifies and invests in securities of private and publicly listed entities that are involved in or connected with the eSports and mobile gaming industries. The company was formerly known as Haro Metals Corp. and changed its name to Pioneer Media Holdings Inc. in October 2019. Pioneer Media Holdings Inc. was incorporated in 2017 and headquartered in Vancouver, Canada with additional offices in Geneva, Switzerland and United States.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3R5",
        "website": "http://www.pioneermedia.co",
        "market_cap": null
    },
    "PNXPF": {
        "short_name": "PLANET VENTURES INC",
        "long_name": "Planet Ventures Inc.",
        "summary": "Planet Ventures Inc. a venture capital firm specializing in early stage investments. The firm focuses on holding investments in the resource, biotechnology, and technology companies. The firm seeks to invest in disruptive and emerging growth companies and industries with focus on technology, blockchain, crypto-currencies, fantasy and sports betting markets. The company also focuses on investing in undervalued resource projects and companies in the precious metals, uranium and coal, oil and gas, base metals, potash, lithium, and rare earths sectors. The firm makes investment in both public or private companies in form of equity or debt respectively. The firm typically takes an active management role as part of its investment strategy by participating at the Board/Advisory levels. The company was formerly known as Planet Exploration Inc. and changed its name to Planet Mining Exploration Inc. in April 2012. Planet Ventures Inc. was founded in 1996 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://www.planetventuresinc.com",
        "market_cap": "Small Cap"
    },
    "PPK.V": {
        "short_name": "PROSPECT PARK CAPITAL CORP",
        "long_name": "Prospect Park Capital Corp.",
        "summary": "Prospect Park Capital Corp., an investment company, focuses on public healthcare sector in Canada. The company was incorporated in 2012 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1E2",
        "website": null,
        "market_cap": "Small Cap"
    },
    "PRDGF": {
        "short_name": "PREMIER DIVERSIFIED HLDGS INC",
        "long_name": "Premier Diversified Holdings Inc.",
        "summary": "Premier Diversified Holdings Inc. operates an online social platform in Canada. Its platform is used for volunteer management by organizations, and to find relevant volunteer opportunities by individuals. Premier Diversified Holdings Inc. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 2R1",
        "website": "http://www.pdh-inc.com",
        "market_cap": "Small Cap"
    },
    "PRM.TO": {
        "short_name": "BIG PHARMA SPLIT CORP",
        "long_name": "Big Pharma Split Corp.",
        "summary": "Big Pharma Split Corp is a closed ended equity mutual fund launched and managed by Harvest Portfolios Group Inc. It invests in the public equity markets across United States. The fund primarily invests in the Pharmaceutical sector. Big Pharma Split Corp was formed on September 15, 2017 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Oakville",
        "zipcode": "L6j 4A5",
        "website": "http://www.harvestportfolios.com/closed-end-funds/big-pharma-split-corp/",
        "market_cap": "Small Cap"
    },
    "PTF.V": {
        "short_name": "PENDER GROWTH FUND INC",
        "long_name": "Pender Growth Fund Inc.",
        "summary": "Pender Growth Fund Inc. specializes in later stage, special situations, and restructuring investments. The fund also provides expansion capital and invests in small caps and Eligible Small Businesses (\"ESBs\"). It seeks to invest in illiquid public and private companies in information technology, communications, life sciences, and proprietary technologies sectors and undervalued technology companies. The fund targets companies based in British Columbia, Canada. It typically invests over Cdn $500,000 ($0.51) or invests between Cdn $1.5 million ($1.53 million) and Cdn $3 million ($3.06 million) in each portfolio company with revenues between Cdn $5 million ($5.10 million) and Cdn $15 million ($15.30 million). The fund prefers to invest in undervalued public companies.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3X2",
        "website": "http://www.pendergrowthfund.com",
        "market_cap": "Small Cap"
    },
    "PVF-UN.V": {
        "short_name": "PARTNERS VALUE INVESTMENTS  LP",
        "long_name": "Partners Value Investments LP",
        "summary": "Partners Value Investments LP operates as an investment holding company that engages in the securities and financing transactions in Toronto, Canada. The firm invests on a value basis in companies that can demonstrate an ability to produce consistent and durable cash flows and profits, in markets that are growing. It has a leveraged investment in Brascan Corporation. The company's operations are managed by Brascan Financial Corporation, a subsidiary of Brascan Corporation. It was formerly known as Partners Value Investments Inc. Partners Value Investments LP has its corporate office in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.pvii.ca",
        "market_cap": "Mid Cap"
    },
    "PVS-PE.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Toronto",
        "zipcode": "ON M5J 2T3",
        "website": "http://www.partnersvaluesplit.com",
        "market_cap": "Small Cap"
    },
    "PVS-PG.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Toronto",
        "zipcode": "ON M5J 2T3",
        "website": "http://www.partnersvaluesplit.com",
        "market_cap": "Small Cap"
    },
    "PVS-PH.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Toronto",
        "zipcode": "ON M5J 2T3",
        "website": "http://www.partnersvaluesplit.com",
        "market_cap": null
    },
    "PVS-PI.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Toronto",
        "zipcode": "ON M5J 2T3",
        "website": "http://www.partnersvaluesplit.com",
        "market_cap": null
    },
    "PVS-PJ.TO": {
        "short_name": "PARTNERS VALUE SPLIT CORP PREF ",
        "long_name": "Partners Value Split Corp.",
        "summary": "Partners Value Split Corp is a private fund launched and managed by Brookfield Investment Management (Canada) Inc. The investment portfolio comprises of Class A Limited voting shares of Brookfield Asset Management Inc. It was formerly known as BAM Split Corp. Partners Value Split Corp is based in Toronto, Ontario.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": "Toronto",
        "zipcode": "ON M5J 2T3",
        "website": "http://www.partnersvaluesplit.com",
        "market_cap": null
    },
    "PXI.V": {
        "short_name": "PLANET VENTURES INC",
        "long_name": "Planet Ventures Inc.",
        "summary": "Planet Ventures Inc. a venture capital firm specializing in early stage investments. The firm focuses on holding investments in the resource, biotechnology, and technology companies. The firm seeks to invest in disruptive and emerging growth companies and industries with focus on technology, blockchain, crypto-currencies, fantasy and sports betting markets. The company also focuses on investing in undervalued resource projects and companies in the precious metals, uranium and coal, oil and gas, base metals, potash, lithium, and rare earths sectors. The firm makes investment in both public or private companies in form of equity or debt respectively. The firm typically takes an active management role as part of its investment strategy by participating at the Board/Advisory levels. The company was formerly known as Planet Exploration Inc. and changed its name to Planet Mining Exploration Inc. in April 2012. Planet Ventures Inc. was founded in 1996 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T7",
        "website": "http://www.planetventuresinc.com",
        "market_cap": "Small Cap"
    },
    "QCA.CN": {
        "short_name": "QuinsamCap",
        "long_name": "Quinsam Capital Corporation",
        "summary": "Quinsam Capital Corporation operates as an investment and merchant banking firm in small-cap market in Canada. It primarily focuses on cannabis-related investments. The company's activities include acquisitions, advisory services, lending activities, and portfolio investments. Quinsam Capital Corporation was incorporated in 2004 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1H1",
        "website": "http://www.quinsamcapital.com",
        "market_cap": "Small Cap"
    },
    "QCAAF": {
        "short_name": "QUINSAM CAPITAL CORP",
        "long_name": "Quinsam Capital Corporation",
        "summary": "Quinsam Capital Corporation operates as an investment and merchant banking firm in small-cap market in Canada. It primarily focuses on cannabis-related investments. The company's activities include acquisitions, advisory services, lending activities, and portfolio investments. Quinsam Capital Corporation was incorporated in 2004 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1H1",
        "website": "http://www.quinsamcapital.com",
        "market_cap": "Small Cap"
    },
    "QLDN.F": {
        "short_name": "ELYSEE DEVELOPMENT",
        "long_name": "Elysee Development Corp.",
        "summary": "Elysee Development Corp. operates as an investment and venture capital firm that makes growth capital investments. The firm makes investments, with a focus on the natural resource sector. Its investment portfolio consists of equity investments in small and medium sized public companies, with a focus on precious and specialty metals; and investments in convertible debentures of mining companies. The company was formerly known as Alberta Star Development Corp. and changed its name to Elysee Development Corp. in July 2015. Elysee Development Corp. was incorporated in 1996 and is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3X2",
        "website": "http://www.elyseedevelopment.com",
        "market_cap": "Small Cap"
    },
    "RBN-UN.TO": {
        "short_name": "BLUE RIBBON INCOME FUND",
        "long_name": "Blue Ribbon Income Fund",
        "summary": "Blue Ribbon Income Fund is a closed-ended equity mutual fund launched and managed by Bloom Investment Counsel, Inc. The fund invests in public equity markets of Canada. It benchmarks the performance of its portfolio against the S&P/TSX Income Trust Index. The fund was formerly known as the Citadel Diversified Investment Trust. Blue Ribbon Income Fund was formed on September 16, 1997 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3S5",
        "website": "http://www.bromptongroup.com/funds/fund/rbn/overview",
        "market_cap": "Small Cap"
    },
    "REO.CN": {
        "short_name": "ReservoirCap",
        "long_name": "Reservoir Capital Corp.",
        "summary": "Reservoir Capital Corp. is a principal investment firm. The firm is focused on renewable energy and concentrates on operational power projects located in emerging markets. It prefers to hold a minority stake in its investments. Reservoir Capital Corp. was incorporated in 2006 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 2T5",
        "website": "http://www.reservoircapitalcorp.com",
        "market_cap": "Small Cap"
    },
    "RKS.CN": {
        "short_name": "RockshieldCap",
        "long_name": "Rockshield Capital Corp.",
        "summary": "Rockshield Capital Corp. is a venture capital firm specializing in early-stage, seed and emerging growth investments. The firm seeks to invest at various stages of development, including pre-initial public offering, and/or early stage companies requiring start-up or development capital. The firm seeks to invest in marketable securities comprising common shares and other equity instruments of companies in the mining, oil and gas, media technology, and medical technology industries that are listed on various Canadian stock exchanges or the OTCBB in the United States. It considers to invest over a number of sectors, including but not limited to: cannabis, fintech, healthcare, the resource sector, information and communications technology, and energy & clean technology. The firm seeks to invest between $0.25 million to $2 million. The firm is also involved in assisting financing, identifying acquisition targets, developing strategic plans, supporting operations, and implementing exit strategies. The firm also works with co-investors. It typically invests in Canada and the United States. Rockshield Capital Corp. was founded in 2007 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3V7",
        "website": "http://www.rockshield.ca",
        "market_cap": "Small Cap"
    },
    "RKSCF": {
        "short_name": "ROCKSHIELD CAPITAL CORP",
        "long_name": "Rockshield Capital Corp.",
        "summary": "Rockshield Capital Corp. is a venture capital firm specializing in early-stage, seed and emerging growth investments. The firm seeks to invest at various stages of development, including pre-initial public offering, and/or early stage companies requiring start-up or development capital. The firm seeks to invest in marketable securities comprising common shares and other equity instruments of companies in the mining, oil and gas, media technology, and medical technology industries that are listed on various Canadian stock exchanges or the OTCBB in the United States. It considers to invest over a number of sectors, including but not limited to: cannabis, fintech, healthcare, the resource sector, information and communications technology, and energy & clean technology. The firm seeks to invest between $0.25 million to $2 million. The firm is also involved in assisting financing, identifying acquisition targets, developing strategic plans, supporting operations, and implementing exit strategies. The firm also works with co-investors. It typically invests in Canada and the United States. Rockshield Capital Corp. was founded in 2007 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3V7",
        "website": "http://www.rockshield.ca",
        "market_cap": "Small Cap"
    },
    "RS.TO": {
        "short_name": "REAL ESTATE AND ECOMMERCE SPLIT",
        "long_name": "Real Estate & E-Comm Split Corp.",
        "summary": "Real Estate & E-Commerce Split Corp. is a balanced mutual fund launched by Middlefield Limited. The fund is managed by Middlefield Capital Corporation. Real Estate & E-Commerce Split Corp. Real Estate & E-Commerce Split Corp. was formed on October 7, 2020 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5X 1A6",
        "website": "http://www.middlefield.com/reecsc.htm",
        "market_cap": "Small Cap"
    },
    "RSCZF": {
        "short_name": "GLOBAL CARE CAPITAL INC",
        "long_name": "Global Care Capital Inc.",
        "summary": "Global Care Capital Inc., formerly known as, Resinco Capital Partners Inc., is a venture capital and a private equity firm specializing in investments in early stage companies, buyout, private and public or undervalued assets, and assists them in the going public process. The firm prefers to invest in acquisitions and provides mezzanine financing. It also provides consulting, corporate administration and finance, marketing, and investor relations services to the companies operating in the resource sector. The firm prefers to invest in healthcare, medical marijuana pharma sector, natural resource, exploration, and mining sector with a focus on hard rock minerals, precious metals, rare-earth minerals, oil, gas, water, and renewable energy markets. It prefer to have majority stake in companies. It generally exits by making portfolio companies go public. Global Care Capital Inc. was founded in September, 2005 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.globalcarecapital.com",
        "market_cap": "Small Cap"
    },
    "SBC.TO": {
        "short_name": "BROMPTON SPLIT BANC CORP., CL A",
        "long_name": "Brompton Split Banc Corp.",
        "summary": "Brompton Split Banc Corp. is a close-ended equity mutual fund launched and managed by Brompton Funds Limited. The fund invests in the public equity markets of Canada. It seeks to invest in stocks of companies primarily engaged in the banking sector. The fund benchmarks the performance of its portfolio against the S&P/TSX Capped Financials Index. Brompton Split Banc Corp. was formed on September 14, 2005 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2T3",
        "website": "http://www.bromptongroup.com/funds/fund/sbc/overview",
        "market_cap": "Small Cap"
    },
    "SBN.TO": {
        "short_name": "S SPLIT CORP., CL.A",
        "long_name": "Mulvihill S Split Corp.",
        "summary": "Mulvihill S Split Corp. is a closed ended equity mutual fund launched by Mulvihill Fund Services Inc. The fund is managed by Mulvihill Capital Management Inc. It invests in the public equity markets of Canada. The fund also invests some portion of its portfolio in derivative instruments. It invests in the stocks companies operating in financial sector. It invests in the stocks of The Bank of Nova Scotia. Mulvihill S Split Corp. was formed on January 26, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.mulvihill.com/sp_fundupdate.cfm?symbol=SBN_SBN.PR.A",
        "market_cap": "Small Cap"
    },
    "SEC.TO": {
        "short_name": "SENVEST CAPITAL",
        "long_name": "Senvest Capital Inc.",
        "summary": "Senvest Capital Inc., through its subsidiaries, holds investments in equity and real estate holdings primarily in the United States. It invests in derivative financial instruments consisting primarily of options and warrants to purchase or sell equities, equity indices and currencies, equity swaps, foreign currency forward contracts, and foreign currency futures contracts. The company also has investments as minority interests in private entities whose main assets are real estate properties; and real estate income trusts and partnerships. It also operates in Canada, European Union, Argentina, and internationally. The company was formerly known as Sensormatic Canada Limited and changed its name to Senvest Capital Inc. in April 1991. Senvest Capital Inc. was incorporated in 1968 and is headquartered in Montreal, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3G4",
        "website": "http://www.senvest.com",
        "market_cap": "Small Cap"
    },
    "SGE.V": {
        "short_name": "STRATEGEM CAPITAL CORP",
        "long_name": "Strategem Capital Corporation",
        "summary": "Strategem Capital Corporation, a merchant bank, invests in securities, mutual funds, government treasury issues, and real estate or other related opportunities in Canada. The company was formerly known as Dexton Technologies Corporation and changed its name to Strategem Capital Corporation in November 2001. Strategem Capital Corporation was incorporated in 1994 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4N7",
        "website": "http://www.strategemcapital.com",
        "market_cap": "Small Cap"
    },
    "SII": {
        "short_name": "Sprott Inc.",
        "long_name": "Sprott Inc.",
        "summary": "Sprott Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides asset management, portfolio management, wealth management, fund management, and administrative and consulting services to its clients. It offers mutual funds, hedge funds, and offshore funds, along with managed accounts. Further, the firm also provides broker-dealer activities. Sprott Inc. was formed on February 13, 2008 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2J1",
        "website": "http://www.sprott.com",
        "market_cap": "Small Cap"
    },
    "SII.TO": {
        "short_name": "SPROTT INC.",
        "long_name": "Sprott Inc.",
        "summary": "Sprott Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides asset management, portfolio management, wealth management, fund management, and administrative and consulting services to its clients. It offers mutual funds, hedge funds, and offshore funds, along with managed accounts. Further, the firm also provides broker-dealer activities. Sprott Inc. was formed on February 13, 2008 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 2J1",
        "website": "http://www.sprott.com",
        "market_cap": "Small Cap"
    },
    "SQG.V": {
        "short_name": "SPACKMAN EQUITIES GROUP INC",
        "long_name": "Spackman Equities Group Inc.",
        "summary": "Spackman Equities Group Inc., an investment holding company, invests into and develops in small/medium-sized growth companies in Asia. The company also engages in development, production, presentation, financing, and distribution of theatrical motion pictures and television dramas. In addition, it is involved in movie/drama equipment leasing business, event and branded content production, and talent management business. Further, the company invests in drama and movies; and provides consulting services for the production of Korean content. Additionally, it operates a cafÃ© lounge under the Upper West name in Gangnam district, Seoul; and owns a professional photography studio. The company was formerly known as Centiva Capital Inc. and changed its name to Spackman Equities Group Inc. in October 2011. Spackman Equities Group Inc. was founded in 2006 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3Y2",
        "website": "http://www.spackmanequitiesgroup.com",
        "market_cap": "Small Cap"
    },
    "SVCTF": {
        "short_name": "SENVEST CAPITAL INC",
        "long_name": "Senvest Capital Inc.",
        "summary": "Senvest Capital Inc., through its subsidiaries, holds investments in equity and real estate holdings primarily in the United States. It invests in derivative financial instruments consisting primarily of options and warrants to purchase or sell equities, equity indices and currencies, equity swaps, foreign currency forward contracts, and foreign currency futures contracts. The company also has investments as minority interests in private entities whose main assets are real estate properties; and real estate income trusts and partnerships. It also operates in Canada, European Union, Argentina, and internationally. The company was formerly known as Sensormatic Canada Limited and changed its name to Senvest Capital Inc. in April 1991. Senvest Capital Inc. was incorporated in 1968 and is headquartered in Montreal, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3G4",
        "website": "http://www.senvest.com",
        "market_cap": "Small Cap"
    },
    "TCA.V": {
        "short_name": "TIMIA CAPITAL CORP",
        "long_name": "TIMIA Capital Corp.",
        "summary": "TIMIA Capital Corp. provides short term and revenue finance loans to technology companies in Canada and the United States. It also manages a portfolio of equity investments. The company was formerly known as GreenAngel Energy Corp. and changed its name to TIMIA Capital Corp. in September 2015. TIMIA Capital Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.timiacapital.com",
        "market_cap": "Small Cap"
    },
    "TCC.CN": {
        "short_name": "Trenchant Cap",
        "long_name": "Trenchant Capital Corp.",
        "summary": "Trenchant Capital Corp. is a private equity and venture capital firm specializing in special situation debt financing in private equity companies. The firm seeks to invest in Canada. The company was formerly known as Echelon Petroleum Corp. and changed its name to Trenchant Capital Corp. in May 2017. Trenchant Capital Corp. was incorporated in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 3X1",
        "website": "http://www.trenchantcapital.net",
        "market_cap": "Small Cap"
    },
    "TIMCF": {
        "short_name": "TIMIA CAPITAL CORP",
        "long_name": "TIMIA Capital Corp.",
        "summary": "TIMIA Capital Corp. provides short term and revenue finance loans to technology companies in Canada and the United States. It also manages a portfolio of equity investments. The company was formerly known as GreenAngel Energy Corp. and changed its name to TIMIA Capital Corp. in September 2015. TIMIA Capital Corp. was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.timiacapital.com",
        "market_cap": "Small Cap"
    },
    "TLP-UN.CN": {
        "short_name": "TierOne Cap",
        "long_name": "Tier One Capital Limited Partnership",
        "summary": "Tier One Capital Limited Partnership is headquartered in Toronto, Ontario, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5C 2E3",
        "website": null,
        "market_cap": "Small Cap"
    },
    "TORR.V": {
        "short_name": "TORRENT CAPITAL LTD",
        "long_name": "Torrent Capital Ltd.",
        "summary": "Torrent Capital Ltd. focuses on investments in private and public company securities. It also provides merchant banking services to small scale companies, as well as advisory services for corporate finance and capital markets. The company was formerly known as Metallum Resources Inc. and changed its name to Torrent Capital Ltd. in February 2017. Torrent Capital Ltd. is based in Halifax, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "NS",
        "city": "Halifax",
        "zipcode": "B3J 3R7",
        "website": "http://torrentcapital.ca",
        "market_cap": "Small Cap"
    },
    "TRGCF": {
        "short_name": "TARGET CAPITAL INC",
        "long_name": "Target Capital Inc.",
        "summary": "Target Capital Inc. is a private equity and venture capital firm specializing in acquisitions, startups, early stage and buyout companies. It owns interests in future commissions on claims processed through the Olympia Trust Health Plan. It invests in listed public companies, trailer fee rights, notes receivable, reporting issuers, and controlled private companies. The firm also invests in land development corporations. It seeks to invest in medical and recreational cannabis industry, and in businesses offering from cultivators to ancillary supportive products and services. It prefers to invest in Canada, Europe and United States. It prefers to invest in companies that generate 10x ROI Within 3 Years. It prefers to take majority stake. It prefers to exit through acquisition. Target Capital Inc. was incorporated in 1993 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "AB",
        "city": "Calgary",
        "zipcode": "T2P 5C5",
        "website": "http://www.cbi2.com",
        "market_cap": "Small Cap"
    },
    "TXT-UN.TO": {
        "short_name": "TOP 10 SPLIT TRUST",
        "long_name": "Top 10 Split Trust",
        "summary": "Top 10 Split Trust is an equity mutual fund launched and managed by Strathbridge Asset Management Inc. It invests in public equity markets of Canada. The fund invests in the stocks of companies operating across the financial sector. It uses SSO covered call writing strategy to invest in the securities of 6 banks namely, Bank of Montreal, the Bank of Nova Scotia, Canadian Imperial Bank of Commerce, National Bank of Canada, Royal Bank of Canada, the Toronto-Dominion Bank and 4 insurance companies namely, Great-West Lifeco Inc., Industrial Alliance Insurance and Financial Services Inc., Manulife Financial Corporation, Sun Life Financial Inc. The fund seeks to benchmark the performance of its portfolio against the S&P/TSX Composite Index. The fund was formerly known as First Premium U.S. Income Trust. Top 10 Split Trust was formed on January 22, 1997 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": "http://www.strathbridge.com/overview.aspx?fund_id=9",
        "market_cap": "Small Cap"
    },
    "TZS.TO": {
        "short_name": "TREZ CAPITAL SENIOR MORTGAGE IN",
        "long_name": "Trez Capital Senior Mortgage Investment Corporation",
        "summary": "Trez Capital Senior Mortgage Investment Corporation is a fund of Trez Capital Limited Partnership.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6E 4E6",
        "website": "http://www.trezcapitalseniormic.com/",
        "market_cap": "Small Cap"
    },
    "UBAAF": {
        "short_name": "URBANA CORP",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.urbanacorp.com",
        "market_cap": "Small Cap"
    },
    "UNC.TO": {
        "short_name": "UNITED CORP LTD",
        "long_name": "United Corporations Limited",
        "summary": "United Corporations Limited is a closed ended equity fund launched and managed by Jarislowsky, Fraser Limited. It is co-managed by ValueInvest Asset Management S.A. It invests in the public equity markets of Canada. The fund also makes its investments in units of in Emerging Markets Investors Fund. It makes its investments in stocks of companies operating across diversified sectors. The fund benchmarks the performance of its portfolio against the S&P/TSX Composite Index, MSCI World Index, and S&P 500 Index. It was formerly known as Consolidated Investment Corporation of Canada. United Corporations Limited was formed on February 1, 1929 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 2R7",
        "website": "http://www.ucorp.ca/ucl_gi.htm",
        "market_cap": "Small Cap"
    },
    "URB-A.TO": {
        "short_name": "URBANA CORPORATION CL A",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.urbanacorp.com",
        "market_cap": "Small Cap"
    },
    "URB.TO": {
        "short_name": "URBANA CORPORATION",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.urbanacorp.com",
        "market_cap": "Small Cap"
    },
    "URNAF": {
        "short_name": "URBANA CORP",
        "long_name": "Urbana Corporation",
        "summary": "Urbana Corporation is an investment fund launched and managed by Caldwell Investment Management Ltd. For its equity investment the fund primarily invests in public equity markets of United States and Canada. The fund primarily focuses on U.S. financial companies and Canadian resource companies for equity investments. The fund also focuses on private equity investments. It was formerly known as Macho River Gold Mines Limited. Urbana Corporation is domiciled in Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 1J9",
        "website": "http://www.urbanacorp.com",
        "market_cap": "Small Cap"
    },
    "WE.V": {
        "short_name": "WECOMMERCE HOLDINGS LTD",
        "long_name": "WeCommerce Holdings Ltd.",
        "summary": "WeCommerce Holdings Ltd. is private equity and venture capital firm specializing in startups, and buyout. It operates as a holding company that owns a family of companies and brands in the Shopify partner ecosystem, including Pixel Union, Out of the Sandbox, Yopify, SuppleApps, Rehash, and Foursixty. WeCommerce Holdings Ltd. is based in Victoria, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": "http://www.wecommerce.co",
        "market_cap": "Small Cap"
    },
    "WECMF": {
        "short_name": "WECOMMERCE HOLDINGS LTD",
        "long_name": "WeCommerce Holdings Ltd.",
        "summary": "WeCommerce Holdings Ltd. is private equity and venture capital firm specializing in startups, and buyout. It operates as a holding company that owns a family of companies and brands in the Shopify partner ecosystem, including Pixel Union, Out of the Sandbox, Yopify, SuppleApps, Rehash, and Foursixty. WeCommerce Holdings Ltd. is based in Victoria, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": null,
        "city": null,
        "zipcode": null,
        "website": "http://www.wecommerce.co",
        "market_cap": "Small Cap"
    },
    "WED.V": {
        "short_name": "THE WESTAIM CORPORATION",
        "long_name": "The Westaim Corporation",
        "summary": "The Westaim Corporation is a private equity firm specializing in direct and indirect investments through acquisitions, joint ventures, secondary investments both direct and indirect, fund of fund investments, and other arrangements. For direct investments, the firm invests in early venture, mid venture, late venture, middle market, later stage, mature, emerging growth, PIPEs, and buyout transactions. For fund of fund investments, it seeks to invest in private equity funds, venture capital funds, and hedge funds. The firm seeks to provide long term capital to businesses operating in the global financial services industry. It typically acquires controlling interests in businesses. The firm seeks to acquire debt, equity, or derivative securities of both public and private companies. It invests with the objective of providing its shareholders with capital appreciation and real wealth preservation. The firm seeks to provide its portfolio companies with advisory services including, but not limited to, advice on capital allocation, financing strategy, performance measurement and merger and acquisition support. It also seeks to partner with like-minded providers of third party capital to help supplement the firm's own capital, when completing acquisitions. The firm generally seeks to hold its investments for seven to 15 years. The Westaim Corporation was founded in 1996 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 1S9",
        "website": "http://www.westaim.com",
        "market_cap": "Small Cap"
    },
    "WEDXF": {
        "short_name": "WESTAIM CORP",
        "long_name": "The Westaim Corporation",
        "summary": "The Westaim Corporation is a private equity firm specializing in direct and indirect investments through acquisitions, joint ventures, secondary investments both direct and indirect, fund of fund investments, and other arrangements. For direct investments, the firm invests in early venture, mid venture, late venture, middle market, later stage, mature, emerging growth, PIPEs, and buyout transactions. For fund of fund investments, it seeks to invest in private equity funds, venture capital funds, and hedge funds. The firm seeks to provide long term capital to businesses operating in the global financial services industry. It typically acquires controlling interests in businesses. The firm seeks to acquire debt, equity, or derivative securities of both public and private companies. It invests with the objective of providing its shareholders with capital appreciation and real wealth preservation. The firm seeks to provide its portfolio companies with advisory services including, but not limited to, advice on capital allocation, financing strategy, performance measurement and merger and acquisition support. It also seeks to partner with like-minded providers of third party capital to help supplement the firm's own capital, when completing acquisitions. The firm generally seeks to hold its investments for seven to 15 years. The Westaim Corporation was founded in 1996 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 1S9",
        "website": "http://www.westaim.com",
        "market_cap": "Small Cap"
    },
    "WEM1.F": {
        "short_name": "WESTAIM CORP.",
        "long_name": "The Westaim Corporation",
        "summary": "The Westaim Corporation is a private equity firm specializing in direct and indirect investments through acquisitions, joint ventures, secondary investments both direct and indirect, fund of fund investments, and other arrangements. For direct investments, the firm invests in early venture, mid venture, late venture, middle market, later stage, mature, emerging growth, PIPEs, and buyout transactions. For fund of fund investments, it seeks to invest in private equity funds, venture capital funds, and hedge funds. The firm seeks to provide long term capital to businesses operating in the global financial services industry. It typically acquires controlling interests in businesses. The firm seeks to acquire debt, equity, or derivative securities of both public and private companies. It invests with the objective of providing its shareholders with capital appreciation and real wealth preservation. The firm seeks to provide its portfolio companies with advisory services including, but not limited to, advice on capital allocation, financing strategy, performance measurement and merger and acquisition support. It also seeks to partner with like-minded providers of third party capital to help supplement the firm's own capital, when completing acquisitions. The firm generally seeks to hold its investments for seven to 15 years. The Westaim Corporation was founded in 1996 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5J 1S9",
        "website": "http://www.westaim.com",
        "market_cap": "Small Cap"
    },
    "WI.V": {
        "short_name": "THE WESTERN INVESTMENT CO OF CD",
        "long_name": "The Western Investment Company of Canada Limited",
        "summary": "The Western Investment Company of Canada Limited, through its subsidiaries, operates as an automotive glass service company in Canada. It provides repair and replacement of windshields, side windows, side mirrors, rear windows, and sun roofs; and wholesale of aftermarket glass parts and materials. The company also operates as a specialty retailer, which imports and sells household products through a marketing channel in North America; provides commercial and property insurance services; and produces and distributes butter and ice cream products through grocery retail and food service network in Western Canada, as well as through two distribution facilities in Edmonton and Kelowna. It serves dealerships, auto-body shops, fleet companies, and car rental companies through 10 retail locations, and mobile repair and installation units. The Western Investment Company of Canada Limited was founded in 2015 and is headquartered in High River, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "AB",
        "city": "High River",
        "zipcode": "T1V 2A7",
        "website": "http://www.winv.ca",
        "market_cap": "Small Cap"
    },
    "WP.V": {
        "short_name": "Western Pacific Trust Company",
        "long_name": "Western Pacific Trust Company",
        "summary": "Western Pacific Trust Company, a non-deposit-taking independent trust company, provides various financial services to corporations and individuals in Canada. The company offers self-administered tax-free savings accounts, self-administered registered retirement income funds, and self-administered locked-in retirement accounts; registered retirement savings plans and other self-administered accounts; and trust, accounting, administrative, corporate secretarial, and transfer and collateral agency services, as well as private health care plans for small business owners. Western Pacific Trust Company was incorporated in 1964 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.westernpacifictrust.com",
        "market_cap": "Small Cap"
    },
    "XTD.TO": {
        "short_name": "TDB SPLIT CORP., CLASS A SHARES",
        "long_name": "TDb Split Corp.",
        "summary": "TDb Split Corp. is a closed-ended equity mutual fund launched and managed by Quadravest Capital Management Inc. It invests in the public equity markets of Canada. The fund seeks to invest in the stocks of a company operating in the banking sector. It primarily invests in the common shares of Toronto-Dominion Bank. The fund benchmarks the performance of its portfolio against the S&P TSX Financial Index. TDb Split Corp. was formed on May 24, 2007 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/#!tdb-split-home/c1e63",
        "market_cap": "Small Cap"
    },
    "YCM.TO": {
        "short_name": "COMMERCE SPLIT CORP CAPITAL SHA",
        "long_name": "New Commerce Split Fund",
        "summary": "New Commerce Split Fund is an equity mutual fund launched and managed by Quadravest Capital Management Inc. The fund invests in the equity shares of Canadian Imperial Bank of Commerce. It was formerly known as Commerce Split Fund. New Commerce Split Fund was launched on November 27, 2006 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5K 1K7",
        "website": "http://www.quadravest.com/ycm-fund-features",
        "market_cap": "Small Cap"
    },
    "ZC.V": {
        "short_name": "ZIMTU CAPITAL CORP.",
        "long_name": "Zimtu Capital Corp.",
        "summary": "Zimtu Capital Corp. is a private equity and venture capital firm specializing in seed stage, early stage, acquisition, pre-IPO investments in private micro and small-cap resource companies. The firm invests in potash mineral properties. It prefers to invest in Western Canada. It also focuses on the exploration and development of tantalum and niobium deposits in Central British Columbia; and involves in the exploration and evaluation of gold deposits in South-Central Northwest territories. The projects are normally acquired on a 50-50% basis with geological and prospecting partners with proceeds from sales split the same. Zimtu Capital Corp. was founded on July 4, 2006 and is based in Vancouver, Canada with an additional office in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.zimtu.com",
        "market_cap": "Small Cap"
    },
    "ZCT1.F": {
        "short_name": "ZIMTU CAPITAL CORP.",
        "long_name": "Zimtu Capital Corp.",
        "summary": "Zimtu Capital Corp. is a private equity and venture capital firm specializing in seed stage, early stage, acquisition, pre-IPO investments in private micro and small-cap resource companies. The firm invests in potash mineral properties. It prefers to invest in Western Canada. It also focuses on the exploration and development of tantalum and niobium deposits in Central British Columbia; and involves in the exploration and evaluation of gold deposits in South-Central Northwest territories. The projects are normally acquired on a 50-50% basis with geological and prospecting partners with proceeds from sales split the same. Zimtu Capital Corp. was founded on July 4, 2006 and is based in Vancouver, Canada with an additional office in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "BC",
        "city": "Vancouver",
        "zipcode": "V6C 1H2",
        "website": "http://www.zimtu.com",
        "market_cap": "Small Cap"
    },
    "ZFS.F": {
        "short_name": "FIERA CAPITAL A SUBVTG",
        "long_name": "Fiera Capital Corporation",
        "summary": "Fiera Capital Corporation is an employee owned investment manager. The firm primarily provides its services to institutional investors, mutual funds, charitable organizations, and private clients. It manages separate client-focused equity, fixed income, and balanced portfolios. The firm also launches and manages equity, fixed income, and balanced mutual funds and income trusts for its clients. It invests in the public equity and fixed income markets across the globe with a focus on Canada. The firm primarily invests in growth and value stocks of small-cap companies. It also invests in G.A.R.P. and value stocks of large-cap companies. The firm also makes investments in income trusts and preferred shares. It also applies exclusions to be fossil fuel free, integrates environmental, social, and governance considerations, and applies an ethical filter while making its investments. The firm employs fundamental and quantitative analysis along with bottom-up stock picking approach to create its equity portfolios. It employs a top-down macro-economic research to make its fixed income investments. The firm also makes alternative investments, including the use of long/short equity strategy. It benchmarks the performance of its portfolio against the S&P/TSX Index, MSCI ACWI Index, S&P/TSX Composite FFF Index, and S&P 500 indices. The firm conducts in-house research to make its investments. It makes investments in social infrastructure with a focus on affordable housing and community health care facilities and also makes investment in solar and wind power generation, transport, and mid-market assets. It typically invests in Canada. It was formerly known as Fiera Sceptre Inc. Fiera Capital Corporation was founded in 2002 and is based in MontrÃ©al, Canada with an additional office in Toronto, Canada, Calgary, Canada, and Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3A 3M8",
        "website": "http://www.fieracapital.com",
        "market_cap": "Small Cap"
    }
}