{
    "AAC-P.V": {
        "short_name": "ANACOTT ACQUISITION CORPORATION",
        "long_name": "Anacott Acquisition Corporation",
        "summary": "Anacott Acquisition Corporation focuses on the identification and evaluation of assets or businesses with a view to completing a qualifying transaction. It primarily intends to pursue a qualifying transaction in the mining, technology, or industrial sectors. The company was incorporated in 2020 and is headquartered in Winnipeg, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Winnipeg"
    },
    "AF-P.V": {
        "short_name": "AF2 CAPITAL CORP",
        "long_name": "AF2 Capital Corp.",
        "summary": "AF2 Capital Corp. is a capital pool company. The company was incorporated in 2020 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "AIME-P.V": {
        "short_name": "AIM5 VENTURES INC",
        "long_name": "AIM5 Ventures Inc.",
        "summary": "AIM5 Ventures Inc. intends to identify and evaluate businesses and assets with a view to complete a qualifying transaction. The company was incorporated in 2020 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "AIV-P.V": {
        "short_name": "APOLO IV ACQUISITION CORP",
        "long_name": "Apolo IV Acquisition Corp.",
        "summary": "Apolo IV Acquisition Corp., a capital pool company, focuses on the identification and evaluation of assets or businesses with a view to complete a qualifying transaction. The company was incorporated in 2021 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "AMU-P.V": {
        "short_name": "AUMENTO CAPITAL VIII CORP",
        "long_name": "Aumento Capital VIII Corp.",
        "summary": "Aumento Capital VIII Corp. is a capital pool company engaged in identification and evaluation of assets or businesses with a view to complete a qualifying transaction. The company was incorporated in 2020 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "AROW-P.V": {
        "short_name": "FOUR ARROWS CAPITAL CORP",
        "long_name": "Four Arrows Capital Corp.",
        "summary": "Four Arrows Capital Corp. is a capital pool company. The company was incorporated in 2019 and is based in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "ASTN-P.V": {
        "short_name": "AUSTON CAPITAL CORP",
        "long_name": "Auston Capital Corp.",
        "summary": "Auston Capital Corp. does not have significant operations. It intends to identify, evaluate, and acquire assets, properties, or businesses with a view to complete a qualifying transaction. The company was incorporated in 2017 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "AVNY": {
        "short_name": "MANARIS 2010 CORP",
        "long_name": "Manaris (2010) Corp.",
        "summary": "Manaris (2010) Corp., through its subsidiaries, designs, manufactures, distributes, and markets optical components and modules for the telecommunications, fiber laser, and optical sensor markets. The company also provides instrumentation and integrated solutions for the monitoring of industrial processes and environmental surveillance applications for air, water, and soil. It sells its products in the Americas, Europe, and Asia. The company was formerly known as Avensys Corporation and changed its name to Manaris (2010) Corp. on Aug 23, 2010. Manaris (2010) Corp. was incorporated in 2000 and is based in Montreal, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "BAV-H.V": {
        "short_name": "BRAVERN VENTURES LTD",
        "long_name": "Bravern Ventures Ltd.",
        "summary": "Bravern Ventures Ltd. is in the process of liquidation of its remaining assets. Previously, it was engaged in harvesting hardwood timber through a timber license in Colombia. The company was formerly known as Prima Colombia Hardwood Inc. and changed its name to Bravern Ventures Ltd. in January 2015. Bravern Ventures Ltd. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BEN-H.V": {
        "short_name": "BUTTE ENERGY INC",
        "long_name": "Butte Energy Inc.",
        "summary": "Butte Energy Inc. does not have significant operations. Previously, it was engaged in the acquisition, exploration, and development of petroleum and natural gas reserves in Western Canada. The company was formerly known as Wavefire.com Inc. and changed its name to Butte Energy Inc. in June 2011. Butte Energy Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BRTA-H.V": {
        "short_name": "BERETTA VENTURES LTD",
        "long_name": "Beretta Ventures Ltd.",
        "summary": "Beretta Ventures Ltd. does not have significant operations. It intends to identify and evaluate assets or businesses with a view to complete a qualifying transaction. The company was formerly known as Folkstone Capital Corp. and changed its name to Beretta Ventures Ltd. in January 2021. Beretta Ventures Ltd. was incorporated in 2011 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "CBX-P.V": {
        "short_name": "CROSS BORDER CAPITAL INC",
        "long_name": "Cross Border Capital I Inc.",
        "summary": "Cross Border Capital I Inc. is a capital pool company. The company was incorporated in 2020 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "CCII-P.V": {
        "short_name": "CUSPIS CAPITAL II LTD",
        "long_name": "Cuspis Capital II Ltd.",
        "summary": "Cuspis Capital II Ltd. intends to identify, evaluate, and acquire assets, properties, or businesses or participation for a proposed qualifying transaction. The company was incorporated in 2019 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "CFI.V": {
        "short_name": "CALIFFI CAPITAL CORP",
        "long_name": "Califfi Capital Corp.",
        "summary": "Califfi Capital Corp. does not have significant operations. It intends to identify and evaluate assets or businesses with a view to complete a qualifying transaction. The company was incorporated in 2016 and is headquartered in North Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "CNGT": {
        "short_name": "CANNAGISTICS INC",
        "long_name": "Cannagistics Inc.",
        "summary": "Cannagistics Inc. engages in the e-commerce transportation and logistics business for third parties. The company provides less-than-truckload (LTL) and third-party logistics (3PL) carrier services, including regional, inter-regional, and national LTL and 3PL services. Its services include arranging for ground and air expedited transportation, and consumer household pickup and delivery. The company also offers value-added services, such as truckload brokerage, supply chain consulting and warehousing, and pick and ship services. The company was formerly known as Precious Investments, Inc. and changed its name to Cannagistics Inc. in May 2019. Cannagistics Inc. was founded in 2004 and is based in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "CSTL-P.V": {
        "short_name": "CASTLECAP CAPITAL INC",
        "long_name": "Castlecap Capital Inc.",
        "summary": "Castlecap Capital Inc. does not have significant operations. It intends to identify, evaluate, and negotiate assets or businesses for acquisition with a view to completing a qualifying transaction. The company was incorporated in 2018 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "CTWO-P.V": {
        "short_name": "COUNTY CAPITAL 2 LTD",
        "long_name": "County Capital 2 Ltd.",
        "summary": "County Capital 2 Ltd. intends to identify and evaluate businesses or assets with a view to complete the qualifying transaction. The company was incorporated in 2019 and is headquartered in Kelowna, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "DURO-P.V": {
        "short_name": "DURO METALS INC",
        "long_name": "Duro Metals Inc.",
        "summary": "Duro Metals Inc. focuses on the identification and evaluation of assets or businesses with a view to complete a qualifying transaction. It intends to pursue a qualifying transaction in the mining industry. Duro Metals Inc. was founded in 2018 and is headquartered in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "ERL-H.V": {
        "short_name": "EARL RESOURCES LIMITED",
        "long_name": "Earl Resources Limited",
        "summary": "Earl Resources Limited does not have significant operations. It is in the process of seeking business opportunities. The company was formerly known as Legion Resources Ltd and changed its name to Earl Resources Limited in July 1998. Earl Resources Limited was incorporated in 1963 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "EVCC": {
        "short_name": "ENVIRONMENTAL CONTROL CORPORATI",
        "long_name": "Environmental Control Corp.",
        "summary": "Environmental Control Corp. develops and sells emission control devices for small spark ignition combustion engines. The company offers catalytic muffler, which is used for reducing the emissions of spark ignition engines comprising personal transportation devices, off-road recreational vehicles, personal watercrafts, and water pumps. Its catalytic mufflers are also used in walk behind rotary mowers, rear engine riding mowers, front engine lawn tractors, riding garden tractors, walk-behind rotary tillers, snow throwers, commercial turf intermediate walk-behind rotary mowers, commercial turf riding rotary mowers, gasoline powered chainsaws, gasoline powered hand-held blowers, gasoline powered backpack blowers, gasoline powered trimmers/brush cutters, and gasoline powered hedge trimmers in the lawn and garden industry. The company focuses on the North American market targeting original engine manufacturers. Environmental Control Corp. was founded in 1999 and is based in St. John's, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "St Johns"
    },
    "FBR-H.V": {
        "short_name": "FIBRE-CROWN MANUFACTURING  INC.",
        "long_name": "Fibre-Crown Manufacturing Inc.",
        "summary": "Fibre-Crown Manufacturing Inc. does not have significant operations. It intends to identify and evaluate assets or businesses with a view to completing a qualifying transaction. Previously, the company was involved in developing and manufacturing architectural details, claddings, and moldings. Fibre-Crown Manufacturing Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GBLC.CN": {
        "short_name": "GraphBlockInc",
        "long_name": "Graph Blockchain Inc.",
        "summary": "Graph Blockchain Inc. does not have significant operations. Previously, the company was engaged in the development and implementation of private blockchain database management solutions. The company was formerly known as Reg Technologies Inc. and changed its name Graph Blockchain Inc. Graph Blockchain Inc. was founded in 1982 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GCA.CN": {
        "short_name": "GencanCapital",
        "long_name": "Gencan Capital Inc.",
        "summary": "Gencan Capital Inc. does not have significant operations. Previously, it was engaged in the solar energy generation business in Ontario, Canada. The company was formerly known as Genterra Energy Inc. and changed its name to Gencan Capital Inc. in August 2015. Gencan Capital Inc. was incorporated in 2013 and is headquartered in Toronto, Canada. Gencan Capital Inc. is a subsidiary of Genterra Capital Inc.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GCAP-P.V": {
        "short_name": "GERMINATE CAPITAL LTD",
        "long_name": "Germinate Capital Ltd.",
        "summary": "Germinate Capital Ltd. focuses on identifying and evaluating assets or businesses with a view to complete a qualifying transaction. The company was incorporated in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GIG-P.V": {
        "short_name": "XAU RESOURCES INC",
        "long_name": "XAU Resources Inc.",
        "summary": "XAU Resources Inc. does not have significant operations. It engages in identification and evaluation of assets or businesses of other organizations for completing a qualifying transaction to receive exchange approval. The company was founded in 2018 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GONE-P.V": {
        "short_name": "GRAVITAS ONE CAPITAL CORP",
        "long_name": "Gravitas One Capital Corp.",
        "summary": "Gravitas One Capital Corp. is a capital pool company. The company focuses on the identification and evaluation of assets or businesses with a view to completing a qualifying transaction. The company was incorporated in 2020 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GOP-H.V": {
        "short_name": "GOURMET OCEAN PRODUCTS INC",
        "long_name": "Gourmet Ocean Products Inc.",
        "summary": "Gourmet Ocean Products Inc. does not have significant operations. Previously, it was involved in the production of seed for scallop and sea cucumber for aquaculture farms. The company was also a buyer and exporter of sea cucumber. Gourmet Ocean Products Inc. was founded in 2007 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "GPCC-P.V": {
        "short_name": "GREEN PANDA CAPITAL CORP",
        "long_name": "Green Panda Capital Corp.",
        "summary": "Green Panda Capital Corp. does not have significant operations. It intends to identify and evaluate businesses and assets with a view to completing a qualifying transaction. The company was incorporated in 2018 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "GTD-H.V": {
        "short_name": "GSTAAD CAPITAL CORP",
        "long_name": "Gstaad Capital Corp.",
        "summary": "Gstaad Capital Corp. does not have significant operations. It focuses on identifying and evaluating assets or businesses with a view to complete a qualifying transaction. The company was incorporated in 2010 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GTGEF": {
        "short_name": "G2 TECHNOLOGIES CORP",
        "long_name": "G2 Technologies Corp.",
        "summary": "G2 Technologies Corp. does not have significant operations. It focuses on developing opportunities in clean tech and emerging technologies. The company was formerly known as Green 2 Blue Energy Corp. and changed its name to G2 Technologies Corp. in October 2020. G2 Technologies Corp. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "GTOO.CN": {
        "short_name": "G2TechCorp",
        "long_name": "G2 Technologies Corp.",
        "summary": "G2 Technologies Corp. does not have significant operations. It focuses on developing opportunities in clean tech and emerging technologies. The company was formerly known as Green 2 Blue Energy Corp. and changed its name to G2 Technologies Corp. in October 2020. G2 Technologies Corp. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "HMCC-P.V": {
        "short_name": "HIGH MOUNTAIN 2 CAPITAL CORPORA",
        "long_name": "High Mountain 2 Capital Corporation",
        "summary": "High Mountain 2 Capital Corporation does not have significant operations. It intends to identify and evaluate assets or businesses with a view to complete a qualifying transaction. The company was founded in 2020 and is based in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "IVF-H.V": {
        "short_name": "INVICTUS FINANCIAL INC",
        "long_name": "Invictus Financial Inc.",
        "summary": "Invictus Financial Inc. does not have significant operations. The company is seeking for new business opportunities. Previously, it was engaged in the provision of services related to the financial markets through the Internet or mobile devices. The company was formerly known as Stockhouse Inc. and changed its name to Invictus Financial Inc. in April 2010. Invictus Financial Inc. was incorporated in 1994 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "IVFZF": {
        "short_name": "INVICTUS FINANCIAL INC",
        "long_name": "Invictus Financial Inc.",
        "summary": "Invictus Financial Inc. does not have significant operations. The company is seeking for new business opportunities. Previously, it was engaged in the provision of services related to the financial markets through the Internet or mobile devices. The company was formerly known as Stockhouse Inc. and changed its name to Invictus Financial Inc. in April 2010. Invictus Financial Inc. was incorporated in 1994 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "JAB-P.V": {
        "short_name": "JABBO CAPITAL CORP",
        "long_name": "Jabbo Capital Corp.",
        "summary": "Jabbo Capital Corp. focuses on identification and evaluation of businesses or assets with a view to completing a qualifying transaction. The company was incorporated in 2020 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "JES-P.V": {
        "short_name": "JESMOND CAPITAL LTD",
        "long_name": "Jesmond Capital Ltd.",
        "summary": "Jesmond Capital Ltd. focuses on identifying and evaluating businesses and assets with a view to completing a qualifying transaction. The company was incorporated in 2020 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "JHC-H.V": {
        "short_name": "JINHUA CAPITAL CORP",
        "long_name": "Jinhua Capital Corporation",
        "summary": "Jinhua Capital Corporation does not have significant operations. It intends to identify and evaluate businesses or assets with a view to complete a qualifying transaction. The company was incorporated in 2009 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "JST-P.V": {
        "short_name": "JUSTIFY CAPITAL CORP",
        "long_name": "Justify Capital Corp.",
        "summary": "Justify Capital Corp. is a blank check company. The company was incorporated in 2020 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "KAC-P.V": {
        "short_name": "KALON ACQUISITION CORP",
        "long_name": "Kalon Acquisition Corp.",
        "summary": "Kalon Acquisition Corp. does not have significant operations. It focuses on identifying and evaluating assets or businesses with a view to completing a qualifying transaction. The company was incorporated in 2019 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "KUR-H.V": {
        "short_name": "KURE TECHNOLOGIES INC",
        "long_name": "Kure Technologies, Inc.",
        "summary": "Kure Technologies, Inc. does not have significant operations. Previously, the company, through its subsidiary, Look Communications Inc., provided digital television broadcasting services to residential and business subscribers. The company was formerly known as Unique Broadband Systems, Inc. and changed its name to Kure Technologies, Inc. in March 2017. Kure Technologies, Inc. was incorporated in 1998 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "LMSMF": {
        "short_name": "MACLOS CAPITAL INC",
        "long_name": "Maclos Capital Inc.",
        "summary": "Maclos Capital Inc. does not have significant operations. The company intends to identify and evaluate assets or businesses with a view to potentially acquiring them or acquiring an interest therein. Previously, it was involved in developing and commercializing software-based products to be used as decision support tools for obstetricians. The company was formerly known as LMS Medical Systems Inc. and changed its name to Maclos Capital Inc. in July 2012. Maclos Capital Inc. was founded in 1993 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "LRDR": {
        "short_name": "LAREDO RES CORP",
        "long_name": "Laredo Resources Corp.",
        "summary": "Laredo Resources Corp., an exploration stage company, acquires, explores, and develops mineral properties. It holds rights to purchase the Pony Mountain Gold property comprising approximately 4000-acre package of properties located in the Pony District in southwestern Montana. The company was founded in 2010 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "LRGR": {
        "short_name": "LUMINAR MEDIA GROUP INC",
        "long_name": "Luminar Media Group, Inc.",
        "summary": "Luminar Media Group, Inc., a development stage company, focuses on providing professional services to the music recording industry in the United States. It engages in the production of recordings; management of the manufacture of CDs and Internet uploading of music files; and management of the manufacture of promotional merchandise, such as T-shirts and caps. The company was formerly known as Golden Edge Entertainment, Inc. and change its name to Luminar Media Group, Inc. in August 2016. Luminar Media Group, Inc. was founded in 2010 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "LVCA": {
        "short_name": "LAKE VICTORIA MINING CO",
        "long_name": "Lake Victoria Mining Company, Inc.",
        "summary": "Lake Victoria Mining Company, Inc., an exploration stage company, engages in the acquisition, exploration, evaluation, and development of gold properties in Tanzania. It holds interests in 3 prospective gold projects with 1 mining license, 2 prospecting licenses, and 43 primary mining licenses covering 32.71 square kilometers located in Tanzania. The company was founded in 2006 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "MVD-H.V": {
        "short_name": "MEGA VIEW DIGITAL ENTERTAINMENT",
        "long_name": "Mega View Digital Entertainment Corp.",
        "summary": "Mega View Digital Entertainment Corp. does not have significant operations. Previously, the company was engaged in managing and operating digital cinemas in the Peoples' Republic of China. Mega View Digital Entertainment Corp. was incorporated in 2007 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "NAC-U.TO": {
        "short_name": "NEXTPOINT ACQUISITION CORP USD",
        "long_name": "NextPoint Acquisition Corp.",
        "summary": "NextPoint Acquisition Corp. intends to acquire businesses or assets through a merger, amalgamation, arrangement, share exchange, asset acquisition, share purchase, reorganization, or other similar business combination. The company was incorporated in 2020 and is headquartered in White Plains, New York.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "NACQF": {
        "short_name": "NEXTPOINT ACQUISITION CORP",
        "long_name": "NextPoint Acquisition Corp.",
        "summary": "NextPoint Acquisition Corp. intends to acquire businesses or assets through a merger, amalgamation, arrangement, share exchange, asset acquisition, share purchase, reorganization, or other similar business combination. The company was incorporated in 2020 and is headquartered in White Plains, New York.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PANO-P.V": {
        "short_name": "PANORAMA CAPITAL CORP",
        "long_name": "Panorama Capital Corp.",
        "summary": "Panorama Capital Corp. does not have significant operations. It intends to identify and evaluate businesses and assets with a view to complete a qualifying transaction. The company was incorporated in 2018 and is headquartered in Kelowna, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Kelowna"
    },
    "PEZM-H.V": {
        "short_name": "PEZM GOLD INC",
        "long_name": "PEZM Gold Inc.",
        "summary": "PEZM Gold Inc. does not have significant operations. The company is searching for new properties or business opportunities. Previously, it was engaged in the acquisition, exploration, and evaluation of mineral properties with a focus on iron formation-hosted gold deposits in Canada. The company was formerly known as Greenshield Explorations Limited and changed its name to PEZM Gold Inc. in September 2019. PEZM Gold Inc. was founded in 1978 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PGPXF": {
        "short_name": "PETROCORP GROUP INC",
        "long_name": "PetroCorp Group Inc.",
        "summary": "PetroCorp Group Inc. does not have significant operations. The company intends to identify, acquire, or merge with an operating company. Previously, it was involved in the electrical and instrumentation construction and maintenance, the provision of valve services, and electrical equipment manufacturing activities. The company was formerly known as PowerComm Inc. and changed its name to PetroCorp Group Inc. in December 2009. PetroCorp Group Inc. was incorporated in 1993 and is headquartered in Thornhill, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Thornhill"
    },
    "PINH-P.V": {
        "short_name": "PINEHURST CAPITAL II INC",
        "long_name": "Pinehurst Capital II Inc.",
        "summary": "Pinehurst Capital II Inc. intends to identify and evaluate businesses and assets with a view to complete a qualifying transaction. The company was incorporated in 2018 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PIV-P.V": {
        "short_name": "PIVOTAL FINANCIAL CORP",
        "long_name": "Pivotal Financial Corp.",
        "summary": "Pivotal Financial Corp. focuses on identifying and evaluating businesses and assets with a view to complete a qualifying transaction. The company was incorporated in 2020 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "POCC-P.V": {
        "short_name": "POCML 6 INC",
        "long_name": "POCML 6 Inc.",
        "summary": "POCML 6 Inc. intends to identify and evaluate businesses and assets with a view to complete the qualifying transaction. The company was incorporated in 2020 and is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PRKV": {
        "short_name": "PARKVIDA GROUP INC",
        "long_name": "ParkVida Group, Inc.",
        "summary": "ParkVida Group, Inc. operates the ParkVida resort in the Dominican Republic. The company was formerly known as Montana Mining Corp. and changed its name to ParkVida Group, Inc. in September 2011. ParkVida Group, Inc. was founded in 1999 and is based in Regina, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Regina"
    },
    "REGRF": {
        "short_name": "GRAPH BLOCKCHAIN INC",
        "long_name": "Graph Blockchain Inc.",
        "summary": "Graph Blockchain Inc. does not have significant operations. Previously, the company was engaged in the development and implementation of private blockchain database management solutions. The company was formerly known as Reg Technologies Inc. and changed its name Graph Blockchain Inc. Graph Blockchain Inc. was founded in 1982 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "RYSMF": {
        "short_name": "ROYAL STANDARD MINERALS INC",
        "long_name": "Royal Standard Minerals Inc.",
        "summary": "Royal Standard Minerals Inc. does not have significant operations. It intends to acquire or merge with assets or businesses with a view to maximizing value for shareholders. Previously, the company was engaged in the acquisition, exploration, and development of gold and precious metal properties in the United States. Royal Standard Minerals Inc. was incorporated in 1986 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SARG-P.V": {
        "short_name": "JESSY VENTURES CORP",
        "long_name": "Jessy Ventures Corp.",
        "summary": "Jessy Ventures Corp. does not have significant operations. It intends to identify and evaluate businesses and assets with a view to completing a qualifying transaction. The company was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "SBO-H.V": {
        "short_name": "SCHWABO CAPITAL CORP",
        "long_name": "Schwabo Capital Corporation",
        "summary": "Schwabo Capital Corporation does not have significant operations. It intends to identify and evaluate businesses or assets with a view to complete a qualifying transaction. The company was incorporated in 2007 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "SHRP.V": {
        "short_name": "SHERPA II HOLDINGS CORP",
        "long_name": "Sherpa II Holdings Corp.",
        "summary": "Sherpa II Holdings Corp. does not have significant operations. It intends to identify and evaluate businesses and assets with a view to complete a qualifying transaction. The company was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "SMAR-P.V": {
        "short_name": "SMARTSET SERVICES INC",
        "long_name": "Smartset Services Inc.",
        "summary": "Smartset Services Inc. does not have significant operations. It intends to identify and evaluate assets or businesses with a view to completing a qualifying transaction. The company was incorporated in 2013 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "STR-H.V": {
        "short_name": "SANTA ROSA RESOURCES CORP",
        "long_name": "Santa Rosa Resources Corp.",
        "summary": "Santa Rosa Resources Corp. does not have significant operations. The company is exploring potential business opportunities in various markets. Previously, it was engaged in the provision of billing, payments processing, call center, and ISP services. The company was formerly known as Monexa Technologies Corp. and changed its name to Santa Rosa Resources Corp. in March 2012. Santa Rosa Resources Corp. was incorporated in 1989 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "TCAP-P.V": {
        "short_name": "TRI CAPITAL OPPORTUNITIES CORP",
        "long_name": "Tri Capital Opportunities Corp.",
        "summary": "Tri Capital Opportunities Corp. does not have significant operations. It intends to identify and evaluate businesses and assets with a view to complete a qualifying transaction. The company was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "THP.V": {
        "short_name": "TOTALLY HIP TECHNOLOGIES INC",
        "long_name": "Totally Hip Technologies Inc.",
        "summary": "Totally Hip Technologies Inc. does not have significant operations. The company is seeking new business opportunities. Previously, it was engaged in the development of convergent media technologies. The company was founded in 1995 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "TIP-H.V": {
        "short_name": "TYNER RESOURCES LTD",
        "long_name": "Tyner Resources Ltd.",
        "summary": "Tyner Resources Ltd. does not have significant operations. It intends to acquire an oil and gas project. The company is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "USHA.V": {
        "short_name": "USHA RESOURCES LTD",
        "long_name": "Usha Resources Ltd.",
        "summary": "Usha Resources Ltd. engages in the exploration and evaluation of mineral properties. It also has an option to acquire 100% interest in 133 mineral claims. Usha Resources Ltd. was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "USHAF": {
        "short_name": "USHA RESOURCES LTD",
        "long_name": "Usha Resources Ltd.",
        "summary": "Usha Resources Ltd. engages in the exploration and evaluation of mineral properties. It also has an option to acquire 100% interest in 133 mineral claims. Usha Resources Ltd. was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "VMH-U.TO": {
        "short_name": "VM HOTEL ACQUISITION CORP CLS A",
        "long_name": "VM Hotel Acquisition Corp.",
        "summary": "VM Hotel Acquisition Corp., a special purpose acquisition corporation, focuses on effecting, directly or indirectly, an acquisition of one or more businesses or assets, by way of a merger, amalgamation, arrangement, share exchange, asset acquisition, share purchase, reorganization, or any other similar business. The company was incorporated in 2020 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "VYC-H.V": {
        "short_name": "VANITY CAPITAL INC",
        "long_name": "Vanity Capital Inc.",
        "summary": "Vanity Capital Inc. does not have significant operations. Previously, the company was involved in the acquisition, exploration, and evaluation of mineral properties. It focuses on identifying and evaluating new potential assets or business for acquisition. Vanity Capital Inc. was incorporated in 2008 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "WT-H.V": {
        "short_name": "WANGTON CAPITAL CORP",
        "long_name": "Wangton Capital Corp.",
        "summary": "Wangton Capital Corp. does not have significant operations. It intends to identify and evaluate assets or businesses with a view to complete a qualifying transaction. The company was incorporated in 2010 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "XCAP-P.V": {
        "short_name": "EXELERATE CAPITAL CORP",
        "long_name": "Exelerate Capital Corp.",
        "summary": "Exelerate Capital Corp. does not have significant operations. It intends to identify and evaluate businesses or assets with a view to completing a qualifying transaction. The company was formerly known as Exelerate Health Inc. and changed its name to Exelerate Capital Corp. in February 2019. Exelerate Capital Corp. was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "XYZ-P.V": {
        "short_name": "FIRST LIGHT CAPITAL CORP",
        "long_name": "First Light Capital Corp",
        "summary": "First Light Capital Corp. does not have significant operations. It intends to identify and evaluate businesses or assets with a view to completing a qualifying transaction. The company was incorporated in 2018 and is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ZKL-H.V": {
        "short_name": "CHINA KELI ELECTRIC COMPANY LTD",
        "long_name": "China Keli Electric Company Ltd.",
        "summary": "China Keli Electric Company Ltd. does not have significant operations. Previously, it was engaged in the manufacture and installation of electrical components and equipment in the People's Republic of China. The company is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ZZE-H.V": {
        "short_name": "ZIDANE CAPITAL CORP",
        "long_name": "Zidane Capital Corp.",
        "summary": "Zidane Capital Corp. does not have significant operations. It focuses on the identification and evaluation of companies, businesses, assets, or properties to complete a qualifying transaction. The company was incorporated in 2010 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    }
}