{
    "DAVAN.MX": {
        "short_name": "ENDAVA PLC",
        "long_name": "Endava plc",
        "summary": "Endava plc provides technology services for clients in the consumer products, healthcare, logistics, and retail verticals in Europe, Latin America, and North America. It offers technology and digital advisory services for financial services, healthcare, manufacturing, retail and consumer, business and support services, and TMT sectors; IT strategies; business analysis services in payments, financial services, asset and wealth management, insurance, telecommunications, and digital media areas; program management services; digital product strategy services; and architecture, extended reality, machine learning and artificial intelligence, product design, and user experience and visual design services. The company also engages in the identifying, defining, and embedding collaborative data and analytics; and provision of automated testing, cloud native software engineering, continuous delivery, distributed agile delivery, intelligent automation, secure development, agile applications management, cloud infrastructure, DevSecOps, service delivery, smart desk, and telemetry and monitoring services. The company was founded in 2000 and is headquartered in London, United Kingdom.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "EC2N 1AR",
        "website": "http://www.endava.com",
        "market_cap": "Mid Cap"
    },
    "MFGPN.MX": {
        "short_name": "MICRO FOCUS INTERNATIONAL PLC",
        "long_name": "Micro Focus International plc",
        "summary": "Micro Focus International plc engages in the enterprise software business in the United Kingdom, the United States, Germany, Canada, France, Japan, and internationally. The company offers infrastructure software products that are managed on a portfolio. Its product portfolio includes application modernization and connectivity, application delivery management, IT operations management, security and information management, and governance. Micro Focus International plc was founded in 1976 and is headquartered in Newbury, the United Kingdom.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Newbury",
        "zipcode": "RG14 1QN",
        "website": "http://www.microfocus.com",
        "market_cap": "Mid Cap"
    }
}