{
    "FA9.F": {
        "short_name": "SPECTRIS PLC  LS-,05",
        "long_name": "Spectris plc",
        "summary": "Spectris plc manufactures and sells measuring instruments and controls worldwide. The company provides products and services, which enable customers to determine structure, composition, quantity, and quality of particles and materials during their research and product development processes, when assessing materials before production, or during the manufacturing process; various range of life science services; products for measurement and control of temperature, humidity, pressure, strain, force, flow, level, pH, and conductivity; and data acquisition, electric heating, and custom-engineered products. It also supplies test, measurement, and analysis equipment, software, and services for product design optimization and manufacturing control; and designs and manufactures tooling and monitoring system for installation and acquisition services, data processing services, 24/7 monitoring, and advanced analytics consulting. In addition, the company offers various industrial automation products, including IIoT controllers and gateways, data acquisition and protocol converters, human machine interface operator displays and panel meters, visualisation software products, proportionalÂ\u0096integralÂ\u0096derivative controllers, remote terminal units, input/output products, and signal conditioners and sensors; and industrial networking products, which include ethernet switches, wired and wireless routers, and network and device management software products. Further, it provides on-line and off-line measurement and control solutions for the dimensional monitoring of diameter, ovality, wall thickness, eccentricity, length and speed, and other parameters; particle measuring systems; and supplies gas analysis solutions and various related product and services. The company was formerly known as Fairey Aviation Company Ltd. and changed its name to Spectris plc in May 2001. Spectris plc was founded in 1915 and is headquartered in Egham, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Egham",
        "zipcode": "TW20 9QD",
        "website": "http://www.spectris.com",
        "market_cap": "Mid Cap"
    },
    "JDG.L": {
        "short_name": "JUDGES SCIENTIFIC PLC ORD 5P",
        "long_name": "Judges Scientific plc",
        "summary": "Judges Scientific plc manufactures and sells scientific instruments. The company operates in two segments, Materials Sciences and Vacuum. It offers engineering teaching and research equipment for universities, colleges, schools, and research centers; and research and development systems for food, beverage, dairy, edible oil, and pharmaceutical industries. The company also provides LED illumination systems for bioscience and clinical microscopy; tensile testing, motion control, and specimen cooling for microscopy applications; automated measurement systems for a range of fibers; edge-welded metal bellows; and fire testing instruments, such as cone calorimeters, large scale calorimeters, NBS smoke chambers and oxygen index test, and related fire testing instruments. In addition, it offers equipment and software used for the computer-controlled testing of soils and rocks; open flow cryocoolers for the X-ray diffraction market; crycoolers for cooling applications, such as radio astronomy; test equipment for the characterization of optical fibers; scientific instruments primarily used for electron microscopy sample preparation; scientific equipment used by electrophysiology and imaging researchers; and gas purifiers for use in metal analysis. Further, the company provides sample heating and manipulation products for use in vacuum markets for materials research and production; and sheet metalwork services, including components and casting, fabrication, bespoke engineering solutions, as well as laser cutting and CNC machining services. The company operates in the United Kingdom, rest of Europe, North America, China, and internationally. Judges Scientific plc was incorporated in 2002 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "SE1 1XN",
        "website": "http://www.judges.uk.com",
        "market_cap": null
    },
    "MSYS.L": {
        "short_name": "MICROSAIC SYSTEMS PLC ORD 0.01P",
        "long_name": "Microsaic Systems plc",
        "summary": "Microsaic Systems plc engages in the research, development, and commercialization of miniaturised mass spectrometry (MS) instruments in the United Kingdom and internationally. It develops and markets chip-based MS instruments based on micro-electro-mechanical systems technology. The company offers MiD platform solutions, including 4500 MiD for use in pharmaceutical and biopharmaceutical applications; MiDas Automated Sampling interface that allows automated sampling, dilution, and injection for direct MS analysis; MiD Protein ID, a miniaturised mass spectrometer; and Masscape, an open-access software for sample method and data analysis. Its products has applications in LCMS, reaction monitoring, TLC-MS, process analytical technology, mass-directed purification, and liquid chromatography. The company also provides support services and training programs, as well as sells its products through OEMs and distributors. Microsaic Systems plc was incorporated in 1998 and is headquartered in Woking, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Woking",
        "zipcode": "GU21 5BX",
        "website": "http://www.microsaic.com",
        "market_cap": null
    },
    "OTAQ.L": {
        "short_name": "OTAQ PLC ORD 15P",
        "long_name": "OTAQ plc",
        "summary": "OTAQ plc, together with its subsidiaries, develops, provides, and supports technologies used in the aquaculture and offshore oil and gas industries in the United Kingdom, Chile, the Middle East, rest of Europe, and North America. It rents acoustic systems that are designed to deter seals and sea lions from attacking fish farms, and underwater measurement and leak detection devices; and manufacture and supplies underwater communication and other marine goods. The company also provides fish farm security products. OTAQ plc is headquartered in Lancaster, United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Lancaster",
        "zipcode": "LA1 4XF",
        "website": "http://otaq.com",
        "market_cap": null
    },
    "PIP.L": {
        "short_name": "PIPEHAWK PLC ORD 1P",
        "long_name": "PipeHawk plc",
        "summary": "PipeHawk plc engages in the development, assembly, and sale of test system solutions and ground probing radar (GPR) equipment primarily for civil engineering and land mine detection applications in Europe and internationally. It operates through Utility Detection and Mapping Services; Development, Assembly, and Sale of GPR Equipment; and Automation and Test System Solutions segments. The company offers service avoidance, utility mapping, and reinstatement measurement solutions, as well as accessories; provides GPR based services; and undertakes complementary research and development assignments. It also provides utility detection and mapping solutions; solutions and services for electronic system design and manufacture, test equipment, transfer systems, and automation and assembly solutions to the automotive, aerospace, rail, and other related industries; and turnkey solutions for automated assembly process. In addition, the company produces machines, attachments, and tools for railway track renewal and maintenance; manufactures and provides service for specialist equipment to test the skid resistance characteristics of vehicle and pedestrian surfaces; and offers specialist surveying services. PipeHawk plc was incorporated in 2000 and is based in Aldershot, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Aldershot",
        "zipcode": "GU12 4NZ",
        "website": "http://www.pipehawk.com",
        "market_cap": null
    },
    "QTX.L": {
        "short_name": "QUARTIX HOLDINGS PLC ORD 1P",
        "long_name": "Quartix Technologies Plc",
        "summary": "Quartix Holdings plc engages in the design, development, marketing, and delivery of vehicle telematics services in the United Kingdom, France, the United States, and the European Territories. The company operates in two segment, Total Fleet and Insurance. It offers vehicle tracking system for businesses, such as real-time vehicle tracking; driver timesheet report; driver behavior report; vehicle tracking reports and dashboards; vehicle tracking alerts; customized tracking; and fleet management solutions and services. The company offers its products primarily to building and construction, trades and field services, transportation, security, and distribution industries. Quartix Holdings plc was founded in 2001 and is based in Cambridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cambridge",
        "zipcode": "CB5 8DZ",
        "website": "http://www.quartix.com",
        "market_cap": null
    },
    "REW.F": {
        "short_name": "RENISHAW PLC  LS-,20",
        "long_name": "Renishaw plc",
        "summary": "Renishaw plc, an engineering and scientific technology company, designs, manufactures, distributes, sells, and services metrology and healthcare products worldwide. The company offers co-ordinate measuring machine (CMM) products, machine tool probe systems, styli for probe systems, performance measurement systems, gauging systems, fixtures, and position encoders; additive manufacturing systems; plastics vacuum casting machines; and mapping sensors. It also provides healthcare products, such as craniomaxillofacial custom-made implants, dental scanners, dental computer-aided design software, neurosurgical robots and accessories, neurosurgical planning software, neurosurgical implants, drug delivery systems, Raman microscopes, analysers, and hybrid Raman systems. In addition, the company offers travel agency services. It serves the aerospace, agriculture, automotive, construction, consumer products, healthcare, power generation, resource exploration, electronics, heavy, precision manufacturing, and medical industries, as well as scientific, research, and analysis industries. The company was founded in 1973 and is headquartered in Wotton-under-Edge, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Wotton-under-Edge",
        "zipcode": "GL12 8JR",
        "website": "http://www.renishaw.com",
        "market_cap": "Mid Cap"
    },
    "RMS.L": {
        "short_name": "REMOTE MONITORED SYSTEMS PLC OR",
        "long_name": "Remote Monitored Systems plc",
        "summary": "Remote Monitored Systems plc, together with its subsidiaries, engages in the provision of developing and manufacturing digital monitoring and safeguarding systems for rotating shafts in the United Kingdom and rest of Europe. It also offers security and risk management consultancy, and related software and services. The company was formerly known as Strat Aero Plc and changed its name to Remote Monitored Systems plc in September 2018. Remote Monitored Systems plc was incorporated in 2014 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1W 8DH",
        "website": "http://www.remotemonitoredsystems.com",
        "market_cap": null
    },
    "RNSHF": {
        "short_name": "RENISHAW",
        "long_name": "Renishaw plc",
        "summary": "Renishaw plc, an engineering and scientific technology company, designs, manufactures, distributes, sells, and services metrology and healthcare products worldwide. The company offers co-ordinate measuring machine (CMM) products, machine tool probe systems, styli for probe systems, performance measurement systems, gauging systems, fixtures, and position encoders; additive manufacturing systems; plastics vacuum casting machines; and mapping sensors. It also provides healthcare products, such as craniomaxillofacial custom-made implants, dental scanners, dental computer-aided design software, neurosurgical robots and accessories, neurosurgical planning software, neurosurgical implants, drug delivery systems, Raman microscopes, analysers, and hybrid Raman systems. In addition, the company offers travel agency services. It serves the aerospace, agriculture, automotive, construction, consumer products, healthcare, power generation, resource exploration, electronics, heavy, precision manufacturing, and medical industries, as well as scientific, research, and analysis industries. The company was founded in 1973 and is headquartered in Wotton-under-Edge, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Wotton-under-Edge",
        "zipcode": "GL12 8JR",
        "website": "http://www.renishaw.com",
        "market_cap": "Mid Cap"
    },
    "RSW.L": {
        "short_name": "RENISHAW PLC ORD 20P",
        "long_name": "Renishaw plc",
        "summary": "Renishaw plc, an engineering and scientific technology company, designs, manufactures, distributes, sells, and services metrology and healthcare products worldwide. The company offers co-ordinate measuring machine (CMM) products, machine tool probe systems, styli for probe systems, performance measurement systems, gauging systems, fixtures, and position encoders; additive manufacturing systems; plastics vacuum casting machines; and mapping sensors. It also provides healthcare products, such as craniomaxillofacial custom-made implants, dental scanners, dental computer-aided design software, neurosurgical robots and accessories, neurosurgical planning software, neurosurgical implants, drug delivery systems, Raman microscopes, analysers, and hybrid Raman systems. In addition, the company offers travel agency services. It serves the aerospace, agriculture, automotive, construction, consumer products, healthcare, power generation, resource exploration, electronics, heavy, precision manufacturing, and medical industries, as well as scientific, research, and analysis industries. The company was founded in 1973 and is headquartered in Wotton-under-Edge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Wotton-under-Edge",
        "zipcode": "GL12 8JR",
        "website": "http://www.renishaw.com",
        "market_cap": null
    },
    "SD0.F": {
        "short_name": "SDI GROUP PLC  LS -,01",
        "long_name": "SDI Group plc",
        "summary": "SDI Group plc, through its subsidiaries, designs and manufactures scientific and technology products based on digital imaging in the United Kingdom, rest of Europe, the United States, Asia, and internationally. The company offers sensitive cameras for life science and industrial applications under the Atik Camera brand name; cameras for art conservation Opus Instruments brand name; and cameras that have applications in astronomy, life sciences, and flat panel inspection under the Quantum Scientific Imaging brand name. It also designs and manufactures precision re-circulating chillers, coolers, and heat exchangers to control the thermal environment within life science and analytical systems; and supplies chemical dosing and control systems to the manufacturers of beverage cans. In addition, the company offers off-the-shelf and custom-made electrochemical sensors for water based applications under the Sentek name; systems and software for automated gel-based DNA and protein fluorescence/chemiluminescence imaging under the G:BOX and NuGenius brands; automated and manual systems for microbiological testing in food, water, pharmaceutical, and clinical applications; and ProReveal, a fluorescence-based patented protein detection test to check for residual protein on surgical instruments after they have been through a washer disinfector. Further, it engages in the design, manufacture, and calibration of pressure, vacuum, and gas flow measurement instruments; and flowmeters, flow alarms, flow indicators, flow switches, calibration cylinders, and sight glasses for the measurement of liquids and gases; and precision micropattern products, as well as water purification products and vacuum ovens under the Cyclon Water Still and Gallenkamp vacuum ovens brands. The company was formerly known as Scientific Digital Imaging plc and changed its name to SDI Group plc in November 2019. SDI Group plc was incorporated in 2007 and is based in Cambridge, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cambridge",
        "zipcode": "CB4 1TF",
        "website": "http://www.scientificdigitalimaging.com",
        "market_cap": "Micro Cap"
    },
    "SDI.L": {
        "short_name": "SDI GROUP PLC ORD 1P",
        "long_name": "SDI Group plc",
        "summary": "SDI Group plc, through its subsidiaries, designs and manufactures scientific and technology products based on digital imaging in the United Kingdom, rest of Europe, the United States, Asia, and internationally. The company offers sensitive cameras for life science and industrial applications under the Atik Camera brand name; cameras for art conservation Opus Instruments brand name; and cameras that have applications in astronomy, life sciences, and flat panel inspection under the Quantum Scientific Imaging brand name. It also designs and manufactures precision re-circulating chillers, coolers, and heat exchangers to control the thermal environment within life science and analytical systems; and supplies chemical dosing and control systems to the manufacturers of beverage cans. In addition, the company offers off-the-shelf and custom-made electrochemical sensors for water based applications under the Sentek name; systems and software for automated gel-based DNA and protein fluorescence/chemiluminescence imaging under the G:BOX and NuGenius brands; automated and manual systems for microbiological testing in food, water, pharmaceutical, and clinical applications; and ProReveal, a fluorescence-based patented protein detection test to check for residual protein on surgical instruments after they have been through a washer disinfector. Further, it engages in the design, manufacture, and calibration of pressure, vacuum, and gas flow measurement instruments; and flowmeters, flow alarms, flow indicators, flow switches, calibration cylinders, and sight glasses for the measurement of liquids and gases; and precision micropattern products, as well as water purification products and vacuum ovens under the Cyclon Water Still and Gallenkamp vacuum ovens brands. The company was formerly known as Scientific Digital Imaging plc and changed its name to SDI Group plc in November 2019. SDI Group plc was incorporated in 2007 and is based in Cambridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Cambridge",
        "zipcode": "CB4 1TF",
        "website": "http://www.scientificdigitalimaging.com",
        "market_cap": null
    },
    "SEPJF": {
        "short_name": "SPECTRIS",
        "long_name": "Spectris plc",
        "summary": "Spectris plc manufactures and sells measuring instruments and controls worldwide. The company provides products and services, which enable customers to determine structure, composition, quantity, and quality of particles and materials during their research and product development processes, when assessing materials before production, or during the manufacturing process; various range of life science services; products for measurement and control of temperature, humidity, pressure, strain, force, flow, level, pH, and conductivity; and data acquisition, electric heating, and custom-engineered products. It also supplies test, measurement, and analysis equipment, software, and services for product design optimization and manufacturing control; and designs and manufactures tooling and monitoring system for installation and acquisition services, data processing services, 24/7 monitoring, and advanced analytics consulting. In addition, the company offers various industrial automation products, including IIoT controllers and gateways, data acquisition and protocol converters, human machine interface operator displays and panel meters, visualisation software products, proportionalÂ\u0096integralÂ\u0096derivative controllers, remote terminal units, input/output products, and signal conditioners and sensors; and industrial networking products, which include ethernet switches, wired and wireless routers, and network and device management software products. Further, it provides on-line and off-line measurement and control solutions for the dimensional monitoring of diameter, ovality, wall thickness, eccentricity, length and speed, and other parameters; particle measuring systems; and supplies gas analysis solutions and various related product and services. The company was formerly known as Fairey Aviation Company Ltd. and changed its name to Spectris plc in May 2001. Spectris plc was founded in 1915 and is headquartered in Egham, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Egham",
        "zipcode": "TW20 9QD",
        "website": "http://www.spectris.com",
        "market_cap": "Mid Cap"
    },
    "SRT.L": {
        "short_name": "SRT MARINE SYSTEMS PLC ORD 0.1P",
        "long_name": "SRT Marine Systems plc",
        "summary": "SRT Marine Systems plc, together with its subsidiaries, develops and supplies automatic identification system (AIS) based maritime domain awareness technologies, derivative products, and system solutions. It offers systems, such as DAS-Digital ATON, a system that links onshore and onboard navigation systems; NAIS-National Vessel Tracking, a vessel identification and tracking solution; MDM-Coastguard, a maritime border, as well as EEZ surveillance, command, and control system; VMS-Fisheries, a fishing boat tracking, monitoring, and management system; and VTS-Ports and Waterways, a monitoring and management system for maritime infrastructure, ports, and waterways. The company also provides AIS, VMS, search and rescue, and navigation transceivers; fishing buoy trackers; base stations; display and data solutions; satellite data solutions; OEM AIS transceivers; and transceiver modules, as well as develops, sells, and licenses maritime communication products. Its solutions are used in a range of maritime applications from safety and security to fishery management and environment protection. The company serves mariners, infrastructure owners, coast guards, and fishing authorities in Europe, the Middle East, North America, the United Kingdom, South East Asia, and internationally. The company was formerly known as Software Radio Technology Plc and changed its name to SRT Marine Systems plc in July 2016. SRT Marine Systems plc was founded in 1987 and is headquartered in Bath, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Bath",
        "zipcode": "BA3 4BS",
        "website": "http://www.srt-marine.com",
        "market_cap": null
    },
    "SXS.L": {
        "short_name": "SPECTRIS PLC ORD 5P",
        "long_name": "Spectris plc",
        "summary": "Spectris plc manufactures and sells measuring instruments and controls worldwide. The company provides products and services, which enable customers to determine structure, composition, quantity, and quality of particles and materials during their research and product development processes, when assessing materials before production, or during the manufacturing process; various range of life science services; products for measurement and control of temperature, humidity, pressure, strain, force, flow, level, pH, and conductivity; and data acquisition, electric heating, and custom-engineered products. It also supplies test, measurement, and analysis equipment, software, and services for product design optimization and manufacturing control; and designs and manufactures tooling and monitoring system for installation and acquisition services, data processing services, 24/7 monitoring, and advanced analytics consulting. In addition, the company offers various industrial automation products, including IIoT controllers and gateways, data acquisition and protocol converters, human machine interface operator displays and panel meters, visualisation software products, proportionalÂ\u0096integralÂ\u0096derivative controllers, remote terminal units, input/output products, and signal conditioners and sensors; and industrial networking products, which include ethernet switches, wired and wireless routers, and network and device management software products. Further, it provides on-line and off-line measurement and control solutions for the dimensional monitoring of diameter, ovality, wall thickness, eccentricity, length and speed, and other parameters; particle measuring systems; and supplies gas analysis solutions and various related product and services. The company was formerly known as Fairey Aviation Company Ltd. and changed its name to Spectris plc in May 2001. Spectris plc was founded in 1915 and is headquartered in Egham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Egham",
        "zipcode": "TW20 9QD",
        "website": "http://www.spectris.com",
        "market_cap": null
    },
    "TRAK.L": {
        "short_name": "TRAKM8 HOLDINGS PLC ORD 1P",
        "long_name": "Trakm8 Holdings PLC",
        "summary": "Trakm8 Holdings PLC designs, develops, manufactures, sells, and distributes vehicle telematics equipment and services, and optimization solutions in the United Kingdom, North America, Norway, rest of Europe, and internationally. The company offers fleet management solutions, such as vehicle tracking, insight optimization, driver behavior, vehicle health, tachograph, asset tracking, trailer tracking, and first notification of loss. It also provides telematics insurance solutions; optimization solutions in the areas of transport and logistics, energy management, mobility, and electric vehicles; automotive telematics solutions, including connected care and asset management solutions; and camera integrated telematics, dash cams, FORS camera packages, and multi-camera systems for vehicles, as well as engineering, professional, and mapping services. The company was founded in 2002 and is headquartered in Birmingham, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Birmingham",
        "zipcode": "B46 1HG",
        "website": "http://www.trakm8.com",
        "market_cap": null
    }
}