{
    "1BZ.SG": {
        "short_name": "Beeks Finan.Cloud Grp.PLC Regis",
        "long_name": "Beeks Trading Corporation Ltd.",
        "summary": "Beeks Trading Corporation Ltd. provides virtual private server and infrastructure solutions for traders and broker partners worldwide. The company also offers co-location services; dedicated server packages; and server installation services. In addition, it provides institutional venue connections and retail broker connections through its Equinix platform; and Beeks Marketplace, a cloud-based portal that enables real-time connectivity to various exchanges, data feeds, trading tools, and news services for institutional traders, proprietary trading firms, brokers, wealth managers, and high-end retail traders. The company was incorporated in 2010 and is based in Paisley, United Kingdom with additional offices in Austria, Chicago, the United Kingdom, Indonesia, New York, and Tokyo. Beeks Trading Corporation Ltd. operates as a subsidiary of Beeks Financial Cloud Group Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Paisley"
    },
    "2Y5.F": {
        "short_name": "ENDAVA LTD.  SP.ADR/1",
        "long_name": "Endava plc",
        "summary": "Endava plc provides technology services for clients in the consumer products, healthcare, logistics, and retail verticals in Europe, Latin America, and North America. It offers technology and digital advisory services for financial services, healthcare, manufacturing, retail and consumer, business and support services, and TMT sectors; IT strategies; business analysis services in payments, financial services, asset and wealth management, insurance, telecommunications, and digital media areas; program management services; digital product strategy services; and architecture, extended reality, machine learning and artificial intelligence, product design, and user experience and visual design services. The company also engages in the identifying, defining, and embedding collaborative data and analytics; and provision of automated testing, cloud native software engineering, continuous delivery, distributed agile delivery, intelligent automation, secure development, agile applications management, cloud infrastructure, DevSecOps, service delivery, smart desk, and telemetry and monitoring services. The company was founded in 2000 and is headquartered in London, United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "53M.F": {
        "short_name": "MIMECAST LTD.  DL-,012",
        "long_name": "Mimecast Limited",
        "summary": "Mimecast Limited provides cloud security and risk management services for corporate information and email. The company offers Mimecast Email Security solution, which protects against the delivery of malware, malicious URLs and attachments, spam, viruses, impersonation attacks, phishing, and spear-phishing attacks, including business email compromise, identity theft, extortion, fraud, and other attacks, while also preventing data leaks and other internal threats, as well as provides awareness training services. It also provides Cyber Resilience Extensions, including Mimecast Enterprise Information Archiving that unifies email data to support e-discovery, forensic analysis, and compliance initiatives; Mimecast Mailbox Continuity, which protects email and data against the threat of downtime as a result of system failure, natural disasters, planned maintenance, system upgrades, and migrations; and Mimecast Web Security service that protects against malicious web activity initiated by user action or malware and blocks access to inappropriate websites based on acceptable use policies. In addition, the company's Cyber Resilience Extensions also comprise Mimecast Secure Messaging, a secure and private channel to share sensitive information; Mimecast Privacy Pack, which prevents breaches and protects against data exfiltration transmissions; and Large File Send that enables employees to create security and compliance risks when they turn to file sharing services. Further, it provides Threat Intelligence Dashboard, which displays cyber threat data specific to an organization by identifying users who pose the greatest cyber risk; and Mimecast Mobile and Desktop Apps for mobile, PC, and Mac users, as well as engages in data center operations to support Canadian and global customers. The company sells its services through direct sales and channel partners. Mimecast Limited was founded in 2003 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "8C2.F": {
        "short_name": "KAPE TECHNOLOG.PLC DL-,01",
        "long_name": "Kape Technologies Plc",
        "summary": "Kape Technologies Plc, a cybersecurity company, develops and distributes digital products in the online security space. It operates through two segment, Digital Privacy and Digital Security. It offers CyberGhost, Zenmate, and Private Internet Access that provide cybersecurity SaaS with a focus on providing of virtual private network solutions. The company provides Intego, a malware protection, firewall, anti-spam, back-up, data protection and parental controls software for Mac; and PC performance, Reimage PC, Restoro, and DriverFix products. In addition, it offers software development; market research; consulting; and professional services. The company was formerly known as Crossrider plc and changed its name to Kape Technologies Plc in March 2018. The company is based in London, the United Kingdom. Kape Technologies Plc is a subsidiary of Unikmind Holdings Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "B11.F": {
        "short_name": "BLUE PRISM GRP. PLC  -,01",
        "long_name": "Blue Prism Group plc",
        "summary": "Blue Prism Group plc, together with its subsidiaries, engages in the licensing of robotic process automation software for enterprise-scale organizations in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company offers digital workforce platform; intelligent automation skills; blue prism digital exchange; process discovery tools; and blue prism Software-as-a-Service products. It serves customers in financial services, industrial and manufacturing, communications, media and technology, hospitality, utilities, public, and health and life sciences sectors. Blue Prism Group plc has a collaboration with Red Hat, Inc. for the development of intelligent automation capabilities and solutions; and partnership with Blueprint to support enterprise organizations to use of RPA enterprise-wide. The company was founded in 2001 and is based in Warrington, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "BKS.L": {
        "short_name": "BEEKS FINANCIAL CLOUD GROUP PLC",
        "long_name": "Beeks Trading Corporation Ltd.",
        "summary": "Beeks Trading Corporation Ltd. provides virtual private server and infrastructure solutions for traders and broker partners worldwide. The company also offers co-location services; dedicated server packages; and server installation services. In addition, it provides institutional venue connections and retail broker connections through its Equinix platform; and Beeks Marketplace, a cloud-based portal that enables real-time connectivity to various exchanges, data feeds, trading tools, and news services for institutional traders, proprietary trading firms, brokers, wealth managers, and high-end retail traders. The company was incorporated in 2010 and is based in Paisley, United Kingdom with additional offices in Austria, Chicago, the United Kingdom, Indonesia, New York, and Tokyo. Beeks Trading Corporation Ltd. operates as a subsidiary of Beeks Financial Cloud Group Limited.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Paisley"
    },
    "BLTG.L": {
        "short_name": "BLANCCO TECHNOLOGY GROUP PLC OR",
        "long_name": "Blancco Technology Group plc",
        "summary": "Blancco Technology Group plc, together with its subsidiaries, provides mobile device diagnostics and data erasure services in the United States, the United Kingdom, the Asia Pacific, and internationally. It offers Blancco Drive Eraser, which erases sensitive data from servers, laptops, desktops, and drives; Blancco File Eraser, a file erasure software, which erases sensitive files and folders from PC desktop computers, laptops, and servers; and Blancco Removable Media Eraser, a data sanitization software that erases data from removable media, including USB drives, SD cards, micro drives, compactflash cards, and other flash memory storage devices. The company also provides Blancco LUN Eraser, which erases data in active storage environments; Blancco Virtual Machine Eraser, a hypervisor erasure software that destroys data when virtual machines are no longer needed; Blancco Management Console, a centralized data erasure reporting solution; and Blancco Network Device Eraser that permanently removes sensitive information from network switches and routers, including network configurations, IP addresses, cached files, user credentials, and user data. In addition, it offers Blancco Hardware Solutions, which erases data on loose drives and enclosures on premise at data centers or IT facilities. The company was formerly known as Regenersis Plc and changed its name to Blancco Technology Group plc in April 2016. Blancco Technology Group plc was founded in 1997 and is based in Huntingdon, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Huntingdon"
    },
    "BPRMF": {
        "short_name": "BLUE PRISM GROUP PLC",
        "long_name": "Blue Prism Group plc",
        "summary": "Blue Prism Group plc, together with its subsidiaries, engages in the licensing of robotic process automation software for enterprise-scale organizations in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company offers digital workforce platform; intelligent automation skills; blue prism digital exchange; process discovery tools; and blue prism Software-as-a-Service products. It serves customers in financial services, industrial and manufacturing, communications, media and technology, hospitality, utilities, public, and health and life sciences sectors. Blue Prism Group plc has a collaboration with Red Hat, Inc. for the development of intelligent automation capabilities and solutions; and partnership with Blueprint to support enterprise organizations to use of RPA enterprise-wide. The company was founded in 2001 and is based in Warrington, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "BW8.F": {
        "short_name": "SPIRENT COMMUNIC.LS-,0333",
        "long_name": "Spirent Communications plc",
        "summary": "Spirent Communications plc provides solutions to develop devices and equipment and to operate networks worldwide. The company operates through Networks & Security, Lifecycle Service Assurance, and Connected Devices segments. The Networks & Security segment develops performance and security test systems to accelerate the development of new devices, networks, and applications for high-speed Ethernet/IP, mobile, and global satellite navigation systems. The Lifecycle Service Assurance segment provides assurance systems to accelerate the turn up of new services, troubleshooting of customer, and production network problems. The Connected Devices segment develops systems for wireless connectivity. It serves communication, government, financial services, healthcare, retail, and transportation businesses. The company was formerly known as Spirent plc and changed its name to Spirent Communications plc in May 2006. Spirent Communications plc was founded in 1936 and is headquartered in Crawley, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Crawley"
    },
    "CLCO.L": {
        "short_name": "CLOUDCOCO GROUP PLC ORD 1P",
        "long_name": "CloudCoCo Group plc",
        "summary": "CloudCoCo Group plc provides IT as a Service to small and medium-sized enterprises in the United Kingdom. The company operates through three segments: Recurring Services, Product, and Professional Services. The Recurring Services segment provides continuing IT services, which have an ongoing billing and support elements. The Product segment engages in the resale of hardware and software solutions. The Professional Services segment offers consultation, design, installation, configuration, and integration services for IT technologies. The company also offers business resilience services, such as Back Up as a Service, Disaster Recovery as a Service, and managed security services; and modern work place services that include collaboration through Office 365, Microsoft 365, and office applications, as well as contact centers and unified communications. In addition, it provides operational modernization services that include data center optimization and migration, and networking; and managed IT services, as well as professional, software development, strategic consulting, and support services. The company was formerly known as Adept4 Plc and changed its name to CloudCoCo Group plc in November 2019. CloudCoCo Group plc was incorporated in 2004 and is based in Warrington, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "CNS.L": {
        "short_name": "CORERO NETWORK SECURITY PLC ORD",
        "long_name": "Corero Network Security plc",
        "summary": "Corero Network Security plc develops, markets, and sells network security products and services for the protection from distributed denial of service (DDoS) attacks worldwide. It offers Corero SmartWall Threat Defense System family of products that provide protection against various cyber-attacks, including network and application layer, DDoS, volumetric, and multi-vector attacks. The company offers SmartWall network threat defense appliances for the mitigation of DDoS attacks; SmartWall network bypass appliances for network connectivity; SmartWall Service Portal that enables real-time DDoS mitigation to be delivered as-a-service; SecureWatch Analytics, a Web-based security analytics portal that delivers dashboards; and SmartWall Central Management Server that offers various options for managing, configuring, and monitoring SmartWall appliances. In addition, it offers monitoring and maintenance services, and managed services. Corero Network Security plc provides its solutions for service providers, hosting providers and datacenters, digital enterprises, and managed security service providers. The company was formerly known as Corero plc and changed its name to Corero Network Security plc in June 2011. Corero Network Security plc was incorporated in 1991 and is based in Uxbridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Uxbridge"
    },
    "CTEA.L": {
        "short_name": "CATENAE INNOVATION PLC ORD 0.2P",
        "long_name": "Catenae Innovation Plc",
        "summary": "Catenae Innovation Plc, together with its subsidiaries, provides multimedia and technology solutions primarily in the United Kingdom. It exploits intellectual property and holds licenses; and financial technology and media publishing solutions. The company offers OnSite DLT, a mobile management, inspection, and reporting solution; OnSide, a centralized management tool for sporting organizations that deals with all the key elements of coaching from scheduling of staff and timesheet processing; OnGuard for man-guarding organizations to provide real-time management of remote workforce with operative auditing via geo-tagging and time-stamping, integrated scheduling, timesheet management, and incident reporting; and Sequestrum, an application which simplifies access to the blockchain. The company was formerly known as Milestone Group plc and changed its name to Catenae Innovation Plc in March 2018. Catenae Innovation Plc was incorporated in 2003 and is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "CYBNY": {
        "short_name": "CYBER SECURITY 1 AB",
        "long_name": "Cyber Security 1 AB (publ)",
        "summary": "Cyber Security 1 AB (publ) provides cyber resilience solutions in Africa, the Middle East, Europe, and the United Arab Emirates. It operates in three segments: Value Added Distribution; Advisory Services; and MSSP/ Managed Services. The company also offers security, risk, and compliance solutions for payment, communication, network, and e-commerce security. In addition, it provides penetration testing, application security audit, information systems security audit, data loss prevention, and network security services. Further, the company offers MSSP/Managed services, such as data, network, and gateway securities; and managed compliance and SIEM services, incident response, and business continuity and cyber forensics. It serves public and private sector organizations, including government, healthcare, retail, insurance, manufacturing, and hospitality. The company was formerly known as Cognosec AB (publ) and changed its name to Cyber Security 1 AB (publ) in July 2018. Cyber Security 1 AB (publ) was incorporated in 1970 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "DAVA": {
        "short_name": "Endava plc",
        "long_name": "Endava plc",
        "summary": "Endava plc provides technology services for clients in the consumer products, healthcare, logistics, and retail verticals in Europe, Latin America, and North America. It offers technology and digital advisory services for financial services, healthcare, manufacturing, retail and consumer, business and support services, and TMT sectors; IT strategies; business analysis services in payments, financial services, asset and wealth management, insurance, telecommunications, and digital media areas; program management services; digital product strategy services; and architecture, extended reality, machine learning and artificial intelligence, product design, and user experience and visual design services. The company also engages in the identifying, defining, and embedding collaborative data and analytics; and provision of automated testing, cloud native software engineering, continuous delivery, distributed agile delivery, intelligent automation, secure development, agile applications management, cloud infrastructure, DevSecOps, service delivery, smart desk, and telemetry and monitoring services. The company was founded in 2000 and is headquartered in London, United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "DTW1.F": {
        "short_name": "SHEARWATER GRP PLC LS-,10",
        "long_name": "Shearwater Group plc",
        "summary": "Shearwater Group plc provides operational resilience solutions in the United Kingdom, Europe, North America, and internationally. It operates through two segments, software and services. The company offers SecurEnvoy, a software that provides identity and access management solutions; and Geolang, a software that delivers data discovery, data extraction, and data loss prevention solutions, services, and technologies to discover, classify, and protect sensitive data and information in the cloud and on premise. It also provides cyber security, network monitoring technologies, and managed security services; technology, operational, and regulatory risk assurance and advisory services; and next generation penetration testing, red teaming, and offensive security consultancy services, as well as business IT services to corporate and public sector organizations. The company was formerly known as Aurum Mining Plc and changed its name to Shearwater Group PLC in January 2017. Shearwater Group plc was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "E3C.SG": {
        "short_name": "ECSC Group PLC Registered Share",
        "long_name": "ECSC Group plc",
        "summary": "ECSC Group plc provides information and cyber security services. It operates through three segments: Consulting, Managed Services, and Vendor Products. The company offers services, such as managed, consultancy, testing, incident response, and vendor solutions. It also provides a range of solutions, including firewalls, intrusion detection systems, log analysis/ security information and event management (SIEM), cloud SIEM / SOAR, file integrity monitoring, vulnerability scanning, and PCI desktops. It offers solutions and services to various sectors, including education, retail, legal, financial, and local authorities. The company was founded in 2000 and is based in Bradford, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Bradford"
    },
    "ECSC.L": {
        "short_name": "ECSC GROUP PLC ORD 1P",
        "long_name": "ECSC Group plc",
        "summary": "ECSC Group plc provides information and cyber security services. It operates through three segments: Consulting, Managed Services, and Vendor Products. The company offers services, such as managed, consultancy, testing, incident response, and vendor solutions. It also provides a range of solutions, including firewalls, intrusion detection systems, log analysis/ security information and event management (SIEM), cloud SIEM / SOAR, file integrity monitoring, vulnerability scanning, and PCI desktops. It offers solutions and services to various sectors, including education, retail, legal, financial, and local authorities. The company was founded in 2000 and is based in Bradford, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Bradford"
    },
    "EQN.L": {
        "short_name": "EQUINITI GROUP PLC ORD 0.1P",
        "long_name": "Equiniti Group plc",
        "summary": "Equiniti Group plc, together with its subsidiaries, provides administration and payment services worldwide. The company operates in five segments: Investment Solutions, Intelligent Solutions, Pension Solutions, EQ US, and Interest Income. It offers registration services, including share registration, corporate actions and IPOs, company secretarial, and insider list management services; employee services, such as employee share plans, executive and discretionary share plans, and trustee services; and boardroom advisory services comprising company secretarial, proxy solicitation and stewardship, and investor relations services. The company also provides customer engagement solutions, including expert assessment, complaints handling software, and resourcing solutions; remediation solutions; credit servicing, software, and sourcing solutions; solutions for financial crime threats; case management and covert management systems; data solutions; international payment solutions; and bereavement services. In addition, it offers pension administration solutions; CompendiaTouch, a pension scheme administration system; SuperVal, an actuarial valuation platform used by consulting firms and pension industry actuaries; RetireMe App, a retirement planning app; rewards and benefits solutions; HR, payroll, and appraisal systems; and life and pensions solutions. Further, the company provides investment administration, executive and employee share dealing, and personal investments services; shareowner services, including annual meeting and corporate actions; and Equity Compensation Services, such as ESPP, options, RSUs, performance awards, and stock appreciation rights. Equiniti Group plc was founded in 2007 and is based in Crawley, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Crawley"
    },
    "FLX.L": {
        "short_name": "FALANX GROUP LIMITED ORD NPV (D",
        "long_name": "Falanx Group Limited",
        "summary": "Falanx Group Limited, through its subsidiaries, provides cyber defense and intelligence services to blue chip and government clients worldwide. It operates in two divisions, Falanx Cyber and Falanx Intelligence. The Falanx Cyber division provides cloud-based cyber monitoring and professional services, such as advisory; penetration testing; awareness and education; and managed detection and response services to government and commercial organizations. The Falanx Intelligence division offers political and security risk, and business intelligence services under the Falanx Assynt name. The company develops software for telecommunications, security, and data analytics; and offers management consultancy services, as well as provides risk assessment and investigation services. Falanx Group Limited was incorporated in 2012 and is headquartered in Reading, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Reading"
    },
    "HYHDF": {
        "short_name": "HYDRO66 HOLDINGS CORP",
        "long_name": "Hydro66 Holdings Corp.",
        "summary": "Hydro66 Holdings Corp. operates as a data center company in the United Kingdom, the United States, Canada, Asia, and rest of Europe. It provides colocation and digital currency transaction verification services to system integrators, enterprise business, and cloud hosting and high-performance computing block chain companies. The company is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "IOM.L": {
        "short_name": "IOMART GROUP PLC ORD 1P",
        "long_name": "iomart Group plc",
        "summary": "iomart Group plc provides managed cloud services in the United Kingdom and internationally. It operates through two segments, Cloud Services and Easyspace. The company offers a range of products to the micro and SME markets, including domain names, shared, dedicated and virtual servers, and email services. It also provides infrastructure solutions, such as private cloud, virtual desktop, storage, colocation, managed azure, microsoft 365, infrastructure as a service, virtual machines, and ecommerce; data protection services, including backup as a service, disaster recovery as a service, and business continuity; and various security services, including DDoS protection, application defense, intrusion detection and prevention, abnormal access protection, malware and ransomware protection, vulnerability scanning, data loss prevention, and AI security. In addition, the company offers connectivity solutions, such as managed SD-WAN, cloudlink, last mile, managed WAN, data centre connectivity, and radio and satellite; and consultancy services. iomart Group Plc was founded in 1998 and is headquartered in Glasgow, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Glasgow"
    },
    "KAPE.L": {
        "short_name": "KAPE TECHNOLOGIES PLC ORD USD0.",
        "long_name": "Kape Technologies Plc",
        "summary": "Kape Technologies Plc, a cybersecurity company, develops and distributes digital products in the online security space. It operates through two segment, Digital Privacy and Digital Security. It offers CyberGhost, Zenmate, and Private Internet Access that provide cybersecurity SaaS with a focus on providing of virtual private network solutions. The company provides Intego, a malware protection, firewall, anti-spam, back-up, data protection and parental controls software for Mac; and PC performance, Reimage PC, Restoro, and DriverFix products. In addition, it offers software development; market research; consulting; and professional services. The company was formerly known as Crossrider plc and changed its name to Kape Technologies Plc in March 2018. The company is based in London, the United Kingdom. Kape Technologies Plc is a subsidiary of Unikmind Holdings Limited.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "LYU.F": {
        "short_name": "IOMART GROUP PLC  LS-,01",
        "long_name": "iomart Group plc",
        "summary": "iomart Group plc provides managed cloud services in the United Kingdom and internationally. It operates through two segments, Cloud Services and Easyspace. The company offers a range of products to the micro and SME markets, including domain names, shared, dedicated and virtual servers, and email services. It also provides infrastructure solutions, such as private cloud, virtual desktop, storage, colocation, managed azure, microsoft 365, infrastructure as a service, virtual machines, and ecommerce; data protection services, including backup as a service, disaster recovery as a service, and business continuity; and various security services, including DDoS protection, application defense, intrusion detection and prevention, abnormal access protection, malware and ransomware protection, vulnerability scanning, data loss prevention, and AI security. In addition, the company offers connectivity solutions, such as managed SD-WAN, cloudlink, last mile, managed WAN, data centre connectivity, and radio and satellite; and consultancy services. iomart Group Plc was founded in 1998 and is headquartered in Glasgow, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Glasgow"
    },
    "MCFUF": {
        "short_name": "MICRO FOCUS INTERNATIONAL PLC",
        "long_name": "Micro Focus International plc",
        "summary": "Micro Focus International plc develops, sells, and supports software products and solutions to small and medium size enterprises. The company offers infrastructure software products that are managed on an investment portfolio. Its product portfolio includes application modernization and connectivity, application delivery management, and IT operations management, as well as security, information management, and Governance. Micro Focus International plc was founded in 1976 and is headquartered in Newbury, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Newbury"
    },
    "MCRO.L": {
        "short_name": "MICRO FOCUS INTERNATIONAL PLC O",
        "long_name": "Micro Focus International plc",
        "summary": "Micro Focus International plc develops, sells, and supports software products and solutions to small and medium size enterprises. The company offers infrastructure software products that are managed on an investment portfolio. Its product portfolio includes application modernization and connectivity, application delivery management, and IT operations management, as well as security, information management, and Governance. Micro Focus International plc was founded in 1976 and is headquartered in Newbury, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Newbury"
    },
    "MFGP": {
        "short_name": "Micro Focus Intl PLC",
        "long_name": "Micro Focus International plc",
        "summary": "Micro Focus International plc develops, sells, and supports software products and solutions to small and medium size enterprises. The company offers infrastructure software products that are managed on an investment portfolio. Its product portfolio includes application modernization and connectivity, application delivery management, and IT operations management, as well as security, information management, and Governance. Micro Focus International plc was founded in 1976 and is headquartered in Newbury, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Newbury"
    },
    "MIME": {
        "short_name": "Mimecast Limited",
        "long_name": "Mimecast Limited",
        "summary": "Mimecast Limited provides cloud security and risk management services for corporate information and email. The company offers Mimecast Email Security solution, which protects against the delivery of malware, malicious URLs and attachments, spam, viruses, impersonation attacks, phishing, and spear-phishing attacks, including business email compromise, identity theft, extortion, fraud, and other attacks, while also preventing data leaks and other internal threats, as well as provides awareness training services. It also provides Cyber Resilience Extensions, including Mimecast Enterprise Information Archiving that unifies email data to support e-discovery, forensic analysis, and compliance initiatives; Mimecast Mailbox Continuity, which protects email and data against the threat of downtime as a result of system failure, natural disasters, planned maintenance, system upgrades, and migrations; and Mimecast Web Security service that protects against malicious web activity initiated by user action or malware and blocks access to inappropriate websites based on acceptable use policies. In addition, the company's Cyber Resilience Extensions also comprise Mimecast Secure Messaging, a secure and private channel to share sensitive information; Mimecast Privacy Pack, which prevents breaches and protects against data exfiltration transmissions; and Large File Send that enables employees to create security and compliance risks when they turn to file sharing services. Further, it provides Threat Intelligence Dashboard, which displays cyber threat data specific to an organization by identifying users who pose the greatest cyber risk; and Mimecast Mobile and Desktop Apps for mobile, PC, and Mac users, as well as engages in data center operations to support Canadian and global customers. The company sells its services through direct sales and channel partners. Mimecast Limited was founded in 2003 and is headquartered in London, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "NYA1.SG": {
        "short_name": "Corero Network Security PLC Reg",
        "long_name": "Corero Network Security plc",
        "summary": "Corero Network Security plc develops, markets, and sells network security products and services for the protection from distributed denial of service (DDoS) attacks worldwide. It offers Corero SmartWall Threat Defense System family of products that provide protection against various cyber-attacks, including network and application layer, DDoS, volumetric, and multi-vector attacks. The company offers SmartWall network threat defense appliances for the mitigation of DDoS attacks; SmartWall network bypass appliances for network connectivity; SmartWall Service Portal that enables real-time DDoS mitigation to be delivered as-a-service; SecureWatch Analytics, a Web-based security analytics portal that delivers dashboards; and SmartWall Central Management Server that offers various options for managing, configuring, and monitoring SmartWall appliances. In addition, it offers monitoring and maintenance services, and managed services. Corero Network Security plc provides its solutions for service providers, hosting providers and datacenters, digital enterprises, and managed security service providers. The company was formerly known as Corero plc and changed its name to Corero Network Security plc in June 2011. Corero Network Security plc was incorporated in 1991 and is based in Uxbridge, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Uxbridge"
    },
    "O6T.SG": {
        "short_name": "Osirium Technologies PLC Regist",
        "long_name": "Osirium Technologies PLC",
        "summary": "Osirium Technologies PLC develops and sells cyber security software products in the United Kingdom. Its products include Privileged Access Security, a solution that controls and protects access to customers' shared applications, services, and devices; Privileged Access Management, a solution to minimize the risk of security breaches by controlling, securing, and auditing the vital assets in privileged accounts; Privileged Process Automation, a solution that free up specialist skills and boost security by automating essential IT and business processes; and Privileged Endpoint Management, a solution to protect critical desktop applications by removing potentially risky local admin rights. The company also provides Privileged Task Management, a solution that allows SysAdmins to delegate multi-step tasks without human error; Privileged Session Management, a solution that enables security managers to record, store, and playback activities that take place across their hybrid-cloud infrastructures; and Privileged Behaviour Management, a module that creates a series of base lines to measure user actions. In addition, it offers third party access protection, as well as compliance and industry based solutions; and Active Directory Audit Tool, a tool to identify, assess, and prioritize security risks. The company serves finance, manufacturing, legal, government and defense, healthcare, telecommunications, industrial control systems, managed (security) service, and retail sectors. Osirium Technologies PLC was founded in 2008 and is headquartered in Reading, the United Kingdom.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Reading"
    },
    "OSI.L": {
        "short_name": "OSIRIUM TECHNOLOGIES PLC ORD 1P",
        "long_name": "Osirium Technologies PLC",
        "summary": "Osirium Technologies PLC develops and sells cyber security software products in the United Kingdom. Its products include Privileged Access Security, a solution that controls and protects access to customers' shared applications, services, and devices; Privileged Access Management, a solution to minimize the risk of security breaches by controlling, securing, and auditing the vital assets in privileged accounts; Privileged Process Automation, a solution that free up specialist skills and boost security by automating essential IT and business processes; and Privileged Endpoint Management, a solution to protect critical desktop applications by removing potentially risky local admin rights. The company also provides Privileged Task Management, a solution that allows SysAdmins to delegate multi-step tasks without human error; Privileged Session Management, a solution that enables security managers to record, store, and playback activities that take place across their hybrid-cloud infrastructures; and Privileged Behaviour Management, a module that creates a series of base lines to measure user actions. In addition, it offers third party access protection, as well as compliance and industry based solutions; and Active Directory Audit Tool, a tool to identify, assess, and prioritize security risks. The company serves finance, manufacturing, legal, government and defense, healthcare, telecommunications, industrial control systems, managed (security) service, and retail sectors. Osirium Technologies PLC was founded in 2008 and is headquartered in Reading, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Reading"
    },
    "PRSM.L": {
        "short_name": "BLUE PRISM GROUP PLC ORD 1P",
        "long_name": "Blue Prism Group plc",
        "summary": "Blue Prism Group plc, together with its subsidiaries, engages in the licensing of robotic process automation software for enterprise-scale organizations in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company offers digital workforce platform; intelligent automation skills; blue prism digital exchange; process discovery tools; and blue prism Software-as-a-Service products. It serves customers in financial services, industrial and manufacturing, communications, media and technology, hospitality, utilities, public, and health and life sciences sectors. Blue Prism Group plc has a collaboration with Red Hat, Inc. for the development of intelligent automation capabilities and solutions; and partnership with Blueprint to support enterprise organizations to use of RPA enterprise-wide. The company was founded in 2001 and is based in Warrington, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Warrington"
    },
    "SPMYY": {
        "short_name": "SPIRENT COMMUNICATIONS",
        "long_name": "Spirent Communications plc",
        "summary": "Spirent Communications plc provides solutions to develop devices and equipment and to operate networks worldwide. The company operates through Networks & Security, Lifecycle Service Assurance, and Connected Devices segments. The Networks & Security segment develops performance and security test systems to accelerate the development of new devices, networks, and applications for high-speed Ethernet/IP, mobile, and global satellite navigation systems. The Lifecycle Service Assurance segment provides assurance systems to accelerate the turn up of new services, troubleshooting of customer, and production network problems. The Connected Devices segment develops systems for wireless connectivity. It serves communication, government, financial services, healthcare, retail, and transportation businesses. The company was formerly known as Spirent plc and changed its name to Spirent Communications plc in May 2006. Spirent Communications plc was founded in 1936 and is headquartered in Crawley, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Crawley"
    },
    "SPNUF": {
        "short_name": "SPIRENT COMMUNICATIONS",
        "long_name": "Spirent Communications plc",
        "summary": "Spirent Communications plc provides solutions to develop devices and equipment and to operate networks worldwide. The company operates through Networks & Security, Lifecycle Service Assurance, and Connected Devices segments. The Networks & Security segment develops performance and security test systems to accelerate the development of new devices, networks, and applications for high-speed Ethernet/IP, mobile, and global satellite navigation systems. The Lifecycle Service Assurance segment provides assurance systems to accelerate the turn up of new services, troubleshooting of customer, and production network problems. The Connected Devices segment develops systems for wireless connectivity. It serves communication, government, financial services, healthcare, retail, and transportation businesses. The company was formerly known as Spirent plc and changed its name to Spirent Communications plc in May 2006. Spirent Communications plc was founded in 1936 and is headquartered in Crawley, the United Kingdom.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Crawley"
    },
    "SPT.L": {
        "short_name": "SPIRENT COMMUNICATIONS PLC ORD ",
        "long_name": "Spirent Communications plc",
        "summary": "Spirent Communications plc provides solutions to develop devices and equipment and to operate networks worldwide. The company operates through Networks & Security, Lifecycle Service Assurance, and Connected Devices segments. The Networks & Security segment develops performance and security test systems to accelerate the development of new devices, networks, and applications for high-speed Ethernet/IP, mobile, and global satellite navigation systems. The Lifecycle Service Assurance segment provides assurance systems to accelerate the turn up of new services, troubleshooting of customer, and production network problems. The Connected Devices segment develops systems for wireless connectivity. It serves communication, government, financial services, healthcare, retail, and transportation businesses. The company was formerly known as Spirent plc and changed its name to Spirent Communications plc in May 2006. Spirent Communications plc was founded in 1936 and is headquartered in Crawley, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Crawley"
    },
    "SWG.L": {
        "short_name": "SHEARWATER GROUP PLC ORD 10P",
        "long_name": "Shearwater Group plc",
        "summary": "Shearwater Group plc provides operational resilience solutions in the United Kingdom, Europe, North America, and internationally. It operates through two segments, software and services. The company offers SecurEnvoy, a software that provides identity and access management solutions; and Geolang, a software that delivers data discovery, data extraction, and data loss prevention solutions, services, and technologies to discover, classify, and protect sensitive data and information in the cloud and on premise. It also provides cyber security, network monitoring technologies, and managed security services; technology, operational, and regulatory risk assurance and advisory services; and next generation penetration testing, red teaming, and offensive security consultancy services, as well as business IT services to corporate and public sector organizations. The company was formerly known as Aurum Mining Plc and changed its name to Shearwater Group PLC in January 2017. Shearwater Group plc was incorporated in 2004 and is headquartered in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "SYS.L": {
        "short_name": "SYSGROUP PLC ORD 1P",
        "long_name": "SysGroup plc",
        "summary": "SysGroup plc, together with its subsidiaries, provides managed IT, cloud hosting, and IT consultancy services in the United Kingdom and internationally. It operates through two segments, Managed IT Services and Value Added Resale. It offers managed, cloud hosting and security, and disaster recovery services, as well as professional and consultancy services; and hardware and software licenses. The company serves customers under the Netplan, System Professional, and Rockford brand names. The company was formerly known as Daily Internet PLC and changed its name to SysGroup plc in July 2016. SysGroup plc was incorporated in 2007 and is headquartered in Liverpool, the United Kingdom.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software—Infrastructure",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Liverpool"
    }
}