{
    "AARTIDRUGS.NS": {
        "short_name": "AARTI DRUGS LTD",
        "long_name": "Aarti Drugs Limited",
        "summary": "Aarti Drugs Limited, through its subsidiaries, engages in the pharmaceuticals business in India and internationally. It offers active pharmaceutical ingredients in various therapeutic categories, including anti-inflammatory, cardioprotectants, antidiarrhoeals, antifungals, antiarthritis/osteoporosis, antibiotics, antidiabetics, Alzheimer's treatment, sedatives, vitamins, and alcoholism treatment. The company also provides pharmaceutical intermediate products comprising tinidazole, celecoxib, ciprofloxacin, clopidogrel, diclofenac, ketoconazole, nimesulide, raloxifene, and zolpidem; and specialty chemical products, such as benzene sulphonamide, benzene sulphonic acid, benzene sulphonic acid methyl ester, benzene sulphonyl chloride, cipro Q acid, levofloxacin Q acid, methyl nicotinate, N-methyl methane sulphonamide, diphenyl sulphone, norofloxacin Q acid, ofloxacin Q acid, ortho para toluene sulphonamide, ortho/para toluene sulphonic acid methyl ester, para chloro benzene sulphonamide, para chloro benzene sulphonyl chloride, para toluene sulphonamide, para toluene sulphonic acid methyl ester, para toluene sulphonyl chloride, and sodium benezene sulfinate. In addition, its products under development comprise Acamprosate for alcoholism; Dabigatran for use as an anticoagulant; Sevelamer for antihyperphosphatemia; Colsevelam for anti-cholestrol treatment; Drondarone and Olmesartan for the treatment of cardiovascular diseases; Valasartan for use as cardiprotectant; and Sitagliptin for use as an antidiabetic. Additionally, the company offers contract manufacturing services. Aarti Drugs Limited was founded in 1984 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 022",
        "website": "http://www.aartidrugs.co.in",
        "market_cap": "Small Cap"
    },
    "ABBOTINDIA.NS": {
        "short_name": "ABBOTT INDIA LTD",
        "long_name": "Abbott India Limited",
        "summary": "Abbott India Limited operates as a pharmaceutical company in India. It offers pharmaceutical products for various therapeutic areas, such as women's health, gastroenterology, metabolics, central nervous system, pain management, nutritional supplements, vitamins, insomnia, vaccines, consumer health, etc. The company was formerly known as Knoll Pharmaceuticals Limited and changed its name to Abbott India Limited in July 2002. Abbott India Limited was founded in 1944 and is headquartered in Mumbai, India. Abbott India Limited operates as a subsidiary of Abbott Capital India Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.abbott.co.in",
        "market_cap": "Mid Cap"
    },
    "AJANTPHARM.NS": {
        "short_name": "AJANTA PHARMA",
        "long_name": "Ajanta Pharma Limited",
        "summary": "Ajanta Pharma Limited, a specialty pharmaceutical formulation company, together with its subsidiaries, develops, manufactures, and markets finished dosages. The company markets and serves various therapeutic segments, such as anti-biotic, anti-malarial, anti-diabetic, cardiology, gynecology, pediatric, respiratory and general health products, dermatology, ophthalmology, and pain management areas. It also provides multivitamins, antibiotics, eye drops, cough syrups, etc. The company serves in India, Africa, rest of Asia, the United States, and internationally. It supplies its products to government bodies, including armed forces, government hospitals, canteens, stores department, etc. Ajanta Pharma Limited was founded in 1973 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400067",
        "website": "http://www.ajantapharma.com",
        "market_cap": "Mid Cap"
    },
    "ALBERTDAVD.NS": {
        "short_name": "ALBERT DAVID",
        "long_name": "Albert David Limited",
        "summary": "Albert David Limited manufactures and sells pharmaceutical formulations, infusion solutions, herbal dosage forms, bulk drugs, and disposable syringes and needles in India. It offers formulations for parenteral, oral/enteral, topical agents, and vision care problems. The company also exports its products to Latin American, South East Asian, and various African countries. Albert David Limited was incorporated in 1938 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.albertdavidindia.com",
        "market_cap": "Small Cap"
    },
    "ALEMBICLTD.NS": {
        "short_name": "ALEMBIC LTD",
        "long_name": "Alembic Limited",
        "summary": "Alembic Limited manufactures and markets fermentation and chemistry based active pharmaceuticals ingredients (API). The company operates through API and Real Estate segments. It is also involved in the construction and leasing of residential and commercial real estate projects; provision of project management and marketing consultancy services; and wind power generation business. The company also exports its products. Alembic Limited was founded in 1907 and is based in Vadodara, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390003",
        "website": "http://www.alembiclimited.com",
        "market_cap": "Small Cap"
    },
    "ALKEM.NS": {
        "short_name": "ALKEM LAB LTD",
        "long_name": "Alkem Laboratories Limited",
        "summary": "Alkem Laboratories Limited, a pharmaceutical company, develops, manufactures, and sells pharmaceutical and nutraceutical products in India and internationally. The company offers branded generics, generic drugs, active pharmaceutical ingredients, and nutraceuticals in acute and chronic therapeutic areas comprising anti-infective, dermatology, diabetology, cardiology, gastroenterology, osteoporosis, central nervous system, oncology, urology, and gynaecology, as well as vitamins, minerals, and nutrients; and pain relief/analgesic, anti-diabetic, and neurology products. It also provides pregnancy detection kits and condoms. Alkem Laboratories Limited was founded in 1973 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.alkemlabs.com",
        "market_cap": "Mid Cap"
    },
    "ALPA.NS": {
        "short_name": "ALPA LABORATORIES",
        "long_name": "Alpa Laboratories Limited",
        "summary": "Alpa Laboratories Limited engages in manufacturing, marketing, and selling pharmaceutical finished dosage forms in India. It offers ethical, generic, and over the counter products in various finished dosage forms, including liquid injections, dry powder injections, tablets, capsules, eye and ear drops, ointments, creams, and gels for human use; and boluses, injections, and intra-mammary infusions for veterinary use. The company provides its products in various categories, such as anti-infectives comprising antibacterial, antibiotics, antifungals, anti protozoans, and antivirals; analgesics; anti-inflammatory drugs; cough and cold drugs; cardiovascular drugs; anti-diabetics; nutritional supplements; psychotropic drugs; and skin care preparations, as well as ear and eye care preparations. Alpa Laboratories Limited sells its products through distributors, as well as retail chemists, retail pharmacy stores, and hospitals. The company also exports its products to various countries in South and Central America, Africa, and Asia, including CIS countries comprising Russia, Ukraine, Kazakhstan, etc. Alpa Laboratories Limited was incorporated in 1988 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "453446",
        "website": "http://www.alpalabs.in",
        "market_cap": "Small Cap"
    },
    "AMRUTANJAN.NS": {
        "short_name": "AMRUTANJAN HEALTH",
        "long_name": "Amrutanjan Health Care Limited",
        "summary": "Amrutanjan Health Care Limited produces and sells ayurvedic pain balms in India. It operates through OTC products, Beverages, and Others segments. The company offers pain management products, including pain balms and roll-ons; and back pain roll-ons and lotions, body pain gels, and joint muscle sprays, as well as non-steroidal anti-inflammatory drugs. It also provides congestion management products, such as cold rubs, cough syrups, nasal inhalers, and mints. In addition, the company offers sanitary napkins for women. Further, it provides corn caps; hand sanitizers; and juice drinks under the Fruitnik and Fruitnik Electro+ brand names, as well as operates a pain management center. It also exports its products to Gulf, African, South East, and Asian countries. The company was formerly known as Amrutanjan Limited and changed its name to Amrutanjan Health Care Limited in 2007. Amrutanjan Health Care Limited was founded in 1893 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600004",
        "website": "http://www.amrutanjan.com",
        "market_cap": "Small Cap"
    },
    "APLLTD.NS": {
        "short_name": "ALEMBIC PHARMACEUT",
        "long_name": "Alembic Pharmaceuticals Limited",
        "summary": "Alembic Pharmaceuticals Limited develops, manufactures, and markets pharmaceutical products in India and internationally. It offers active pharmaceutical ingredients (API) and formulations. The company also provides branded and generic formulations in various therapeutic areas, such as cardio-diabetic, gynecology, acute, gastroenterology, ophthalmology, dermatology, urology, orthopedics, cancer, inflammation, autoimmune diseases, anti-infective, cold and cough, and metabolic disorders, as well as hospital care and animal health. In addition, it exports its products. Alembic Pharmaceuticals Limited was founded in 1907 and is headquartered in Vadodara, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390003",
        "website": "http://www.alembicpharmaceuticals.com",
        "market_cap": "Mid Cap"
    },
    "APOLLOHOSP.NS": {
        "short_name": "APOLLO HOSPITALS.",
        "long_name": "Apollo Hospitals Enterprise Limited",
        "summary": "Apollo Hospitals Enterprise Limited, together with its subsidiaries, provides healthcare services in India and internationally. The company's healthcare facilities comprise primary, secondary, and tertiary care facilities. Its tertiary care hospitals provide care in approximately 55 specialties, including cardiac sciences, oncology, critical care, neurosciences, orthopedics, gastroenterology, and transplants. The company also provides other services, such as project consultancy, health insurance, and research services. In addition, it operates pharmacies, primary care clinics, birthing centers, specialized birthing centers, single specialty clinics, primary health centers and diagnostic chains, dental clinics, and daycare and home healthcare centers. The company's footprint includes 10,167 beds, 3,428 pharmacies, and 765 retail healthcare centers. Apollo Hospitals Enterprise Limited was founded in 1979 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600006",
        "website": "http://www.apollohospitals.com",
        "market_cap": "Mid Cap"
    },
    "ASTRAZEN.NS": {
        "short_name": "ASTREZENECA PHARMA",
        "long_name": "AstraZeneca Pharma India Limited",
        "summary": "AstraZeneca Pharma India Limited, a biopharmaceutical company, manufactures, markets, and distributes pharmaceutical products in India and internationally. It manufactures and sells medicines under the Brilinta, Axcer, Forxiga, Oxra, Gledepa, Xigduo, Symbicort, Onglyza, Kombiglyze, Tagrisso, Lynparza, Zoladex, QTERN, and Imfinzi brand names. The company offers products in the areas of cardiovascular, renal, metabolic, oncology, antidiabetic, respiratory, inflammation, and autoimmunity diseases. It also provides clinical trial services. The company was founded in 1979 and is headquartered in Bengaluru, India. AstraZeneca Pharma India Limited is a subsidiary of AstraZeneca Pharmaceuticals AB.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560045",
        "website": "http://www.astrazeneca.com/india",
        "market_cap": "Small Cap"
    },
    "AUROPHARMA.NS": {
        "short_name": "AUROBINDO PHARMA",
        "long_name": "Aurobindo Pharma Limited",
        "summary": "Aurobindo Pharma Limited engages in the research, development, manufacture, and sale of various pharmaceutical products in India. The company primarily offers oral solids, injectables, over the counter drugs, and dietary supplements, as well as active pharmaceutical ingredients and finished dosage forms for central nervous system, cardiovascular, anti-retroviral, anti-diabetics, anti-allergies, gastroenterology, antibiotics, dermatology, respiratory, and oncology, as well as specialty generic formulations. It is also involved in the development of a product pipeline in biosimilar and vaccine segments; and custom research and manufacturing activities for the bio-tech and pharmaceutical community. In addition, the company develops and manufactures peptides, as well as biocatalysts for use in the pharmaceutical and chemical industries. Further, it is developing biosimilar, transdermal patches, inhalers, vaccines, and depot injections. The company also exports its products to approximately 155 countries. It serves multinational companies. The company has an agreement with COVAXX to develop and commercialize COVID-19 Vaccine UB-612 for India and UNICEF. Aurobindo Pharma Limited was founded in 1986 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500084",
        "website": "http://www.aurobindo.com",
        "market_cap": "Mid Cap"
    },
    "BAFNAPH.NS": {
        "short_name": "Bafna Pharmaceuticals Ltd",
        "long_name": "Bafna Pharmaceuticals Limited",
        "summary": "Bafna Pharmaceuticals Limited manufactures and sells generic pharmaceutical products in India. It also exports its products. Bafna Pharmaceuticals Limited was founded in 1981 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600001",
        "website": "http://www.bafnapharma.com",
        "market_cap": "Small Cap"
    },
    "BALPHARMA.NS": {
        "short_name": "BAL PHARMA",
        "long_name": "Bal Pharma Limited",
        "summary": "Bal Pharma Limited manufactures and markets pharmaceutical formulations and active pharmaceutical ingredients (APIs) in India and internationally. The company offers prescription drugs, generics, OTC products, intravenous infusion products, and bulk actives. It provides anti-infectives, pain management, respiratory care, and women's health products under the Aziwin, Ebay, Balvibe, MNF, Ocium, and Monogesic Plus Gel brands; diabetic care products under the Diabend and Diabend M Group brands; herbal/ayurvedic preparations targeting conditions, such as prostate enlargement, renal calculi, male infertility, women health, etc. under the Stonex, Ashwamed, Prostowin, Suswas, Menoleap, and Ayursulin brands; and cardiac care products under the Secremet and Servace brands. The company also offers a range of APIs for therapeutic areas, such as anti-histamine, platelet inhibitor, anti-diabetic, anti convulsant, urinary incontinence, neuropathic pain, anti-allergy, anti-inflammatory, diuretic, acne treatment, etc.; and various formulations. In addition, it engages in the treatment of gastrointestinal disorders; and piles, fistula, and constipation. The company exports its products to Europe, Latin America, Africa, the Far East, the Middle East, and internationally. Bal Pharma Limited was incorporated in 1987 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560052",
        "website": "http://www.balpharma.com",
        "market_cap": "Small Cap"
    },
    "BIOCON.NS": {
        "short_name": "BIOCON LTD",
        "long_name": "Biocon Limited",
        "summary": "Biocon Limited, a biopharmaceutical company, manufactures pharmaceuticals, and medicinal chemical and botanical products. The company operates through Small Molecules, Biologics, Branded Formulations, and Research Services segments. It focuses in the areas of diabetes, oncology, immunology, dermatology, ophthalmology, neurology, rheumatology, and inflammatory diseases. The company provides biosimilars comprising recombinant human insulin, insulin glargine, biosimilar trastuzumab, and other biopharmaceuticals; small molecules, such as active pharmaceutical ingredients and generic formulations; and branded formulation products under the Insugen, Basalog, BIOMAb EGFR, CANMAb, and ALZUMAb brands. It is also involved in the integrated discovery, development, and manufacturing services for small and large molecules, antibody-drug conjugates, and oligonucleotides. The company serves customers in approximately 120 countries. Biocon Limited was founded in 1978 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.biocon.com",
        "market_cap": "Mid Cap"
    },
    "BIOFILCHEM.NS": {
        "short_name": "BIOFIL CHEMICALS &",
        "long_name": "Biofil Chemicals and Pharmaceuticals Limited",
        "summary": "Biofil Chemicals and Pharmaceuticals Limited engages in the pharmaceutical and chemical businesses primarily in India. The company offers basic drugs and chemicals, such as sodium chloride, potassium chloride, sodium citrate, diethyl carbamazine citrate, ferrous sulphate, dried ferrous sulphate, ferrous fumerate, micro crystalline cellulose, and dicyclomine hydrochloride; and plastic dippers and caps. It also provides job work service for manufacturing of pharmaceuticals. The company was founded in 1985 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452015",
        "website": "http://www.biofilgroup.net",
        "market_cap": "Small Cap"
    },
    "BLISSGVS.NS": {
        "short_name": "BLISS GVS PHARMA",
        "long_name": "Bliss GVS Pharma Limited",
        "summary": "Bliss GVS Pharma Limited develops, manufactures, and markets pharmaceutical formulations in India. The company offers pharma products, including capsules, creams/gels/ointments, dry powder for injections and oral suspensions, effervescent tablets, eye/ear drops, injections, liquid preparations, lotions, lozenges, nasal solutions, oral solids, parenterals, pessaries, sachets, soft gelatin capsules, suppositories, suspensions, syrups, tablets, topical preparations, and transdermal patches. It also provides other healthcare products, such as balms, creams, lotions, lozenges, nasal inhalers, over the counter products, petroleum jellies, powders, roll-ons, shampoos, soaps, solutions, sprays, syrups, and vaginal washes. In addition, the company offers therapeutic products consisting of anti-bacterial, anti-biotic, anti-diabetic, anti-diarrheal, anti-emetic, anti-fungal, anti-haemorrhoidal, anti-helmintic, anti-infective, anti-inflammatory, anti-malarial, anti-microbial, anti-migraine, anti-oxidant, anti-protozoal, anti-pyretic, anti-septic, anti-spasmodic, anti-ulcer, and anti-ulcerant; and analgesic, antacid, anxiolytic, appetizer, cough syrup, erectile dysfunction, haematinic, hand sanitizer, health supplement, insecticide, laryngitis, pharyngitis, laxative, lubricant, mosquito repellant, nasal decongestant, nutritional supplement, moisturizer, prickly heat powder, skin lightening lotion, vaginal contraceptive, vaginal hygiene, and vitamin supplements, as well as medicated, complexion, moisturizing, and total protection soaps. It also exports its products. Bliss GVS Pharma Limited was incorporated in 1984 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400072",
        "website": "http://www.blissgvs.com",
        "market_cap": "Small Cap"
    },
    "BROOKS.NS": {
        "short_name": "BROOKS LAB LTD",
        "long_name": "Brooks Laboratories Limited",
        "summary": "Brooks Laboratories Limited manufactures and sells pharmaceuticals on contract basis in India and internationally. The company was founded in 2002 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.brookslabs.net",
        "market_cap": "Small Cap"
    },
    "CADILAHC.NS": {
        "short_name": "CADILA HEALTHCARE",
        "long_name": "Cadila Healthcare Limited",
        "summary": "Cadila Healthcare Limited engages in the research, development, production, marketing, and distribution of pharmaceutical products in India, the United States, and internationally. It offers finished dosage human formulations comprising generics, branded generics, and specialty formulations, including biosimilars and vaccines; active pharmaceutical ingredients; animal healthcare products; and consumer wellness products. The company offers products in the therapeutic areas of pain management, neurology, dermatology, rare diseases, specialty oncology, gastroenterology, and liver diseases. It also provides consumer wellness products, such as Sugar Free and Sugarlite; Complan; EverYuth, a range of skincare products; Nycil, a prickly heat powder; Glucon-D glucose powder; Sampriti Ghee; Nutralite; and various other products. In addition, the company is developing drugs in the areas of oncology, autoimmune disease, nephrology, ophthalmology, inflammation, rheumatology, hepatology, infectious disease, etc. Further, it offers animal healthcare products for various therapeutic areas, such as anti-bacterial, NSAIDs, anti-mastitis, tonics, and poultry vaccines. The company also engages in the retail pharmacy, and manpower supply and administration activities. Cadila Healthcare Limited was founded in 1952 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "382481",
        "website": "http://www.zyduscadila.com",
        "market_cap": "Mid Cap"
    },
    "CAPLIPOINT.NS": {
        "short_name": "CAPLIN POINT LABOR",
        "long_name": "Caplin Point Laboratories Limited",
        "summary": "Caplin Point Laboratories Limited develops, manufactures, markets, and exports generic pharmaceutical formulations and branded generic products in India and internationally. It provides tablets, capsules, vials, ophthalmic products, liquid orals, soft gel capsules, ointments, creams and gels, powder for injections, suppositories and ovules, dermo cosmetics, surgicals and disposables, pre-mix bag formulations, inhalers and sprays, IV infusion products, dry syrups, topicals, and other products, as well as liquid, lyophilized, and pre-filled injection syringes. The company also operates QueTenX, an e-commerce website. Caplin Point Laboratories Limited was founded in 1990 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600096",
        "website": "http://www.caplinpoint.net",
        "market_cap": "Small Cap"
    },
    "CIPLA.NS": {
        "short_name": "CIPLA LTD",
        "long_name": "Cipla Limited",
        "summary": "Cipla Limited, together with its subsidiaries, manufactures and sells pharmaceutical products in India, the United States, South Africa, and internationally. The company offers active pharmaceutical ingredients; and formulations in various therapeutic areas, such as MI, angina, heart failure, hypertension, arrhythmia, lipid abnormalities and diabetes, obesity, HIV, respiratory, oncology, cardio-metabolism, child health, infectious diseases and critical care, hepatitis, women's health, ophthalmology, and neuro psychiatry. It also provides respiratory products, including inhalers and nasal sprays, as well as other dosage forms consists of injectables and biosimilars. Cipla Limited has collaboration with CSIR-Indian Institute of Chemical Technology for the development of medication for the treatment of COVID-19; and partnership with Karwa Ltd. for the commercialization of antibody detection kits for COVID-19, as well as the Premier Medical Corporation Private Limited for the commercialization of the rapid antigen test kits for COVID-19. The company was founded in 1935 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.cipla.com",
        "market_cap": "Large Cap"
    },
    "DCAL.NS": {
        "short_name": "DISHMAN CARBOGEN",
        "long_name": "Dishman Carbogen Amcis Limited",
        "summary": "Dishman Carbogen Amcis Limited provides contract research and manufacturing services to the pharmaceutical industry worldwide. It also manufactures and supplies marketable molecules, such as bulk drugs, intermediates, quaternary ammonium compounds, specialty chemicals, vitamins and chemicals, and disinfectants. The company was incorporated in 1983 and is headquartered in Ahmedabad, India. Dishman Carbogen Amcis Limited is a subsidiary of Adimans Technologies LLP.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380058",
        "website": "http://imdcal.com",
        "market_cap": "Small Cap"
    },
    "DIVISLAB.NS": {
        "short_name": "DIVI'S LABORATORIE",
        "long_name": "Divi's Laboratories Limited",
        "summary": "Divi's Laboratories Limited manufactures and sells generic active pharmaceutical ingredients (APIs) and intermediates for in the United States, Asia, Europe, and internationally. The company also undertakes custom synthesis of APIs and intermediates; and supplies a range of carotenoids, as well as markets vitamins to nutritional, pharma, food/beverage, and feed industries. In addition, it exports its products. The company was formerly known as Divi's Research Center and changed its name to Divi's Laboratories Limited in 1994. Divi's Laboratories Limited was founded in 1990 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500032",
        "website": "http://www.divislabs.com",
        "market_cap": "Large Cap"
    },
    "DRREDDY.NS": {
        "short_name": "DR REDDYS LABS",
        "long_name": "Dr. Reddy's Laboratories Limited",
        "summary": "Dr. Reddy's Laboratories Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Proprietary Products. Dr. Reddy's Laboratories Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Proprietary Products. The Global Generics segment manufactures and markets prescription and over-the-counter finished pharmaceutical products that are marketed under a brand name or as a generic finished dosage with therapeutic equivalence to branded formulations. This segment also engages in the biologics business. The PSAI segment manufactures and markets active pharmaceutical ingredients and intermediates, which are principal ingredients for finished pharmaceutical products. It also provides contract research services; and manufactures and sells active pharmaceutical ingredients and steroids in accordance with the specific customer requirements. The Proprietary Products segment focuses on the research, development, and manufacture of differentiated formulations for dermatology and neurology therapeutic areas. The company also engages in developing therapies in the fields of oncology and inflammation. As of March 31, 2020, it had four late stage projects at various stages of development. The company's therapeutic categories primarily include gastro-intestinal, cardiovascular, anti-diabetic, dermatology, oncology, respiratory, stomatology, urology, and nephrology. It has collaboration, license, and option agreement with Curis, Inc. to discover, develop, and commercialize small molecule antagonists; and partnership with Department of Biotechnology - Biotechnology Industry Research Assistance Council for Sputnik V vaccine clinical trials in India. The company was founded in 1984 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.drreddys.com",
        "market_cap": "Large Cap"
    },
    "ERIS.NS": {
        "short_name": "ERIS LIFESCIENCES",
        "long_name": "Eris Lifesciences Limited",
        "summary": "Eris Lifesciences Limited manufactures, markets, and distributes pharmaceutical products in India. It offers various branded formulations in various therapeutic areas, such as cardiovascular, antiÂ\u0096diabetes, anti- infective, antipyretics, vitamins/nutrients, gastroenterology, acute and chronic respiratory, gynecology, pediatrics, neurology, psychiatry, arthritis, and pain/analgesics, as well as in-vitro fertilization, cancer, multi-therapy, cosmetology, and dermatology. The company also provides blood pressure monitors, infra-red thermometers, nebulizer, and pregnancy testing kits. Eris Lifesciences Limited was founded in 2007 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.eris.co.in",
        "market_cap": "Small Cap"
    },
    "FDC.NS": {
        "short_name": "FDC LTD",
        "long_name": "FDC Limited",
        "summary": "FDC Limited manufactures and markets pharmaceutical products in India and internationally. The company offers specialized formulations for various therapeutic segments, including anti-infective, gastrointestinal, ophthalmological, vitamins/minerals/dietary supplements, cardiac, anti-diabetes, respiratory, gynecology, dermatology, analgesics, and others; and oral rehydration salts. It provides specialized formulations primarily under the Zifi, Electral, Enerzal, Vitcofol, Pyrimon, Zocon, Zoxan, Zathrin, Zipod, Zefu, Cotaryl, and Mycoderm brand names. The company also offers anti-oxidants, balanced energy drinks, and vitamins and nutraceuticals under the Enerzal, Humyl, Mum Mum 1, Prosoyal, Simyl-LBW, Simyl-MCT, and Zefrich brands. In addition, it provides various active pharmaceutical ingredients. FDC Limited was founded in 1936 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400102",
        "website": "http://www.fdcindia.com",
        "market_cap": "Small Cap"
    },
    "FORTIS.NS": {
        "short_name": "FORTIS HLTH (INDIA",
        "long_name": "Fortis Healthcare Limited",
        "summary": "Fortis Healthcare Limited, an integrated healthcare delivery service provider, offers secondary, tertiary, and quaternary care in India, the United Arab Emirates, Sri Lanka, and internationally. Its healthcare verticals comprise hospitals, diagnostics, and day care specialty facilities. The company offers services in the areas of cardiac care, orthopedics, neurosciences, oncology, renal care, metabolic diseases, and mother and child care. As of February 5, 2021, it operated a network of 36 healthcare facilities with approximately 4,000 operational beds. The company also operates approximately 400 diagnostics centers and laboratories; and 1,400 collection centers. The company was founded in 1995 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.fortishealthcare.com",
        "market_cap": "Mid Cap"
    },
    "GLAND.NS": {
        "short_name": "Gland Pharma Limited",
        "long_name": "Gland Pharma Limited",
        "summary": "Gland Pharma Limited engages in the development, manufacture, and marketing of injectable-focused generic liquid parenteral products. The company's primary molecules include heparin sodium, enoxaparin sodium, rocuronium bromide, and daptomycin injections, as well as others. It offers its products under various therapeutic categories, such as anti-infectives, anesthetics, anti-coagulants and their antidotes, anti-malarial, cardiology, gastro-intestinal, hormones and related drugs, fertility supplements, Gnrh agonists and antagonists, anti-neoplastic, gynecological, neuro/Cns, respiratory, blood related, ophthalmological and otological, pain/analgesics, orthopedics, hematinic, vitamins/minerals/nutrients, and others. The company also provides contract development services. It sells its products primarily under a business to business in the United States, Europe, Canada, Australia, India, and the rest of the world. The company was founded in 1978 and is based in Hyderabad, India. As of October 3, 2017, Gland Pharma Limited operates as a subsidiary of Fosun Pharma Industrial Pte. Ltd.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500043",
        "website": "http://www.glandpharma.com",
        "market_cap": "Mid Cap"
    },
    "GLAXO.NS": {
        "short_name": "GLAXO SMITHKLINE P",
        "long_name": "GlaxoSmithKline Pharmaceuticals Limited",
        "summary": "GlaxoSmithKline Pharmaceuticals Limited, a healthcare company, researches, develops, manufactures, and sells pharmaceutical medicines and vaccines in India and internationally. The company offers prescription and non-prescription drugs for asthma, infectious diseases, mental health, and digestive conditions, as well as anti-infective, gastrointestinal, nutrition, dermatology, immuno-inflammation, and respiratory diseases. It also provides vaccines for the treatment of cancer, as well as prevention of hepatitis A, hepatitis B, invasive disease caused by influenza, chickenpox, diphtheria, pertussis, tetanus, rotavirus, cervical cancer, invasive pneumococcal, and others; and consumer healthcare products. The company was formerly known as SmithKline Beecham Pharmaceuticals India Ltd. and changed its name to GlaxoSmithKline Pharmaceuticals Limited in 2001. GlaxoSmithKline Pharmaceuticals Limited was founded in 1924 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.india-pharma.gsk.com",
        "market_cap": "Mid Cap"
    },
    "GLENMARK.NS": {
        "short_name": "GLENMARK PHARM",
        "long_name": "Glenmark Pharmaceuticals Limited",
        "summary": "Glenmark Pharmaceuticals Limited, together with its subsidiaries, develops, manufactures, and markets pharmaceutical products in India, North America, Latin America, Europe, and internationally. The company provides branded and generic formulations in therapeutic areas of dermatology, respiratory, and oncology; and various active pharmaceutical ingredients. Its product pipeline includes ISB 830, an OX40 antagonist monoclonal antibody, which is in Phase 2b clinical trial for the treatment of atopic dermatitis; ISC 17536, an oral transient receptor potential ankyrin-1 antagonist, which has completed Phase 2a clinical trial for the treatment of diabetic peripheral neuropathy; ISB 1302, a HER2 X CD3 beat bispecific antibody, which is in Phase 1/2 clinical trial for the treatment of metastatic HER2-positive breast cancer; and ISB 1342, a CD38 X CD3 beat bispecific antibody that is in Phase 1 clinical trial for the treatment of relapsed/refractory multiple myeloma. The company's pre-clinical stage product pipeline comprises ISB 880 for the for the treatment of anti-inflammatory therapy; ISB 1908 and ISB 1909 T-cell engagers for the treatment of oncology; ISB 1442, an innate immune engager for the treatment of oncology; ISC XXXXX, an HPK1 inhibitor for the treatment of oncology; and GRC 39815, an inhibitor of the retinoid-related orphan receptor gamma t for the treatment of chronic obstructive pulmonary disorder. It also offers Ryaltris nasal spray for allergic rhinitis. The company was founded in 1977 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400099",
        "website": "http://www.glenmarkpharma.com",
        "market_cap": "Mid Cap"
    },
    "GRANULES.NS": {
        "short_name": "GRANULES INDIA",
        "long_name": "Granules India Limited",
        "summary": "Granules India Limited manufactures and sells active pharmaceutical ingredients (APIs), pharmaceutical formulation intermediates, and finished dosages (FDs) in India and internationally. The company's APIs in various therapeutic categories include anti-retrovirals, anti-hypertensives, anti-histamines, anti-infectives, analgesics, anti-coagulants, anti-fibriotics, and platelet inhibitors. It also offers various FDs, such as tablets, caplets, and press-fit capsules in bulk, blister packs, and bottles; and other specialty products for oncology. The Company also exports its products. Granules India Limited was founded in 1984 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.granulesindia.com",
        "market_cap": "Small Cap"
    },
    "GUFICBIO.NS": {
        "short_name": "GUFIC BIOSCIENCES",
        "long_name": "Gufic Biosciences Limited",
        "summary": "Gufic Biosciences Limited engages in the manufacture and marketing of active pharmaceutical ingredients (APIs), generic pharmaceuticals, and related services in India. It manufactures APIs and bulk drugs, such as antifungals, anaesthetics, and immuno suppressants, as well as intermediates for antifungals. The company also manufactures lyophilized injections, which include antibiotic, antifungal, cardiac, infertility, antiviral, and proton-pump inhibitor segments. In addition, it offers spark, criti care, and ferticare pharmaceutical products; and herbal and personal care products. The company supplies its products to hospital chains and medical facilities. It also exports its products. The company was founded in 1970 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400057",
        "website": "http://gufic.com",
        "market_cap": "Small Cap"
    },
    "HCG.NS": {
        "short_name": "HEALTHCARE GLOBAL",
        "long_name": "HealthCare Global Enterprises Limited",
        "summary": "HealthCare Global Enterprises Limited, together with its subsidiaries, provides healthcare services focusing on cancer. The company offers cancer diagnosis and treatment services through radiation therapy, medical oncology, and surgery; and fertility treatment services, as well as reproductive medicine services, including assisted reproduction, gynecological endoscopy, and fertility preservation under the Milann brand. It also operates four multi-specialty hospitals, including three under the HCG brand in Ahmedabad, Bhavnagar, and Rajkot in the state of Gujarat, as well as one under operations and management contract in Hubli in the state of Karnataka that primarily provide cardiology, neurology, orthopedics, gastroenterology, urology, internal medicine, and pulmonary and critical care. In addition, the company offers medical diagnostic services, including scientific testing and consultancy services in the pharmaceutical and medical sector. As of March 31, 2020, it operated 22 cancer centers, including 1 center of excellence in Bengaluru, 3 freestanding diagnostic centers, and 1 day care chemotherapy center across India, as well as 1 center in Africa. The company was founded in 1989 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560027",
        "website": "http://www.hcgel.com",
        "market_cap": "Small Cap"
    },
    "HESTERBIO.NS": {
        "short_name": "HESTER BIOSCIENCES",
        "long_name": "Hester Biosciences Limited",
        "summary": "Hester Biosciences Limited manufactures and trades in veterinary vaccines and health products in India. It operates through Poultry healthcare, Animal Healthcare, and Others segments. The Poultry Healthcare segment vaccines for diseases such as fowl pox, Newcastle disease, infectious bronchitis, and others; feed supplements, such as growth tonic, toxin binder, and herbal supplement; disinfectants for farms and equipment; and sanitizers. The Animal Healthcare segment vaccines for large animals against Goat Pox, Peste des Petits Ruminants, and Brucellosis disease; anti-infective, antiparasite, non-steroidal anti-inflammatory, and anthelmintic drugs; food supplements, including growth tonic, mineral mixture, fertility supplement, and bypass fat; farms and equipment disinfectants; and udder management services. It also offers ELISA & PCR diagnostic kits; NDV and IBV ELISA kits for sero-monitoring of poultry; and PCR molecular diagnostic kits for various diseases. The company also exports its products. Hester Biosciences Limited has a collaboration agreement with Indian Institute of Technology Guwahati to develop vaccine against COVID-19. The company was founded in 1987 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.hester.in",
        "market_cap": "Small Cap"
    },
    "HIKAL.NS": {
        "short_name": "HIKAL LTD",
        "long_name": "Hikal Limited",
        "summary": "Hikal Limited, together with its subsidiaries, manufactures and sells various chemical intermediates, specialty chemicals, and active pharma ingredients to pharmaceutical, food, animal healthcare, biotech, crop protection, and specialty chemicals and biocides companies. It operates in two segments, Pharmaceuticals and Crop Protection. The Pharmaceuticals segment produces active pharmaceutical ingredient (APIs). The Crop Protection segment manufactures pesticides and herbicides. The company collaborates with other companies and offer solutions in contract research, custom synthesis, and custom manufacturing of intermediates and APIs. It also provides specialty biocides and antimicrobial actives, as well as additives for leather, paint coatings, paper, water treatment, personal care, building materials, and textile industries. The company was founded in 1988 and is headquartered in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400614",
        "website": "http://www.hikal.com",
        "market_cap": "Small Cap"
    },
    "INDOCO.NS": {
        "short_name": "INDOCO REMEDIES LT",
        "long_name": "Indoco Remedies Limited",
        "summary": "Indoco Remedies Limited manufactures and sells formulations and active pharmaceutical ingredients in India and internationally. The company offers respiratory products, such as Karvol Plus, Febrex Plus, and Tuspel; stomatologicals products that include Sensodent-K, Sensoform, Sensodent-KF, Snowdent, Kidodent, Rexidin Plus, and Dentogel; gastro intestinal products, such as Carmicide, Cyclopam, Carmicide Drops, Cyclomeff, and Nosic; pain/analgesics products that include Lignox and T-lac; and opthalmological products, such as Renolen, Homide, Tobaren DM, and Mofloren-D. It also provides vitamins/minerals/nutrients that include Methycal, MCBM 69, SM Fibro, Durashape, Trucharge, and Apispur; Urology products, such as Cital, Cital UTI, and Cital-H; Cloben-G and Scabex for derma; ATM for anti-invectives; Otorex for otologicals; Obi X and KG-Low for anti-obesity; Hemsyl for blood related; Dexoren for Opthal/Otologicals; and Vepan, bactogard, and Oxipod for anti-infectives. In addition, the company offers PGVISC eye drops; Aziltence for cardiac therapy; and D-Chiro for gynaec therapy. Further, it provides analytical services, such as impurity profile, particle size analysis, heavy metal analysis, polymorphism, compatibility, extractables and leachables studies, lyophilization studies, reference and working standards, forced degradation studies, and chromatographic method development and validation services. Additionally, the company offers services that include architectural design, lighting, mechanical and utility engineering, project and construction management, electrical, control system, piping, structural design, data transfer system, and process engineering. It serves general practitioners, pediatricians, consultant physicians, dentists, cardiologists, diabetologists, endocrinologists, and nephrologists. The company was formerly known as Indo Continental Trading Company. Indoco Remedies Limited was founded in 1945 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.indoco.com",
        "market_cap": "Small Cap"
    },
    "INDRAMEDCO.NS": {
        "short_name": "INDRAPRASTHS MEDIC",
        "long_name": "Indraprastha Medical Corporation Limited",
        "summary": "Indraprastha Medical Corporation Limited provides hospital services in India. It offers services primarily in the areas of anesthesiology, advanced pediatrics, bone marrow transplant, cosmetic and plastic surgery, dental clinic, dermatology, elder care department, neonatology, general and advance laparoscopic surgery, pediatric urology and pediatric surgery, endocrinology, ear, nose, throat, fetal medicine, gastroenterology and GI surgery, gynecology and obstetrics, heart institutes, infertility care, critical care, bariatric, cancer, emergency, nephrology, neurosciences, orthopedics, robotic surgery, spine, transplant, internal medicine, nuclear medicine, ophthalmology, psychiatry and clinical psychology, radiology/radio diagnosis, rheumatology, urology and andrology, and vascular and endovascular surgery. The company also operates cosmetic and pain clinic, and wellness center, as well as Apollo 24/7 app; and offers services in the areas of sugar, dietetics and clinical nutrition, hyperbaric oxygen therapy, laboratory services, physiotherapy and rehabilitation, and transfusion medicine. Indraprastha Medical Corporation Limited was incorporated in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110076",
        "website": "http://www.delhi.apollohospitals.com",
        "market_cap": "Small Cap"
    },
    "INDSWFTLAB.NS": {
        "short_name": "IND SWIFT LABS",
        "long_name": "Ind-Swift Laboratories Limited",
        "summary": "Ind-Swift Laboratories Limited develops, manufactures, and sells active pharmaceutical ingredients (APIs) in India and internationally. The company offers APIs in various therapeutic areas, including macrolide antibiotic, cardiovascular, antihistaminic, antidiabetic, antipsychotic, bone resorption inhibitor, antimigraine, parkinson disease, hyperparathyrodism, analgesic, aromatase inhibitor, nootropic, antidiarrhoeal/antiprotozoal, anticholinergic, sedative, hypnotic, alcohol abstinence, and antineoplastic, as well as various products for ADHD symptoms. Its impurities portfolio include acamprosate calcium, anastrozole, aripiprazole, aripiprazole, atorvastatin calcium, bexarotene, cinacalcet hydrochloride, clopidogrel bisulphate, clopidogrel hydrochloride, dapoxetine hydrochloride, donepezil hydrochloride, ezetimibe, fexofenadine hydrochloride, imatinib mesylate, ivabradine hydrochloride, ivabradine oxalate, letrozole, mecloxamine citrate, naratriptan hydrochloride, nateglinide, nitazoxanide, quetiapine hemifumarate, raltegravir potassium, ropinirole hydrochloride, rosuvastatin calcium, saxagliptin monohydrate, silodosin, and temozolomide. The company also offers early and late phase drug development, process research and development, contract and API manufacturing, and custom chemicals and synthesis; and analytical development, regulatory support, chemistry, impurity profiling, isolation, discovery, identification and characterization, and project management services. It also exports its products. Ind-Swift Laboratories Limited was founded in 1995 and is based in Manimajra, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Manimajra",
        "zipcode": "160101",
        "website": "http://www.indswiftlabs.com",
        "market_cap": "Small Cap"
    },
    "INDSWFTLTD.NS": {
        "short_name": "IND SWIFT LTD",
        "long_name": "Ind-Swift Limited",
        "summary": "Ind-Swift Limited, a pharmaceutical company, manufactures and sells finished goods dosages, active pharmaceutical ingredients, and herbal products in India. It has a portfolio of approximately 750 products with presence in therapeutic segments of cardiology, diabetology, anti-depressant, anti-allergic, anti-infective, neurology, and oncology. The company offers medicines for the respiratory, including ENT, dentistry, anti-infective, cardio-diabetic, and orthopedic therapies; a range of medicines for gynecology, pediatrics, dermatology, and GP; and antibiotics, anti-infectives, anti-cold, nutraceuticals, anti-convulsants, analgesics, anti-diarrheal, anti-allergics, anti-inflammatory and anti-ulcer drugs, hypolipidaemic drugs, anti-malarial, enzymes, expectorants, antipsychotics, and anti-depressants for treating common ailments, such as fever, cough, cold, diarrhoea, body ache, and infections. It also provides medicines to government dispensaries, hospitals, and remote and rural areas; and Ayurveda products. The company exports its products to approximately 50 countries. Ind-Swift Limited was founded in 1983 and is based in Chandigarh, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chandigarh",
        "zipcode": "160002",
        "website": "http://www.indswiftltd.com",
        "market_cap": "Small Cap"
    },
    "IOLCP.NS": {
        "short_name": "IOL CHEMICALS&PHAR",
        "long_name": "IOL Chemicals and Pharmaceuticals Limited",
        "summary": "IOL Chemicals and Pharmaceuticals Limited manufactures and sells bulk drugs, and organic and inorganic chemical compounds in India and internationally. It operates through Chemicals and Drugs segments. The company offers active pharmaceutical ingredients, such as ibuprofen, metformin hydrochloride, lamotrigine, fenofibrate, and clopidogrel bi sulphate for use in various therapeutic categories, including pain management, anti-diabetic, anti-hypertensive, anti-convulsants, anti-cholesterol, anti-platelet, etc. It also provides specialty industrial chemicals, which include ethyl acetate, iso butyl benzene, acetyl chloride, and mono chloro acetic acid for use in flexible packaging, pharmaceutical, textile, food processing, pesticide, and paint industries. IOL Chemicals and Pharmaceuticals Limited was founded in 1986 and is headquartered in Ludhiana, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ludhiana",
        "zipcode": "141003",
        "website": "http://www.iolcp.com",
        "market_cap": "Small Cap"
    },
    "IPCALAB.NS": {
        "short_name": "IPCA LABORATORIES",
        "long_name": "Ipca Laboratories Limited",
        "summary": "Ipca Laboratories Limited manufactures and markets pharmaceutical formulations and active pharmaceutical ingredients (APIs) for various therapeutic segments in India. The company offers APIs in therapeutic areas of anti-hypertensive, anti-malarial, diuretic, DMARD, and anthelmintic. It also provides generic and branded formulations in the therapeutic segments, including allergy, anti-neoplastic, cardiology, dermatology, diabetes, fever, gastroenterology, hematology, helminthics, hepatoprotective, immunosuppressant, infectious disease, malarial, neurology, nutraceuticals, ophthalmology, orthopedics, probiotics, psychiatry, respiratory, rheumatology, and urology, as well as products in various dosage forms comprising oral solids, powders for suspension, and liquid and dry injections. The company exports its products to approximately 100 countries worldwide. It has an agreement with Medicines for Malaria Venture to develop a novel antimalarial co-formulation named Atoguanil. The company was incorporated in 1949 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400067",
        "website": "http://www.ipca.com",
        "market_cap": "Mid Cap"
    },
    "JAGSNPHARM.NS": {
        "short_name": "JAGSONPAL PHARMACE",
        "long_name": "Jagsonpal Pharmaceuticals Limited",
        "summary": "Jagsonpal Pharmaceuticals Limited develops and manufactures pharmaceuticals products and active pharmaceutical ingredients worldwide. It offers active pharmaceutical ingredients, which include allylestrenol, dextropropoxyphene HCL, dextropropoxyphene napsylate, disulfiram, thiopental sodium, thiopental acid, tolnaftate, and sildenafil citrate, as well as metformin HCL, BP, USP, and EP. The company also provides formulations for various therapeutic categories, such as anabolic steroids, analgesics, anesthetics, anti-allergic, anti-asthamatics, anti-cholinergic agents, anti-convulsants, anti-diabetics, anti-diarrhoeals, anti-emetics, anti-epileptics, anti-fungal agents, anti-gout agents, anti-inflammatory agents, anti-malarials, anti-nauseants, anti-protozoals, anti-pyretic, anti-rheumatic drugs, anti-spasmodic agents, and anti-septic agents. In addition, it offers anti-tubercular drugs, anti-ulcerants, anxiolytics, cardiovascular drugs, corticosteroids, cough syrups, diuretics, drugs for alcohol dependence, GI anti-infectives, haematinics, imaging agents, laxatives, male/female hormones, multivitamins, nutraceuticals, ophthalmic lubricants, oral rehydrating salts, sedative-hypnotics, softgels, systemic anti-infectives, throat pain sprays, tonics, and uterine stimulants. The company sells its products primarily under the Lycored, Maintane, Metadec, Metabol, Doxypal DR, Parvon, and Indocap SR brand names. Jagsonpal Pharmaceuticals Limited was founded in 1964 and is based in New Delhi, India. Jagsonpal Pharmaceuticals Limited is a subsidiary of Aresko Progressive Private Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110049",
        "website": "http://www.jagsonpal.com",
        "market_cap": "Small Cap"
    },
    "JBCHEPHARM.NS": {
        "short_name": "J.B.CHEMICALS & PH",
        "long_name": "J. B. Chemicals & Pharmaceuticals Limited",
        "summary": "J. B. Chemicals & Pharmaceuticals Limited manufactures and markets various pharmaceutical formulations, herbal remedies, and active pharmaceutical ingredients in India and internationally. The company manufactures a range of specialty products that include various pharmaceutical dosage forms. Its principal products include Cilnidipine, Ranitidine, and Metronidazole. The company also provides contract manufacturing services for tablets, lozenges, injectables, gels, creams, ointments, liquid herbal syrups, and capsules; and medicated and herbal lozenges. The company was founded in 1976 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.jbcpl.com",
        "market_cap": "Small Cap"
    },
    "JUBLINGREA.NS": {
        "short_name": "Jubilant Ingrevia Limited",
        "long_name": "Jubilant Ingrevia Limited",
        "summary": "Jubilant Ingrevia Limited provides life science products and solutions in India and internationally. It operates in three segments: Specialty Chemicals, Nutrition & Health Solutions, and Life Science Chemicals. The Specialty Chemicals segment offers specialty ingredients, fine chemicals, crop protection chemicals, and contract development and manufacturing services. The Nutrition & Health Solutions segment provides nutrition and health ingredients, animal nutrition and health solutions, and human nutrition and health solutions. The Life Science Chemicals offers life science ingredients and specialty ethanol. The company also offers pyridine and picolines, cyanopyridines, piperidines, acetyl pyridines, amino pyridines, halo pyridines, pyridine aldehydes, metal complexes, amino pyridines, halogenated pyridines, quaternary salts, alkyl pyridines, vitamin B3 and picolinates, riboflavin phosphate sodium, nutritional premixes, antioxidants, straight ingredients, acetic anhydride, acetic acid, ethyl acetate, propionic anhydride, absolute alcohol, ethanol, biocompost, CO2 and ETO mixtures. In addition, it provides route design, process development, process optimization, and scale-up and commercial manufacturing of intermediates. Further, the company offers vitamins, mineral premixes, stress regulator, amino acid, herbal choline, herbal non-antibiotic growth promoter and egg quality enhancer, toxin binder, acidifiers, and enzymes and emulsifiers. It serves pharmaceutical, nutrition, agrochemical, consumer, and industrial customers. The company was formerly known as Jubilant LSI Limited and changed its name to Jubilant Ingrevia Limited in October 2020. Jubilant Ingrevia Limited was incorporated in 2019 and based in Noida, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://jubilantingrevia.com",
        "market_cap": "Small Cap"
    },
    "JUBLPHARMA.NS": {
        "short_name": "JUBILANT PHARMOVA LTD",
        "long_name": "Jubilant Pharmova Limited",
        "summary": "Jubilant Pharmova Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Pharmaceuticals; Drug Discovery & Development Solutions; and Proprietary Novel Drugs. The Pharmaceuticals segment engages in the manufacturing and supply of allergy therapy products, contract manufacturing of sterile injectables and non-sterile products, active pharmaceutical ingredients, and solid dosage formulations, as well as sale of radiopharmaceuticals through a network of 49 radio pharmacies in the United States. The Drug Discovery & Development Solutions segment provides collaborative research services to pharmaceutical innovators. The Proprietary Novel Drugs segment develops therapies in the areas of oncology and auto-immune disorders. The company was formerly known as Jubilant Life Sciences Limited and changed its name to Jubilant Pharmova Limited in February 2021. The company was incorporated in 1978 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.jubilantpharmova.com",
        "market_cap": "Small Cap"
    },
    "KILITCH.NS": {
        "short_name": "KILITCH DRUGS(INDI",
        "long_name": "Kilitch Drugs (India) Limited",
        "summary": "Kilitch Drugs (India) Limited engages in the development and operation of pharmaceutical business in India. The company offers parenteral and nasal products, including gastroenterology, anti-inflammatory, anticonvulsant/antiepileptic, anti-malarial, aminoglycoside, antibacterial, anti-hypertensive, anti-infective, diagnostic, sympathomimetic, local anesthetic, neurotonic, uterine stimulant, external preparation, non-steroidal anti-inflammatory, oncology, ophthalmic, and other drugs, as well as vaccines and veterinary products in the form of ampoules, vials, and dry powder injectables. Its parenteral and nasal products also include iron supplements for the treatment of anemia; and metered nasal drops, as well as Klavmox and Onecef products. The company also provides a range of oral formulations, including tablets, capsules, dry syrups, gripe water, and oral powders and liquids in the antibiotic, anti-diabetics, cardiovascular, and other areas. In addition, it offers effervescent tablets and powders, such as ROIPAR, DUREGRA, ROIVIT, and PH-7; and a range of nutritional products comprising CELTINE. Further, the company provides C-Seal, a topical skin adhesive to hold closely approximated skin edges without marks of sutures and incisions. Additionally, it offers cosmetics and herbal products consisting of a range of oils, lotions, liquids, creams, and paste in skin, personal, and hair care categories, as well as herbal products used in sore throat and prostate problems; and as a supplement for diabetes, obesity, libido, and other conditions. The company also exports its products. Kilitch Drugs (India) Limited was founded in 1978 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400088",
        "website": "http://www.kilitch.com",
        "market_cap": "Small Cap"
    },
    "KOPRAN.NS": {
        "short_name": "KOPRAN LTD",
        "long_name": "Kopran Limited",
        "summary": "Kopran Limited, an integrated pharmaceutical company, manufactures and sells active pharmaceutical ingredients and finished dosage forms in India and internationally. The company offers finished dosage forms, including tablets, capsules, dry powder, suspension, and injectable in various therapeutic areas comprising cardiovascular, gastrointestinal, pain management, oncology, anti-allergic, central nervous system, erectile dysfunction, and others, as well as antibiotics, anti-diabetic, respiratory, anthelmentics, antiprotozoals, and antipeptic ulcer and gut. It also provides active pharmaceutical ingredients in the categories of anti-hypertensive, macrolide, neuromodulator, sterile cephalosporins, carbapenems, anti-acne, anti-ulcerant, anti-depressent, anti-infective, urological, and anti-thrombotic. The company was incorporated in 1958 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.kopran.com",
        "market_cap": "Small Cap"
    },
    "KREBSBIO.NS": {
        "short_name": "KREBS BIOCHEM&INDS",
        "long_name": "Krebs Biochemicals & Industries Limited",
        "summary": "Krebs Biochemicals & Industries Limited manufactures and sells active pharmaceutical ingredients in India. The company develops biotech processes for application in medicine, agriculture, and industry fields. Its products, such as androstenedione, lovastatin, and simvastatin for anti-cholesterol and steroid intermediate applications. The company is also developing various products, including amlodipine, cetirizine, orlistat, serratiopepetidase, telmisartan, and phenylephrine for anti-hypertension, anti-histamine, anti-obesity, anti-inflammatory, and cold and cough applications. In addition, it offers contract manufacturing services for large pharmaceutical and multinational companies. Krebs Biochemicals & Industries Limited was founded in 1991 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://krebsbiochem.com",
        "market_cap": "Small Cap"
    },
    "LALPATHLAB.NS": {
        "short_name": "DR LAL PATHLABS LT",
        "long_name": "Dr. Lal PathLabs Limited",
        "summary": "Dr. Lal PathLabs Limited provides diagnostic and related healthcare tests and services in India and internationally. It operates laboratories for carrying the pathological investigations of various branches of biochemistry, hematology, histopathology, microbiology, electrophoresis, immuno-chemistry, immunology, virology, cytology, and other pathological and radiological investigations. The company offers pathology and radiology testing; lab staff training; technical; and lab management services. As of March 31, 2020, the company had 216 clinical laboratories, including National Reference Lab at Delhi and Regional Reference Lab at Kolkata; and 3,095 patient service centers and 6,995 pick-up points. Dr. Lal PathLabs Limited was founded in 1949 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.lalpathlabs.com",
        "market_cap": "Mid Cap"
    },
    "LASA.NS": {
        "short_name": "LASA SUPERGENERICS",
        "long_name": "Lasa Supergenerics Limited",
        "summary": "Lasa Supergenerics Limited engages in the research, manufacture, and marketing of animal and human healthcare products primarily in India. It offers veterinary and other API products, anthelmintic products, animal feed ingredients, and reagents for therapeutic use. The company also exports its products. Lasa Supergenerics Limited was incorporated in 2016 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400059",
        "website": "http://lasalabs.com",
        "market_cap": "Small Cap"
    },
    "LAURUSLABS.NS": {
        "short_name": "LAURUS LABS LTD",
        "long_name": "Laurus Labs Limited",
        "summary": "Laurus Labs Limited, together with its subsidiaries, engages in the research, development, manufacture, and sale of medicines and active pharmaceutical ingredients (APIs) in India and internationally. It operates through Generics APIs, Generics Finished Dosage Forms (FDF), and Synthesis segments. The Generics APIs segment develops, manufactures, and sells APIs and advanced intermediates for anti-retroviral (ARV), oncology, hepatitis C, cardiovascular, antidiabetic, anti-asthmatic, gastroenterology, and ophthalmic therapeutic areas. The Generics FDF segment develops and manufactures oral solid formulations for ARVs, anti-diabetic, cardiovascular, proton pump inhibitors, and central nervous system. The Synthesis segment provides contract development and manufacturing services for pharmaceutical companies. The company also manufactures and sells specialty ingredients used in the nutraceutical, dietary supplements, and cosmeceutical products. In addition, it offers chemistry, IP development, business support, and related services to the pharmaceutical community. The company was incorporated in 2005 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.lauruslabs.com",
        "market_cap": "Mid Cap"
    },
    "LINCOLN.NS": {
        "short_name": "LINCOLN PHARMA LTD",
        "long_name": "Lincoln Pharmaceuticals Limited",
        "summary": "Lincoln Pharmaceuticals Limited manufactures and sells pharmaceutical products in India and internationally. It offers products in the areas of anti-infective, respiratory system, gynecology, cardio and CNS, anti-bacterial, ant-diabetic, anti-malaria, and others areas. The company also trades in pharmaceutical products. Lincoln Pharmaceuticals Limited was founded in 1979 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380062",
        "website": "http://www.lincolnpharma.com",
        "market_cap": "Small Cap"
    },
    "LOTUSEYE.NS": {
        "short_name": "LOTUS EYE HOSPITA",
        "long_name": "Lotus Eye Hospital and Institute Limited",
        "summary": "Lotus Eye Hospital and Institute Limited, an eye hospital, provides eye care services in India. It offers services in the areas of refractive surgery, retina and uvea, cornea, glaucoma, paediatric and squint, orbit and oculoplasty, and neuro ophthalmology, as well as binocular vision. The company also provides cataract and intraocular lenses, as well as operates an eye bank. In addition, it offers ophthalmic fellowship training courses in cornea, glaucoma, retina, and anterior segments, as well as DNB teaching and training services. The company was formerly known as Lotus Eye Care Hospital Limited and changed its name to Lotus Eye Hospital and Institute Limited in April 2013. Lotus Eye Hospital and Institute Limited was incorporated in 1997 and is based in Coimbatore, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Coimbatore",
        "zipcode": "641014",
        "website": "http://www.lotuseye.org",
        "market_cap": "Small Cap"
    },
    "LUPIN.NS": {
        "short_name": "LUPIN LTD",
        "long_name": "Lupin Limited",
        "summary": "Lupin Limited, a pharmaceutical company, manufactures and distributes a range of branded and generic formulations, biotechnology products, active pharmaceutical ingredients, and specialty products in India, the United States, Japan, and internationally. The company offers formulations for use in the therapeutic areas of cardiovascular, diabetology, asthma, pediatrics, central nervous system, gastro-intestinal, anti-infective, non-steroidal anti-inflammatory drug therapy, anti-TB, and cephalosporin. It also develops and commercializes various drug delivery platforms; and provides biosimilar products. In addition, the company engages in the provision of the over-the-counter products, and contract manufacturing and supply services; and drug discovery and development programs in the therapeutic areas of oncology, immunology, and metabolic disorders, as well as bio clinical research activities. Lupin Limited has a licensing, development, and commercialization agreement with Boehringer Ingelheim for Lupin's MEK inhibitor compound (LNP3794) as a potential targeted therapy for patients with cancers. The company was formerly known as Lupin Chemicals Limited and changed its name to Lupin Limited in 2001 as a result of its amalgamation with Lupin Laboratories Limited. Lupin Limited was founded in 1968 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.lupin.com",
        "market_cap": "Mid Cap"
    },
    "LYKALABS.NS": {
        "short_name": "LYKA LABORATORIES",
        "long_name": "Lyka Labs Limited",
        "summary": "Lyka Labs Limited engages in manufacturing pharmaceutical formulations and active pharmaceutical ingredients various therapeutic segments in India. It manufactures and sells various formulations, including emollient, topical steroid, antifungal agent, topical anti-bacterial, acne management, dermatological formulation, pain killer, anti-aging, cleansing lotion, hair care, anti-dandruff shampoo, sunscreen, anti-acne, cosmeceutical, anti-oxidant, proton pump inhibitor, anti-malarial, anti-bacterial, corticosteroid hormones, cephalosporin, dry powder injection, muscle relaxant, bone resorption inhibitor, anti-oxidant/liver disease, antibiotic, and lyophilized products. The company also provides contracted manufacturing services to various large pharmaceutical companies; and medical and technical assistance in the areas of manufacturing know how and manufacturing facilities, as well as technical data, such as molecule stability testing data, impurity profile, BA/BE clinical study data, etc. In addition, it provides products and services in therapeutic categories, such as intensive care, gastroenterology, anti-infective, anti-fungal, surgery care, cosmetologist, urology, wound care, and anesthesia, as well as deals in pharmaceutical products. Lyka Labs Limited offers its products in various formulations, including injections, creams, ointments, foams, gels, and lotions. Further, the company exports its products to Bangladesh, Combodia, Congo, Costa Rica, Peru, Romania, Russia, Sri Lanka, Sudan, Ukraine, Venezuela, and Vietnam. Lyka Labs Limited was incorporated in 1976 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400036",
        "website": "http://www.lykalabs.com",
        "market_cap": "Small Cap"
    },
    "MANGALAM.NS": {
        "short_name": "MANGALAM DRUGS & O",
        "long_name": "Mangalam Drugs & Organics Limited",
        "summary": "Mangalam Drugs & Organics Limited manufactures and sells drugs, medicines, and allied products in India and internationally. It offers a range of active pharmaceutical ingredients, intermediates, and specialty chemicals, as well as impurities for use in anti-malarial, analgesic/anti-inflammatory, anti-hypertensive, and anti-retroviral applications. Mangalam Drugs & Organics Limited was incorporated in 1972 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.mangalamdrugs.com",
        "market_cap": "Small Cap"
    },
    "MARKSANS.NS": {
        "short_name": "MARKSANS PHARMA LT",
        "long_name": "Marksans Pharma Limited",
        "summary": "Marksans Pharma Limited, together with its subsidiaries, researches, develops, manufactures, markets, distributes, and sells generic pharmaceutical formulations in North America, Europe, the United Kingdom, Australia, New Zealand, and internationally. The company offers products in the analgesic, anti-inflammatory, benign prostatic hyperplasia, epilepsy, hyperparathyroidism, diabetic and antidiabetic, pain management, neurology, antacid, hormonal, antifungal, antiulcerative, cardiovascular and central nervous system, vitamin, cough and cold, dermatology, gastrointestinal, gynecology, cephalosporin, injectable, antibacterial, hypertension, oncology, and antibiotics and anti-allergic therapeutic areas. It also provides contract research and manufacturing services; and develops and out-licenses patented products. The company was incorporated in 1992 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.marksanspharma.com",
        "market_cap": "Small Cap"
    },
    "MAXHEALTH.NS": {
        "short_name": "Max Healthcare Ins Ltd",
        "long_name": "Max Healthcare Institute Limited",
        "summary": "Max Healthcare Institute Limited provides healthcare services in India. It offers services in various specialties, including cancer care/oncology, liver transplant and biliary sciences, cardiac sciences, neuro sciences, orthopaedics, bariatric/weight loss surgery, minimal access/laparoscopic surgery, bone marrow transplant, kidney transplant, nephrology, and aesthetic and reconstructive surgery. As of August 31, 2020, the company operated a network of 17 healthcare facilities, including 11 state-of-the-art tertiary and quaternary care hospitals, one secondary care hospital, and five OPD and day care centers. The company is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.maxhealthcare.in",
        "market_cap": "Mid Cap"
    },
    "MAXIND.NS": {
        "short_name": "Max India Limited",
        "long_name": "Max India Limited",
        "summary": "Max India Limited operates in the senior care and skilling industry. The company operates residential communities for seniors; and provides assisted care services. It is also involved in the learning and development activities; and distribution of insurance and other financial products. The company, formerly known as Advaita Allied Health Services Limited, was incorporated in 2019 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.maxindia.com",
        "market_cap": "Small Cap"
    },
    "METROPOLIS.NS": {
        "short_name": "METROPOLIS HEALTHC",
        "long_name": "Metropolis Healthcare Limited",
        "summary": "Metropolis Healthcare Limited provides pathology and diagnostic laboratory services in India and internationally. The company offers clinical laboratory testing, and profiles and support services to patients, smaller labs, nursing homes, and hospitals. It provides diagnostic services for oncology, neurology, gynecology, and nephrology, as well as various health check-up packages for men, women, senior citizens, and youth and corporates. The company's tests and profiles are used for prediction, early detection, diagnostic screening, confirmation, and/or monitoring of the disease. It also offers corporate wellness and hospital laboratory solutions, as well as clinical research services. As of March 31, 2020, the company operated 124 clinical laboratories, 9,000 pick-up points, and 598 assisted referral centers. Metropolis Healthcare Limited was founded in 1980 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.metropolisindia.com",
        "market_cap": "Small Cap"
    },
    "MOREPENLAB.NS": {
        "short_name": "MOREPEN LABORATORI",
        "long_name": "Morepen Laboratories Limited",
        "summary": "Morepen Laboratories Limited develops, manufactures, markets, and sells active pharmaceutical ingredients (APIs), formulations, and home health products in India, the United States, and internationally. The company offers APIs for anti-histaminic, anti-asthmatic, anti-hypercholesterolemic, anti-diabetic, and anti-hypertensive; and formulations for antibiotics, gastro-intestinal, CNS, ortho and pain, calcium metabolism, respiratory and anti-allergic, and nutraceuticals and vitamins, as well as diabetes and related complications, and cardiology therapy. It also provides blood glucose and pressure monitors, nebulizers, vaporizers, weighing scales, thermometers, pulse oximeters, massagers and heat therapy, hot water bottles, stethoscopes, sphygmomanometers, ultrasonic nebulizers, fetal Doppler, anti-decubitus air mattress, adult diapers, instant dry under mats, and breathable non-woven tapes. In addition, it provides Burnol for burns and cuts; Forever Young that enhances sexual life, stamina, energy, power, and strength; Lemolate Gold for cold relief; Lemolate- Cough Syrup; Fibre-X Sat-Isabgol, a natural laxative product; Fever-X, a fever reducer; Option72, an emergency contraceptive; Dabgel, an antacid; MoreVital+, a dietary supplement; QuickChek, a pregnancy card; Exygra, a sildenafil citrate; facewashes; Itch Beat for itching; and 2 Kool hair oil. Further, the company offers Active Smile, which is Mouthwash; Dr. Morepen Daily, a health supplement; MTP Kit, a contraception pill; VCalci, a calcium tab; Clean & Pure, an intimate hygiene wash; Liv Healthy, a liver tonic; Head-X for headache; Dr. Morepen Aid, an adhesive first aid dressing; Dr. Morepen Buds, an ear cleaning cotton bud; Cold-EX for cold and cough; Paachan-Arishta, an ayurvedic digestive tonic; and adult nasal spray. Additionally, the company is involved in product contract manufacturing and brand sharing businesses. Morepen Laboratories Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.morepen.com",
        "market_cap": "Small Cap"
    },
    "NATCOPHARM.NS": {
        "short_name": "NATCO PHARMA LTD",
        "long_name": "NATCO Pharma Limited",
        "summary": "NATCO Pharma Limited, a pharmaceutical company, develops, manufactures, and markets finished dosage formulations and active pharmaceutical ingredients (APIs). It offers formulations in various therapeutic areas, including cancers of blood, liver, kidney, lung, brain, breast, ovary, etc.; and APIs in various categories, such as oncology, central nervous system, pain management, and CV care. The company also offers orthopedic products comprising bisphosphonates, which are oral and injectable drugs; and gastroenterology products consisting of novel drugs for chronic hepatitis-B and hepatitis-C, as well as contract manufacturing services. In addition, it provides cardiology and diabetology products for the treatment of hypertension, stable angina and CHF, bosentan, pulmonary arterial hypertension, and others. The company markets its products in approximately 40 countries, including India, the United States, and internationally.NATCO Pharma Limited was incorporated in 1981 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.natcopharma.co.in",
        "market_cap": "Mid Cap"
    },
    "NECLIFE.NS": {
        "short_name": "NECTAR LIFESCIENCE",
        "long_name": "Nectar Lifesciences Limited",
        "summary": "Nectar Lifesciences Limited manufactures and sells pharmaceutical products in India and internationally. The company offers contract research and manufacturing services, including process development and optimization, process scale up and validation, preparation and international submission of drug master files and certificates of suitability, multi kilo pilot plant production, bulk production, and chiral resolution; and chemical and analytical development, as well as analytical, manufacturing, and engineering consulting services. Its active pharmaceutical ingredients and intermediates comprise cefixime trihydrate, cefuroxime axetil, cefpodoxime proxetil, cefdinir, ceftriaxone sodium, cefotaxime sodium, cefuroxime sodium, ceftazidime, cefepime HCl, cephalothin, cefazolin sodium, cefprozil, cefoperzone sodium, cefpirome sulphate, and cefoxitin sodium. The company also offers contract manufacturing for finished dosage forms, such as tablets, capsules, dry powder oral suspensions, and granules and injectable for cephalosporins. In addition, it provides a range of diagnostics products; and empty hard gelatin capsules. Further, the company menthol crystals, menthol powders and flakes, peppermint oils, dementholized peppermint oils, and menthone; CIS-3 hexenol, CIS-3-hexenol acetate/leaf acetate, and CIS-3-hexenol butyrate; mentha piperita oils, spearmint oils, distilled mentha oils/commint oils, distilled menthofuran, limonene, 3-octanol, terpenes, alpha pinene, beta pinene, 1.8 cineol, and ISO menthol; and menthone glycerol ketal, menthyl acetate, menthyl lactate, terpineol BP/USP/perfumery, pine oils, terpinolene, terpinen 4 ol, terpinyl acetate, lavendor ketone (3-Octanone), 3 menthyl cyclohexenone, and gamma terpinene. Nectar Lifesciences Limited was founded in 1995 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.neclife.com",
        "market_cap": "Small Cap"
    },
    "NEULANDLAB.NS": {
        "short_name": "NEULAND LABORITIE",
        "long_name": "Neuland Laboratories Limited",
        "summary": "Neuland Laboratories Limited manufactures and sells active pharmaceutical ingredients (APIs) in India, Europe, the United States, and internationally. The company's APIs are used in various therapeutic areas, including antiasthmatics, cardiovasculars, antifungal, anticonvulsants, antiemetic, central nervous system, fluoroquinolones, corticosteroids, antipsychotic, antibacterial and anti-parkinson, anti-ulcerants, and prostaglandins. It also provides custom manufacturing solutions, as well as peptide synthesis services. The company was founded in 1984 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.neulandlabs.com",
        "market_cap": "Small Cap"
    },
    "NH.NS": {
        "short_name": "NARAYANA HRUDAYALA",
        "long_name": "Narayana Hrudayalaya Limited",
        "summary": "Narayana Hrudayalaya Limited provides healthcare services. The company operates a chain of multispecialty, tertiary, and primary healthcare facilities. It offers services in approximately 30 specialties, including cardiology and cardiac surgery, cancer care, neurology and neurosurgery, endocrinology, orthopedics, nephrology and urology, obstetrics, pediatrics, neonatology, gynecology, oncology, and gastroenterology. The company operates through a network of 24 hospitals, 7 heart centers, and 19 primary care facilities in India, as well as an international hospital in the Cayman Islands with approximately 6,200 operational beds. Narayana Hrudayalaya Limited was founded in 2000 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560099",
        "website": "http://www.narayanahealth.org",
        "market_cap": "Small Cap"
    },
    "NOVARTIND.NS": {
        "short_name": "NOVARTIS INDIA",
        "long_name": "Novartis India Limited",
        "summary": "Novartis India Limited primarily trades in drugs and pharmaceuticals. The company offers pharmaceutical products in the areas of bone and pain, calcium portfolio, gynecology, and neurosciences. It also provides generics medicines for anti-TB, anti-infective, and gynecology; and tyrosine kinase inhibitor for cancer under Glive brand name, as well as eye care products. The company offers central nervous system products under the Tegrital and Exelon brand name; pain and Inflammation products under the Voveran brand; and transplantation/immunology products under the Simulect, Certican, Myfortic Sandimmun, and Neoral brand names. In addition, it provides consignment, clinical research support, and field force support services. The company was incorporated in 1947 and is headquartered in Mumbai, India. Novartis India Limited is a subsidiary of Novartis AG.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.novartis.in",
        "market_cap": "Small Cap"
    },
    "NURECA.NS": {
        "short_name": "Nureca Limited",
        "long_name": "Nureca Limited",
        "summary": "Nureca Limited, a B2C company, engages in the home healthcare and wellness products business primarily in India. It offers electric massagers, nebulizers, blood pressure monitors, glucometers, infrared thermometers for temperature scanning, fingertip pulse oximeters, weighing scales, home spa humidifiers and steamers, office electronics, rapid test kits, USB port car mobile chargers, and car mobile holder magnetic stands; and rehabilitation, mother and baby care, personal care and hygiene, nutrition, connected health care, and fitness products. The company offers its products under Dr Trust, Dr Physio, and Dr Trust brands. Its products provide consumers with tools to monitor chronic ailments and other diseases. The company sells its products through online channel partners comprising e-commerce companies, distributors, and retailers; and through its website, drtrust.in. Nureca Limited was incorporated in 2016 and is based in Chandigarh, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chandigarh",
        "zipcode": "160017",
        "website": "http://www.nureca.com",
        "market_cap": "Small Cap"
    },
    "OPTOCIRCUI.NS": {
        "short_name": "OPTO CIRCUITS IND",
        "long_name": "Opto Circuits (India) Limited",
        "summary": "Opto Circuits (India) Limited manufactures and trades in invasive and non-invasive medical equipment in India and internationally. It operates through Sensors, Monitors, and Others segments. The company offers data management and connectivity products that connect to hospital information systems, electronic medical records, and other information systems; defibrillation systems to detect and identify arrhythmias; non-invasive vascular diagnostic systems to detect peripheral arterial disease; and respiratory and anesthesia monitoring products to identify and quantify inspired and expired CO2, O2, and N2O. It also provides non-invasive reusable and disposable sensors, extension and adapter cables, neo wraps, Y tapes, and Water Traps and ComfortCuffs, as well as batteries, defibrillation pads, electrodes, doppler probes, and other accessories and consumables; veterinary care products to diagnose, measure, and monitor parameters on animals; and vital signs patient monitoring equipment to measure and display a patient's vital signs. In addition, the company offers cardiac stents; catheters and related disposable products in the fields of urology, gastroenterology, and gynecology; PTA balloons to decrease the stimulus of chronic inflammation and the trigger for late thrombosis; and orthopedic implants, as well as surgical consumables, such as endernails and wound suction drainage systems. Further, it offers education and training, technical support, and professional services, as well as turnkey solutions in specialty ambulances, modular operation theatres, and cathlabs; and services in information technology, global positioning systems, and electronic design automation. The company serves physicians, general practitioners and specialists, clinics, and hospitals. Opto Circuits (India) Limited was founded in 1992 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.optoindia.com",
        "market_cap": "Small Cap"
    },
    "ORCHPHARMA.NS": {
        "short_name": "Orchid Pharma Limited",
        "long_name": "Orchid Pharma Limited",
        "summary": "Orchid Pharma Limited, a pharmaceutical company, engages in the development, manufacture, and marketing of bulk actives, formulations, and nutraceuticals in India. Its active pharmaceutical ingredients product portfolio includes oral cephalosporins, injectable cephalosporins, veterinary products, and non-antibiotics. The company also provides anti-infectives, anti-inflammatory, central nervous system, cardio vascular segment, nutraceuticals, and other oral and sterile products, as well as offers new drug discovery systems and pharmaceutical research and development services. It also exports its products to approximately 40 countries internationally. The company was formerly known as Orchid Chemicals & Pharmaceuticals Limited and changed its name to Orchid Pharma Limited in October 2015. Orchid Pharma Limited was founded in 1992 and is headquartered in Chennai, India. Orchid Pharma Limited is a subsidiary of Dhanuka Laboratories Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.orchidpharma.com",
        "market_cap": "Small Cap"
    },
    "ORTINLAB.NS": {
        "short_name": "Ortin Laboratories Ltd",
        "long_name": "Ortin Laboratories Limited",
        "summary": "Ortin Laboratories Limited manufactures and trades in pharmaceuticals, drugs, and intermediates in India. The company offers various pharmaceutical formulations of tablets, capsules, syrups, and dry powders. It provides formulations, such as anti diabetics, anti allergics, sedatives and tranquilisers, anti helmenthetics, analgesics and antipyretics, anti biotics-quinolones, anti biotic-pencillins, cephalosporins, and macrolides; and anti anginal and cardio vascular, and antifungal products. The company's formulations also include chemo therapeutics, antacids and anti ulcerants, anti spasmodics, calcium preparations, iron preparations, anti arthritic drugs, protein supplements, enzymes, and vitamins, as well as psychiatry, appetizer, gynaec, and anti retroviral products. In addition, it provides active pharmaceutical ingredient (API) intermediates comprising anti retro viral, anti diabetics, analgesics and antipyretics, anti biotic, antifungal, antacids and anti ulcerants, and anti malarials; and manufactures fine chemicals, and grignard and alkali metal products. Further, the company offers services in the areas of process development, process characterization, analytical research and development, assay development, and product characterization; and diagnostic services, including development of rapid flow kits, assays, and reagents. Additionally, it undertakes long-term contracts for manufacturing intermediates and developing new APIs; and operates as a merchant exporter of pharmaceutical finished formulations. Ortin Laboratories Limited was founded in 1986 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500 027",
        "website": "http://www.ortinlabsindia.com",
        "market_cap": "Small Cap"
    },
    "PANACEABIO.NS": {
        "short_name": "PANACEA BIOTEC LTD",
        "long_name": "Panacea Biotec Limited",
        "summary": "Panacea Biotec Limited, a biotechnology company, engages in the research, development, manufacture, and marketing of pharmaceuticals, vaccines, and biosimilar in India. The company operates through Vaccines, Formulations, and Real Estate segments. Its product portfolio includes prescription products in various therapeutic areas, including pain management, diabetes and cardiovascular management, oncology, renal disease management, osteoporosis management, anti-tubercular, and gastro-intestinal care; and vaccines for anthrax, dengue, Japanese encephalitis, and others. The company also engages in the real estate business. In addition, it exports its products to approximately 30 countries worldwide. The company has a collaboration agreement with Refana Inc. for the development, manufacturing, and distribution of the Covid-19 vaccine. Panacea Biotec Limited was founded in 1984 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110044",
        "website": "http://www.panaceabiotec.com",
        "market_cap": "Small Cap"
    },
    "PDPL.NS": {
        "short_name": "PARENTERAL DRUG",
        "long_name": "Parenteral Drugs (India) Limited",
        "summary": "Parenteral Drugs (India) Limited operates as a healthcare company in India. The company manufactures pharmaceutical products, including intravenous infusion, inhalation, veterinary infusion, etc. It also offers IV fluids, such as carbohydrates and electrolytes, diuretics, dialysis and irrigation solutions, anti-infective and anti-fungal products, and others; and oncology and anesthesia products. The company also exports its products in Iraq, Yemen, Mozambique, Ghana, Kenya, Kyrgyzstan, Uzbekistan, Sudan, Vietnam, Cambodia, Liberia, Sri Lanka, Nepal, Myanmar, and Cameroon. The company was founded in 1983 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.pdindia.com",
        "market_cap": "Small Cap"
    },
    "PFIZER.NS": {
        "short_name": "PFIZER LTD",
        "long_name": "Pfizer Limited",
        "summary": "Pfizer Limited manufactures, markets, trades in, and exports pharmaceutical products in India and internationally. It offers its various products in various therapeutic areas, including anti-allergic, anti-diabetic, antihistamine, anti-infective, anti-parasitic, cardiovascular, dermatology, erectile dysfunction, neurology, pain/fever/inflammation, pediatrics, psychiatry, respiratory, urology, women's health, central nervous system, autoimmune disorders, and gastrointestinal. The company also provides multivitamins, vitamins/minerals, antibiotics, steroids, vaccines, and consumer healthcare products. It sells its products through a network of independent distributors primarily under the Minipress XL, Folvite, Magnex, Eliquis, Gelusil, Lyrica, Ovral L, Citralka, Prevenar 13, Autrin, Zavicefta, Wysolone, Xeljanz, Corex, Mucaine, Becosules, Ativan, Neksium, Meronem, And Dolonex brand names. Pfizer Limited has a strategic partnership with GlobalSpace Technologies Limited to leverage the Makebot platform for vaccine awareness and DocExa platform for consultation by specialists. The company was incorporated in 1950 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.pfizerindia.com",
        "market_cap": "Mid Cap"
    },
    "PGHL.NS": {
        "short_name": "PROCTER & GAMBLE HEALTH L",
        "long_name": "Procter & Gamble Health Limited",
        "summary": "Procter & Gamble Health Limited manufactures and markets pharmaceuticals and chemicals in India. It provides over-the-counter products, vitamins, minerals, and supplements, as well as cough and cold products. The company offers its products under the Polybion, Neurobion, Evion, Nasivion, Livogen, and Seven Seas brands. Procter & Gamble Health Limited also exports its pharmaceutical products to Sri Lanka, Nepal, Myanmar, and Maldives. The company was formerly known as Merck Limited and changed its name to Procter & Gamble Health Limited in May 2019. The company was founded in 1967 and is headquartered in Mumbai, India. As of June 30, 2020, Procter & Gamble Health Limited operates as a subsidiary of Procter & Gamble Overseas India B.V.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400079",
        "website": "http://www.pghealthindia.com",
        "market_cap": "Small Cap"
    },
    "POLYMED.NS": {
        "short_name": "POLY MEDICURE LTD",
        "long_name": "Poly Medicure Limited",
        "summary": "Poly Medicure Limited manufactures and sells medical devices in India. It offers infusion devices, such as I.V. cannulas, mid line catheters, needle free connectors, three way stop cocks, I.V. infusion sets, extension lines, T-type extension sets, stylet/mandrin with luer locks, and safety winged infusion sets; and central venous catheters, vial access spikes, measured volume fluid administration sets, and CVP manometers. The company also provides anesthesia devices, including endotracheal tubes, tracheostomy tubes, mucus extractors, ventilator circuits, bain circuits, catheter mounts, spinal needles, HME filters, and laryngeal mask airways; and gastroenterology products, such as nasogastric feeding tubes, infant feeding tubes, gastro-duodenal feeding tubes, and umbilical catheters. In addition, it offers blood administration sets, blood collection tubes, safety blood collection sets, and blood collection needles; blood bag systems; oncology products; urology products, such as urine collection bags, foley balloon catheters, irrigation sets, urine drainage catheters, and urine collection bags with measured volume meters; and endo bronchial suction catheters, oxygen catheters, respiratory exercisers, nasal oxygen cannulas, variable concentration masks, oro- pharyngeal airways, oxygen mask with reservoirs, fixed concentration masks, and aerosol therapy masks. Further, it provides dialysis products, including fistula needles, haemodialysis catheters, peritoneal dialysis and transfusion sets, dialyzers, and blood lines; closed wound suction units, under water seal drainage systems, high pressure vacuum bottles, yankauer suction sets, and thoracic drainage catheters; and insulin syringes, sputum collectors, dry brushes, umbilical cord clamps, luer locks, cannula fixators, injection stoppers, luer lock injection sites, and universal caps. The company also exports its products. Poly Medicure Limited was founded in 1995 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110020",
        "website": "http://www.polymedicure.com",
        "market_cap": "Small Cap"
    },
    "RDDA.F": {
        "short_name": "DR REDDYS LABS ADR/1 IR 5",
        "long_name": "Dr. Reddy's Laboratories Limited",
        "summary": "Dr. Reddy's Laboratories Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Proprietary Products. Dr. Reddy's Laboratories Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Proprietary Products. The Global Generics segment manufactures and markets prescription and over-the-counter finished pharmaceutical products that are marketed under a brand name or as a generic finished dosage with therapeutic equivalence to branded formulations. This segment also engages in the biologics business. The PSAI segment manufactures and markets active pharmaceutical ingredients and intermediates, which are principal ingredients for finished pharmaceutical products. It also provides contract research services; and manufactures and sells active pharmaceutical ingredients and steroids in accordance with the specific customer requirements. The Proprietary Products segment focuses on the research, development, and manufacture of differentiated formulations for dermatology and neurology therapeutic areas. The company also engages in developing therapies in the fields of oncology and inflammation. As of March 31, 2020, it had four late stage projects at various stages of development. The company's therapeutic categories primarily include gastro-intestinal, cardiovascular, anti-diabetic, dermatology, oncology, respiratory, stomatology, urology, and nephrology. It has collaboration, license, and option agreement with Curis, Inc. to discover, develop, and commercialize small molecule antagonists; and partnership with Department of Biotechnology - Biotechnology Industry Research Assistance Council for Sputnik V vaccine clinical trials in India. The company was founded in 1984 and is headquartered in Hyderabad, India.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.drreddys.com",
        "market_cap": "Large Cap"
    },
    "RDY": {
        "short_name": "Dr. Reddy's Laboratories Ltd",
        "long_name": "Dr. Reddy's Laboratories Limited",
        "summary": "Dr. Reddy's Laboratories Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Proprietary Products. Dr. Reddy's Laboratories Limited operates as an integrated pharmaceutical company worldwide. It operates through three segments: Global Generics, Pharmaceutical Services and Active Ingredients (PSAI), and Proprietary Products. The Global Generics segment manufactures and markets prescription and over-the-counter finished pharmaceutical products that are marketed under a brand name or as a generic finished dosage with therapeutic equivalence to branded formulations. This segment also engages in the biologics business. The PSAI segment manufactures and markets active pharmaceutical ingredients and intermediates, which are principal ingredients for finished pharmaceutical products. It also provides contract research services; and manufactures and sells active pharmaceutical ingredients and steroids in accordance with the specific customer requirements. The Proprietary Products segment focuses on the research, development, and manufacture of differentiated formulations for dermatology and neurology therapeutic areas. The company also engages in developing therapies in the fields of oncology and inflammation. As of March 31, 2020, it had four late stage projects at various stages of development. The company's therapeutic categories primarily include gastro-intestinal, cardiovascular, anti-diabetic, dermatology, oncology, respiratory, stomatology, urology, and nephrology. It has collaboration, license, and option agreement with Curis, Inc. to discover, develop, and commercialize small molecule antagonists; and partnership with Department of Biotechnology - Biotechnology Industry Research Assistance Council for Sputnik V vaccine clinical trials in India. The company was founded in 1984 and is headquartered in Hyderabad, India.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.drreddys.com",
        "market_cap": "Large Cap"
    },
    "RPGLIFE.NS": {
        "short_name": "RPG LIFE SCIENCES",
        "long_name": "RPG Life Sciences Limited",
        "summary": "RPG Life Sciences Limited, an integrated pharmaceutical company, develops, manufactures, and markets branded formulations, generic, and synthetic active pharmaceutical ingredients (APIs) in India and internationally. It operates through Domestic Formulations, International Formulations, and Active Pharmaceutical Ingredients segments. The company offers synthetic APIs in various therapeutic categories, including immunosuppressants, anti-psychotic, anti-anginal, anthelmentics, anti-convulsant, anti-spasmodic, etc. It also provides generics primarily in the area of immunosuppressant therapy; and finished dosage formulations for various therapies, such as nephrology, oncology, urology, respiratory, vitamins and minerals, gastro intestinal, pain management, cardio-vascular, etc. primarily under the Lomotil, Lomofen+, Naprosyn, Azoran, Aldactone, and Serenace brands. The company was formerly known as RPG Pharmaceuticals Limited and changed its name to RPG Life Sciences Limited in February 2008. RPG Life Sciences Limited was founded in 1968 and is headquartered in Mumbai, India. RPG Life Sciences Limited is a subsidiary of Nucleus Life Trust.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.rpglifesciences.com",
        "market_cap": "Small Cap"
    },
    "SAKAR.NS": {
        "short_name": "SAKAR HEALTHCARE L",
        "long_name": "Sakar Healthcare Limited",
        "summary": "Sakar Healthcare Limited manufactures and sells pharmaceutical products in India. It offers pharmaceutical products in various forms, such as oral liquid syrups and suspensions, cephalosporin dry powder injections, liquid injectable in ampoules and vials, and lyophilized injections, as well as cephalosporin tablets, and capsules. The company also develops oncology products. It exports its products to approximately 38 countries, including South East Asia, Asia, Africa-Anglo and Francophone, MENA countries, and America. The company was founded in 2004 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380007",
        "website": "http://www.sakarhealthcare.com",
        "market_cap": "Small Cap"
    },
    "SANOFI.NS": {
        "short_name": "SANOFI INDIA LTD",
        "long_name": "Sanofi India Limited",
        "summary": "Sanofi India Limited manufactures and trades in drugs and pharmaceutical products in India. It provides pharmaceutical products in various therapeutic areas, such as diabetes, cardiology, thrombosis, central nervous system, anti-infective, allergy and vitamins, and minerals and supplements. The company exports its products to approximately 50 countries, including Germany, the Czech Republic, Australia, the United Kingdom, and Russia. It sells its products under the Lantus, Toujeo, Amaryl, Clexane, Cardace, Targocid, Valparin, Allegra, Avil, Combiflam, and DePura by Sanofi brands through independent distributors. The company was formerly known as Aventis Pharma Limited and changed its name to Sanofi India Limited in May 2012. The company was incorporated in 1956 and is headquartered in Mumbai, India. Sanofi India Limited is a subsidiary of Hoechst GmbH.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400072",
        "website": "http://www.sanofiindialtd.com",
        "market_cap": "Mid Cap"
    },
    "SASTASUNDR.NS": {
        "short_name": "SASTASUNDAR VENTUR",
        "long_name": "Sastasundar Ventures Limited",
        "summary": "Sastasundar Ventures Limited operates a digital network of healthcare in India. The company provides financing of loans; financial consultancy and professional fees services; and wealth management, financial planning, distribution, and related services, as well as invests in shares and securities. It also operates Sastasundar.com and www. retailershakti.com, which engages in pathology and marketing of healthcare products; and diagnostic services, such as pathological/radiological investigations. In addition, the company delivers prescribed medicines and wellness products; and connects doctors, as well as provides healthcare clinics and health information services. Further, the company is involved in the branded food business. The company was formerly known as Microsec Financial Services Limited and changed its name to Sastasundar Ventures Limited in November 2016. Sastasundar Ventures Limited was incorporated in 1989 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700017",
        "website": "http://www.sastasundarventures.com",
        "market_cap": "Small Cap"
    },
    "SEQUENT.NS": {
        "short_name": "SEQUENT SCIENTIFIC",
        "long_name": "Sequent Scientific Limited",
        "summary": "Sequent Scientific Limited operates as an integrated pharmaceutical company in India, Europe, rest of Asia, and internationally. The company offers animal health active pharmaceutical ingredients (APIs) and finished dosage formulations in the areas of feed supplements, antibiotics, antibacterial, anthelmintics, anti-protozoals, nutraceuticals, nonsteroidal anti-inflammatory drugs, anti-infectives, and dermatology. It also provides analytical solutions, including method validation, stability, and microbiology for APIs and finished products. The company was formerly known as PI Drugs and Pharmaceuticals Limited and changed its name to Sequent Scientific Limited in October 2009. Sequent Scientific Limited was incorporated in 1985 and is headquartered in Mumbai, India. As of September 8, 2020, Sequent Scientific Limited operates as a subsidiary of CA Harbor Investments.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400604",
        "website": "http://www.sequent.in",
        "market_cap": "Small Cap"
    },
    "SHALBY.NS": {
        "short_name": "SHALBY LTD",
        "long_name": "Shalby Limited",
        "summary": "Shalby Limited operates multi-specialty hospitals primarily in India. The company offers arthroscopy, arthroplasty, cardiology, cardiothoracic and vascular surgery, cosmetic and aesthetic, dental cosmetic and implant ology, emergency medicine, endocrinology, endoscopy and laparoscopy, ENT surgery, gastroentero surgery, gastroenterology, general medicine and surgery, hair transplant, liver disease and transplant, and hip and knee joint replacement services. It also provides infectious disease, infertility and IVF, intensive and critical care, maxillofacial surgery, nephrology, neuro surgery, neurology, obesity surgery, obstetrics and gynecology, oncology, oncosurgery, ophthalmology and glaucoma, orthopedic and trauma, pediatric orthopedic, pathology and microbiology, pediatrics and neonatology, plastic surgery, pulmonology and chest, radiology and imaging, rheumatology, trauma, organ donation, and urosurgery services. The company operates 11 hospitals comprising aggregate capacity of 2,012 beds. In addition, it offers outpatient services through 37 outpatient clinics and shared surgery centers within third party hospitals, as well as provides hospital management contract services; educational programs and fellowships for paramedical students and other healthcare professionals; and homecare health services, such as attendants, doctors, nursing, physiotherapy, pathology, pharmacy, and medical equipment, as well as conducts clinical research trials. It also operates in Kenya, Tanzania, Rwanda, Uganda, the United Arab Emirates, Bangladesh, Cambodia, Jakarta, Oman, Uzbekistan, Nepal, and internationally. The company was formerly known as Shalby Hospitals Limited and changed its name to Shalby Limited in February 2008. Shalby Limited was founded in 1994 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Care Facilities",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.shalby.org",
        "market_cap": "Small Cap"
    },
    "SHILPAMED.NS": {
        "short_name": "SHILPA MEDICARE",
        "long_name": "Shilpa Medicare Limited",
        "summary": "Shilpa Medicare Limited, together with its subsidiaries, manufactures and sells active pharmaceutical ingredients (API's), intermediates, and formulations in India, the United States, Europe, and internationally.. It offers API's for oncology and other therapeutic areas; and new drug delivery systems, peptides/biotech products, specialty chemicals, etc. The company also provides contract manufacturing of various dosage forms, such as tablets, capsules, liquid injections, lyophilized injectables, and sterile dry powder injectables. It is also involved in the generation and sale of wind power. Shilpa Medicare Limited was founded in 1987 and is headquartered in Raichur, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Raichur",
        "zipcode": "584135",
        "website": "http://www.vbshilpa.com",
        "market_cap": "Small Cap"
    },
    "SMSLIFE.NS": {
        "short_name": "SMS LIFESCIENCES",
        "long_name": "SMS Lifesciences India Limited",
        "summary": "SMS Lifesciences India Limited researches, develops, manufactures, buys, imports, and sells active pharmaceutical ingredients (API) and its intermediates, organic and inorganic chemicals, and pharmaceuticals in India and internationally. The company offers APIs in various therapeutic areas, such as antiulcer, antifungal, and erectile dysfunction. It also provides consultancy services; and contract manufacturing services for APIs and intermediates. In addition, the company exports its products. The company was founded in 1990 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500096",
        "website": "http://www.smslife.in",
        "market_cap": "Small Cap"
    },
    "SMSPHARMA.NS": {
        "short_name": "SMS PHARMACEUTICAL",
        "long_name": "SMS Pharmaceuticals Limited",
        "summary": "SMS Pharmaceuticals Limited manufactures and sells active pharmaceutical ingredients (APIs) and intermediates in India. The company offers anti-ulcer, anti-fungal, anti-migraine, anti-diabetic, erectile dysfunction, antiemetic, antiepileptic, antipsychotic, anti-hypertensive, anti-anginal, anti-viral, urinary antispasmodic, and anti-retroviral APIs. It is also involved in the contract research activities. In addition, the company exports its products. SMS Pharmaceuticals Limited was incorporated in 1987 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.smspharma.com",
        "market_cap": "Small Cap"
    },
    "SOLARA.NS": {
        "short_name": "SOLARA ACTIVE PHAR",
        "long_name": "Solara Active Pharma Sciences Limited",
        "summary": "Solara Active Pharma Sciences Limited manufactures and sells active pharmaceutical ingredients (API). The company offers APIs for anesthetics, anthelmintic, anti-arrhythmic agent, anti-asthmatic, anti-hypertensive, anti-inflammatory, anti-Parkinson, anti-viral, antibiotic, anticoagulant, anticonvulsant, antidepressant, antiemetic, antiepileptic, antifungal, antigout agent, antihistamine, antihyperlipoproteinemic, antimalarial, antimycotic, antineoplastic detoxifying agent, antiprotozoal agent, ant psoriatic, antipsychotic, antitubercular, antitussive, antiulcerative, anxiolytic, bile acid analogue, calcimimetic agent, cardiovascular agent, central nervous system agent, chronic alcoholism, chronic kidney disease, dopamine receptor antagonist, folate analog, hyperkalaemia, immunosuppressant, lipid regulating agent, loop diuretic, muscarinic agonist, neuromuscular, OAB treatment, phenylalanine reducer, recovery of stroke, tardive dyskinesia, treatment of glaucoma and hyperphosphatemia, tropical anti-infective, and type-II diabetes therapeutic categories. It also provides contract research and manufacturing services for APIs, including contract development and manufacturing, analytical services, impurity synthesis, and profiling. In addition, the company exports its products. It operates in the Asia Pacific, Europe, North America, South America, and internationally. The company was formerly known as SSL Pharma Sciences Limited and changed its name to Solara Active Pharma Sciences Limited in March 2017. Solara Active Pharma Sciences Limited was incorporated in 2017 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600 032",
        "website": "http://www.solara.co.in",
        "market_cap": "Small Cap"
    },
    "SPARC.NS": {
        "short_name": "SUN PHARMA ADV",
        "long_name": "Sun Pharma Advanced Research Company Limited",
        "summary": "Sun Pharma Advanced Research Company Limited engages in the research and development of pharmaceutical products in India and internationally. The company develops new chemical entities or reformulated products based on its proprietary novel drug delivery systems. Its core therapeutic areas of interest include oncology, inflammation, and neurodegenerative diseases, as well as abuse deterrent formulations. The company offers Levetiracetam ER for epilepsy; and Xelpros eye drops for Glaucoma. It is also developing Taclantis for the treatment of cancer; salmeterol-fluticasone dry powder inhaler for use in asthma and COPD; Baclofen GRS for spasticity; Brimonidine OD for glaucoma and ocular hypertension; and SDN-037 steroid eye drops used for the treatment of pain and inflammation following ocular surgery, and other inflammatory ocular conditions. In addition, the company engages in the development of SCO-088, a BcrÂ\u0096Abl kinase inhibitor for treatment resistant chronic myelogenous leukaemia (CML); SDN-021, an abuse deterrent formulation; and SCD-044, a S1P receptor-1 agonist, which uses lymphocyte trafficking to treat auto-immune disorders. Further, it develops SCCÂ\u0096138 for Parkinson's disease; SDNÂ\u0096118, a formulation for treating depression; SDD-098 to treat acne; and SDE-124, a sub cutaneous injection of GLP-1 receptor agonists, as well as SCO-125 to treat CML. Sun Pharma Advanced Research Company Limited has a collaboration agreement with Bioprojet to develop S1P receptor 1 agonist for autoimmune disorders; and HitGen to identify small molecule leads for targets of interest. The company was incorporated in 2006 and is based in Mumbai, India. Sun Pharma Advanced Research Company Limited is a subsidiary of Shanghvi Finance Pvt. Ltd.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.sparc.life",
        "market_cap": "Small Cap"
    },
    "STAR.NS": {
        "short_name": "STRIDES PHARMA SCI",
        "long_name": "Strides Pharma Science Limited",
        "summary": "Strides Pharma Science Limited develops, manufactures, and sells pharmaceutical products in Africa, Australasia, North America, Europe, Asia, India, and internationally. The company offers pharma generics, including tablets, hard and soft gelatin capsules, sachets, oral liquids, and powders, as well as semi solids, ointments, and creams. It also develops branded generics products for the treatment of chronic therapies, including women's health, central nervous system, cardiovascular, diabetes, dermatology, and probiotics under the Renerve, Unibrol, Clavicin, Combiart, Solcer, Melonax, Duotab, and Vitafer brands; and drugs in the anti-retroviral, anti-malarial, anti-tuberculosis, Hepatitis, and other infectious disease drug segments for institutional business. The company was formerly known as Strides Shasun Limited and changed its name to Strides Pharma Science Limited in July 2018. Strides Pharma Science Limited was founded in 1990 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560076",
        "website": "http://www.strides.com",
        "market_cap": "Small Cap"
    },
    "SUNPHARMA.NS": {
        "short_name": "SUN PHARMACEUTICAL",
        "long_name": "Sun Pharmaceutical Industries Limited",
        "summary": "Sun Pharmaceutical Industries Limited, a generic pharmaceutical company, develops, manufactures, and markets branded and generic formulations and active pharmaceutical ingredients (APIs) in India and internationally. The company offers formulations in various therapeutic areas, including central nervous system, dermatology, cardiology, oncology and ophthalmic, neuro-psychiatry, gastroenterology, anti-infectives, diabetology, pain/analgesics, vitamins/minerals/nutrients, respiratory, gynaecology, urology, opthalomology, orthopaedic, nephrology, dental, and other areas. It also provides APIs for anti-cancers, peptides, steroids, sex hormones, and controlled substances, as well as over-the-counter products. Sun Pharmaceutical Industries Limited was founded in 1983 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400063",
        "website": "http://www.sunpharma.com",
        "market_cap": "Large Cap"
    },
    "SUVEN.NS": {
        "short_name": "SUVEN LIFE SCIENCE",
        "long_name": "Suven Life Sciences Limited",
        "summary": "Suven Life Sciences Limited, a clinical-stage biopharmaceutical company, focuses on the acquisition, development, and commercialization of novel therapeutics for the treatment of neurodegenerative disorders in India, the United States, Europe, and internationally. It engages in drug discovery and development of new chemical entities (NCE) in central nervous system therapies. The company's product candidates include SUVN-502, which is in Phase II clinical trials for the treatment of Alzheimer's disease; SUVN-G3031, a potent and selective histamine H3 receptor inverse agonist, which has completed Phase I trials for the treatment of sleep and cognitive disorders; SUVN-D4010, a potent, selective, and orally bio-available and brain penetrant 5-HT4 receptor partial agonist, which has completed Phase I trials for the treatment of major depressive disorders; and SUVN-911, a novel, potent, and selective a4Ã\u009f2 nicotinic acetylcholine receptor antagonist, which has completed Phase I trials for the treatment of depressive disorders. It is also developing SUVN-I6107 for the treatment of cognitive disorders, SUVN-M8036 for the treatment of psychiatric disorders, SUVN-D1044 for the treatment of gastrointestinal disorders, P2X7 Antagonist for the treatment of pain and inflammation, M4 PAM for the treatment of Psychosis, and 5-HT1A Partial Agonist for the treatment of resistant depression. The company was formerly known as Suven Pharmaceuticals Pvt. Ltd. and changed its name to Suven Life Sciences Limited in 2003. The company was founded in 1989 and is headquartered in Hyderabad, India. Suven Life Sciences Limited is a subsidiary of Jasti Property and Equity Holdings Private Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.suven.com",
        "market_cap": "Small Cap"
    },
    "SUVENPHAR.NS": {
        "short_name": "Suven Pharmaceuticals Ltd",
        "long_name": "Suven Pharmaceuticals Limited",
        "summary": "Suven Pharmaceuticals Limited operates as a bio-pharmaceutical company in India, the United States, Europe, and internationally. It develops, manufactures, and sells new chemical entity based intermediates, active pharmaceutical ingredients, specialty chemicals, and formulated drugs under contract research and manufacturing services for pharmaceutical, biotechnology, and chemical companies. The company was incorporated in 2018 and is based in Hyderabad, India. Suven Pharmaceuticals Limited is a subsidiary of Jasti Property and Equity Holdings Private Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.suvenpharm.com",
        "market_cap": "Small Cap"
    },
    "SYNCOM.NS": {
        "short_name": "SYNCOM HEALTHCARE",
        "long_name": "Syncom Healthcare Limited",
        "summary": "Syncom Healthcare Limited engages in the manufacture and marketing of pharmaceutical formulations in India and internationally. It also offers nutraceutical products and ayurvedic formulations. The company was incorporated in 2002 and is based in Indore, India. Syncom Healthcare Limited is in corporate insolvency resolution process under the provisions of Section 7 of the Insolvency and Bankruptcy Code, 2016.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.syncomhealthcare.in",
        "market_cap": "Small Cap"
    },
    "SYNGENE.NS": {
        "short_name": "SYNGENE INTERNATIO",
        "long_name": "Syngene International Limited",
        "summary": "Syngene International Limited, a contract research and manufacturing company, provides drug discovery and development services in India and internationally. The company offers discovery chemistry services, such as medicinal and synthetic chemistry, library and peptide synthesis, biomolecules, organic electronic materials, and computational and discovery analytical chemistry; and discovery biology services in the areas of recombinant DNA engineering, cell line development, hybridoma technology, sequencing, protein sciences, screening and assay biology, DMPK, in vivo pharmacology, toxicology, and biologicals. It also provides development services in biologics; and carries out exploratory/discovery, In Vitro and Genetic toxicology, and developmental and reproductive, as well as acute, sub-chronic, and chronic toxicity studies. In addition, the company offers chemical and formulation development, polymer research, and analytical services. Further, it provides target identification and validation, lead generation and optimization, lead selection, preclinical development, API, and drug product development services. Additionally, the company offers clinical trial management, PK analysis/bioanalytical, central lab, biometrics and clinical data management, regulatory, medical monitoring, pharmacovigilance, and medical writing services. It also provides bioinformatics research, antibody drug conjugate discovery and development, and oligonucleotide synthesis services. The company serves start-up companies, pharma/biotech, agrochemical, chemical, nutrition, and animal health companies. It has partnerships with Bristol-Myers Squibb Co.; Baxter International Inc.; Amgen Inc.; Zoetis Inc.; GSK; Merck KGaA; Artelo Biosciences, Inc.; PharmAust Limited; HiMedia Laboratories; and Zumutor Biologics. The company was incorporated in 1993 and is based in Bengaluru, India. Syngene International Limited is a subsidiary of Biocon Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560099",
        "website": "http://www.syngeneintl.com",
        "market_cap": "Mid Cap"
    },
    "TAKE.NS": {
        "short_name": "TAKE SOLUTIONS",
        "long_name": "TAKE Solutions Limited",
        "summary": "TAKE Solutions Limited, together with its subsidiaries, provides domain-intensive services and solutions in life sciences and supply chain management in the United States, Asia Pacific, and Europe. It offers IP-driven and technology backed solutions, consulting, technology, and functional services across clinical, regulatory, and safety for life sciences industry. The company also provides software solutions related to enterprise mobility, material tracking, value chain collaboration, business services sourcing, trade management, and engineering design for the technology, consumer packaged goods, oil and gas, and automotive sectors. It offers its supply chain management services through a cloud platform, on premise, and through hand-held devices; and engineering services, including engineering, sourcing, and technology services. The company's IP-led approach enables its clients to automate supply chain processes; track, trace, and control at item level; mandate supplier compliance; and streamline material and shipment movement. The company was founded in 2000 and is headquartered in Chennai, India. TAKE Solutions Limited is a subsidiary of TAKE Solutions Pte Ltd.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600034",
        "website": "http://www.takesolutions.com",
        "market_cap": "Small Cap"
    },
    "THEMISMED.NS": {
        "short_name": "THEMIS MEDICARE LT",
        "long_name": "Themis Medicare Limited",
        "summary": "Themis Medicare Limited, together with its subsidiaries, manufactures and sells pharmaceutical products in India and internationally. It offers active pharmaceutical ingredients and formulations for use in various therapeutic areas, such as anti-infective, antimalarial, anti-tuberculosis, cardiology, health and nutrition, oncology, ophthalmology, and pain management. The company was formerly known as Themis Chemicals and changed its name to Themis Medicare Limited in 2001. Themis Medicare Limited was founded in 1969 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400104",
        "website": "http://www.themismedicare.com",
        "market_cap": "Small Cap"
    },
    "THYROCARE.NS": {
        "short_name": "THYROCARE TECHNOL",
        "long_name": "Thyrocare Technologies Limited",
        "summary": "Thyrocare Technologies Limited provides diagnostic testing services to patients, laboratories, and hospitals in India. The company operates through Diagnostic Testing Services, Imaging Services, and Others segments. It conducts medical diagnostic tests and profiles of tests that focuses on early detection and management of disorders and diseases, including thyroid, growth, metabolism, auto-immunity, diabetes, anaemia, cardiovascular, infertility, and various infectious diseases. Its profiles of tests include 54 profiles of tests administered under its Aarogyam brand, which offers patients a suite of wellness and preventive health care tests. The company sells glucometer and glucostrips under the brand name Sugarscan; and radio-pharmaceutical. Thyrocare Technologies Limited was founded in 1996 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400703",
        "website": "http://www.thyrocare.com",
        "market_cap": "Small Cap"
    },
    "TORNTPHARM.NS": {
        "short_name": "TORRENT PHARM",
        "long_name": "Torrent Pharmaceuticals Limited",
        "summary": "Torrent Pharmaceuticals Limited engages in the research, development, manufacturing, and marketing of generic pharmaceutical formulations in India, the United States, Germany, Brazil, and internationally. The company offers products in various therapeutic areas, including cardiovascular, central nervous system, gastrointestinal, women healthcare, diabetology, pain management, gynecology, oncology, anti-infective, vitamin minerals nutrients. It also provides contract manufacturing services. The company was formerly known as Trinity Laboratories and changed its name to Torrent Pharmaceuticals Limited in 1971. The company was founded in 1959 and is based in Ahmedabad, India. Torrent Pharmaceuticals Limited is a subsidiary of Torrent Investments Private Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380009",
        "website": "http://www.torrentpharma.com",
        "market_cap": "Mid Cap"
    },
    "TTKHLTCARE.NS": {
        "short_name": "TTK HEALTHCARE",
        "long_name": "TTK Healthcare Limited",
        "summary": "TTK Healthcare Limited engages in the pharmaceutical, consumer product, medical device, protective device, and food businesses in India and internationally. The company's Pharmaceuticals segment deals in herbal and allopathic formulations in various therapeutic areas for human and veterinary uses. It also provides delivery care, female healthcare, haematinic, pain management, neurotrophic, gastro intestinal, male and female fertility, nutritional, cardiac care, derma, urinary specialties, and respiratory care products, as well as calcium supplements. Its Consumer Products segment is involved in marketing and distribution of Woodwards's Gripe Water, EVA Range of Cosmetics, Good Home range of Scrubbers, air fresheners, etc. The company's Medical Devices segment manufactures and distributes artificial heart valves; and develops orthopedic implants and instruments. Its Protective Devices segment manufactures and markets male contraceptives and other allied products. The company's Foods segment manufactures and markets food products, including potato and cereal based pellets. Its Others segment prints and publishes maps and atlases. The company was incorporated in 1958 and is headquartered in Chennai, India. TTK Healthcare Limited is a subsidiary of T T Krishnamachari & Co., Ltd.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600086",
        "website": "http://www.ttkhealthcare.com",
        "market_cap": "Small Cap"
    },
    "UNICHEMLAB.NS": {
        "short_name": "UNICHEM LABS",
        "long_name": "Unichem Laboratories Limited",
        "summary": "Unichem Laboratories Limited, a pharmaceutical company, manufactures and sells pharmaceutical products in India, the United States, and internationally. It offers pharma products that address various therapeutic areas, such as gastroenterology, cardiology, diabetology, psychiatry, neurology, anti-bacterial, anti-infective, and pain management; and active pharmaceutical ingredients. The company was founded in 1944 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400102",
        "website": "http://www.unichemlabs.com",
        "market_cap": "Small Cap"
    },
    "UNIVPHOTO.NS": {
        "short_name": "Universus Imagings Ltd",
        "long_name": "Universus Photo Imagings Limited",
        "summary": "Universus Photo Imagings Limited manufactures, sells, and trades in photographic and other imaging products. It offers photographic papers, NTR films, medical X-ray films, etc. The company was formerly known as Jindal Photo Imaging Limited and changed its name to Universus Photo Imagings Limited in December 2019. Universus Photo Imagings Limited was incorporated in 2011 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110 070",
        "website": "http://www.universusphotoimagings.com",
        "market_cap": "Small Cap"
    },
    "VAISHALI.NS": {
        "short_name": "Vaishali Pharma Limited",
        "long_name": "Vaishali Pharma Limited",
        "summary": "Vaishali Pharma Limited engages in the pharmaceutical business in India and internationally. It offers active pharmaceutical ingredients (APIs), including antibiotics, anti-ulcer, anti-inflammatory/analgesic/anti-pyretic, anti-malarial, cardiac, anti-diabetic, anti-cold/anti-allergic, anti-diarrheal/anti-protozoal/anti-parasitic, anti-viral, anti-epileptic, anti-asthmatic, anti-fungal, anti-platelet agent, skeletal muscle relaxant, and anti-helmintic drugs, as well as excipients, topical steroids, corticosteroids, and enzymes. The company also provides formulation products, such as antibiotics/antibacterial, anti-platelet, laxative, anti-ulcer/enzyme, anti-asthmatic, anti-malarial, anti-cold/anti-allergic/anti-viral, anti-psychotic, anti-fungal, anti-inflammatory/analgesic/anti-pyretic, anti-diabetic, cardiac, vitamins, topical steroids/corticosteroids, and other formulations. In addition, it offers veterinary pharmaceutical, nutraceutical, oncology, herbal, and surgical products. Vaishali Pharma Limited was founded in 1989 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400092",
        "website": "http://www.vaishalipharma.com",
        "market_cap": "Small Cap"
    },
    "VENUSREM.NS": {
        "short_name": "VENUS REMEDIES LTD",
        "long_name": "Venus Remedies Limited",
        "summary": "Venus Remedies Limited, a pharmaceutical company, manufactures and trades in medicines in India and internationally. The company offers Sterloc, a super oxidized solution; Swachh Guard, an alcohol-based instant hand sanitizer; Trois Spray, a nanotech emulsion; and Trois Tablet to manage acute pain with topical applications. It offers its products in various therapeutic segments comprising analgesic, analgesic and antipyretic, anti-diabetic, antibiotic, cardiac, disinfectant and antiseptic, gastro therapy, hand sanitizers, hormones, iron supplements, neurology, oncology, pain management, respiratory, skin care, stress reliever, urology, vitamins/minerals/nutrients, and wound management. The company was founded in 1989 and is based in Panchkula, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Panchkula",
        "zipcode": "134113",
        "website": "http://www.venusremedies.com",
        "market_cap": "Small Cap"
    },
    "VIMTALABS.NS": {
        "short_name": "VIMTA LABORATORIES",
        "long_name": "Vimta Labs Limited",
        "summary": "Vimta Labs Limited provides contract research and testing services in India and internationally. The company offers laboratory, food and water testing and analysis, preclinical and clinical research, biological molecule structural and functional analysis, environmental assessment, and clinical reference laboratory services. It serves the pharmaceutical, biopharmaceutical, food, consumer products, agrochemical, healthcare, medical device, and other industries. The company was founded in 1984 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500051",
        "website": "http://www.vimta.com",
        "market_cap": "Small Cap"
    },
    "VIVIMEDLAB.NS": {
        "short_name": "VIVIMED LABS LTD",
        "long_name": "Vivimed Labs Limited",
        "summary": "Vivimed Labs Limited, together with its subsidiaries, manufactures and sells active pharmaceutical ingredients (APIs), finished dosage formulations, specialty chemicals, and retail branded formulations in India, Mexico, Spain, Hungary, and internationally. It operates in two segments, Specialty Chemicals Business and Pharma Business. The company provides APIs and intermediates to generic and ethical companies; and branded formulations in therapeutic segments, such as ophthalmic, nutraceuticals, dermatology, and pain, as well as contract manufacturing of capsules and tablets, syrups and liquids, and nasal sprays and ointments. It also offers a range of hair dye intermediates for use in permanent, semi-permanent, and temporary hair colorant systems; oxidation dye couplers and bases to formulate various permanent and demi-permanent shades; direct dyes for semi-permanent formulations; and basic dyes for temporary, semi-permanent, and color-refresher shampoos and conditioners under the Jarocol name. In addition, the company manufactures and markets photochromic dyes under the Reversacol name; and anti-microbial actives for use in a range of applications, including plastics additives and anti-bacterial handwashes. Further, it offers photographic chemicals, such as black and white developers, and antifog additives for use in medical and industrial X-ray imaging, consumer photography, and litho-plate production for the graphic arts industry. Additionally, the company manufactures Favulous for the treatment of mild to moderate cases of Covid-19. Its products are used in home, personal, and industrial care segments. The company was incorporated in 1988 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500034",
        "website": "http://www.vivimedlabs.com",
        "market_cap": "Small Cap"
    },
    "WANBURY.NS": {
        "short_name": "WANBURY LTD",
        "long_name": "Wanbury Limited",
        "summary": "Wanbury Limited manufactures and sells formulations and active pharmaceutical ingredients (API) in India. The company offers formulations for gynecology, orthopedics, heamatinics, anti-diabetic, nutraceuticals, gastro intestinal, stroke surgery, antibiotics, cough and cold solutions, anti-inflammatory, analgesics, and general practitioner purposes approximately under 70 brands. It also provides API products for anti-diabetic, anti-analgesic, anti-depressant, anti-histaminic, anti-inflammatory, anti-arthritis, anti-thrombotic, anti-epileptic, and anti-hypertensive therapeutic areas. Wanbury Limited also exports its products. The company was formerly known as Pearl Organics Limited and changed its name to Wanbury Limited in 2004. Wanbury Limited was incorporated in 1988 and is headquartered in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400703",
        "website": "http://www.wanbury.com",
        "market_cap": "Small Cap"
    },
    "WOCKPHARMA.NS": {
        "short_name": "WOCKHARDT",
        "long_name": "Wockhardt Limited",
        "summary": "Wockhardt Limited, a pharmaceutical and biotechnology company, manufactures and markets active pharmaceutical ingredients, formulations, bio-similars, and vaccines in India, the United States, Europe, and internationally. It provides pharmaceutical products in the therapeutic areas of anti-infective, cardiology, dermatology, diabetology, neurology, pain management, respiratory, and other areas. The company offers generic products that comprise injectables, including cephalosporins and non-cephalosporins; molecules; and value-added generics. Its biopharmaceutical products include Glaritus, an insulin analog; Wosulin, an r-DNA insulin; Wepox, a recombinant erythropoietin that is used in the treatment of anemia caused by cancer and chronic renal failure; and Biovac-B, a hepatitis B vaccine. The company also provides contract manufacturing services for sterile injectables, lyophilisation, and other dosage forms; and research services. It develops various molecules primarily in the area of anti-infectives, which include WCK 771 and WCK 2349 that is in Phase II human clinical trials for the treatment of staphylococcal infections; and WCK 5222, WCK 4282, WCK 4873, and WCK 6777 lead molecules, which are under pre-clinical trials. The company was incorporated in 1999 and is headquartered in Mumbai, India. Wockhardt Limited is a subsidiary of Themisto Trustee Company Private Limited.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.wockhardt.com",
        "market_cap": "Small Cap"
    },
    "ZOTA.NS": {
        "short_name": "Zota Health Care Limited",
        "long_name": "Zota Health Care Limited",
        "summary": "Zota Health Care Limited manufactures and markets pharmaceutical products in India. The company offers generic drugs, OTC pharmaceutical products, ayurvedic products, and nutraceutical products. As of December 30, 2020, it operated 491 retail stores under the DAVAINDIA name in 21 states of India. The company was founded in 1995 and is headquartered in Surat, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Surat",
        "zipcode": "395002",
        "website": "http://www.zotahealthcare.com",
        "market_cap": "Small Cap"
    }
}