{
    "LALPATHLAB.NS": {
        "short_name": "DR LAL PATHLABS LT",
        "long_name": "Dr. Lal PathLabs Limited",
        "summary": "Dr. Lal PathLabs Limited provides diagnostic and related healthcare tests and services in India and internationally. It operates laboratories for carrying the pathological investigations of various branches of biochemistry, hematology, histopathology, microbiology, electrophoresis, immuno-chemistry, immunology, virology, cytology, and other pathological and radiological investigations. The company offers pathology and radiology testing; lab staff training; technical; and lab management services. As of March 31, 2020, the company had 216 clinical laboratories, including National Reference Lab at Delhi and Regional Reference Lab at Kolkata; and 3,095 patient service centers and 6,995 pick-up points. Dr. Lal PathLabs Limited was founded in 1949 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.lalpathlabs.com",
        "full_time_employees": null
    },
    "METROPOLIS.NS": {
        "short_name": "METROPOLIS HEALTHC",
        "long_name": "Metropolis Healthcare Limited",
        "summary": "Metropolis Healthcare Limited provides pathology and diagnostic laboratory services in India and internationally. The company offers clinical laboratory testing, and profiles and support services to patients, smaller labs, nursing homes, and hospitals. It provides diagnostic services for oncology, neurology, gynecology, and nephrology, as well as various health check-up packages for men, women, senior citizens, and youth and corporates. The company's tests and profiles are used for prediction, early detection, diagnostic screening, confirmation, and/or monitoring of the disease. It also offers corporate wellness and hospital laboratory solutions, as well as clinical research services. As of March 31, 2020, the company operated 124 clinical laboratories, 9,000 pick-up points, and 598 assisted referral centers. Metropolis Healthcare Limited was founded in 1980 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400030",
        "website": "http://www.metropolisindia.com",
        "full_time_employees": null
    },
    "THYROCARE.NS": {
        "short_name": "THYROCARE TECHNOL",
        "long_name": "Thyrocare Technologies Limited",
        "summary": "Thyrocare Technologies Limited provides diagnostic testing services to patients, laboratories, and hospitals in India. The company operates through Diagnostic Testing Services, Imaging Services, and Others segments. It conducts medical diagnostic tests and profiles of tests that focuses on early detection and management of disorders and diseases, including thyroid, growth, metabolism, auto-immunity, diabetes, anaemia, cardiovascular, infertility, and various infectious diseases. Its profiles of tests include 54 profiles of tests administered under its Aarogyam brand, which offers patients a suite of wellness and preventive health care tests. The company sells glucometer and glucostrips under the brand name Sugarscan; and radio-pharmaceutical. Thyrocare Technologies Limited was founded in 1996 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400703",
        "website": "http://www.thyrocare.com",
        "full_time_employees": 1333
    },
    "VIMTALABS.NS": {
        "short_name": "VIMTA LABORATORIES",
        "long_name": "Vimta Labs Limited",
        "summary": "Vimta Labs Limited provides contract research and testing services in India and internationally. The company offers laboratory, food and water testing and analysis, preclinical and clinical research, biological molecule structural and functional analysis, environmental assessment, and clinical reference laboratory services. It serves the pharmaceutical, biopharmaceutical, food, consumer products, agrochemical, healthcare, medical device, and other industries. The company was founded in 1984 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500051",
        "website": "http://www.vimta.com",
        "full_time_employees": null
    }
}