{
  "ABBOTINDIA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Abbott India Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "ABBOTT INDIA LTD",
    "state": null,
    "summary": "Abbott India Limited operates as a pharmaceutical company in India. It offers pharmaceutical products for various therapeutic areas, such as women's health, gastroenterology, metabolics, central nervous system, pain management, nutritional supplements, vitamins, insomnia, vaccines, consumer health, etc. The company was formerly known as Knoll Pharmaceuticals Limited and changed its name to Abbott India Limited in July 2002. Abbott India Limited was founded in 1944 and is headquartered in Mumbai, India. Abbott India Limited operates as a subsidiary of Abbott Capital India Limited.",
    "website": "http://www.abbott.co.in",
    "zipcode": "400051"
  },
  "CIPLA.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Cipla Limited",
    "market": "in_market",
    "market_cap": "Large Cap",
    "sector": "Healthcare",
    "short_name": "CIPLA LTD",
    "state": null,
    "summary": "Cipla Limited, together with its subsidiaries, manufactures and sells pharmaceutical products in India, the United States, South Africa, and internationally. The company offers active pharmaceutical ingredients; and formulations in various therapeutic areas, such as MI, angina, heart failure, hypertension, arrhythmia, lipid abnormalities and diabetes, obesity, HIV, respiratory, oncology, cardio-metabolism, child health, infectious diseases and critical care, hepatitis, women's health, ophthalmology, and neuro psychiatry. It also provides respiratory products, including inhalers and nasal sprays, as well as other dosage forms consists of injectables and biosimilars. Cipla Limited has collaboration with CSIR-Indian Institute of Chemical Technology for the development of medication for the treatment of COVID-19; and partnership with Karwa Ltd. for the commercialization of antibody detection kits for COVID-19, as well as the Premier Medical Corporation Private Limited for the commercialization of the rapid antigen test kits for COVID-19. The company was founded in 1935 and is headquartered in Mumbai, India.",
    "website": "http://www.cipla.com",
    "zipcode": "400013"
  },
  "GLAND.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Gland Pharma Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "Gland Pharma Limited",
    "state": null,
    "summary": "Gland Pharma Limited engages in the development, manufacture, and marketing of injectable-focused generic liquid parenteral products. The company's primary molecules include heparin sodium, enoxaparin sodium, rocuronium bromide, and daptomycin injections, as well as others. It offers its products under various therapeutic categories, such as anti-infectives, anesthetics, anti-coagulants and their antidotes, anti-malarial, cardiology, gastro-intestinal, hormones and related drugs, fertility supplements, Gnrh agonists and antagonists, anti-neoplastic, gynecological, neuro/Cns, respiratory, blood related, ophthalmological and otological, pain/analgesics, orthopedics, hematinic, vitamins/minerals/nutrients, and others. The company also provides contract development services. It sells its products primarily under a business to business in the United States, Europe, Canada, Australia, India, and the rest of the world. The company was founded in 1978 and is based in Hyderabad, India. As of October 3, 2017, Gland Pharma Limited operates as a subsidiary of Fosun Pharma Industrial Pte. Ltd.",
    "website": "http://www.glandpharma.com",
    "zipcode": "500043"
  },
  "GLAXO.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "GlaxoSmithKline Pharmaceuticals Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "GLAXO SMITHKLINE P",
    "state": null,
    "summary": "GlaxoSmithKline Pharmaceuticals Limited, a healthcare company, researches, develops, manufactures, and sells pharmaceutical medicines and vaccines in India and internationally. The company offers prescription and non-prescription drugs for asthma, infectious diseases, mental health, and digestive conditions, as well as anti-infective, gastrointestinal, nutrition, dermatology, immuno-inflammation, and respiratory diseases. It also provides vaccines for the treatment of cancer, as well as prevention of hepatitis A, hepatitis B, invasive disease caused by influenza, chickenpox, diphtheria, pertussis, tetanus, rotavirus, cervical cancer, invasive pneumococcal, and others; and consumer healthcare products. The company was formerly known as SmithKline Beecham Pharmaceuticals India Ltd. and changed its name to GlaxoSmithKline Pharmaceuticals Limited in 2001. GlaxoSmithKline Pharmaceuticals Limited was founded in 1924 and is headquartered in Mumbai, India.",
    "website": "http://www.india-pharma.gsk.com",
    "zipcode": "400030"
  },
  "KILITCH.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Kilitch Drugs (India) Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "KILITCH DRUGS(INDI",
    "state": null,
    "summary": "Kilitch Drugs (India) Limited engages in the development and operation of pharmaceutical business in India. The company offers parenteral and nasal products, including gastroenterology, anti-inflammatory, anticonvulsant/antiepileptic, anti-malarial, aminoglycoside, antibacterial, anti-hypertensive, anti-infective, diagnostic, sympathomimetic, local anesthetic, neurotonic, uterine stimulant, external preparation, non-steroidal anti-inflammatory, oncology, ophthalmic, and other drugs, as well as vaccines and veterinary products in the form of ampoules, vials, and dry powder injectables. Its parenteral and nasal products also include iron supplements for the treatment of anemia; and metered nasal drops, as well as Klavmox and Onecef products. The company also provides a range of oral formulations, including tablets, capsules, dry syrups, gripe water, and oral powders and liquids in the antibiotic, anti-diabetics, cardiovascular, and other areas. In addition, it offers effervescent tablets and powders, such as ROIPAR, DUREGRA, ROIVIT, and PH-7; and a range of nutritional products comprising CELTINE. Further, the company provides C-Seal, a topical skin adhesive to hold closely approximated skin edges without marks of sutures and incisions. Additionally, it offers cosmetics and herbal products consisting of a range of oils, lotions, liquids, creams, and paste in skin, personal, and hair care categories, as well as herbal products used in sore throat and prostate problems; and as a supplement for diabetes, obesity, libido, and other conditions. The company also exports its products. Kilitch Drugs (India) Limited was founded in 1978 and is headquartered in Mumbai, India.",
    "website": "http://www.kilitch.com",
    "zipcode": "400088"
  },
  "KOPRAN.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Kopran Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "KOPRAN LTD",
    "state": null,
    "summary": "Kopran Limited, an integrated pharmaceutical company, manufactures and sells active pharmaceutical ingredients and finished dosage forms in India and internationally. The company offers finished dosage forms, including tablets, capsules, dry powder, suspension, and injectable in various therapeutic areas comprising cardiovascular, gastrointestinal, pain management, oncology, anti-allergic, central nervous system, erectile dysfunction, and others, as well as antibiotics, anti-diabetic, respiratory, anthelmentics, antiprotozoals, and antipeptic ulcer and gut. It also provides active pharmaceutical ingredients in the categories of anti-hypertensive, macrolide, neuromodulator, sterile cephalosporins, carbapenems, anti-acne, anti-ulcerant, anti-depressent, anti-infective, urological, and anti-thrombotic. The company was incorporated in 1958 and is headquartered in Mumbai, India.",
    "website": "http://www.kopran.com",
    "zipcode": "400018"
  },
  "MARKSANS.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Marksans Pharma Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MARKSANS PHARMA LT",
    "state": null,
    "summary": "Marksans Pharma Limited, together with its subsidiaries, researches, develops, manufactures, markets, distributes, and sells generic pharmaceutical formulations in North America, Europe, the United Kingdom, Australia, New Zealand, and internationally. The company offers products in the analgesic, anti-inflammatory, benign prostatic hyperplasia, epilepsy, hyperparathyroidism, diabetic and antidiabetic, pain management, neurology, antacid, hormonal, antifungal, antiulcerative, cardiovascular and central nervous system, vitamin, cough and cold, dermatology, gastrointestinal, gynecology, cephalosporin, injectable, antibacterial, hypertension, oncology, and antibiotics and anti-allergic therapeutic areas. It also provides contract research and manufacturing services; and develops and out-licenses patented products. The company was incorporated in 1992 and is headquartered in Mumbai, India.",
    "website": "http://www.marksanspharma.com",
    "zipcode": "400053"
  },
  "PFIZER.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Pfizer Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "PFIZER LTD",
    "state": null,
    "summary": "Pfizer Limited manufactures, markets, trades in, and exports pharmaceutical products in India and internationally. It offers its various products in various therapeutic areas, including anti-allergic, anti-diabetic, antihistamine, anti-infective, anti-parasitic, cardiovascular, dermatology, erectile dysfunction, neurology, pain/fever/inflammation, pediatrics, psychiatry, respiratory, urology, women's health, central nervous system, autoimmune disorders, and gastrointestinal. The company also provides multivitamins, vitamins/minerals, antibiotics, steroids, vaccines, and consumer healthcare products. It sells its products through a network of independent distributors primarily under the Minipress XL, Folvite, Magnex, Eliquis, Gelusil, Lyrica, Ovral L, Citralka, Prevenar 13, Autrin, Zavicefta, Wysolone, Xeljanz, Corex, Mucaine, Becosules, Ativan, Neksium, Meronem, And Dolonex brand names. Pfizer Limited has a strategic partnership with GlobalSpace Technologies Limited to leverage the Makebot platform for vaccine awareness and DocExa platform for consultation by specialists. The company was incorporated in 1950 and is headquartered in Mumbai, India.",
    "website": "http://www.pfizerindia.com",
    "zipcode": "400051"
  },
  "SANOFI.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Sanofi India Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "SANOFI INDIA LTD",
    "state": null,
    "summary": "Sanofi India Limited manufactures and trades in drugs and pharmaceutical products in India. It provides pharmaceutical products in various therapeutic areas, such as diabetes, cardiology, thrombosis, central nervous system, anti-infective, allergy and vitamins, and minerals and supplements. The company exports its products to approximately 50 countries, including Germany, the Czech Republic, Australia, the United Kingdom, and Russia. It sells its products under the Lantus, Toujeo, Amaryl, Clexane, Cardace, Targocid, Valparin, Allegra, Avil, Combiflam, and DePura by Sanofi brands through independent distributors. The company was formerly known as Aventis Pharma Limited and changed its name to Sanofi India Limited in May 2012. The company was incorporated in 1956 and is headquartered in Mumbai, India. Sanofi India Limited is a subsidiary of Hoechst GmbH.",
    "website": "http://www.sanofiindialtd.com",
    "zipcode": "400072"
  },
  "SMSPHARMA.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "SMS Pharmaceuticals Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SMS PHARMACEUTICAL",
    "state": null,
    "summary": "SMS Pharmaceuticals Limited manufactures and sells active pharmaceutical ingredients (APIs) and intermediates in India. The company offers anti-ulcer, anti-fungal, anti-migraine, anti-diabetic, erectile dysfunction, antiemetic, antiepileptic, antipsychotic, anti-hypertensive, anti-anginal, anti-viral, urinary antispasmodic, and anti-retroviral APIs. It is also involved in the contract research activities. In addition, the company exports its products. SMS Pharmaceuticals Limited was incorporated in 1987 and is based in Hyderabad, India.",
    "website": "http://www.smspharma.com",
    "zipcode": "500034"
  },
  "TORNTPHARM.NS": {
    "city": "Ahmedabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "Torrent Pharmaceuticals Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "TORRENT PHARM",
    "state": null,
    "summary": "Torrent Pharmaceuticals Limited engages in the research, development, manufacturing, and marketing of generic pharmaceutical formulations in India, the United States, Germany, Brazil, and internationally. The company offers products in various therapeutic areas, including cardiovascular, central nervous system, gastrointestinal, women healthcare, diabetology, pain management, gynecology, oncology, anti-infective, vitamin minerals nutrients. It also provides contract manufacturing services. The company was formerly known as Trinity Laboratories and changed its name to Torrent Pharmaceuticals Limited in 1971. The company was founded in 1959 and is based in Ahmedabad, India. Torrent Pharmaceuticals Limited is a subsidiary of Torrent Investments Private Limited.",
    "website": "http://www.torrentpharma.com",
    "zipcode": "380009"
  },
  "TTKHLTCARE.NS": {
    "city": "Chennai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Drug Manufacturers - General",
    "long_name": "TTK Healthcare Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TTK HEALTHCARE",
    "state": null,
    "summary": "TTK Healthcare Limited engages in the pharmaceutical, consumer product, medical device, protective device, and food businesses in India and internationally. The company's Pharmaceuticals segment deals in herbal and allopathic formulations in various therapeutic areas for human and veterinary uses. It also provides delivery care, female healthcare, haematinic, pain management, neurotrophic, gastro intestinal, male and female fertility, nutritional, cardiac care, derma, urinary specialties, and respiratory care products, as well as calcium supplements. Its Consumer Products segment is involved in marketing and distribution of Woodwards's Gripe Water, EVA Range of Cosmetics, Good Home range of Scrubbers, air fresheners, etc. The company's Medical Devices segment manufactures and distributes artificial heart valves; and develops orthopedic implants and instruments. Its Protective Devices segment manufactures and markets male contraceptives and other allied products. The company's Foods segment manufactures and markets food products, including potato and cereal based pellets. Its Others segment prints and publishes maps and atlases. The company was incorporated in 1958 and is headquartered in Chennai, India. TTK Healthcare Limited is a subsidiary of T T Krishnamachari & Co., Ltd.",
    "website": "http://www.ttkhealthcare.com",
    "zipcode": "600086"
  }
}
