{
    "NURECA.NS": {
        "short_name": "Nureca Limited",
        "long_name": "Nureca Limited",
        "summary": "Nureca Limited, a B2C company, engages in the home healthcare and wellness products business primarily in India. It offers electric massagers, nebulizers, blood pressure monitors, glucometers, infrared thermometers for temperature scanning, fingertip pulse oximeters, weighing scales, home spa humidifiers and steamers, office electronics, rapid test kits, USB port car mobile chargers, and car mobile holder magnetic stands; and rehabilitation, mother and baby care, personal care and hygiene, nutrition, connected health care, and fitness products. The company offers its products under Dr Trust, Dr Physio, and Dr Trust brands. Its products provide consumers with tools to monitor chronic ailments and other diseases. The company sells its products through online channel partners comprising e-commerce companies, distributors, and retailers; and through its website, drtrust.in. Nureca Limited was incorporated in 2016 and is based in Chandigarh, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chandigarh",
        "zipcode": "160017",
        "website": "http://www.nureca.com",
        "market_cap": 15277217792
    },
    "OPTOCIRCUI.NS": {
        "short_name": "OPTO CIRCUITS IND",
        "long_name": "Opto Circuits (India) Limited",
        "summary": "Opto Circuits (India) Limited manufactures and trades in invasive and non-invasive medical equipment in India and internationally. It operates through Sensors, Monitors, and Others segments. The company offers data management and connectivity products that connect to hospital information systems, electronic medical records, and other information systems; defibrillation systems to detect and identify arrhythmias; non-invasive vascular diagnostic systems to detect peripheral arterial disease; and respiratory and anesthesia monitoring products to identify and quantify inspired and expired CO2, O2, and N2O. It also provides non-invasive reusable and disposable sensors, extension and adapter cables, neo wraps, Y tapes, and Water Traps and ComfortCuffs, as well as batteries, defibrillation pads, electrodes, doppler probes, and other accessories and consumables; veterinary care products to diagnose, measure, and monitor parameters on animals; and vital signs patient monitoring equipment to measure and display a patient's vital signs. In addition, the company offers cardiac stents; catheters and related disposable products in the fields of urology, gastroenterology, and gynecology; PTA balloons to decrease the stimulus of chronic inflammation and the trigger for late thrombosis; and orthopedic implants, as well as surgical consumables, such as endernails and wound suction drainage systems. Further, it offers education and training, technical support, and professional services, as well as turnkey solutions in specialty ambulances, modular operation theatres, and cathlabs; and services in information technology, global positioning systems, and electronic design automation. The company serves physicians, general practitioners and specialists, clinics, and hospitals. Opto Circuits (India) Limited was founded in 1992 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560100",
        "website": "http://www.optoindia.com",
        "market_cap": 1482360064
    },
    "UNIVPHOTO.NS": {
        "short_name": "Universus Imagings Ltd",
        "long_name": "Universus Photo Imagings Limited",
        "summary": "Universus Photo Imagings Limited manufactures, sells, and trades in photographic and other imaging products. It offers photographic papers, NTR films, medical X-ray films, etc. The company was formerly known as Jindal Photo Imaging Limited and changed its name to Universus Photo Imagings Limited in December 2019. Universus Photo Imagings Limited was incorporated in 2011 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110 070",
        "website": "http://www.universusphotoimagings.com",
        "market_cap": 2577170688
    }
}