{
    "BABBN.MX": {
        "short_name": "BABCOCK INTERNATIONAL GROUP",
        "long_name": "Babcock International Group PLC",
        "summary": "Babcock International Group PLC, together with its subsidiaries, provides engineering services for marine, land, aviation, and nuclear sectors in the United Kingdom and internationally. The company's Marine segment offers life support services for naval ships, and infrastructure. Its Nuclear segment provides submarines and complex engineering services in support of various decommissioning programs and projects, training and operation support, new build program management, and design and installation. The company's Land segment offers large-scale critical vehicle fleet management, and equipment support and training services for military engineers. Its Aviation segment provides critical engineering services to defense and civil customers, including pilot training, equipment support, and airbase management, as well as operates aviation fleets that provide delivering emergency and offshore services. Babcock International Group PLC was founded in 1891 and is headquartered in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BKGN.MX": {
        "short_name": "BERKELEY GROUP HLDGS",
        "long_name": "The Berkeley Group Holdings plc",
        "summary": "The Berkeley Group Holdings plc, together with its subsidiaries, engages in the residential-led and mixed-use property development activities in the United Kingdom. It operates under the Berkeley, St Edward, St George, St James, St Joseph, St William, Berkeley First, Berkeley Commercial, Berkeley Partnership, and Berkeley Modular brand names. The company was founded in 1976 and is headquartered in Cobham, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Cobham"
    },
    "MGGTN.MX": {
        "short_name": "MEGGITT",
        "long_name": "Meggitt PLC",
        "summary": "Meggitt PLC designs and manufactures components and sub-systems in the United Kingdom, rest of Europe, the United States, and internationally. The company operates through four segments: Airframe Systems, Engine Systems, Energy & Equipment, and Services & Support. It offers ice protection products, radomes, and structures; air data and flight display products; brake control and tyre pressure monitoring systems, and wheels and brakes; engine health and vibration monitors, H2/O2 analyzers, and turbine monitoring and protection products; and aircraft cameras and security systems, and wireless aircraft systems. The company also provides ammunition handling, thermal, weapon scoring, and weapon training systems; energy storage, power conversion and distribution, and power generation systems; ducting systems, engine composites, and flow control valves; and fire protection and controls comprising bleed air leak detection products, cables and clamps, electronic control units, fire and overheat detection products, and fire suppression products. In addition, it offers ground fuelling, and fuel systems and tanks; motion control actuators, electric motor drives, and electric motors; oxygen and specialty restraint safety systems; and accelerometers, ceramics, fluid sensors, magnetic and current sensors, position and inertial sensors, pressure sensors, speed sensors, and temperature sensors. Further, the company provides polymer seals; heat exchangers, printed circuit heat exchangers, thermal components, and thermal management systems; and live fire and virtual trainers, as well as aftermarket services. It serves aerospace, defense, and energy and equipment markets. The company was formerly known as Meggitt Holdings Public Limited Company and changed its name to Meggitt PLC in April 1989. Meggitt PLC was founded in 1947 and is based in Christchurch, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Aerospace/Defense - Major Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Christchurch"
    },
    "WEIRN.MX": {
        "short_name": "WEIR GROUP",
        "long_name": "The Weir Group PLC",
        "summary": "The Weir Group PLC produces and sells highly-engineered equipment worldwide. It operates through three segments: Minerals, ESCO, and Oil & Gas. The Minerals segment offers slurry handling equipment and associated aftermarket support services for abrasive high-wear applications used in the mining and oil sands markets. The ESCO segment provides ground engaging tools for surface mining and infrastructure. The Oil & Gas segment offers products and service solutions to upstream, production, transportation, and related industries. The Weir Group PLC was founded in 1871 and is headquartered in Glasgow, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Glasgow"
    }
}