{
    "LFCN.MX": {
        "short_name": "CHINA LIFE INSURANCE CO",
        "long_name": "China Life Insurance Company Limited",
        "summary": "China Life Insurance Company Limited, together with its subsidiaries, operates as a life insurance company in the People's Republic of China. It operates in four segments: Life Insurance Business, Health Insurance Business, Accident Insurance Business, and Other Businesses. The company offers individual and group life, annuity products, accident, and health insurance products. It is also involved in the third-party asset management, annuity funds, fund management, investment management, pension security, occupational pension, reinsurance, and health management businesses. China Life Insurance Company Limited sells its products through agents, direct sales representatives, and dedicated and non-dedicated agencies. The company was founded in 1949 and is based in Beijing, the People's Republic of China. China Life Insurance Company Limited is a subsidiary of China Life Insurance (Group) Company Limited.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Life Insurance",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100033",
        "website": "http://www.e-chinalife.com",
        "market_cap": "Large Cap"
    },
    "PNGAYN.MX": {
        "short_name": "PING AN INSURANCE(GROUP)CO.OF C",
        "long_name": "Ping An Insurance (Group) Company of China, Ltd.",
        "summary": "Ping An Insurance (Group) Company of China, Ltd. provides financial products and services for insurance, banking, asset management, and fintech and healthtech businesses in the People's Republic of China. The company's Life and Health Insurance segment offers term, whole-life, endowment, annuity, investment-linked, universal life, and health care and medical insurance to individual and corporate customers. Its Property and Casualty Insurance segment provides auto, non-auto, and accident and health insurance to individual and corporate customers. The company's Banking segment undertakes loan and intermediary businesses with corporate and retail customers; and offers wealth management and credit card services to individual customers. Its Trust segment provides trust services; and undertakes investing activities. The company's Securities segment offers brokerage, trading, investment banking, and asset management services. Its Other Asset Management segment provides investment management, finance lease, and other asset management services. The company's Technology segment offers financial and daily-life services through internet platforms, such as financial transaction information service platform, and health care service platform. It also provides annuity insurance, investment management, IT and business process outsourcing, real estate investment, futures brokerage, consulting, project investment, financial advisory, currency brokerage, property agency, fund raising and distribution, real estate development and leasing, and insurance agency services. In addition, the company provides factoring, equity investment, financing guarantee, logistics, management consulting, e-commerce, credit information, and private equity financing services; and operates an expressway, as well as produces and sells consumer chemicals. The company has strategic agreements with Zhongshan Hospital and Shenzhen Stock Exchange. The company was founded in 1988 and is based in Shenzhen, China.",
        "currency": "MXN",
        "sector": "Financial",
        "industry": "Life Insurance",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.pingan.com",
        "market_cap": "Large Cap"
    }
}