{"MJH.L": {"short_name": "MJ HUDSON GROUP PLC ORD NPV", "long_name": "MJ Hudson Group plc", "summary": "MJ Hudson Group plc operates as a financial services support provider for the fund managers and asset owners in the United Kingdom, the Channel Islands, Switzerland, Netherlands, Luxembourg, rest of Europe, North America, the Cayman Islands, and internationally. The company operates through three segments: Advisory, Business Outsourcing, and Data & Analytics. The Advisory segment offers legal and consultancy services to alternative asset managers, corporate entities, and institutional investors, as well as provides provision of individual independent investment advising and professional trustees services to corporate pension schemes, local government pension schemes, and charitable organisations. The Business Outsourcing segment, a multi-service platform provides various management, operations and marketing support services to asset managers and advisers. It offers ongoing business support services for fund managers and funds. Its services include front, middle, and back office functions comprising investor relations, portfolio management, risk management, fund and corporate administration, accounting, and fiduciary services. The Data & Analytics segment provides research, consulting, and benchmarking services, as well as tools to support investment and tax-advantaged investing. The company was founded in 2010 and is based in St Helier, Jersey.", "currency": "GBp", "sector": "Industrials", "industry": "Consulting Services", "exchange": "LSE", "market": "gb_market", "country": "Jersey", "city": "Saint Helier"}, "MMP.JO": {"short_name": "Marshall Monteagle plc", "long_name": "Marshall Monteagle PLC", "summary": "Marshall Monteagle PLC, an investment holding company, engages in the import and distribution, and property holding businesses in South Africa, Europe, the United States, and the Middle East. The company owns and manages a commercial property in the United States, and multi-tenanted rent properties in South Africa; and imports, exports, distributes, and trades in hand tools, machinery, non-perishable food, coffee roasting and other household consumer products, and metals and minerals. It also procures and supplies bulk raw materials and ingredients to the food manufacturing sector, and bulk packaging materials to various manufacturing sectors; engages in the warehousing and logistics business; and provides trade finance solutions to a range of producers, traders, and end-users. Marshall Monteagle PLC is based in Saint Helier, the United Kingdom.", "currency": "ZAc", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "JNB", "market": "za_market", "country": "Jersey", "city": "Saint Helier"}, "WI2.F": {"short_name": "WIZZ AIR HLDGS  LS -,0001", "long_name": "Wizz Air Holdings Plc", "summary": "Wizz Air Holdings Plc, together with its subsidiaries, provides passenger air transportation services on scheduled short-haul and medium-haul point-to-point routes across Europe and the Middle East. As of June 03, 2020, it operated a fleet of 122 aircraft that offered services for approximately 710 routes from 25 bases connecting 155 airports in 45 countries. The company provides its services under the Wizz Air brand. Wizz Air Holdings Plc was founded in 2003 and is based in Saint Helier, Jersey.", "currency": "EUR", "sector": "Industrials", "industry": "Airlines", "exchange": "FRA", "market": "dr_market", "country": "Jersey", "city": "Saint Helier"}, "WIZZ.L": {"short_name": "WIZZ AIR HOLDINGS PLC ORD GBP0.", "long_name": "Wizz Air Holdings Plc", "summary": "Wizz Air Holdings Plc, together with its subsidiaries, provides passenger air transportation services on scheduled short-haul and medium-haul point-to-point routes across Europe and the Middle East. As of June 03, 2020, it operated a fleet of 122 aircraft that offered services for approximately 710 routes from 25 bases connecting 155 airports in 45 countries. The company provides its services under the Wizz Air brand. Wizz Air Holdings Plc was founded in 2003 and is based in Saint Helier, Jersey.", "currency": "GBp", "sector": "Industrials", "industry": "Airlines", "exchange": "LSE", "market": "gb_market", "country": "Jersey", "city": "Saint Helier"}, "WZZAF": {"short_name": "WIZZ AIR HLDGS PLC", "long_name": "Wizz Air Holdings Plc", "summary": "Wizz Air Holdings Plc, together with its subsidiaries, provides passenger air transportation services on scheduled short-haul and medium-haul point-to-point routes across Europe and the Middle East. As of June 03, 2020, it operated a fleet of 122 aircraft that offered services for approximately 710 routes from 25 bases connecting 155 airports in 45 countries. The company provides its services under the Wizz Air brand. Wizz Air Holdings Plc was founded in 2003 and is based in Saint Helier, Jersey.", "currency": "USD", "sector": "Industrials", "industry": "Airlines", "exchange": "PNK", "market": "us_market", "country": "Jersey", "city": "Saint Helier"}}