{
    "PHIAN.MX": {
        "short_name": "KONINKLIJKE PHILIPS NV",
        "long_name": "Koninklijke Philips N.V.",
        "summary": "Koninklijke Philips N.V. operates as a health technology company worldwide. It operates through Diagnosis & Treatment, Connected Care, and Personal Health segments. It provides magnetic resonance imaging, computed tomography, advanced molecular imaging, and diagnostic X-ray, as well as integrated clinical solutions; interventional X-ray systems, including cardiovascular, radiology and surgery, and interventional imaging and therapy devices; imaging products focused on diagnosis, treatment planning and guidance for cardiology, general imaging, obstetrics/gynecology, and point-of-care applications; proprietary software to enable diagnostics and intervention; and enterprise diagnostic informatics products and services. The company also offers monitoring and analytics solutions; sleep and respiratory care solutions; emergency care and resuscitation solutions; data, analytics, and actionable workflow products; and connected care informatics solutions. In addition, it provides power toothbrushes; infant feeding and digital parental solutions; male grooming and beauty products; and kitchen appliances, home care, garment care, and coffee products. Further, the company offers digital frameworks that connect consumers, patients, healthcare providers, payers, and partners in a cloud-based connected health ecosystem of solutions, products, systems, services, and devices. It has a strategic collaboration with BioIntelliSense to integrate BioSticker medical device into the company's remote patient monitoring offering to help monitor at-risk patients from the hospital into the home; a collaboration with Singapore General Hospital to establish the digital and computational pathology center of excellence; and partnership with InSightec. The company was formerly known as Koninklijke Philips Electronics N.V. and changed its name to Koninklijke Philips N.V. in May 2013. Koninklijke Philips N.V. was founded in 1891 and is headquartered in Amsterdam, the Netherlands.",
        "currency": "MXN",
        "sector": "Healthcare",
        "industry": "Medical Laboratories & Research",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    }
}