{
  "4IG.BD": {
    "city": "Budapest",
    "country": "Hungary",
    "currency": "HUF",
    "exchange": "BUD",
    "industry": "Information Technology Services",
    "long_name": "4iG Nyrt.",
    "market": "hu_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "4IG",
    "state": null,
    "summary": "4iG Nyrt. operates in the information technology (IT) sector in Hungary. The company operates through IT services, Trade, and Other Activities. It engages in the resale of hardware and software products. The company also offers digitalization solutions for various industries, including utility, energy, financial, and public administration, as well as 3D solutions; and managed services, such as outsource operations, IT remote monitoring, PC as a service fleet management, GDPR compliance, BCP-DR, PERIMETER DEFENCE UTM firewall as a service, data center hardware extended warranty, OFFICE 365 backup, and managed security services. In addition, it provides custom solutions, including software development, integration, project management, and quality assurance; planning, migration, and operation; document and process management, and real time cooperation; data asset management; and IT security-consulting services, as well as IT infrastructure services. Further, the company operates enterprise resource planning systems. It also exports its products. 4iG Nyrt. was founded in 1990 and is based in Budapest, Hungary.",
    "website": "http://www.4ig.hu",
    "zipcode": "1037"
  },
  "DELTA.BD": {
    "city": "Budapest",
    "country": "Hungary",
    "currency": "HUF",
    "exchange": "BUD",
    "industry": "Information Technology Services",
    "long_name": "Delta Technologies Nyrt.",
    "market": "hu_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DELTA",
    "state": null,
    "summary": "Est Média Nyrt. operates as an Application Service Provider (ASP) that develops and operates database-based Internet, Wireless Application Protocol (WAP), and SMS applications. The company's products include Webgyár, an online content management system; and IVY PortalPrint, which is Microsoft .NET based online publishing and content management solution for creating online magazines and Web portals. It also offers custom development, co-location, and consulting services. The company's clients include Campona Shopping Center, CA IB Fund Management, Vodafone Live!, and Hungarian Mineral Water Association. It has strategic partnerships with Oracle, Nokia, HP, Microsoft, and Budapest Stock Exchange. Est Média Nyrt. was formerly known as econet.hu. The company is based in Budapest, Hungary.",
    "website": "http://www.estmedia.hu",
    "zipcode": "1013"
  },
  "E8E4.F": {
    "city": "Budapest",
    "country": "Hungary",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Delta Technologies Nyrt.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DELTA TECHNOLOGI. UF -,78",
    "state": null,
    "summary": "Est Média Nyrt. operates as an Application Service Provider (ASP) that develops and operates database-based Internet, Wireless Application Protocol (WAP), and SMS applications. The company's products include Webgyár, an online content management system; and IVY PortalPrint, which is Microsoft .NET based online publishing and content management solution for creating online magazines and Web portals. It also offers custom development, co-location, and consulting services. The company's clients include Campona Shopping Center, CA IB Fund Management, Vodafone Live!, and Hungarian Mineral Water Association. It has strategic partnerships with Oracle, Nokia, HP, Microsoft, and Budapest Stock Exchange. Est Média Nyrt. was formerly known as econet.hu. The company is based in Budapest, Hungary.",
    "website": "http://www.estmedia.hu",
    "zipcode": "1013"
  }
}
