{
  "LUPA3.SA": {
    "city": "São Paulo",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Oil & Gas Equipment & Services",
    "long_name": "Lupatech S.A.",
    "market": "br_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "LUPATECH    ON      NM",
    "state": "SP",
    "summary": "Lupatech S.A. provides products and services for the oil and gas sector in Brazil and internationally. The company operates in two segments, Products and Services. The Products Segment offers anchoring ropes for platforms in deep waters; automated and manual valves for use in application, exploration, production, transportation, and refining of petroleum and hydrocarbon chain; equipment for completion of petroleum wells, coating, and inspection of drilling and production pipes. The Service Segment provides drilling rig and workover services, well intervention and drilling, and repair services. The company was formerly known as Valmicro Indústria e Comércio de Válvulas S.A. and changed its name to Lupatech S.A. in March 1993. Lupatech S.A. was founded in 1980 and is based in São Paulo, Brazil.",
    "website": "http://www.lupatech.com.br",
    "zipcode": "04571-910"
  },
  "OSXB3.SA": {
    "city": "Rio De Janeiro",
    "country": "Brazil",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Oil & Gas Equipment & Services",
    "long_name": "OSX Brasil S.A.",
    "market": "br_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "OSX BRASIL  ON      NM",
    "state": "RJ",
    "summary": "OSX Brasil S.A. is in the process of liquidation. Previously, it was engaged in the provision of integrated engineering, construction, chartering, and operation and maintenance services for the oil exploration and production companies in Brazil and internationally. The company was formerly known as EBX Brasil S.A. and changed its name to OSX Brasil S.A. in October 2009. OSX Brasil S.A. was incorporated in 2007 and is headquartered in Rio de Janeiro, Brazil.",
    "website": "http://www.osx.com.br",
    "zipcode": "22290-906"
  }
}
