{
    "GPRC": {
        "short_name": "GUANWEI RECYCLING CORP",
        "long_name": "Biochar Now, Inc.",
        "summary": "Guanwei Recycling Corp. manufactures and distributes low density polyethylene (LDPE) and other recycled plastics products primarily in the People's Republic of China and internationally. It imports and recycles LDPE plastic scrap material into granular plastic for use in the manufacture of various consumer products. The company's LDPE products are used in the manufacture of chemical and functional fibers, as well as a raw material in the manufacture of shoe soles, insulation materials, fire-proofing and water-proofing materials, and foam. It also sells its products to customers in a range of industries, including shoe manufacturing, architecture and engineering products, industrial equipment and supplies, and chemical and petrochemical manufacturing. Guanwei Recycling Corp. was founded in 2005 and is based in Fuqing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Fuqing",
        "zipcode": "350301",
        "website": null,
        "market_cap": "Small Cap"
    },
    "THTI": {
        "short_name": "THT HEAT TRANSFER TECHNOLOGY IN",
        "long_name": "THT Heat Transfer Technology, Inc.",
        "summary": "THT Heat Transfer Technology, Inc., through its subsidiaries, manufactures and trades in plate heat exchangers and various related products in China and internationally. The company offers heat exchanger units, air-cooled heat exchangers, shell-and-tube heat exchangers, welded plate heat exchangers, and plate-and-shell heat exchangers. Its products are used for various applications in iron, steel, and aluminum manufacturing; chemical manufacturing; electric and nuclear power generation; central building air-conditioning; pharmaceutical production; thermal power plants and residential heating systems; high-pressure liquids; refining, chemical, fertilizer production, and metallurgy equipment; and food and beverage, heat and power, petrochemical, and shipbuilding industry. The company markets its products through its sales force. THT Heat Transfer Technology, Inc. is headquartered in Siping, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Siping",
        "zipcode": "136000",
        "website": "http://www.tht.cn",
        "market_cap": "Small Cap"
    }
}