{
    "2QAA.F": {
        "short_name": "AURIS MEDICAL HLDG SF-,01",
        "long_name": "Auris Medical Holding Ltd.",
        "summary": "Auris Medical Holding Ltd., a clinical-stage biopharmaceutical company, developing therapeutics that address important unmet medical needs in neurotology, rhinology and allergy, and CNS disorders. The company's Phase 3 programs under the development include Keyzilen (AM-101) for the treatment of acute inner ear tinnitus; and Sonsuvi (AM-111) for the treatment of acute inner ear hearing loss. It is also developing AM-125 that is in Phase 2 clinical trial for the intranasal treatment of acute peripheral vertigo; AM-201, which has completed Phase 1b clinical trial for the prevention of antipsychotic induced weight gain and drowsiness; and AM-301, a drug-free nasal spray for protection against airborne viruses and allergens, as well as AM-102 for the tinnitus treatment. The company has a collaboration and license agreement with INSERM; and Xigen S.A. to develop, manufacture, and commercialize pharmaceutical products, as well as drug delivery devices and formulations for local administration of therapeutic substances to the inner ear for the treatment of ear disorders. Auris Medical Holding Ltd. was founded in 1998 and is headquartered in Hamilton, Bermuda.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.aurismedical.com",
        "market_cap": "Small Cap"
    },
    "EARS": {
        "short_name": "Auris Medical Holding Ltd.",
        "long_name": "Auris Medical Holding Ltd.",
        "summary": "Auris Medical Holding Ltd., a clinical-stage biopharmaceutical company, developing therapeutics that address important unmet medical needs in neurotology, rhinology and allergy, and CNS disorders. The company's Phase 3 programs under the development include Keyzilen (AM-101) for the treatment of acute inner ear tinnitus; and Sonsuvi (AM-111) for the treatment of acute inner ear hearing loss. It is also developing AM-125 that is in Phase 2 clinical trial for the intranasal treatment of acute peripheral vertigo; AM-201, which has completed Phase 1b clinical trial for the prevention of antipsychotic induced weight gain and drowsiness; and AM-301, a drug-free nasal spray for protection against airborne viruses and allergens, as well as AM-102 for the tinnitus treatment. The company has a collaboration and license agreement with INSERM; and Xigen S.A. to develop, manufacture, and commercialize pharmaceutical products, as well as drug delivery devices and formulations for local administration of therapeutic substances to the inner ear for the treatment of ear disorders. Auris Medical Holding Ltd. was founded in 1998 and is headquartered in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.aurismedical.com",
        "market_cap": "Small Cap"
    },
    "KNSA": {
        "short_name": "Kiniksa Pharmaceuticals, Ltd.",
        "long_name": "Kiniksa Pharmaceuticals, Ltd.",
        "summary": "Kiniksa Pharmaceuticals, Ltd., a clinical-stage biopharmaceutical company, focuses on discovering, acquiring, developing, and commercializing therapeutic medicines for patients suffering from debilitating diseases with significant unmet medical need worldwide. Its product candidates include Rilonacept, which is in Phase III clinical trials for the treatment of recurrent pericarditis, an inflammatory cardiovascular disease; Mavrilimumab, a monoclonal antibody that is in Phase II clinical trials for the treatment of giant cell arteritis; and Vixarelimab, a monoclonal antibody, which is in Phase 2a clinical trial for the treatment of prurigo nodularis, a chronic inflammatory skin condition. The company's preclinical product candidates comprise KPL-404, a monoclonal antibody inhibitor of the CD40/CD40L interaction, a central control node of T-cell-dependent, and B-cell-mediated humoral adaptive immunity. The company has a clinical collaboration with Kite Pharma, Inc. to evaluate the combination of Yescarta and Mavrilimumab in patients with relapsed or refractory Large B-Cell lymphoma. Kiniksa Pharmaceuticals, Ltd. was founded in 2015 and is based in Hamilton, Bermuda.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Bermuda",
        "state": null,
        "city": "Hamilton",
        "zipcode": "HM 11",
        "website": "http://www.kiniksa.com",
        "market_cap": "Small Cap"
    }
}