{
  "FNXLF": {
    "city": "Hamilton",
    "country": "Bermuda",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Capital Markets",
    "long_name": "Fenix Financial Ltd.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Financial Services",
    "short_name": "FENIX FINANCIAL LTD",
    "state": null,
    "summary": "Fenix Financial Ltd. operates in the financial sector. It allows individual and institutional customers to execute trades with the New York Stock Exchange, NASDAQ, American Stock Exchange, and other exchanges. The company is based in Hamilton, Bermuda.",
    "website": null,
    "zipcode": "HM 12"
  },
  "LAZ": {
    "city": "Hamilton",
    "country": "Bermuda",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Capital Markets",
    "long_name": "Lazard Ltd",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "Lazard LTD. Lazard, LTD.",
    "state": null,
    "summary": "Lazard Ltd, together with its subsidiaries, operates as a financial advisory and asset management firm in North America, Europe, Asia, Australia, and Central and South America. Its Financial Advisory segment offers various financial advisory services regarding mergers and acquisitions, capital advisory, restructurings, shareholder advisory, sovereign advisory, capital raising, and other strategic advisory matters. This segment serves corporate, partnership, institutional, government, sovereign, and individual clients across various industry areas, including consumers, financial institutions, healthcare and life sciences, industrials, power and energy/infrastructure, and real estate, as well as technology, media, and telecommunications. The company's Asset Management segment offers a range of investment solutions and investment management services in equity and fixed income strategies; asset allocation strategies; and alternative investments and private equity funds to corporations, public funds, sovereign entities, endowments and foundations, labor funds, financial intermediaries, and private clients. Lazard Ltd was founded in 1848 and is based in Hamilton, Bermuda.",
    "website": "http://www.lazard.com",
    "zipcode": "HM11"
  }
}
