{
    "PK3.SG": {
        "short_name": "PKP Cargo S.A. Inhaber-Aktien A",
        "long_name": "Pkp Cargo S.A.",
        "summary": "Pkp Cargo S.A. provides logistics solutions in Poland and internationally. The company offers railway transportation services for coal, coke, aggregates, construction materials, timber and agricultural products, chemicals, liquid fuels, metals and ores, automotive products, and special freight. It also provides intermodal transportation services, such as transport of containers through various means of transport, including train, ship, and car; and operates 25 terminals, which provide handling, forwarding, storage, sorting, crushing, warehousing, and packaging services. In addition, the company offers railway, road, sea, and air forwarding services; trains and cars ferry transportation services; and handling services comprising customs clearance support services at sea ports and land terminals. Further, it provides railway siding operation services; and maintains, upgrades, and repairs rolling stock items. Additionally, the company is involved in the transshipment of goods, and buying and selling of coal; management of track and service infrastructure, such as rail sidings and track systems; construction engineering business, including management and revitalization of postindustrial areas consisting of mining areas, demolition works, management of waste treatment facilities, elimination of underground mining pits, decontamination of soil, etc.; collection, treatment, and disposal of waste and recovery of raw materials; and rental and cleaning of rail cars and automobile cisterns. As of December 31, 2019, the company operated approximately 62,330 wagons and 2,340 locomotives. It serves mining and metal processing, construction, chemicals, timber, food, and automotive industries; and power and heat generation sectors. Pkp Cargo S.A. was founded in 2001 and is headquartered in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Warsaw",
        "zipcode": "02-021",
        "website": "http://www.pkpcargo.com",
        "market_cap": "Small Cap"
    }
}