{
    "6113.HK": {
        "short_name": "UTS MARKETING",
        "long_name": "UTS Marketing Solutions Holdings Limited",
        "summary": "UTS Marketing Solutions Holdings Limited, an investment holding company, provides outbound telemarketing services in Malaysia. It offers telemarketing services of financial products, which include insurance, credit cards, and balance transfers through its contact centers, as well as donation programs for its clients. As of December 31, 2020, the company operated eight contact centers. It also offers outsourced contact center campaigns and setting up, as well as manages contact center facilities; and business development solutions that assist clients in securing or acquiring new business partnerships and expanding the business. The company primarily serves banks, insurance companies, takaful operators, and charitable organizations. UTS Marketing Solutions Holdings Limited was founded in 2007 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50200",
        "website": "http://unitedteleservice.com",
        "market_cap": "Micro Cap"
    },
    "AXXTF": {
        "short_name": "AXIATA GROUP BHD",
        "long_name": "Axiata Group Berhad",
        "summary": "Axiata Group Berhad, an investment holding company, provides telecommunications services in Asia. It offers mobile telephony and broadband services, fixed telecommunications, and digital pay television services; digital telco services to mobile, home, and enterprise customers; and digital platform, which connects businesses to ecosystem and customers worldwide; and infrastructure solutions and services. The company provides digital financial services, such as e-wallets, micro-financing, and micro-insurance; and digital advertising that designs and executes integrated digital, analytics, and marketing solutions. The company was formerly known as TM International Berhad and changed its name to Axiata Group Berhad in March 2009. Axiata Group Berhad was incorporated in 1992 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50470",
        "website": "http://www.axiata.com",
        "market_cap": "Mid Cap"
    },
    "FDV.AX": {
        "short_name": "FRONT D V FPO",
        "long_name": "Frontier Digital Ventures Limited",
        "summary": "Frontier Digital Ventures Limited is a private equity firm specializing in investing and developing online classifieds business in emerging markets. The firm prefers to invest in property and automotive verticals and general classifieds/marketplace websites. Frontier Digital Ventures Limited was founded in May 2014 and is based in Kuala Lumpur, Malaysia with an additional office in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://frontierdv.com",
        "market_cap": "Small Cap"
    },
    "FRX.AX": {
        "short_name": "FLEXIROAM FPO",
        "long_name": "Flexiroam Limited",
        "summary": "Flexiroam Limited, a mobile data operator, provides voice and data roaming services to travellers in Africa, Asia, Europe, North America, South America, Oceania, and Antarctica. Its products include Flexiroam X, an app that enables data connectivity; FLEXI+ that offers data backing services to enterprises; and XACE, which provides programmable data connectivity to Internet of Things and SuperApps players to enable its hardware/software to stay connected with multiple networks. Flexiroam Limited has partnership with Mastercard Incorporated. The company was incorporated in 2010 and is headquartered in Petaling Jaya, Malaysia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "47820",
        "website": "http://www.flexiroam.com",
        "market_cap": "Nano Cap"
    },
    "ICQ.AX": {
        "short_name": "ICAR ASIA FPO",
        "long_name": "iCar Asia Limited",
        "summary": "iCar Asia Limited develops, owns, and operates internet based automotive portals for used and new car buyers in South East Asia. It operates automotive portals under the Carlist.my and LiveLifeDrive brands in Malaysia; Mobil123.com, Otospirit.com, and carmudi.co.id brands in Indonesia; and one2car.com, Autospinn.com, and Thaicar.com brands in Thailand. iCar Asia Limited was incorporated in 2012 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Internet Content & Information",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://www.icarasia.com",
        "market_cap": "Micro Cap"
    },
    "IS3.AX": {
        "short_name": "ISYNERGY FPO",
        "long_name": "I Synergy Group Limited",
        "summary": "I Synergy Group Limited, an investment holding company, provides affiliate marketing network and solutions to advertisers and affiliates in Malaysia and Indonesia. It operates Affiliate Junction, an affiliate marketing platform offers affiliate marketing solutions through a single platform. The company's platform delivers performance-based affiliate marketing solutions that enhance product/brand awareness and drive business leads. It also provides related affiliate management services for the commercial industries; and research, development, maintenance, and commercialization of proprietary affiliate marketing platform and learning management system; and customized software design and development services and solutions. The company was founded in 2008 and is based in Kuala Lumpur, Malaysia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://www.i-synergygroup.com",
        "market_cap": "Nano Cap"
    },
    "ORNT.L": {
        "short_name": "ORIENT TELECOMS PLC ORD 10P",
        "long_name": "Orient Telecoms Plc",
        "summary": "Orient Telecoms Plc provides managed telecommunications services in the United Kingdom and Malaysia. The company offers broadband, dedicated internet access, wireless, IP Transit, IPLC, leased line, SD-WAN, satellite, private area network, and voice and VOIP solutions; application and security products, such as firewall, antivirus, endpoint security, MS 365, and SIEM services; web and email hosting, and cloud storage and security services; and water drone, smart street light, and hyper health services. It also provides FlexiMate, an adaptive connectivity solution; OfficeMate, an IT ecosystem solution; SecureMate, a cyber-security solution; and SonicMate, a big data solution. In addition, the company offers high-speed data services to data centers. It serves financial, government, telecommunications, medical, hospitality, and e-commerce industries, as well as education institutions and MNCs. The company was incorporated in 2016 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50470",
        "website": "http://www.orient-telecoms.com",
        "market_cap": null
    },
    "TGRP": {
        "short_name": "TRON GROUP INC",
        "long_name": "TRON Group Inc.",
        "summary": "TRON Group Inc. operates as a mobile virtual network operator in Malaysia. The company engages in the provision of telecommunication related services, as well as offers borderless voice, data, and other value-added services. It also provides prepaid sim-cards, reload coupons, and other related products through referral program module. The company was formerly known as Plush Corporation and changed its name to TRON Group Inc. in November 2016.TRON Group Inc. was incorporated in 2015 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Telecom Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "58200",
        "website": "http://www.tron.com.my",
        "market_cap": "Nano Cap"
    }
}