{
    "STAR.L": {
        "short_name": "STARCOM PLC ORD NPV",
        "long_name": "Starcom plc",
        "summary": "Starcom plc, a technology company, develops automated systems for the remote tracking, monitoring, protection, and management of people, fleet of vehicles, containers, and assets. The company operates in Hardware and SAS segments. It offers Helios, an automatic vehicle location and fleet management system; Tetis, a real-time monitoring and tracking GPS solutions for dry and refrigerated containers; Lokies, a keyless padlock with Internet of Things capabilities; and Kylos, a GPS tracker and management system for asset management, monitoring, and tracking. The company also provides Online web application tools for web based fleet management and container management, as well as for monitoring and management; Control Center, an operational security center application for various emergency situations comprising theft, accidents, or driver emergency; and Olympia Tracking, an application for iOS and Android-based mobile devices, as well as Zeppos advanced management software that allows to manage all assets and team members under one platform. It serves high security facilities, including governmental facilities, army bases, or airports; containers and tanker truck companies; distribution fleet of vehicles, trucks, and vans; security companies for multiple and/or remote locations; insurance companies; and private clients. The company distributes and sells its products through a network of technology partners and independent operators in approximately 53 countries worldwide. Starcom plc was founded in 2004 and is based in Saint Helier, Jersey.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Jersey",
        "state": null,
        "city": "Saint Helier",
        "zipcode": "JE4 8TQ",
        "website": "http://www.starcomsystems.com",
        "market_cap": 3061742
    }
}