{"01K.F": {"short_name": "KELLER GRP PLC  LS-,10", "long_name": "Keller Group plc", "summary": "Keller Group plc provides geotechnical solutions in North America, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers ground improvement services to prepare the ground for new construction projects and to reduce the risk of liquefaction in the areas of seismic activity; and grouting services, which enhance target areas in the ground, and controls ground water flow through rocks and soils by reducing their permeability. It also provides heavy foundation solutions, including bored, CFA, driven piling, marine, and near shore structures, as well as underpin solutions; and earth retention systems that are used to solve a range of geotechnical solutions comprising slope stabilization and excavation support. In addition, the company offers post-tension cable systems, which are used to reinforce concrete foundations and structural spans; and instrumentation and monitoring solutions for various applications. Keller Group plc provides its services to the construction sector in infrastructure, industrial, commercial residential, and environmental projects. The company was founded in 1860 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "10I.F": {"short_name": "KIER GROUP PLC  LS-,01", "long_name": "Kier Group plc", "summary": "Kier Group plc primarily engages in construction business in the United Kingdom and internationally. The company operates through Construction, Infrastructure, and Other segments. It constructs power stations, roads, bridges, tunnels, and buildings; and provides maintenance services for the UK road, rail, and utilities infrastructure, as well as reactive repairs. The company also provides housing maintenance and facilities management services; environmental services comprising street cleaning, grounds maintenance, and commercial waste services; and invests in and develops property schemes and sites. Kier Group plc was founded in 1920 and is headquartered in Manchester, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Manchester"}, "AUK.L": {"short_name": "AUKETT SWANKE GROUP PLC ORD 1P", "long_name": "Aukett Swanke Group Plc", "summary": "Aukett Swanke Group Plc, together with its subsidiaries, provides integrated professional design services in the United Kingdom, the Middle East, and Continental Europe. The company's services comprise architectural design; interior design; master planning; executive architecture; related engineering services; and design for sustainability projects, heritage buildings, and adaptive reuse projects, as well as workplace strategy projects. It offers its services to property developers, owner occupiers, and governmental organizations. The company was formerly known as Aukett Fitzroy Robinson Group plc and changed its name to Aukett Swanke Group Plc in March 2014. Aukett Swanke Group Plc was incorporated in 1987 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BAB.L": {"short_name": "BABCOCK INTERNATIONAL GROUP PLC", "long_name": "Babcock International Group PLC", "summary": "Babcock International Group PLC, together with its subsidiaries, provides engineering services for marine, land, aviation, and nuclear sectors in the United Kingdom and internationally. The company's Marine segment offers life support services for naval ships, and infrastructure. Its Nuclear segment provides submarines and complex engineering services in support of various decommissioning programs and projects, training and operation support, new build program management, and design and installation. The company's Land segment offers large-scale critical vehicle fleet management, and equipment support and training services for military engineers. Its Aviation segment provides critical engineering services to defense and civil customers, including pilot training, equipment support, and airbase management, as well as operates aviation fleets that provide delivering emergency and offshore services. Babcock International Group PLC was founded in 1891 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BAFBF": {"short_name": "BALFOUR BEATTY", "long_name": "Balfour Beatty plc", "summary": "Balfour Beatty plc finances, designs, develops, builds, and maintains infrastructure in the United Kingdom, the United States, and internationally. It operates through Construction Services, Support Services, and Infrastructure Investments segments. The Construction Services segment provides civil engineering, building, ground engineering, mechanical and electrical, refurbishment, fit-out, and rail engineering services. The Support Services segment designs, upgrades, manages, and maintains water, gas, and electricity networks, as well as rail and highways. The Infrastructure Investments segment is involved in the acquisition, operation, and disposal of infrastructure assets, such as roads, hospitals, student accommodation, military housing, offshore transmission networks, waste and biomass, and other concessions. This segment also develops and finances public and private infrastructure projects. The company serves government departments and agencies, regulated utilities, and private sector organizations. Balfour Beatty plc was founded in 1909 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "BAFYY": {"short_name": "BALFOUR BEATTY", "long_name": "Balfour Beatty plc", "summary": "Balfour Beatty plc finances, designs, develops, builds, and maintains infrastructure in the United Kingdom, the United States, and internationally. It operates through Construction Services, Support Services, and Infrastructure Investments segments. The Construction Services segment provides civil engineering, building, ground engineering, mechanical and electrical, refurbishment, fit-out, and rail engineering services. The Support Services segment designs, upgrades, manages, and maintains water, gas, and electricity networks, as well as rail and highways. The Infrastructure Investments segment is involved in the acquisition, operation, and disposal of infrastructure assets, such as roads, hospitals, student accommodation, military housing, offshore transmission networks, waste and biomass, and other concessions. This segment also develops and finances public and private infrastructure projects. The company serves government departments and agencies, regulated utilities, and private sector organizations. Balfour Beatty plc was founded in 1909 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "BBY.L": {"short_name": "BALFOUR BEATTY PLC ORD 50P", "long_name": "Balfour Beatty plc", "summary": "Balfour Beatty plc finances, designs, develops, builds, and maintains infrastructure in the United Kingdom, the United States, and internationally. It operates through Construction Services, Support Services, and Infrastructure Investments segments. The Construction Services segment provides civil engineering, building, ground engineering, mechanical and electrical, refurbishment, fit-out, and rail engineering services. The Support Services segment designs, upgrades, manages, and maintains water, gas, and electricity networks, as well as rail and highways. The Infrastructure Investments segment is involved in the acquisition, operation, and disposal of infrastructure assets, such as roads, hospitals, student accommodation, military housing, offshore transmission networks, waste and biomass, and other concessions. This segment also develops and finances public and private infrastructure projects. The company serves government departments and agencies, regulated utilities, and private sector organizations. Balfour Beatty plc was founded in 1909 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BCKIF": {"short_name": "BABCOCK INTERNATIONAL GROUP", "long_name": "Babcock International Group PLC", "summary": "Babcock International Group PLC, together with its subsidiaries, provides engineering services for marine, land, aviation, and nuclear sectors in the United Kingdom and internationally. The company's Marine segment offers life support services for naval ships, and infrastructure. Its Nuclear segment provides submarines and complex engineering services in support of various decommissioning programs and projects, training and operation support, new build program management, and design and installation. The company's Land segment offers large-scale critical vehicle fleet management, and equipment support and training services for military engineers. Its Aviation segment provides critical engineering services to defense and civil customers, including pilot training, equipment support, and airbase management, as well as operates aviation fleets that provide delivering emergency and offshore services. Babcock International Group PLC was founded in 1891 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "BCKIY": {"short_name": "BABCOCK INTERNATIONAL GROUP", "long_name": "Babcock International Group PLC", "summary": "Babcock International Group PLC, together with its subsidiaries, provides engineering services for marine, land, aviation, and nuclear sectors in the United Kingdom and internationally. The company's Marine segment offers life support services for naval ships, and infrastructure. Its Nuclear segment provides submarines and complex engineering services in support of various decommissioning programs and projects, training and operation support, new build program management, and design and installation. The company's Land segment offers large-scale critical vehicle fleet management, and equipment support and training services for military engineers. Its Aviation segment provides critical engineering services to defense and civil customers, including pilot training, equipment support, and airbase management, as well as operates aviation fleets that provide delivering emergency and offshore services. Babcock International Group PLC was founded in 1891 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "BIH.F": {"short_name": "BALFOUR BEATTY PLC LS-,50", "long_name": "Balfour Beatty plc", "summary": "Balfour Beatty plc finances, designs, develops, builds, and maintains infrastructure in the United Kingdom, the United States, and internationally. It operates through Construction Services, Support Services, and Infrastructure Investments segments. The Construction Services segment provides civil engineering, building, ground engineering, mechanical and electrical, refurbishment, fit-out, and rail engineering services. The Support Services segment designs, upgrades, manages, and maintains water, gas, and electricity networks, as well as rail and highways. The Infrastructure Investments segment is involved in the acquisition, operation, and disposal of infrastructure assets, such as roads, hospitals, student accommodation, military housing, offshore transmission networks, waste and biomass, and other concessions. This segment also develops and finances public and private infrastructure projects. The company serves government departments and agencies, regulated utilities, and private sector organizations. Balfour Beatty plc was founded in 1909 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "BILN.L": {"short_name": "BILLINGTON HOLDINGS PLC ORD 10P", "long_name": "Billington Holdings Plc", "summary": "Billington Holdings Plc, through its subsidiaries, designs, manufactures, and installs structural steelworks in the United Kingdom, Europe, and internationally. The company designs, fabricates, and installs engineered steelworks, staircases, and balustrade systems. It also provides safety solutions and barrier systems to the construction industry; protection and fall prevention systems; complex steel structures primarily for the construction and rail infrastructure markets; and site hoarding solutions. The company also engages in the property rental and management services. It provides services to construction projects and operates in sectors, such as retail, commercial offices, education, healthcare, rail, and others. The company was formerly known as Amco Corporation Plc and changed its name to Billington Holdings Plc in June 2008. The company was incorporated in 1989 and is based in Barnsley, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Barnsley"}, "CTO.L": {"short_name": "TCLARKE PLC ORD 10P", "long_name": "TClarke plc", "summary": "TClarke plc, together with its subsidiaries, operates as a building services contractor in the United Kingdom. It engages in the design, installation, integration, and maintenance of the digital, mechanical, and electrical technologies and infrastructures. The company also provides mechanical and electrical contracting and related services to the construction industry and end users; and ICT services. In addition, it offers technologies in the areas of data centers, design for manufacture and assembly, IT infrastructures and networks, AV systems, fire, alarm and security systems, smart buildings, and offsite manufacture and prefabrication. Further, the company provides services in the areas of underground and over ground rails, civil and defense airports, healthcare, hospitals and research, school and universities, and prison and defense projects; and residential, hotels, refurbishment, and student accommodations. Additionally, it offers facilities management services; and mechanical and electrical contracting services for commercial offices, retails, leisure and stadiums, museum and galleries, and buildings. The company was founded in 1889 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "GFRD.L": {"short_name": "GALLIFORD TRY HOLDINGS PLC ORD ", "long_name": "Galliford Try Holdings PLC", "summary": "Galliford Try Holdings PLC, together with its subsidiaries, operates in the construction business in the United Kingdom. The company's Building division works with private and public sector clients in health, education, and defense. Its Infrastructure division carries out civil engineering projects in the highways and environment sectors. The company's PPP Investments division delivers various building and infrastructure projects through public-private partnerships and co-development opportunities. Its Facilities Management division provides services for buildings. Galliford Try Holdings PLC was incorporated in 2019 and is based in Uxbridge, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Uxbridge"}, "HILS.L": {"short_name": "HILL & SMITH HOLDINGS PLC ORD 2", "long_name": "Hill & Smith Holdings PLC", "summary": "Hill & Smith Holdings PLC designs, manufactures, and supplies infrastructure products; and provides galvanizing services. It operates through three segments: Infrastructure Products Â\u0096 Utilities; Infrastructure Products - Roads; and Galvanizing Services. The Infrastructure Products Â\u0096 Utilities segment provides industrial floorings, plastic drainage pipes, security fencing, and steel and composite products for a range of infrastructure markets, including energy creation and distribution, rail, water, and house building. This segment offers access systems, building products, cooling towers, electrical utility products, fiber reinforced composites, perimeter security products, pipe supports, and water management products. The Infrastructure Products - Roads segment designs, manufactures, and installs temporary and permanent safety products for the roads market together with intelligent transport systems, which provide information to road users. This segment offers bridge products, lighting and street furniture, technology, vehicle restraint systems, and work zone protection products. The Galvanizing Services segment provides corrosion protection services in the form of zinc and other coatings to external customers and group companies in a range of industrial and commercial applications, including fencing, lighting columns, structural steel work, bridges, electricity substations, and other products for the infrastructure, construction, and agricultural markets. The company offers its products and services in the United Kingdom and rest of Europe, North America, the Middle East, Asia, and rest of world. Hill & Smith Holdings PLC was founded in 1824 and is based in Solihull, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Solihull"}, "JL0.F": {"short_name": "JOHN LAING GROUP  LS -,10", "long_name": "John Laing Group plc", "summary": "John Laing Group plc, an investment holding company, originates, invests in, and manages greenfield infrastructure projects. It operates through Primary Investment, Secondary Investment, and Asset Management segments. The company originates, invests in, and manages social, transport, and environmental infrastructure projects under government backed public-private partnership programs in the Asia Pacific, North America, Contiental Europe, and the United Kingdom; and invests in and manages solar PV parks, onshore and offshore wind farm projects, and biomass plants in the United Kingdom, Irish, French, German, Swedish, and Australian markets. It also provides investment advice and asset management services to listed funds. Laing Group plc was founded in 1848 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "JLG.L": {"short_name": "JOHN LAING GROUP PLC ORD 10P", "long_name": "John Laing Group plc", "summary": "John Laing Group plc, an investment holding company, originates, invests in, and manages greenfield infrastructure projects. It operates through Primary Investment, Secondary Investment, and Asset Management segments. The company originates, invests in, and manages social, transport, and environmental infrastructure projects under government backed public-private partnership programs in the Asia Pacific, North America, Contiental Europe, and the United Kingdom; and invests in and manages solar PV parks, onshore and offshore wind farm projects, and biomass plants in the United Kingdom, Irish, French, German, Swedish, and Australian markets. It also provides investment advice and asset management services to listed funds. Laing Group plc was founded in 1848 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "KIE.L": {"short_name": "KIER GROUP PLC ORD 1P", "long_name": "Kier Group plc", "summary": "Kier Group plc primarily engages in construction business in the United Kingdom and internationally. The company operates through Construction, Infrastructure, and Other segments. It constructs power stations, roads, bridges, tunnels, and buildings; and provides maintenance services for the UK road, rail, and utilities infrastructure, as well as reactive repairs. The company also provides housing maintenance and facilities management services; environmental services comprising street cleaning, grounds maintenance, and commercial waste services; and invests in and develops property schemes and sites. Kier Group plc was founded in 1920 and is headquartered in Manchester, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Manchester"}, "KLR.L": {"short_name": "KELLER GROUP PLC ORD 10P", "long_name": "Keller Group plc", "summary": "Keller Group plc provides geotechnical solutions in North America, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers ground improvement services to prepare the ground for new construction projects and to reduce the risk of liquefaction in the areas of seismic activity; and grouting services, which enhance target areas in the ground, and controls ground water flow through rocks and soils by reducing their permeability. It also provides heavy foundation solutions, including bored, CFA, driven piling, marine, and near shore structures, as well as underpin solutions; and earth retention systems that are used to solve a range of geotechnical solutions comprising slope stabilization and excavation support. In addition, the company offers post-tension cable systems, which are used to reinforce concrete foundations and structural spans; and instrumentation and monitoring solutions for various applications. Keller Group plc provides its services to the construction sector in infrastructure, industrial, commercial residential, and environmental projects. The company was founded in 1860 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "KLRGF": {"short_name": "KELLER GROUP", "long_name": "Keller Group plc", "summary": "Keller Group plc provides geotechnical solutions in North America, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers ground improvement services to prepare the ground for new construction projects and to reduce the risk of liquefaction in the areas of seismic activity; and grouting services, which enhance target areas in the ground, and controls ground water flow through rocks and soils by reducing their permeability. It also provides heavy foundation solutions, including bored, CFA, driven piling, marine, and near shore structures, as well as underpin solutions; and earth retention systems that are used to solve a range of geotechnical solutions comprising slope stabilization and excavation support. In addition, the company offers post-tension cable systems, which are used to reinforce concrete foundations and structural spans; and instrumentation and monitoring solutions for various applications. Keller Group plc provides its services to the construction sector in infrastructure, industrial, commercial residential, and environmental projects. The company was founded in 1860 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "MGNS.L": {"short_name": "MORGAN SINDALL GROUP PLC ORD 5P", "long_name": "Morgan Sindall Group plc", "summary": "Morgan Sindall Group plc operates as a construction and regeneration company in the United Kingdom. The company operates in six divisions: Construction & Infrastructure, Fit Out, Property Services, Partnership Housing, Urban Regeneration, and Investments. The Construction & Infrastructure division offers infrastructure services to highways, rail, aviation, energy, water, and nuclear markets; and construction services in education, healthcare, defence, commercial, industrial, leisure, and retail markets. This division also offers multi-disciplinary design and engineering consultancy services. The Fit Out division specializes in fit out and refurbishment projects in commercial, central, and local government offices, as well as education, and retail banking markets. This division also provides office interior design and build services. The Property Services division offers planned maintenance and responsive repair services to social housing and the public sector. The Partnership Housing division engages in the mixed-tenure development; building and developing homes for open market; sale and affordable rent; design and build contracting; and planned maintenance and refurbishment activities. The Urban Regeneration division works with landowners and public sector partners to transform the urban landscape through the development of multi-phase sites and mixed-use regeneration, including residential, commercial, retail, and leisure facilities. The Investments division provides opportunities across construction and regeneration activities. The company was incorporated in 1953 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "MOGP.L": {"short_name": "MOUNTFIELD GROUP PLC ORD 0.1P", "long_name": "Mountfield Group Plc", "summary": "Mountfield Group Plc provides construction support and property services to the private and public sectors in the United Kingdom and other European countries. The company operates through Construction and Fit-Out segments. It is involved in the supply of fit-out services, including the supply and installation of flooring systems to data centers, disaster recovery centers, and commercial office buildings; and fitting out and refurbishment of commercial office buildings, hospitals, and education facilities, as well as provides builders work packages on commercial IT facility buildings. The company also designs and builds projects; offers specialist bespoke hard flooring finishes, including timber, stone, and ceramics; provides principal contracting services; and undertakes site assembly for residential and commercial developments. Mountfield Group Plc was is based in Wickford, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Wickford"}, "NEXS.L": {"short_name": "NEXUS INFRASTRUCTURE PLC ORD GB", "long_name": "Nexus Infrastructure plc", "summary": "Nexus Infrastructure plc provides specialized infrastructure and engineering services to the housebuilding and commercial sectors in the United Kingdom. It operates through three segments: Tamdown, TriConnex, and eSmart Networks. The company undertakes earthworks; builds highways, substructures, and basements; and installs drainage systems, as well as engages in high-rise construction activities. It also designs, installs, and connects gas, electricity, water, and fiber networks for residential and commercial developments; provides electric vehicle charging infrastructure, battery storage, and connections to renewable energy sources; and offers public electric vehicle charging and smart energy infrastructure. The company was formerly known as Garbol plc and changed its name to Nexus Infrastructure plc in June 2016. Nexus Infrastructure plc was founded in 1976 and is based in Braintree, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Braintree"}, "NMCN.L": {"short_name": "NMCN PLC ORD 10P", "long_name": "nmcn plc", "summary": "nmcn plc provides built environment and critical national infrastructure projects in the United Kingdom. The company operates in two segments, Built Environment and Water. The Built Environment segment undertakes construction projects ranging from complex multi-storey city center developments to specialist refurbishment schemes. It offers new build and refurbishment services for social housing, student accommodation, health and primary care centers, commercial, education, and residential developments. This segment also designs and constructs projects spanning major highway construction on the trunk and minor road network to high specification public realm works; and manages and delivers national and regional network infrastructure to communications providers, including network maintenance for high speed fiber. In addition, it is involved in the planning and installation of telecoms services; construction of substations and power infrastructure; and design and build of industrial civil engineering projects. The Water segment undertakes infrastructure and non-infrastructure projects for national water sector companies. It provides design services, including architectural, mechanical, civil, structural, electrical, ICA, and chemical and process design; asset security services, such as scoping, design, installation, and commissioning of security systems; and civil engineering services. This segment also offers offsite factory-built and assembled solutions, such as booster sets, chemical dosing, fabrications, instrument boards, MCCs and control panels, and package plants; and technical, materials handling, and maintenance and operation services. This segment serves public sector water and wastewater utility companies, and the industrial sector. The company was formerly known as North Midland Construction PLC and changed its name to nmcn plc in November 2018. nmcn plc was founded in 1946 and is headquartered in Sutton-in-Ashfield, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Sutton-in-Ashfield"}, "RNWH.L": {"short_name": "RENEW HOLDINGS PLC ORD 10P", "long_name": "Renew Holdings plc", "summary": "Renew Holdings plc operates as a contractor in the field of engineering services and specialist building in the United Kingdom. The company provides services to the energy, environmental, rail, and infrastructure markets. It offers operational support and asset care; critical planned and reactive maintenance and renewals; civil, mechanical, and electrical engineering services; geotechnical and earthworks; plant, power, and signaling renewals; 24/7 emergency services; asset renewal and refurbishment; tunnel and shaft refurbishment, fencing, and devegetation; and in-house design services, as well as wireless telecoms installations; 3G, 4G, 5G, and Wi-Fi technologies; temporary sites and special events; and maintenance and decommissioning services. The company also provides nuclear decommissioning and decontamination; and specialist fabrication and manufacturing services. In addition, it offers flood risk management programs; clean and wastewater rehabilitation infrastructure; and port, harbor, and sea defenses, as well as maintains strategic water mains and mains drainage. Further, the company provides soil and groundwater remediation; soil washing, biophysical treatment, solidification and stabilization, enhanced segregation, and geotechnical improvements; in-house technology and environmental engineering resources; and specialist restoration, as well as designs remediation and ground engineering solutions. Additionally, it undertakes residential refurbishment, and research and laboratory schemes; temporary structural engineering works; sale of land, and the leasing and sub-leasing of properties; and refurbishment of private residential assets, as well as the construction, renovation, and refurbishment of science facilities. The company was formerly known as Montpellier Group Plc and changed its name to Renew Holdings plc in December 2005. Renew Holdings plc was founded in 1786 and is headquartered in Leeds, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Leeds"}, "SMJ.L": {"short_name": "SMART (J.) & CO. (CONTRACTORS) ", "long_name": "J. Smart & Co. (Contractors) PLC", "summary": "J. Smart & Co. (Contractors) PLC, together with its subsidiaries, engages in the contracting, developing, and constructing public works, shopping centers, offices, factories, warehouses, local authority, and landlords and private housing projects in the United Kingdom. It also contracts building and civil engineering projects; develops and sells residential properties; develops industrial and commercial properties for lease; provides serviced office spaces; carries out small to medium sized building and civil engineering works for various clients; and offers plumbing support services to the construction companies. J. Smart & Co. (Contractors) PLC was founded in 1947 and is headquartered in Edinburgh, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Edinburgh"}, "SUR.L": {"short_name": "SURESERVE GROUP PLC ORD 10P", "long_name": "Sureserve Group plc", "summary": "Sureserve Group plc provides compliance and energy support services in the United Kingdom. The company operates through Compliance and Energy Services segments. It offers gas compliance services, including emergency call out facilities, service programs to meet compliance requirements, installations and repairs to gas appliances and systems, void works, building and associated works, electrical installations and repair, legionella risk assessment, and carbon monoxide and smoke detector installation services to local authority, housing association, and charity customers. The company also provides fire compliance services, which cover the physical infrastructure and fire safety materials; electrical compliance services that focus on lighting and power installations; water and air hygiene services, including legionella control, water hygiene and treatment, ductwork cleaning, and kitchen grease extract cleaning services; and lift repair and installation services to local authority, housing association, and commercial and private sector clients. In addition, it offers cavity wall, loft, and external and internal wall insulation services to various properties; and installation and maintenance services for heating systems, including gas boilers, air source heat pumps, and ground source heat pumps to local authorities, home owners, and private landlords. Further, the company provides renewable energy solutions, including solar hot water systems, photovoltaic systems, and electrical vehicle charging posts; and industrial, commercial, and residential smart metering and gas and electric applications. The company was formerly known as Lakehouse plc and changed its name to Sureserve Group plc in October 2018. Sureserve Group plc was founded in 1988 and is headquartered in Basildon, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Basildon"}, "TGP.L": {"short_name": "TEKMAR GROUP PLC ORD 1P", "long_name": "Tekmar Group plc", "summary": "Tekmar Group plc, together with its subsidiaries, designs, develops, manufactures, installs, and sells subsea stability and protection solutions to offshore energy markets. The company offers subsea cable, and umbilical and flexible pipe protection systems; subsea engineering consulting services; and geotechnical design and consulting services, such as offshore structure foundation design, geohazard assessment, and subsea cable routing and burial assessment, as well as project management services. It also designs, manufactures, and supplies equipment handling systems, emergency pipeline repair clamps, and equipment for use in the construction of offshore energy projects. The company offers its products for subsea cable, rigid and flexible pipeline, umbilical, seabed, vessel back deck, and structural applications. It serves offshore wind, oil and gas, interconnector, wave and tidal, marine civil, and telecom sectors in the United Kingdom, the European Union, the Middle East, Africa, North America, South America, the Asia Pacific, and China. The company was founded in 1985 and is headquartered in Newton Aycliffe, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Newton Aycliffe"}, "VANL.L": {"short_name": "VAN ELLE HOLDINGS PLC ORD 2P", "long_name": "Van Elle Holdings plc", "summary": "Van Elle Holdings plc, together with its subsidiaries, provides ground engineering services in the United Kingdom. The company offers various piling services, including augered piling services, such as continuous flight auger, sectional flight auger, cased auger, rotary bored, and case secant piling services; driven piling services comprising pre-cast, steel tube, cast in situ, steel sheet, and H sections steel piling services; and drilled piling services. It also provides temporary and permanent retaining walls and basement solutions, including contiguous piled walls, secant piled walls, king post walls, ground anchors, and steel sheet pile walls; and ground improvement services. In addition, the company offers ground investigation and monitoring services, such as cable percussion, rotary open hole/coring, window sampling, plate bearings tests, static testing, gas monitoring, noise and vibration monitoring, laboratory testing, and factual and interpretative reporting services; and geotechnical engineering services in the areas of ground anchors, soil nails, rock bolts and netting, and grouting. Further, it provides range of techniques for the housing sector to support various stages of development, such as ground investigation and geo environmental consultancy, grouting, vibro stone and vibro concrete columns, contiguous flight auger piling, driven piling, and precast modular foundation system; and training and assessment services. Additionally, the company develops, manufactures, and installs precast concrete products for use in specialist foundation applications. It serves commercial/industrial building, highway, infrastructure, rail, and housing sectors. The company was founded in 1984 and is headquartered in Kirkby-in-ashfield, the United Kingdom.", "currency": "GBp", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Kirkby-in-Ashfield"}}