{
  "0P00008SOK.HK": {
    "category": "Aggressive Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Bank Consortium",
    "long_name": "BCT (MPF) Pro Choice-BCT (Pro) E70 Mixed Asset Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BCT (MPF) Pro Choice-BCT (Pro) ",
    "summary": "The objective of the E70 Mixed Asset Fund is to provide members with capital appreciation over the long term through diversified investments in global equities where higher rates of returns are usually available. In addition, the fund will also maintain a limited exposure to global fixed income securities.\nThe investments primarily include bank deposits, global bonds and global equities. The benchmark weightings of the investments of the fund are expected to be, but not restricted to, 30% in fixed income securities and 70% in equities. The fund holds a minimum of 30% of assets denominated in Hong Kong dollar through direct holdings of investments. The fund is thus globally diversified with a bias towards Hong Kong.",
    "total_assets": null
  },
  "0P00008SPV.HK": {
    "category": "Aggressive Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "HSBC Life (International) Limited",
    "long_name": "HSBC Mandatory Provident Fund-SuperTrust Plus Balanced Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "HSBC Mandatory Provident Fund-S",
    "summary": "The investment objective of the Balanced Fund is to achieve medium-high capital growth with medium volatility.",
    "total_assets": null
  },
  "0P00008SRM.HK": {
    "category": "Aggressive Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Bank of Communications Trustee Ltd",
    "long_name": "BCOM Joyful Retirement MPF Scheme-BCOM Balanced (CF) Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BCOM Joyful Retirement MPF Sche",
    "summary": "The investment objective of the Fund is to achieve a long term return in excess of generally accepted levels of Hong Kong salary inflation as indicated by the Hong Kong Monthly Digest of Statistics published by the Census and Statistics Department of the Hong Kong Special Administrative Region.",
    "total_assets": null
  },
  "0P00008SSP.HK": {
    "category": "Aggressive Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Bank Consortium",
    "long_name": "BCT (MPF) Industry Choice-BCT (Industry) E70 Mixed Asset Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BCT (MPF) Industry Choice-BCT (",
    "summary": "The objective of the E70 Mixed Asset Fund is to provide members with capital\nappreciation over the long term through diversified investments in global\nequities where higher rates of returns are usually available by investing solely\nin “Invesco Pooled Investment Fund — Global Balanced Fund” which is an\nAPIF, the investment policy of which is consistent with that of the E70 Mixed\nAsset Fund. The underlying APIF may in turn invest in other APIFs or in\nbank deposits, global bonds and global equities. In addition, the underlying\nAPIF will also maintain a limited exposure to global fixed income securities.",
    "total_assets": null
  },
  "0P00008STA.HK": {
    "category": "Aggressive Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Sun Life Hong Kong Limited",
    "long_name": "Sun Life Rainbow MPF Scheme-Sun Life MPF Growth Fund A",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "Sun Life Rainbow MPF Scheme-Sun",
    "summary": "The Sun Life Progressive Growth Fund is an equity fund which seeks to provide members with significant capital appreciation over the medium term to longer term, through investing into a range of sub-funds within an umbrella unit trust, the First State MPF Umbrella Fund, which in turn will invest primarily in equity investments.",
    "total_assets": null
  }
}
