{
  "0P00000DFR.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Jupiter Fund Managers Limited",
    "long_name": "Jupiter Merian Asia Pacific Fund L GBP Acc",
    "manager_bio": "Ian joined Merian in 2000 and is head of global equities. He manages a range of hedge and retail funds and segregated mandates, including market neutral and long only funds. Ian boasts more than 20 years of investment experience and the team has won numerous awards for its funds. Prior to joining the business, Ian was a UK quantitative fund manager at Barclays Global Investors. He holds an MA in chemistry from the University of Oxford and a PhD in medicinal chemistry, University of Edinburgh. He is an associate of the Society of Investment Professionals.",
    "manager_name": "Ian  Heslop",
    "market": "gb_market",
    "short_name": "Merian Asia Pacific Fund A GBP ",
    "summary": "To seek to achieve capital growth by delivering a return, net of fees, greater than that of the MSCI AC Asia Pacific ex-Japan Index with net dividends reinvested over rolling 3 year periods. The fund primarily invests (at least 70%) in a diversified portfolio of equities in developed and emerging markets in the Asia Pacific region, excluding Japan. Such equities are those of companies that are domiciled, incorporated or listed in the Asia Pacific region (excluding Japan), or that conduct a significant part of their business in those markets.",
    "total_assets": null
  },
  "0P00000FHI.F": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Generali Investments Partners S.p.A. SGR",
    "long_name": "Generali Pacifique P",
    "manager_bio": "",
    "manager_name": "Amparo  Sampedro",
    "market": "dr_market",
    "short_name": "Generali Pacifique P",
    "summary": "Dans le cadre d&#39;une gestion discrétionnaire, l&#39;objectif de gestion du FCP consiste en la maximisation du capital en privilégiant les investissements sur les marchés actions de la zone Asie-Pacifique hors Japon sur la durée de placement recommandée supérieure à 5 ans. La recherche de cet objectif s’effectuera à travers une politique active d&#39;allocation et de sélection d&#39;OPCVM, FIA et fonds d’investissement afin d’obtenir une performance nette de frais de gestion, à moyen terme, supérieure à celle mesurée par l&#39;indice de référence MSCI AC ASIA-PACIFIC ex JAPAN (dividendes nets réinvestis – en dollar converti en euro).",
    "total_assets": 121254901.77560806
  },
  "0P00007Z9I.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "State Street Unit Trust Mgmt Ltd",
    "long_name": "State Street AUT Asia Pacific Ex-Japan Screened (ex Controversies and CW) Index Equity",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "State Street Asia Pacific Ex-Ja",
    "summary": "The Fund aims to replicate, as closely as possible and on a “gross of fees” basis, the return of the Asia Pacific ex‐Japan equity market as represented by the FTSE Developed Asia Pacific ex Japan ex Controversies ex CW Index, net of withholding taxes (or its recognised replacement or equivalent);",
    "total_assets": null
  },
  "0P00009113.SI": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "SGD",
    "exchange": "SES",
    "family": "Aviva Ltd (Singapore)",
    "long_name": "Aviva NikkoAM Shenton Asia Pacific - RP",
    "manager_bio": "",
    "manager_name": "",
    "market": "sg_market",
    "short_name": "Aviva NikkoAM Shenton Asia Paci",
    "summary": "To seek preservation of capital and liquidity and consistent with these objectives, to outperform the Singapore Interbank Offered Rate (SIBOR) by investing in a diversified portfolio of good quality, short-term bonds and money market instruments. There is no target industry or sector and the fund is not country-specific.",
    "total_assets": 7578733.172234297
  },
  "0P00009115.SI": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "SGD",
    "exchange": "SES",
    "family": "Aviva Ltd (Singapore)",
    "long_name": "Aviva NikkoAM Shenton Asia Pacific - SP",
    "manager_bio": "",
    "manager_name": "",
    "market": "sg_market",
    "short_name": "Aviva NikkoAM Shenton Asia Paci",
    "summary": "To seek preservation of capital and liquidity and consistent with these objectives, to outperform the Singapore Interbank Offered Rate (SIBOR) by investing in a diversified portfolio of good quality, short-term bonds and money market instruments. There is no target industry or sector and the fund is not country-specific.",
    "total_assets": 7578733.172234297
  },
  "0P0000GF41.F": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Generali Investments Partners S.p.A. SGR",
    "long_name": "Generali Pacifique I",
    "manager_bio": "",
    "manager_name": "Amparo  Sampedro",
    "market": "dr_market",
    "short_name": "Generali Pacifique I",
    "summary": "Dans le cadre d&#39;une gestion discrétionnaire, l&#39;objectif de gestion du FCP consiste en la maximisation du capital en privilégiant les investissements sur les marchés actions de la zone Asie-Pacifique hors Japon sur la durée de placement recommandée supérieure à 5 ans. La recherche de cet objectif s’effectuera à travers une politique active d&#39;allocation et de sélection d&#39;OPCVM, FIA et fonds d’investissement afin d’obtenir une performance nette de frais de gestion, à moyen terme, supérieure à celle mesurée par l&#39;indice de référence MSCI AC ASIA-PACIFIC ex JAPAN (dividendes nets réinvestis – en dollar converti en euro).",
    "total_assets": 121254901.77560806
  },
  "0P0000HKIT.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Invesco Fund Managers Limited",
    "long_name": "Invesco Asian Fund (UK) (No Trail) (Inc)",
    "manager_bio": "William is a portfolio manager at Invesco Perpetual based at Henley-on-Thames, U.K. He has been with the company since May, 2006. He joined Deloitte as a chartered accountant in 1998, but always had a view to entering the fund management industry. He moved over to money management in 2001, when he joined Orbis Investment Advisory as an investment analyst. He joined Invesco in May 2006 as a portfolio manager. William has an MA in Psychology and Philosophy from Oxford University and an MSc. in Music Technology from York University. He holds the CFA designation and is also a chartered accountant.",
    "manager_name": "William  Lam",
    "market": "gb_market",
    "short_name": "Invesco Asian Fund (UK) (No Tra",
    "summary": "The Fund aims to achieve long-term (5 years plus) capital growth. The Fund invests at least 80% of its assets in shares or other equity related securities of companies incorporated, domiciled or carrying out the main part of their economic activity in Asia and Australasia, excluding Japan.",
    "total_assets": null
  },
  "0P0000MLG7.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith&Williamson Fund Administration Ltd",
    "long_name": "SVS BambuBlack Asia ex-Japan All-Cap A Acc",
    "manager_bio": "Jane joined Smith & Williamson in 1996 and has managed the Smith & Williamson Far Eastern Growth Trust for over 15 years. She also manages the Smith & Williamson Oriental Growth Fund. Jane’s career began with Midland Bank working on Asian investments for an international pension fund. In 1987 she moved to John Govett to manage the Pacific Income Fund, winning a performance award in 1988. A tenure at CIM fund managers, where she ran dedicated Japanese & Asian pension funds, preceded her career at Smith & Williamson. Jane is also involved in the monthly strategy meetings advising on Far Eastern Markets.",
    "manager_name": "Jane  Andrews",
    "market": "gb_market",
    "short_name": "SVS BambuBlack Asia ex-Japan Al",
    "summary": "Investment Objective\n\nThe Fund aims to achieve long-term capital growth through investment in the markets of the Asia and Pacific region, excluding Japan but including Australasia.\n\nInvestment Policy\n\nThe Fund will invest in companies quoted on the stock exchanges of the Asia and Pacific Basin region, excluding Japan but including Australasia, that the Investment Manager believes will become market leaders of the future. From time to time, depending on market conditions, the Fund may invest in other transferable securities, money market instruments, deposits, collective investment schemes and warrants.\n\nDerivative and forward transactions may be used by the Fund solely for the purposes of Hedging.",
    "total_assets": null
  },
  "0P0000N4GV.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "AEGON Ireland",
    "long_name": "UWS Stewart Investors Asia Pacific Leaders (Series B)",
    "manager_bio": "Angus Tulloch is Joint Managing Partner of the Asia Pacific/ Global Emerging Markets equity team at First State Investments. Angus’ primary focus is stock selection and portfolio construction. Graduating from Cambridge University in 1970 with a BA (Honours) in Economics and History, Angus worked with Chartered Accountants Whinney Murray (now Ernst & Young) for four years. He then gained substantial industry experience in corporate planning and finance roles with various national companies before joining London stockbrokers Cazenove & Co in 1980. Specialising mainly in Far Eastern markets, Angus spent three of the next eight years with this firm based in Hong Kong as a regional analyst before assuming a fund management role in its London office. In 1988 he returned to Scotland, joining Stewart Ivory (subsequently bought by First State Investments) to establish an Asia Pacific and Emerging Markets capability. Since then, Angus and his team have won many industry awards.",
    "manager_name": "Angus  Tulloch",
    "market": "gb_market",
    "short_name": "Aegon International Stewart Inv",
    "summary": "The Fund aims to achieve long-term capital growth.\nThe Fund invests in large and mid capitalisation equities in the Asia Pacific region (excluding Japan, including Australasia).",
    "total_assets": null
  },
  "0P0000TOJ9.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith&Williamson Fund Administration Ltd",
    "long_name": "SVS BambuBlack Asia ex-Japan All-Cap B Class Accum Shares",
    "manager_bio": "Jane joined Smith & Williamson in 1996 and has managed the Smith & Williamson Far Eastern Growth Trust for over 15 years. She also manages the Smith & Williamson Oriental Growth Fund. Jane’s career began with Midland Bank working on Asian investments for an international pension fund. In 1987 she moved to John Govett to manage the Pacific Income Fund, winning a performance award in 1988. A tenure at CIM fund managers, where she ran dedicated Japanese & Asian pension funds, preceded her career at Smith & Williamson. Jane is also involved in the monthly strategy meetings advising on Far Eastern Markets.",
    "manager_name": "Jane  Andrews",
    "market": "gb_market",
    "short_name": "SVS BambuBlack Asia ex-Japan Al",
    "summary": "Investment Objective\n\nThe Fund aims to achieve long-term capital growth through investment in the markets of the Asia and Pacific region, excluding Japan but including Australasia.\n\nInvestment Policy\n\nThe Fund will invest in companies quoted on the stock exchanges of the Asia and Pacific Basin region, excluding Japan but including Australasia, that the Investment Manager believes will become market leaders of the future. From time to time, depending on market conditions, the Fund may invest in other transferable securities, money market instruments, deposits, collective investment schemes and warrants.\n\nDerivative and forward transactions may be used by the Fund solely for the purposes of Hedging.",
    "total_assets": null
  },
  "0P0000X2FX.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "BNY Mellon Fund Managers Limited",
    "long_name": "BNY Mellon Investment Funds - Newton Oriental Fund Institutional W Accumulation",
    "manager_bio": "Caroline Keen joined BNY Mellon in December 2009 after two years as an\nanalyst in BlackRock's global consultant relations group. She is a fund manager focusing on Asia Pacific ex-Japan equities. Caroline holds a degree in politics, philosophy and economics from Oxford University.",
    "manager_name": "Caroline  Keen",
    "market": "gb_market",
    "short_name": "BNY Mellon Investment Funds - N",
    "summary": "The Sub-Fund aims to achieve capital growth over the long term (5 years or more). The Sub-Fund is actively managed and invests at least 75% of the portfolio in equities (company shares) of issuers domiciled, incorporated or with significant business in Asian and Pacific markets (including Australia and New Zealand but excluding Japan), including ordinary shares, preference shares and other equity-related securities.",
    "total_assets": null
  },
  "0P0000XUS8.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "First Sentier Investors (Hong Kong) Limited",
    "long_name": "FSSA Asian Equity Plus Fund Class III (Distributing) GBP",
    "manager_bio": "Martin Lau is a Managing Partner of First State Stewart Asia, part of First State Investments. Martin has more than 22 years of experience in managing Asia Pacific and Greater China portfolios. He joined the First State Stewart Asia team in April 2002 and is based in Hong Kong. Martin is the lead manager of a number of First State funds: the First State Asian Equity Plus Fund, the First State Asian Bridge Fund, the First State Asia Pacific All Cap Fund, the First State New Era PRC Fund, the First State China Growth Fund, the First State Greater China Growth Fund and the First State Hong Kong Growth Fund. Martin graduated from Cambridge University with a Bachelor of Arts degree and a Masters degree in Engineering. He is also a CFA charterholder.",
    "manager_name": "Martin  Lau",
    "market": "gb_market",
    "short_name": "FSSA Asian Equity Plus Fund Cla",
    "summary": "The Fund invests primarily in securities in the Asia Pacific region (excluding Japan). Such companies will be selected on the basis of their high dividend yields and their potential for long term capital appreciation.\n The Investment Manager will select investments which it believes offer the potential for sustainable above average dividend yields in addition to price appreciation.",
    "total_assets": null
  },
  "0P00010F12.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Prusik Investment Management LLP",
    "long_name": "Prusik Asia Fund PLC U GBP Accumulation",
    "manager_bio": "Heather is founding partner and CIO/CEO of Prusik and has been running money in Asia for over 30 years. Prior to starting Prusik she was at Henderson Investors for 18 years. There she was appointed Head of Asia and Global Emerging Markets in 1996, managing a team of 16 fund managers and analysts, and which under her charge tripled its assets under management to USD5bn. Her flagship product was the S&P 3 Star rated Pacific Capital Growth Fund (long only) which she ran from 1990 and during this time she developed a thematic approach to finding undervalued opportunities in Asia.",
    "manager_name": "Heather  Manners",
    "market": "gb_market",
    "short_name": "Prusik Asia Fund PLC U GBP Accu",
    "summary": "The investment objective of Prusik Asia Fund plc is to engineer capital growth primarily by investing in companies operating in the Asian region.\nIn pursuit of its investment objective the Company will be invested in companies operating in Asia including, Australia, New Zealand, Hong Kong, Taiwan, South Korea, China, India, Sri Lanka, Pakistan, Thailand, Indonesia, Malaysia, Singapore and the Philippines and will generally seek to invest, on average, in companies which have a price to book value ratio and a price/earnings ratio below the level then prevailing in the market of that sector.",
    "total_assets": null
  },
  "0P00015CFZ.HK": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "HSBC Investment Funds (HK) Limited",
    "long_name": "HSBC Collective Inv Trust - HSBC Asia Pacific ex Japan Equity Volatility Focused Fund AM2- HKD",
    "manager_bio": "Sanjiv se unió al equipo de mercados emergentes a nivel global de HSBC Asset Management's en 1996. Previamente trabajó en Hill Samuel donde estuvo 5 años, inicialmente en auditoría interna y mas tarde como gestor de fondos de mercados emergentes.",
    "manager_name": "Sanjiv  Duggal",
    "market": "hk_market",
    "short_name": "HSBC Collective Inv Trust - HSB",
    "summary": "The Sub-Fund aims to provide long term total return by investing in a portfolio of equities. The Sub-Fund invests (normally a minimum 90% of its net assets) in equities and equity equivalent securities of companies which have their registered office in, and with an official listing on a major stock exchange or other regulated market of any Asia Pacific country (excluding Japan) as well as companies which carry out a preponderant part of their economic activities in the Asia Pacific region (excluding Japan).",
    "total_assets": null
  },
  "0P00015W80.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "First Sentier Investors (UK) Funds Ltd",
    "long_name": "FSSA Asia All-Cap Fund Class B (Accumulation) GBP",
    "manager_bio": "刘国杰于2003年10月出任为大中华投资总监。他于2002年4月加入首域投资，担任高级基金经理，专责管理首域投资旗下的大中华及区域基金。\n\n刘先生于1995年加入投资界，曾于景顺投资任职基金经理达六年。\n\n刘先生毕业于英国剑桥大学，持有文学士学位及工程学硕士学位，并为特许财务分析师。",
    "manager_name": "Martin  Lau",
    "market": "gb_market",
    "short_name": "FSSA Asia All-Cap Fund Class B ",
    "summary": "The Fund aims to achieve capital growth over the medium to long-term (at least three years). The Fund invests at least 80% of its Net Asset Value in equity or equityrelated securities of companies established or having a majority of their economic activities in the Asia Pacific region (excluding Japan) that are listed, traded or dealt in on Regulated Markets worldwide, and in equity- related securities listed, traded or dealt in on Regulated Markets worldwide which provide exposure to the Asia Pacific region (excluding Japan).",
    "total_assets": null
  },
  "0P0001ENTU.L": {
    "category": "Asia-Pacific ex-Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Omnis Investments Limited",
    "long_name": "Omnis Asia Pacific (ex-Japan) Equity Fund Class A GBP Inc",
    "manager_bio": "Partner, Fund Manager and Head of Asia of Veritas Asset Management LLP. Joined the company in 2004. Director of Investment Management and Investment Leader Asia Newton Investment Management 1995 to 2004. Education: BA, (Nankai University, China), MA, (Nankai University, China), Research Student Cambridge University.",
    "manager_name": "Ezra  Sun",
    "market": "gb_market",
    "short_name": "Omnis Asia Pacific (ex-Japan) E",
    "summary": "The Fund aims to achieve a return consisting of both income and capital growth which, after all fees and expenses, exceeds that of the FTSE World Asia Pacific ex Japan TR index over the medium to long term (defined as 5 to 10 years).",
    "total_assets": null
  }
}
