{"0P00000DFR.L": {"short_name": "Merian Asia Pacific Fund A GBP ", "long_name": "Merian Asia Pacific Fund A GBP Acc", "currency": "GBp", "summary": "To seek to achieve capital growth by delivering a return, net of fees, greater than that of the MSCI AC Asia Pacific ex-Japan Index with net dividends reinvested over rolling 3 year periods. The fund primarily invests (at least 70%) in a diversified portfolio of equities in developed and emerging markets in the Asia Pacific region, excluding Japan. Such equities are those of companies that are domiciled, incorporated or listed in the Asia Pacific region (excluding Japan), or that conduct a significant part of their business in those markets.", "manager_name": "Ian  Heslop", "manager_bio": "Ian joined Merian in 2000 and is head of global equities. He manages a range of hedge and retail funds and segregated mandates, including market neutral and long only funds. Ian boasts more than 20 years of investment experience and the team has won numerous awards for its funds. Prior to joining the business, Ian was a UK quantitative fund manager at Barclays Global Investors. He holds an MA in chemistry from the University of Oxford and a PhD in medicinal chemistry, University of Edinburgh. He is an associate of the Society of Investment Professionals.", "category": "Asia-Pacific ex-Japan Equity", "family": "Merian Investment Management Limited", "exchange": "LSE", "market": "gb_market"}, "0P00000SH5.F": {"short_name": "AXA Rosenberg Equity Alpha Trus", "long_name": "AXA Rosenberg Equity Alpha Trust - AXA Rosenberg All Country AP Ex-Jpn SmCp Alp Fd B EUR Acc", "currency": "EUR", "summary": "The aim of the Sub-Fund is to provide long-term capital growth above that of the MSCI AC Asia Pacific ex-Japan Small Cap Index on a rolling three year basis.", "manager_name": "Not  Disclosed", "manager_bio": "", "category": "Asia-Pacific ex-Japan Equity", "family": "AXA Rosenberg Management Ireland Ltd", "exchange": "FRA", "market": "dr_market"}, "0P000014W0.F": {"short_name": "AXA Rosenberg Equity Alpha Trus", "long_name": "AXA Rosenberg Equity Alpha Trust - AXA Rosenberg All Country AP Ex-Jpn SmCp Alp Fd E EUR Acc", "currency": "EUR", "summary": "The aim of the Sub-Fund is to provide long-term capital growth above that of the MSCI AC Asia Pacific ex-Japan Small Cap Index on a rolling three year basis.", "manager_name": "Not  Disclosed", "manager_bio": "", "category": "Asia-Pacific ex-Japan Equity", "family": "AXA Rosenberg Management Ireland Ltd", "exchange": "FRA", "market": "dr_market"}, "0P0000268C.L": {"short_name": "Santander Pacific Basin (Exclud", "long_name": "Santander Pacific Basin (Excluding Japan) Equities B", "currency": "GBp", "summary": "The Fund aims to achieve long-term growth through capital appreciation and income. The Fund aims to achieve its objective through investment predominantly in Pacific Basin (excluding Japan) equities The Fund will be made up of directly held securities and / or funds managed either by third party managers or the ACD / another entity within the Santander Group (â\u0080\u009cUnderlying Fundsâ\u0080\u009d).", "manager_name": "Keith  Speck", "manager_bio": "", "category": "Asia-Pacific ex-Japan Equity", "family": "Santander Asset Management UK Limited", "exchange": "LSE", "market": "gb_market"}, "0P0000HKIT.L": {"short_name": "Invesco Asian Fund (UK) (No Tra", "long_name": "Invesco Asian Fund (UK) (No Trail) (Inc)", "currency": "GBp", "summary": "The Fund aims to achieve long-term (5 years plus) capital growth. The Fund invests at least 80% of its assets in shares or other equity related securities of companies incorporated, domiciled or carrying out the main part of their economic activity in Asia and Australasia, excluding Japan.", "manager_name": "William  Lam", "manager_bio": "William is a portfolio manager at Invesco Perpetual based at Henley-on-Thames, U.K. He has been with the company since May, 2006. He joined Deloitte as a chartered accountant in 1998, but always had a view to entering the fund management industry. He moved over to money management in 2001, when he joined Orbis Investment Advisory as an investment analyst. He joined Invesco in May 2006 as a portfolio manager. William has an MA in Psychology and Philosophy from Oxford University and an MSc. in Music Technology from York University. He holds the CFA designation and is also a chartered accountant.", "category": "Asia-Pacific ex-Japan Equity", "family": "Invesco Fund Managers Limited", "exchange": "LSE", "market": "gb_market"}, "0P0000TOJ9.L": {"short_name": "SVS BambuBlack Asia ex-Japan Al", "long_name": "SVS BambuBlack Asia ex-Japan All-Cap B Class Accum Shares", "currency": "GBp", "summary": "Investment Objective\n\nThe Fund aims to achieve long-term capital growth through investment in the markets of the Asia and Pacific region, excluding Japan but including Australasia.\n\nInvestment Policy\n\nThe Fund will invest in companies quoted on the stock exchanges of the Asia and Pacific Basin region, excluding Japan but including Australasia, that the Investment Manager believes will become market leaders of the future. From time to time, depending on market conditions, the Fund may invest in other transferable securities, money market instruments, deposits, collective investment schemes and warrants.\n\nDerivative and forward transactions may be used by the Fund solely for the purposes of Hedging.", "manager_name": "Jane  Andrews", "manager_bio": "Jane joined Smith & Williamson in 1996 and has managed the Smith & Williamson Far Eastern Growth Trust for over 15 years. She also manages the Smith & Williamson Oriental Growth Fund. Janeâ\u0080\u0099s career began with Midland Bank working on Asian investments for an international pension fund. In 1987 she moved to John Govett to manage the Pacific Income Fund, winning a performance award in 1988. A tenure at CIM fund managers, where she ran dedicated Japanese & Asian pension funds, preceded her career at Smith & Williamson. Jane is also involved in the monthly strategy meetings advising on Far Eastern Markets.", "category": "Asia-Pacific ex-Japan Equity", "family": "Smith&Williamson Fund Administration Ltd", "exchange": "LSE", "market": "gb_market"}, "0P0000XUS8.L": {"short_name": "FSSA Asian Equity Plus Fund Cla", "long_name": "FSSA Asian Equity Plus Fund Class III (Distributing) GBP", "currency": "GBp", "summary": "The Fund invests primarily in securities in the Asia Pacific region (excluding Japan). Such companies will be selected on the basis of their high dividend yields and their potential for long term capital appreciation.\n The Investment Manager will select investments which it believes offer the potential for sustainable above average dividend yields in addition to price appreciation.", "manager_name": "Martin  Lau", "manager_bio": "Martin Lau is a Managing Partner of First State Stewart Asia, part of First State Investments. Martin has more than 22 years of experience in managing Asia Pacific and Greater China portfolios. He joined the First State Stewart Asia team in April 2002 and is based in Hong Kong. Martin is the lead manager of a number of First State funds: the First State Asian Equity Plus Fund, the First State Asian Bridge Fund, the First State Asia Pacific All Cap Fund, the First State New Era PRC Fund, the First State China Growth Fund, the First State Greater China Growth Fund and the First State Hong Kong Growth Fund. Martin graduated from Cambridge University with a Bachelor of Arts degree and a Masters degree in Engineering. He is also a CFA charterholder.", "category": "Asia-Pacific ex-Japan Equity", "family": "First Sentier Investors (Hong Kong) Limited", "exchange": "LSE", "market": "gb_market"}, "0P00010F12.L": {"short_name": "Prusik Asia Fund PLC U GBP Accu", "long_name": "Prusik Asia Fund PLC U GBP Accumulation", "currency": "GBp", "summary": "The investment objective of Prusik Asia Fund plc is to engineer capital growth primarily by investing in companies operating in the Asian region.\nIn pursuit of its investment objective the Company will be invested in companies operating in Asia including, Australia, New Zealand, Hong Kong, Taiwan, South Korea, China, India, Sri Lanka, Pakistan, Thailand, Indonesia, Malaysia, Singapore and the Philippines and will generally seek to invest, on average, in companies which have a price to book value ratio and a price/earnings ratio below the level then prevailing in the market of that sector.", "manager_name": "Heather  Manners", "manager_bio": "Heather is founding partner and CIO/CEO of Prusik and has been running money in Asia for over 30 years. Prior to starting Prusik she was at Henderson Investors for 18 years. There she was appointed Head of Asia and Global Emerging Markets in 1996, managing a team of 16 fund managers and analysts, and which under her charge tripled its assets under management to USD5bn. Her flagship product was the S&P 3 Star rated Pacific Capital Growth Fund (long only) which she ran from 1990 and during this time she developed a thematic approach to finding undervalued opportunities in Asia.", "category": "Asia-Pacific ex-Japan Equity", "family": "Prusik Investment Management LLP", "exchange": "LSE", "market": "gb_market"}, "0P00011ECJ.F": {"short_name": "AXA Rosenberg Equity Alpha Trus", "long_name": "AXA Rosenberg Equity Alpha Trust - AXA Rosenberg All Country AP Ex-Jpn SmCp Alp Fd A EUR Acc", "currency": "EUR", "summary": "The aim of the Sub-Fund is to provide long-term capital growth above that of the MSCI AC Asia Pacific ex-Japan Small Cap Index on a rolling three year basis.", "manager_name": "Not  Disclosed", "manager_bio": "", "category": "Asia-Pacific ex-Japan Equity", "family": "AXA Rosenberg Management Ireland Ltd", "exchange": "FRA", "market": "dr_market"}, "0P00015W80.L": {"short_name": "FSSA Asia All-Cap Fund Class B ", "long_name": "FSSA Asia All-Cap Fund Class B (Accumulation) GBP", "currency": "GBp", "summary": "The Fund aims to achieve long-term capital growth. At least 80% of the net assets of the Fund will be invested in equities issued by companies that are established, operating or have their economic activity mainly in the Asia Pacific region (excluding Japan, including Australasia) and which are listed, traded or dealt in on Regulated Markets worldwide and in equity related instruments listed, traded or dealt in on Regulated Markets worldwide which provide exposure to the Asia Pacific region.", "manager_name": "Martin  Lau", "manager_bio": "å\u0088\u0098å\u009b½æ\u009d°äº\u008e2003å¹´10æ\u009c\u0088å\u0087ºä»»ä¸ºå¤§ä¸­å\u008d\u008eæ\u008a\u0095èµ\u0084æ\u0080»ç\u009b\u0091ã\u0080\u0082ä»\u0096äº\u008e2002å¹´4æ\u009c\u0088å\u008a å\u0085¥é¦\u0096å\u009f\u009fæ\u008a\u0095èµ\u0084ï¼\u008cæ\u008b\u0085ä»»é«\u0098çº§å\u009fºé\u0087\u0091ç»\u008fç\u0090\u0086ï¼\u008cä¸\u0093è´£ç®¡ç\u0090\u0086é¦\u0096å\u009f\u009fæ\u008a\u0095èµ\u0084æ\u0097\u0097ä¸\u008bç\u009a\u0084å¤§ä¸­å\u008d\u008eå\u008f\u008aå\u008cºå\u009f\u009få\u009fºé\u0087\u0091ã\u0080\u0082\n\nå\u0088\u0098å\u0085\u0088ç\u0094\u009fäº\u008e1995å¹´å\u008a å\u0085¥æ\u008a\u0095èµ\u0084ç\u0095\u008cï¼\u008cæ\u009b¾äº\u008eæ\u0099¯é¡ºæ\u008a\u0095èµ\u0084ä»»è\u0081\u008cå\u009fºé\u0087\u0091ç»\u008fç\u0090\u0086è¾¾å\u0085­å¹´ã\u0080\u0082\n\nå\u0088\u0098å\u0085\u0088ç\u0094\u009fæ¯\u0095ä¸\u009aäº\u008eè\u008b±å\u009b½å\u0089\u0091æ¡¥å¤§å­¦ï¼\u008cæ\u008c\u0081æ\u009c\u0089æ\u0096\u0087å­¦å£«å­¦ä½\u008då\u008f\u008aå·¥ç¨\u008bå­¦ç¡\u0095å£«å­¦ä½\u008dï¼\u008cå¹¶ä¸ºç\u0089¹è®¸è´¢å\u008a¡å\u0088\u0086æ\u009e\u0090å¸\u0088ã\u0080\u0082", "category": "Asia-Pacific ex-Japan Equity", "family": "First Sentier Investors (UK) Funds Ltd", "exchange": "LSE", "market": "gb_market"}, "0P0001ENTU.L": {"short_name": "Omnis Asia Pacific (ex-Japan) E", "long_name": "Omnis Asia Pacific (ex-Japan) Equity Fund Class A GBP Inc", "currency": "GBp", "summary": "The Fund aims to achieve a return consisting of both income and capital growth which, after all fees and expenses, exceeds that of the FTSE World Asia Pacific ex Japan TR index over the medium to long term (defined as 5 to 10 years).", "manager_name": "Ezra  Sun", "manager_bio": "Partner, Fund Manager and Head of Asia of Veritas Asset Management LLP. Joined the company in 2004. Director of Investment Management and Investment Leader Asia Newton Investment Management 1995 to 2004. Education: BA, (Nankai University, China), MA, (Nankai University, China), Research Student Cambridge University.", "category": "Asia-Pacific ex-Japan Equity", "family": "Omnis Investments Limited", "exchange": "LSE", "market": "gb_market"}}