{
  "0P00000OEJ.F": {
    "category": "Asia ex Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Comgest SA",
    "long_name": "CG Nouvelle Asie C",
    "manager_bio": "",
    "manager_name": "Vincent  Strauss",
    "market": "dr_market",
    "short_name": "CG Nouvelle Asie C",
    "summary": "L’objectif de la gestion du FCP est de rechercher une performance sans référence à un indice, sur la durée de placement recommandée au travers de la sélection de titres (stock picking). Le FCP est en permanence investi ou exposé à hauteur de 60% minimum en actions émises par des sociétés ayant leur siège social ou exerçant la majeure partie de leurs activités en Asie hors Japon.",
    "total_assets": 513078258.92836
  },
  "0P00000RP5.F": {
    "category": "Asia ex Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Baring International Fund Mgrs (Ireland) Limited",
    "long_name": "Barings International Umbrella Fund - Barings Asia Growth Fund ClassA EUR Inc",
    "manager_bio": "",
    "manager_name": "Hyung  Lee",
    "market": "dr_market",
    "short_name": "Barings International Umbrella ",
    "summary": "The investment objective of the Fund is to achieve long-term capital growth in the value of assets by investing in Asia and the Pacific region excluding Japan. The Fund will seek to achieve its investment objective by investing at least 70% of its total assets in equities and equityrelated securities of companies incorporated in, or exercising the predominant part of their economic activity in the Asia Pacific region excluding Japan, or quoted or traded on the stock exchanges in those countries, including developed and emerging markets",
    "total_assets": null
  },
  "0P00000YVL.L": {
    "category": "Asia ex Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Baring International Fund Mgrs (Ireland) Limited",
    "long_name": "Barings International Umbrella Fund - Barings Asia Growth Fund ClassA GBP Inc",
    "manager_bio": "",
    "manager_name": "Hyung  Lee",
    "market": "gb_market",
    "short_name": "Barings International Umbrella ",
    "summary": "The investment objective of the Fund is to achieve long-term capital growth in the value of assets by investing in Asia and the Pacific region excluding Japan. The Fund will seek to achieve its investment objective by investing at least 70% of its total assets in equities and equityrelated securities of companies incorporated in, or exercising the predominant part of their economic activity in the Asia Pacific region excluding Japan, or quoted or traded on the stock exchanges in those countries, including developed and emerging markets",
    "total_assets": null
  },
  "0P00002AXW.F": {
    "category": "Asia ex Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Mansartis Gestion",
    "long_name": "Mansartis Asie ISR C",
    "manager_bio": "Il a commencé sa carrière à la Direction Financière du Crédit Commercial de France avant d'être responsable de la gestion sur les marchés asiatiques à la Banque Indosuez puis Directeur de la Batif. Après avoir été Directeur de Multifinance Internationale, il a rejoint COMGEST en avril 1994, où il est spécialiste des marchés asiatiques.",
    "manager_name": "Chantana  Ward",
    "market": "dr_market",
    "short_name": "Mansartis Asie ISR C",
    "summary": "The investment seeks to maximise the performance of listed Asian equities (Japan non-included). The fund invests at least 60% of assets in south-east Asian equities. It may invest up to 40% of assets in private and public bonds with a minimum rating of BBB(S&P) and a duration smaller than 10 years ; but also negotiable debt securities and money market instruments with a minimum rating of A3 (S&P) and a duration smaller than 3 months.",
    "total_assets": 43884769.54817772
  },
  "0P00005WB1.F": {
    "category": "Asia ex Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Unofi-Gestion d&#39;Actifs",
    "long_name": "Unofi-Pacifique C",
    "manager_bio": "",
    "manager_name": "Benoît  Pénet",
    "market": "dr_market",
    "short_name": "Unofi-Pacifique C",
    "summary": "Le fonds est géré de manière discrétionnaire avec une politique active d&#39;allocation d&#39;actifs (actions et obligations) investis en valeurs internationales. L&#39;objectif de gestion est d&#39;obtenir un profil de risque proche de l&#39;indice MSCI Asie-Pacifique, hors Japon.",
    "total_assets": 41128351.94182396
  },
  "0P0000JA9T.L": {
    "category": "Asia ex Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Hamon Ireland Limited",
    "long_name": "Hamon Asian Market Leaders Fund GBP",
    "manager_bio": "Team Managed",
    "manager_name": "Management  Team",
    "market": "gb_market",
    "short_name": "Hamon Asian Market Leaders Fund",
    "summary": "The investment objective of the Sub-Fund is long-term capital appreciation which it seeks to achieve by investing at least two thirds of its total assets in listed equity securities of companies domiciled in, or exercising the predominant part of their economic activities in, Asia. The generation of dividend and interest income is not the prime consideration of the Investment Advisor.",
    "total_assets": null
  },
  "0P0000NGTP.TW": {
    "category": "Asia ex Japan Equity",
    "currency": "TWD",
    "exchange": "TAI",
    "family": "First Financial Holding Co Ltd",
    "long_name": "FSITC Asian Emerging Market Fund",
    "manager_bio": "國立中央大學產業經濟研究所碩士，\n大眾投信投資處副總經理，\n臺灣工銀證券自營部專業副總經理，\n英國保誠投信外銷基金經理人，\n京華投信菁華基金及高科技基金經理人",
    "manager_name": "Guo Cing  Chen",
    "market": "tw_market",
    "short_name": "FSITC Asian Emerging Market Fu",
    "summary": "N/A",
    "total_assets": 13101867.837341309
  },
  "0P00012NBR.F": {
    "category": "Asia ex Japan Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Universal-Investment GmbH",
    "long_name": "Prisma Asianavigator UI I",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "Prisma Asianavigator UI I",
    "summary": "n/a",
    "total_assets": 7156077.675980091
  },
  "0P00014K96.L": {
    "category": "Asia ex Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Halo Global Asian Consumer C &#194;&#163; Net Inc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "VT Halo Global Asian Consumer C",
    "summary": "The investment objective of the VT Halo Global Asian Consumer Fund is to achieve annualised total return before fees of 8-12% over an economic cycle (5-7 years typically). Capital is in fact at risk and there is no guarantee that a positive retun will be achieved over that or any period.",
    "total_assets": null
  },
  "0P00017J65.L": {
    "category": "Asia ex Japan Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Franklin Templeton International Services S.à r.l.",
    "long_name": "Legg Mason Martin Currie Asia Long-Term Unconstrained Fund Class M GBP Distributing (A)",
    "manager_bio": "Il a rejoint Morgan Grenfell en 1993 en tant qu’analyste basé à Londres et pour contribuer à la gestion de portefeuilles Europe, Australasie et Extrême-Orient (EAEO). En 1995, Paul est entré chez Morgan Grenfell Tokyo, où il a géré des fonds au sein de l'équipe des small cap japonaises. Après un bref séjour à Londres, Paul est retourné à Tokyo en 2000 pour gérer une série de fonds small et mid cap.",
    "manager_name": "Andrew  Graham",
    "market": "gb_market",
    "short_name": "Legg Mason Martin Currie Asia L",
    "summary": "The Fund’s investment objective is to capture Asian gross domestic product (“GDP”) growth (meaning to generate returns that are consistent with Asian GDP growth) and to provide an attractive risk/return profile in an historically volatile market using a long only equity strategy. The Fund is unconstrained in the sense that the Fund does not have a benchmark or reference index that constrains its investment approach.",
    "total_assets": null
  },
  "0P00017XPC.HK": {
    "category": "Asia ex Japan Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Value Partners Hong Kong Limited",
    "long_name": "Value Partners High-Dividend Stocks A2 HKD Mdis",
    "manager_bio": "Mr. Norman Ho, a Senior Investment Director of Value Partners Hong Kong Limited , serves as Portfolio Manager. At VPHK, he is a key leader in the firm’s investment process with a high degree of responsibility for portfolio management. Mr. Ho joined VPHK in November 1995. He was promoted to the roles of Investment Director and Senior Investment Director in 2010 and January 2014, respectively. Prior to joining VPHK, he was an executive at Dao Heng Securities Limited. Mr. Ho started his career at Ernst & Young. Mr. Ho graduated with a Bachelor’s degree in Social Sciences (majoring in Management Studies) from the University of Hong Kong. He is a CFA charter holder.",
    "manager_name": "Norman Man Kei Ho",
    "market": "hk_market",
    "short_name": "Value Partners High-Dividend St",
    "summary": "The fund aims to provide capital appreciation to unitholders by investing primarily in a portfolio of relatively higher yielding debt and equity securities in Asian region.",
    "total_assets": null
  }
}
