{
    "BRPIX": {
        "short_name": "Bear ProFund Investor Class",
        "long_name": "ProFunds Bear Fund Investor Class",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the S&P 500Â® Index.\n The fund invests in financial instruments that ProFund Advisors believes, in combination, should produce daily returns consistent with its investment objective. The index is a float-adjusted, market capitalization-weighted index of 500 U.S. operating companies and real estate investment trusts selected through a process that factors in criteria such as liquidity, price, market capitalization and financial viability. The fund is non-diversified.",
        "manager_name": "Michael  Neches",
        "manager_bio": "Michael Neches joined ProShare Advisors in 2000, and presently serves as a Senior Portfolio Manager. He previously served as the Senior Portfolio Manager responsible for the companyâ\u0080\u0099s commodities desk for two years, as a Portfolio Manager and team lead, as an Associate Portfolio Manager and as a Portfolio Analyst. Mr. Neches earned a Bachelor of Science in Finance from the University of Maryland, College Park and an MBA from Georgetown University.",
        "category": "Bear Market",
        "family": "ProFunds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "CPCRX": {
        "short_name": "Comstock Capital Value Fund  Cl",
        "long_name": "Comstock Capital Value Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks to maximize total return, consisting of capital appreciation and current income.\n The fund follows a value oriented strategy and seeks to achieve its investment objective by investing in equity and debt securities, money market instruments, and derivatives. It may invest in, and may shift frequently among, a wide range of asset classes and market sectors. The fund may invest up to 65% of its assets in equity and debt securities of foreign issuers, including those in emerging markets. It may invest without limit in high yield debt securities, but currently the advisor intends to limit such investments to 35% of its assets.",
        "manager_name": "Dennis J. DeCore",
        "manager_bio": "Mr. DeCore has been a portfolio manager with Gabelli Funds LLC since December of 2014. Prior to December 2014, Mr. DeCore was a managing director at Mitsubishi UFJ Securities in corporate buybacks â\u0080\u0093 proprietary trading from 2008 to 2012. He was co-manager and managing director of U.S. Equity Index Arbitrage at Nomura Securities International from August 1997 to December 2007. From January 1991 to August 1997, Mr. DeCore was a co-manager and managing director at WG Trading Company. He was employed with Merrill Lynch and Co. from September 1981 to January 1991 as a vice president, co-manager and managing director. Mr. DeCore has a M.B.A. from New York University and a B.S. from Rider College.",
        "category": "Bear Market",
        "family": "Gabelli",
        "exchange": "NAS",
        "market": "us_market"
    },
    "RYARX": {
        "short_name": "Rydex Series Fds, Inverse S&P 5",
        "long_name": "Rydex Inverse S&P 500 Strategy Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that match, before fees and expenses, the inverse (opposite) of the performance of the S&P 500Â® Index on a daily basis.\n The fund employs as its investment strategy a program of engaging in short sales of securities included in the underlying index and investing to a significant extent in derivative instruments. It will invest at least 80% of its net assets, plus any borrowings for investment purposes, in financial instruments with economic characteristics that should perform opposite to the securities of companies included in the underlying index. The fund is non-diversified.",
        "manager_name": "Ryan A. Harder",
        "manager_bio": "Ryan A. Harder, CFA, Portfolio Manager of Security Investors. Mr. Harder joined the Investment Manager in 2010.He also joined Rydex Investments in 2004 as an assistant portfolio manager, was promoted to portfolio manager in 2005 and has served in his current capacity since 2008. Prior to joining Rydex Investments, he served in various capacities with WestLB Asset Management, including as an assistant portfolio manager, and worked in risk management at CIBC World Markets.He holds a B.A. in Economics from Brock University in Ontario, Canada and a Master of Science in International Securities, Investment and Banking from the ICMA Centre at the University of Reading in the U.K. Harder holds the Chartered Financial Analyst designation.",
        "category": "Bear Market",
        "family": "Rydex Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "SOPIX": {
        "short_name": "Short NASDAQ-100 ProFund Invest",
        "long_name": "ProFunds Short NASDAQ-100 Fund Investor Class",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the Nasdaq-100Â® Index.\n The fund invests in financial instruments that ProFund Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.",
        "manager_name": "Michael  Neches",
        "manager_bio": "Michael Neches joined ProShare Advisors in 2000, and presently serves as a Senior Portfolio Manager. He previously served as the Senior Portfolio Manager responsible for the companyâ\u0080\u0099s commodities desk for two years, as a Portfolio Manager and team lead, as an Associate Portfolio Manager and as a Portfolio Analyst. Mr. Neches earned a Bachelor of Science in Finance from the University of Maryland, College Park and an MBA from Georgetown University.",
        "category": "Bear Market",
        "family": "ProFunds",
        "exchange": "NAS",
        "market": "us_market"
    }
}