{
  "0P00008STO.HK": {
    "category": "Cautious Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Allianz Global Investors Asia Pacific Limited",
    "long_name": "Allianz Global Investors MPF Plan-Allianz Capital Stable Fund - B",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "Allianz Global Investors MPF Pl",
    "summary": "The Fund’s investment objective is to minimise the risk of capital loss whilst providing some opportunity for capital growth by investing all its assets in an APIF, RCM Capital Stable Fund, a sub-fund of Allianz Global Investors Choice Fund, which aims to provide investors with capital preservation combined with steady capital appreciation over the long term by investing in a diversified portfolio of global equities and fixed-interest securities and is expected to invest 30 percent of its assets in equities and 70 percent in fixed-interest securities.",
    "total_assets": null
  },
  "0P00008SUS.HK": {
    "category": "Cautious Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Sun Life Hong Kong Limited",
    "long_name": "Sun Life MPF Comprehensive Scheme Stable Portfolio",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "Sun Life MPF Comprehensive Sche",
    "summary": "The objective is to achieve long term returns in line with Hong Kong inflation. \nThe target asset allocation is 15% - 40% equities, 40% - 70% bonds and 0% - 30% cash. It is a medium risk fund portfolio and appropriate for middle-aged to pre retirement investors who are willing to take medium risk in return for slight capital growth (Value of this portfolio will fluctuate both upwards and downwards). The fund invests in a single approved pooled investment fund managed by Schrader Investment Management (Hong Kong) Limited and may also hold cash up to 5% of its assets.",
    "total_assets": null
  },
  "0P00008VB8.HK": {
    "category": "Cautious Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Bank Consortium",
    "long_name": "BCT (MPF) Pro Choice-BCT (Pro) E30 Mixed Asset Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BCT (MPF) Pro Choice-BCT (Pro) ",
    "summary": "The objective of the E30 Mixed Asset Fund is to provide members with capital growth over the long term with a view to minimizing the risk of capital loss by investing primarily in fixed income securities and maintaining a limited exposure to global equities.\nThe investments primarily include bank deposits, global bonds and global equities. The benchmark weightings of the investments of the fund are expected to be, but not restricted to, 70% in fixed income securities and 30% in equities. The fund holds a minimum of 30% of assets denominated in Hong Kong dollar through direct holdings of investments. The fund is thus globally diversified with a bias towards Hong Kong.",
    "total_assets": null
  },
  "0P0000KUYW.HK": {
    "category": "Cautious Allocation",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "AMTD Financial Planning Limited",
    "long_name": "AMTD RCM Capital Stable Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "AMTD Allianz Choice Capital Sta",
    "summary": "To achieve capital preservation combined with steady capital appreciation over the long term by investing solely in the RCM Capital Stable Fund which is an APIF and in turn invests in a diversified portfolio of global equities and fixed-interest securities.",
    "total_assets": null
  }
}
