{
  "0P00002BZS.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "BOCI-Prudential Asset Management",
    "long_name": "BOCHK China Golden Dragon",
    "manager_bio": "Mr. Chan serves as the Investment Manager of the Hong Kong Fund. He also manages the equity portion of some of the institutional mandates. He has involved in investment-related business since 1995.",
    "manager_name": "Alan Chan  & Team",
    "market": "hk_market",
    "short_name": "BOCHK China Golden Dragon",
    "summary": "The Fund aims to provide investors with capital growth by investing in securities issued by or linked to companies which are related to the economy of the People&#39;s Republic of China (\"PRC\").\nThe Sub-Fund may invest in A shares (through investments in equity linked instruments (“ELIs”) issued by institutions with the qualified foreign institutional investors (“QFII”) status in Mainland China. The Manager may also hold cash, deposits, certificates of deposit, treasury bills, or other instruments for the account of the Sub-Fund. The Manager expects that at least 70% of the non-cash assets of the Sub-Fund will be invested in the PRC-related securities.",
    "total_assets": 113042106.57717133
  },
  "0P0000CQ8Y.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "BOCI-Prudential Asset Management",
    "long_name": "BOCHK China Consumption Growth A",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BOCHK China Consumption Growth ",
    "summary": "The BOCHK China Consumption Growth Fund\nseeks to provide investors with long-term capital\ngrowth by investing primarily in listed equities\nor equity-related securities issued by or linked\nto companies which activities relate to the\nconsumer sector in Hong Kong and/or the\nmainland China.",
    "total_assets": 153040560.60646057
  },
  "0P0000J1PV.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "CCB International Asset Management Ltd",
    "long_name": "CCB Intl-China Policy Driven Fd Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "CCB Intl-China Policy Driven Fd",
    "summary": "CCB International Policy Driven Fund is an open-end fund incorporated in Hong Kong. The investment objective of the Fund is to achieve long-term appreciation of the Unit price through capital growth and income appreciation by investing in a diversified portfolio of equities and equity related securities, bonds that are listed primarily on Hong Kong stock exchange and/or any international securities exchange and can benefit from the policies in place and/or to be made by the government and/or statutory bodies of mainland China, Hong Kong, Macau and Taiwan subject to the investment restrictions applicable to the Fund. The Fund will invest in equities and equity related securities.",
    "total_assets": 102227983.59394073
  },
  "0P0000M4OA.L": {
    "category": "China Equity",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Invesco Fund Managers Limited",
    "long_name": "Invesco China Equity Fund (UK) (No Trail) (Acc)",
    "manager_bio": "Mike Shiao has 25 years of investment experience. He joined Invesco in 2002. In April 2015, he became Chief Investment Officer, Greater China, leading the Greater China equities team. Mike was appointed as Chief Investment Officer, Asia ex Japan, in April 2016. He was previously Head of Equities for Invesco Taiwan Ltd. He moved to Invesco Hong Kong Ltd to expand his coverage to Greater China markets in 2006. Mike started his investment career in 1992 at Grand Regent Investment Ltd., where he worked for six years as a project manager supervising venture capital investments in Taiwan and China. In 1997, he joined Overseas Credit and Securities Inc. as a senior analyst covering Taiwan technology sector. Mike also worked at Taiwan International Investment Management Co., as a fund manager and was responsible for technology sector research. Mike holds a Bachelor’s degree from National Chung Hsing University, Taiwan and a Master of Science degree in Finance from Drexel University, Philadelphia.",
    "manager_name": "Mike  Shiao",
    "market": "gb_market",
    "short_name": "Invesco China Equity Fund (UK) ",
    "summary": "The Fund aims to achieve long-term (5 years plus) capital growth.\nThe Fund invests at least 80% of its assets in shares or other equity related securities of companies incorporated, domiciled or carrying out the main part of their economic activity in China, including Hong Kong. Exposure to China will be accessed by investing in securities listed on Hong Kong and other relevant exchanges and China A shares listed on the Shanghai and Shenzhen Stock Exchanges via Stock Connect.",
    "total_assets": null
  },
  "0P0000M7WE.TW": {
    "category": "China Equity",
    "currency": "TWD",
    "exchange": "TAI",
    "family": "First Financial Holding Co Ltd",
    "long_name": "FSITC China Century Fund-TWD",
    "manager_bio": "學歷： 台灣大學國際企業系碩士 \n經歷： 92/07~95/04 中華開發銀行金融商品交易部證券自營組資深襄理 \n95/05~95/12 瑞泰人壽投資部襄理 \n96/03~97/05 標準銀行香港分公司資產交易部經理 \n97/10~迄今 建弘馬來西亞基金經理人",
    "manager_name": "Yao De  Huang",
    "market": "tw_market",
    "short_name": "FSITC China Century Fund-TWD",
    "summary": "N/A",
    "total_assets": null
  },
  "0P0000PRAY.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "Baring International Fund Mgrs (Ireland) Limited",
    "long_name": "Barings International Umbrella Fund - Barings Hong Kong China Fund Class A HKD Inc",
    "manager_bio": "Laura Luo, CFA is the lead portfolio manager of the MML China Fund. Ms. Luo is Head of Hong Kong China Equities, with overall responsibility for a team of investment managers and analysts who manage a range of Hong Kong and China equity strategies including Baring’s Hong Kong China Fund equity strategy and China A Share strategy. She is the lead manager of Baring’s flagship Baring Hong Kong China Fund and directs Hong Kong China specialist research. Ms. Luo joined Baring Asset Management in September 2013 from Schroder Investment Management where she worked for over 12 years.",
    "manager_name": "Laura  Luo",
    "market": "hk_market",
    "short_name": "Barings International Umbrella ",
    "summary": "The investment objective of the Fund is to achieve long-term capital growth in the value of assets by investing in Hong Kong, China and Taiwan. The Fund will seek to achieve its investment objective by investing at least 70% of its total assets at any one time, either directly in equities or through equity-related securities (including depositary receipts) of companies (i) incorporated, or (ii) exercising the predominant part of their economic activity, or (iii) quoted or traded on the stock exchanges in markets in Hong Kong or China. A description of equity-related securities is described under the section headed “Investment Policy: General”.",
    "total_assets": null
  },
  "0P0000S8R7.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "BOCI-Prudential Asset Management",
    "long_name": "BOCIP China Value Fund Class A",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BOCIP China Value Fund Class A",
    "summary": "The BOCIP China Value Fund seeks to achieve\nlong term capital growth by investing primarily in\nsecurities issued by or linked to companies which\nactivities and business are closely related to the\neconomy of the PRC.",
    "total_assets": 137223473.4742813
  },
  "0P0000VG5U.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "BOCOM International Asset Management Ltd",
    "long_name": "BOCOM International Dragon Core Growth Fund",
    "manager_bio": "n.a",
    "manager_name": "Qian  Wang",
    "market": "hk_market",
    "short_name": "BOCOM International Dragon Core",
    "summary": "The Sub-Fund seeks to deliver long-term capital growth through investing principally in equities of companies that are listed on the Hong Kong Stock Exchange, which have considerable interests in the Greater China region (inclusive of Mainland China, Hong Kong, Macau and Taiwan).",
    "total_assets": 8551630.181438446
  },
  "0P00012SFM.HK": {
    "category": "China Equity",
    "currency": "HKD",
    "exchange": "HKG",
    "family": "BOCI-Prudential Asset Management",
    "long_name": "BOCIP China Wealth Class A",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "hk_market",
    "short_name": "BOCIP China Wealth Class A",
    "summary": "The Sub-Fund seeks to provide investors with long-term capital growth by primarily investing in securities issued by or linked to companies which are related to the economy of the People’s Republic of China (“PRC”).",
    "total_assets": null
  },
  "0P000148D0.BE": {
    "category": "China Equity",
    "currency": "AUD",
    "exchange": "BER",
    "family": "BOCHK Asset Management Limited",
    "long_name": "BOCHK All Weather Hong Kong Equity Fund A3 (AUD-H)",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "BOCHK All Weather Hong Kong Equ",
    "summary": "The investment objective of the Sub-Fund is to achieve long-term capital growth through\ninvesting primarily in equity securities in the Hong Kong and China markets.",
    "total_assets": null
  },
  "0P00017EUF.F": {
    "category": "China Equity",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Quilter Investors Limited",
    "long_name": "Quilter Investors China Equity Fund A (EUR) Accumulation",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "Quilter Investors China Equity ",
    "summary": "The Fund aims to achieve a combination of income and capital growth and to outperform the MSCI Zhong Hua Index, net of charges, over rolling five year periods. The Fund primarily invests (at least 70%) in shares of companies listed, located or that derive the majority of their economic activity from Hong Kong and China, even if listed elsewhere. Investment may be direct or through collective investment schemes or derivatives. The Fund may at times be concentrated in terms of the number of investments it holds (i.e. have less than 50 holdings).",
    "total_assets": null
  }
}
