{
  "0P0000Y1WH.F": {
    "category": "Commodities - Broad Basket",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "OPTINOVA Investmentaktieng. m.TGV",
    "long_name": "Optinova Metals and Materials",
    "manager_bio": "",
    "manager_name": "Armin  Sabeur",
    "market": "dr_market",
    "short_name": "Optinova Metals and Materials",
    "summary": "N/A",
    "total_assets": 30394775.074181557
  },
  "0P00012JQQ.F": {
    "category": "Commodities - Broad Basket",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "BNP Paribas Asset Management France",
    "long_name": "THEAM Quant Dynamic Raw Materials A EUR H",
    "manager_bio": "",
    "manager_name": "Solène  Deharbonnier",
    "market": "dr_market",
    "short_name": "THEAM Quant Dynamic Raw Materia",
    "summary": "L’objectif de gestion du FCP est d’offrir aux porteurs de parts, sur une durée d’investissement recommandée de 5 ans, une exposition synthétique aux marchés des matières premières – excluant le secteur des matières premières agricoles et de l’élevage - à travers une stratégie quantitative directionnelle via des indices de contrats à terme sur matières premières visant à générer une performance supérieure sur le long terme à celle d’un investissement statique présent dans les principaux indices de contrats à terme de matières premières.",
    "total_assets": null
  },
  "0P0001BRKJ.F": {
    "category": "Commodities - Broad Basket",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Andbank Wealth Management SGIIC",
    "long_name": null,
    "manager_bio": "",
    "manager_name": "Victor  Hernández",
    "market": "dr_market",
    "short_name": "Esfera Seasonal Quant Multistra",
    "summary": "Se invertirá principalmente en los mercados de derivados de materias primas (spreads con futuros) basándose en análisis cuantitativo\nde las pautas estacionales y fundamental. El resto se invertirá en renta variable y/o renta fija, sin que exista predeterminación en\ncuanto a porcentajes en cada uno de ellos. No existe objetivo predeterminado ni límites máximos en lo que se refiere a la distribución de\nactivos por tipo de emisor, rating, duración, capitalización bursátil, divisa, sector económico, países (incluidos emergentes), aunque en\nrenta variable se invertirá mayoritariamente en emisores y mercados de Estados Unidos. La inversión en activos de baja capitalización\ny/o activos de baja calificación crediticia puede influir negativamente en la liquidez del fondo.",
    "total_assets": 4853460.417901516
  }
}
