{"0P0000732C.TO": {"short_name": "Sprott énergie", "long_name": "Ninepoint Energy Fund Series A", "currency": "CAD", "summary": "The Fund seeks to achieve long-term capital growth. The Fund invests primarily in equity and equity-related securities of companies that are involved directly or indirectly in the exploration, development, production and distribution of oil, gas, coal, or uranium and other related activities in the energy and resource sector.", "manager_name": "Eric  Nuttall", "manager_bio": "Eric Nuttall is a Partner and Senior Portfolio Manager at Ninepoint Partners. Prior to Ninepointâ\u0080\u0099s formation, Eric was with Sprott Asset Management from 2003. Eric was named one of The Canadian TopGun Investment Minds Class of 2017*. His views are frequently sought after by the Business News Network (BNN), The Globe and Mail, the National Post, the Calgary Herald, CNBC, and the Wall Street Journal.\nEric graduated with High Honours from Carleton University with an Honors Bachelor of International Business.", "category": "Energy Equity", "family": "Ninepoint Partners LP", "exchange": "TOR", "market": "ca_market"}, "0P0000SPVD.TO": {"short_name": "Canoe Catégorie portefeuille d", "long_name": "Canoe Energy Portfolio Class A", "currency": "CAD", "summary": "The Fund aims to provide long term capital growth indirectly through the Partnership in securities related to the energy sector. The Fund invests indirectly through the Partnership primarily in companies that are involved in the exploration, development and production of oil and natural gas in Canada and abroad and in companies which service such industries.", "manager_name": "Rafi G. Tahmazian", "manager_bio": "Rafi Tahmazian, Director & Senior Portfolio Manager. Joined Canoe Financial in 2008. Bachelor of Arts in Economics, University of Calgary. Industry start date: 1991. Rafi leads the Canoe Energy team and has more than 28 years of experience in the energy sector. Prior to Canoe he spent 13 years at First Energy Capital, a leading investment dealer that focused on the energy industry.", "category": "Energy Equity", "family": "Canoe Financial LP", "exchange": "TOR", "market": "ca_market"}, "0P0000V5JE.TO": {"short_name": "Canoe Catégorie portefeuille d", "long_name": "Canoe Energy Income Portfolio Class A", "currency": "CAD", "summary": "The Fund aims to achieve income and long term capital growth by investing indirectly through the Partnership in energy equity and fixed income securities. The Fund invests indirectly through the Partnership primarily in companies that are involved in the exploration, development, production or supply, of oil and natural gas in Canada and abroad and in companies which service such industries.", "manager_name": "Rafi G. Tahmazian", "manager_bio": "Rafi Tahmazian, Director & Senior Portfolio Manager. Joined Canoe Financial in 2008. Bachelor of Arts in Economics, University of Calgary. Industry start date: 1991. Rafi leads the Canoe Energy team and has more than 28 years of experience in the energy sector. Prior to Canoe he spent 13 years at First Energy Capital, a leading investment dealer that focused on the energy industry.", "category": "Energy Equity", "family": "Canoe Financial LP", "exchange": "TOR", "market": "ca_market"}}