{
    "0P0000M1DU.NZ": {
        "short_name": "Devon Trans-Tasman Fund",
        "long_name": "Devon Trans-Tasman Fund",
        "currency": "NZD",
        "summary": "The Manager will invest in a portfolio of well-researched companies, predominantly listed on the New Zealand and Australian Stock Exchanges. These investments will tend to be in companies that operate in areas of the economy where there is structural growth and where a company has a sustainable competitive advantage over its competition. The Manager will also seek out short-term opportunities. Where there are few compelling investment opportunities, the Manager will invest in cash or cash equivalent securities.",
        "manager_name": "Slade  Robertson",
        "manager_bio": "\"Slade is responsible for stock selection and portfolio construction for the Devon Alpha Fund and Devon Australian Fund. Slade also has analytical responsibility for the Financial and Material sectors.\nSlade has held portfolio management roles at Brook Asset Management, Head of Equities at BT Investment Management (NZ) and Challenger Intâ\u0080\u0099l (NZ).\n\"",
        "category": "Equity Region Australasia",
        "family": "Devon Funds Management",
        "exchange": "NZE",
        "market": "nz_market"
    },
    "0P0001HA7K.NZ": {
        "short_name": "QuayStreet Altum Fund",
        "long_name": "QuayStreet Altum Fund",
        "currency": "NZD",
        "summary": "The Fund will invest in a limited number of shares selected by us. As a result, the asset allocation and diversification of the portfolio may change considerably over time. The Fund may also invest in cash or fixed interest securities, including when there is a lack of suitable investment options available. The Fundâ\u0080\u0099s return is measured in NZ dollars and currency exposure is actively managed in a manner consistent with the investment objectives.",
        "manager_name": "",
        "manager_bio": "",
        "category": "Equity Region Australasia",
        "family": "QuayStreet Asset Management Limited",
        "exchange": "NZE",
        "market": "nz_market"
    }
}