{
  "0P00000CNF.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Sabadell Asset Management SGIIC",
    "long_name": "Sabadell Fondtesoro Largo Plazo FI",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "Sabadell Fondtesoro Largo Plazo",
    "summary": "La gestión toma como referencia la rentabilidad del índice formado a partir de la revalorización media alcanzada por los fondos de inversión adscritos a la categoría \"Renta Fija Corto Plazo Zona Euro\" según establezca, en cada momento, el diario económico Expansión. El 70% de la exposición total deberá estar invertido en Deuda del Estado en euros, en cualquiera de sus modalidades. En todo caso, un 70% del patrimonio estará invertido en Deuda del Estado en euros, en cualquiera de sus modalidades, computándose como tal los bonos emitidos por los «ftpymes» que cuenten con el aval del Estado, los bonos emitidos por los «ftvpo» que cuenten con el aval del ico, las emisiones del Fondo de Reestructuración Ordenada Bancaria (frob), las emisiones del Fondo de Amortización del Déficit Eléctrico (fade), la Deuda emitida directamente por el ico y los créditos del Fondo para financiar el pago a proveedores (ffpp) cuando se conviertan en bonos, hasta el límite del 30% del patrimonio.",
    "total_assets": 40027856.77609253
  },
  "0P00000JIU.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Sabadell Asset Management SGIIC",
    "long_name": "Fidefondo Base FI",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "Fidefondo Base FI",
    "summary": "La gestión toma como referencia la rentabilidad del índice formado a partir de la revalorización media alcanzada por los fondos de inversión adscritos a la categoría \"Renta Fija Corto Plazo Zona Euro\" según establezca, en cada momento, el diario económico Expansión. Está previsto invertir el 100% de la cartera del Fondo en Deuda del Estado denominada en euros, en cualquiera de sus modalidades, emitida por el Estado Español, computándose como tal los bonos emitidos por los «FTPymes» que cuenten con el aval del Estado, hasta el límite del 20% del patrimonio.",
    "total_assets": 11214337.855179071
  },
  "0P00000P1K.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Novo Banco Gestión SGIIC",
    "long_name": "Trea NB Fondtesoro Largo Plazo FI",
    "manager_bio": "",
    "manager_name": "Marta  Grosso Romero",
    "market": "dr_market",
    "short_name": "NB Fondtesoro Largo Plazo FI",
    "summary": "La gestión toma como referencia la rentabilidad del índice EFFA de Deuda del Estado Español de 1 a 3 años. El 70% de la exposición total del fondo deberá estar invertido en Deuda del Estado en euros, en cualquiera de sus modalidades. En todo caso, un 70% el patrimonio del fondo estará invertido en Deuda del Estado en euros, en cualquiera de sus modalidades computándose, asímismo, a los efectos de este apartado, los bonos emitidos por los \"FTPymes\" que cuenten con el aval del Estado, los bonos emitidos por los \"FTVPO\" que cuenten con el aval del ICO, las emisiones del Fondo de Reestructuración Ordenada Bancaria (FROB), las emisiones del Fondo de Amortización del Déficit Eléctrico (FADE), la Deuda emitida directamente por el ICO y los créditos del Fondo para financiar el pago a proveedores (FFPP) cuando se conviertan en bonos, hasta el límite del 30% del patrimonio del fondo.",
    "total_assets": 2858261.30422163
  },
  "0P00000PCH.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Bankia Fondos SGIIC",
    "long_name": "Bankia Fondtesoro Largo Plazo Universal FI",
    "manager_bio": "",
    "manager_name": "Irene  Prieto",
    "market": "dr_market",
    "short_name": "Bankia Fondtesoro Largo Plazo U",
    "summary": "La gestión toma como referencia la rentabilidad del índice London Interbank Bid Rate (L0EC) por la exposición a renta fija corto plazo y ML Spanish Gov. 1-10 (G5E0) por la exposición a renta fija largo plazo. La referencia a los mismos se realiza únicamente a efectos meramente informativos y/o comparativos.El 70% de la exposición total se invertirá en deuda del estado en euros, en cualquiera de sus modalidades. Un 70% del patrimonio se invertirá en Deuda del Estado en euros, en cualquiera de sus modalidades computándose, a estos efectos, los bonos emitidos por los FTPymes que cuenten con el aval del Estado, los bonos emitidos por los FTVPO que cuenten con aval del ICO, las emisiones del Fondo de Reestructuración Ordenada Bancaria (FROB), las emisiones del Fondo de Amortización del Déficit Eléctrico (FADE), la Deuda emitida directamente por el ICO y los créditos del Fondo para Financiar el Pago a Proveedores cuando se conviertan en bonos, hasta el límite del 30% del patrimonio.",
    "total_assets": 42281958.34613609
  },
  "0P00000PES.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Unigest SGIIC",
    "long_name": "Unifond Fondtesoro Largo Plazo A FI",
    "manager_bio": "",
    "manager_name": "Raúl  Beltrá",
    "market": "dr_market",
    "short_name": "Unifond Fondtesoro Largo Plazo ",
    "summary": "La gestión toma como referencia la rentabilidad del índice Bloomberg Barclays Series-E Spain Govt 1-3 YrBond Index. Este índice se utiliza a efectos meramente informativos y/o comparativos.La política de inversión está encaminada a la inversión en valores emitidos por el Tesoro.\nEl 70% de la exposición total del fondo estará invertido en Deuda del Estado en euros. En todo caso, un 70% del patrimonio estará invertido en Deuda del Estado en euros, en cualquiera de sus modalidades computándose, asimismo, a los efectos de este apartado,los bonos emitidos por los `FTPymes` que cuenten con aval del Estado, los bonos emitidos por los \"FTVPO\" que cuenten con aval del ICO, las emisiones del Fondo de Reestructuración Ordenada Bancaria(FROB), las emisiones del Fondo de Amortización del Déficit Eléctrico(FADE), la deuda emitida directamente por el ICO y los créditos del Fondo para financiar el pago a proveedores(FFPP) cuando se conviertan en bonos, hasta el límite del 30% del patrimonio.",
    "total_assets": 42987258.982964516
  },
  "0P00000TVW.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Eurizon Capital SGR SpA",
    "long_name": "Eurizon Obbligazioni Euro Breve Termine D",
    "manager_bio": "",
    "manager_name": "Maria Luisa  Matarrelli",
    "market": "dr_market",
    "short_name": "Eurizon Obbligazioni Euro Breve",
    "summary": "Tipologia di strumenti finanziari e valuta di denominazione:\nesclusivamente di natura monetaria e/o obbligazionaria, principalmente denominati in euro. Investimento contenuto in depositi bancari denominati in euro.",
    "total_assets": 669120994.5926971
  },
  "0P00000U3V.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Fideuram Investimenti SGR SPA",
    "long_name": "Fideuram Risparmio",
    "manager_bio": "",
    "manager_name": "Piero  Pardini",
    "market": "dr_market",
    "short_name": "Fideuram Risparmio",
    "summary": "Principalmente obbligazioni denominate in Euro, con esclusione delle obbligazioni convertibili e cum warrant. Il Fondo può\naltresì investire fino al 20% dell’attivo in depositi bancari e fino al 20% in OICR.\nIl fondo può investire fino al 100% del patrimonio in strumenti emessi da uno Stato dell’UME ; il Fondo può inoltre\ninvestire fino ad un massimo del 40% del proprio attivo in mercati regolamentati di paesi sviluppati e può investire in\nvalute diverse dall’Euro fino ad un massimo del 10%.",
    "total_assets": 4193160.3521192074
  },
  "0P0000JVKZ.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Natixis Investment Managers International",
    "long_name": "Ostrum Souverains Euro 1-3 RC",
    "manager_bio": "",
    "manager_name": "Abdel-Rani  Guermat",
    "market": "dr_market",
    "short_name": "Ostrum Souverains Euro 1-3 RC",
    "summary": "Le FCP a pour objectif d’obtenir une performance supérieure à celle de l’indice FTSE MTS EUROZONE GOVERNMENT BONDS 1-3 Y (cours de clôture).",
    "total_assets": 46312151.21178627
  },
  "0P0000P7N0.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Christian Brothers Inv Srvc Inc",
    "long_name": "CBIS European Short Term Government Bond Fund",
    "manager_bio": "",
    "manager_name": "",
    "market": "dr_market",
    "short_name": "CBIS European Short Term Govern",
    "summary": "The investment objective of the European Short Term Government Bond Fund is to provide current income, consistent with the preservation of capital. The European Short Term Government Bond Fund will invest primarily in a diversified portfolio of high quality, Euro-denominated deposits and short term fixed-income securities provided that not more than 50% of the Net Asset Value of the Fund may be invested in Euro-denominated deposits.",
    "total_assets": 57260171.892876625
  },
  "0P0000UVW2.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Eurizon Capital SGR SpA",
    "long_name": "Eurizon Obbligazioni Euro Breve Term A",
    "manager_bio": "",
    "manager_name": "Maria Luisa  Matarrelli",
    "market": "dr_market",
    "short_name": "Eurizon Obbligazioni Euro Breve",
    "summary": "Tipologia di strumenti finanziari e valuta di denominazione:\nesclusivamente di natura monetaria e/o obbligazionaria, principalmente denominati in euro. Investimento contenuto in depositi bancari denominati in euro.",
    "total_assets": 669120994.5926971
  },
  "0P0000W6HS.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Amundi SGR S.p.A.",
    "long_name": "Amundi Obbligazionario Italia Breve Termine B",
    "manager_bio": "Leads Portfolio Manager of Pioneer F - Euro Reserve. Cosimo joined PioneerInvestm in 2000 after completing a Masters in Asset Mgm from Bocconi Univ, and Univ College Dublin. Before the Masters he worked as a Fixed Income Ptf Manager with Euroconsult in Milan. Previously worked as a Fixed Income Trader with Banca Akros in Milan. Cosimo is a Business Engineer graduate of Milan Politechnical with qualific in Fixed Income Ptf Mgm from Bocconi Univ. Cosimo works closely with a team of fixed income specialists.",
    "manager_name": "Cosimo  Marasciulo",
    "market": "dr_market",
    "short_name": "Amundi Obbligazionario Italia B",
    "summary": "Il Fondo è investito in strumenti finanziari di natura obbligazionaria e strumenti del mercato monetario. Il Fondo può investire in OICR, anche collegati, in misura contenuta.\nL’investimento in depositi bancari è consentito fino ad un massimo del 30%.\nGli strumenti finanziari sono denominati principalmente in Euro.",
    "total_assets": 662310123.994873
  },
  "0P00014OF2.F": {
    "category": "EUR Government Bond - Short Term",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Sabadell Asset Management SGIIC",
    "long_name": "Fidefondo Plus FI",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "Fidefondo Plus FI",
    "summary": "La gestión toma como referencia la rentabilidad del índice formado a partir de la revalorización media alcanzada por los fondos de inversión adscritos a la categoría \"Renta Fija Corto Plazo Zona Euro\" según establezca, en cada momento, el diario económico Expansión. Está previsto invertir el 100% de la cartera del Fondo en Deuda del Estado denominada en euros, en cualquiera de sus modalidades, emitida por el Estado Español, computándose como tal los bonos emitidos por los «FTPymes» que cuenten con el aval del Estado, hasta el límite del 20% del patrimonio.",
    "total_assets": 11214337.855179071
  }
}
