{
  "0P00000XGT.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Gespensión Caminos EGFP",
    "long_name": "MG Lierde Plan de Pensiones Bolsa PP",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "MG Lierde Plan de Pensiones Bol",
    "summary": "El fondo invertirá principalmente su patrimonio en activos de renta variable, oscilando esta inversión entre el 10% y el 90%, siempre de acurdo a la legislación vigente en cada momento, pudiendo invertir en valores no cotizados en euros en los mismo porcentajes. Se invertirá preferentemente en valores de gran capitalización y liquidez. Se podrá invertir a través de bonos convertibles y acciones. También podrá realizar operaciones con derivados negociados en mercados organizados con la finalidad de cobertura y no como inversión.",
    "total_assets": 13285910.04459858
  },
  "0P000019H0.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Bestinver Pensiones EGFP",
    "long_name": "Bestinver Global PP",
    "manager_bio": "",
    "manager_name": "Álvaro  Guzmán de Lázaro",
    "market": "dr_market",
    "short_name": "Bestinver Global PP",
    "summary": "Al menos el 75% de la exposición total estará invertida en renta variable y el resto de la exposición total en activos de renta fija. El riesgo divisa oscilará entre el 0 y el 50% de la exposición total.Al menos un 90% de la exposición en renta variable se concentrará en mercados de la Zona Euro y demás países de la OCDE. También se podrá invertir en países emergentes hasta un máximo del 10% de la referida exposición. El fondo invertirá en compañías, tanto de alta como de baja capitalización bursátil, con perspectivas de revalorización a medio y largo plazo, sin especial predilección por algún sector o país.",
    "total_assets": 775397139.752533
  },
  "0P00001F88.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "AXA Pensiones EGFP",
    "long_name": "Mundiplan Audaz Europa PP",
    "manager_bio": "",
    "manager_name": "Loreto  Bernues",
    "market": "dr_market",
    "short_name": "Mundiplan Audaz Europa PP",
    "summary": "El Mundiplan Audaz Europa se encuadra dentro de la categoría Renta Variable. Su cartera está integrada por activos de renta variable europea. Su filosofía de inversión se centra en invertir en valores de renta variable con un horizonte de inversión a medio y largo plazo. La selección de dichos valores se realizará con arreglo a un prudente criterio de diversificación de riesgos. Invierte hasta el 100% en Renta Variable Europea y está referido a los valores del índice Eurostoxx 50.",
    "total_assets": 21631251.854969025
  },
  "0P00009AOX.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "GVC Gaesco Pensiones EGFP",
    "long_name": "Guissona Bolsa PP",
    "manager_bio": "",
    "manager_name": "José Antonio  Cortés",
    "market": "dr_market",
    "short_name": "Guissona Bolsa PP",
    "summary": "GUISSONA BOLSA, F.P. es un Fondo de Pensiones que tiene una política de inversión dirigida a maximizar el capital a la edad de jubilación para períodos largos de tiempo, lo cual implica la adopción de posiciones importantes en los mercados de renta variable. Su objetivo de gestión es batir al Ibex 35. Ejerce el timing como estrategia de inversión, lo cual implica que el porcentaje de inversión en renta variable, y la selección de títulos pueda variar en función del momento del mercado.",
    "total_assets": 9481621.346227407
  },
  "0P0000VO3O.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Mutuactivos Pensiones EGFP",
    "long_name": "Fondomutua Bolsa Europea PP",
    "manager_bio": "Ángel se ha incorporado recientemente al equipo de Mutuactivos. Tiene una dilatada experiencia de 12 años como gestor de inversiones y tiene formación actuarial. Ha desarrollado su experiencia profesional en la gestora de Banco Popular, habiendo liderado los equipos de derivados, garantizados, de renta fija y de renta variable. Tiene Máster en Mercados Financieros por el CEU y MBA por IUP.",
    "manager_name": "Ángel  Fresnillo",
    "market": "dr_market",
    "short_name": "Fondomutua Bolsa Europea PP",
    "summary": "El fondo invertirá en renta variable, directa o indirectamente a través de instituciones de inversión colectiva, sin restricción alguna en cuanto a la capitalización, distribución geográfica o sectores de actividad. Los activos deberán estar cotizados, mayoritariamente en mercados de la OCDE, debidamente organizados y regulados. Para la selección de activos de renta variable se utilizarán técnicas de análisis fundamental de las compañías, buscando valores que se encuentren infravalorados por el mercado. La gestión de las inversiones es realizada de forma discrecional y bajo el cumplimiento estricto de la normativa vigente en todo momento.",
    "total_assets": 34850994.18619919
  },
  "0P00014LEE.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Mutualitat Collegi Enginyers",
    "long_name": "Enginyers Borsa PP Asociado",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "dr_market",
    "short_name": "Enginyers Borsa PP Asociado",
    "summary": "El Enginyers Borsa, Pla de Pensions está integrado en un fondo que desde marzo de 2008 invierte única y exclusivamente en el fondo de pensiones abierto AHORROPENSIÓN CUATRO, F.P. gestionado por CASER PENSIONES. El fondo pertenece a la categoría Renta Variable, en la que su inversión en este tipo de activo puede oscilar entre el 75% y el 100%. La inversión en renta variable estará en general materializada en títulos negociados en mercados organizados de la OCDE, fundamentalmente en países de la zona Euro. La inversión en renta variable americana podrá llegar a representar el 20%.",
    "total_assets": 3633065.649899006
  },
  "0P00016QN2.F": {
    "category": "Europe Equity PP",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Caser Pensiones EGFP",
    "long_name": "Magallanes Acciones Europeas PP",
    "manager_bio": "",
    "manager_name": "Concepción  Bru",
    "market": "dr_market",
    "short_name": "Magallanes Acciones Europeas PP",
    "summary": "El fondo de Pension Ahorropension noventa y seis, se configura como un fondo cuyo objetivo de inversión es la obtención de la máxima rentabilidad a largo plazo sujeto a resticciones en su nivel de riesgo. Se define por su vocación como un fondo de Renta Variable según la clasificación de Inverco.",
    "total_assets": 68067441.85904121
  }
}
