{"0P000073MW.TO": {"short_name": "Chou Europe", "long_name": "Chou Europe", "currency": "CAD", "summary": "The Fund&#39;s objective is to provide long-term growth of capital by investing primarily in the securities markets of Europe considered by the Manager to be undervalued. Investments may be made in securities markets outside of Europe. Investments may include common and preferred shares, convertible debentures, government and corporate bonds and short-term indebtedness.", "manager_name": "Francis S.M. Chou", "manager_bio": "Francis S.M. Chou, Chief Executive Officer of Chou America Management Inc.. Mr. Chou also serves as CEO of Chou Associates Management Inc. (â\u0080\u009cChou Associatesâ\u0080\u009d), an investment adviser based in Toronto, Canada, which manages the Chou family of Canadian mutual funds (â\u0080\u009cChou Fundsâ\u0080\u009d). Mr. Chou has been the CEO of Chou Associates and the Portfolio Manager of the Chou Funds since 1986. In addition, Mr. Chou served as a Senior Vice President for Fairfax Financial Holdings from 1996-2007.", "category": "European Equity", "family": "Chou Associates Management Inc", "exchange": "TOR", "market": "ca_market"}, "0P0000KWFO.TO": {"short_name": "Manuvie Sélect Trimark FPG Eur", "long_name": "Manulife Trimark Europlus GIF Select Original 75", "currency": "CAD", "summary": "The Fund seeks to achieve significant capital growth over the long-term. The fund&#39;s focus is on companies in Europe, Eastern Europe and the Commonwealth of Independent States (the former Soviet Union). In addition, the fund may from time to time take advantage of investment opportunities in other countries, generally in the Mediterranean region. As a specialty equity fund, the Fund affords investors the opportunity to create a more comprehensive portfolio by combining its specifically focused investments with other, broadly based core funds.", "manager_name": "Not  Disclosed", "manager_bio": "", "category": "European Equity", "family": "Manufacturers Life Insurance Co", "exchange": "TOR", "market": "ca_market"}, "0P0000Q694.TO": {"short_name": "Manuvie FPG Sél Élite Europlu", "long_name": "Manulife Trimark Europlus GIF Select InvPlus E DSC", "currency": "CAD", "summary": "The Fund seeks to achieve significant capital growth over the long-term. The fund&#39;s focus is on companies in Europe, Eastern Europe and the Commonwealth of Independent States (the former Soviet Union). In addition, the fund may from time to time take advantage of investment opportunities in other countries, generally in the Mediterranean region. As a specialty equity fund, the Fund affords investors the opportunity to create a more comprehensive portfolio by combining its specifically focused investments with other, broadly based core funds.", "manager_name": "Not  Disclosed", "manager_bio": "", "category": "European Equity", "family": "Manufacturers Life Insurance Co", "exchange": "TOR", "market": "ca_market"}, "0P00018DVM.TO": {"short_name": "Mackenzie ind Divers maximale M", "long_name": "Mackenzie Maximum Diversification Developed Europe Index Fund PWX5", "currency": "CAD", "summary": "\"The Fund seeks long-term capital growth by investing in equity securities of developed European companies. The Fund will invest in a manner that aims to enhance the diversification of its investments.\nThe Fund will pursue this objective by investing all or a portion of its assets in a manner that tracks the TOBAM Maximum Diversification Developed Europe Index (the â\u0080\u009cTOBAM Indexâ\u0080\u009d), or a substantially similar index, and may also invest in other securities and/or investment funds.\"", "manager_name": "Ayaaz  Allymun", "manager_bio": "Ayaaz Allymun is Portfolio Manager at TOBAM, which he joined in 2008 as a portfolio manager and researcher. Prior to his TOBAM appointment, Ayaaz was a portfolio manager at Credit Agricole Asset Management in Paris from 2004-08. He also has experience as a quantitative analyst in the Financial Engineering team at Credit Lyonnais Asset Management. In that role he had responsibility for developing systems solutions for equity portfolio managers.", "category": "European Equity", "family": "Mackenzie Investments", "exchange": "TOR", "market": "ca_market"}}