{
    "0P00000XWQ.L": {
        "short_name": "Quilter Investors Gilt Index Fu",
        "long_name": "Quilter Investors Gilt Index Fund A (GBP) Accumulation",
        "currency": "GBp",
        "summary": "The Fund aims to achieve capital growth through a portfolio of investments aimed at tracking the performance of the ICE BofAML UK Gilt Index before fees are deducted. The Fund primarily invests (at least 70%) in UK Gilts (i.e. government bonds). Investment will generally be made in proportion to the weightings in the ICE BofAML UK Gilt Index.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Government Bond",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 437105280
    },
    "0P000023KZ.L": {
        "short_name": "Allianz Gilt Yield I Inc",
        "long_name": "Allianz Gilt Yield I Inc",
        "currency": "GBp",
        "summary": "The objective of the Fund is to maximise total return, consistent with preservation of capital and prudent investment management, primarily through investment in United Kingdom Government Securities. The ACD will adopt a policy of active management and may invest in gilts, overseas government bonds, government guaranteed bonds, supranational bonds, deposits, money market instruments and derivatives. The Fund may also invest in collective investment schemes. At least 80% of the value of the Fund will be invested in gilts issued by the United Kingdom Government",
        "manager_name": "Michael  Amey",
        "manager_bio": "Mr. Amey is a managing director and portfolio manager in the London office. He is responsible for sterling portfolios, the European insurance (ex Germany) and the European LDI (liability-driven investing) portfolio management groups. Prior to joining PIMCO in 2003, he was head of U.K. fixed income at Rothschild Asset Management and after their merger, at Insight Investment. Prior to joining Rothschild in 1994, Mr. Amey spent two years tutoring in the Department of Economics at the University of Durham. He holds undergraduate and master's degrees in corporate and international finance from the University of Durham. Mr. Amey is also a member of the U.K. Society of Investment Professionals.",
        "category": "GBP Government Bond",
        "family": "Allianz Global Investors GmbH",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 2558119424
    },
    "0P00006OKA.L": {
        "short_name": "iShares GiltTrak Index Fund (IE",
        "long_name": "iShares GiltTrak Index Fund (IE) Institutional Dist GBP",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to provide investors with a total return, taking into account both capital and income returns, which reflects the total return of the gilt market as represented by the FTSE Government All Stocks Gilt Index (the \"Index\").The Index is the benchmark that includes all conventional British Government issued bonds with varying redemption dates and maturities.",
        "manager_name": "Francis  Rayner",
        "manager_bio": "Francis Rayner, Associate, is a member of BlackRock's Fixed Income Portfolio Solutions group. \nMr. Rayner's service with the firm dates back to 2008, including his years with Barclays Global Investors (BGI), which merged with BlackRock in 2009. At BGI, he was an assistant portfolio manager. Prior to joining BGI, he spent six years working for Prudential M&G and International Financial Data Services as a client relationship manager.\nMr. Rayner earned a BSc degree in mathematics from Lancaster University in 1999.",
        "category": "GBP Government Bond",
        "family": "BlackRock Asset Management Ireland Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 183286672
    },
    "0P00008Q9B.L": {
        "short_name": "Irish Life International UK Gil",
        "long_name": "Irish Life International UK Gilt Fund",
        "currency": "GBp",
        "summary": "The fund mainly invests in a diversified portfolio of sterling denominated fixed income securities of varying maturities.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Government Bond",
        "family": "SEB Life International",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 1476011
    },
    "0P0000SV4O.L": {
        "short_name": "iShares GiltTrak Index Fund (IE",
        "long_name": "iShares GiltTrak Index Fund (IE) Institutional Acc GBP",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to provide investors with a total return, taking into account both capital and income returns, which reflects the total return of the gilt market as represented by the FTSE Government All Stocks Gilt Index (the \"Index\").The Index is the benchmark that includes all conventional British Government issued bonds with varying redemption dates and maturities.",
        "manager_name": "Francis  Rayner",
        "manager_bio": "Francis Rayner, Associate, is a member of BlackRock's Fixed Income Portfolio Solutions group. \nMr. Rayner's service with the firm dates back to 2008, including his years with Barclays Global Investors (BGI), which merged with BlackRock in 2009. At BGI, he was an assistant portfolio manager. Prior to joining BGI, he spent six years working for Prudential M&G and International Financial Data Services as a client relationship manager.\nMr. Rayner earned a BSc degree in mathematics from Lancaster University in 1999.",
        "category": "GBP Government Bond",
        "family": "BlackRock Asset Management Ireland Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 183286672
    },
    "0P00011WJG.L": {
        "short_name": "Quilter Investors Gilt Index Fu",
        "long_name": "Quilter Investors Gilt Index Fund U2 (GBP) Accumulation",
        "currency": "GBp",
        "summary": "The Fund aims to achieve capital growth through a portfolio of investments aimed at tracking the performance of the ICE BofAML UK Gilt Index before fees are deducted. The Fund primarily invests (at least 70%) in UK Gilts (i.e. government bonds). Investment will generally be made in proportion to the weightings in the ICE BofAML UK Gilt Index.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Government Bond",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 437105280
    },
    "0P00013FXH.L": {
        "short_name": "LF Canlife UK Government Bond F",
        "long_name": "LF Canlife UK Government Bond Fund C Income",
        "currency": "GBp",
        "summary": "The CF Canlife UK Government Bond Fund aims to provide Shareholders with half-yearly income with prospects for some capital growth in the long term primarily through investment in UK Government and/or UK public securities.\nThe Sub-fund may also invest in collective investment schemes, cash, money market instruments, other transferable securities and derivatives and forward transactions for the purposes of Efficient Portfolio Management.",
        "manager_name": "Eleni  Poullides",
        "manager_bio": "Eleni joined Canada Life Asset Management in 1986 as a fund manager. Her current responsibilities are mainly in sterling, covering gilts and managing fixed income pension and life funds. Eleni holds a BSc in Economics & Accounting from City University and an MSc in Economics from the London School of Economics. She is an Associate of the CFA Society of the UK.",
        "category": "GBP Government Bond",
        "family": "Link Fund Solutions Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 88941072
    },
    "0P0001ENTX.L": {
        "short_name": "Omnis UK Gilt Fund Class A GBP ",
        "long_name": "Omnis UK Gilt Fund Class A GBP Inc",
        "currency": "GBp",
        "summary": "The Fund aims to achieve a return consisting of both income and capital growth which, after all fees and expenses, exceeds that of the ICE Bank of America Merrill Lynch UK Gilt TR Index over the medium to long term (defined as 5 to 10 years).",
        "manager_name": "Dave  Chappell",
        "manager_bio": "Dave Chappell is a Senior Portfolio Manager in the interest rate and currency team within Fixed Income and is at the core of US and UK rate and economic forecasting for the company. Dave manages a broad range of US and UK fixed income mandates for numerous insurance companies. He also manages a number of global government portfolios.\n\nDave joined the company in 1997 when Scudder Investments became part of Threadneedle Asset Management Limited. He joined Scudder Investments as a fixed income dealer, and in 1997 became an Insurance Asset Portfolio Manager.\n\nHe started his career in 1987 at Royal Bank of Scotland as an Operations Supervisor before moving to Irving Trust company as an Operations Manager.",
        "category": "GBP Government Bond",
        "family": "Omnis Investments Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 1092268544
    },
    "0P0001H3U2.L": {
        "short_name": "NFU Mutual UK Government Bond F",
        "long_name": "NFU Mutual UK Government Bond Fund Class I",
        "currency": "GBp",
        "summary": "The fund seeks to achieve income and capital growth (net of fees) over the long term (5 years +). This Fund will invest at least 80% in a portfolio of UK government bonds.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Government Bond",
        "family": "NFU Mutual Unit Managers Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 33599112
    },
    "0P0001HO0C.L": {
        "short_name": "Epworth Sovereign Bond Fund for",
        "long_name": "Epworth Sovereign Bond Fund for Charities GBP Income",
        "currency": "GBp",
        "summary": "The Sub-fund seeks to provide income and investment growth exceeding that of the iBoxx Gilt Index (the â\u0080\u009cIndexâ\u0080\u009d) (after allowing for fees) by investing in sovereign bonds that are issued in Pounds Sterling. The Sub-fund invests at least 30%of its portfolio in bonds with fixed coupons issued by the UK Governments (Gilts) but may also invest, or have holdings of bonds (or similar investments) issued or guaranteed by other sovereign states; variation rate and index-linked government securities; and cash (and near cash).",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Government Bond",
        "family": "Epworth Investment Management Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    },
    "0P0001IFIU.L": {
        "short_name": "As Of Priced (Net) UK Conventio",
        "long_name": "As Of Priced (Net) UK Conventional Gilts All Stocks Index Sub-Fund",
        "currency": "GBp",
        "summary": "The Sub-Fund aims to track the FTSEÂ® Actuaries UK Conventional Gilts All Stocks Index, or its recognised replacement or equivalent (the \"Index\").",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Government Bond",
        "family": "Managed Pension Funds Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    }
}