{
    "0P000069HA.L": {
        "short_name": "BOCHK Sterling Income",
        "long_name": "BOCHK Sterling Income",
        "currency": "GBp",
        "summary": "BOCHK Sterling Income Fund seeks to generate stable income and capture medium to long-term capital appreciation opportunities through investing primarily in equities listed and quoted in the United Kingdom and fixed income securities which are mainly denominated in sterling. Fixed income securities purchased will predominantly be bond investments. Investment may include floating rate notes, callable bonds, convertible bonds, gilt-edged securities (i.e. British and Irish government securities) and other debt or fixed income instruments.",
        "manager_name": "Seton  Lor",
        "manager_bio": "Lor is a portfolio manager at MFC Global, his employer since 2000. Prior to joining MFC Global, he was Director of Balanced Investments at AXA Investment Managers in Hong Kong, where he served from 1996 to 2000.",
        "category": "GBP Diversified Bond",
        "family": "BOCI-Prudential Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 2178942
    },
    "0P00006OWF.L": {
        "short_name": "Sarasin Sterling Bond Fund (Cla",
        "long_name": "Sarasin Sterling Bond Fund (Class I Inc)",
        "currency": "GBp",
        "summary": "We seek to provide income greater than that achieved in the ICE BoAML UK Gilts All Stocks Index and to provide an overall return higher than the Fundâ\u0080\u0099s benchmark of 50% ICE BOAML UK Gilts All Stocks Index and 50% ICE BOAML UK Sterling non-Gilt Index over a period of 3 to 5 years. We invest at least 80% of the Fund in bonds that are priced in Sterling, issued by the UK government or companies.",
        "manager_name": "John  Godley",
        "manager_bio": "A Sarasin Investment Management employee since June 2002, John started his career in fixed income in 1986. He was previously a portfolio manager and credit analyst for GE Insurance Holdings, a part of GE Capital. During the 1990s he worked for Guardian Royal Exchange, where he became Head of Global Fixed Income with responsibility for portfolios totaling Â£5bn.",
        "category": "GBP Diversified Bond",
        "family": "Sarasin Investment Funds Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 116142424
    },
    "0P00009XXC.L": {
        "short_name": "Aegon International UK Fixed In",
        "long_name": "Aegon International UK Fixed Interest A",
        "currency": "GBp",
        "summary": "This fund aims to provide long-term capital growth by investing in a diversified blend of mainly investment grade corporate bonds and government bonds although it may also invest in high yield bonds, overseas bonds, emerging market debt and cash. It invests 45% of its assets in the UK Corporate Bond Fund, 35% in the UK Government Bond Fund and the remaining 20% in the Scottish Equitable Kames Core Plus fund.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    },
    "0P0000D1T1.L": {
        "short_name": "EdenTree Amity Sterling Bond Fu",
        "long_name": "EdenTree Responsible and Sustainable Sterling Bond Fund A Income",
        "currency": "GBp",
        "summary": "The Fund aims to generate a regular level of income payable quarterly.\nThe EdenTree Responsible and Sustainable Sterling Bond Fund seeks to invest in a highly diversified portfolio of Government bonds and good quality fixed-interest securities issued by companies which make a positive contribution to society and the environment through sustainable and socially responsible practices. The Fundâ\u0080\u0099s investments will be at least 80% denominated in Sterling but the Fund may invest in other currency bonds and securities that the Manager thinks appropriate to meet the investment objective.",
        "manager_name": "Chris  Hiorns",
        "manager_bio": "Chris graduated in 1995, with an MSc in Economics from University College London. He joined EdenTree in 1996 as a Research Assistant and took over the management of the Amity European Fund in 2007. Chris has been a CFA Charterholder since 2004.",
        "category": "GBP Diversified Bond",
        "family": "EdenTree Investment Management Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 276080256
    },
    "0P0000THD6.L": {
        "short_name": "DMS Kleinwort Hambros Fixed Inc",
        "long_name": "WS Kleinwort Hambros Fixed Income A Inc",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is primarily to produce returns by way of income with the possibility of capital growth with low volatility through a diversified portfolio of predominantly bonds and Government securities. \nThe investment manager may also choose to hold equities, collective investment schemes, cash, money market instruments and other instruments listed on a Recognised Investment Exchange (such as, but not limited to, warrants, convertible preference shares and structured products) as the investment manager may consider appropriate in achieving the overall objective of the fund. The fund may use derivatives for investment purposes as well as for efficient portfolio management.",
        "manager_name": "Management  Team",
        "manager_bio": "Team Managed",
        "category": "GBP Diversified Bond",
        "family": "Waystone Management (UK) Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 36804172
    },
    "0P0000THD7.L": {
        "short_name": "DMS Kleinwort Hambros Fixed Inc",
        "long_name": "WS Kleinwort Hambros Fixed Income A Acc",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is primarily to produce returns by way of income with the possibility of capital growth with low volatility through a diversified portfolio of predominantly bonds and Government securities. \nThe investment manager may also choose to hold equities, collective investment schemes, cash, money market instruments and other instruments listed on a Recognised Investment Exchange (such as, but not limited to, warrants, convertible preference shares and structured products) as the investment manager may consider appropriate in achieving the overall objective of the fund. The fund may use derivatives for investment purposes as well as for efficient portfolio management.",
        "manager_name": "Management  Team",
        "manager_bio": "Team Managed",
        "category": "GBP Diversified Bond",
        "family": "Waystone Management (UK) Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 36804172
    },
    "0P0000U2A3.L": {
        "short_name": "Mercer Sterling Nominal LDI Bon",
        "long_name": "Mercer Sterling Nominal LDI Bond Fund Class M-4 &#194;&#163; Acc",
        "currency": "GBp",
        "summary": "The investment objective if the Fund is to provide real income and capital growth to investors.\nThe Investment Manager proposes to achieve this objective bu investing primarily in Sterling Denominated Nominal Bonds. These Bonds may be zero coupon or coupon bearing. The Fund may also invest in other types of freely transferable debt securities denominated in Sterling, depending on market conditions.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "Mercer Global Investments Management Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 218304880
    },
    "0P0000U2A4.L": {
        "short_name": "Mercer Sterling Nominal LDI Bon",
        "long_name": "Mercer Sterling Nominal LDI Bond Fund Class M-7 &#194;&#163; Acc",
        "currency": "GBp",
        "summary": "The investment objective if the Fund is to provide real income and capital growth to investors.\nThe Investment Manager proposes to achieve this objective bu investing primarily in Sterling Denominated Nominal Bonds. These Bonds may be zero coupon or coupon bearing. The Fund may also invest in other types of freely transferable debt securities denominated in Sterling, depending on market conditions.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "Mercer Global Investments Management Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 218304880
    },
    "0P00011IEK.L": {
        "short_name": "CGWM Bond Fund A GBP (Distribut",
        "long_name": "CGWM Bond Fund A GBP (Distribution)",
        "currency": "GBp",
        "summary": "To generate positive total returns from a diversified portfolio of fixed interest instruments and Collective Investment Schemes (â\u0080\u009cCISâ\u0080\u009d).bonds and other debt securities and collective investment schemes (CIS).",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "Canaccord Genuity Management Company Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    },
    "0P000124C2.L": {
        "short_name": "Resolution (Irl) UK Fixed Incom",
        "long_name": "Resolution (Irl) UK Fixed Income Fund Class C GBP Income",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-Fund is to achieve income and capital gains, through investment in a portfolio of fixed income securities.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "UBS AG London Branch",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 117506808
    },
    "0P00014AQJ.L": {
        "short_name": "Resolution (Irl) UK Fixed Incom",
        "long_name": "Resolution (Irl) UK Fixed Income Fund Class C GBP Accumulation",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-Fund is to achieve income and capital gains, through investment in a portfolio of fixed income securities.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "UBS AG London Branch",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 117506808
    },
    "0P00015EZ4.L": {
        "short_name": "Resolution (Irl) UK Fixed Incom",
        "long_name": "Resolution (Irl) UK Fixed Income Fund Class E GBP Accumulation",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-Fund is to achieve income and capital gains, through investment in a portfolio of fixed income securities.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "UBS AG London Branch",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 117506808
    },
    "0P00015HGZ.L": {
        "short_name": "Resolution (Irl) UK Fixed Incom",
        "long_name": "Resolution (Irl) UK Fixed Income Fund Class E GBP Income",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-Fund is to achieve income and capital gains, through investment in a portfolio of fixed income securities.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "UBS AG London Branch",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 117506808
    },
    "0P00016X7I.L": {
        "short_name": "Fidelity Sterling Core Plus Red",
        "long_name": "Fidelity Sterling Core Plus Reduced Duration Bond Fund Gross Acc",
        "currency": "GBp",
        "summary": "The Fund aims to deliver an income with the potential to increase the value of your investment. The Fund will be at least 85% invested in the Fidelity Institutional Sterling Core Plus Bond Fund, but it is the intention through the use of derivatives to adjust interest rate risk to a target of 5 years, such that the returns achieved may be substantially different to those of the Fidelity Institutional Sterling Core Plus Bond Fund.",
        "manager_name": "Ian  Fishwick",
        "manager_bio": "Sajiv is a fund manager on the fixed income team and has ten years experience working in global government and credit markets. He was appointed in 2000 and is responsible for managing corporate bond portfolios for institutional and retail clients.prior to joining RLAM he worked for Fuji Bank. Sajiv graduated from the University of Hull in 1991 in Economic & Social History and holds a MA in Modern International Studies from the University of Leeds.",
        "category": "GBP Diversified Bond",
        "family": "FIL Investment Services (UK) Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 85767088
    },
    "0P0001BGWX.L": {
        "short_name": "Smith & Williamson Fixed Intere",
        "long_name": "Smith &amp; Williamson Fixed Interest Fund B GBP Accumulated",
        "currency": "GBp",
        "summary": "The objective of the Trust is to achieve a high income through investing primarily in bonds. The Manager may invest in transferable securities, including warrants, in UK and other exchanges as well as collective investment schemes, money market instruments, deposits and cash and near cash.\nThe Managerâ\u0080\u0099s policy in order to achieve the Trustâ\u0080\u0099s objective will be to invest primarily in corporate bonds, other fixed interest securities (including gilts and permanent interest bearing securities (â\u0080\u0098PIBsâ\u0080\u0099) without geographic restriction and preference shares in UK and European Community companies. The Manager may also apply for new issues. The Manager may, from time to time, invest more than 35% of the property of the Trust in Government and other public securities issued by one issuer.",
        "manager_name": "Ian  Kenny",
        "manager_bio": "Ian Kenny joined Smith &Williamson in 1997 as an institutional fund accountant. He qualified as a Chartered Certified Accountant in 2001 and thereafter assumed fund management responsibilities for a variety of institutional funds. Ian is lead manager for the newly launched Medium-Dated Corporate Bond Fund and lead manager of the Short-Dated Corporate Bond Fund, in addition, Ian has assisted Chris Lynas with the management of the Smith & Williamson Fixed Interest Trust since 2006. Ian graduated from the University of Reading with a BSc in Human Geography and an MSc in International Business & Economic Development. Ian qualified as a Chartered Certified Accountant in 2001, and is a Fellow of the Association of Chartered Certified Accountants, a Member of the Chartered Institute for Securities and Investment and is a CFA Charterholder.",
        "category": "GBP Diversified Bond",
        "family": "Smith&Williamson Fund Administration Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 94053464
    },
    "0P0001DXPM.L": {
        "short_name": "SUTL Cazenove Charity Bond A In",
        "long_name": "SUTL Cazenove Charity Bond A Income",
        "currency": "GBp",
        "summary": "The Fund aims to provide income by investing in fixed and floating rate securities. The Fund aims to provide a total return in excess of the FTSE A Government All Stocks (Gross Total Return) index (after fees have been deducted) over rolling five-year periods but this cannot be guaranteed and your capital is at risk. The Fund is actively managed and invests at least 80% of its assets in fixed and floating rate securities denominated in sterling (or in other currencies and hedged back into sterling) issued by governments, government agencies, supra-nationals and companies worldwide.",
        "manager_name": "Alex  Smitten",
        "manager_bio": "Alexander joined Cazenove in 2000 and is a member of the fixed income team and in charge of establishing the UK economic outlook and investment policy for segregated and pooled gilt portfolios. He manages the Cazenove Sterling Bond Fund and The Income Trust for Charities, a UK authorised Common Investment Fund. While at Intercapital, Alex set up the gilt agency broking desk. With a degree in Banking and International Finance from the City University he has 19 years of investment experience.",
        "category": "GBP Diversified Bond",
        "family": "Schroder Unit Trusts Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 10999742
    },
    "0P0001IA7U.L": {
        "short_name": "M&G Charibond Charities Fixed I",
        "long_name": "M&amp;G Charibond Charities Fixed Interest Fund GBP Acc",
        "currency": "GBp",
        "summary": "The Fund aims to provide a higher total return (the combination of capital growth and income), net of the Ongoing Charge Figure, than that of a composite index comprising one half Gilts and one half UK corporate bonds, over any five-year period.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "M&G Securities Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 118386320
    },
    "0P0001IA7W.L": {
        "short_name": "M&G Charibond Charities Fixed I",
        "long_name": "M&amp;G Charibond Charities Fixed Interest Fund GBP Inc",
        "currency": "GBp",
        "summary": "The Fund aims to provide a higher total return (the combination of capital growth and income), net of the Ongoing Charge Figure, than that of a composite index comprising one half Gilts and one half UK corporate bonds, over any five-year period.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Diversified Bond",
        "family": "M&G Securities Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 118386320
    }
}