{
    "0P00000GUD.L": {
        "short_name": "VT Seneca Diversified Growth Fu",
        "long_name": "VT Seneca Diversified Growth Fund A Accumulation",
        "currency": "GBp",
        "summary": "The investment objective of VT Seneca Diversified Growth Fund is to achieve long-term capital growth by investing in a balanced and well diversified portfolio of UK and International equities, and fixed interest securities including government and corporate bonds. Investments will also be made in regulated collective investment schemes, money markets and cash deposits to provide further diversification to the Sub-fund in accordance with applicable regulations.",
        "manager_name": "Mark  Wright",
        "manager_bio": "Mark is responsible for UK equity research across Seneca IMâ\u0080\u0099s investment mandates. He is also the lead fund manager of the CF Seneca Diversified Growth Fund. \nMark started his career at Seneca IM after graduating from University of York with a BSc degree in Economics. He is a CFA Charter holder and an accredited member of the CFA Institute. \nMark has been the Co-Fund Manager on the CF Seneca Diversified Growth Fund since 12 July 2011, taking over as lead manager in February 2016.",
        "category": "GBP Aggressive Allocation",
        "family": "Valu-Trac Investment Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00000QZF.L": {
        "short_name": "BNY Mellon Investment Funds - N",
        "long_name": "BNY Mellon Investment Funds - Newton Multi-Asset Growth Fund Sterling Income",
        "currency": "GBp",
        "summary": "The Sub-Fund aims to achieve capital growth and income over the long term (5 years or more). The Sub-Fund is actively managed and invests at least 75% of the portfolio in UK and international securities across a range of global asset classes including, without limitation, equities (company shares), fixed income (bonds), infrastructure, renewable energy, property, commodities and near cash.",
        "manager_name": "Christopher  Metcalfe",
        "manager_bio": "Christopher joined Newton in 2006 from Schroder Investment Management and has over 21 years of investment experience. He is Head of the Core UK Equity Team and manages UK Equity funds for a number of major institutional clients.",
        "category": "GBP Aggressive Allocation",
        "family": "BNY Mellon Fund Managers Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00001AY1.L": {
        "short_name": "Smith & Williamson Wye Investme",
        "long_name": "Smith &amp; Williamson Wye Investment Fund",
        "currency": "GBp",
        "summary": "The objective is to achieve long term growth of capital through investment in stocks (which may include fixed interest stocks), shares, collective investment schemes and investment trust companies in the UK and overseas stock markets, and through investment in cash and money market instruments throughout the world.",
        "manager_name": "David  Ravenscroft",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Smith & Williamson Inv Mgt (Ireland) Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00001EUT.L": {
        "short_name": "Stan Life Intl Deferred Distrib",
        "long_name": "Stan Life Intl Deferred Distribution Fund Life",
        "currency": "GBp",
        "summary": "The aim of the fund is to provide both an income and capital growth. This means that the fund manager must balance investment between assets chosen primarily for income and those chosen primarily for capital growth. The assets are primarily held in UK bonds and equities, property and, as appropriate, index linked stocks. The fund is &#39;deferred&#39; as all income and dividends are automatically reinvested - giving investors the flexibility to control withdrawals to best suit their tax position.",
        "manager_name": "Jacqueline  Lowe",
        "manager_bio": "After graduating with Accounting & Financial Studies from Heriot Watt in 1988, Jacquie joined Standard Life, working first with Sales and Marketing. When in the Investment Department, she became Assistant Investment Manager for Retail Funds and Investment Manager in 1995. With the start of Standard Life Investment, in 1998, Jacquie was the Investment Director. In 2001, she was the Investment Director of Mutual Funds and Fund Manager for the Global Advantage Fund and Managed Fund.",
        "category": "GBP Aggressive Allocation",
        "family": "Standard Life Assurance Company",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P000024AH.L": {
        "short_name": "Rathbone Sussex Growth Fund",
        "long_name": "Rathbone Sussex Growth Fund",
        "currency": "GBp",
        "summary": "The fund seeks to achieve long term capital growth through investment in a mix of UK and overseas securities, which may include equities, convertibles, loan stock, money market instruments, deposits, warrants, collective investment schemes and other investments to the extent that each is permitted by the FSA Regulations.",
        "manager_name": "Clive  Hexton",
        "manager_bio": "Clive Hexton is an investment director with 25 years experience in private client fund management. He has been actively involved in the management of portfolios for larger complex family structures, including the management of bespoke family funds, and accordingly is also a director of Rathbone Unit Trust Management (Rathbone Funds).\nClive is a member of the Rathbone Investment Management Investment Executive Committee. He is also on Rathbones' committees for Strategic Asset Allocation and UK Stock Selection. He is a Chartered Fellow of the Chartered Institute for Securities and Investment and has an honours degree from London University.\nClive joined Rathbones in 2000, prior to which he spent 15 years at Kleinwort Benson. Throughout this period he was actively involved in the research and stock selection process, was deputy chief investment officer and in his earlier years was research manager for the oil, gas, utility and pharmaceutical sectors. Prior to his career in the financial services, Clive served a three year commission with the Royal Regiment of Fusiliers.",
        "category": "GBP Aggressive Allocation",
        "family": "Rathbone Unit Trust Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P000025OC.L": {
        "short_name": "Rathbone Sussex Income Fund",
        "long_name": "Rathbone Sussex Income Fund",
        "currency": "GBp",
        "summary": "The fund seeks to achieve an increasing income return through investment in a mix of UK and overseas securities, which may include equities, convertibles, loan stock, money market instruments, deposits, warrants, collective investment schemes and other investments to the extent that each is permitted by the FSA Regulations",
        "manager_name": "Clive  Hexton",
        "manager_bio": "Clive Hexton is an investment director with 25 years experience in private client fund management. He has been actively involved in the management of portfolios for larger complex family structures, including the management of bespoke family funds, and accordingly is also a director of Rathbone Unit Trust Management (Rathbone Funds).\nClive is a member of the Rathbone Investment Management Investment Executive Committee. He is also on Rathbones' committees for Strategic Asset Allocation and UK Stock Selection. He is a Chartered Fellow of the Chartered Institute for Securities and Investment and has an honours degree from London University.\nClive joined Rathbones in 2000, prior to which he spent 15 years at Kleinwort Benson. Throughout this period he was actively involved in the research and stock selection process, was deputy chief investment officer and in his earlier years was research manager for the oil, gas, utility and pharmaceutical sectors. Prior to his career in the financial services, Clive served a three year commission with the Royal Regiment of Fusiliers.",
        "category": "GBP Aggressive Allocation",
        "family": "Rathbone Unit Trust Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00002AG9.L": {
        "short_name": "The New Floco Inc",
        "long_name": "The New Floco Inc",
        "currency": "GBp",
        "summary": "The investment objective of the Company is to provide long term capital growth. \nThe Company aims to achieve the objective by investing directly and indirectly in equities, bonds (government and corporate), money-market instruments, deposits, warrants, cash and near cash. At least 80% of its total assets will be invested in other collective investment schemes (which may include those managed or operated by the ACD or its associates). The Company can invest in any industry, sector or geographic location worldwide. \nDerivatives may be used but only for Efficient Portfolio Management (EPM) purposes. \nThe investment portfolio of the Company may, at times, be concentrated.",
        "manager_name": "William  Franklin",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Waverton Investment Management Ltd. (Link)",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00002ALB.L": {
        "short_name": "The Navajo Fund GBP Acc",
        "long_name": "The Navajo Fund GBP Acc",
        "currency": "GBp",
        "summary": "The investment objective of the Company is to provide long term capital growth principally through a diversified holding of securities. \nThe Company will aim to generate superior investment returns through investing in what it believes to be quality companies worldwide. There will be no particular emphasis on any geographic region or industry sector. From time to time, the Company may invest in collective investment schemes, money market instruments, deposits, warrants, cash and near cash, derivatives and forward transactions and other investments to the extent that each is permitted by the Regulations.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Link Fund Solutions Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00002B3Y.L": {
        "short_name": "The New Jaguar Inc",
        "long_name": "The New Jaguar Inc",
        "currency": "GBp",
        "summary": "The investment objective of the Company is to provide long term capital growth through a diversifi ed holding of securities. \nThe Company will aim to generate superior investment returns through investing in what it believes to be quality companies worldwide. There will be no particular emphasis on any industry sector. The Company may also invest in collective investment schemes, money market instruments, warrants, deposits, cash and/or near cash, derivatives and forward transactions and other investments to the extent that each is permitted by the Regulations.",
        "manager_name": "William  Franklin",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Waverton Investment Management Ltd. (Link)",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00002B4X.L": {
        "short_name": "The Navajo Fund GBP Inc",
        "long_name": "The Navajo Fund GBP Inc",
        "currency": "GBp",
        "summary": "The investment objective of the Company is to provide long term capital growth principally through a diversified holding of securities. \nThe Company will aim to generate superior investment returns through investing in what it believes to be quality companies worldwide. There will be no particular emphasis on any geographic region or industry sector. From time to time, the Company may invest in collective investment schemes, money market instruments, deposits, warrants, cash and near cash, derivatives and forward transactions and other investments to the extent that each is permitted by the Regulations.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Link Fund Solutions Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00008N9Y.L": {
        "short_name": "Courtiers Total Return Growth A",
        "long_name": "Courtiers Total Return Growth Acc",
        "currency": "GBp",
        "summary": "The investment objective of the COURTIERS Total Return Growth Fund is to achieve the optimal total return within the boundaries of the Fundâ\u0080\u0099s risk profile. The risk profile will be above average. \nThe Fund will be exposed to the returns from assets such as equities, real estate, commodities, bonds and cash instruments. At the ACDâ\u0080\u0099s discretion, the Fund may be weighted to any one or more of these asset classes, provided such weighting is consistent with the Fundâ\u0080\u0099s objectives and does not violate the risk restrictions.",
        "manager_name": "Caroline  Shaw",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "COURTIERS Asset Management Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00008T42.L": {
        "short_name": "DMS Sequel Global Target Income",
        "long_name": "DMS Sequel Global Target Income Strategy Fund A GBP Acc",
        "currency": "GBp",
        "summary": "To provide capital returns over the medium to long term. To invest at least 51% in a broad range of a equities (ie shares in companies) on a global basis. The Fund may also invest in: Fixed interest securities (which are investments similar to loans paying a fixed or variable rate of interest over a period of time) including government and corporate bonds; money market instruments (which are a type of security where cash can be deposited for short periods) and cash deposits; regulated funds (which are investment schemes where investorsâ\u0080\u0099 money is pooled to buy investments); and warrants (a security which allows the holder to buy the stock of the issuing company at a fixed price until the expiry date). In times of market downturns the Fund may reduce the amount of equities it holds below 51% and increase its investment in the other investments mentioned above (apart from warrants), with the intention of reducing Fund losses.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Seneca Investment Managers Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00008T47.L": {
        "short_name": "DMS Sequel Global Target Income",
        "long_name": "DMS Sequel Global Target Income Strategy Fund B GBP Acc",
        "currency": "GBp",
        "summary": "To provide capital returns over the medium to long term. To invest at least 51% in a broad range of a equities (ie shares in companies) on a global basis. The Fund may also invest in: Fixed interest securities (which are investments similar to loans paying a fixed or variable rate of interest over a period of time) including government and corporate bonds; money market instruments (which are a type of security where cash can be deposited for short periods) and cash deposits; regulated funds (which are investment schemes where investorsâ\u0080\u0099 money is pooled to buy investments); and warrants (a security which allows the holder to buy the stock of the issuing company at a fixed price until the expiry date). In times of market downturns the Fund may reduce the amount of equities it holds below 51% and increase its investment in the other investments mentioned above (apart from warrants), with the intention of reducing Fund losses.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Seneca Investment Managers Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00009P1W.L": {
        "short_name": "LF Waverton Portfolio Fund A In",
        "long_name": "LF Waverton Portfolio Fund A Income",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-fund is to provide long term (in excess of 5 years) capital growth.\nThe Sub-fund aims to achieve its objective by investing in a portfolio of global, including UK, equities and equity related securities (including ordinary and preference shares, global depositary receipts and American depositary receipts). The Sub-fundâ\u0080\u0099s equity exposure (both direct and indirect) will be between 60% and 90%, typically 75%.",
        "manager_name": "Algernon  Percy",
        "manager_bio": "Algernon Percy graduated from Christ Church, Oxford, in 1990 with a degree in History. He worked in the Private Client department of Mercury Asset Management (later Merrill Lynch Investment Managers) for nine years, before joining this company in 2003. He became Head of Private Clients, and then in 2013 was appointed Managing Director. He sits on the Asset Allocation Committee and the Portfolio Review Committee; he also runs the Portfolio Fund.",
        "category": "GBP Aggressive Allocation",
        "family": "Link Fund Solutions Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00009P2G.L": {
        "short_name": "LF Waverton Portfolio Fund B In",
        "long_name": "LF Waverton Portfolio Fund B Income",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-fund is to provide long term (in excess of 5 years) capital growth.\nThe Sub-fund aims to achieve its objective by investing in a portfolio of global, including UK, equities and equity related securities (including ordinary and preference shares, global depositary receipts and American depositary receipts). The Sub-fundâ\u0080\u0099s equity exposure (both direct and indirect) will be between 60% and 90%, typically 75%.",
        "manager_name": "Algernon  Percy",
        "manager_bio": "Algernon Percy graduated from Christ Church, Oxford, in 1990 with a degree in History. He worked in the Private Client department of Mercury Asset Management (later Merrill Lynch Investment Managers) for nine years, before joining this company in 2003. He became Head of Private Clients, and then in 2013 was appointed Managing Director. He sits on the Asset Allocation Committee and the Portfolio Review Committee; he also runs the Portfolio Fund.",
        "category": "GBP Aggressive Allocation",
        "family": "Link Fund Solutions Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00009XWD.L": {
        "short_name": "Aegon International Newton Bala",
        "long_name": "Aegon International Newton Balanced Managed A",
        "currency": "GBp",
        "summary": "To achieve long-term capital growth and income by investing in a mixed portfolio of company shares and bonds. The policy of the fund is to gain exposure to a range of asset classes including, without limitation, equities, fixed income, property, commodities, cash, near cash and deposits. Exposure to these asset classes will be achieved through investment in transferable securities, approved money market instruments, warrants, derivative instruments, forward transactions and collective investment schemes.",
        "manager_name": "Iain  Stewart",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000G2E5.L": {
        "short_name": "Quilter Investors Cirilium Dyna",
        "long_name": "Quilter Investors Cirilium Dynamic Portfolio R",
        "currency": "GBp",
        "summary": "To achieve capital growth over a period of five years or more through investment markets both in the UK and overseas.\nThe portfolio is broadly diversified across asset classes, with exposure to equities between 50-90% and with volatility of between 12 and 16%*.\n* The volatility range is a target, based on long term actuarial assumptions and the Fund is managed to stay within this range most of the time. The volatility range is regularly reviewed and may change from time to time due to changes in these assumptions.\n\nThe performance comparator for the Fund is the IA Flexible Investment Sector average performance. This Sector is considered appropriate on the basis that the Fundâ\u0080\u0099s equity exposure over time is expected to be similar to that of the average fund in this Sector. The Fund is not managed with reference to a benchmark.",
        "manager_name": "Paul  Craig",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000HP5X.L": {
        "short_name": "Aegon International 40:60 Core ",
        "long_name": "Aegon International 40:60 Core Ptfl V1",
        "currency": "GBp",
        "summary": "This fund gives investors the opportunity to invest in a blend of fixed interest (bonds) and UK equities (shares) to give them the balance between risk and reward that best suits them. It aims for attractive returns with less volatility (fluctuations in value) than a pure equity fund; and invests 40% in the UK Fixed Interest fund managed by Kames Capital and 60% in the UK Index Tracker fund managed by BlackRock. With its higher equity content, this fund is considered the highest risk of our Core portfolio funds. This fund is now closed to new investors.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000I5PS.L": {
        "short_name": "Hartford Diamond Cauts MagdPort",
        "long_name": "Hartford Diamond Cauts MagdPort",
        "currency": "GBp",
        "summary": "For investors who seek capital growth and income and are prepared to accept the risks associated with some equity investment.",
        "manager_name": "Ibbotson  Associates",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Hawthorn Life Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000I5S6.L": {
        "short_name": "Hartford Diamond Rising IncPort",
        "long_name": "Hartford Diamond Rising IncPort",
        "currency": "GBp",
        "summary": "For investors who seek income and some capital growth to keep pace with inflation, but need to limit risk.",
        "manager_name": "Ibbotson  Associates",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Hawthorn Life Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000IWCI.L": {
        "short_name": "LF Purisima EAFE Tot Ret PCGBI",
        "long_name": "LF Purisima EAFE Tot Ret PCGBInc",
        "currency": "GBp",
        "summary": "The objective of the Fund is to provide capital and income growth through diversified investment in European, Australian and Far Eastern equities and fixed interest securities. There may be occasions when the Fund also holds collective investment schemes, warrants, derivative instruments, cash and money market instruments. In order to reduce risk by diversification, the Fund will generally maintain an exposure to all major markets included in the relevant benchmark. The Fund may use derivatives and forward transactions for hedging purposes but may, on giving shareholders 60 daysâ\u0080\u0099 notice, use derivatives and forward transactions for investment purposes, which may make the portfolio composition of the Fund highly volatile.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Fisher Investments, Inc. (Link)",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000J2JC.L": {
        "short_name": "OHP Fund",
        "long_name": "OHP Fund",
        "currency": "GBp",
        "summary": "The fund aims to provide a balance between capital growth and income over the long term. \nTo achieve this objective the fund will invest in a range of transferable securities such as equities, fi xed interest, collective investment schemes (both regulated and unregulated), deposits, derivatives and money market instruments, cash and gold covering markets throughout the world.",
        "manager_name": "Algernon  Percy",
        "manager_bio": "Algernon Percy graduated from Christ Church, Oxford, in 1990 with a degree in History. He worked in the Private Client department of Mercury Asset Management (later Merrill Lynch Investment Managers) for nine years, before joining this company in 2003. He became Head of Private Clients, and then in 2013 was appointed Managing Director. He sits on the Asset Allocation Committee and the Portfolio Review Committee; he also runs the Portfolio Fund.",
        "category": "GBP Aggressive Allocation",
        "family": "Waverton Investment Management Ltd. (Link)",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000K7V4.L": {
        "short_name": "Pityoulish Investments Fund Inc",
        "long_name": "Pityoulish Investments Fund Income Shares",
        "currency": "GBp",
        "summary": "The objective of the Company is to protect and grow the capital and income streams from a diversified portfolio of equities, bonds and both regulated and unregulated collective investment schemes. There may be occasions when the Investment Adviser chooses to hold a significant proportion of the Company in cash and near cash instruments. There will be no emphasis placed on any particular economic, industrial or geographical sector. The Company may also invest in other transferable securities, warrants, money markets instruments, deposits and other permitted investments.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Smith&Williamson Fund Administration Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000KAK2.L": {
        "short_name": "Harcourt HSBC World Selection D",
        "long_name": "Harcourt HSBC World Selection Dynamic Portfolio Int",
        "currency": "GBp",
        "summary": "The objective of this Fund is to provide medium to long term capital growth. \nThe Fund will invest primarily in collective investment schemes that in turn invest in equities and bonds predominantly in the UK with some overseas exposure. The Authorised Corporate Director may also invest at its discretion in other transferable securities, money market instruments, deposits as well as cash and near cash.",
        "manager_name": "Jonathan Samson Rebak",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Aviva Life International Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000KF85.L": {
        "short_name": "Harcourt HSBC World Selection D",
        "long_name": "Harcourt HSBC World Selection Dynamic Portfolio Int S4",
        "currency": "GBp",
        "summary": "The objective of this Fund is to provide medium to long term capital growth. \nThe Fund will invest primarily in collective investment schemes that in turn invest in equities and bonds predominantly in the UK with some overseas exposure. The Authorised Corporate Director may also invest at its discretion in other transferable securities, money market instruments, deposits as well as cash and near cash.",
        "manager_name": "Jonathan Samson Rebak",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Aviva Life International Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000KNBX.L": {
        "short_name": "Quilter Investors Cirilium Dyna",
        "long_name": "Quilter Investors Cirilium Dynamic Portfolio A",
        "currency": "GBp",
        "summary": "To achieve capital growth over a period of five years or more through investment markets both in the UK and overseas.\nThe portfolio is broadly diversified across asset classes, with exposure to equities between 50-90% and with volatility of between 12 and 16%*.\n* The volatility range is a target, based on long term actuarial assumptions and the Fund is managed to stay within this range most of the time. The volatility range is regularly reviewed and may change from time to time due to changes in these assumptions.\n\nThe performance comparator for the Fund is the IA Flexible Investment Sector average performance. This Sector is considered appropriate on the basis that the Fundâ\u0080\u0099s equity exposure over time is expected to be similar to that of the average fund in this Sector. The Fund is not managed with reference to a benchmark.",
        "manager_name": "Paul  Craig",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000KO41.L": {
        "short_name": "LF Purisima EAFE Total Rtn A P",
        "long_name": "LF Purisima EAFE Total Rtn A PCG",
        "currency": "GBp",
        "summary": "The objective of the Fund is to provide capital and income growth through diversified investment in European, Australian and Far Eastern equities and fixed interest securities. There may be occasions when the Fund also holds collective investment schemes, warrants, derivative instruments, cash and money market instruments. In order to reduce risk by diversification, the Fund will generally maintain an exposure to all major markets included in the relevant benchmark. The Fund may use derivatives and forward transactions for hedging purposes but may, on giving shareholders 60 daysâ\u0080\u0099 notice, use derivatives and forward transactions for investment purposes, which may make the portfolio composition of the Fund highly volatile.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Fisher Investments, Inc. (Link)",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000KO4E.L": {
        "short_name": "The Monoux",
        "long_name": "The Monoux",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to provide a balance of capital growth and income by investing in a range of asset classes in any or all geographic areas of the world and in any or all economic sectors. \nThe investment policy of the Fund is to invest, to the extent permitted by the Regulations, in individual transferable securities, collective investment schemes (regulated and unregulated), money market instruments and/or deposits. The Fund may from time to time invest principally in any one or more of such asset classes.",
        "manager_name": "William  Franklin",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Waverton Investment Management Ltd. (Link)",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000KWF0.L": {
        "short_name": "EF Brunswick Growth Portfolio B",
        "long_name": "EF Brunswick Growth Portfolio B Acc GBP",
        "currency": "GBp",
        "summary": "The aim of the Fund is to achieve a total positive return in all market conditions, over a rolling period of 3 years, through investment in a diversified portfolio of transferable securities (including investment trusts), collective investment schemes, warrants, cash or near cash, deposits, money market instruments and derivatives. Capital invested in the Fund is at risk and there is no guarantee that the investment objective will be met over a 3 year rolling period or in respect of any other period. It is generally expected that the volatility of the Fund, will be similar to that of the broad global equity markets. However while volatility is taken into consideration, priority will always be given to achieving a total positive return in all market conditions.",
        "manager_name": "Nigel  Breakell",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "WAY Fund Managers Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000MNKB.L": {
        "short_name": "Aegon International Growth Sele",
        "long_name": "Aegon International Growth Select Ptfl B",
        "currency": "GBp",
        "summary": "\"The fund aims to invest in the appropriate mix of asset classes, types and sizes of company, regions and fund managers to deliver\nthe balance between risk and reward that youâ\u0080\u0099re comfortable with and that meets your objectives.\nTo make sure it meets its objective, weâ\u0080\u0099ve employed OBSR to help us select and manage the blend of funds on an ongoing basis.\nThis means that the underlying funds and weightings may change.\"",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000MQ28.L": {
        "short_name": "SVS Brown Shipley Dynamic Fund ",
        "long_name": "SVS Brown Shipley Dynamic Fund I Acc",
        "currency": "GBp",
        "summary": "A Dynamic multi asset portfolio seeking investment returns, via a focus on higher risk, growth based assets. It is expected that the Fund will have exposure to UK and international equities with a lesser exposure to alternatives and cash. Exposure will be achieved mainly through collective investment Schemes (including open-ended investment companies and unit trusts) and other permitted investments that have a similar diversified character, such as exchange traded funds. The Fund may also invest, at the ACDâ\u0080\u0099s discretion, in transferable securities, structured products, money market instruments, cash and near cash and deposits. Use may also be made of stock lending, borrowing, cash holdings, derivatives for hedging and other efficient portfolio management techniques permitted in the COLL Sourcebook.",
        "manager_name": "Simon  Nicholas",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Smith & Williamson Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000N4F6.L": {
        "short_name": "Aegon International Newton Stoc",
        "long_name": "Aegon International Newton Stockmarket Managed B",
        "currency": "GBp",
        "summary": "The SL Newton Multi-Asset Growth Life Fund invests primarily in the Newton Multi-Asset Growth Fund. The aim of the Newton Multi-Asset Growth Fund is summarised below. The objective of the Sub-Fund is to achieve capital growth and income from a portfolio of UK and international securities including without limitation, equities, fixed income, property, commodities, cash, near cash and deposits. Derivatives may be used for efficient portfolio management only.",
        "manager_name": "Christopher  Metcalfe",
        "manager_bio": "Nick Clay is an investment manager and member of the global equity team at Newton, which he joined in 2000. He graduated in 1990 with a degree in Economics and Philosophy. He joined the Sun Alliance UK Equity Team. After gaining his professional qualifications to become a member of the Institute of Investment Management and Research, Nick moved to Provident Mutual Investment Managers. He joined Newton in November 2000 as a Specialist Benchmark Manager. Prior to joining Newton, Nick acquired a range of experience as a UK equities manager at Morley Fund Management and as an analyst at Sun Alliance. Nick attended Leeds University and is an associate member of the UK Society of Investment Professionals.",
        "category": "GBP Aggressive Allocation",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000N4H5.L": {
        "short_name": "Aegon International External Ba",
        "long_name": "Aegon International External Balanced Collection B",
        "currency": "GBp",
        "summary": "This collection gives you the opportunity to invest in a mix of funds from five of our investment managers, currently Baillie Gifford, BlackRock, Newton, GLG Partners and UBS Global Asset Management. Each of these underlying funds invests in a diversified portfolio of equities (shares of companies) as well as fixed interest securities (bonds) and cash with the aim of providing consistent long-term capital growth. The funds are permitted to hold between 40% and 85% in equities, but must hold at least 50% in established market currencies (US dollar, sterling and the euro), of which 25% must be in sterling.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000N7BD.L": {
        "short_name": "DMS Verbatim Portfolio 7 Fund A",
        "long_name": "DMS Verbatim Portfolio 7 Fund A Acc",
        "currency": "GBp",
        "summary": "The fund aims to achieve capital growth over the medium to long term by using a risk based growth investment strategy.",
        "manager_name": "Craig  Heron",
        "manager_bio": "Craig has 12 yearsâ\u0080\u0099 experience in the investment management industry, having previously been Head of Managed Funds Research at Edinburgh Fund Managers. Prior to this he was Senior Research Analyst at Greig Middleton & Co. Craigâ\u0080\u0099s main focus is on fund analysis and manager selection. The New Star fund of funds team was voted 'Best Multi-Manager Group 2008' at the Professional Adviser Awards. He is a CFA charterholder.",
        "category": "GBP Aggressive Allocation",
        "family": "DMS Investment Management Services (UK) Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000N7BE.L": {
        "short_name": "DMS Verbatim Portfolio 7 Fund B",
        "long_name": "DMS Verbatim Portfolio 7 Fund B Acc",
        "currency": "GBp",
        "summary": "The fund aims to achieve capital growth over the medium to long term by using a risk based growth investment strategy.",
        "manager_name": "Craig  Heron",
        "manager_bio": "Craig has 12 yearsâ\u0080\u0099 experience in the investment management industry, having previously been Head of Managed Funds Research at Edinburgh Fund Managers. Prior to this he was Senior Research Analyst at Greig Middleton & Co. Craigâ\u0080\u0099s main focus is on fund analysis and manager selection. The New Star fund of funds team was voted 'Best Multi-Manager Group 2008' at the Professional Adviser Awards. He is a CFA charterholder.",
        "category": "GBP Aggressive Allocation",
        "family": "DMS Investment Management Services (UK) Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000U20U.L": {
        "short_name": "Jupiter Merlin Growth I Acc",
        "long_name": "Jupiter Merlin Growth I Acc",
        "currency": "GBp",
        "summary": "At least 70% of the Fund is invested in collective investment schemes. Up to 30% of the Fund may be invested in other assets, including shares of companies, cash and near cash.",
        "manager_name": "John  Chatfeild-Roberts",
        "manager_bio": "John Chatfeild-Roberts joined Jupiter in March 2001, and he was appointed Chief Investment Officer of Jupiter Asset Management in February 2010. He established the award-winning Jupiter Merlin fund of funds team, in which he jointly manages the Jupiter Merlin Portfolios with Peter Lawery and Algy Smith-Maxwell, who both came with him from Lazard Asset Management. John is also Lead Manager of the Jupiter Global Managed Fund (Unit Trust). John gained a degree in Economics from Durham University and the RMA Sandhurst. After a Short Service Commission in the Army, John started his fund management career at Henderson's (1990-1995), followed by a move to Lazard Asset Management, where he set up a successful multi-manager team from scratch. John is a Fellow of the Securities Institute.",
        "category": "GBP Aggressive Allocation",
        "family": "Jupiter Unit Trust Managers Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000WM6D.L": {
        "short_name": "TM Levitas A Fund Accumulation",
        "long_name": "TM Levitas A Fund Accumulation",
        "currency": "GBp",
        "summary": "The fundâ\u0080\u0099s objective is to provide capital growth over the longer term.The value of any investment can fall as well as rise and is not guaranteed â\u0080\u0093 you may get back less than you payin.For further information on the TM Levitas A Fund, please refer to the fund manager fact sheet, link providedbelow.TM Levitas A Fund Factsheet (http://documents.financialexpress.net/Literature/20907491.pdf)",
        "manager_name": "Jonathan  Webster-Smith",
        "manager_bio": "Jonathan Webster-Smith is a director of Brooks Macdonald Asset Management Ltd. He is head of Managed Portfolio Service and also an investment manager with responsibility for managing discretionary client portfolios and pension funds. Jonathan joined Brooks Macdonald in 2001 as a graduate trainee and gained his Financial Planning Certificate (FPC) and Advanced Financial Planning Certificate (AFPC). He is also an affiliate member of The Chartered Institute for Securities & Investment (CISI) having completed the Diploma in 2005/6. Jonathanâ\u0080\u0099s specialist research sector is: Fixed Interest.",
        "category": "GBP Aggressive Allocation",
        "family": "Thesis Unit Trust Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000WUPY.L": {
        "short_name": "ASI MyFolio Multi-Manager V Fun",
        "long_name": "ASI MyFolio Multi-Manager V Fund Platform 1 Accumulation",
        "currency": "GBp",
        "summary": "To generate growth over the long term (5 years or more) while being managed to a defined level of risk. The fund is part of the MyFolio Multi-Manager range, which offers five funds with different expected combinations of investment risk and return. This fund is risk level V, which aims to be the highest risk fund in this range.",
        "manager_name": "Bambos  Hambi",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Aberdeen Standard Fund Managers Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000X19B.L": {
        "short_name": "ACUMEN Portfolio 6 Accumulation",
        "long_name": "ACUMEN Portfolio 6 Accumulation",
        "currency": "GBp",
        "summary": "The aim of the Fund is to increase in value, over a minimum of 5 years, by investing in a range of asset classes and global markets. The Fund will do this through a combination of capital growth, which is profit on investments held, and income, which is money paid out of investments such as dividends from shares and interest from bonds. The Fund aims to outperform the Market Composite Benchmark over any 3 year period, with income reinvested, after any charges have been taken out of the Fund. However, there is no certainty this will be achieved.\nPerformance Target: The Market Composite Benchmark for the ACUMEN Portfolio 6 Fund is comprised as follows: \nâ\u0080¢22% Bonds - \nï\u0082°Bloomberg Barclays Global Aggregate Bond GBP Hedged Index (20%)\nï\u0082°Bloomberg Barclays Global High Yield Bond GBP Hedged Index (2%)\nâ\u0080¢73% Equities - \nï\u0082°MSCI World Index GBP Hedged (63%) \nï\u0082°MSCI Emerging Markets Investable Market Index (10%)\nâ\u0080¢Cash (5%) - \nï\u0082°Sterling Overnight Index Average (5%)",
        "manager_name": "Christopher  Peel",
        "manager_bio": "Christopher Peel is the Chief Investment Ocer of Tavistock Wealth. Christopher has more than\n27 yearsâ\u0080\u0099 experience in financial markets, working with both traditional and alternative asset managers, having held senior positions at both Citibank and Salomon Brothers. Christopher holds a B.A. degree in Economics from Colorado College.",
        "category": "GBP Aggressive Allocation",
        "family": "Investment Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000X4CG.L": {
        "short_name": "Rathbone Multi Asset Enhanced G",
        "long_name": "Rathbone Multi Asset Enhanced Growth Portfolio S-Class Accumulation",
        "currency": "GBp",
        "summary": "The objective of the fund is to deliver a greater total return than the CPI measure of inflation + 5%, after fees, over any rolling five year period by investing with our Liquidity Equity Diversifiers (LED) framework. The fund aims to deliver this return with no more volatility than that of the FTSE Developed stock market index. To meet the objective, the fund manager will invest globally in government and corporate bonds with no restriction on their credit quality, equities, collective investment schemes and structured products. Up to 10% of the fund can be invested directly in contingent convertible bonds. Derivatives may be used by the fund for investment purposes, efficient portfolio management and hedging. The use of derivatives for investment purposes may increase the volatility of the fundâ\u0080\u0099s Net Asset Value and may increase its risk profile.",
        "manager_name": "David  Coombs",
        "manager_bio": "David Coombs is head of multi-asset investments and joined Rathbones in 2007. He is a member of our Investment Executive Committee as well as the Strategic Asset Allocation Committee . David is responsible for developing our investment propositions for national financial advisory firms and networks. He is the lead manager for the Rathbones Multi-Asset Portfolio Funds and the offshore Luxembourg-based Sicavs. \nDavid previously worked at Barings for almost 20 years where he managed institutional and private clients via pooled vehicles and segregated accounts. He joined Barings in 1988 from Hambros, where he managed multi-manager portfolios for private clients.",
        "category": "GBP Aggressive Allocation",
        "family": "Rathbone Unit Trust Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000X9VO.L": {
        "short_name": "Jupiter Merlin Growth Portfolio",
        "long_name": "Jupiter Merlin Growth Portfolio Fund I Inc",
        "currency": "GBp",
        "summary": "At least 70% of the Fund is invested in collective investment schemes. Up to 30% of the Fund may be invested in other assets, including shares of companies, cash and near cash.",
        "manager_name": "John  Chatfeild-Roberts",
        "manager_bio": "John Chatfeild-Roberts joined Jupiter in March 2001, and he was appointed Chief Investment Officer of Jupiter Asset Management in February 2010. He established the award-winning Jupiter Merlin fund of funds team, in which he jointly manages the Jupiter Merlin Portfolios with Peter Lawery and Algy Smith-Maxwell, who both came with him from Lazard Asset Management. John is also Lead Manager of the Jupiter Global Managed Fund (Unit Trust). John gained a degree in Economics from Durham University and the RMA Sandhurst. After a Short Service Commission in the Army, John started his fund management career at Henderson's (1990-1995), followed by a move to Lazard Asset Management, where he set up a successful multi-manager team from scratch. John is a Fellow of the Securities Institute.",
        "category": "GBP Aggressive Allocation",
        "family": "Jupiter Unit Trust Managers Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000XHAR.L": {
        "short_name": "TM Levitas A Fund B Net Acc",
        "long_name": "TM Levitas A Fund B Net Acc",
        "currency": "GBp",
        "summary": "The fundâ\u0080\u0099s objective is to provide capital growth over the longer term.The value of any investment can fall as well as rise and is not guaranteed â\u0080\u0093 you may get back less than you payin.For further information on the TM Levitas A Fund, please refer to the fund manager fact sheet, link providedbelow.TM Levitas A Fund Factsheet (http://documents.financialexpress.net/Literature/20907491.pdf)",
        "manager_name": "Jonathan  Webster-Smith",
        "manager_bio": "Jonathan Webster-Smith is a director of Brooks Macdonald Asset Management Ltd. He is head of Managed Portfolio Service and also an investment manager with responsibility for managing discretionary client portfolios and pension funds. Jonathan joined Brooks Macdonald in 2001 as a graduate trainee and gained his Financial Planning Certificate (FPC) and Advanced Financial Planning Certificate (AFPC). He is also an affiliate member of The Chartered Institute for Securities & Investment (CISI) having completed the Diploma in 2005/6. Jonathanâ\u0080\u0099s specialist research sector is: Fixed Interest.",
        "category": "GBP Aggressive Allocation",
        "family": "Thesis Unit Trust Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0000XXKM.L": {
        "short_name": "Quilter Investors Cirilium Dyna",
        "long_name": "Quilter Investors Cirilium Dynamic Passive Portfolio R",
        "currency": "GBp",
        "summary": "To achieve capital growth over a period of five years or more through investment in markets both in the UK and overseas.\nThe portfolio is broadly diversified across asset classes, with exposure to equities between 50-90% and with volatility of between 12 and 16%*.\n* The volatility range is a target, based on long term actuarial assumptions and the Fund is managed to stay within this range most of the time. The volatility range is regularly reviewed and may change from time to time due to changes in these assumptions.",
        "manager_name": "Paul  Craig",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00015MGN.L": {
        "short_name": "Embark Horizon Multi-Asset Fund",
        "long_name": "Embark Horizon Multi-Asset Fund V Z Acc",
        "currency": "GBp",
        "summary": "The Sub-fund aims to grow investment through a combination of income and capital growth over the very long term, which for this Sub-fund means more than 15 years. The Sub-fund will aim to achieve this objective, whilst remaining within Risk Profile 1. The Sub-fundâ\u0080\u0099s potential gains and losses will be constrained by the aim of keeping within the asset allocation embodied in the Risk Profile.",
        "manager_name": "Alex  Lyle",
        "manager_bio": "Alex Lyle is Head of Managed Funds, EMEA. In this role he takes responsibility for a large number of the companyâ\u0080\u0099s managed funds, is a member of the Asset Allocation Committee and is a key investment contact between the company and a number of its major clients. He joined the company in 1994 and was appointed Joint Head of UK / European Equity teams in 1999 and became Head of Managed Funds in 2003. Alex started his career at Hambros Bankâ\u0080\u0099sÂ¹ Unit Trust Division, which was acquired by Allied DunbarÂ² in 1981 and subsequently became part of Threadneedle Asset Management Limited in 1994. He managed UK equity portfolios for more than 20 years. He has a degree in Geography from Oxford University.",
        "category": "GBP Aggressive Allocation",
        "family": "Embark Investments Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00015MGP.L": {
        "short_name": "Embark Horizon Multi-Asset Fund",
        "long_name": "Embark Horizon Multi-Asset Fund V Z Inc",
        "currency": "GBp",
        "summary": "The Sub-fund aims to grow investment through a combination of income and capital growth over the very long term, which for this Sub-fund means more than 15 years. The Sub-fund will aim to achieve this objective, whilst remaining within Risk Profile 1. The Sub-fundâ\u0080\u0099s potential gains and losses will be constrained by the aim of keeping within the asset allocation embodied in the Risk Profile.",
        "manager_name": "Alex  Lyle",
        "manager_bio": "Alex Lyle is Head of Managed Funds, EMEA. In this role he takes responsibility for a large number of the companyâ\u0080\u0099s managed funds, is a member of the Asset Allocation Committee and is a key investment contact between the company and a number of its major clients. He joined the company in 1994 and was appointed Joint Head of UK / European Equity teams in 1999 and became Head of Managed Funds in 2003. Alex started his career at Hambros Bankâ\u0080\u0099sÂ¹ Unit Trust Division, which was acquired by Allied DunbarÂ² in 1981 and subsequently became part of Threadneedle Asset Management Limited in 1994. He managed UK equity portfolios for more than 20 years. He has a degree in Geography from Oxford University.",
        "category": "GBP Aggressive Allocation",
        "family": "Embark Investments Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00015XT8.L": {
        "short_name": "SVS True Potential Investments ",
        "long_name": "SVS True Potential Investments Growth 1 A GBP Accumulation",
        "currency": "GBp",
        "summary": "The Fund aims to generate capital growth with some income by investing directly and indirectly in a selected range of investments in the UK and around the world, which may include:\nâ\u0080¢ shares\nâ\u0080¢ bonds issued by companies, governments and other organisations.\nThe Fund may also make other investments, including:\nâ\u0080¢ cash, deposits and money market instruments\nâ\u0080¢ other investment funds\nâ\u0080¢ warrants.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Smith & Williamson Fd Adm Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00015XT9.L": {
        "short_name": "SVS True Potential Investments ",
        "long_name": "SVS True Potential Investments Growth 2 A GBP Income",
        "currency": "GBp",
        "summary": "The Fund aims to provide capital growth by investing directly and indirectly in the UK and around the world predominately in other investment funds which invest in shares of companies.\nThe Fund may use derivatives for Efficient Portfolio Management (EPM), i.e. to protect against market or currency movements, to reduce costs, or to earn income or capital.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Smith & Williamson Fd Adm Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00015YC4.L": {
        "short_name": "IFSL Brooks Macdonald Strategic",
        "long_name": "IFSL Brooks Macdonald Strategic Growth Class B GBP Accumulation",
        "currency": "GBp",
        "summary": "The fund seeks to provide long-term capital growth, primarily through investment in global equity markets.",
        "manager_name": "Jonathan  Webster-Smith",
        "manager_bio": "Jonathan Webster-Smith is a director of Brooks Macdonald Asset Management Ltd. He is head of Managed Portfolio Service and also an investment manager with responsibility for managing discretionary client portfolios and pension funds. Jonathan joined Brooks Macdonald in 2001 as a graduate trainee and gained his Financial Planning Certificate (FPC) and Advanced Financial Planning Certificate (AFPC). He is also an affiliate member of The Chartered Institute for Securities & Investment (CISI) having completed the Diploma in 2005/6. Jonathanâ\u0080\u0099s specialist research sector is: Fixed Interest.",
        "category": "GBP Aggressive Allocation",
        "family": "Investment Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00017OV2.L": {
        "short_name": "MGTS IBOSS 6 X Acc",
        "long_name": "MGTS IBOSS 6 X Acc",
        "currency": "GBp",
        "summary": "None",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Margetts Fund Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00017OV3.L": {
        "short_name": "MGTS IBOSS 6 R Acc",
        "long_name": "MGTS IBOSS 6 R Acc",
        "currency": "GBp",
        "summary": "None",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Margetts Fund Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00018DBU.L": {
        "short_name": "FP Luceo 6 A Acc",
        "long_name": "FP Luceo 6 A Acc",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to achieve long term capital growth.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "FP Luceo Investments",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00018DBV.L": {
        "short_name": "FP Luceo 7 A Acc",
        "long_name": "FP Luceo 7 A Acc",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to achieve long term capital growth.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "FP Luceo Investments",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001A3GS.L": {
        "short_name": "Quilter Investors Cirilium Adve",
        "long_name": "Quilter Investors Cirilium Adventurous Portfolio R",
        "currency": "GBp",
        "summary": "To achieve capital growth over a period of five years or more through investment in markets both in the UK and overseas.\nThe portfolio is broadly diversified across asset classes, with exposure to equities between 55-100% and with volatility of between 15 and 19%*.\n* The volatility range is a target, based on long term actuarial assumptions and the Fund is managed to stay within this range most of the time. The volatility range is regularly reviewed and may change from time to time due to changes in these assumptions.\n\nThe performance comparator for the Fund is the IA Flexible Investment Sector average performance. This Sector is considered appropriate on the basis that the Fundâ\u0080\u0099s equity exposure over time is expected to be similar to that of the average fund in this Sector. The Fund is not managed with reference to a benchmark.",
        "manager_name": "Rasmus  Soegaard",
        "manager_bio": "Paul Craig is manager of the Cirilium Multi-Asset Portfolios, and a member of multi-asset team at Old Mutual Global Investors (OMGI). He joined OMGI in December 2014 from Henderson, following OMGIâ\u0080\u0099s acquisition of Cirilium. Paul has managed the Cirilium portfolios since 2009, taking on these responsibilities shortly after the inception of the range. He has also acted as a non-executive director of two investment trusts. Paul brings with him 25 years of experience in the asset management industry. He started his financial career at Chase Manhattan International before moving to LTCB International as a traderâ\u0080\u0099s assistant and Exeter Investment Group as a fund of funds manager. He then went on to New Star, before joining Henderson when it acquired New Star.",
        "category": "GBP Aggressive Allocation",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001AIOF.L": {
        "short_name": "Quilter Investors Creation Adve",
        "long_name": "Quilter Investors Creation Adventurous Portfolio R (GBP) Accumulation",
        "currency": "GBp",
        "summary": "To achieve capital growth over a period of five years or more. The portfolio is diversified across asset classes, with exposure to equities between 80% and 100% and with volatility of between 15% and 19%.* The Fund invests in a diversified portfolio of assets. It is expected that exposure will be to equities, fixed income, cash, money market instruments and currencies. Such investment will be made either directly by investing in such instruments or indirectly by investing in collective investment schemes.",
        "manager_name": "Anthony  Gillham",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Quilter Investors Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001AJUV.L": {
        "short_name": "VT Chelsea Managed Aggressive G",
        "long_name": "VT Chelsea Managed Aggressive Growth Fund A GBP Net Acc",
        "currency": "GBp",
        "summary": "The investment objective of the VT Chelsea Managed Aggressive Growth fund is to generate capital growth over the long term. The Fund is expected to follow an aggressive strategy with investment primarily through collective investment schemes (including those managed or operated by the ACD) so as to provide a high level of exposure (up to 100%) to higher risk assets such as equities and lower level of exposure to lower risk assets such as cash. There may also be indirect exposure to commodities (and from time to time other alternative asset classes such as infrastructure) through other collective investment schemes (including exchange traded funds).",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Valu-Trac Investment Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001AJUW.L": {
        "short_name": "VT Chelsea Managed Balanced Gro",
        "long_name": "VT Chelsea Managed Balanced Growth Fund A GBP Net Acc",
        "currency": "GBp",
        "summary": "The investment objective of the VT Chelsea Managed Balanced Growth fund is to generate capital growth over the long term. The Fund is expected to follow a balanced strategy with investment primarily through collective investment schemes (including those managed or operated by the ACD) so as to provide a balance between exposure to asset classes which the ACD considers to lower risk (including cash, fixed income and assets following absolute return strategies) and those which it considers to be higher risk assets classes (typically equities). The Fund may also invest directly in transferable securities, equities, bonds, money market instruments, cash and near cash, with commodity exposure being achieved through other collective investment schemes (including exchange traded funds).",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Valu-Trac Investment Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001BC6F.L": {
        "short_name": "FP Mattioli Woods Funds ICVC - ",
        "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Growth Fund B GBP Income",
        "currency": "GBp",
        "summary": "The Fund aims to achieve long-term capital growth by the active management of a global multi-asset portfolio.",
        "manager_name": "Ian  Goodchild",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "FundRock Partners Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001BC6G.L": {
        "short_name": "FP Mattioli Woods Funds ICVC - ",
        "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Growth Fund C GBP Income",
        "currency": "GBp",
        "summary": "The Fund aims to achieve long-term capital growth by the active management of a global multi-asset portfolio.",
        "manager_name": "Ian  Goodchild",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "FundRock Partners Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001BC6H.L": {
        "short_name": "FP Mattioli Woods Funds ICVC - ",
        "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Growth Fund D GBP Income",
        "currency": "GBp",
        "summary": "The Fund aims to achieve long-term capital growth by the active management of a global multi-asset portfolio.",
        "manager_name": "Ian  Goodchild",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "FundRock Partners Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001BC6I.L": {
        "short_name": "FP Mattioli Woods Funds ICVC - ",
        "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Growth Fund E GBP Income",
        "currency": "GBp",
        "summary": "The Fund aims to achieve long-term capital growth by the active management of a global multi-asset portfolio.",
        "manager_name": "Ian  Goodchild",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "FundRock Partners Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001D3JS.L": {
        "short_name": "Fidelity Investment Funds IV - ",
        "long_name": "Fidelity Investment Funds IV - Fidelity Multi Asset Open Adventurous Fund Lovewell Blake FP Acc",
        "currency": "GBp",
        "summary": "This Fund targets an average annual return of 6.5% after the deduction of ongoing fund charges, over a typical market cycle of 5-7 years. The return target assumes the deduction of the ongoing charges figure (OCF) on the W share class. There is no guarantee that the target will be achieved by the Fund. The Fund provides global exposure to a diversified range of assets by investing at least 70% into funds (including those operated by Fidelity). Asset allocation exposure of the Fund will be actively managed subject to it remaining within the following parameters in all market conditions: 60-100% equity, 0-40% debt instruments (which may include investment grade bonds, sub-investment grade bonds and emerging market debt), 0-30% commodities, 0-20% cash and 0-30% alternatives (such as infrastructure securities and Real Estate Investment Trusts).",
        "manager_name": "Chris  Forgan",
        "manager_bio": "Chris Forgan is a Portfolio Manager at Fidelity Multi Asset. Chris has 20 years of investment experience and joined Fidelity in 2017. Prior to joining Fidelity, Chris was a Portfolio Manager at Henderson Global Investors, in their Multi Asset team focusing on their income fund range. \n\nPreviously Chris worked as an analyst at Henderson Global Investors, a senior performance analyst at First State Investments and began his career on the trading floor at Deutsche Morgan Grenfell. Chris has an BA (Hons) Marketing Administration from the University of Northumbria.",
        "category": "GBP Aggressive Allocation",
        "family": "FIL Investment Services (UK) Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001DC84.L": {
        "short_name": "SVS True Potential Aggressive F",
        "long_name": "SVS True Potential Aggressive Fund Class A Accumulation",
        "currency": "GBp",
        "summary": "None",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Smith & Williamson Fd Adm Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001DXPJ.L": {
        "short_name": "SUTL Cazenove Charity Multi-Ass",
        "long_name": "SUTL Cazenove Charity Multi-Asset A Accumulation",
        "currency": "GBp",
        "summary": "The Fund invests directly, or indirectly through collective investment schemes, exchange traded funds, real estate investment trusts or closed ended funds, in equity and equity related securities, fixed and floating rate securities and alternative assets worldwide. Alternative assets may include funds that use absolute return strategies or funds that invest directly in real estate or indirectly in commodities. As the Fund is index-unconstrained it is managed without reference to an index.",
        "manager_name": "Tom  Montagu-Pollock",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Schroder Unit Trusts Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001EX71.L": {
        "short_name": "The Chapel Funds ICVC-Unity Fun",
        "long_name": "The Chapel Funds ICVC-Unity Fund Class A GBP Accumulation",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to achieve long-term capital growth and income.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "T. Bailey Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001EX72.L": {
        "short_name": "The Chapel Funds ICVC-Unity Fun",
        "long_name": "The Chapel Funds ICVC-Unity Fund Class A GBP Income",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to achieve long-term capital growth and income.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "T. Bailey Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001H9YY.L": {
        "short_name": "TB Opie Street Growth Fund Clas",
        "long_name": "TB Opie Street Growth Fund Class R GBP Accumulation",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to provide long-term (5 â\u0080\u0093 10 years) growth through a combination of capital and income.",
        "manager_name": "Edward  Sidgwick",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "T. Bailey Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001H9YZ.L": {
        "short_name": "TB Opie Street Growth Fund Clas",
        "long_name": "TB Opie Street Growth Fund Class R GBP Income",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to provide long-term (5 â\u0080\u0093 10 years) growth through a combination of capital and income.",
        "manager_name": "Edward  Sidgwick",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "T. Bailey Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001HPJ8.L": {
        "short_name": "Margetts Venture Strategy Fund ",
        "long_name": "Margetts Venture Strategy Fund S GBP Acc",
        "currency": "GBp",
        "summary": "The objective of the Margetts Venture Strategy Fund is to provide long term capital growth by investment in any economic sector in any geographic area in UCITS schemes and non-UCITS schemes (that have the same characteristics and restrictions as a UCITS scheme) with particular attention being focused on Far Eastern and Emerging Market Funds.",
        "manager_name": "Toby  Ricketts",
        "manager_bio": "Since joining Margetts in 1994, Toby is now widely regarded as a leading professional in collective investment management, being regularly profiled in the major financial publications and national press. Toby is the lead manager of the award winning Risk Rated fund of funds and is recognised by Citywire as one of the top10 most consistent managers over the past decade. Toby is the Chief Executive Officer of Margetts Fund Management Ltd.",
        "category": "GBP Aggressive Allocation",
        "family": "Margetts Fund Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001IILR.L": {
        "short_name": "Schroders Personal Wealth Adven",
        "long_name": "Schroders Personal Wealth Adventurous Solution G GBP Accumulation",
        "currency": "GBp",
        "summary": "To provide capital growth through investment in collective investment schemes.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Scottish Widows Schroder Personal Wealth (ACD) Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001IUVS.L": {
        "short_name": "VT Tatton Oak ICVC - VT Tatton ",
        "long_name": "VT Tatton Oak ICVC - VT Tatton Blended Aggressive Fund Institutional Accumulation",
        "currency": "GBp",
        "summary": "The objective of the Fund is to maximise potential total return (i.e. capital and income growth).\nOne measure of risk is the proportion invested in the riskiest assets, such as equities. For this Fund, over the long-term (8 years), it is expected that the proportion of the Fund exposed to equities will be approximately 90%.\nIn the shorter term, this weighting may be adjusted tactically as economic and market conditions dictate while not deviating by more than Â±12.5%.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Aggressive Allocation",
        "family": "Valu-Trac Investment Management Limited",
        "exchange": "LSE",
        "market": "gb_market"
    }
}