{
    "0P00000VEY.L": {
        "short_name": "Scottish Widows UK Index Linked",
        "long_name": "Scottish Widows UK Index Linked Tracker I Acc",
        "currency": "GBp",
        "summary": "The fund seeks to track the performance of the UK index-linked gilt market as represented by the FTSE Actuaries UK Index-Linked Gilts All Stocks Index (the â\u0080\u009cIndexâ\u0080\u009d), before deduction of fees, by investing in UK Government Index- Linked bonds (gilts). The Fund aims to invest in all of the stocks within the Index. This is often referred to as a â\u0080\u0098full replicationâ\u0080\u0099 approach.",
        "manager_name": "Graeme  Caughey",
        "manager_bio": "1994 â\u0080\u0093 2001 Investment ManagerUK GiltsMorley Fund Management",
        "category": "GBP Inflation-Linked Bond",
        "family": "Scottish Widows Unit Trust Managers Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 9296221
    },
    "0P00000VRY.L": {
        "short_name": "Scottish Widows UK Index Linked",
        "long_name": "Scottish Widows UK Index Linked Tracker I Inc",
        "currency": "GBp",
        "summary": "The fund seeks to track the performance of the UK index-linked gilt market as represented by the FTSE Actuaries UK Index-Linked Gilts All Stocks Index (the â\u0080\u009cIndexâ\u0080\u009d), before deduction of fees, by investing in UK Government Index- Linked bonds (gilts). The Fund aims to invest in all of the stocks within the Index. This is often referred to as a â\u0080\u0098full replicationâ\u0080\u0099 approach.",
        "manager_name": "Graeme  Caughey",
        "manager_bio": "1994 â\u0080\u0093 2001 Investment ManagerUK GiltsMorley Fund Management",
        "category": "GBP Inflation-Linked Bond",
        "family": "Scottish Widows Unit Trust Managers Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 9296221
    },
    "0P0000SHY6.L": {
        "short_name": "Vanguard U.K. Inflation-Linked ",
        "long_name": "Vanguard U.K. Inflation-Linked Gilt Index Fund GBP Inc",
        "currency": "GBp",
        "summary": "The Vanguard U.K. Inflation-Linked Gilt Index Fund (the â\u0080\u009cFundâ\u0080\u009d) seeks to track the performance of the Bloomberg Barclays U.K. Government Inflation-Linked Float Adjusted Bond Index (the â\u0080\u009cIndexâ\u0080\u009d). The Fund is a passive fund with an indexing investment strategy designed to track the performance of the Index as closely as possible by investing in a representative sample of the component bonds of the Index.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Inflation-Linked Bond",
        "family": "Vanguard Investments UK, Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 2070723584
    },
    "0P000197XC.L": {
        "short_name": "Threadneedle UK Index Linked Fu",
        "long_name": "Threadneedle UK Index Linked Fund Institutional Income GBP",
        "currency": "GBp",
        "summary": "The Fund aims to provide income with the prospect of some capital growth over the long term. It looks to outperform the FTSE Actuaries UK IndexLinked Gilts All Stocks Index over rolling 3-year periods, after the deduction of charges. The Fund is actively managed, and invests at least 80% of its assets in indexlinked bonds issued by the UK government (index-linked gilts).",
        "manager_name": "Dave  Chappell",
        "manager_bio": "Dave Chappell is a Senior Portfolio Manager in the interest rate and currency team within Fixed Income and is at the core of US and UK rate and economic forecasting for the company. Dave manages a broad range of US and UK fixed income mandates for numerous insurance companies. He also manages a number of global government portfolios.\n\nDave joined the company in 1997 when Scudder Investments became part of Threadneedle Asset Management Limited. He joined Scudder Investments as a fixed income dealer, and in 1997 became an Insurance Asset Portfolio Manager.\n\nHe started his career in 1987 at Royal Bank of Scotland as an Operations Supervisor before moving to Irving Trust company as an Operations Manager.",
        "category": "GBP Inflation-Linked Bond",
        "family": "Threadneedle Investment Services Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 54251664
    }
}