{
    "0P0000ZE4Y.L": {
        "short_name": "Mercer Tailored Fixed Income Fu",
        "long_name": "Mercer Tailored Fixed Income Fund B M - 1&#194;&#163; Acc",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-Fund is to provide exposure to a broad range of fixed income securities.",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Flexible Bond",
        "family": "Mercer Global Investments Management Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P00011SMW.L": {
        "short_name": "S&W Saltus Fixed Income Fund I ",
        "long_name": "S&amp;W Saltus Fixed Income Fund I GBP Inc",
        "currency": "GBp",
        "summary": "The objective of the Sub-fund is to generate a return which is the higher of cash (measured by the Bank of England base rate) and inflation (as measured by UK CPI), over a rolling 3 year period. The intention is for the Sub-fund to be invested in bonds and currency predominantly via collective investment schemes. The Sub-fund may also invest in transferable securities and/or credit structured products, and money market instruments all of which will either directly or indirectly have exposure to bonds and currency markets.",
        "manager_name": "David  Cooke",
        "manager_bio": "David co-ordinates the strategy engineering for Global broad market and small capitalisation funds. David joined the company in 1991 and is now Client Services Director and Deputy Chief Investment Officer. David's other responsibilities include strategy engineer for a UK and global account. He is also a member of the Board of AXA Rosenberg Management Ireland Ltd. Mr. Cooke currently serves as a director of a number of companies including Ardmore Sound Ltd as Finance Director (since 1999) and as a consultant to the Investment Manager.David completed his BEng at University College Dublin, and his MBA at the London Business School.",
        "category": "GBP Flexible Bond",
        "family": "Smith & Williamson Fd Adm Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001AKGL.L": {
        "short_name": "ACUMEN Portfolio 3 Acc",
        "long_name": "ACUMEN Portfolio 3 Acc",
        "currency": "GBp",
        "summary": "The aim of the Fund is to increase in value, over a minimum of 5 years, by investing in a range of asset classes and global markets. The Fund will do this through a combination of capital growth, which is profit on investments held, and income, which is money paid out of investments such as dividends from shares and interest from bonds. The Fund aims to outperform the Market Composite Benchmark over any 3 year period, with income reinvested, after any charges have been taken out of the Fund. However, there is no certainty this will be achieved. \nPerformance Target: The Market Composite Benchmark for the ACUMEN Portfolio 3 Fund is comprised as follows: \nâ\u0080¢85% Bonds - \nï\u0082°Bloomberg Barclays Global Aggregate Bond GBP Hedged Index (65%)\nï\u0082°Bloomberg Barclays Global High Yield Bond GBP Hedged Index (20%)\nâ\u0080¢10% Equities - \nï\u0082°MSCI World Index GBP Hedged (8%) \nï\u0082°MSCI Emerging Markets Investable Market Index (2%)\nâ\u0080¢5% Cash - \nï\u0082°Sterling Overnight Index Average (5%)",
        "manager_name": "",
        "manager_bio": "",
        "category": "GBP Flexible Bond",
        "family": "Investment Fund Services Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001HO06.L": {
        "short_name": "Epworth Corporate Bond Fund for",
        "long_name": "Epworth Corporate Bond Fund for Charities GBP Income",
        "currency": "GBp",
        "summary": "The Sub-fund seeks to provide a level of income and investment growth greater than that of the FTSE All World (Â£)(the â\u0080\u009cIndexâ\u0080\u009d) (after allowing for fees) by investing ethically in the shares of Global companies (including indirectly through other funds). The Sub-fund invests predominantly in companies quoted on the Worldâ\u0080\u0099s major stock exchanges and which are not excluded from selection by ethical screening based on Christian principles.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Flexible Bond",
        "family": "Epworth Investment Management Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001HO0E.L": {
        "short_name": "Epworth Corporate Bond Fund for",
        "long_name": "Epworth Corporate Bond Fund for Charities GBP Accumulation",
        "currency": "GBp",
        "summary": "The Sub-fund seeks to provide a level of income and investment growth greater than that of the FTSE All World (Â£)(the â\u0080\u009cIndexâ\u0080\u009d) (after allowing for fees) by investing ethically in the shares of Global companies (including indirectly through other funds). The Sub-fund invests predominantly in companies quoted on the Worldâ\u0080\u0099s major stock exchanges and which are not excluded from selection by ethical screening based on Christian principles.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "GBP Flexible Bond",
        "family": "Epworth Investment Management Ltd",
        "exchange": "LSE",
        "market": "gb_market"
    }
}