{
  "0P00000GNG.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Ltd",
    "long_name": "SVS Brown Shipley Income Fund A Acc",
    "manager_bio": "",
    "manager_name": "Peter  Botham",
    "market": "gb_market",
    "short_name": "SVS Brown Shipley Income Fund A",
    "summary": "A multi asset portfolio seeking investment returns, via a focus on income producing assets. It is expected that the Fund will have exposure to UK equities and fixed interest investments with a lesser exposure to international equities, alternatives and cash. Exposure will be achieved mainly through collective investment Schemes (including open-ended investment companies and unit trusts) and other permitted investments that have a similar diversified character, such as exchange traded funds. The Fund may also invest, at the ACDâs discretion, in transferable securities, structured products, money market instruments, cash and near cash and deposits Use may also be made of stock lending, borrowing, cash holdings, derivatives for hedging and other efficient portfolio management techniques permitted in the COLL Sourcebook.",
    "total_assets": null
  },
  "0P00000GNI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Ltd",
    "long_name": "SVS Brown Shipley Income Fund A Inc",
    "manager_bio": "",
    "manager_name": "Peter  Botham",
    "market": "gb_market",
    "short_name": "SVS Brown Shipley Income Fund A",
    "summary": "A multi asset portfolio seeking investment returns, via a focus on income producing assets. It is expected that the Fund will have exposure to UK equities and fixed interest investments with a lesser exposure to international equities, alternatives and cash. Exposure will be achieved mainly through collective investment Schemes (including open-ended investment companies and unit trusts) and other permitted investments that have a similar diversified character, such as exchange traded funds. The Fund may also invest, at the ACDâs discretion, in transferable securities, structured products, money market instruments, cash and near cash and deposits Use may also be made of stock lending, borrowing, cash holdings, derivatives for hedging and other efficient portfolio management techniques permitted in the COLL Sourcebook.",
    "total_assets": null
  },
  "0P000017QU.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Bentley Reid & Co. (UK) Ltd",
    "long_name": "LF Bentley Sterling Balanced Fund Accumulation",
    "manager_bio": "",
    "manager_name": "Gavin  Roberts",
    "market": "gb_market",
    "short_name": "LF Bentley Sterling Balanced Fu",
    "summary": "The aim of the fund is to provide long term growth from a mixture of capital appreciation and re-invested income through a balanced portfolio of global investments but with an emphasis on UK equity investments. \nThis will be achieved through investment in transferable securities, collective investment schemes, money market instruments and deposits.",
    "total_assets": null
  },
  "0P00001EUS.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Standard Life Assurance Company",
    "long_name": "Stan Life Intl Cautious Managd Fund Life",
    "manager_bio": "After graduating with Accounting & Financial Studies from Heriot Watt in 1988, Jacquie joined Standard Life, working first with Sales and Marketing. When in the Investment Department, she became Assistant Investment Manager for Retail Funds and Investment Manager in 1995. With the start of Standard Life Investment, in 1998, Jacquie was the Investment Director. In 2001, she was the Investment Director of Mutual Funds and Fund Manager for the Global Advantage Fund and Managed Fund.",
    "manager_name": "Jacqueline  Lowe",
    "market": "gb_market",
    "short_name": "Stan Life Intl Cautious Managd ",
    "summary": "The fund is designed for investors who are looking to obtain a broad spread of assets, predominantly invested in equities and fixed interest securities. It is intended to have a lower level of volatility than that offered by the Managed Fund. Central to the decision making process is the focus on change investment philosophy, which combines top down and bottom up insights to identify changes to the key drivers for specific sectors and stocks. Within the overall objective and asset allocation will reflect the House View set by the Global Investment Group.",
    "total_assets": null
  },
  "0P00001RT3.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ruffer LLP (Link)",
    "long_name": "LF Ruffer Total Return Fund I Income",
    "manager_bio": "Started as a research analyst at SLC Asset Management in 1987, where he became Head of Equities in charge of Â£5bn of equity funds. In 1999 moved to HSBC Investment Bank as Head of UK and European Equity Strategy, before joining Ruffer in September 2003. Became a non\n-executive director of JPMorgan European Investment Trust in 2005 and is co-manager of the CF Ruffer Total Return Fund.",
    "manager_name": "Steven  Russell",
    "market": "gb_market",
    "short_name": "LF Ruffer Total Return Fund I I",
    "summary": "The investment objective of CF Ruffer Total Return Fund is to achieve low volatility, positive returns from an actively managed portfolio of different asset classes, including equities, bonds and currencies. \nThe sub-fund may also invest in collective investment schemes, cash, money market instruments, other transferable securities and derivatives and forward transactions and other investments to the extent that each is permitted by the Regulations. Pervading this objective is a fundamental philosophy of capital preservation.",
    "total_assets": null
  },
  "0P0000254P.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "RBS Collective Investment Funds Limited",
    "long_name": "RBS Collective Stakeholder Investment Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "RBS Collective Stakeholder Inve",
    "summary": "To provide capital growth whilst providing a lower risk to capital than investing solely in equities.",
    "total_assets": null
  },
  "0P000025RZ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Premier Portfolio Managers Limited",
    "long_name": "Premier Miton Liberation No. V A accumulation",
    "manager_bio": "David Hambidge joined Premier Miton in December 1987 and specialises in the management of portfolios using collective investment vehicles including OEICs and investment trusts. David has been part of the original investment team that set up Premier Mitonâs original fund of funds in 1995 and was appointed lead manager in 1999, making him one of the most experienced fund of funds managers in the UK.",
    "manager_name": "David  Hambidge",
    "market": "gb_market",
    "short_name": "Premier Liberation No. V Class ",
    "summary": "The objective of the Fund is to provide an income together with capital growth over the long-term, being five years or more, whilst seeking to remain within a defined risk profile with defined volatility parameters which may result in the income and the capital growth from the Fund being constrained. The Investment Adviser will aim to maintain a risk profile classification of 5 as set and monitored by an external third party risk rating company. Five years is also the minimum recommended period for holding shares in this Fund. This does not mean that the Fund will achieve the objective throughout this, or any other, specific time period and there is a risk of loss to the original capital invested.",
    "total_assets": null
  },
  "0P00005ZFA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "T. Bailey Fund Services Limited",
    "long_name": "T. Bailey Dynamic A Income",
    "manager_bio": "Peter has led global fixed income teams at T. Rowe Price, Flemings and JP Morgan. Before joining T. Bailey in 2013 he held senior roles at a fund of hedge funds and Standard Life Investments. Previously he worked with a multi-family office and ran his own investment consultancy business.",
    "manager_name": "Elliot B. Farley",
    "market": "gb_market",
    "short_name": "T. Bailey Dynamic A Income",
    "summary": "The T. Bailey Dynamic Fund aims to outperform the Consumer Prices Index plus 3% per annum, over Rolling Periods of 3 years. Typically, at least 80% of the Fund will be invested in other collective investment vehicles (âfundsâ), including those managed or operated by the Manager and its associates.",
    "total_assets": null
  },
  "0P00008N9W.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "COURTIERS Asset Management Ltd",
    "long_name": "Courtiers Total Return Cautious Risk Acc",
    "manager_bio": "Gary is a CFA Charterholder, a Chartered Fellow of the Chartered Institute for Securities & Investments and an Associate of the Chartered Insurance Institute.\n\nMarried with two sons, aside from asset management, Gary is passionately committed to the development of sport in Reading and Berkshire and is CEO at Rams RFC, a National 1 rugby club that runs five senior menâs sides, a ladies team and a huge junior section.\n\nOutside of his family, business and rugby interests, Gary likes walking his dogs, which he acquired from Battersea Dogs Home & the RSPCA. âGiving a home to rescue dogs has been one of the best experiences of my life â I have solved more problems walking them in the woods and fields than I could ever do sitting at a desk, and irrespective of how Rams have performed on the pitch, or whether markets have done well, or we have lost or made money for our investors, the dogs are still pleased to see me.â.",
    "manager_name": "Gary  Reynolds",
    "market": "gb_market",
    "short_name": "Courtiers Total Return Cautious",
    "summary": "The Courtiers Total Return Cautious Risk Fund seeks to achieve a total return comprised of income and capital growth, over 5 years. The Fund aims to achieve its objective through an actively managed portfolio of different assets held within the Fund. The above time horizon is not a recommendation to sell the investment at the end of that minimum period. There is no guarantee that the Fund will achieve its objective over any particular period or at all.",
    "total_assets": null
  },
  "0P00008OCA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "T. Bailey Fund Services Limited",
    "long_name": "T. Bailey Dynamic A Accumulation",
    "manager_bio": "Peter has led global fixed income teams at T. Rowe Price, Flemings and JP Morgan. Before joining T. Bailey in 2013 he held senior roles at a fund of hedge funds and Standard Life Investments. Previously he worked with a multi-family office and ran his own investment consultancy business.",
    "manager_name": "Elliot B. Farley",
    "market": "gb_market",
    "short_name": "T. Bailey Dynamic A Accumulati",
    "summary": "The T. Bailey Dynamic Fund aims to outperform the Consumer Prices Index plus 3% per annum, over Rolling Periods of 3 years. Typically, at least 80% of the Fund will be invested in other collective investment vehicles (âfundsâ), including those managed or operated by the Manager and its associates.",
    "total_assets": null
  },
  "0P0000A8YA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS Clarion Prudence Portfolio R Acc",
    "manager_bio": "manager of MGTS Frontier Cautious Fund",
    "manager_name": "Matthew  Jealous",
    "market": "gb_market",
    "short_name": "MGTS Clarion Prudence Portfolio",
    "summary": "The objective of the Sub-fund is to provide a balance of capital growth and income over 3 years (investors should also consider this to be the minimum recommended holding period). The Sub-fund will invest a minimum of 70% in regulated collective investment schemes (which may include schemes operated by the Investment Adviser, associates or controllers of the Investment Adviser) in any economic sector and any geographic area, across a wide range of assets. The Subfund may also invest directly (maximum of 30%) in shares, bonds, cash, near cash instruments, investment trusts, real estate investment trusts (REITs) and structured products (which may embed a derivative).",
    "total_assets": null
  },
  "0P0000A8YF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS Clarion Prudence Portfolio R Inc",
    "manager_bio": "manager of MGTS Frontier Cautious Fund",
    "manager_name": "Matthew  Jealous",
    "market": "gb_market",
    "short_name": "MGTS Clarion Prudence Portfolio",
    "summary": "The objective of the Sub-fund is to provide a balance of capital growth and income over 3 years (investors should also consider this to be the minimum recommended holding period). The Sub-fund will invest a minimum of 70% in regulated collective investment schemes (which may include schemes operated by the Investment Adviser, associates or controllers of the Investment Adviser) in any economic sector and any geographic area, across a wide range of assets. The Subfund may also invest directly (maximum of 30%) in shares, bonds, cash, near cash instruments, investment trusts, real estate investment trusts (REITs) and structured products (which may embed a derivative).",
    "total_assets": null
  },
  "0P0000G281.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Omnis Investments Limited",
    "long_name": "Omnis Multi-Manager Cautious B Acc",
    "manager_bio": "Colin is a fund manager on the multi-manager team at Octopus. Prior to joining Octopus in 2008 he held roles at Killik & Co., Barclays Wealth and Morley Fund management. His most recent focus has been on equity risk management and multi-manager risk monitoring. Colin has over 13 years' experience in manager research and portfolio/fund management. Colin holds an MSc in International Securities, Investment and Banking from the ICMA Centre at Reading University. He is a Chartered Financial Analyst charterholder and a Fellow of the Securities Institute",
    "manager_name": "Colin  Lunnon",
    "market": "gb_market",
    "short_name": "Omnis Multi-Manager Cautious B ",
    "summary": "To achieve capital growth. It is expected that exposure to cash, cash equivalents and fixed income investments will make up the majority of the Fundâs assets. However, investments will not be confined to any particular sector. exposure will be achieved primarily through investment in collective investment schemes. The Fund may also invest in transferable securities, money market instruments, warrants and deposits. use may also be made of stock lending, temporary borrowing and cash holdings. Derivatives may be used for the purposes of hedging and efficient portfolio management. Other information: we carry out investorsâ requests to buy, sell or switch, at midday on each working day (which excludes UK public holidays). If we receive a request after midday, we deal with it on the next working day.",
    "total_assets": null
  },
  "0P0000G2E7.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Quilter Investors Limited",
    "long_name": "Quilter Investors Cirilium Balanced Portfolio R",
    "manager_bio": "Paul is manager of the Cirilium and Cirilium Passive portfolio ranges. He joined the business in December 2014 from Henderson Global Investors, following the acquisition of Cirilium. Paul has managed the Cirilium portfolios since 2009, taking on these responsibilities shortly after the inception of the original range. He has more than 25 years of asset management experience and has also acted as a non-executive director of four investment trusts.",
    "manager_name": "Paul  Craig",
    "market": "gb_market",
    "short_name": "Quilter Investors Cirilium Bala",
    "summary": "To achieve capital growth over a period of five years or more through investment markets both in the UK and overseas.\nThe portfolio is broadly diversified across asset classes, with exposure to equities between 20-60% and with volatility of between 6 and 10%*.\n* The volatility range is a target, based on long term actuarial assumptions and the Fund is managed to stay within this range most of the time. The volatility range is regularly reviewed and may change from time to time due to changes in these assumptions.\n\nThe performance comparator for the Fund is the IA Mixed Investment 20-60% Shares Sector average performance. This Sector is considered appropriate on the basis that the Fundâs equity exposure over time is expected to be similar to that of the average fund in this Sector. The Fund is not managed with reference to a benchmark.",
    "total_assets": null
  },
  "0P0000G5MA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ninety One Fund Managers UK Limited",
    "long_name": "Ninety One Cautious Managed I Acc",
    "manager_bio": "Alastair is head of the Value team at Investec Asset Management having joined in 2000 from Morley Fund Management. Alastair manages a number of funds including the Investec Cautious Managed Fund and the Investec UK Special Situations Fund. He also manages the Temple Bar Investment Trust. Alastair graduated from City University with a Bachelor of Science degree in Actuarial Science in 1988.",
    "manager_name": "Alastair  Mundy",
    "market": "gb_market",
    "short_name": "Ninety One Cautious Managed I A",
    "summary": "The Fund aims to provide capital growth (to grow the value of your investment) and income over at least 5 years. The Fund targets a return of UK Consumer Prices Index (CPI) +4% each year (before fees), over 5-year rolling periods. While the Fund aims to achieve its objective and its performance target, there is no guarantee that either will be achieved, over 5-year rolling periods or over any period and there is a risk of loss. The Fund invests primarily (at least two-thirds) in the shares of companies, and bonds (or similar debtbased assets) of borrowers, around the world. These bonds will be investment grade (have a relatively high credit rating).",
    "total_assets": null
  },
  "0P0000GH7V.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "Sentinel Universal Portfolio Retail Income",
    "manager_bio": "David Thornton joined Premier Miton in May 2006 and is co-manager of the range of multi-asset multi-manager funds, with specific research responsibilities for the fixed interest, European equity, property and absolute return sectors. Previously, David worked for several years as an Investment Analyst before becoming an investment manager in 2004, with responsibility for five discretionary multi-manager portfolios.",
    "manager_name": "David  Thornton",
    "market": "gb_market",
    "short_name": "Sentinel Universal Portfolio Re",
    "summary": "The investment objective of the Sub-Fund is to provide capital growth from a portfolio of investments. The investment policy of the Sub-Fund is to invest mainly in units of collective investment schemes. The Sub-Fund may also invest in equities, fixed interest securities, money market instruments, structured products and other derivative instruments, deposits, warrants, cash and near cash.",
    "total_assets": null
  },
  "0P0000HLLI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "WS Kleinwort Hambros Multi Asset Balanced C Acc",
    "manager_bio": "Andrew has responsibility for a number of external best advice lists covering intermediaries operating on various platforms such as Selestia, Transact and Nucleus and is involved in the provision of investment profiles for La Mondiales Luxembourg Insurance bond offering via TobCo. In December 2000, he joined Close Asset Management managing monies on behalf of charities, pension funds and high net worth individuals. Andrew began his investment career with Henry Cooke Lumsden in 1989.",
    "manager_name": "Andrew  Thompson",
    "market": "gb_market",
    "short_name": "DMS Kleinwort Hambros Multi Ass",
    "summary": "The investment objective of the Fund is to achieve long term equity returns with a moderate level of risk. \nThe Fund will seek to achieve its objective by investing directly through a well diversified portfolio of equities, bonds, money market instruments, cash, derivative instruments, forward transactions, collective investment schemes and other instruments listed on a Recognised Investment Exchange (such as, but not limited to, warrants, convertible preference shares and structured products) as the investment manager may consider appropriate in achieving the overall objective of the Sub-fund.",
    "total_assets": null
  },
  "0P0000HP5Z.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "AEGON Ireland",
    "long_name": "Aegon International 50:50 Core Ptfl V1",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Aegon International 50:50 Core ",
    "summary": "This fund gives investors the opportunity to invest in a blend of fixed interest (bonds) and UK equities (shares) to give them the balance between risk and reward that best suits them. It aims for attractive returns with less volatility (fluctuations in value) than a pure equity fund and invests 50% in the UK Fixed Interest fund managed by Kames Capital and 50% in the UK Index Tracker fund managed by BlackRock.\nThis fund is currently only available to Income 4 Life investors.",
    "total_assets": null
  },
  "0P0000J5AC.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "TM UBS (UK) - UK Balancedl B Inc",
    "manager_bio": "",
    "manager_name": "Gareth  Thomas",
    "market": "gb_market",
    "short_name": "TM UBS (UK) - UK Balancedl B I",
    "summary": "The fund seeks to provide long term capital growth from a portfolio of investments. \nThe fund seeks to be mainly invested in mid to large cap UK equities with a view to maximising potential returns. The Fund may invest in securities, money market instruments, deposits and warrants.",
    "total_assets": null
  },
  "0P0000J5AD.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "TM UBS (UK) - UK Balancedl B Acc",
    "manager_bio": "",
    "manager_name": "Gareth  Thomas",
    "market": "gb_market",
    "short_name": "TM UBS (UK) - UK Balancedl B A",
    "summary": "The fund seeks to provide long term capital growth from a portfolio of investments. \nThe fund seeks to be mainly invested in mid to large cap UK equities with a view to maximising potential returns. The Fund may invest in securities, money market instruments, deposits and warrants.",
    "total_assets": null
  },
  "0P0000JAK9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "WS Kleinwort Hambros Multi Asset Balanced A Inc",
    "manager_bio": "Andrew has responsibility for a number of external best advice lists covering intermediaries operating on various platforms such as Selestia, Transact and Nucleus and is involved in the provision of investment profiles for La Mondiales Luxembourg Insurance bond offering via TobCo. In December 2000, he joined Close Asset Management managing monies on behalf of charities, pension funds and high net worth individuals. Andrew began his investment career with Henry Cooke Lumsden in 1989.",
    "manager_name": "Andrew  Thompson",
    "market": "gb_market",
    "short_name": "DMS Kleinwort Hambros Multi Ass",
    "summary": "The investment objective of the Fund is to achieve long term equity returns with a moderate level of risk. \nThe Fund will seek to achieve its objective by investing directly through a well diversified portfolio of equities, bonds, money market instruments, cash, derivative instruments, forward transactions, collective investment schemes and other instruments listed on a Recognised Investment Exchange (such as, but not limited to, warrants, convertible preference shares and structured products) as the investment manager may consider appropriate in achieving the overall objective of the Sub-fund.",
    "total_assets": null
  },
  "0P0000JAKC.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "WS Kleinwort Hambros Multi Asset Balanced A Acc",
    "manager_bio": "Andrew has responsibility for a number of external best advice lists covering intermediaries operating on various platforms such as Selestia, Transact and Nucleus and is involved in the provision of investment profiles for La Mondiales Luxembourg Insurance bond offering via TobCo. In December 2000, he joined Close Asset Management managing monies on behalf of charities, pension funds and high net worth individuals. Andrew began his investment career with Henry Cooke Lumsden in 1989.",
    "manager_name": "Andrew  Thompson",
    "market": "gb_market",
    "short_name": "DMS Kleinwort Hambros Multi Ass",
    "summary": "The investment objective of the Fund is to achieve long term equity returns with a moderate level of risk. \nThe Fund will seek to achieve its objective by investing directly through a well diversified portfolio of equities, bonds, money market instruments, cash, derivative instruments, forward transactions, collective investment schemes and other instruments listed on a Recognised Investment Exchange (such as, but not limited to, warrants, convertible preference shares and structured products) as the investment manager may consider appropriate in achieving the overall objective of the Sub-fund.",
    "total_assets": null
  },
  "0P0000JVM3.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Tatton Oak Cautious Growth A Acc",
    "manager_bio": "Colin is a fund manager on the multi-manager team at Octopus. Prior to joining Octopus in 2008 he held roles at Killik & Co., Barclays Wealth and Morley Fund management. His most recent focus has been on equity risk management and multi-manager risk monitoring. Colin has over 13 years' experience in manager research and portfolio/fund management. Colin holds an MSc in International Securities, Investment and Banking from the ICMA Centre at Reading University. He is a Chartered Financial Analyst charterholder and a Fellow of the Securities Institute",
    "manager_name": "Colin  Lunnon",
    "market": "gb_market",
    "short_name": "VT Tatton Oak Cautious Growth A",
    "summary": "The Fund aims to achieve capital growth, over the medium to longer term, which is above normal cash deposit savings rates. \nThe Fund will achieve its investment exposure by investing in collective investment schemes, such as unit trusts, OEICs and closed ended schemes but may also invest in individual stocks and bonds. Through these investments, the Fund will seek a balanced asset class exposure, including equities and fixed interest securities, and in other asset classes such as commodities, property and private equity, listed and/or traded on both UK and international stock exchanges, directly or indirectly as appropriate. Through these investments the Fund will gain investment exposure across a range of global geographical areas and asset classes, but with core holdings in UK bonds and UK equities.",
    "total_assets": null
  },
  "0P0000JVM4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Tatton Oak Cautious Growth B Acc",
    "manager_bio": "Colin is a fund manager on the multi-manager team at Octopus. Prior to joining Octopus in 2008 he held roles at Killik & Co., Barclays Wealth and Morley Fund management. His most recent focus has been on equity risk management and multi-manager risk monitoring. Colin has over 13 years' experience in manager research and portfolio/fund management. Colin holds an MSc in International Securities, Investment and Banking from the ICMA Centre at Reading University. He is a Chartered Financial Analyst charterholder and a Fellow of the Securities Institute",
    "manager_name": "Colin  Lunnon",
    "market": "gb_market",
    "short_name": "VT Tatton Oak Cautious Growth B",
    "summary": "The Fund aims to achieve capital growth, over the medium to longer term, which is above normal cash deposit savings rates. \nThe Fund will achieve its investment exposure by investing in collective investment schemes, such as unit trusts, OEICs and closed ended schemes but may also invest in individual stocks and bonds. Through these investments, the Fund will seek a balanced asset class exposure, including equities and fixed interest securities, and in other asset classes such as commodities, property and private equity, listed and/or traded on both UK and international stock exchanges, directly or indirectly as appropriate. Through these investments the Fund will gain investment exposure across a range of global geographical areas and asset classes, but with core holdings in UK bonds and UK equities.",
    "total_assets": null
  },
  "0P0000K742.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Thesis Motim Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Thesis Motim Acc",
    "summary": "Investment of the assets of the Company must comply with COLL and the investment objective and policy of the Company. Details of the investment objective and policy are set out below. \nThe primary investment objective of the Company is to achieve positive returns, and to deliver a better return than the UK&#39;s cash deposit rate with a better risk-adjusted return profile than long equity investment. The assets in which the Company may invest will be transferable securities, units in collective investment schemes, money market instruments, deposits and cash or near cash investments.",
    "total_assets": null
  },
  "0P0000K743.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Thesis Motim Inc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Thesis Motim Inc",
    "summary": "Investment of the assets of the Company must comply with COLL and the investment objective and policy of the Company. Details of the investment objective and policy are set out below. \nThe primary investment objective of the Company is to achieve positive returns, and to deliver a better return than the UK&#39;s cash deposit rate with a better risk-adjusted return profile than long equity investment. The assets in which the Company may invest will be transferable securities, units in collective investment schemes, money market instruments, deposits and cash or near cash investments.",
    "total_assets": null
  },
  "0P0000K7BX.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Scottish Widows Schroder Personal Wealth (ACD) Limited",
    "long_name": "Schroders Personal Wealth Asset Allocator Fund A Acc",
    "manager_bio": "\"Hamish is deputy manager for Bancassurance and UKPB fund ranges. He transferred from the multi-manager team where he was responsible for manager selection and portfolio construction, predominantly in alternatives. \n\nHamish transferred to SWIP as an Investment Manager in December 2006 from Lloyds TSB Private Banking Limited when the investment research function was outsourced to SWIP. Hamish has been with the Lloyds Group since 2001 having previously worked as a private client portfolio manager with a number of institutions. Hamish joined Lloyds initially as a portfolio manager responsible for the management of the Private Banksâ UK equity portfolio before electing to transfer to manager selection. \n\nHamish holds a BA (Hons) in Business and a diploma in Investment Analysis.\"",
    "manager_name": "Hamish  Campbell",
    "market": "gb_market",
    "short_name": "Schroders Personal Wealth Inves",
    "summary": "The Sub-fund provides a tactical investment strategy by seeking a total return (income and growth) from an actively managed exposure to a wide range of asset classes.",
    "total_assets": null
  },
  "0P0000K7VJ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Iceberg Trust A Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Iceberg Trust A Acc",
    "summary": "The objective is to maximise the capital return through investment in both the UK and international markets. \nThe Trust will be able to invest in transferable securities, collective investment schemes, money market instruments, cash and deposits that can best take advantage of economic opportunities worldwide. It is the Managerâs intention that derivatives be used for hedging purposes using efficient portfolio management style techniques and may also be used for investment purposes on the giving of 60 daysâ written notice to unitholders.",
    "total_assets": null
  },
  "0P0000K92J.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Omnis Investments Limited",
    "long_name": "Omnis Multi-Manager Distribution B Acc",
    "manager_bio": "Bish Limbu, a CFA charterholder, joined Octopus in 2008 and now looks after the UK equity, distribution, balanced and absolute return strategies. Previously he worked as a fund analyst for Bestinvest Brokers and was a member of the multi manager team at Barclays Wealth. Bish graduated with a BA Honours in Engineering and Computing Science from Oxford University.",
    "manager_name": "Bish  Limbu",
    "market": "gb_market",
    "short_name": "Omnis Multi-Manager Distributio",
    "summary": "To achieve a reasonable level of income together with long term capital growth. it is expected that there will be core holdings in UK equities and bonds. However, investments will not be confined to any particular sector. exposure will be achieved primarily through investment in collective investment schemes. The Fund may also invest in transferable securities, money market instruments, warrants and deposits. use may also be made of stock lending, temporary borrowing and cash holdings. Derivatives may be used for the purposes of hedging and efficient portfolio management. Other information: if you hold income shares, income from your investment is paid out to you twice a year. we carry out investorsâ requests to buy, sell or switch, at midday on each working day (which excludes UK public holidays). If we receive a request after midday, we deal with it on the next working day. investment in the fund should be regarded as longterm, which is upwards of three to five years.",
    "total_assets": null
  },
  "0P0000K92K.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Omnis Investments Limited",
    "long_name": "Omnis Multi-Manager Distribution B Inc",
    "manager_bio": "Bish Limbu, a CFA charterholder, joined Octopus in 2008 and now looks after the UK equity, distribution, balanced and absolute return strategies. Previously he worked as a fund analyst for Bestinvest Brokers and was a member of the multi manager team at Barclays Wealth. Bish graduated with a BA Honours in Engineering and Computing Science from Oxford University.",
    "manager_name": "Bish  Limbu",
    "market": "gb_market",
    "short_name": "Omnis Multi-Manager Distributio",
    "summary": "To achieve a reasonable level of income together with long term capital growth. it is expected that there will be core holdings in UK equities and bonds. However, investments will not be confined to any particular sector. exposure will be achieved primarily through investment in collective investment schemes. The Fund may also invest in transferable securities, money market instruments, warrants and deposits. use may also be made of stock lending, temporary borrowing and cash holdings. Derivatives may be used for the purposes of hedging and efficient portfolio management. Other information: if you hold income shares, income from your investment is paid out to you twice a year. we carry out investorsâ requests to buy, sell or switch, at midday on each working day (which excludes UK public holidays). If we receive a request after midday, we deal with it on the next working day. investment in the fund should be regarded as longterm, which is upwards of three to five years.",
    "total_assets": null
  },
  "0P0000KCBF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Troy Asset Management Limited",
    "long_name": "LF Crystal Fund",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "LF Crystal Fund",
    "summary": "To seek to achieve growth in capital over the longer term (5 to 7 years) with a particular emphasis on preservation of capital.\nCapital invested is at risk and there is no guarantee that a positive return will be delivered or that the investment objective will be achieved.",
    "total_assets": null
  },
  "0P0000KNBZ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Quilter Investors Limited",
    "long_name": "Quilter Investors Cirilium Balanced Portfolio A",
    "manager_bio": "Paul is manager of the Cirilium and Cirilium Passive portfolio ranges. He joined the business in December 2014 from Henderson Global Investors, following the acquisition of Cirilium. Paul has managed the Cirilium portfolios since 2009, taking on these responsibilities shortly after the inception of the original range. He has more than 25 years of asset management experience and has also acted as a non-executive director of four investment trusts.",
    "manager_name": "Paul  Craig",
    "market": "gb_market",
    "short_name": "Quilter Investors Cirilium Bala",
    "summary": "To achieve capital growth over a period of five years or more through investment markets both in the UK and overseas.\nThe portfolio is broadly diversified across asset classes, with exposure to equities between 20-60% and with volatility of between 6 and 10%*.\n* The volatility range is a target, based on long term actuarial assumptions and the Fund is managed to stay within this range most of the time. The volatility range is regularly reviewed and may change from time to time due to changes in these assumptions.\n\nThe performance comparator for the Fund is the IA Mixed Investment 20-60% Shares Sector average performance. This Sector is considered appropriate on the basis that the Fundâs equity exposure over time is expected to be similar to that of the average fund in this Sector. The Fund is not managed with reference to a benchmark.",
    "total_assets": null
  },
  "0P0000KO3W.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Citibank NA London Branch (Link)",
    "long_name": "LF Packel Global",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "LF Packel Global",
    "summary": "The objective of the Packel Global Fund is to maximise income and capital growth through investment in a diversifi ed portfolio of global equities, global bonds and collective investment schemes. The Investment Manager may choose on occasions to hold a high level of cash and money market instruments if deemed appropriate to meet the objective of the fund. There will be no emphasis on any particular economic, industrial or geographical sector.",
    "total_assets": null
  },
  "0P0000KO4C.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Link Fund Solutions Limited",
    "long_name": "LF Cautela Fund A Accumulation",
    "manager_bio": "",
    "manager_name": "Nolan  Stanton",
    "market": "gb_market",
    "short_name": "LF Cautela Fund A Accumulation",
    "summary": "The investment objective of the Fund is to achieve a positive return regardless of market conditions through a combination of capital growth and the generation of income over the medium to long term. \nThe Fund will achieve this by investing in, but is not restricted to, shares, bonds, or other transferable securities listed on the London and other Recognised Investment Exchanges. The asset classes in which the Fund is also permitted to invest includes transferable securities, units in collective investment schemes, money market instruments, deposits, warrants and derivative instruments and forward transactions for hedging purposes only.",
    "total_assets": null
  },
  "0P0000KQXU.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund A Income shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P0000MQ23.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Ltd",
    "long_name": "SVS Brown Shipley Income Fund I Inc",
    "manager_bio": "",
    "manager_name": "Peter  Botham",
    "market": "gb_market",
    "short_name": "SVS Brown Shipley Income Fund I",
    "summary": "A multi asset portfolio seeking investment returns, via a focus on income producing assets. It is expected that the Fund will have exposure to UK equities and fixed interest investments with a lesser exposure to international equities, alternatives and cash. Exposure will be achieved mainly through collective investment Schemes (including open-ended investment companies and unit trusts) and other permitted investments that have a similar diversified character, such as exchange traded funds. The Fund may also invest, at the ACDâs discretion, in transferable securities, structured products, money market instruments, cash and near cash and deposits Use may also be made of stock lending, borrowing, cash holdings, derivatives for hedging and other efficient portfolio management techniques permitted in the COLL Sourcebook.",
    "total_assets": null
  },
  "0P0000MQ24.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Ltd",
    "long_name": "SVS Brown Shipley Income Fund I Acc",
    "manager_bio": "",
    "manager_name": "Peter  Botham",
    "market": "gb_market",
    "short_name": "SVS Brown Shipley Income Fund I",
    "summary": "A multi asset portfolio seeking investment returns, via a focus on income producing assets. It is expected that the Fund will have exposure to UK equities and fixed interest investments with a lesser exposure to international equities, alternatives and cash. Exposure will be achieved mainly through collective investment Schemes (including open-ended investment companies and unit trusts) and other permitted investments that have a similar diversified character, such as exchange traded funds. The Fund may also invest, at the ACDâs discretion, in transferable securities, structured products, money market instruments, cash and near cash and deposits Use may also be made of stock lending, borrowing, cash holdings, derivatives for hedging and other efficient portfolio management techniques permitted in the COLL Sourcebook.",
    "total_assets": null
  },
  "0P0000N7B6.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "WS Verbatim Portfolio 5 Income Fund Class A Inc",
    "manager_bio": "Richard has over 10 years experience in fund selection and has been the lead Fund Manager for all the Multi Manager funds since September 2001.",
    "manager_name": "Richard  Philbin",
    "market": "gb_market",
    "short_name": "DMS Verbatim Portfolio 5 Income",
    "summary": "The fund will use a broadly cautious balanced investment strategy with the aim of achieving income with some potential for capital growth over the medium to longer term.",
    "total_assets": null
  },
  "0P0000N7B7.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "WS Verbatim Portfolio 5 Income Fund Class B Inc",
    "manager_bio": "Richard has over 10 years experience in fund selection and has been the lead Fund Manager for all the Multi Manager funds since September 2001.",
    "manager_name": "Richard  Philbin",
    "market": "gb_market",
    "short_name": "DMS Verbatim Portfolio 5 Income",
    "summary": "The fund will use a broadly cautious balanced investment strategy with the aim of achieving income with some potential for capital growth over the medium to longer term.",
    "total_assets": null
  },
  "0P0000N7B9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "WS Verbatim Portfolio 5 Growth Fund Class B Acc",
    "manager_bio": "Sonja is ISF Global Equity Yield and Schroder ISF European Equity Yield Fund manager, based in London and joined Schroders in 2005. In 2001 Sonja joined DWS Investment GmbH, Frankfurt. During her time there she worked as a senior fund manager in Global Equities. From 1996 â 2001 she held various internships in France, UK and Germany. These were with IBM Consulting, DWS Investment, Morgan Stanley, Arthur Andersen and Mannesmann Mobilfunk. Sonja is also a CFA charterholder.",
    "manager_name": "Sonja  Laud (nÃ©e Schemmann)",
    "market": "gb_market",
    "short_name": "DMS Verbatim Portfolio 5 Growth",
    "summary": "The fund aims to achieve capital growth over the medium to longer term by using a risk based investment strategy that is broadly cautious balanced.",
    "total_assets": null
  },
  "0P0000O4H3.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Iceberg Trust B Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Iceberg Trust B Acc",
    "summary": "The objective is to maximise the capital return through investment in both the UK and international markets. \nThe Trust will be able to invest in transferable securities, collective investment schemes, money market instruments, cash and deposits that can best take advantage of economic opportunities worldwide. It is the Managerâs intention that derivatives be used for hedging purposes using efficient portfolio management style techniques and may also be used for investment purposes on the giving of 60 daysâ written notice to unitholders.",
    "total_assets": null
  },
  "0P0000O4PF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Cornelian Asset Managers Ltd",
    "long_name": "SVS Cornelian Managed Growth B Accumulation",
    "manager_bio": "Hector joined Brooks Macdonald in 2020 and leads the global, risk managed funds team where he is responsible for the investment performance of these mandates and promoting an unconstrained, active investment philosophy.Prior to this, Hector worked at Cornelian Asset Managers, before its acquisition by Brooks Macdonald, where he was the Chief Investment Officer and was responsible the performance of all their mandates. Hector joined Cornelian from Scottish Value Management where he managed the SVM UK Alpha fund. Previously, he worked at Standard Life Investments and was a key member of the Continental European equities team.Hector has an MBA in Strategic Management from Imperial College Business School and over 25 years' experience in financial services.",
    "manager_name": "Hector  Kilpatrick",
    "market": "gb_market",
    "short_name": "SVS Cornelian Managed Growth B ",
    "summary": "The objective of the Fund is to achieve long term capital growth and income delivering average annual investment returns (total returns, net of fees) of at least RPI + 2.0% over a five to seven year investment cycle. Ordinarily the majority of the assets will be invested in equities, bonds, government securities and equity funds. To enable the creation of a diversified portfolio the Fund may also invest in other transferable securities and collective investment schemes. There is no specific limit in exposure to any sector or geographic area. There may be occasions when it is deemed necessary to hold a high level of cash or short dated government bonds. Derivatives and forward transactions may be used for Efficient Portfolio Management.",
    "total_assets": null
  },
  "0P0000O4PG.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Cornelian Asset Managers Ltd",
    "long_name": "SVS Cornelian Managed Growth B Income",
    "manager_bio": "Hector joined Brooks Macdonald in 2020 and leads the global, risk managed funds team where he is responsible for the investment performance of these mandates and promoting an unconstrained, active investment philosophy.Prior to this, Hector worked at Cornelian Asset Managers, before its acquisition by Brooks Macdonald, where he was the Chief Investment Officer and was responsible the performance of all their mandates. Hector joined Cornelian from Scottish Value Management where he managed the SVM UK Alpha fund. Previously, he worked at Standard Life Investments and was a key member of the Continental European equities team.Hector has an MBA in Strategic Management from Imperial College Business School and over 25 years' experience in financial services.",
    "manager_name": "Hector  Kilpatrick",
    "market": "gb_market",
    "short_name": "SVS Cornelian Managed Growth B ",
    "summary": "The objective of the Fund is to achieve long term capital growth and income delivering average annual investment returns (total returns, net of fees) of at least RPI + 2.0% over a five to seven year investment cycle. Ordinarily the majority of the assets will be invested in equities, bonds, government securities and equity funds. To enable the creation of a diversified portfolio the Fund may also invest in other transferable securities and collective investment schemes. There is no specific limit in exposure to any sector or geographic area. There may be occasions when it is deemed necessary to hold a high level of cash or short dated government bonds. Derivatives and forward transactions may be used for Efficient Portfolio Management.",
    "total_assets": null
  },
  "0P0000O4PJ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Cornelian Asset Managers Ltd",
    "long_name": "SVS Cornelian Managed Growth D Accumulation",
    "manager_bio": "Hector joined Brooks Macdonald in 2020 and leads the global, risk managed funds team where he is responsible for the investment performance of these mandates and promoting an unconstrained, active investment philosophy.Prior to this, Hector worked at Cornelian Asset Managers, before its acquisition by Brooks Macdonald, where he was the Chief Investment Officer and was responsible the performance of all their mandates. Hector joined Cornelian from Scottish Value Management where he managed the SVM UK Alpha fund. Previously, he worked at Standard Life Investments and was a key member of the Continental European equities team.Hector has an MBA in Strategic Management from Imperial College Business School and over 25 years' experience in financial services.",
    "manager_name": "Hector  Kilpatrick",
    "market": "gb_market",
    "short_name": "SVS Cornelian Managed Growth D ",
    "summary": "The objective of the Fund is to achieve long term capital growth and income delivering average annual investment returns (total returns, net of fees) of at least RPI + 2.0% over a five to seven year investment cycle. Ordinarily the majority of the assets will be invested in equities, bonds, government securities and equity funds. To enable the creation of a diversified portfolio the Fund may also invest in other transferable securities and collective investment schemes. There is no specific limit in exposure to any sector or geographic area. There may be occasions when it is deemed necessary to hold a high level of cash or short dated government bonds. Derivatives and forward transactions may be used for Efficient Portfolio Management.",
    "total_assets": null
  },
  "0P0000O4PK.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Cornelian Asset Managers Ltd",
    "long_name": "SVS Cornelian Managed Growth D Income",
    "manager_bio": "Hector joined Brooks Macdonald in 2020 and leads the global, risk managed funds team where he is responsible for the investment performance of these mandates and promoting an unconstrained, active investment philosophy.Prior to this, Hector worked at Cornelian Asset Managers, before its acquisition by Brooks Macdonald, where he was the Chief Investment Officer and was responsible the performance of all their mandates. Hector joined Cornelian from Scottish Value Management where he managed the SVM UK Alpha fund. Previously, he worked at Standard Life Investments and was a key member of the Continental European equities team.Hector has an MBA in Strategic Management from Imperial College Business School and over 25 years' experience in financial services.",
    "manager_name": "Hector  Kilpatrick",
    "market": "gb_market",
    "short_name": "SVS Cornelian Managed Growth D ",
    "summary": "The objective of the Fund is to achieve long term capital growth and income delivering average annual investment returns (total returns, net of fees) of at least RPI + 2.0% over a five to seven year investment cycle. Ordinarily the majority of the assets will be invested in equities, bonds, government securities and equity funds. To enable the creation of a diversified portfolio the Fund may also invest in other transferable securities and collective investment schemes. There is no specific limit in exposure to any sector or geographic area. There may be occasions when it is deemed necessary to hold a high level of cash or short dated government bonds. Derivatives and forward transactions may be used for Efficient Portfolio Management.",
    "total_assets": null
  },
  "0P0000PREL.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Libero Strategic Fund (LAPS Retail Shares) Acc",
    "manager_bio": "After graduating from\nCambridge in 1980 with\na degree in natural\nsciences, David began\nhis investment career as\na stockbroker at\nSheppards and Chase, before moving to Fleming\nPrivate Asset Management where he was a\nmember of the executive committee, chairman of\nthe strategy and stock selection committees and\nhead of charities. Following the takeover of\nFlemings in 2000, David became managing\ndirector and head of the UK private client\ninvestment team at JP Morgan Private Bank\nbefore moving to the Royal Bank of Canada to\nrun the British Isles investment business. David\njoined the company in 2007.",
    "manager_name": "David  Miller",
    "market": "gb_market",
    "short_name": "Libero Strategic Fund (LAPS Ret",
    "summary": "The aim of the Libero Strategic Fund is to provide capital growth. \nThe Fund will aim to achieve its investment objective through strategic allocation in a portfolio of transferable securities (including investment trusts), collective investment schemes, deposits, approved money market instruments and derivatives.",
    "total_assets": null
  },
  "0P0000PREN.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Libero Strategic Fund (LAPS Institutional Shares) Acc",
    "manager_bio": "After graduating from\nCambridge in 1980 with\na degree in natural\nsciences, David began\nhis investment career as\na stockbroker at\nSheppards and Chase, before moving to Fleming\nPrivate Asset Management where he was a\nmember of the executive committee, chairman of\nthe strategy and stock selection committees and\nhead of charities. Following the takeover of\nFlemings in 2000, David became managing\ndirector and head of the UK private client\ninvestment team at JP Morgan Private Bank\nbefore moving to the Royal Bank of Canada to\nrun the British Isles investment business. David\njoined the company in 2007.",
    "manager_name": "David  Miller",
    "market": "gb_market",
    "short_name": "Libero Strategic Fund (LAPS Ins",
    "summary": "The aim of the Libero Strategic Fund is to provide capital growth. \nThe Fund will aim to achieve its investment objective through strategic allocation in a portfolio of transferable securities (including investment trusts), collective investment schemes, deposits, approved money market instruments and derivatives.",
    "total_assets": null
  },
  "0P0000Q1PI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Link Fund Solutions Limited",
    "long_name": "LF Handelsbanken Balanced Multi Asset Fund B Accumulation",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "LF Heartwood Balanced Multi Ass",
    "summary": "To deliver a total return (the combination of income and capital growth) that at the end of any five year period is equivalent to achieving a total return of the Consumer Price Index plus 3% each year over that period, after all costs and charges have been taken. There is no guarantee that the objective will be met or that a positive return will be delivered over any time period and capital is at risk.",
    "total_assets": null
  },
  "0P0000Q62G.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "M&G Securities Ltd",
    "long_name": "M&amp;G Episode Income Fund Sterling X Acc",
    "manager_bio": "Steven Andrew joined M&G in 2005 as a member of the portfolio strategy & risk team, before moving to the Multi Asset team, where he helped to formulate asset allocation strategies for M&G's multi-asset fund range. In November 2010, Steven was appointed manager of the newly launched M&G Income Multi Asset Fund. Before joining M&G, Steven worked at F&C Asset Management, Merrill Lynch and the Bank of England. He graduated from the University of London in 1997 with a degree in financial economics.",
    "manager_name": "Steven  Andrew",
    "market": "gb_market",
    "short_name": "M&G Episode Income Fund Sterlin",
    "summary": "The Fund aims to generate a growing level of income over any three-year period. The Fund also aims to provide capital growth of 2-4% per annum over any three-year period.",
    "total_assets": null
  },
  "0P0000Q73D.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Scottish Widows Unit Trust Managers Ltd",
    "long_name": "Scottish Widows Balanced Growth Fund F Acc",
    "manager_bio": "UK",
    "manager_name": "Mark  Henzell",
    "market": "gb_market",
    "short_name": "Scottish Widows Balanced Growth",
    "summary": "To provide capital growth through investment in collective investment schemes. These collective investment schemes will provide exposure to shares with the remainder providing exposure to a mix of asset classes (including, but not limited to, fixed interest securities and property assets) and absolute return strategies. Between 30% and 65% of the Fund will provide exposure to shares. This may include UK, overseas and emerging market shares.",
    "total_assets": null
  },
  "0P0000SAWC.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Premier Portfolio Managers Limited",
    "long_name": "Premier Miton Liberation No. V C accumulation",
    "manager_bio": "David Hambidge joined Premier Miton in December 1987 and specialises in the management of portfolios using collective investment vehicles including OEICs and investment trusts. David has been part of the original investment team that set up Premier Mitonâs original fund of funds in 1995 and was appointed lead manager in 1999, making him one of the most experienced fund of funds managers in the UK.",
    "manager_name": "David  Hambidge",
    "market": "gb_market",
    "short_name": "Premier Liberation No. V Class ",
    "summary": "The objective of the Fund is to provide an income together with capital growth over the long-term, being five years or more, whilst seeking to remain within a defined risk profile with defined volatility parameters which may result in the income and the capital growth from the Fund being constrained. The Investment Adviser will aim to maintain a risk profile classification of 5 as set and monitored by an external third party risk rating company. Five years is also the minimum recommended period for holding shares in this Fund. This does not mean that the Fund will achieve the objective throughout this, or any other, specific time period and there is a risk of loss to the original capital invested.",
    "total_assets": null
  },
  "0P0000SAWD.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Premier Portfolio Managers Limited",
    "long_name": "Premier Miton Liberation No. V C income",
    "manager_bio": "David Hambidge joined Premier Miton in December 1987 and specialises in the management of portfolios using collective investment vehicles including OEICs and investment trusts. David has been part of the original investment team that set up Premier Mitonâs original fund of funds in 1995 and was appointed lead manager in 1999, making him one of the most experienced fund of funds managers in the UK.",
    "manager_name": "David  Hambidge",
    "market": "gb_market",
    "short_name": "Premier Liberation No. V Class ",
    "summary": "The objective of the Fund is to provide an income together with capital growth over the long-term, being five years or more, whilst seeking to remain within a defined risk profile with defined volatility parameters which may result in the income and the capital growth from the Fund being constrained. The Investment Adviser will aim to maintain a risk profile classification of 5 as set and monitored by an external third party risk rating company. Five years is also the minimum recommended period for holding shares in this Fund. This does not mean that the Fund will achieve the objective throughout this, or any other, specific time period and there is a risk of loss to the original capital invested.",
    "total_assets": null
  },
  "0P0000SU44.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "EdenTree Investment Management Limited",
    "long_name": "EdenTree Amity Balanced Fund For Charities",
    "manager_bio": "Chris graduated in 1995, with an MSc in Economics from University College London. He joined EdenTree in 1996 as a Research Assistant and took over the management of the Amity European Fund in 2007. Chris has been a CFA Charterholder since 2004.",
    "manager_name": "Chris  Hiorns",
    "market": "gb_market",
    "short_name": "EdenTree Amity Balanced Fund Fo",
    "summary": "The fund aims to achieve a balance between capital growth and income. The Fund seeks to primarily invest in a diversified portfolio of UK and international equities and fixed interest securities issued by governments and companies which make a positive contribution to society and the environment through sustainable and socially responsible practices.",
    "total_assets": null
  },
  "0P0000TKZK.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Vanguard Investments UK, Limited",
    "long_name": "Vanguard LifeStrategy 60% Equity Fund A Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Vanguard LifeStrategy 60% Equit",
    "summary": "The Fundâs investment objective is to hold investments that will pay out money and increase in value through exposure to a diversified portfolio comprised of approximately: 60% by value of shares; and 40% by value of bonds and other similar fixed income investments. The Fund will seek to achieve its investment objective by investing more than 90% of its assets in passive funds that track an index, which are managed or operated by the ACD or its associates.",
    "total_assets": null
  },
  "0P0000TKZL.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Vanguard Investments UK, Limited",
    "long_name": "Vanguard LifeStrategy 60% Equity Fund A Inc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Vanguard LifeStrategy 60% Equit",
    "summary": "The Fundâs investment objective is to hold investments that will pay out money and increase in value through exposure to a diversified portfolio comprised of approximately: 60% by value of shares; and 40% by value of bonds and other similar fixed income investments. The Fund will seek to achieve its investment objective by investing more than 90% of its assets in passive funds that track an index, which are managed or operated by the ACD or its associates.",
    "total_assets": null
  },
  "0P0000TO4R.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Brooks Macdonald Cautious Growth B Acc",
    "manager_bio": "Jonathan Webster-Smith is a director of Brooks Macdonald Asset Management Ltd. He is head of Managed Portfolio Service and also an investment manager with responsibility for managing discretionary client portfolios and pension funds. Jonathan joined Brooks Macdonald in 2001 as a graduate trainee and gained his Financial Planning Certificate (FPC) and Advanced Financial Planning Certificate (AFPC). He is also an affiliate member of The Chartered Institute for Securities & Investment (CISI) having completed the Diploma in 2005/6. Jonathanâs specialist research sector is: Fixed Interest.",
    "manager_name": "Jonathan  Webster-Smith",
    "market": "gb_market",
    "short_name": "IFSL Brooks Macdonald Cautious ",
    "summary": "The Fund is actively managed and invested in a variety of collective investment schemes including UK and international equity as well as fixed income exposure to provide an overall cautious investment mix. It may also invest in transferable securities, money market instruments, ETFs and cash. The use of derivatives and hedging is only permitted in the efficient portfolio management of the Sub-Fund. Borrowing will be permitted on a temporary basis under certain terms, at the discretion of the Investment Manager.",
    "total_assets": null
  },
  "0P0000U20W.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Jupiter Unit Trust Managers Ltd",
    "long_name": "Jupiter Merlin Income I Inc",
    "manager_bio": "John Chatfeild-Roberts joined Jupiter in March 2001, and he was appointed Chief Investment Officer of Jupiter Asset Management in February 2010. He established the award-winning Jupiter Merlin fund of funds team, in which he jointly manages the Jupiter Merlin Portfolios with Peter Lawery and Algy Smith-Maxwell, who both came with him from Lazard Asset Management. John is also Lead Manager of the Jupiter Global Managed Fund (Unit Trust). John gained a degree in Economics from Durham University and the RMA Sandhurst. After a Short Service Commission in the Army, John started his fund management career at Henderson's (1990-1995), followed by a move to Lazard Asset Management, where he set up a successful multi-manager team from scratch. John is a Fellow of the Securities Institute.",
    "manager_name": "John  Chatfeild-Roberts",
    "market": "gb_market",
    "short_name": "Jupiter Merlin Income I Inc",
    "summary": "To provide income together with the prospect of capital growth to provide a return, net of fees, that is higher than the\nIA Mixed Investment 20%-60% Shares Sector average over the long term (at least five years). At least 70% of the fund is invested in collective investment schemes. Up to 30% of the fund may be invested in other assets, including shares of companies, cash and near cash.",
    "total_assets": null
  },
  "0P0000U20X.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Jupiter Unit Trust Managers Ltd",
    "long_name": "Jupiter Merlin Income I Acc",
    "manager_bio": "John Chatfeild-Roberts joined Jupiter in March 2001, and he was appointed Chief Investment Officer of Jupiter Asset Management in February 2010. He established the award-winning Jupiter Merlin fund of funds team, in which he jointly manages the Jupiter Merlin Portfolios with Peter Lawery and Algy Smith-Maxwell, who both came with him from Lazard Asset Management. John is also Lead Manager of the Jupiter Global Managed Fund (Unit Trust). John gained a degree in Economics from Durham University and the RMA Sandhurst. After a Short Service Commission in the Army, John started his fund management career at Henderson's (1990-1995), followed by a move to Lazard Asset Management, where he set up a successful multi-manager team from scratch. John is a Fellow of the Securities Institute.",
    "manager_name": "John  Chatfeild-Roberts",
    "market": "gb_market",
    "short_name": "Jupiter Merlin Income I Acc",
    "summary": "To provide income together with the prospect of capital growth to provide a return, net of fees, that is higher than the\nIA Mixed Investment 20%-60% Shares Sector average over the long term (at least five years). At least 70% of the fund is invested in collective investment schemes. Up to 30% of the fund may be invested in other assets, including shares of companies, cash and near cash.",
    "total_assets": null
  },
  "0P0000UREJ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Link Fund Solutions Limited",
    "long_name": "LF Cautela Fund A Income",
    "manager_bio": "",
    "manager_name": "Nolan  Stanton",
    "market": "gb_market",
    "short_name": "LF Cautela Fund A Income",
    "summary": "The investment objective of the Fund is to achieve a positive return regardless of market conditions through a combination of capital growth and the generation of income over the medium to long term. \nThe Fund will achieve this by investing in, but is not restricted to, shares, bonds, or other transferable securities listed on the London and other Recognised Investment Exchanges. The asset classes in which the Fund is also permitted to invest includes transferable securities, units in collective investment schemes, money market instruments, deposits, warrants and derivative instruments and forward transactions for hedging purposes only.",
    "total_assets": null
  },
  "0P0000VAEZ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Nedgroup Investments (IOM) Ltd",
    "long_name": "Nedgroup Investments MultiFunds Balanced Fund GBP Class A",
    "manager_bio": "Trevor is responsible for the on-going research and management of BoE Private Clients' domestic and international (Isle of Man registered) range of Fund of Fund collective investments. Prior to his current role, he served as a director of Edge Asset Management after the merger of Edge and TMA Investment Products Services. Trevor joined TMA in 1997 to launch the Investment Management Services division, specialising in the development of multi-managed products. Further experience includes consultancy work at Barra International and lecturing in Economics and Finance at UCT.\n\nTrevor holds a B.Com (Hons) Economics, M.Com (Finance), MBA, Dip FMI (Cum Laude), SAFEX, ACIBM, CAIA",
    "manager_name": "Trevor  Garvin",
    "market": "gb_market",
    "short_name": "Nedgroup Investments MultiFunds",
    "summary": "The Sub-Fundâs objective will be to provide growth with moderate levels of risk and volatility over the medium to longer term than the other Sub-Funds of the Company.",
    "total_assets": null
  },
  "0P0000VOP8.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "TM New Court Equity Growth A2011",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "TM New Court Equity Growth A20",
    "summary": "The objective of the Fund is to achieve long term capital growth.",
    "total_assets": null
  },
  "0P0000VSLG.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund A Accumulation shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P0000VSLH.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund B Income shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P0000VSLI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund B Accumulation shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P0000VVEK.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Coronation Global Fund Managers (Ireland) Limited",
    "long_name": "Coronation Global Capital Plus Fund G",
    "manager_bio": "Tony is a founder member of Coronation Fund Managers and was appointed as executive chairman of the international group of companies in 2004. Recognised as one of the leading portfolio managers in South Africa, Tony was Coronationâs global chief investment officer from 1993 to 2004 and was instrumental in setting up the international operation in 1996. Prior to establishing Coronation, Tony spent seven years at UAL and eight years at Syfrets Managed Assets working in the areas of portfolio management and research.",
    "manager_name": "Tony  Gibson",
    "market": "gb_market",
    "short_name": "Coronation Global Capital Plus ",
    "summary": "The investment objective of the Fund is to achieve maximum long term total return with diversification of risk through direct and indirect exposure to one or more of the following asset classes being equity securities, deposits, listed private equity funds, listed property funds, fixed income and debt and debt-related instruments and commodities.",
    "total_assets": null
  },
  "0P0000WBQX.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ninety One Fund Managers UK Limited",
    "long_name": "Ninety One Cautious Managed Fund I Inc",
    "manager_bio": "Alastair is head of the Value team at Investec Asset Management having joined in 2000 from Morley Fund Management. Alastair manages a number of funds including the Investec Cautious Managed Fund and the Investec UK Special Situations Fund. He also manages the Temple Bar Investment Trust. Alastair graduated from City University with a Bachelor of Science degree in Actuarial Science in 1988.",
    "manager_name": "Alastair  Mundy",
    "market": "gb_market",
    "short_name": "Ninety One Cautious Managed Fun",
    "summary": "The Fund aims to provide capital growth (to grow the value of your investment) and income over at least 5 years. The Fund targets a return of UK Consumer Prices Index (CPI) +4% each year (before fees), over 5-year rolling periods. While the Fund aims to achieve its objective and its performance target, there is no guarantee that either will be achieved, over 5-year rolling periods or over any period and there is a risk of loss. The Fund invests primarily (at least two-thirds) in the shares of companies, and bonds (or similar debtbased assets) of borrowers, around the world. These bonds will be investment grade (have a relatively high credit rating).",
    "total_assets": null
  },
  "0P0000WIO1.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "Sentinel Universal Portfolio B Accumulation",
    "manager_bio": "John Husselbee has over twenty years of investment experience, acquired at Rothschilds, Henderson Global Investors and now North Investment Partners. John began his investment career at Rothschild Asset Management where he was responsible for building its multi manager operation making it the largest single provider of multi manager services in the UK retail market at that time. John joined Henderson Global Investors in 1996, when its multi manager business totalled approximately Â£60m under management. By the time he left to launch North, Henderson was established as one of the UKâs largest retail multi manager providers, with over Â£700m invested across a range of multi manager portfolios. As director of multi manager investment, John also launched one of the UKâs first retail fund of hedge funds. John is Chief Executive of North Investment Partners Limited which is the investment sub-adviser to the MultiManager fund range.",
    "manager_name": "John  Husselbee",
    "market": "gb_market",
    "short_name": "Sentinel Universal Portfolio B ",
    "summary": "The investment objective of the Sub-Fund is to provide capital growth from a portfolio of investments. The investment policy of the Sub-Fund is to invest mainly in units of collective investment schemes. The Sub-Fund may also invest in equities, fixed interest securities, money market instruments, structured products and other derivative instruments, deposits, warrants, cash and near cash.",
    "total_assets": null
  },
  "0P0000WN3N.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "M&G Securities Ltd",
    "long_name": "M&amp;G Episode Income Fund Sterling I Acc",
    "manager_bio": "Steven Andrew joined M&G in 2005 as a member of the portfolio strategy & risk team, before moving to the Multi Asset team, where he helped to formulate asset allocation strategies for M&G's multi-asset fund range. In November 2010, Steven was appointed manager of the newly launched M&G Income Multi Asset Fund. Before joining M&G, Steven worked at F&C Asset Management, Merrill Lynch and the Bank of England. He graduated from the University of London in 1997 with a degree in financial economics.",
    "manager_name": "Steven  Andrew",
    "market": "gb_market",
    "short_name": "M&G Episode Income Fund Sterlin",
    "summary": "The Fund aims to generate a growing level of income over any three-year period. The Fund also aims to provide capital growth of 2-4% per annum over any three-year period.",
    "total_assets": null
  },
  "0P0000WN3P.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "M&G Securities Ltd",
    "long_name": "M&amp;G Episode Income Fund Sterling R Acc",
    "manager_bio": "Steven Andrew joined M&G in 2005 as a member of the portfolio strategy & risk team, before moving to the Multi Asset team, where he helped to formulate asset allocation strategies for M&G's multi-asset fund range. In November 2010, Steven was appointed manager of the newly launched M&G Income Multi Asset Fund. Before joining M&G, Steven worked at F&C Asset Management, Merrill Lynch and the Bank of England. He graduated from the University of London in 1997 with a degree in financial economics.",
    "manager_name": "Steven  Andrew",
    "market": "gb_market",
    "short_name": "M&G Episode Income Fund Sterlin",
    "summary": "The Fund aims to generate a growing level of income over any three-year period. The Fund also aims to provide capital growth of 2-4% per annum over any three-year period.",
    "total_assets": null
  },
  "0P0000WUO9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Aberdeen Standard Fund Managers Limited",
    "long_name": "ASI MyFolio Monthly Income III Fund Platform 1 Accumulation",
    "manager_bio": "Head of Multimanager. Bambos has over 20 years investment experience of which almost 10 years is in managing retail fund of funds, this length of fund of funds experience is almost unrivalled. Bambos graduated with a degree in Mathematics from the University of London.",
    "manager_name": "Bambos  Hambi",
    "market": "gb_market",
    "short_name": "ASI MyFolio Multi-Manager Incom",
    "summary": "To generate income and some growth over the long term (5 years or more) while being managed to a defined level of risk. The fund is part of the ASI MyFolio Monthly Income range, which offers three funds with different expected combinations of investment risk and return. The fund is the middle risk fund in the Income range.",
    "total_assets": null
  },
  "0P0000WUOA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Aberdeen Standard Fund Managers Limited",
    "long_name": "ASI MyFolio Monthly Income III Fund Platform 1 Income",
    "manager_bio": "Head of Multimanager. Bambos has over 20 years investment experience of which almost 10 years is in managing retail fund of funds, this length of fund of funds experience is almost unrivalled. Bambos graduated with a degree in Mathematics from the University of London.",
    "manager_name": "Bambos  Hambi",
    "market": "gb_market",
    "short_name": "ASI MyFolio Multi-Manager Incom",
    "summary": "To generate income and some growth over the long term (5 years or more) while being managed to a defined level of risk. The fund is part of the ASI MyFolio Monthly Income range, which offers three funds with different expected combinations of investment risk and return. The fund is the middle risk fund in the Income range.",
    "total_assets": null
  },
  "0P0000WXE4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Thesis Palfrey Fund Income Units",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "Thesis Palfrey Fund Income Uni",
    "summary": "The investment objective of the Trust is to aim to achieve a balance between providing a consistent flow of income whilst at least maintaining the long term real (after inflation) value of the assets.\nIn seeking to achieve the investment objective the Trust will invest in both fixed interest investments (to provide a high fixed income return) principally government and corporate bonds and assets which have the potential to provide both income and capital growth, principally equities in the UK and globally. The Trust may invest up to 100 per cent of the Trust property in collective investment schemes managed by the Investment Adviser or by its associate.",
    "total_assets": null
  },
  "0P0000X4EO.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Sarasin Investment Funds Ltd",
    "long_name": "Sarasin GlobalSar &#226;&#128;&#147; Strategic Fund Class I Accumulation Shares",
    "manager_bio": "",
    "manager_name": "Guy  Monson",
    "market": "gb_market",
    "short_name": "Sarasin GlobalSar – Strategic",
    "summary": "We seek to grow the Fund (through increases in investment value and income) by 3% per year more than the Consumer Prices Index (CPI) over a rolling 5 year period after deducting fees and costs. We invest between 20 and 60% of the Fund in the shares of companies from around the world. We will also invest in bonds, units in funds (including those managed by Sarasin) and cash, and we may hold up to 80% of the Fund in these assets when we deem it appropriate in order to manage difficult market conditions.",
    "total_assets": null
  },
  "0P0000X4EP.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Sarasin Investment Funds Ltd",
    "long_name": "Sarasin GlobalSar &#226;&#128;&#147; Strategic Fund Class I Income Shares",
    "manager_bio": "",
    "manager_name": "Guy  Monson",
    "market": "gb_market",
    "short_name": "Sarasin GlobalSar – Strategic",
    "summary": "We seek to grow the Fund (through increases in investment value and income) by 3% per year more than the Consumer Prices Index (CPI) over a rolling 5 year period after deducting fees and costs. We invest between 20 and 60% of the Fund in the shares of companies from around the world. We will also invest in bonds, units in funds (including those managed by Sarasin) and cash, and we may hold up to 80% of the Fund in these assets when we deem it appropriate in order to manage difficult market conditions.",
    "total_assets": null
  },
  "0P0000X4EQ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Sarasin Investment Funds Ltd",
    "long_name": "Sarasin GlobalSar &#226;&#128;&#147; Strategic Fund Class P Accumulation Shares",
    "manager_bio": "",
    "manager_name": "Guy  Monson",
    "market": "gb_market",
    "short_name": "Sarasin GlobalSar – Strategic",
    "summary": "We seek to grow the Fund (through increases in investment value and income) by 3% per year more than the Consumer Prices Index (CPI) over a rolling 5 year period after deducting fees and costs. We invest between 20 and 60% of the Fund in the shares of companies from around the world. We will also invest in bonds, units in funds (including those managed by Sarasin) and cash, and we may hold up to 80% of the Fund in these assets when we deem it appropriate in order to manage difficult market conditions.",
    "total_assets": null
  },
  "0P0000X4ER.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Sarasin Investment Funds Ltd",
    "long_name": "Sarasin GlobalSar &#226;&#128;&#147; Strategic Fund Class P Income Shares",
    "manager_bio": "",
    "manager_name": "Guy  Monson",
    "market": "gb_market",
    "short_name": "Sarasin GlobalSar – Strategic",
    "summary": "We seek to grow the Fund (through increases in investment value and income) by 3% per year more than the Consumer Prices Index (CPI) over a rolling 5 year period after deducting fees and costs. We invest between 20 and 60% of the Fund in the shares of companies from around the world. We will also invest in bonds, units in funds (including those managed by Sarasin) and cash, and we may hold up to 80% of the Fund in these assets when we deem it appropriate in order to manage difficult market conditions.",
    "total_assets": null
  },
  "0P0000X4F8.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Sarasin Investment Funds Ltd",
    "long_name": "Sarasin GlobalSar &#226;&#128;&#147; Strategic Fund Class X Accumulation Shares",
    "manager_bio": "",
    "manager_name": "Guy  Monson",
    "market": "gb_market",
    "short_name": "Sarasin GlobalSar – Strategic",
    "summary": "We seek to grow the Fund (through increases in investment value and income) by 3% per year more than the Consumer Prices Index (CPI) over a rolling 5 year period after deducting fees and costs. We invest between 20 and 60% of the Fund in the shares of companies from around the world. We will also invest in bonds, units in funds (including those managed by Sarasin) and cash, and we may hold up to 80% of the Fund in these assets when we deem it appropriate in order to manage difficult market conditions.",
    "total_assets": null
  },
  "0P0000X4F9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Sarasin Investment Funds Ltd",
    "long_name": "Sarasin GlobalSar &#226;&#128;&#147; Strategic Fund Class X Income Shares",
    "manager_bio": "",
    "manager_name": "Guy  Monson",
    "market": "gb_market",
    "short_name": "Sarasin GlobalSar – Strategic",
    "summary": "We seek to grow the Fund (through increases in investment value and income) by 3% per year more than the Consumer Prices Index (CPI) over a rolling 5 year period after deducting fees and costs. We invest between 20 and 60% of the Fund in the shares of companies from around the world. We will also invest in bonds, units in funds (including those managed by Sarasin) and cash, and we may hold up to 80% of the Fund in these assets when we deem it appropriate in order to manage difficult market conditions.",
    "total_assets": null
  },
  "0P0000XBNK.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ruffer LLP (Link)",
    "long_name": "LF Ruffer Total Return Fund C Accumulation",
    "manager_bio": "Started as a research analyst at SLC Asset Management in 1987, where he became Head of Equities in charge of Â£5bn of equity funds. In 1999 moved to HSBC Investment Bank as Head of UK and European Equity Strategy, before joining Ruffer in September 2003. Became a non\n-executive director of JPMorgan European Investment Trust in 2005 and is co-manager of the CF Ruffer Total Return Fund.",
    "manager_name": "Steven  Russell",
    "market": "gb_market",
    "short_name": "LF Ruffer Total Return Fund C A",
    "summary": "The investment objective of CF Ruffer Total Return Fund is to achieve low volatility, positive returns from an actively managed portfolio of different asset classes, including equities, bonds and currencies. \nThe sub-fund may also invest in collective investment schemes, cash, money market instruments, other transferable securities and derivatives and forward transactions and other investments to the extent that each is permitted by the Regulations. Pervading this objective is a fundamental philosophy of capital preservation.",
    "total_assets": null
  },
  "0P0000XHAS.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "TM Levitas B Fund B Net Acc",
    "manager_bio": "Jonathan Webster-Smith is a director of Brooks Macdonald Asset Management Ltd. He is head of Managed Portfolio Service and also an investment manager with responsibility for managing discretionary client portfolios and pension funds. Jonathan joined Brooks Macdonald in 2001 as a graduate trainee and gained his Financial Planning Certificate (FPC) and Advanced Financial Planning Certificate (AFPC). He is also an affiliate member of The Chartered Institute for Securities & Investment (CISI) having completed the Diploma in 2005/6. Jonathanâs specialist research sector is: Fixed Interest.",
    "manager_name": "Jonathan  Webster-Smith",
    "market": "gb_market",
    "short_name": "TM Levitas B Fund B Net Acc",
    "summary": "The Fundâs objective is to generate growth over the long term.The value of any investment can fall as well as rise and is not guaranteed â you may get back less than you payin.For further information on the TM Levitas B Fund, please refer to the fund manager fact sheet, link providedbelow.TM Levitas B Fund Factsheet (http://documents.financialexpress.net/Literature/20907492.pdf)",
    "total_assets": null
  },
  "0P0000XK3Z.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Liontrust Multi-Asset Limited",
    "long_name": "Liontrust MA Passive Intermediate Fund Class Class A Accumulation",
    "manager_bio": "Previously working as an analyst at AXA Winterthur, Stephen joined Architas when it was established in June 2008. Stephen oversees the Architas Multi-Asset Passive Range of funds including fund selection and the implementation of cash flows for these products and the various passive offerings available to our European clients. He is also responsible for recommending and reviewing passive investments for all Architas products.\nAdditionally Stephen covers fund research across a variety of other sectors including leading the research for the three IMA managed sectors. Stephenâs investment experience has been gained from a variety of areas including a total of 15 years working for US investment bank, Morgan Stanley, where he was as an executive director on the programme trading desk, in charge of trade implementation. At Winterthur Life Stephen managed the Investment Technical Support Team, assisting Winterthurâs sales team and financial advisers on their collective investment offerings. He is an FCA approved person and has passed the IMC and other exams from the Securities Institute, including financial derivatives and commodities.",
    "manager_name": "Stephen  Allen",
    "market": "gb_market",
    "short_name": "Liontrust MA Passive Intermedia",
    "summary": "The investment objective of the Fund is to seek to achieve a return for investors over the medium to long term based on a combination of capital growth and income and with a median volatility level through exposure to a diversified range of asset classes. The actual financial instruments held by the Fund will, wherever practicably possible, be of a âpassiveâ nature: that is to say, collective investment schemes or other financial instruments that seek to track the performance of investment indices. The Fund may also invest in transferable securities, money market instruments, warrants, deposits, derivative instruments and, or indirectly through, collective investment schemes. Use may be made of stock-lending, borrowing, cash holdings and hedging.",
    "total_assets": null
  },
  "0P0000XOXO.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "NFU Mutual Unit Managers Limited",
    "long_name": "NFU Mutual Mixed Portfolio 20 - 60% Shares C",
    "manager_bio": "Paul Glover is NFU Mutualâs Chief Investment Manager and with input from the entire Investment Team has overall responsibility for the success of NFU Mutual's fund range. Paul joined NFU Mutual in 1986 as an Investment Analyst covering equity markets. He was appointed Head of International Equities in 1992 and has been Chief Investment Manager since January 2011. Paul graduated from Birmingham University in 1986 with an honours degree in Money, Banking & Finance and is a Fellow of the Securities Institute.",
    "manager_name": "Paul  Glover",
    "market": "gb_market",
    "short_name": "NFU Mutual Mixed Portfolio 20 -",
    "summary": "The investment objective of the Mixed Portfolio 20-60% Shares Fund is to generate long term (5 years+) capital growth and income (net of fees). The Mixed Portfolio 20-60% Shares Fund will invest between 20-60% of the Fundâs assets in equity related investments. The fund manager will usually invest in excess of 60% of the Fundâs assets in funds managed by N.F.U. Mutual Unit Managers Limited and third-party funds with compatible or similar objectives.",
    "total_assets": null
  },
  "0P0000XT99.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Premier Portfolio Managers Limited",
    "long_name": "Premier Miton Multi-Asset Monthly Income C Inccome",
    "manager_bio": "David Hambidge joined Premier Miton in December 1987 and specialises in the management of portfolios using collective investment vehicles including OEICs and investment trusts. David has been part of the original investment team that set up Premier Mitonâs original fund of funds in 1995 and was appointed lead manager in 1999, making him one of the most experienced fund of funds managers in the UK.",
    "manager_name": "David  Hambidge",
    "market": "gb_market",
    "short_name": "Premier Multi-Asset Monthly Inc",
    "summary": "The investment objective of the Fund is to provide a high level of income from a portfolio of investments. The investment policy of the Fund is to invest in units in collective investment schemes, the Fund may also invest in equities, fixed interest securities, money market instruments, deposits and warrants. The Fund may invest in unregulated collective investment schemes such as hedge funds (where investment in such funds would be consistent with the investment objective and policy of the Fund)",
    "total_assets": null
  },
  "0P0000XULG.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Stonehage Fleming Investment Management Limited",
    "long_name": "TM Stonehage Fleming Global Balanced Portfolio Fund Class A Sterling Income",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "TM Stonehage Fleming Global Bal",
    "summary": "To preserve capital in the medium term and to achieve capital growth in real terms over the longer term, whilst generating moderate levels of income.",
    "total_assets": null
  },
  "0P0000XXKK.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Quilter Investors Limited",
    "long_name": "Quilter Investors Cirilium Balanced Passive Portfolio R",
    "manager_bio": "Paul is manager of the Cirilium and Cirilium Passive portfolio ranges. He joined the business in December 2014 from Henderson Global Investors, following the acquisition of Cirilium. Paul has managed the Cirilium portfolios since 2009, taking on these responsibilities shortly after the inception of the original range. He has more than 25 years of asset management experience and has also acted as a non-executive director of four investment trusts.",
    "manager_name": "Paul  Craig",
    "market": "gb_market",
    "short_name": "Quilter Investors Cirilium Bala",
    "summary": "To achieve capital growth over a period of five years or more through investment in markets both in the UK and overseas. The Fund has exposure to securities of UK and overseas companies, fixed interest securities, cash, money-market instruments and deposits. The Fund will obtain this exposure by investing in a combination of collective investment schemes (which may include those schemes managed or operated by the ACD or an associate of the ACD) and exchange traded funds.",
    "total_assets": null
  },
  "0P0000XXV9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Greystone Cautious Managed Fund R Acc",
    "manager_bio": "James Menzies joined Greystone in December 2001 and became Investment Director in 2005. He leads the Greystone investment team and helped develop our fund of fund proposition. James contributes on asset allocation, fund selection and risk management at our fortnightly investment committee meetings. He is responsible for oversight of our investment philosophy, process and fund performance. James has grown the investment team over time and works closely with a group of talented analysts. He mentors university placement students through our yearlong intern programme, and has done so for over a decade. In recent years, he has been involved with the summer internship scheme for local sixth form pupils, offering work experience within our fund management team. James holds a BA (Hons) in International Relations from Nottingham Trent University and an MA in Finance and Investment from the University of Exeter. He is an associate member of CFA UK (formerly the UK Society of Investment Professionals) and holds professional qualifications in portfolio management, derivatives and investment analysis. James is a chartered fellow of the Chartered Institute of Securities and Investment and a Chartered Wealth Manager. He brings 19 years of experience to the role.",
    "manager_name": "James  Menzies",
    "market": "gb_market",
    "short_name": "VT Greystone Cautious Managed F",
    "summary": "The investment objective of the Company is to achieve positive returns by utilising a diversified portfolio of transferable securities, fixed interest securities, money market instruments, deposits, currencies, regulated and possibly unregulated collective investment schemes to the extent allowed by the FCA Rules and selected from a global market place. The Company will have a flexible but overall cautious investment strategy in terms of investment type and geographical or economic sectors, meaning that the Investment Adviser has discretion to arrange the portfolio of the Company towards investment types and/or sectors considered likely to achieve the cautious objective, including cash deposits, at any time subject to the restrictions of the IA Mixed Investment 20% - 60% Shares (previously the Investment Management Association Cautious Managed) definition.",
    "total_assets": null
  },
  "0P0000XXVA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Greystone Cautious Managed Fund R Inc",
    "manager_bio": "James Menzies joined Greystone in December 2001 and became Investment Director in 2005. He leads the Greystone investment team and helped develop our fund of fund proposition. James contributes on asset allocation, fund selection and risk management at our fortnightly investment committee meetings. He is responsible for oversight of our investment philosophy, process and fund performance. James has grown the investment team over time and works closely with a group of talented analysts. He mentors university placement students through our yearlong intern programme, and has done so for over a decade. In recent years, he has been involved with the summer internship scheme for local sixth form pupils, offering work experience within our fund management team. James holds a BA (Hons) in International Relations from Nottingham Trent University and an MA in Finance and Investment from the University of Exeter. He is an associate member of CFA UK (formerly the UK Society of Investment Professionals) and holds professional qualifications in portfolio management, derivatives and investment analysis. James is a chartered fellow of the Chartered Institute of Securities and Investment and a Chartered Wealth Manager. He brings 19 years of experience to the role.",
    "manager_name": "James  Menzies",
    "market": "gb_market",
    "short_name": "VT Greystone Cautious Managed F",
    "summary": "The investment objective of the Company is to achieve positive returns by utilising a diversified portfolio of transferable securities, fixed interest securities, money market instruments, deposits, currencies, regulated and possibly unregulated collective investment schemes to the extent allowed by the FCA Rules and selected from a global market place. The Company will have a flexible but overall cautious investment strategy in terms of investment type and geographical or economic sectors, meaning that the Investment Adviser has discretion to arrange the portfolio of the Company towards investment types and/or sectors considered likely to achieve the cautious objective, including cash deposits, at any time subject to the restrictions of the IA Mixed Investment 20% - 60% Shares (previously the Investment Management Association Cautious Managed) definition.",
    "total_assets": null
  },
  "0P0000XXVB.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS AFH Tactical Core Fund R Accumulation",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "MGTS AFH Tactical Core Fund R A",
    "summary": "The aim of the Fund is to achieve (but not guarantee) capital growth through an actively managed and diversified portfolio of investments on a medium risk basis.",
    "total_assets": null
  },
  "0P0000XYKM.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "WAY Global Balanced Portfolio Fundt E Inc",
    "manager_bio": "Gill Lakin has 22 yearsâ experience in the investment industry. Prior to joining Brompton, Gill was chief investment officer at Thornhill Investment Management, where she managed the investment team, the fund selection process and the asset allocation process, which involved all major asset classes. A graduate of Somerville College, Oxford, Gill worked previously at SociÃ©tÃ© GÃ©nÃ©rale Asset Management as head of UK research and at Prudential Portfolio Managers.",
    "manager_name": "Gill  Lakin",
    "market": "gb_market",
    "short_name": "WAY Global Balanced Portfolio F",
    "summary": "The objective of the Fund is to provide long-term capital growth through management of an internationally diversified portfolio of collective investment schemes.\nThis will give exposure to cash, fixed interest securities, equity and equity-linked investments selected from various markets worldwide encompassing a variety of economic sectors.The assets of the Fund will be managed in such a way that the units in the Fund will be qualifying investments for Individual Savings Accounts. The use of derivatives is not permitted but borrowing will be permitted on a temporary basis under the terms of the Regulations.",
    "total_assets": null
  },
  "0P0000XYNC.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Libero Strategic Fund D Accumulation",
    "manager_bio": "After graduating from\nCambridge in 1980 with\na degree in natural\nsciences, David began\nhis investment career as\na stockbroker at\nSheppards and Chase, before moving to Fleming\nPrivate Asset Management where he was a\nmember of the executive committee, chairman of\nthe strategy and stock selection committees and\nhead of charities. Following the takeover of\nFlemings in 2000, David became managing\ndirector and head of the UK private client\ninvestment team at JP Morgan Private Bank\nbefore moving to the Royal Bank of Canada to\nrun the British Isles investment business. David\njoined the company in 2007.",
    "manager_name": "David  Miller",
    "market": "gb_market",
    "short_name": "Libero Strategic Fund D Accumul",
    "summary": "The aim of the Libero Strategic Fund is to provide capital growth. \nThe Fund will aim to achieve its investment objective through strategic allocation in a portfolio of transferable securities (including investment trusts), collective investment schemes, deposits, approved money market instruments and derivatives.",
    "total_assets": null
  },
  "0P0000XYNE.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Libero Strategic Fund E Accumulation",
    "manager_bio": "After graduating from\nCambridge in 1980 with\na degree in natural\nsciences, David began\nhis investment career as\na stockbroker at\nSheppards and Chase, before moving to Fleming\nPrivate Asset Management where he was a\nmember of the executive committee, chairman of\nthe strategy and stock selection committees and\nhead of charities. Following the takeover of\nFlemings in 2000, David became managing\ndirector and head of the UK private client\ninvestment team at JP Morgan Private Bank\nbefore moving to the Royal Bank of Canada to\nrun the British Isles investment business. David\njoined the company in 2007.",
    "manager_name": "David  Miller",
    "market": "gb_market",
    "short_name": "Libero Strategic Fund E Accumul",
    "summary": "The aim of the Libero Strategic Fund is to provide capital growth. \nThe Fund will aim to achieve its investment objective through strategic allocation in a portfolio of transferable securities (including investment trusts), collective investment schemes, deposits, approved money market instruments and derivatives.",
    "total_assets": null
  },
  "0P0000YEG0.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "DMS Stirling House Growth Fund GBP Retail Accumulation Class",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "DMS Stirling House Growth Fund ",
    "summary": "The objective of the fund is to provide capital growth with some income over the medium to long term.\nThe Fund will seek to achieve its investment objective by gaining exposure generally to global equities, with some exposure to money market instruments, fixed interest securities, cash and near cash.",
    "total_assets": null
  },
  "0P0000YEG1.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "DMS Stirling House Growth Fund GBP Retail Income Class",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "DMS Stirling House Growth Fund ",
    "summary": "The objective of the fund is to provide capital growth with some income over the medium to long term.\nThe Fund will seek to achieve its investment objective by gaining exposure generally to global equities, with some exposure to money market instruments, fixed interest securities, cash and near cash.",
    "total_assets": null
  },
  "0P0000YJR9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Link Fund Solutions Limited",
    "long_name": "LF Cautela Fund Retail Accumulation",
    "manager_bio": "",
    "manager_name": "Nolan  Stanton",
    "market": "gb_market",
    "short_name": "LF Cautela Fund Retail Accumula",
    "summary": "The investment objective of the Fund is to achieve a positive return regardless of market conditions through a combination of capital growth and the generation of income over the medium to long term. \nThe Fund will achieve this by investing in, but is not restricted to, shares, bonds, or other transferable securities listed on the London and other Recognised Investment Exchanges. The asset classes in which the Fund is also permitted to invest includes transferable securities, units in collective investment schemes, money market instruments, deposits, warrants and derivative instruments and forward transactions for hedging purposes only.",
    "total_assets": null
  },
  "0P0000YR2K.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "TM Private Portfolio Trust A2000 Inc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "TM Private Portfolio Trust A200",
    "summary": "The objective of the Fund is to provide to the larger private investor an investment portfolio leading to a balanced return of capital and income, consisting of mainly leading securities which will offer a balanced spread of investment in any part of the world without restriction on economic sectors of investment. \nThe fund will invest mainly in equities and bonds either directly or via collective investment schemes but may also utilise a range of asset classes in order to achieve its objective. These may include cash, deposits, warrants, money market instruments, derivatives and forward transactions, funds (regulated and unregulated), transferable securities and may include exposure to currencies, commodities and property.",
    "total_assets": null
  },
  "0P0000YU6L.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "RBS Asset Management (Dublin) Limited",
    "long_name": "Coutts Multi Asset UK Balanced Fund A GBP Accumulating",
    "manager_bio": "",
    "manager_name": "David  Broomfield",
    "market": "gb_market",
    "short_name": "Coutts Multi Asset UK Balanced ",
    "summary": "The Fund aim is to maintain a balance between bonds and equities and to increase the value of the investment in the medium term while providing income.",
    "total_assets": null
  },
  "0P0000YU75.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "RBS Asset Management (Dublin) Limited",
    "long_name": "Coutts Multi Asset Global Balanced Fund A GBP Accumulating",
    "manager_bio": "",
    "manager_name": "David  Broomfield",
    "market": "gb_market",
    "short_name": "Coutts Multi Asset Global Balan",
    "summary": "The Fund aim is to maintain a balance between bonds and equities and to increase the value of the investment in the medium term while providing income.",
    "total_assets": null
  },
  "0P0000YU7A.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "RBS Asset Management (Dublin) Limited",
    "long_name": "Coutts Multi Asset Global Balanced Fund A GBP Distributing",
    "manager_bio": "",
    "manager_name": "David  Broomfield",
    "market": "gb_market",
    "short_name": "Coutts Multi Asset Global Balan",
    "summary": "The Fund aim is to maintain a balance between bonds and equities and to increase the value of the investment in the medium term while providing income.",
    "total_assets": null
  },
  "0P0000YU7B.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "RBS Asset Management (Dublin) Limited",
    "long_name": "Coutts Multi Asset Global Balanced Fund B GBP Distributing",
    "manager_bio": "",
    "manager_name": "David  Broomfield",
    "market": "gb_market",
    "short_name": "Coutts Multi Asset Global Balan",
    "summary": "The Fund aim is to maintain a balance between bonds and equities and to increase the value of the investment in the medium term while providing income.",
    "total_assets": null
  },
  "0P0000YUJ3.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Aegon Asset Management UK PLC",
    "long_name": "Aegon Ethical Cautious Managed Fund GBP B Inc",
    "manager_bio": "Audrey Ryan is an investment manager in the UK Equities team with responsibility for managing several funds, including the Kames Ethical Equity Fund and Kames UK Opportunities Fund. In addition, Audrey has analysis duties for the travel & leisure sector, and is a small-cap specialist. She joined us in 1997 from General Accident where she was a UK small companies portfolio manager. Audrey studied Accounting at Napier University, is a qualified chartered accountant and has an MSc in Investment Analysis.",
    "manager_name": "Audrey  Ryan",
    "market": "gb_market",
    "short_name": "Aegon Ethical Cautious Managed ",
    "summary": "The investment objective is to provide a combination of income and capital growth over any 7 year period. To invest in a diversified portfolio of equities denominated in any currency; and corporate bonds denominated in Sterling and issued anywhere in the world. Equities will be limited to a maximum of 60% of the Fund&#39;s value at all times. At least 80% of equity exposure will be to UK companies which are listed, quoted or traded in UK markets or which have their headquarters or a significant part of their activities in the UK but which may also be quoted on a regulated market outside of the UK. However, up to 20% of all equity investments may be made in non-UK companies.",
    "total_assets": null
  },
  "0P0000Z652.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Algebris (UK) Limited",
    "long_name": "Algebris UCITS Funds plc - Algebris Financial Income Fund BD GBP Inc Hedged",
    "manager_bio": "",
    "manager_name": "Mark  Conrad",
    "market": "gb_market",
    "short_name": "Algebris UCITS Funds plc - Alge",
    "summary": "The Fundâs objective is to maximise income and generate superior risk-adjusted returns over an investment cycle of approximately 3 to 5 years by investing in high dividend-yielding equity stocks and bonds.",
    "total_assets": null
  },
  "0P0000ZBUP.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "Verus Sustainable Balanced Fund A GBP Inc",
    "manager_bio": "",
    "manager_name": "Phoebe  Stone",
    "market": "gb_market",
    "short_name": "Verus Sustainable Balanced Fund",
    "summary": "The objective of the Fund is to provide income and capital growth",
    "total_assets": null
  },
  "0P0000ZBUQ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "Verus Sustainable Balanced Fund A GBP Acc",
    "manager_bio": "",
    "manager_name": "Phoebe  Stone",
    "market": "gb_market",
    "short_name": "Verus Sustainable Balanced Fund",
    "summary": "The objective of the Fund is to provide income and capital growth",
    "total_assets": null
  },
  "0P0000ZBUR.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "Verus Sustainable Balanced Fund B GBP Inc",
    "manager_bio": "",
    "manager_name": "Phoebe  Stone",
    "market": "gb_market",
    "short_name": "Verus Sustainable Balanced Fund",
    "summary": "The objective of the Fund is to provide income and capital growth",
    "total_assets": null
  },
  "0P0000ZBUS.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "Verus Sustainable Balanced Fund B GBP Acc",
    "manager_bio": "",
    "manager_name": "Phoebe  Stone",
    "market": "gb_market",
    "short_name": "Verus Sustainable Balanced Fund",
    "summary": "The objective of the Fund is to provide income and capital growth",
    "total_assets": null
  },
  "0P0000ZQJO.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Algebris (UK) Limited",
    "long_name": "Algebris UCITS Funds plc - Algebris Financial Income Fund ID GBP Inc",
    "manager_bio": "",
    "manager_name": "Mark  Conrad",
    "market": "gb_market",
    "short_name": "Algebris UCITS Funds plc - Alge",
    "summary": "The Fundâs objective is to maximise income and generate superior risk-adjusted returns over an investment cycle of approximately 3 to 5 years by investing in high dividend-yielding equity stocks and bonds.",
    "total_assets": null
  },
  "0P0000ZQKP.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ninety One Fund Managers UK Limited",
    "long_name": "Ninety One Cautious Managed Fund J Acc",
    "manager_bio": "Alastair is head of the Value team at Investec Asset Management having joined in 2000 from Morley Fund Management. Alastair manages a number of funds including the Investec Cautious Managed Fund and the Investec UK Special Situations Fund. He also manages the Temple Bar Investment Trust. Alastair graduated from City University with a Bachelor of Science degree in Actuarial Science in 1988.",
    "manager_name": "Alastair  Mundy",
    "market": "gb_market",
    "short_name": "Ninety One Cautious Managed Fun",
    "summary": "The Fund aims to provide capital growth (to grow the value of your investment) and income over at least 5 years. The Fund targets a return of UK Consumer Prices Index (CPI) +4% each year (before fees), over 5-year rolling periods. While the Fund aims to achieve its objective and its performance target, there is no guarantee that either will be achieved, over 5-year rolling periods or over any period and there is a risk of loss. The Fund invests primarily (at least two-thirds) in the shares of companies, and bonds (or similar debtbased assets) of borrowers, around the world. These bonds will be investment grade (have a relatively high credit rating).",
    "total_assets": null
  },
  "0P0000ZQW4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FIL Investment Services (UK) Ltd",
    "long_name": "Fidelity Investment Funds IV - Fidelity Multi Asset Balanced Income Fund W Incomeome",
    "manager_bio": "Eugene Philalithis joined Fidelity in 2007 as a Portfolio Manager, with a focus on fixed income and alternatives. Eugene manages a number of multi asset funds with internal and open architecture for both retail and institutional clients. He has currently 17 years of investment experience which includes Russell Investment in London and Canadian Imperial Bank of Commerce in Singapore. Eugene has a Bachelor or Engineering and an MBA, both from Imperial College, London.",
    "manager_name": "Eugene Peter Philalithis",
    "market": "gb_market",
    "short_name": "Fidelity Investment Funds IV - ",
    "summary": "The Fund aims to achieve an income yield of 3-5% per annum over a typical market cycle (5-7 years). The Fund also aims to increase the value of your investment over a period of 5 years or more. The Fund invests at least 70% into funds (including index-tracking funds and funds managed by Fidelity) which provide global exposure to a mixture of asset classes (including bonds, equities and alternative investments). Alternative investments may include infrastructure securities and real estate. The Fund can also invest directly into transferable securities, money market instruments, cash and deposits, and is also able to use derivatives for efficient portfolio management and investment purposes.",
    "total_assets": null
  },
  "0P0000ZR2R.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Garraway Multi Asset Balanced Fund R GBP Inc",
    "manager_bio": "Mark is the lead Fund Manager of Garrawayâs range of multi-asset funds. Mark joined Garraway on the 26th March 2019 from City Financial where he headed the multi-asset team, joining in October 2012 as part of its acquisition of Eden Asset Management. He joined Eden in 2011 to head its multi-asset business. In 2009, he joined Henderson following its acquisition of New Star Asset Management, leading a team of six managing over Â£2 billion in assets across a range of low to high-risk mandates. He had previously spent six years at New Star Asset Management managing a range of award-winning funds. Mark has a degree in Law and Economics from Newcastle University.",
    "manager_name": "Mark  Harris",
    "market": "gb_market",
    "short_name": "VT Garraway Multi Asset Balance",
    "summary": "The investment objective is to achieve returns from both capital and income over the long term (5 years) by investing across a global portfolio of assets. The portfolio invests in a combination of specialist Funds, ETFs, listed investment vehicles, individual securities and cash, and uses derivatives for hedging and investment purposes to both reduce market risk and enhance returns. As a consequence, the portfolio exhibits modest correlation to traditional asset classes. Positions are generally held with a three to five year time horizon. However, the management of the portfolio is active and the investment strategy is liquid and dynamic in order to adapt to changing market conditions.",
    "total_assets": null
  },
  "0P00011RTE.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "EF Tellsons Endeavour Z GBP Income",
    "manager_bio": "Joseph Bunting is the founder of Tellsons, the Managing Partner responsible for the day to day running of the partnership and Co-CIO of the Endeavour Fund. Joe has 25 years of investment experience in corporate debt, merger and buyout financing, and multi-asset investments with Paribas, Goldman Sachs and Alliance Capital LLC. Joe took an MA from Edinburgh University, specialising in History and Economics, after service with the British Army in Germany.",
    "manager_name": "Joseph  Bunting",
    "market": "gb_market",
    "short_name": "EF Tellsons Endeavour Z GBP Inc",
    "summary": "The investment objective of the Fund is to target capital growth, with less of the volatility of global equities1 , at a rate of 3-4% (net of fees) in excess of a composite performance benchmark2 over a 5 year period. The target performance benchmark represents 50% of UK Consumer Prices Index (CPI) (rolling 5-year average) and 50% of the FTSE Actuaries UK Conventional Gilts up to 5 years Index. Volatility is measured against the MSCI World 100% Hedged to GBP Index. The Investment Manager aims to achieve the Fund&#39;s objective by investing at least 80% of its net assets directly in a diverse allocation of global equities and corporate bonds.",
    "total_assets": null
  },
  "0P00011RTF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "EF Tellsons Endeavour Z GBP Accumulation",
    "manager_bio": "Joseph Bunting is the founder of Tellsons, the Managing Partner responsible for the day to day running of the partnership and Co-CIO of the Endeavour Fund. Joe has 25 years of investment experience in corporate debt, merger and buyout financing, and multi-asset investments with Paribas, Goldman Sachs and Alliance Capital LLC. Joe took an MA from Edinburgh University, specialising in History and Economics, after service with the British Army in Germany.",
    "manager_name": "Joseph  Bunting",
    "market": "gb_market",
    "short_name": "EF Tellsons Endeavour Z GBP Acc",
    "summary": "The investment objective of the Fund is to target capital growth, with less of the volatility of global equities1 , at a rate of 3-4% (net of fees) in excess of a composite performance benchmark2 over a 5 year period. The target performance benchmark represents 50% of UK Consumer Prices Index (CPI) (rolling 5-year average) and 50% of the FTSE Actuaries UK Conventional Gilts up to 5 years Index. Volatility is measured against the MSCI World 100% Hedged to GBP Index. The Investment Manager aims to achieve the Fund&#39;s objective by investing at least 80% of its net assets directly in a diverse allocation of global equities and corporate bonds.",
    "total_assets": null
  },
  "0P00011RTG.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "EF Tellsons Endeavour A GBP Income",
    "manager_bio": "Joseph Bunting is the founder of Tellsons, the Managing Partner responsible for the day to day running of the partnership and Co-CIO of the Endeavour Fund. Joe has 25 years of investment experience in corporate debt, merger and buyout financing, and multi-asset investments with Paribas, Goldman Sachs and Alliance Capital LLC. Joe took an MA from Edinburgh University, specialising in History and Economics, after service with the British Army in Germany.",
    "manager_name": "Joseph  Bunting",
    "market": "gb_market",
    "short_name": "EF Tellsons Endeavour A GBP Inc",
    "summary": "The investment objective of the Fund is to target capital growth, with less of the volatility of global equities1 , at a rate of 3-4% (net of fees) in excess of a composite performance benchmark2 over a 5 year period. The target performance benchmark represents 50% of UK Consumer Prices Index (CPI) (rolling 5-year average) and 50% of the FTSE Actuaries UK Conventional Gilts up to 5 years Index. Volatility is measured against the MSCI World 100% Hedged to GBP Index. The Investment Manager aims to achieve the Fund&#39;s objective by investing at least 80% of its net assets directly in a diverse allocation of global equities and corporate bonds.",
    "total_assets": null
  },
  "0P00011RTH.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "EF Tellsons Endeavour A GBP Accumulation",
    "manager_bio": "Joseph Bunting is the founder of Tellsons, the Managing Partner responsible for the day to day running of the partnership and Co-CIO of the Endeavour Fund. Joe has 25 years of investment experience in corporate debt, merger and buyout financing, and multi-asset investments with Paribas, Goldman Sachs and Alliance Capital LLC. Joe took an MA from Edinburgh University, specialising in History and Economics, after service with the British Army in Germany.",
    "manager_name": "Joseph  Bunting",
    "market": "gb_market",
    "short_name": "EF Tellsons Endeavour A GBP Acc",
    "summary": "The investment objective of the Fund is to target capital growth, with less of the volatility of global equities1 , at a rate of 3-4% (net of fees) in excess of a composite performance benchmark2 over a 5 year period. The target performance benchmark represents 50% of UK Consumer Prices Index (CPI) (rolling 5-year average) and 50% of the FTSE Actuaries UK Conventional Gilts up to 5 years Index. Volatility is measured against the MSCI World 100% Hedged to GBP Index. The Investment Manager aims to achieve the Fund&#39;s objective by investing at least 80% of its net assets directly in a diverse allocation of global equities and corporate bonds.",
    "total_assets": null
  },
  "0P00011RTI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "EF Tellsons Endeavour PF GBP Accumulation",
    "manager_bio": "Joseph Bunting is the founder of Tellsons, the Managing Partner responsible for the day to day running of the partnership and Co-CIO of the Endeavour Fund. Joe has 25 years of investment experience in corporate debt, merger and buyout financing, and multi-asset investments with Paribas, Goldman Sachs and Alliance Capital LLC. Joe took an MA from Edinburgh University, specialising in History and Economics, after service with the British Army in Germany.",
    "manager_name": "Joseph  Bunting",
    "market": "gb_market",
    "short_name": "EF Tellsons Endeavour PF GBP Ac",
    "summary": "The investment objective of the Fund is to target capital growth, with less of the volatility of global equities1 , at a rate of 3-4% (net of fees) in excess of a composite performance benchmark2 over a 5 year period. The target performance benchmark represents 50% of UK Consumer Prices Index (CPI) (rolling 5-year average) and 50% of the FTSE Actuaries UK Conventional Gilts up to 5 years Index. Volatility is measured against the MSCI World 100% Hedged to GBP Index. The Investment Manager aims to achieve the Fund&#39;s objective by investing at least 80% of its net assets directly in a diverse allocation of global equities and corporate bonds.",
    "total_assets": null
  },
  "0P00011WRP.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Liontrust Multi-Asset Limited",
    "long_name": "Liontrust MA Passive Moderate Fund Class S Accumulation",
    "manager_bio": "Previously working as an analyst at AXA Winterthur, Stephen joined Architas when it was established in June 2008. Stephen oversees the Architas Multi-Asset Passive Range of funds including fund selection and the implementation of cash flows for these products and the various passive offerings available to our European clients. He is also responsible for recommending and reviewing passive investments for all Architas products.\nAdditionally Stephen covers fund research across a variety of other sectors including leading the research for the three IMA managed sectors. Stephenâs investment experience has been gained from a variety of areas including a total of 15 years working for US investment bank, Morgan Stanley, where he was as an executive director on the programme trading desk, in charge of trade implementation. At Winterthur Life Stephen managed the Investment Technical Support Team, assisting Winterthurâs sales team and financial advisers on their collective investment offerings. He is an FCA approved person and has passed the IMC and other exams from the Securities Institute, including financial derivatives and commodities.",
    "manager_name": "Stephen  Allen",
    "market": "gb_market",
    "short_name": "Liontrust MA Passive Moderate F",
    "summary": "The investment objective of the Fund is to seek to achieve a return for investors over the medium to long term based on a combination of capital growth and income and with a below median volatility level through exposure to a diversified range of asset classes. The actual financial instruments held by the Fund will, wherever practicably possible, be of a âpassiveâ nature: that is to say, collective investment schemes or other financial instruments that seek to track the performance of investment indices. The Fund may also invest in transferable securities, money market instruments, warrants, deposits, derivative instruments and, or indirectly through, collective investment schemes. Use may be made of stock-lending, borrowing, cash holdings and hedging.",
    "total_assets": null
  },
  "0P00012JE4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Scottish Widows Unit Trust Managers Ltd",
    "long_name": "Scottish Widows Investment Portfolio ICVC Managed Growth Fund 4 L Net GBP Acc",
    "manager_bio": "\"Jeff is an investment director in the global strategy and balanced funds team. Since the start of 2004, he has been responsible for the implementation of strategy for our mixed funds. Prior to that, he was a fund manager and analyst with our UK equity team.\n\nJeff joined SWIP in 1994 from Scottish Provident, where he spent five years as a UK equity analyst. He has also worked for BZW as a mining analyst, and spent six years in South Africa with Gold Fields.\n\nJeff holds a BSc in mining engineering from Strathclyde University.\"\n\nSource: SWIP website",
    "manager_name": "Shanshan  Zhang",
    "market": "gb_market",
    "short_name": "Scottish Widows Investment Port",
    "summary": "The Sub-fund aims to achieve capital growth by investing in a portfolio of collective investment schemes to achieve exposure to a wide range of investments, consisting of UK and Global shares and fixed interest securities, with the remainder in property assets and some exposure to absolute return strategies.",
    "total_assets": null
  },
  "0P000131TC.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund C Income shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P000131TD.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund C Accumulation shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P000131TE.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund D Income shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P000131TF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund D Accumulation shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "gb_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P00013K4A.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Premier Portfolio Managers Limited",
    "long_name": "Premier Miton Liberation No. V B income",
    "manager_bio": "David Hambidge joined Premier Miton in December 1987 and specialises in the management of portfolios using collective investment vehicles including OEICs and investment trusts. David has been part of the original investment team that set up Premier Mitonâs original fund of funds in 1995 and was appointed lead manager in 1999, making him one of the most experienced fund of funds managers in the UK.",
    "manager_name": "David  Hambidge",
    "market": "gb_market",
    "short_name": "Premier Liberation No. V Fund B",
    "summary": "The objective of the Fund is to provide an income together with capital growth over the long-term, being five years or more, whilst seeking to remain within a defined risk profile with defined volatility parameters which may result in the income and the capital growth from the Fund being constrained. The Investment Adviser will aim to maintain a risk profile classification of 5 as set and monitored by an external third party risk rating company. Five years is also the minimum recommended period for holding shares in this Fund. This does not mean that the Fund will achieve the objective throughout this, or any other, specific time period and there is a risk of loss to the original capital invested.",
    "total_assets": null
  },
  "0P00013LZF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Nedgroup Investments (IOM) Ltd",
    "long_name": "Nedgroup Investments MultiFunds Balanced Fund Class C GBP Accumulating Share Class",
    "manager_bio": "Trevor is responsible for the on-going research and management of BoE Private Clients' domestic and international (Isle of Man registered) range of Fund of Fund collective investments. Prior to his current role, he served as a director of Edge Asset Management after the merger of Edge and TMA Investment Products Services. Trevor joined TMA in 1997 to launch the Investment Management Services division, specialising in the development of multi-managed products. Further experience includes consultancy work at Barra International and lecturing in Economics and Finance at UCT.\n\nTrevor holds a B.Com (Hons) Economics, M.Com (Finance), MBA, Dip FMI (Cum Laude), SAFEX, ACIBM, CAIA",
    "manager_name": "Trevor  Garvin",
    "market": "gb_market",
    "short_name": "Nedgroup Investments MultiFunds",
    "summary": "The Sub-Fundâs objective will be to provide growth with moderate levels of risk and volatility over the medium to longer term than the other Sub-Funds of the Company.",
    "total_assets": null
  },
  "0P00013XC4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waverton Investment Management Ltd",
    "long_name": "Waverton Multi-Asset Income Fund P Stg&#194;&#163;",
    "manager_bio": "James joined the company in September 2012 as an Assistant Portfolio Manager for the Managed Portfolio Service Team. He is now the lead manager of the Waverton Multi-Asset Income Fund, and co-manager of the Waverton Real Assets Fund and Waverton Absolute Return Fund. James is also co-manager of the Waverton Protection Strategy and is a member of the Asset Allocation Committee. James graduated from Bristol University in 2012 with a degree in Law and is a CFA Charterholder. In May 2016 he won the WealthBriefing European Rising Star Award.",
    "manager_name": "James  Mee",
    "market": "gb_market",
    "short_name": "Waverton Multi-Asset Income Fun",
    "summary": "The investment objective of the Fund is to achieve capital growth and generate income through investment of up to 100 per cent. of its assets in a diversified portfolio of equities, global government and corporate Debt Securities, Structured Products, deposits, cash, money market instruments and collective investment schemes which may themselves invest in the foregoing asset classes and commodities to the extent that these are permitted by the UCITS Regulations.",
    "total_assets": null
  },
  "0P00015BWC.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Embark Investments Limited",
    "long_name": "Embark Horizon Multi-Asset Fund II Z Inc",
    "manager_bio": "Alex Lyle is Head of Managed Funds, EMEA. In this role he takes responsibility for a large number of the companyâs managed funds, is a member of the Asset Allocation Committee and is a key investment contact between the company and a number of its major clients. He joined the company in 1994 and was appointed Joint Head of UK / European Equity teams in 1999 and became Head of Managed Funds in 2003. Alex started his career at Hambros BankâsÂ¹ Unit Trust Division, which was acquired by Allied DunbarÂ² in 1981 and subsequently became part of Threadneedle Asset Management Limited in 1994. He managed UK equity portfolios for more than 20 years. He has a degree in Geography from Oxford University.",
    "manager_name": "Alex  Lyle",
    "market": "gb_market",
    "short_name": "Embark Horizon Multi-Asset Fund",
    "summary": "The Sub-fund aims to grow investment through a combination of income and capital growth over the medium to long term (5 or more years). At least two-thirds of the value of the Sub-fund will be invested in actively managed collective investment schemes managed or operated by companies within the Investment Managerâs group of companies. Investments in collective investment schemes may also include those managed, operated or advised by the ACD, or its associates.",
    "total_assets": null
  },
  "0P00015BWD.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Embark Investments Limited",
    "long_name": "Embark Horizon Multi-Asset Fund II Z Acc",
    "manager_bio": "Alex Lyle is Head of Managed Funds, EMEA. In this role he takes responsibility for a large number of the companyâs managed funds, is a member of the Asset Allocation Committee and is a key investment contact between the company and a number of its major clients. He joined the company in 1994 and was appointed Joint Head of UK / European Equity teams in 1999 and became Head of Managed Funds in 2003. Alex started his career at Hambros BankâsÂ¹ Unit Trust Division, which was acquired by Allied DunbarÂ² in 1981 and subsequently became part of Threadneedle Asset Management Limited in 1994. He managed UK equity portfolios for more than 20 years. He has a degree in Geography from Oxford University.",
    "manager_name": "Alex  Lyle",
    "market": "gb_market",
    "short_name": "Embark Horizon Multi-Asset Fund",
    "summary": "The Sub-fund aims to grow investment through a combination of income and capital growth over the medium to long term (5 or more years). At least two-thirds of the value of the Sub-fund will be invested in actively managed collective investment schemes managed or operated by companies within the Investment Managerâs group of companies. Investments in collective investment schemes may also include those managed, operated or advised by the ACD, or its associates.",
    "total_assets": null
  },
  "0P00015BWE.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Embark Investments Limited",
    "long_name": "Embark Horizon Multi Asset Fund III Z Inc",
    "manager_bio": "Alex Lyle is Head of Managed Funds, EMEA. In this role he takes responsibility for a large number of the companyâs managed funds, is a member of the Asset Allocation Committee and is a key investment contact between the company and a number of its major clients. He joined the company in 1994 and was appointed Joint Head of UK / European Equity teams in 1999 and became Head of Managed Funds in 2003. Alex started his career at Hambros BankâsÂ¹ Unit Trust Division, which was acquired by Allied DunbarÂ² in 1981 and subsequently became part of Threadneedle Asset Management Limited in 1994. He managed UK equity portfolios for more than 20 years. He has a degree in Geography from Oxford University.",
    "manager_name": "Alex  Lyle",
    "market": "gb_market",
    "short_name": "Embark Horizon Multi Asset Fund",
    "summary": "The Sub-fund aims to grow investment through a combination of income and capital growth over the medium to long term (5 or more years). At least two-thirds of the value of the Sub-fund will be invested in actively managed collective investment schemes managed or operated by companies within the Investment Managerâs group of companies. Investments in collective investment schemes may also include those managed, operated or advised by the ACD, or its associates.",
    "total_assets": null
  },
  "0P00015BWF.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Embark Investments Limited",
    "long_name": "Embark Horizon Multi Asset Fund III Z Acc",
    "manager_bio": "Alex Lyle is Head of Managed Funds, EMEA. In this role he takes responsibility for a large number of the companyâs managed funds, is a member of the Asset Allocation Committee and is a key investment contact between the company and a number of its major clients. He joined the company in 1994 and was appointed Joint Head of UK / European Equity teams in 1999 and became Head of Managed Funds in 2003. Alex started his career at Hambros BankâsÂ¹ Unit Trust Division, which was acquired by Allied DunbarÂ² in 1981 and subsequently became part of Threadneedle Asset Management Limited in 1994. He managed UK equity portfolios for more than 20 years. He has a degree in Geography from Oxford University.",
    "manager_name": "Alex  Lyle",
    "market": "gb_market",
    "short_name": "Embark Horizon Multi Asset Fund",
    "summary": "The Sub-fund aims to grow investment through a combination of income and capital growth over the medium to long term (5 or more years). At least two-thirds of the value of the Sub-fund will be invested in actively managed collective investment schemes managed or operated by companies within the Investment Managerâs group of companies. Investments in collective investment schemes may also include those managed, operated or advised by the ACD, or its associates.",
    "total_assets": null
  },
  "0P00015HLT.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Canaccord Genuity Management Company Limited",
    "long_name": "CGWM Diversity Fund T GBP Hedged (Accumulation)",
    "manager_bio": "Justin is an Investment Director at Collins Stewart. Prior to joining Collins Stewart in December 2000, he spent 6 years at Kleinwort Benson where he established the groupâs multi-manager investment service. Justin is Deputy Chairman of Collins Stewart Wealth Managementâs asset allocation and fund selection committees and is co-manager of a number of the groupâs Select range of multi-manager, multi-asset funds, in addition to a number of private client and institutional portfolios. Justin is a Chartered Fellow of the Chartered Institute for Securities and Investment and is President of the Guernsey Branch.",
    "manager_name": "Justin  Oliver",
    "market": "gb_market",
    "short_name": "CGWM Diversity Fund T GBP Hedge",
    "summary": "The investment objective of the Fund is to generate capital growth by investing in an internationally diversified portfolio of shares and units in collective investment schemes and individual high quality fixed interest instruments.",
    "total_assets": null
  },
  "0P00015XT3.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Fd Adm Ltd",
    "long_name": "SVS True Potential Investments Cautious 1 A GBP Accumulation",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "SVS True Potential Investments ",
    "summary": "The Fund aims to provide income and moderate capital growth by investing directly and indirectly in a selected range of investments in the UK and around the world, which may include:\nâ¢ shares\nâ¢ bonds issued by companies, governments and other organisations.\nThe Fund may also make other investments, including:\nâ¢ cash, deposits and money market instruments\nâ¢ other investment funds\nâ¢ warrants.",
    "total_assets": null
  },
  "0P00015XT4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Fd Adm Ltd",
    "long_name": "SVS True Potential Investments Cautious 2 Income A GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "SVS True Potential Investments ",
    "summary": "The Fund aims to provide income with capital growth. The fund aims to have a return in excess of what ordinarily can be expected from a basket of UK equities consisting of the top thousand listed holdings in the UK based on capitalisation, by investing directly and indirectly in a selected range of investments in the UK and around the world, which may include:\nâ¢ shares\nâ¢ bonds issued by companies, governments and other organisations\nThe Fund may also make other investments, including:\nâ¢ cash, deposits and money market instruments\nâ¢ other investment funds\nâ¢ warrants.",
    "total_assets": null
  },
  "0P00015XT5.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Fd Adm Ltd",
    "long_name": "SVS True Potential Investments Cautious 3 A GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "SVS True Potential Investments ",
    "summary": "The Fund aims to provide capital growth and income by investing directly and indirectly a selected range of investments in the UK and around the world, primarily in:\nâ¢ shares,\nâ¢ bonds issued by companies, governments and other organisations\nâ¢ other investment funds.\nThe Fund may also make other investments including:\nâ¢ warrants.\nThe Fund may hold up to 100% of its Scheme Property in collective investment vehicles.",
    "total_assets": null
  },
  "0P000163AZ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Nedgroup Investments (IOM) Ltd",
    "long_name": "Nedgroup Investments Global Flexible Fund C GBP Hedged Accumulation",
    "manager_bio": "Brian A. Selmo, CFA, Partner, joined FPA in 2008. Brian serves as Portfolio Manager and Director of Research for the FPA Contrarian Value Strategy, the FPA Contrarian Value Equity Strategy, and Source Capital, Inc. Prior to joining FPA, Brian was founder and managing member of Eagle Lake Capital, LLC, and Portfolio Manager of its predecessor. Previously, he was an analyst at Third Avenue Management and Rothschild, Inc. Brian earned a Bachelor's degree in Economics (with honors) from The Johns Hopkins University, where he graduated Phi Beta Kappa.",
    "manager_name": "Brian A. Selmo",
    "market": "gb_market",
    "short_name": "Nedgroup Investments Global Fle",
    "summary": "The Sub-Fundâs objective will be to provide investors with long term capital growth. In order to pursue its objective the Sub-Fund will employ an active management approach and may invest in equity securities which will primarily be common stocks and other securities with equity characteristics, comprising preferred stocks, warrants and rights (which are issued by a company to allow holders to subscribe for additional securities issued by that company), as well as depository receipts (such as ADRs, EDRs and GDRs) for such securities and bonds convertible into such equity securities.",
    "total_assets": null
  },
  "0P00016FRH.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Liontrust Multi-Asset Limited",
    "long_name": "Liontrust MA Passive Moderate Fund Class D Income",
    "manager_bio": "Previously working as an analyst at AXA Winterthur, Stephen joined Architas when it was established in June 2008. Stephen oversees the Architas Multi-Asset Passive Range of funds including fund selection and the implementation of cash flows for these products and the various passive offerings available to our European clients. He is also responsible for recommending and reviewing passive investments for all Architas products.\nAdditionally Stephen covers fund research across a variety of other sectors including leading the research for the three IMA managed sectors. Stephenâs investment experience has been gained from a variety of areas including a total of 15 years working for US investment bank, Morgan Stanley, where he was as an executive director on the programme trading desk, in charge of trade implementation. At Winterthur Life Stephen managed the Investment Technical Support Team, assisting Winterthurâs sales team and financial advisers on their collective investment offerings. He is an FCA approved person and has passed the IMC and other exams from the Securities Institute, including financial derivatives and commodities.",
    "manager_name": "Stephen  Allen",
    "market": "gb_market",
    "short_name": "Liontrust MA Passive Moderate F",
    "summary": "The investment objective of the Fund is to seek to achieve a return for investors over the medium to long term based on a combination of capital growth and income and with a below median volatility level through exposure to a diversified range of asset classes. The actual financial instruments held by the Fund will, wherever practicably possible, be of a âpassiveâ nature: that is to say, collective investment schemes or other financial instruments that seek to track the performance of investment indices. The Fund may also invest in transferable securities, money market instruments, warrants, deposits, derivative instruments and, or indirectly through, collective investment schemes. Use may be made of stock-lending, borrowing, cash holdings and hedging.",
    "total_assets": null
  },
  "0P00016HQ1.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Liontrust Multi-Asset Limited",
    "long_name": "Liontrust MA Passive Moderate Fund Class S Income",
    "manager_bio": "Previously working as an analyst at AXA Winterthur, Stephen joined Architas when it was established in June 2008. Stephen oversees the Architas Multi-Asset Passive Range of funds including fund selection and the implementation of cash flows for these products and the various passive offerings available to our European clients. He is also responsible for recommending and reviewing passive investments for all Architas products.\nAdditionally Stephen covers fund research across a variety of other sectors including leading the research for the three IMA managed sectors. Stephenâs investment experience has been gained from a variety of areas including a total of 15 years working for US investment bank, Morgan Stanley, where he was as an executive director on the programme trading desk, in charge of trade implementation. At Winterthur Life Stephen managed the Investment Technical Support Team, assisting Winterthurâs sales team and financial advisers on their collective investment offerings. He is an FCA approved person and has passed the IMC and other exams from the Securities Institute, including financial derivatives and commodities.",
    "manager_name": "Stephen  Allen",
    "market": "gb_market",
    "short_name": "Liontrust MA Passive Moderate F",
    "summary": "The investment objective of the Fund is to seek to achieve a return for investors over the medium to long term based on a combination of capital growth and income and with a below median volatility level through exposure to a diversified range of asset classes. The actual financial instruments held by the Fund will, wherever practicably possible, be of a âpassiveâ nature: that is to say, collective investment schemes or other financial instruments that seek to track the performance of investment indices. The Fund may also invest in transferable securities, money market instruments, warrants, deposits, derivative instruments and, or indirectly through, collective investment schemes. Use may be made of stock-lending, borrowing, cash holdings and hedging.",
    "total_assets": null
  },
  "0P00016RHJ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "EF Tellsons Endeavour SP GBP Accumulation",
    "manager_bio": "Joseph Bunting is the founder of Tellsons, the Managing Partner responsible for the day to day running of the partnership and Co-CIO of the Endeavour Fund. Joe has 25 years of investment experience in corporate debt, merger and buyout financing, and multi-asset investments with Paribas, Goldman Sachs and Alliance Capital LLC. Joe took an MA from Edinburgh University, specialising in History and Economics, after service with the British Army in Germany.",
    "manager_name": "Joseph  Bunting",
    "market": "gb_market",
    "short_name": "EF Tellsons Endeavour SP GBP Ac",
    "summary": "The investment objective of the Fund is to target capital growth, with less of the volatility of global equities1 , at a rate of 3-4% (net of fees) in excess of a composite performance benchmark2 over a 5 year period. The target performance benchmark represents 50% of UK Consumer Prices Index (CPI) (rolling 5-year average) and 50% of the FTSE Actuaries UK Conventional Gilts up to 5 years Index. Volatility is measured against the MSCI World 100% Hedged to GBP Index. The Investment Manager aims to achieve the Fund&#39;s objective by investing at least 80% of its net assets directly in a diverse allocation of global equities and corporate bonds.",
    "total_assets": null
  },
  "0P00016RHK.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Omnis Investments Limited",
    "long_name": "Omnis Multi-Asset Income Fund Class A Accumulation",
    "manager_bio": "Paul is a portfolio manager and strategist at Newton. He is lead manager of the Multi-Asset Diversified Return, Multi-Asset Income and Newton Multi-Asset Growth strategies. Paul is responsible for generating ideas within alternative assets and has been leading in this area since 2008. He is a member of the asset class strategy group and provides feedback to the wider house on strategic and tactical asset allocation on geographical, asset class and sector allocations.\nPaul joined Newton in 2004. He is a CFA1 charterholder and has completed the certificate in quantitative finance (CQF) after passing with distinction. Paul studied Astrophysics at the University of St Andrews and is a keen cyclist and runner, having recently cycled the length of the UK from Landâs End to John OâGroats and often participates in marathons.",
    "manager_name": "Paul  Flood",
    "market": "gb_market",
    "short_name": "Omnis Multi-Asset Income Fund C",
    "summary": "To provide income with the potential for capital growth over the medium to longer term.",
    "total_assets": null
  },
  "0P00017CU6.F": {
    "category": "GBP Moderate Allocation",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Hawksmoor The Vanbrugh Fund B Accumulation EUR shares",
    "manager_bio": "Daniel joined Hawksmoor in 2009. His investment career began in 1998 and he has managed funds of funds since 2001, winning the Investment Week Fund Manager of the Year in 2008 and being rated by Citywire along the way.",
    "manager_name": "Daniel  Lockyer",
    "market": "dr_market",
    "short_name": "MI Hawksmoor The Vanbrugh Fund ",
    "summary": "The investment objective of the Fund is to provide capital growth and income. The Fundâs portfolio will consist primarily of a diversified range of open and closed ended funds. The portfolio will be actively managed, with the Investment Manager seeking to take advantage of inefficiencies in the pricing of closed ended funds and significant movements in financial markets.",
    "total_assets": null
  },
  "0P00017EGT.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "Acumen Income Portfolio Class Accumulation",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Acumen Income Portfolio Class A",
    "summary": "The aim of the Fund is to provide income, that is money paid out from investments such as dividends from shares and interest from bonds, with the potential for some increase, over a minimum of 5 years, in the value of an investment. \nThe Fund aims to outperform the Market Composite Benchmark over any 3 year period, after any charges have been taken out of the Fund. However, there is no certainty this will be achieved.\nPerformance Target: The Market Composite Benchmark for the ACUMEN Income Portfolio Fund is comprised as follows: \nâ¢40% Bonds - \nï°Bloomberg Barclays Global Aggregate Bond GBP Hedged Index (30%)\nï°Bloomberg Barclays Global High Yield Bond GBP Hedged Index (10%)\nâ¢55% Equities - \nï°MSCI World Index GBP Hedged (45%)\nï°MSCI Emerging Markets Investable Market Index (10%)\nâ¢5% Cash - \nï°Sterling Overnight Index Average (5%)",
    "total_assets": null
  },
  "0P00017EGV.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "Acumen Income Portfolio Class Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Acumen Income Portfolio Class I",
    "summary": "The aim of the Fund is to provide income, that is money paid out from investments such as dividends from shares and interest from bonds, with the potential for some increase, over a minimum of 5 years, in the value of an investment. \nThe Fund aims to outperform the Market Composite Benchmark over any 3 year period, after any charges have been taken out of the Fund. However, there is no certainty this will be achieved.\nPerformance Target: The Market Composite Benchmark for the ACUMEN Income Portfolio Fund is comprised as follows: \nâ¢40% Bonds - \nï°Bloomberg Barclays Global Aggregate Bond GBP Hedged Index (30%)\nï°Bloomberg Barclays Global High Yield Bond GBP Hedged Index (10%)\nâ¢55% Equities - \nï°MSCI World Index GBP Hedged (45%)\nï°MSCI Emerging Markets Investable Market Index (10%)\nâ¢5% Cash - \nï°Sterling Overnight Index Average (5%)",
    "total_assets": null
  },
  "0P00017IPT.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Smartfund Balanced Strategy Fund F GBP Inc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "VT Smartfund Balanced Strategy ",
    "summary": "To provide income and capital growth over the medium to long term (3 to 5 years). The Fund will seek to achieve its investment objective through investing primarily (70%) in a diversified portfolio of collective investment schemes and other permitted investments that have a similarly diversified character such as investment companies and exchange traded funds (ETFs).",
    "total_assets": null
  },
  "0P00017IPU.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Smartfund Balanced Strategy Fund Z GBP Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "VT Smartfund Balanced Strategy ",
    "summary": "To provide income and capital growth over the medium to long term (3 to 5 years). The Fund will seek to achieve its investment objective through investing primarily (70%) in a diversified portfolio of collective investment schemes and other permitted investments that have a similarly diversified character such as investment companies and exchange traded funds (ETFs).",
    "total_assets": null
  },
  "0P00017OV6.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS IBOSS 2 X Inc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "MGTS IBOSS 2 X Inc",
    "summary": null,
    "total_assets": null
  },
  "0P00017OV7.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS IBOSS 2 X Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "MGTS IBOSS 2 X Acc",
    "summary": null,
    "total_assets": null
  },
  "0P00017OV8.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS IBOSS 2 R Inc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "MGTS IBOSS 2 R Inc",
    "summary": null,
    "total_assets": null
  },
  "0P00017OV9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "MGTS IBOSS 2 R Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "MGTS IBOSS 2 R Acc",
    "summary": null,
    "total_assets": null
  },
  "0P00019ABI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Cornelian Asset Managers Ltd",
    "long_name": "SVS Cornelian Managed Growth RMP H GBP Acc",
    "manager_bio": "David joined Brooks Macdonald in 2020 and is jointly responsible for managing the risk managed multi-asset fund solutions. Prior to this, David worked at Cornelian Asset Managers, before its acquisition by Brooks Macdonald, where he joined the investment team in 2013 and helped to develop the firmâs risk managed multi-asset fund proposition to financial advisors. He also worked for 10 years at Alder Investment Management, a London-based family office, and has 17 yearsâ experience in financial services.David studied Economics at the University of Edinburgh before obtaining an MSc in International Banking & Finance from Heriot Watt University. He is a Chartered Fellow of the Chartered Institute for Securities & Investment (CISI).",
    "manager_name": "David  Appleton",
    "market": "gb_market",
    "short_name": "SVS Cornelian Managed Growth RM",
    "summary": null,
    "total_assets": null
  },
  "0P00019ABJ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Cornelian Asset Managers Ltd",
    "long_name": "SVS Cornelian Managed Growth RMP H GBP Inc",
    "manager_bio": "David joined Brooks Macdonald in 2020 and is jointly responsible for managing the risk managed multi-asset fund solutions. Prior to this, David worked at Cornelian Asset Managers, before its acquisition by Brooks Macdonald, where he joined the investment team in 2013 and helped to develop the firmâs risk managed multi-asset fund proposition to financial advisors. He also worked for 10 years at Alder Investment Management, a London-based family office, and has 17 yearsâ experience in financial services.David studied Economics at the University of Edinburgh before obtaining an MSc in International Banking & Finance from Heriot Watt University. He is a Chartered Fellow of the Chartered Institute for Securities & Investment (CISI).",
    "manager_name": "David  Appleton",
    "market": "gb_market",
    "short_name": "SVS Cornelian Managed Growth RM",
    "summary": null,
    "total_assets": null
  },
  "0P00019O4Z.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Smith & Williamson Fd Adm Ltd",
    "long_name": "SVS True Potential Investments OEIC 1 - Income Builder 1 A Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "SVS True Potential Investments ",
    "summary": null,
    "total_assets": null
  },
  "0P0001AIZR.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Redlands ICVC - VT Redlands Multi-Asset Portfolio A GBP Acc",
    "manager_bio": "Alan joined Skandia Investment Management Ltd from Hargreaves Lansdown Asset Management. Alan has over 12 years experience in investment management â managing a wide range of mandates during his tenure at HL including both direct equity and fund of funds. He is recognised within the industry as a very successful fund manager and one of the few manager of managers who can truly speak with other fund managers having managed direct equities himself.",
    "manager_name": "Alan  Durrant",
    "market": "gb_market",
    "short_name": "VT Redlands ICVC - VT Redlands ",
    "summary": "The objective of the VT Redlands Multi-Asset Portfolio is to provide capital growth. The Fund seeks to achieve its objective by investing primarily (at least 70%) in collective investment vehicles (including for example collective investment schemes, exchange traded funds and investment trusts) which provide exposure to various different asset classes including equities, bonds (investment grade and subinvestment grade) and assets having absolute return strategies. The Fund may also invest directly in other collective investment schemes (including those which are managed or advised by the ACD or Manager), transferable securities, money market instruments, deposits, cash and near cash.",
    "total_assets": null
  },
  "0P0001AKGU.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Ravenscroft Balanced Fund A Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Ravenscroft Huntress Balan",
    "summary": "The aim of the Fund is to provide capital growth, that is, to increase the value of your investment, over a minimum of 5 years. At least 90% of the Fund will be invested in other funds, including exchange traded funds and investment trusts, collectively âInvestment Fundsâ. This may include other funds operated by the Authorized Corporate Director or its associates.",
    "total_assets": null
  },
  "0P0001AKGV.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Ravenscroft Balanced Fund A Inc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Ravenscroft Huntress Balan",
    "summary": "The aim of the Fund is to provide capital growth, that is, to increase the value of your investment, over a minimum of 5 years. At least 90% of the Fund will be invested in other funds, including exchange traded funds and investment trusts, collectively âInvestment Fundsâ. This may include other funds operated by the Authorized Corporate Director or its associates.",
    "total_assets": null
  },
  "0P0001AKGW.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Ravenscroft Balanced Fund B Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Ravenscroft Huntress Balan",
    "summary": "The aim of the Fund is to provide capital growth, that is, to increase the value of your investment, over a minimum of 5 years. At least 90% of the Fund will be invested in other funds, including exchange traded funds and investment trusts, collectively âInvestment Fundsâ. This may include other funds operated by the Authorized Corporate Director or its associates.",
    "total_assets": null
  },
  "0P0001AKGX.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Ravenscroft Balanced Fund B Inc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Ravenscroft Huntress Balan",
    "summary": "The aim of the Fund is to provide capital growth, that is, to increase the value of your investment, over a minimum of 5 years. At least 90% of the Fund will be invested in other funds, including exchange traded funds and investment trusts, collectively âInvestment Fundsâ. This may include other funds operated by the Authorized Corporate Director or its associates.",
    "total_assets": null
  },
  "0P0001BC67.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FundRock Partners Limited",
    "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Cautious Fund B GBP Income",
    "manager_bio": "Jonathon graduated from the University of East Anglia with a first-class honours degree in Business Management, covering accounting, finance and economics. Having completed work experience with Standard Life and Rathbones, he joined Mattioli Woods in 2015. Jonathon holds the CII Certificate in Investment Operations, CISI Investment Advice Diploma and has passed Level 1 of the CFA Program.",
    "manager_name": "Ian  Goodchild",
    "market": "gb_market",
    "short_name": "FP Mattioli Woods Funds ICVC - ",
    "summary": "The investment objective of the Fund is to preserve capital and generate moderate income and capital growth over the long-term.",
    "total_assets": null
  },
  "0P0001BC68.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FundRock Partners Limited",
    "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Cautious Fund C GBP Income",
    "manager_bio": "Jonathon graduated from the University of East Anglia with a first-class honours degree in Business Management, covering accounting, finance and economics. Having completed work experience with Standard Life and Rathbones, he joined Mattioli Woods in 2015. Jonathon holds the CII Certificate in Investment Operations, CISI Investment Advice Diploma and has passed Level 1 of the CFA Program.",
    "manager_name": "Ian  Goodchild",
    "market": "gb_market",
    "short_name": "FP Mattioli Woods Funds ICVC - ",
    "summary": "The investment objective of the Fund is to preserve capital and generate moderate income and capital growth over the long-term.",
    "total_assets": null
  },
  "0P0001BC69.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FundRock Partners Limited",
    "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Cautious Fund D GBP Income",
    "manager_bio": "Jonathon graduated from the University of East Anglia with a first-class honours degree in Business Management, covering accounting, finance and economics. Having completed work experience with Standard Life and Rathbones, he joined Mattioli Woods in 2015. Jonathon holds the CII Certificate in Investment Operations, CISI Investment Advice Diploma and has passed Level 1 of the CFA Program.",
    "manager_name": "Ian  Goodchild",
    "market": "gb_market",
    "short_name": "FP Mattioli Woods Funds ICVC - ",
    "summary": "The investment objective of the Fund is to preserve capital and generate moderate income and capital growth over the long-term.",
    "total_assets": null
  },
  "0P0001BC6A.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FundRock Partners Limited",
    "long_name": "FP Mattioli Woods Funds ICVC - FP Mattioli Woods Cautious Fund E GBP Income",
    "manager_bio": "Jonathon graduated from the University of East Anglia with a first-class honours degree in Business Management, covering accounting, finance and economics. Having completed work experience with Standard Life and Rathbones, he joined Mattioli Woods in 2015. Jonathon holds the CII Certificate in Investment Operations, CISI Investment Advice Diploma and has passed Level 1 of the CFA Program.",
    "manager_name": "Ian  Goodchild",
    "market": "gb_market",
    "short_name": "FP Mattioli Woods Funds ICVC - ",
    "summary": "The investment objective of the Fund is to preserve capital and generate moderate income and capital growth over the long-term.",
    "total_assets": null
  },
  "0P0001C8AA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Equilibrium Balanced Portfolio A GBP Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Equilibrium Balanced Portf",
    "summary": "The Fund aims to deliver returns greater than inflation over a minimum of 5 years, through a combination of capital growth, that is profit on investments, and income paid out of investments, such as interest and dividends, after any charges have been taken out of the Fund. However, there is no certainty this will be achieved. Over the longer term, any 10 year period, the Fund aims to deliver an average of inflation plus 5% per annum. Inflation is measured as the UK Consumer Prices Index for these purposes.",
    "total_assets": null
  },
  "0P0001CLT6.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Tatton Blended Balanced Fund A Acc",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "gb_market",
    "short_name": "VT Tatton Blended Balanced Fund",
    "summary": "The Fund will seek to achieve its investment objective by investing in a blend of actively managed and passive index tracking collective investment schemes such as unit trusts, OEICs and other UCITS funds and closed ended schemes but at times may also invest in individual stocks and bonds where this is deemed to lower the overall cost of investment while maintaining a high level of portfolio diversification.",
    "total_assets": null
  },
  "0P0001D3JP.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FIL Investment Services (UK) Ltd",
    "long_name": "Fidelity Investment Funds IV - Fidelity Multi Asset Balanced Income Fund Lovewell Blake FP Inc",
    "manager_bio": "Eugene Philalithis joined Fidelity in 2007 as a Portfolio Manager, with a focus on fixed income and alternatives. Eugene manages a number of multi asset funds with internal and open architecture for both retail and institutional clients. He has currently 17 years of investment experience which includes Russell Investment in London and Canadian Imperial Bank of Commerce in Singapore. Eugene has a Bachelor or Engineering and an MBA, both from Imperial College, London.",
    "manager_name": "Eugene Peter Philalithis",
    "market": "gb_market",
    "short_name": "Fidelity Investment Funds IV - ",
    "summary": "The Fund aims to achieve an income yield of 3-5% per annum over a typical market cycle (5-7 years). The Fund also aims to increase the value of your investment over a period of 5 years or more. The Fund invests at least 70% into funds (including index-tracking funds and funds managed by Fidelity) which provide global exposure to a mixture of asset classes (including bonds, equities and alternative investments). Alternative investments may include infrastructure securities and real estate. The Fund can also invest directly into transferable securities, money market instruments, cash and deposits, and is also able to use derivatives for efficient portfolio management and investment purposes.",
    "total_assets": null
  },
  "0P0001D3JV.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "FIL Investment Services (UK) Ltd",
    "long_name": "Fidelity Investment Funds IV - Fidelity Multi Asset Open Strategic Fund Lovewell Blake FP Acc",
    "manager_bio": "Chris Forgan is a Portfolio Manager at Fidelity Multi Asset. Chris has 20 years of investment experience and joined Fidelity in 2017. Prior to joining Fidelity, Chris was a Portfolio Manager at Henderson Global Investors, in their Multi Asset team focusing on their income fund range. \n\nPreviously Chris worked as an analyst at Henderson Global Investors, a senior performance analyst at First State Investments and began his career on the trading floor at Deutsche Morgan Grenfell. Chris has an BA (Hons) Marketing Administration from the University of Northumbria.",
    "manager_name": "Chris  Forgan",
    "market": "gb_market",
    "short_name": "Fidelity Investment Funds IV - ",
    "summary": "This Fund targets an average annual return of 5% after the deduction of ongoing fund charges, over a typical market cycle of 5-7 years. The Fund provides global exposure to a diversified range of assets (including bonds, equities, alternatives and commodities) by investing at least 70% into funds (including those operated by Fidelity). The Fund typically invests more than 65% in sub-funds of an Irish UCITS fund (Fidelity Common Contractual Fund II) operated by Fidelity which subsequently utilise the experience and specialisms of a number of investment managers (which may include Fidelity) to manage the underlying assets. The exposure may be less than 65% depending on market conditions.",
    "total_assets": null
  },
  "0P0001D58L.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "Valu-Trac Investment Funds ICVC - Vt Protean Capital Procsi Core Fund Class A GBP Accumulation",
    "manager_bio": "",
    "manager_name": "Mike  Egerton",
    "market": "gb_market",
    "short_name": "Valu-Trac Investment Funds ICVC",
    "summary": "The objective of the Fund is to generate capital growth over the medium to long term (5 to 7 years). The Fund will aim to meet its investment objective primarily through entering into one or more swaps each of which will provide exposure to a financial index. The financial indices to which the swaps are linked will provide exposure to multiple asset classes such as global equities, global fixed income and commodities. The swaps will be supported by the Fund&#39;s other direct investments in a diversified portfolio which is expected to consist of transferable securities (including ETFs and potentially equities), other financial derivative instruments and government bonds. The Fund may also invest in collective investment schemes, money market instruments, debentures, fixed interest securities, deposits and cash and near cash.",
    "total_assets": null
  },
  "0P0001DYBL.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "Verus Sustainable Balanced Fund Z GBP Acc",
    "manager_bio": "",
    "manager_name": "Phoebe  Stone",
    "market": "gb_market",
    "short_name": "Verus Sustainable Balanced Fund",
    "summary": "The objective of the Fund is to provide income and capital growth",
    "total_assets": null
  },
  "0P0001DYBM.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "WAY Fund Managers Limited",
    "long_name": "Verus Sustainable Balanced Fund Z GBP Inc",
    "manager_bio": "",
    "manager_name": "Phoebe  Stone",
    "market": "gb_market",
    "short_name": "Verus Sustainable Balanced Fund",
    "summary": "The objective of the Fund is to provide income and capital growth",
    "total_assets": null
  },
  "0P0001F9QZ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Psigma Multi Asset Balanced Fund of Funds B GBP Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "MI Psigma Multi Asset Balanced ",
    "summary": "The Fund aims to preserve capital and deliver returns in line with the UK Consumer Price Index plus 3% (after Psigma fees) by investing in a range of other funds. \n\nThe Fund aims to generate the returns through diversified investments with a maximum equity weighting of 60% and maximum higher risk fixed interest weighting of 15%.",
    "total_assets": null
  },
  "0P0001FI28.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Sanlam Cautious Fund Class A Accumulated",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Sanlam Cautious Fund Class",
    "summary": "The objective of the Fund is to generate a combination of income and capital growth over the medium to long-term (5+ years).",
    "total_assets": null
  },
  "0P0001FJM7.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Schroder Unit Trusts Limited",
    "long_name": "SUTL Cazenove GBP Balanced Fund Z Income",
    "manager_bio": "Caspar Rock is Chief Investment Officer at Schroders, which involves responsibility for Cazenove's global investment strategy. He joined Schroders in 2016 and is based in London.\n\nCaspar was Chief Investment Officer at Architas from 2011 to 2016, which involved responsibility for all aspects of the investment activities, including investment philosophy, process and team.\n\nQualifications: BA in Economics and Social Statistics from Exeter University.",
    "manager_name": "Caspar  Rock",
    "market": "gb_market",
    "short_name": "SUTL Cazenove GBP Balanced Fund",
    "summary": "The Fund aims to provide capital growth and income of inflation (as measured by the UK Consumer Price Index) plus 3.25% (after fees have been deducted) over a five to seven year period by investing in a diversified range of assets and markets worldwide. This cannot be guaranteed and your capital is at risk. The Fund is actively managed invests directly, or indirectly through collective investment schemes, exchange traded funds, real estate investment trusts and closed ended funds, in equity and equity related securities, fixed and floating rate securities and alternative assets worldwide.",
    "total_assets": null
  },
  "0P0001FJM8.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Schroder Unit Trusts Limited",
    "long_name": "SUTL Cazenove GBP Balanced Fund Z Accumulation",
    "manager_bio": "Caspar Rock is Chief Investment Officer at Schroders, which involves responsibility for Cazenove's global investment strategy. He joined Schroders in 2016 and is based in London.\n\nCaspar was Chief Investment Officer at Architas from 2011 to 2016, which involved responsibility for all aspects of the investment activities, including investment philosophy, process and team.\n\nQualifications: BA in Economics and Social Statistics from Exeter University.",
    "manager_name": "Caspar  Rock",
    "market": "gb_market",
    "short_name": "SUTL Cazenove GBP Balanced Fund",
    "summary": "The Fund aims to provide capital growth and income of inflation (as measured by the UK Consumer Price Index) plus 3.25% (after fees have been deducted) over a five to seven year period by investing in a diversified range of assets and markets worldwide. This cannot be guaranteed and your capital is at risk. The Fund is actively managed invests directly, or indirectly through collective investment schemes, exchange traded funds, real estate investment trusts and closed ended funds, in equity and equity related securities, fixed and floating rate securities and alternative assets worldwide.",
    "total_assets": null
  },
  "0P0001GXWL.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "DMS Investment Funds ICVC V - DMS Wolseley Balanced Fund GBP Retail Acc Class",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "DMS Investment Funds ICVC V - D",
    "summary": "To provide a balance of income and capital growth.",
    "total_assets": null
  },
  "0P0001GXWM.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Waystone Management (UK) Limited",
    "long_name": "DMS Investment Funds ICVC V - DMS Wolseley Balanced Fund GBP Retail Inc Class",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "DMS Investment Funds ICVC V - D",
    "summary": "To provide a balance of income and capital growth.",
    "total_assets": null
  },
  "0P0001H4PP.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Aberdeen Standard Fund Managers Limited",
    "long_name": "ASI MyFolio Index II Fund Institutional S Fixed Accumulation",
    "manager_bio": "Head of Multimanager. Bambos has over 20 years investment experience of which almost 10 years is in managing retail fund of funds, this length of fund of funds experience is almost unrivalled. Bambos graduated with a degree in Mathematics from the University of London.",
    "manager_name": "Joe  Wiggins",
    "market": "gb_market",
    "short_name": "ASI MyFolio Index II Fund Insti",
    "summary": "To generate growth over the long term (5 years or more) while being managed to a defined level of risk. The fund is part of the ASI MyFolio Index range, which offers five funds with different expected combinations of investment risk and return. The fund is risk level II, which aims to be the second lowest risk fund in this range.",
    "total_assets": null
  },
  "0P0001H98X.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Aberdeen Standard Fund Managers Limited",
    "long_name": "ASI MyFolio Managed III Fund Retail Income",
    "manager_bio": "",
    "manager_name": "Bambos  Hambi",
    "market": "gb_market",
    "short_name": "ASI MyFolio Managed III Fund Re",
    "summary": "To generate growth over the long term (5 years or more) while being managed to a defined level of risk. The fund is part of the ASI MyFolio Managed range, which offers five funds with different expected combinations of investment risk and return. The fund is risk level III, which aims to be the middle risk fund in this range.",
    "total_assets": null
  },
  "0P0001H9I2.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Avellemy 5 Class A GBP Accumulation",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Avellemy 5 Class A GBP Acc",
    "summary": "The objective of the Sub-fund is to seek a combination of capital growth and income. This will be achieved whilst aiming to maintain the Sub-fund&#39;s risk rating classification as set by an independent asset allocator. The Sub-fund has a risk rating classification of &#39;5&#39;.The Sub-fund will be actively managed on a low to medium risk strategy and assets may be allocated to any geographical sector through gaining exposure to a range of asset classes by investing at least 70% in collective investment schemes.",
    "total_assets": null
  },
  "0P0001H9I3.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Avellemy 5 Class A GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Avellemy 5 Class A GBP Inc",
    "summary": "The objective of the Sub-fund is to seek a combination of capital growth and income. This will be achieved whilst aiming to maintain the Sub-fund&#39;s risk rating classification as set by an independent asset allocator. The Sub-fund has a risk rating classification of &#39;5&#39;.The Sub-fund will be actively managed on a low to medium risk strategy and assets may be allocated to any geographical sector through gaining exposure to a range of asset classes by investing at least 70% in collective investment schemes.",
    "total_assets": null
  },
  "0P0001H9I4.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Avellemy 5 Class B GBP Accumulation",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Avellemy 5 Class B GBP Acc",
    "summary": "The objective of the Sub-fund is to seek a combination of capital growth and income. This will be achieved whilst aiming to maintain the Sub-fund&#39;s risk rating classification as set by an independent asset allocator. The Sub-fund has a risk rating classification of &#39;5&#39;.The Sub-fund will be actively managed on a low to medium risk strategy and assets may be allocated to any geographical sector through gaining exposure to a range of asset classes by investing at least 70% in collective investment schemes.",
    "total_assets": null
  },
  "0P0001H9I5.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Avellemy 5 Class B GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Avellemy 5 Class B GBP Inc",
    "summary": "The objective of the Sub-fund is to seek a combination of capital growth and income. This will be achieved whilst aiming to maintain the Sub-fund&#39;s risk rating classification as set by an independent asset allocator. The Sub-fund has a risk rating classification of &#39;5&#39;.The Sub-fund will be actively managed on a low to medium risk strategy and assets may be allocated to any geographical sector through gaining exposure to a range of asset classes by investing at least 70% in collective investment schemes.",
    "total_assets": null
  },
  "0P0001H9I6.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Avellemy 5 Class C GBP Accumulation",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Avellemy 5 Class C GBP Acc",
    "summary": "The objective of the Sub-fund is to seek a combination of capital growth and income. This will be achieved whilst aiming to maintain the Sub-fund&#39;s risk rating classification as set by an independent asset allocator. The Sub-fund has a risk rating classification of &#39;5&#39;.The Sub-fund will be actively managed on a low to medium risk strategy and assets may be allocated to any geographical sector through gaining exposure to a range of asset classes by investing at least 70% in collective investment schemes.",
    "total_assets": null
  },
  "0P0001H9I7.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Avellemy 5 Class C GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Avellemy 5 Class C GBP Inc",
    "summary": "The objective of the Sub-fund is to seek a combination of capital growth and income. This will be achieved whilst aiming to maintain the Sub-fund&#39;s risk rating classification as set by an independent asset allocator. The Sub-fund has a risk rating classification of &#39;5&#39;.The Sub-fund will be actively managed on a low to medium risk strategy and assets may be allocated to any geographical sector through gaining exposure to a range of asset classes by investing at least 70% in collective investment schemes.",
    "total_assets": null
  },
  "0P0001HBLS.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ruffer LLP (Link)",
    "long_name": "LF Ruffer Absolute Return Fund H Accumulation",
    "manager_bio": "Previously International Equities Head at Rothschild Private Management, prior to which he was European Equities Head at Rothschild Asset Management. Graduated from Oxford and worked for Allied Dunbar Asset Management as Senior Investment Manager before moving to Threadneedle\nInvestment Managers Ltd as Head of European Equities. Joined Ruffer in 2006 and is co-manager of the CF Ruffer Total Return Fund.",
    "manager_name": "David  Ballance",
    "market": "gb_market",
    "short_name": "LF Ruffer Absolute Return Fund ",
    "summary": "The investment objective of the Sub-fund is to achieve low volatility and positive returns in all market conditions from an actively managed portfolio of equities or equity related securities (including convertibles) and corporate and government bonds and currencies. \nThe Sub-fund may also invest in collective investment schemes, cash and money market instruments. Pervading this objective is a fundamental philosophy of capital preservation.",
    "total_assets": null
  },
  "0P0001HCB1.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Ruffer LLP (Link)",
    "long_name": "LF Ruffer Total Return Fund K Accumulation",
    "manager_bio": "Started as a research analyst at SLC Asset Management in 1987, where he became Head of Equities in charge of Â£5bn of equity funds. In 1999 moved to HSBC Investment Bank as Head of UK and European Equity Strategy, before joining Ruffer in September 2003. Became a non\n-executive director of JPMorgan European Investment Trust in 2005 and is co-manager of the CF Ruffer Total Return Fund.",
    "manager_name": "Steven  Russell",
    "market": "gb_market",
    "short_name": "LF Ruffer Total Return Fund K A",
    "summary": "The investment objective of CF Ruffer Total Return Fund is to achieve low volatility, positive returns from an actively managed portfolio of different asset classes, including equities, bonds and currencies. \nThe sub-fund may also invest in collective investment schemes, cash, money market instruments, other transferable securities and derivatives and forward transactions and other investments to the extent that each is permitted by the Regulations. Pervading this objective is a fundamental philosophy of capital preservation.",
    "total_assets": null
  },
  "0P0001HPJA.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "Margetts Providence Strategy Fund S GBP Inc",
    "manager_bio": "Toby is the Chief Executive Officer of Margetts Fund Management Ltd., joined in 1994. Margetts led the development of multi-manager risk rated funds having launched their flagship range in the early 1990s which became a popular concept adopted by many investment houses subsequently. The Margetts Risk Rated funds and a number of third party mandates are managed by Toby and the Margetts investment team who also provide independent investment research relating to collective investment schemes and market commentary through the Margetts Research website. Toby also works with various independent financial advisers, networks and consultants to provide fund management advice and oversight as well as being a regular speaker on investment, market and related regulatory matters.\n\nToby is now widely regarded as a leading professional in collective investment management, being regularly profiled in the major financial publications and national press. Toby is the lead manager of the award winning Risk Rated fund of funds and is recognised by Citywire as one of the top10 most consistent managers over the past decade. Toby is the Chief Executive Officer of Margetts Fund Management Ltd.",
    "manager_name": "Toby  Ricketts",
    "market": "gb_market",
    "short_name": "Margetts Providence Strategy Fu",
    "summary": "The objective of the Margetts Providence Strategy Fund is to provide a balance of long term capital growth and increasing income by investment in any economic sector in any geographic area in regulated collective investment schemes investing in a wide range of assets including equities, fixed interest and cash type instruments. Furthermore, the Manager will charge some or all of the annual management fee to the Fundâs capital account. This will increase the distributable income by that amount and reduce the capital by a similar amount. This may constrain capital growth.",
    "total_assets": null
  },
  "0P0001HPJB.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Margetts Fund Management Limited",
    "long_name": "Margetts Providence Strategy Fund S GBP Acc",
    "manager_bio": "Toby is the Chief Executive Officer of Margetts Fund Management Ltd., joined in 1994. Margetts led the development of multi-manager risk rated funds having launched their flagship range in the early 1990s which became a popular concept adopted by many investment houses subsequently. The Margetts Risk Rated funds and a number of third party mandates are managed by Toby and the Margetts investment team who also provide independent investment research relating to collective investment schemes and market commentary through the Margetts Research website. Toby also works with various independent financial advisers, networks and consultants to provide fund management advice and oversight as well as being a regular speaker on investment, market and related regulatory matters.\n\nToby is now widely regarded as a leading professional in collective investment management, being regularly profiled in the major financial publications and national press. Toby is the lead manager of the award winning Risk Rated fund of funds and is recognised by Citywire as one of the top10 most consistent managers over the past decade. Toby is the Chief Executive Officer of Margetts Fund Management Ltd.",
    "manager_name": "Toby  Ricketts",
    "market": "gb_market",
    "short_name": "Margetts Providence Strategy Fu",
    "summary": "The objective of the Margetts Providence Strategy Fund is to provide a balance of long term capital growth and increasing income by investment in any economic sector in any geographic area in regulated collective investment schemes investing in a wide range of assets including equities, fixed interest and cash type instruments. Furthermore, the Manager will charge some or all of the annual management fee to the Fundâs capital account. This will increase the distributable income by that amount and reduce the capital by a similar amount. This may constrain capital growth.",
    "total_assets": null
  },
  "0P0001HQK8.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "Mazarin Cautious Fund A GBP Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Mazarin Cautious Fund A GBP Acc",
    "summary": "The aim of the Fund is to provide capital growth, that is, to increase the value of your investment, over a minimum of 5 years. The Fund aims to have an average yearly volatility (a measure of the size of short term changes in the value of an investment), below 9% per year, over any 5-year period. This may limit the potential for capital growth.At least 70% of the Fundâs assets will be invested in other collective investment schemes, closedended funds and exchange traded funds, collectively known as âInvestment Fundsâ. This could include other Investment Funds managed by the same Authorised Corporate Director and/or Investment Manager.",
    "total_assets": null
  },
  "0P0001HQK9.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "Mazarin Cautious Fund A GBP Inc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Mazarin Cautious Fund A GBP Inc",
    "summary": "The aim of the Fund is to provide capital growth, that is, to increase the value of your investment, over a minimum of 5 years. The Fund aims to have an average yearly volatility (a measure of the size of short term changes in the value of an investment), below 9% per year, over any 5-year period. This may limit the potential for capital growth.At least 70% of the Fundâs assets will be invested in other collective investment schemes, closedended funds and exchange traded funds, collectively known as âInvestment Fundsâ. This could include other Investment Funds managed by the same Authorised Corporate Director and/or Investment Manager.",
    "total_assets": null
  },
  "0P0001HQYM.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Link Fund Solutions Limited",
    "long_name": "LF Canada Life Investments Fund II - LF Canlife Diversified Monthly Income Fund G Accumulation",
    "manager_bio": "Craig joined Canada Life Asset Management in March 2004. He became Head of UK Equities in March 2010 and was most recently appointed Head of Multi-Asset in May 2018. He previously managed income funds at Govett Investment Management Limited and prior to that worked at Deloitte Touche. Craig has a BSc in Mathematics from Warwick University. He is a Chartered Accountant and a CFA charterholder",
    "manager_name": "Craig  Rippe",
    "market": "gb_market",
    "short_name": "LF Canada Life Investments Fund",
    "summary": "To provide income monthly with the prospect for long term (at least 5 years) capital growth.",
    "total_assets": null
  },
  "0P0001HSNY.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Investment Fund Services Limited",
    "long_name": "IFSL Beaufort Multi Asset Blend Balanced Fund Class A Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "IFSL Beaufort Multi Asset Blend",
    "summary": "The investment objective of the Fund is to increase the value of an investment over a minimum of 5 years, through a combination of capital growth, which is profit on an investment, and income, which is money paid out from an investment such as interest and dividends. The Fund is actively managed, which means the Investment Manager decides which investments to buy and when, and will invest at least 80% in other collective investment schemes, investment trusts and exchange traded funds (collectively âInvestment Fundsâ).",
    "total_assets": null
  },
  "0P0001I3L5.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Maitland Institutional Services Ltd.",
    "long_name": "MI Psigma Multi Asset Balanced Fund of Funds A GBP Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "MI Psigma Multi Asset Balanced ",
    "summary": "The Fund aims to preserve capital and deliver returns in line with the UK Consumer Price Index plus 3% (after Psigma fees) by investing in a range of other funds. \n\nThe Fund aims to generate the returns through diversified investments with a maximum equity weighting of 60% and maximum higher risk fixed interest weighting of 15%.",
    "total_assets": null
  },
  "0P0001I7C6.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Meadowgate Balanced GBP Acc",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Meadowgate Balanced GBP Acc",
    "summary": "To maximise total return through a combination of growth and income.",
    "total_assets": null
  },
  "0P0001IVNQ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "T. Bailey Fund Services Limited",
    "long_name": "T. Bailey Dynamic Fund F Accumulation",
    "manager_bio": "Peter has led global fixed income teams at T. Rowe Price, Flemings and JP Morgan. Before joining T. Bailey in 2013 he held senior roles at a fund of hedge funds and Standard Life Investments. Previously he worked with a multi-family office and ran his own investment consultancy business.",
    "manager_name": "Elliot B. Farley",
    "market": "gb_market",
    "short_name": "T. Bailey Dynamic Fund F Accumu",
    "summary": "The T. Bailey Dynamic Fund aims to outperform the Consumer Prices Index plus 3% per annum, over Rolling Periods of 3 years. Typically, at least 80% of the Fund will be invested in other collective investment vehicles (âfundsâ), including those managed or operated by the Manager and its associates.",
    "total_assets": null
  },
  "0P0001J0FH.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Mossylea Fund Class A GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Mossylea Fund Class A GBP Inco",
    "summary": "The objective of the Fund is to preserve and grow the value of the Fund (after inflation) over the longer term (5 years).",
    "total_assets": null
  },
  "0P0001J0FI.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Mossylea Fund Class B GBP Income",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Mossylea Fund Class B GBP Inco",
    "summary": "The objective of the Fund is to preserve and grow the value of the Fund (after inflation) over the longer term (5 years).",
    "total_assets": null
  },
  "0P0001J0FJ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Thesis Unit Trust Management Limited",
    "long_name": "Mossylea Fund Class B GBP Accumulation",
    "manager_bio": "",
    "manager_name": "",
    "market": "gb_market",
    "short_name": "Mossylea Fund Class B GBP Accum",
    "summary": "The objective of the Fund is to preserve and grow the value of the Fund (after inflation) over the longer term (5 years).",
    "total_assets": null
  },
  "0P0001JTSZ.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Blackfinch Funds ICVC - VT Blackfinch Cautious Portfolio Fund Class F GBP Accumulation",
    "manager_bio": "Alex jointly manages the Blackfinch Asset Management portfolios. He brings 11 yearsâ investment management experience, with a strong track record in managing private client portfolios and working closely with financial advisers. Alex holds the certificate in Private Client Investment Advice and Management as well as the Investment Advice Diploma. He is a chartered fellow of the Chartered Institute for Securities & Investment.",
    "manager_name": "Alex  Sumner",
    "market": "gb_market",
    "short_name": "VT Blackfinch Funds ICVC - VT B",
    "summary": "The investment objective of the Fund is to achieve total returns comprised of income and capital growth equal to Consumer Price Index plus 2% over rolling five year periods (net of management fees and underlying fund charges). Capital is in fact at risk and there is no guarantee that a positive return will be achieved over a five year, or any, period. The Fund will seek to achieve its objective by investing at least 80% in a portfolio of collective investment vehicles (which may include those managed and/or operated by the ACD or Investment Manager) and bonds (which may be government or corporate bonds and vary in terms of credit ratings). Investment in collective investment vehicles will provide exposure to asset classes such as equities, bonds, cash, property and commodities.",
    "total_assets": null
  },
  "0P0001JTT0.L": {
    "category": "GBP Moderate Allocation",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "Valu-Trac Investment Management Limited",
    "long_name": "VT Blackfinch Funds ICVC - VT Blackfinch Cautious Portfolio Fund Class F GBP Income",
    "manager_bio": "Alex jointly manages the Blackfinch Asset Management portfolios. He brings 11 yearsâ investment management experience, with a strong track record in managing private client portfolios and working closely with financial advisers. Alex holds the certificate in Private Client Investment Advice and Management as well as the Investment Advice Diploma. He is a chartered fellow of the Chartered Institute for Securities & Investment.",
    "manager_name": "Alex  Sumner",
    "market": "gb_market",
    "short_name": "VT Blackfinch Funds ICVC - VT B",
    "summary": "The investment objective of the Fund is to achieve total returns comprised of income and capital growth equal to Consumer Price Index plus 2% over rolling five year periods (net of management fees and underlying fund charges). Capital is in fact at risk and there is no guarantee that a positive return will be achieved over a five year, or any, period. The Fund will seek to achieve its objective by investing at least 80% in a portfolio of collective investment vehicles (which may include those managed and/or operated by the ACD or Investment Manager) and bonds (which may be government or corporate bonds and vary in terms of credit ratings). Investment in collective investment vehicles will provide exposure to asset classes such as equities, bonds, cash, property and commodities.",
    "total_assets": null
  }
}
