{
  "0P0000W6G7.F": {
    "category": "Global High Yield Bond",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Amundi SGR S.p.A.",
    "long_name": "Amundi Obbligazionario Globale High Yield a distribuzione A",
    "manager_bio": "ANDREW D. FELTUS, CFA\nMANAGING DIRECTOR\nCO-DIRECTOR OF HIGH YIELD, PORTFOLIO MANAGER\nJoined Amundi Pioneer: 1994 \nInvestment Experience Since: 1991 \nAndrew Feltus is a Managing Director, Portfolio Manager, and Co-Director of the Amundi Pioneer High Yield team based in Boston. In addition to his role as a Portfolio Manager on U.S. high yield, global high yield, and multisector portfolios, Andrew co-leads a team of portfolio managers who specialize in identifying and capitalizing on high yield and bank loan opportunities globally. The team also provides insight and recommendations for a number of multisector fixed income strategies managed by the U.S. fixed income team. \nAndrew has been actively managing fixed income portfolios since 1994. He has extensive experience managing a wide range of debt securities globally, including emerging markets and foreign exchange. His experience includes analyzing and managing derivatives since 1992. Andrew joined Amundi Pioneer as a Fixed Income Analyst and became a Portfolio Manager in 2001. Prior to joining Amundi Pioneer, he worked on the bond desk at Massachusetts Financial Services. He holds a B.A. in quantitative economics and philosophy from Tufts University. He is a CFA® charterholder.",
    "manager_name": "Andrew  Feltus",
    "market": "dr_market",
    "short_name": "Amundi Obbligazionario Globale ",
    "summary": "Il Fondo è investito in strumenti finanziari di natura obbligazionaria. Il Fondo può investire in parti di OICR di tipo aperto, anche collegati, in misura residuale. Gli strumenti finanziari sono denominati principalmente in Euro, Dollari statunitensi e Sterlina britannica.",
    "total_assets": 191750610.63768768
  },
  "0P000140JP.F": {
    "category": "Global High Yield Bond",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Unofi-Gestion d&#39;Actifs",
    "long_name": "Unofi-Haut Rendement A1",
    "manager_bio": "",
    "manager_name": "Benoît  Pénet",
    "market": "dr_market",
    "short_name": "Unofi-Haut Rendement A1",
    "summary": "Le FCP a pour objectif d&#39;offrir une performance supérieure à celle de l&#39;indice Merrill Lynch Global High Yield converti en euro, en constituant un portefeuille d&#39;OPCVM investissant sur des obligations à haut rendement dites spéculatives.\nLe FCP ne cherchant pas à répliquer l&#39;indice, la performance du FCP peut donc s&#39;écarter de l&#39;évolution de l&#39;indice.",
    "total_assets": 132942386.24286652
  },
  "NMEGH.MI": {
    "category": "Global High Yield Bond",
    "currency": "EUR",
    "exchange": "MIL",
    "family": "Natam Management Company S.A.",
    "long_name": "New Millennium - Evergreen Global High Yield Bond L",
    "manager_bio": "",
    "manager_name": "Not  Disclosed",
    "market": "it_market",
    "short_name": "NEW MILLEN EVERG GL HI YLD BOND",
    "summary": "To achieve a return in excess of global bond markets by investing primarily in global below investment grade debt securities, both corporate and Government, without geographical limits, and with an active management of the exchange rates and derivatives. At least 70% of the Sub-Fund’s net assets will be invested in below investment grade and not rated debt securities; the exposure to not rated bonds will not exceed 30% of the net assets.",
    "total_assets": 4010591.039948702
  }
}
