{
    "0P0000Z33U.TO": {
        "short_name": "Middlefield Global Infrastructu",
        "long_name": "Middlefield Global Infrastructure Fund Series A",
        "currency": "CAD",
        "summary": "The Fund`s objective is to maximize long-term total returns. The fund invests primarily in equity and fixed income securities of global issuers.",
        "manager_name": "Robert F. Lauzon",
        "manager_bio": "Robert F. Lauzon is Managing Director, Trading and Deputy Chief Investment Officer of Middlefield Capital Corporation and has been employed by Middlefield Capital Corporation since 2002. Mr. Lauzon is the lead portfolio manager on a number of investment funds and is responsible for overseeing Middlefieldâ\u0080\u0099s trading operations. Mr. Lauzon is an MBA graduate of the Rotman School of Management (University of Toronto) and holds the Chartered Financial Analyst designation.",
        "category": "Global Infrastructure Equity",
        "family": "Middlefield Limited",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 14411313.893265724
    },
    "0P000174M6.TO": {
        "short_name": "SSQ Lazard FPG Infrastructures ",
        "long_name": "SSQ Lazard Global Infra GIF Basic",
        "currency": "CAD",
        "summary": "The fundamental investment objective of this fund is to generate regular income and long-term capital growth. The Fund is invested in global infrastructure securities, i.e. companies listed on the stock exchange that own and operate infrastructures including highways, airports, bridges, water, electricity or gas networks. The fund may hold units of underlying funds corresponding to the above-mentioned securities.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "Global Infrastructure Equity",
        "family": "SSQ-Societe d&#39;assurance-vie",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 53846580.754380226
    },
    "0P00019BEB.TO": {
        "short_name": "La Capitale Act mondiales d'inf",
        "long_name": "La Capitale Global Infrastructure Equity (Dynamic)",
        "currency": "CAD",
        "summary": "\"This Fund seeks to provide long-term capital appreciation and income primarily through\ninvestment in a diversified portfolio of infrastructure and related companies from around\nthe globe.\nThe Fund intends to invest primarily in securities of infrastructure and related companies.\nInfrastructure assets are broadly defined as the basic facilities, services, and installations\nneeded for the functioning of a community or society and may include but are not limited to\nthe following areas: transportation (toll roads, airports, seaports and rail), energy (gas and\nelectricity transmission, distribution and generation), water (pipelines and treatment plants)\nand telecommunications (broadcast, satellite and cable).\"",
        "manager_name": "Jason  Gibbs",
        "manager_bio": "Jason Gibbs joined Dynamic in 2000. He became an analyst in 2002 and portfolio manager in 2007. He focuses on investing in best-in-class businesses with strong balance sheets and sustainable cash flows among dividend paying equities and infrastructure companies on a global basis. Jason has 18 years of industry experience and, prior to portfolio management, he was a manager of fund valuation services at Dynamic and Canada Trust and an auditor with Deloitte & Touche. Jason received his Bachelor of Accounting from Brock University. He also holds the Chartered Accountant and CFA designations.",
        "category": "Global Infrastructure Equity",
        "family": "La Capitale Insurance and Financial Services",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 57600642.858724594
    },
    "0P0001EQN7.TO": {
        "short_name": "Starlight infrastructures mondi",
        "long_name": "Starlight Global Infrastructure Series T6",
        "currency": "CAD",
        "summary": "The Fundâ\u0080\u0099s investment objective is to provide regular current income by investing globally in companies with either direct or indirect exposure to infrastructure.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "Global Infrastructure Equity",
        "family": "Starlight Capital",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 53636333.084077835
    }
}