{
    "0P0000N4HM.L": {
        "short_name": "Aegon International High Yield ",
        "long_name": "UWS Kames High Yield Bond (Series B)",
        "currency": "GBp",
        "summary": "To maximise total return (income plus capital). It invests in a portfolio of predominately: high yield bonds; selected investment grade bonds; and cash. The Fund may hold sterling and other currency denominated bonds hedged back to sterling. The Fund may also invest in deposits, money market instruments, derivative instruments and forward transactions. The Fund may also invest in derivatives (financial contracts whose value is linked to an underlying asset). Within the limits set out above, the Fund is not restricted by market sector. It is not constrained by any benchmark or index. The Fund may use investment techniques to manage risks and costs. These techniques include â\u0080\u0098hedgingâ\u0080\u0099 (using derivatives and other financial contracts to reduce the risk associated with making investments in other currencies). Other information You can buy, sell or exchange the Fundâ\u0080\u0099s shares on any business day (see Dealing Day in the Prospectus Definitions for more information).",
        "manager_name": "Philip  Milburn",
        "manager_bio": "Phil Milburn joined Liontrust in January 2018 from Kames Capital to create the Liontrust Global Fixed Income team with David Roberts and Donald Phillips. Phil is Head of Investment Strategy for the Global Fixed Income team and is co-manager of Liontrustâ\u0080\u0099s Strategic Bond, Absolute Return Bond and High Yield Bond strategies. Phil had spent over 20 years at Kames Capital, launching one of the marketâ\u0080\u0099s first strategic bond funds with David Roberts in 2003 and developing a leading high-yield franchise. Phil graduated from the University of Edinburgh in 1996 with a first class MA in Economics.",
        "category": "Global High Yield Bond - GBP Hedged",
        "family": "AEGON Ireland",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    },
    "0P0000ZMVV.L": {
        "short_name": "LF Canlife Global High Yield Bo",
        "long_name": "LF Canlife Global High Yield Bond Fund B Income",
        "currency": "GBp",
        "summary": "The CF Canlife Global High Yield Bond Fund seeks to achieve a high current income and, as a secondary objective, capital growth (when consistent with the objective of high current income), by permanently investing not less than 85% of its assets in units of the Putnam Global High Yield Bond Fund. \nWhile it is envisaged that the Sub-fund will normally be fully invested in the Putnam Global High Yield Bond Fund, the Sub-fund may also hold up to 15% of its assets in cash or near cash.",
        "manager_name": "Yannick D. Aron",
        "manager_bio": "Mr. Aron is a Senior Vice President and Portfolio Manager, responsible for managing European High Yield institutional portfolios and as well as the European segment of Global High Yield mutual funds and institutional mandates. Previously, Mr. Aron was a risk manager and quantitative analyst on the European High Yield team with responsibility for all valuation and relative value trading tools, as well as risk management monitoring. Mr. Aron has been in the investment industry since 1996.",
        "category": "Global High Yield Bond - GBP Hedged",
        "family": "Link Fund Solutions Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": 15507169
    },
    "0P0000ZP33.L": {
        "short_name": "Barings Global Senior Secured B",
        "long_name": "Barings Global Senior Secured Bond Fund F GBP Accumulating Shares",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to provide high current income generation and, where appropriate, capital appreciation.",
        "manager_name": "Scott D. Roth",
        "manager_bio": "Scott Roth is a member of Baringsâ\u0080\u0099 U.S. High Yield Investments Group and the U.S. High Yield Investment Committee. His responsibilities include portfolio management for various high yield bond total return strategies. Scott has worked in the industry since 1993 and his experience has encompassed fund management, underwriting, leveraged loans and high yield. Prior to joining the firm in 2002, he was a vice president at Webster Bank and was a high yield analyst at Times Square Capital Management. He also served as an underwriter at Chubb Insurance Company. Scott holds a B.B.A. from Western Michigan University, an M.B.A. from the Ross School of Business at University of Michigan and is a member of the CFA Institute.",
        "category": "Global High Yield Bond - GBP Hedged",
        "family": "Baring International Fund Mgrs (Ireland) Limited",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    },
    "0P00016V0A.L": {
        "short_name": "Barings Global High Yield Credi",
        "long_name": "Barings Global High Yield Credit Strategies Fund Tranche B GBP Income",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to achieve current income, and where appropriate, capital appreciation. The Fund will seek to achieve its objective by investing primarily in a portfolio of high yield fixed and floating rate corporate debt instruments issued by North American and European companies (including those debt instruments issued by issuing entities based in offshore centres, such as the Channel Islands, Cayman Islands, Bermuda, and other offshore jurisdictions).",
        "manager_name": "Sean M. Feeley",
        "manager_bio": "Sean Feeley is a portfolio manager for Baringsâ\u0080\u0099 U.S. High Yield Investments Group. He is also a member of the firmâ\u0080\u0099s U.S. High Yield Investment Committee and the Global High Yield Allocation Committee. Sean is responsible for the portfolio management of various high yield bond total return strategies. Sean has worked in the industry since 1996 and his experience has encompassed the credit market across a variety of industries. Prior to joining the firm in 2003, he worked at Cigna Investment Management in project finance and at Credit Suisse, where he worked in the leveraged finance group. Sean holds a B.S. in Accounting from Canisius College (magna cum laude) and an M.B.A. from Cornell University. He is a Certified Public Accountant (inactive) and member of the CFA Institute.",
        "category": "Global High Yield Bond - GBP Hedged",
        "family": "Barings LLC",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    }
}