{
    "0P000010MW.T": {
        "short_name": "PineBridge Global Funds - Japan",
        "long_name": "PineBridge Global Funds - Japan Small Cap Equity Fund A3",
        "currency": "JPY",
        "summary": "The Sub-Fund seeks to achieve long term capital growth by making at least two-thirds of its total investments in equity and equity-related investments in small Japanese companies, i.e. companies incorporated in Japan or companies whose assets, products or operations are in Japan.",
        "manager_name": "Midori  Katsumi",
        "manager_bio": "Ms. Katsumi joined PineBridge Investments in May 2000. She is a Portfolio Manager for Japan Small Cap Equity Strategy. Prior to joining PineBridge Investments, Ms. Katsumi was an analyst at T&D Taiyo Daido Asset Management, formerly Taiyo Life Gamma Asset Management, where she was responsible for small-cap equity research. Her industry experience dates back to 1996. Ms. Katsumi received a B.A. from International Christian University. She is a Chartered Member of the Security Analysts Association of Japan.",
        "category": "Japan Small/Mid-Cap Equity",
        "family": "PineBridge Investments Ireland Ltd",
        "exchange": "JPX",
        "market": "jp_market",
        "total_assets": null
    },
    "0P0000TPE1.L": {
        "short_name": "Atlantis Japan Opportunities Fu",
        "long_name": "Atlantis Japan Opportunities Fund GBP",
        "currency": "GBp",
        "summary": "The investment objective of the Sub-Fund is to achieve long term capital appreciation.\nThe Sub-Fund will invest mainly in a portfolio of equities, and equity-related instruments (such as convertible bonds, preference shares or warrants) issued by companies located in Japan or deriving a preponderant part of their income and/or assets from Japan.",
        "manager_name": "Taeko  Setaishi",
        "manager_bio": "TAEKO SETAISHI, took over as lead fund adviser in May 2016, having been deputy fund adviser since 1996. She joined AIRC in 1996, is a Japanese citizen and is based in Tokyo. She started her career at Schroder Securities, and in 1986 she joined James Capel. In 1993 she joined Schroder Investment Management as an analyst and fund adviser until her move to AIRC together with Ed Merner. Taeko is responsible for portfolio construction and the day-to-day portfolio management of AJGF.",
        "category": "Japan Small/Mid-Cap Equity",
        "family": "Atlantis Investment Mngmt (Ireland) Ltd",
        "exchange": "LSE",
        "market": "gb_market",
        "total_assets": null
    }
}