{"0P000010MW.T": {"short_name": "PineBridge Global Funds - Japan", "long_name": "PineBridge Global Funds - Japan Small Cap Equity Fund A3", "currency": "JPY", "summary": "The Sub-Fund seeks to achieve long term capital growth by making at least two-thirds of its total investments in equity and equity-related investments in small Japanese companies, i.e. companies incorporated in Japan or companies whose assets, products or operations are in Japan.", "manager_name": "Midori  Katsumi", "manager_bio": "Ms. Katsumi joined PineBridge Investments in May 2000. She is a Portfolio Manager for Japan Small Cap Equity Strategy. Prior to joining PineBridge Investments, Ms. Katsumi was an analyst at T&D Taiyo Daido Asset Management, formerly Taiyo Life Gamma Asset Management, where she was responsible for small-cap equity research. Her industry experience dates back to 1996. Ms. Katsumi received a B.A. from International Christian University. She is a Chartered Member of the Security Analysts Association of Japan.", "category": "Japan Small/Mid-Cap Equity", "family": "PineBridge Investments Ireland Ltd", "exchange": "JPX", "market": "jp_market"}, "0P0000G6LU.T": {"short_name": "SPARX Japan Smaller Companies F", "long_name": "SPARX Japan Smaller Companies Fund JPY Institutional A class Share", "currency": "JPY", "summary": "The fund seeks long term capital appreciation.", "manager_name": "Tadahiro  Fujimura", "manager_bio": "Tadahiro Fujimura, CFA and CMA, has served as the Chief Investment Officer of SPARX since April 2013, served as the head of the Investment & Research Division from April 2010 to December 2015, and is responsible for overseeing Japanese Mid and Small Cap Strategies. Prior to joining SPARX, Mr. Fujimura served as the Chief Portfolio Manager of the small-cap investment team at Nikko Asset Management (formerly Nikko Securities Investment Trust Management Co., Ltd.).", "category": "Japan Small/Mid-Cap Equity", "family": "SPARX Asset Management Co Ltd", "exchange": "JPX", "market": "jp_market"}}