{
    "ACFIX": {
        "short_name": "Water Island Credit Opportuniti",
        "long_name": "Water Island Credit Opportunities Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks to provide current income and capital growth.\n The fund invests primarily in a portfolio of debt securities including corporate bonds and debentures (including high yield bonds commonly known as \"junk bonds\"), bank loans, convertible and preferred securities, credit default swaps and other debt instruments and derivatives that the fund&#39;s investment adviser believes have debt-like characteristics. It invests in both domestic and foreign debt securities. The principal types of derivatives in which the fund may invest are credit default swaps, interest rate swaps, total return swaps, futures and options.",
        "manager_name": "Gregory A. Loprete",
        "manager_bio": "Gregory(Gregg) Loprete joined Water Island Capital in 2009 and currently serves as a portfolio manager. He is primarily responsible for management of the firmâ\u0080\u0099s convertible and fixed income investments. Prior to joining Water Island Capital, Mr. Loprete worked at Keefe, Bruyette & Woods as a Convertible and Preferred Trader where he evaluated, implemented and managed convertible and capital structure investments. From 2007-2008, Mr. Loprete was a Director in the Convertible Arbitrage Group at Ramius Capital Group, LLC. At Ramius Mr. Loprete also served as co-manager and trader. From 2003 to 2007, Mr. Loprete was a Senior Convertible Analyst and Convertible Banking Liaison at SG Cowen & Company. Mr. Loprete received a Masters of Business Administration degree in Finance from New York University in 1993 and a Bachelors degree from the University of Delaware in 1987 â\u0080\u0094 with a major in English Literature with a minor in Economics.",
        "category": "Long-Short Credit",
        "family": "Arbitrage Fund",
        "exchange": "NAS",
        "market": "us_market",
        "total_assets": 99161632
    },
    "ARCCX": {
        "short_name": "Water Island Credit Opportuniti",
        "long_name": "Water Island Credit Opportunities Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks to provide current income and capital growth.  The fund invests primarily in a portfolio of debt securities including corporate bonds and debentures (including high yield bonds commonly known as \"junk bonds\"), bank loans, convertible and preferred securities, credit default swaps and other debt instruments and derivatives that the fund&#39;s investment adviser believes have debt-like characteristics. It invests in both domestic and foreign debt securities. The principal types of derivatives in which the fund may invest are credit default swaps, interest rate swaps, total return swaps, futures and options.",
        "manager_name": "Gregory A. Loprete",
        "manager_bio": "Gregory(Gregg) Loprete joined Water Island Capital in 2009 and currently serves as a portfolio manager. He is primarily responsible for management of the firmâ\u0080\u0099s convertible and fixed income investments. Prior to joining Water Island Capital, Mr. Loprete worked at Keefe, Bruyette & Woods as a Convertible and Preferred Trader where he evaluated, implemented and managed convertible and capital structure investments. From 2007-2008, Mr. Loprete was a Director in the Convertible Arbitrage Group at Ramius Capital Group, LLC. At Ramius Mr. Loprete also served as co-manager and trader. From 2003 to 2007, Mr. Loprete was a Senior Convertible Analyst and Convertible Banking Liaison at SG Cowen & Company. Mr. Loprete received a Masters of Business Administration degree in Finance from New York University in 1993 and a Bachelors degree from the University of Delaware in 1987 â\u0080\u0094 with a major in English Literature with a minor in Economics.",
        "category": "Long-Short Credit",
        "family": "Arbitrage Fund",
        "exchange": "NAS",
        "market": "us_market",
        "total_assets": 82231504
    },
    "LMAMX": {
        "short_name": "BrandywineGLOBAL - Alternative ",
        "long_name": "BrandywineGLOBAL - Alternative Credit Fund Class IS",
        "currency": "USD",
        "summary": "The investment seeks to provide positive returns independent of market cycles through a high level of income and capital appreciation.\n Under normal circumstances, the fund seeks to achieve its investment objective by taking a flexible, long and short global credit approach. It will rotate amongst the global credit opportunities (long or short) that the subadviser finds most attractive and navigate the credit quality spectrum throughout the different phases of the business cycle. The fund also has the flexibility to hedge or increase exposure to certain risks based on the subadviser&#39;s macroeconomic views. The fund is non-diversified.",
        "manager_name": "Brian L. Kloss",
        "manager_bio": "Brian is a portfolio manager and head of high yield. Brian joined Brandywine Global in December 2009, bringing with him over 10 years of high yield and distressed debt experience. Previously, Brian was co-portfolio manager at Dreman Value Management, LLC (2007-2009); high yield analyst/trader at Gartmore Global Investments (2002-2007); high yield and equity portfolio manager and general analyst at Penn Capital Management, Ltd. (2000-2002); an analyst with The Concord Advisory Group, Ltd. (1998-2000); and an international tax consultant with Deloitte & Touche LLP (1995-1998). Brian earned his J",
        "category": "Long-Short Credit",
        "family": "Franklin Templeton Investments",
        "exchange": "NAS",
        "market": "us_market",
        "total_assets": 228313728
    },
    "PZCRX": {
        "short_name": "PIMCO Credit Opportunities Bond",
        "long_name": "PIMCO Credit Opportunities Bond Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks maximum total return, consistent with preservation of capital and prudent investment management.\n The fund invests at least 80% of its assets in a diversified portfolio of Fixed Income Instruments of varying maturities, which may be represented by forwards or derivatives such as options, futures contracts or swap agreements. It may invest in both investment grade and high yield securities (\"junk bonds\") subject to a maximum of 50% of its total assets in securities rated below B- by Moody&#39;s, or equivalently rated by S&P or Fitch, or, if unrated, determined by PIMCO to be of comparable quality.",
        "manager_name": "Christian R. Stracke",
        "manager_bio": "Managing Director, PIMCO, Mr. Stracke is a member of the Investment Committee and global head of the credit research group. The group covers all levels of the debt capital structure for targeted industries, including investment grade and high yield bonds, bank debt and convertibles. He also contributes to the analysis, portfolio construction and management of the firm's opportunistic corporate credit and mortgage and real estate-related strategies. Prior to joining PIMCO in 2008, he was a senior credit strategist at CreditSights and also held positions as head of Latin America fixed income strategy with Commerzbank Securities and head of Latin America local markets strategy with Deutsche Bank. He has investment experience since 1997 and holds an undergraduate degree from the University of Chicago. He is also a returned Peace Corps volunteer, having served as an agroforestry extension agent in Mauritania, West Africa.",
        "category": "Long-Short Credit",
        "family": "PIMCO",
        "exchange": "NAS",
        "market": "us_market",
        "total_assets": 409516512
    }
}