{
    "ACVVX": {
        "short_name": "AC Alternatives Market Neutral ",
        "long_name": "AC Alternatives Market Neutral Value Fund Investor Class",
        "currency": "USD",
        "summary": "The investment seeks long-term capital growth, independent of equity market conditions.\n Under normal market conditions, the advisor intends to keep its assets invested primarily in U.S. equity securities. However, the fund may invest a portion of its assets in foreign securities. In addition, there may be times when it holds a significant portion of its assets in cash or cash equivalents.",
        "manager_name": "Kevin M. Toney",
        "manager_bio": "Kevin Toney, CFA, CIO, senior vice president and senior portfolio manager for American Century Investments, joined the company in 1999 as an investment analyst and became a portfolio manager in 2006. Kevin is responsible for the teams that manage the companyâ\u0080\u0099s value and real estate equity strategies that comprise the firmâ\u0080\u0099s Global Value Equity discipline. Before joining American Century Investments, Kevin was an associate in the M&A group of Toronto Dominion Securities. He has worked in the investment industry since 1993.",
        "category": "Market Neutral",
        "family": "American Century Investments",
        "exchange": "NAS",
        "market": "us_market"
    },
    "ADANX": {
        "short_name": "AQR Diversified Arbitrage Fund ",
        "long_name": "AQR Diversified Arbitrage Fund Class N",
        "currency": "USD",
        "summary": "The investment seeks long-term absolute (positive) returns.\n The fund seeks to outperform, after expenses, the ICE BofAML US 3-Month Treasury Bill Index while seeking to control its tracking risk relative to this benchmark. It invests in a diversified portfolio of instruments, including equities, convertible securities, debt securities, loans, warrants, options, swaps (including credit default swaps and credit default index swaps), futures contracts, forwards or other types of derivative instruments.",
        "manager_name": "Ronen N. Israel",
        "manager_bio": "Ronen Israel, M.A., is a Principal of AQR Capital Management. Mr. Israel joined AQR Capital Management in 1999, is the Co-Head of Portfolio Management, Research, Risk and Trading and is a member of the firmâ\u0080\u0099s Executive Committee. Prior to joining AQR, Ronen was a Senior Analyst at Quantitative Financial Strategies, Inc., a quantitative investment management firm, specializing in currencies and global macro strategies, with $2.5 billion under management. Before that, he worked as a management consultant, specializing in building out financial systems for financial services firms. Ronen received an MA in Mathematics, specializing in mathematical finance, from Columbia University, a BS in Economics from The Wharton School at the University of Pennsylvania and a BAS in Biomedical Science from the School of Engineering and Applied Science at the University of Pennsylvania.",
        "category": "Market Neutral",
        "family": "AQR Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "AEFCX": {
        "short_name": "Water Island Diversified Event-",
        "long_name": "Water Island Event-Driven Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks to achieve capital growth.\n The fund invests in equity and debt and debt-like instruments (including high yield bonds commonly known as \"junk bonds\") of companies whose prices the fund&#39;s investment adviser believes are or will be impacted by a corporate event. Specifically, the fund employs investment strategies designed to capture price movements generated by corporate events such as mergers, acquisitions, asset sales, restructurings, refinancings, recapitalizations, reorganizations or other special situations (referred to as \"event-driven opportunities\"). It is non-diversified.",
        "manager_name": "Todd W. Munn",
        "manager_bio": "Munn is a portfolio manager of Water Island Capital, LLC. Prior to becoming a portfolio manager of the Fund, Mr. Munn was a senior equity analyst for the Fund. Mr. Munn received a Master of Business Administration degree from Fordham Graduate School of Business in 2003 and a Bachelors degree from Gettysburg College in 1993 â\u0080\u0094 with a double major in Finance and Accounting.",
        "category": "Market Neutral",
        "family": "Arbitrage Fund",
        "exchange": "NAS",
        "market": "us_market"
    },
    "ARBCX": {
        "short_name": "Arbitrage Fund Class C",
        "long_name": "The Arbitrage Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks to achieve capital growth by engaging in merger arbitrage.\n The fund will invest at least 80% of its net assets in equity securities of companies (both U.S. and foreign) that are involved in publicly announced mergers, takeovers, tender offers, leveraged buyouts, spin-offs, liquidations and other corporate reorganizations. Equity securities include common and preferred stock. Merger arbitrage is a highly specialized investment approach designed to profit from the successful completion of mergers, takeovers, tender offers, leveraged buyouts, spin-offs, liquidations and other corporate reorganizations.",
        "manager_name": "John  Orrico",
        "manager_bio": "John Orrico, CFA, serves as Chief Investment Officer of t Water Island Capital, LLC. Prior to organizing Water Island in January 2000, Mr. Orrico assisted in the management of private trusts and entities employing merger arbitrage strategies. Mr. Orrico received a Bachelor's degree from Georgetown University in 1982 â\u0080\u0093 with a double major in Finance and International Management. He received the Chartered Financial Analyst designation in 1988.",
        "category": "Market Neutral",
        "family": "Arbitrage Fund",
        "exchange": "NAS",
        "market": "us_market"
    },
    "BDMAX": {
        "short_name": "BlackRock Global Long/Short Equ",
        "long_name": "BlackRock Global Long/Short Equity Fund Investor A Shares",
        "currency": "USD",
        "summary": "The investment seeks total return over the long term.\n Under normal circumstances, the fund invests at least 80% of its total assets in equity instruments and related derivative instruments issued by, or tied economically to, companies located in developed markets. It pursues its investment objective by taking both long and short positions in a variety of developed market equity instruments. The fund may invest in securities of issuers of any market capitalization and in securities denominated in either U.S. dollars or foreign currencies.",
        "manager_name": "Kevin  Franklin",
        "manager_bio": "Kevin Franklin, Managing Director, is a member of BlackRock's Systematic Active Equity Investment Group. He is responsible for BlackRock's Global Equity Strategies. Mr. Franklin rejoined the firm in 2010, building on five prior years of service with Barclays Global Investors (BGI), which merged with BlackRock in 2009. He joined BlackRock after a year as head of Automated Trading at Marble Bar Asset Management in London, where he was responsible for MBAM's European systematic equity long-short product. At BGI, his previous roles include head of Portfolio Management for The 32 Capital Fund equity long-short strategy, as well as head of Market Neutral, Europe Active Equities. Prior to joining BGI, Mr. Franklin was a portfolio manager and trader at Horizon Asset Limited. Mr. Franklin earned a BS degree in applied physics and history from the California Institute of Technology in 2000.",
        "category": "Market Neutral",
        "family": "BlackRock",
        "exchange": "NAS",
        "market": "us_market"
    },
    "BDMCX": {
        "short_name": "BlackRock Global Long/Short Equ",
        "long_name": "BlackRock Global Long/Short Equity Fund Investor C Shares",
        "currency": "USD",
        "summary": "The investment seeks total return over the long term.\n Under normal circumstances, the fund invests at least 80% of its total assets in equity instruments and related derivative instruments issued by, or tied economically to, companies located in developed markets. It pursues its investment objective by taking both long and short positions in a variety of developed market equity instruments. The fund may invest in securities of issuers of any market capitalization and in securities denominated in either U.S. dollars or foreign currencies.",
        "manager_name": "Kevin  Franklin",
        "manager_bio": "Kevin Franklin, Managing Director, is a member of BlackRock's Systematic Active Equity Investment Group. He is responsible for BlackRock's Global Equity Strategies. Mr. Franklin rejoined the firm in 2010, building on five prior years of service with Barclays Global Investors (BGI), which merged with BlackRock in 2009. He joined BlackRock after a year as head of Automated Trading at Marble Bar Asset Management in London, where he was responsible for MBAM's European systematic equity long-short product. At BGI, his previous roles include head of Portfolio Management for The 32 Capital Fund equity long-short strategy, as well as head of Market Neutral, Europe Active Equities. Prior to joining BGI, Mr. Franklin was a portfolio manager and trader at Horizon Asset Limited. Mr. Franklin earned a BS degree in applied physics and history from the California Institute of Technology in 2000.",
        "category": "Market Neutral",
        "family": "BlackRock",
        "exchange": "NAS",
        "market": "us_market"
    },
    "CBHCX": {
        "short_name": "Victory Market Neutral Income F",
        "long_name": "Victory Market Neutral Income Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks high current income.\n The fund seeks to achieve its investment objective by implementing a proprietary, rules-based market neutral investment strategy designed to seek income from its investments while maintaining a low correlation to the foreign and domestic equity and bond markets.",
        "manager_name": "Mannik  Dhillon",
        "manager_bio": "Mannik S. Dhillon serves as President of VictoryShares and Solutions for Victory Capital. In his role, he leads and oversees the firms' exchange-traded and solutions business. He is also responsible for setting the strategy and initiating the development and implementation of Victory's strategic beta-based offerings. Additionally, he manages the solutions provided by our investment franchises, which includes product enhancements, extensions and innovations designed to best meet the needs of clients. Mr. Dhillon also contributes to the evaluation of capabilities of potential new franchises as part of the firm's acquisition strategy.",
        "category": "Market Neutral",
        "family": "Victory Capital",
        "exchange": "NAS",
        "market": "us_market"
    },
    "CBHMX": {
        "short_name": null,
        "long_name": "Victory Market Neutral Income Fund Member Class",
        "currency": "USD",
        "summary": "The investment seeks high current income.\n The fund seeks to achieve its investment objective by implementing a proprietary, rules-based market neutral investment strategy designed to seek income from its investments while maintaining a low correlation to the foreign and domestic equity and bond markets.",
        "manager_name": "Mannik  Dhillon",
        "manager_bio": "Mannik S. Dhillon serves as President of VictoryShares and Solutions for Victory Capital. In his role, he leads and oversees the firms' exchange-traded and solutions business. He is also responsible for setting the strategy and initiating the development and implementation of Victory's strategic beta-based offerings. Additionally, he manages the solutions provided by our investment franchises, which includes product enhancements, extensions and innovations designed to best meet the needs of clients. Mr. Dhillon also contributes to the evaluation of capabilities of potential new franchises as part of the firm's acquisition strategy.",
        "category": "Market Neutral",
        "family": "Victory Capital",
        "exchange": "NAS",
        "market": "us_market"
    },
    "CVSCX": {
        "short_name": "Calamos Market Neutral Fd Cl C",
        "long_name": "Calamos Market Neutral Income Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks high current income consistent with stability of principal.\n The fund invests (i) equities (ii) convertible securities of U.S. companies without regard to market capitalization and (iii) employs short selling and enters into total return swaps to enhance income and hedge against market risk. The average term to maturity of the convertible securities purchased by the fund will typically range from two to ten years. It may seek to generate income from option premiums by writing (selling) options. The fund may invest without limit in high yield fixed-income securities (often referred to as \"junk bonds\").",
        "manager_name": "John  Calamos",
        "manager_bio": "John Calamos is Chairman and Global CIO of Calamos Investments, the firm he founded in 1977. With origins as an institutional convertible bond manager, Calamos Investments has grown into a global asset management firm with institutional and individual clients worldwide. Headquartered in the Chicago metropolitan area, the firm also has offices in New York, San Francisco, Milwaukee and the Miami area.\n\nMr. Calamos established research and investment processes centered around a team-based approach designed to deliver superior risk-adjusted performance over full market cycles through a range of U.S. and global investment solutions including equity, fixed income, convertible and alternative strategies. As a pioneer in convertible securities, Calamos launched one of the first convertible funds in 1985 as a way to manage risk for clients in volatile times. He also established one of the first liquid alternative funds in 1990, reflecting a focus on innovation that continues to this day. Mr. Calamos has built a reputation for using investment techniques to control risk, preserve capital and build wealth for clients over the long term. \n\nWith more than 50 years of industry experience, he is often quoted as an authority on risk-managed investment strategies, markets, and the economy. He is a frequent speaker at investment conferences around the world and appears regularly on CNBC, Bloomberg TV and Fox Business Channel. He has authored two books, Investing in Convertible Securities: Your Complete Guide to the Risks and Rewards and Convertible Securities: The Latest Instruments, Portfolio Strategies, and Valuation Analysis. \nÂ \nPrior to entering the investment industry, Mr. Calamos served in the United States Air Force. During the Vietnam War, he served as a Forward Air Controller, with responsibilities for guiding accurate air strikes and preventing injuries to friendly troops. His squadron was the first to fly the Cessna O-2, an aircraft in which he recorded over 400 missions in combat. Captain Calamos was awarded the Distinguished Flying Cross for â\u0080\u009cextraordinary achievement while participating in aerial flight under heavy hostile attack.â\u0080\u009d His Air Force career included five years of active duty flying B-52 bombers and twelve years in the Reserves flying A-37 jet fighters. He retired as a Major. \nÂ \nThe son of Greek immigrants, Mr. Calamos is an active philanthropist supporting educational institutions and Hellenic organizations. He serves as Chairman of the Board of Directors for the National Hellenic Museum in Chicago. He is an investment committee member of the Faith Endowment, and a supporting member of the National Hellenic Society, Leadership 100 and The Hellenic Initiative. He received a B.A. in Economics and an M.B.A. in Finance from Illinois Tech, where he established Endowed Chairs in Philosophy and Business and is also a member of the Board of Trustees. He received an Honorary Doctorate in Humanities from Hellenic College Holy Cross.",
        "category": "Market Neutral",
        "family": "Calamos",
        "exchange": "NAS",
        "market": "us_market"
    },
    "CVSOX": {
        "short_name": "Calamos Market Neutral Income F",
        "long_name": "Calamos Market Neutral Income Class R6",
        "currency": "USD",
        "summary": "The investment seeks high current income consistent with stability of principal.\n The fund invests (i) equities (ii) convertible securities of U.S. companies without regard to market capitalization and (iii) employs short selling and enters into total return swaps to enhance income and hedge against market risk. The average term to maturity of the convertible securities purchased by the fund will typically range from two to ten years. It may seek to generate income from option premiums by writing (selling) options. The fund may invest without limit in high yield fixed-income securities (often referred to as \"junk bonds\").",
        "manager_name": "John  Calamos",
        "manager_bio": "John Calamos is Chairman and Global CIO of Calamos Investments, the firm he founded in 1977. With origins as an institutional convertible bond manager, Calamos Investments has grown into a global asset management firm with institutional and individual clients worldwide. Headquartered in the Chicago metropolitan area, the firm also has offices in New York, San Francisco, Milwaukee and the Miami area.\n\nMr. Calamos established research and investment processes centered around a team-based approach designed to deliver superior risk-adjusted performance over full market cycles through a range of U.S. and global investment solutions including equity, fixed income, convertible and alternative strategies. As a pioneer in convertible securities, Calamos launched one of the first convertible funds in 1985 as a way to manage risk for clients in volatile times. He also established one of the first liquid alternative funds in 1990, reflecting a focus on innovation that continues to this day. Mr. Calamos has built a reputation for using investment techniques to control risk, preserve capital and build wealth for clients over the long term. \n\nWith more than 50 years of industry experience, he is often quoted as an authority on risk-managed investment strategies, markets, and the economy. He is a frequent speaker at investment conferences around the world and appears regularly on CNBC, Bloomberg TV and Fox Business Channel. He has authored two books, Investing in Convertible Securities: Your Complete Guide to the Risks and Rewards and Convertible Securities: The Latest Instruments, Portfolio Strategies, and Valuation Analysis. \nÂ \nPrior to entering the investment industry, Mr. Calamos served in the United States Air Force. During the Vietnam War, he served as a Forward Air Controller, with responsibilities for guiding accurate air strikes and preventing injuries to friendly troops. His squadron was the first to fly the Cessna O-2, an aircraft in which he recorded over 400 missions in combat. Captain Calamos was awarded the Distinguished Flying Cross for â\u0080\u009cextraordinary achievement while participating in aerial flight under heavy hostile attack.â\u0080\u009d His Air Force career included five years of active duty flying B-52 bombers and twelve years in the Reserves flying A-37 jet fighters. He retired as a Major. \nÂ \nThe son of Greek immigrants, Mr. Calamos is an active philanthropist supporting educational institutions and Hellenic organizations. He serves as Chairman of the Board of Directors for the National Hellenic Museum in Chicago. He is an investment committee member of the Faith Endowment, and a supporting member of the National Hellenic Society, Leadership 100 and The Hellenic Initiative. He received a B.A. in Economics and an M.B.A. in Finance from Illinois Tech, where he established Endowed Chairs in Philosophy and Business and is also a member of the Board of Trustees. He received an Honorary Doctorate in Humanities from Hellenic College Holy Cross.",
        "category": "Market Neutral",
        "family": "Calamos",
        "exchange": "NAS",
        "market": "us_market"
    },
    "GUMAX": {
        "short_name": "Guggenheim Market Neutral Real ",
        "long_name": "Guggenheim Market Neutral Real Estate Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks to provide capital appreciation, while limiting exposure to general stock market risk.\n The fund pursues its investment objective by investing at least 80% of its assets (net assets, plus the amount of any borrowings for investment purposes) in: (i) long and short equity securities of issuers primarily engaged in the real estate industry, such as real estate investment trusts (\"REITs\"); and (ii) equity-like securities, including individual securities, exchange-traded funds (\"ETFs\") and derivatives, giving long and short exposure to issuers primarily engaged in the real estate industry.",
        "manager_name": "Thomas  Youn",
        "manager_bio": "Thomas Youn, CFA, Managing Director and Portfolio Manager of Guggenheim Partners, has co-managed the Guggenheim Market Neutral Real Estate Fund since its inception (February 2016) and the Guggenheim Risk Managed Real Estate Fund since its inception (March 2014). Mr. Youn joined the Investment Manager in 2009, and is responsible for managing the Investment Manager's listed real estate strategies. Mr. Youn has more than 15 years of experience in the financial markets with a concentration in public and private real estate investing. Prior to joining the Investment Manager, Mr. Youn managed real estate strategies at Cliffwood Partners, where he served as a real estate generalist covering REITs and real estate C-Corps in the U.S. and Canada. He also assisted with portfolio construction and development of key investment themes and exposure targets for hedged and long-only funds. Prior to that, Mr. Youn was a Senior Equity Research Associate for Green Street Advisors covering the retail REIT sector. Prior to that, Mr. Youn gained public and private real estate experience working for Green Street Advisors and AEW Capital Management. Mr. Youn holds a B.S. in Finance from the University of Southern California and has earned the Chartered Financial Analyst designation.",
        "category": "Market Neutral",
        "family": "Guggenheim Investments",
        "exchange": "NAS",
        "market": "us_market"
    },
    "HSIEX": {
        "short_name": "Hussman Strategic International",
        "long_name": "Hussman Strategic International Fund",
        "currency": "USD",
        "summary": "The investment seeks to achieve long-term capital appreciation, with added emphasis on the protection of capital during unfavorable market conditions.\n Under normal market conditions, the fund invests principally in equity securities of companies that derive a majority of their revenues or profits from, or have a majority of their assets in, a country or countries other than the U.S. It invests principally in equity securities issued by companies in developed countries, but may also invest in emerging markets in developing countries.",
        "manager_name": "William J. Hester",
        "manager_bio": "William J. Hester, CFA is a Senior Research Analyst at Hussman Strategic Advisors, Inc. Prior to joining Hussman Strategic Advisors in 2003, Mr. Hester worked for Bloomberg L.P. where he was a member of the companyâ\u0080\u0099s Analytics Desk and a Markets Editor for Bloomberg Magazine. He holds a B.S. in Economics from Rider University and a M.S. in Finance from the Johns Hopkins Carey Business School, and is a Chartered Financial Analyst.",
        "category": "Market Neutral",
        "family": "Hussman Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "JRVAX": {
        "short_name": "James Alpha Relative Value Port",
        "long_name": "James Alpha Relative Value Portfolio A Shares",
        "currency": "USD",
        "summary": "The investment seeks attractive long-term risk-adjusted returns relative to traditional financial market indices.  The manager seeks to achieve its investment objective by attempting to outperform the returns of a variety of \"relative value\" investment strategies. It will seek to outperform the returns of various fixed income relative value strategies, such as, among others, asset-backed, master limited partnership (\"MLP\"), real estate, convertible arbitrage, corporate and sovereign strategies, as well as volatility investment strategies.",
        "manager_name": "Akos R. Beleznay",
        "manager_bio": "Akos Beleznay serves as Chief Investment Officer of James Alpha Advisors, LLC and is responsible for managing research and asset allocation for the firm. Prior to joining James Alpha Advisors, LLC, Mr. Beleznay was the Chief Investment Officer at Riverside, the asset management arm of HFR (Hedge Fund Research, Inc.) managing over one billion dollars of fund of hedge fund products. Before Riverside, Mr. Beleznay served as the Chief Investment Officer at Commerce Asset Management and CSG Asset Management with responsibility for managing funds of hedge funds and a hedge fund index replication product. Mr. Beleznay also served as the Director of Consulting Research for Equitas Capital Advisors, LLC from 2002 to 2010 and the Chief Investment Officer of Equitas Evergreen Fund LP, a fund of hedge funds with $300 million in assets, from 2003 to 2010. Mr. Beleznay has a PhD degree in Physics from Eotvos Lorand University, Hungary and an MBA from Tulane University.",
        "category": "Market Neutral",
        "family": "James Alpha Advisors",
        "exchange": "NAS",
        "market": "us_market"
    },
    "JRVCX": {
        "short_name": "James Alpha Relative Value Port",
        "long_name": "James Alpha Relative Value Portfolio C Shares",
        "currency": "USD",
        "summary": "The investment seeks attractive long-term risk-adjusted returns relative to traditional financial market indices.  The manager seeks to achieve its investment objective by attempting to outperform the returns of a variety of \"relative value\" investment strategies. It will seek to outperform the returns of various fixed income relative value strategies, such as, among others, asset-backed, master limited partnership (\"MLP\"), real estate, convertible arbitrage, corporate and sovereign strategies, as well as volatility investment strategies.",
        "manager_name": "Akos R. Beleznay",
        "manager_bio": "Akos Beleznay serves as Chief Investment Officer of James Alpha Advisors, LLC and is responsible for managing research and asset allocation for the firm. Prior to joining James Alpha Advisors, LLC, Mr. Beleznay was the Chief Investment Officer at Riverside, the asset management arm of HFR (Hedge Fund Research, Inc.) managing over one billion dollars of fund of hedge fund products. Before Riverside, Mr. Beleznay served as the Chief Investment Officer at Commerce Asset Management and CSG Asset Management with responsibility for managing funds of hedge funds and a hedge fund index replication product. Mr. Beleznay also served as the Director of Consulting Research for Equitas Capital Advisors, LLC from 2002 to 2010 and the Chief Investment Officer of Equitas Evergreen Fund LP, a fund of hedge funds with $300 million in assets, from 2003 to 2010. Mr. Beleznay has a PhD degree in Physics from Eotvos Lorand University, Hungary and an MBA from Tulane University.",
        "category": "Market Neutral",
        "family": "James Alpha Advisors",
        "exchange": "NAS",
        "market": "us_market"
    },
    "NIMEX": {
        "short_name": "Nuveen Equity Market Neutral Fu",
        "long_name": "Nuveen Equity Market Neutral Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks to provide long-term capital appreciation independent of the U.S. equity market.\n The fund pursues its investment objective utilizing a market neutral strategy, the goal of which is to generate absolute returns that are due primarily to stock selection, rather than the returns and direction of the stock market. It implements its market neutral strategy by establishing long and short positions in a diversified portfolio of equity securities. Substantially all of the equity securities in which the fund takes long and short positions will be included in the Russell 1000 Index at the time of purchase.",
        "manager_name": "Robert  Doll",
        "manager_bio": "Scott M. Tonneson, titulaire de la certification CFA, a commencÃ© Ã  travailler dans le secteur financier en 1994 avant de rejoindre FAF en 2007. Auparavant, il travaillait chez Ameriprise Financial en tant quâ\u0080\u0099analyste actions quantitatif, analyste de sociÃ©tÃ© et analyste comptable. Il entre chez Nuveen Asset Management le 1er janvier 2011, dans le cadre de lâ\u0080\u0099acquisition dâ\u0080\u0099une division de lâ\u0080\u0099activitÃ© de gestion dâ\u0080\u0099actifs de FAF.",
        "category": "Market Neutral",
        "family": "Nuveen",
        "exchange": "NAS",
        "market": "us_market"
    },
    "NMAEX": {
        "short_name": "Nuveen Equity Market Neutral Fu",
        "long_name": "Nuveen Equity Market Neutral Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks to provide long-term capital appreciation independent of the U.S. equity market.\n The fund pursues its investment objective utilizing a market neutral strategy, the goal of which is to generate absolute returns that are due primarily to stock selection, rather than the returns and direction of the stock market. It implements its market neutral strategy by establishing long and short positions in a diversified portfolio of equity securities. Substantially all of the equity securities in which the fund takes long and short positions will be included in the Russell 1000 Index at the time of purchase.",
        "manager_name": "Robert  Doll",
        "manager_bio": "Scott M. Tonneson, titulaire de la certification CFA, a commencÃ© Ã  travailler dans le secteur financier en 1994 avant de rejoindre FAF en 2007. Auparavant, il travaillait chez Ameriprise Financial en tant quâ\u0080\u0099analyste actions quantitatif, analyste de sociÃ©tÃ© et analyste comptable. Il entre chez Nuveen Asset Management le 1er janvier 2011, dans le cadre de lâ\u0080\u0099acquisition dâ\u0080\u0099une division de lâ\u0080\u0099activitÃ© de gestion dâ\u0080\u0099actifs de FAF.",
        "category": "Market Neutral",
        "family": "Nuveen",
        "exchange": "NAS",
        "market": "us_market"
    },
    "PSCIX": {
        "short_name": "American Beacon SSI Alternative",
        "long_name": "American Beacon SSI Alternative Income Fund --Y Class",
        "currency": "USD",
        "summary": "The investment seeks income and, secondarily, absolute returns.\n The fund seeks primarily to implement a convertible arbitrage strategy by investing in convertible securities, including convertible preferred securities, and establishing short positions, or hedges, in the common stock of the issuers of the convertible securities. It may also use other instruments to establish hedges, including exchange-traded funds (â\u0080\u009cETFsâ\u0080\u009d), options and currency forwards, as appropriate, to reduce unwanted exposures. The fund may have significant exposure to the Financial sector.",
        "manager_name": "Dagney M. Maseda",
        "manager_bio": "Dagney Hollander is a portfolio manager at SSI and oversees the daily management of the Hedged Convertible investment portfolios. Her industry experience as a trading assistant, analyst and portfolio manager began since 2003. She received a BS in Finance, summa cum laude, from California State University, Northridge. She is a CFA Level III Candidate.",
        "category": "Market Neutral",
        "family": "American Beacon",
        "exchange": "NAS",
        "market": "us_market"
    },
    "QMNIX": {
        "short_name": "AQR Equity Market Neutral Fund ",
        "long_name": "AQR Equity Market Neutral Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks positive absolute returns.\n The fund is designed to be market- or beta-neutral, which means that the fund seeks to achieve returns that are not closely correlated with the returns of the equity markets in which the fund invests. Under normal market conditions, it pursues its investment objective by investing at least 80% of its net assets (including borrowings for investment purposes) in equity instruments and equity related and/or derivative instruments.",
        "manager_name": "Andrea  Frazzini",
        "manager_bio": "Andrea is a Principal on AQRâ\u0080\u0099s Global Stock Selection team, focusing on research and portfolio management of the Firmâ\u0080\u0099s Long/Short and Long-Only equity strategies. He is also an Adjunct Professor of Finance at New York Universityâ\u0080\u0099s Stern School of Business. He has published in top academic journals and won several awards for his research, including the Smith Breeden Award, the Fama-DFA award, the BGI best paper award, several Bernstein Fabozzi/Jacobs Levy Awards, and the PanAgora Crowell Memorial Prize. Prior to AQR in 2008, Andrea was an associate professor of finance at the University of Chicagoâ\u0080\u0099s Graduate School of Business and a Research Associate at the National Bureau of Economic Research. He also served as a consultant for DKR Capital Partners and J.P. Morgan Securities and on the board of directors of the Center for Research in Security Prices at the University of Chicago. He earned a B.S. in economics from the University of Roma Tre, an M.S. in economics from the London School of Economics and a Ph.D. in economics from Yale University.",
        "category": "Market Neutral",
        "family": "AQR Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "VARAX": {
        "short_name": "Vivaldi Merger Arbitrage Fund -",
        "long_name": "Vivaldi Merger Arbitrage Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks returns that are largely uncorrelated with the returns of the general stock market, and capital appreciation.\n Under normal market conditions, the fund primarily invests in equity securities (publicly-traded common stock and preferred stock) and derivatives thereof of companies that are involved in a significant corporate event, such as a merger or acquisition. Investments in companies undergoing a merger or acquisition have both risk and return characteristics that are different from the risks of investing in the general stock market. It may invest in equity securities of any market capitalization. The fund is non-diversified.",
        "manager_name": "Daniel  Lancz",
        "manager_bio": "Mr. Lancz has served as Portfolio Manager for Vivaldi Asset Management since November 2014. Prior to joining Vivaldi, Mr. Lancz was the Chief Compliance Officer, Director of Research and Member of the General Partner of Glenfinnen Capital LLC since 2003. Mr. Lancz was also the Director of Research at Augusta Capital Management L.P. from 2000 until 2003. Mr. Lancz received a Bachelor of Science degree from Miami University.",
        "category": "Market Neutral",
        "family": "Vivaldi",
        "exchange": "NAS",
        "market": "us_market"
    },
    "WMNIX": {
        "short_name": "Westwood Alternative Income Fun",
        "long_name": "Westwood Alternative Income Fund Institutional Shares",
        "currency": "USD",
        "summary": "The investment seeks to provide absolute returns through a combination of current income and capital appreciation with low correlation to equity and fixed income markets.\n The fund employs an absolute return strategy, which means that it seeks to earn a positive total return through a combination of current income and capital appreciation in all market conditions, by maintaining a portfolio that is designed to have low volatility and low correlations with equity and fixed income markets over a full market cycle. The fund invests primarily in income producing convertible securities.",
        "manager_name": "Seth  Gold",
        "manager_bio": "Mr. Seth Gold has served as Vice President for the Adviser since joining the Adviser in 2015. Prior to joining the Adviser, Mr. Gold served as an Analyst/Trader for a global convertible securities strategy at Zazove Associates, where he was responsible for trading decisions and portfolio optimization. Prior to that, Mr. Gold worked for Mizuho Securities. Mr. Gold earned his MBA with a focus in Finance and Management from Columbia Business School and his BA in Economics and Business from Kalamazoo College. Mr. Gold has served on the portfolio team for the Westwood Alternative Income Fund since 2020. Mr. Gold participates in the investment decision process. He has authority to direct trading activity for the Fund and is also responsible for representing the Fund to investors. Mr. Gold has more than 12 years of investment experience.",
        "category": "Market Neutral",
        "family": "Westwood",
        "exchange": "NAS",
        "market": "us_market"
    }
}