{
    "0P000073A1.TO": {
        "short_name": "Chou Asie",
        "long_name": "Chou Asia",
        "currency": "CAD",
        "summary": "The Fund&#39;s objective is to provide long-term growth of capital by investing primarily in the securities markets of Asia considered by the Manager to be undervalued. Investments may be made in securities markets outside of Asia. Investments may include common and preferred shares, convertible debentures, government and corporate bonds and short term indebtedness.",
        "manager_name": "Francis S.M. Chou",
        "manager_bio": "Francis S.M. Chou, Chief Executive Officer of Chou America Management Inc.. Mr. Chou also serves as CEO of Chou Associates Management Inc. (â\u0080\u009cChou Associatesâ\u0080\u009d), an investment adviser based in Toronto, Canada, which manages the Chou family of Canadian mutual funds (â\u0080\u009cChou Fundsâ\u0080\u009d). Mr. Chou has been the CEO of Chou Associates and the Portfolio Manager of the Chou Funds since 1986. In addition, Mr. Chou served as a Senior Vice President for Fairfax Financial Holdings from 1996-2007.",
        "category": "Miscellaneous - Other",
        "family": "Chou Associates Management Inc",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 14298006.667999506
    },
    "0P0000A0EX.TO": {
        "short_name": "VPI CGOV World Equity Pool",
        "long_name": "VPI Value Pool",
        "currency": "CAD",
        "summary": "VPI Value Poolâ\u0080\u0099s objective is to provide unitholders with long-term growth while preserving capital. VPI Value Pool invests in North American and international-based equity securities.",
        "manager_name": "Gordon  O'Reilly",
        "manager_bio": "Gordon began his career with Manufacturers Life Insurance Company where he worked between 1989 and 1995, gaining experience in the area of foreign exchange, securities analysis, trading and portfolio management. Gordon is a member of the Advisory Board of Waterloo Tech Capital, a venture capital fund specializing in Waterloo based technology companies. He is also on the Investment Committee of the United Church of Canada Pension Fund.",
        "category": "Miscellaneous - Other",
        "family": "Value Partners Investment Inc",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 34488111.79744196
    },
    "0P0001A932.TO": {
        "short_name": "BMO à revenu fixe Réduct du r",
        "long_name": "BMO Risk Reduction Fixed Income Fund Advisor Series",
        "currency": "CAD",
        "summary": "This fundâ\u0080\u0099s objective is to seek to preserve the value of your investment, to provide the potential for income and to reduce portfolio volatility as compared to the broader global fixed income market by investing primarily, directly or indirectly, in global fixed income securities and/or derivatives.",
        "manager_name": "Andrew  Osterback",
        "manager_bio": "Andrew joined BMO Asset Management Inc.â\u0080\u0099s active fixed income team as a portfolio manager in 2005, & has over 20 yrs experience in managing fixed income portfolios. Andrew overseas portfolios with an emphasis on the interest anticipation aspects of govmt bond sectors. Prior to joining BMO AM, he managed a mix of mutual funds, pooled assets, and segrtd. private client portfolios for a major institutional investor. Andrew holds an Honours BCom degree from the University of Windsor, a Bachelor of Arts degree (Economics) from the University of Western Ont & received his CFA designation in 1999.",
        "category": "Miscellaneous - Other",
        "family": "BMO Investments Inc.",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 1098062546.3243103
    },
    "0P0001A934.TO": {
        "short_name": "BMO d'actions Réduction du ris",
        "long_name": "BMO Risk Reduction Equity Fund Advisor Series",
        "currency": "CAD",
        "summary": "This fundâ\u0080\u0099s objective is to seek to preserve the value of your investment, to provide the potential for growth and to reduce portfolio volatility as compared to the broader global equity market by investing primarily, directly or indirectly, in global equity securities and/or derivatives.",
        "manager_name": "Chris  McHaney",
        "manager_bio": "Chris has more than fourteen years of experience in the investment industry and currently serves as portfolio manager for derivative-based and equity-based portfolios. He has taken on numerous roles since joining BMO in 2002, including Manager of Investments for BMO Asset Management Inc. where he was responsible for mutual fund manager monitoring and selection. In this role, he was also responsible for overseeing the currency hedging program across the mutual fund platform. Chris holds a BBA from York University's Schulich School of Business and is a CFA Charterholder.",
        "category": "Miscellaneous - Other",
        "family": "BMO Investments Inc.",
        "exchange": "TOR",
        "market": "ca_market",
        "total_assets": 1062220043.062561
    }
}