{
    "0P00012GNR.NZ": {
        "short_name": "Bentham Global Income Fund NZD",
        "long_name": "Bentham Global Income Fund NZD",
        "currency": "NZD",
        "summary": "The Fund invests in global credit and fixed interest markets. The underlying fundâ\u0080\u0099s investments include, but are not limited to, Australian and global hybrid securities, global high yield bonds, global syndicated loans, investment grade securities, global capital securities, asset backed securities, equities and derivatives. SAA guidelines are 90 to 100% in underlying fund and 0 to 10% in Cash.",
        "manager_name": "Richard  Quin",
        "manager_bio": "Richard Quin is the head portfolio manager for Bentham. Prior to this, he was a senior portfolio manager at Credit Suisse for 13 years. Mr Quin spent nine years within the Credit Suisse Asset Management (CSAM) fixed income team as a credit portfolio manager, before moving internally in July 2006 to the Alternative Investments Credit Investments Group as a Senior Portfolio Manager and a member of the management team. \n\nMr Quin held a number of senior roles during his time at CSAM, including as a member of the division's Global Credit Investment Committee and chair of the Global Swaps Derivative Investment Committee. Mr Quin was responsible for the development of the High Grade Alpha Transfer Fund and the Diversified Fixed Interest funds in Australia, also while at Credit Suisse he established Bentham's current high yield, global income, and syndicated loan funds. \n\nBefore joining Credit Suisse, Mr Quin was a liability consultant to the South Australian Finance Authority, and spent four years as a bond options trader for the SBSA. \n\nMr Quin holds a Bachelor of Business from the University of South Australia and a Masters of Applied Finance from Macquarie University",
        "category": "Miscellaneous NZD",
        "family": "Challenger Ltd",
        "exchange": "NZE",
        "market": "nz_market"
    },
    "0P00012GNS.NZ": {
        "short_name": "Bentham Wholesale Syndicated Lo",
        "long_name": "Bentham Wholesale Syndicated Loan NZD",
        "currency": "NZD",
        "summary": "The underlying fund typically invests in the senior secured syndicated loan market but may have limited exposure to other credit investments including, but not limited to, senior loans, second lien loans, high yield bonds, credit default swaps and collateralized debt obligations. The underlying fundâ\u0080\u0099s investments are typically denominated in United States dollars but may also be denominated in other currencies.",
        "manager_name": "Richard  Quin",
        "manager_bio": "Richard Quin is the head portfolio manager for Bentham. Prior to this, he was a senior portfolio manager at Credit Suisse for 13 years. Mr Quin spent nine years within the Credit Suisse Asset Management (CSAM) fixed income team as a credit portfolio manager, before moving internally in July 2006 to the Alternative Investments Credit Investments Group as a Senior Portfolio Manager and a member of the management team. \n\nMr Quin held a number of senior roles during his time at CSAM, including as a member of the division's Global Credit Investment Committee and chair of the Global Swaps Derivative Investment Committee. Mr Quin was responsible for the development of the High Grade Alpha Transfer Fund and the Diversified Fixed Interest funds in Australia, also while at Credit Suisse he established Bentham's current high yield, global income, and syndicated loan funds. \n\nBefore joining Credit Suisse, Mr Quin was a liability consultant to the South Australian Finance Authority, and spent four years as a bond options trader for the SBSA. \n\nMr Quin holds a Bachelor of Business from the University of South Australia and a Masters of Applied Finance from Macquarie University",
        "category": "Miscellaneous NZD",
        "family": "Challenger Ltd",
        "exchange": "NZE",
        "market": "nz_market"
    }
}