{"0P000070MK.TO": {"short_name": "Quadrus Fonds de ressources can", "long_name": "Quadrus Mackenzie Global Resource Q", "currency": "CAD", "summary": "The Fund pursues long-term capital growth primarily from investment in shares of companies operating anywhere in the world in the energy and natural resource industries. \nAt least three different countries will usually be represented in the Fundâ\u0080\u0099s overall portfolio holdings.", "manager_name": "Management  Team", "manager_bio": "Team Managed", "category": "Natural Resources Equity", "family": "Quadrus Investment Services Ltd", "exchange": "TOR", "market": "ca_market"}, "0P0000GD75.TO": {"short_name": "Marquest Explorer Series A Roll", "long_name": "Marquest Explorer Series A Rollover", "currency": "CAD", "summary": "The fundamental investment objective of the Explorer Series Fund is to seek long-term capital growth by investing in a diversified portfolio of primarily equity securities of attractive Canadian mineral exploration and mining companies.", "manager_name": "Gerry L. Brockelsby", "manager_bio": "Gerry L. Brockelsby is the Founder of Marquest Asset Management Inc. Mr. Brockelsby began his career over 38 years ago at Canada Permanent Trust managing family trust funds. Between 1977 and 1980, Mr. Brockelsby managed pension funds at Canada Trust following which he joined INCO Limited as Chief Investment Officer of their pension plan. In 1989, Mr. Brockelsby founded Marquest Asset Management which provides investment management services to institutional and individual clients. Mr. Brockelsby has a BA in Business Administration and is a Chartered Financial Analyst.", "category": "Natural Resources Equity", "family": "Marquest Asset Management Inc", "exchange": "TOR", "market": "ca_market"}, "0P0001EH7Y.TO": {"short_name": "Ninepoint Resource Class Series", "long_name": "Ninepoint Resource Class Series D", "currency": "CAD", "summary": "The investment objective of the Fund is to seek to achieve long-term capital growth. The Fund invests primarily in equity and equity-related securities of companies in Canada and around the world that are involved directly or indirectly in the natural resource sector.", "manager_name": "Jason  Mayer", "manager_bio": "Jason Mayer joined Sprott Asset Management LP in November 2012. Jason joined Sprott from Middlefield Capital Corporation, where he acted as lead portfolio manager on a number of investment funds with a focus on growth-oriented resource equities. \n\nMr. Mayer is an MBA graduate of the Schulich School of Business (York University) and holds the Chartered Financial Analyst designation.", "category": "Natural Resources Equity", "family": "Ninepoint Partners LP", "exchange": "TOR", "market": "ca_market"}}