{
    "AVOLX": {
        "short_name": "Arin Large Cap Theta Fund Insti",
        "long_name": "Arin Large Cap Theta Fund Institutional Class",
        "currency": "USD",
        "summary": "The investment seeks maximum relative total return versus the S&P 500 Stock Index through a combination of capital appreciation and current income.\n The fund normally will invest at least 80% of net assets, plus borrowings for investment purposes, in a portfolio of securities whose value is based on companies with market capitalizations that qualify them as \"large-cap\" companies. The advisor considers a company to be a \"large cap\" company if its market capitalization is at least $10 billion.",
        "manager_name": "Lawrence  Lempert",
        "manager_bio": "Mr. Lempert has been the Trading Director of the Arin Risk Advisors, LLC since the firm's founding in 2009 and Chief Compliance Officer since 2011. Prior to joining the Arin, he founded and managed Bullock Capital, LLC's proprietary stock/option trading operation and previously served as a market maker/index/sector correlation and dispersion trader with Susquehanna International Group. Mr. Lempert earned a Bachelor of Science degree in Statistics and Economics from Rutgers College, a Juris Doctor from Villanova University School of Law, and a Master of Laws in Taxation from New York University School of Law.",
        "category": "Options-based",
        "family": "Nottingham",
        "exchange": "NAS",
        "market": "us_market"
    },
    "CAHEX": {
        "short_name": "Calamos Hedged Equity Income Fu",
        "long_name": "Calamos Hedged Equity Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks total return with lower volatility than equity markets.\n The fund seeks to achieve total return with lower volatility than equity markets. Under normal circumstances, it invests at least 80% of its net assets (plus any borrowings for investment purposes) in equity securities and securities with economic characteristics similar to stock or the equity markets. The fund may write call options (i) on a portion of the equity securities in the fund&#39;s portfolio and (ii) on broad-based securities indexes (such as the S&P 500 or MSCI EAFE) or ETFs (exchange traded funds).",
        "manager_name": "David  Oâ\u0080\u0099Donohue",
        "manager_bio": "David Oâ\u0080\u0099Donohue joined CALAMOS ADVISORS in August 2014 and has been a Co-Portfolio Manager since September 2015. Between March 2013 and August 2014, he was a Trader at Forty4 Asset Management LLC/Hard8 Futures LLC. Prior thereto, Mr. Oâ\u0080\u0099Donohue was a Portfolio Manager at Chicago Fundamental Investment Partners LLC from February 2009 to November 2012.",
        "category": "Options-based",
        "family": "Calamos",
        "exchange": "NAS",
        "market": "us_market"
    },
    "ENGYX": {
        "short_name": "CBOE VEST S&P 500 Enhanced Grow",
        "long_name": "CBOE Vest S&P 500 Enhanced Growth Strategy Fund Class Y Shares",
        "currency": "USD",
        "summary": "The investment seeks to track, before fees and expenses, the performance of the CboeÂ® S&P 500Â® Enhanced Growth Index Balanced Series (the index).\n The adviser attempts to track, before fees and expenses, the performance of the index, by constructing a portfolio of specially designed options that are similar to options that comprise the indices that underlie the index. The fund effectively divides its portfolio into twelve segments, and each tranche is invested in options that are tied to a particular month of the year. The index measures the performance of a portfolio of purchased and written put and call FLEX options. The fund is non-diversified.",
        "manager_name": "Howard S. Rubin",
        "manager_bio": "Mr Rubin joined Cboe Vest in 2017. Prior to joining Vest, Mr. Rubin has served as Director of Portfolio Management at ProShare Advisors LLC from Dec 2007 to Sep 2013. Mr. Rubin has also served as Senior Portfolio Manager of ProFund Advisors LLC since Nov 2004 and Portfolio Manager of ProFund Advisors LLC from April 2000 through Nov 2004. Mr. Rubin holds the Chartered Financial Analyst (CFA) designation. Mr. Rubin received a masterâ\u0080\u0099s degree in finance from George Washington University. He also holds a bachelorâ\u0080\u0099s degree in economics from Wharton School of Finance, University of Pennsylvania.",
        "category": "Options-based",
        "family": "CBOE Vest",
        "exchange": "NAS",
        "market": "us_market"
    },
    "ENHNX": {
        "short_name": "CULLEN ENHANCED EQUITY INCOME F",
        "long_name": "Cullen Enhanced Equity Income Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation and current income.\n The fund invests at least 80% of its net assets, plus borrowings for investment purposes, in dividend paying common stocks of medium-capitalization companies (which are companies with a typical capitalization range of between $5 billion and $12 billion at the time of investment) and large-capitalization companies (which are companies with a typical capitalization range greater than $12 billion at the time of investment). It may invest up to 30% of its assets in foreign securities.",
        "manager_name": "Jennifer P. Chang",
        "manager_bio": "Ms. Chang joined Schafer Cullen in 2006. Prior to joining Schafer Cullen Capital Management, Mrs. Chang was an Investment Analyst at PNC Advisors and an associate consultant at Bain & Company. Mrs. Chang received her M.B.A. from the Wharton School of Business in 2004 and her B.S. from Rice University in 1999. She has held the Chartered Financial Analyst designation since 2007.",
        "category": "Options-based",
        "family": "Cullen Funds Trust",
        "exchange": "NAS",
        "market": "us_market"
    },
    "ENHRX": {
        "short_name": "CULLEN ENHANCED EQUITY INCOME F",
        "long_name": "Cullen Enhanced Equity Income Fund Retail Class",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation and current income.\n The fund invests at least 80% of its net assets, plus borrowings for investment purposes, in dividend paying common stocks of medium-capitalization companies (which are companies with a typical capitalization range of between $5 billion and $12 billion at the time of investment) and large-capitalization companies (which are companies with a typical capitalization range greater than $12 billion at the time of investment). It may invest up to 30% of its assets in foreign securities.",
        "manager_name": "Jennifer P. Chang",
        "manager_bio": "Ms. Chang joined Schafer Cullen in 2006. Prior to joining Schafer Cullen Capital Management, Mrs. Chang was an Investment Analyst at PNC Advisors and an associate consultant at Bain & Company. Mrs. Chang received her M.B.A. from the Wharton School of Business in 2004 and her B.S. from Rice University in 1999. She has held the Chartered Financial Analyst designation since 2007.",
        "category": "Options-based",
        "family": "Cullen Funds Trust",
        "exchange": "NAS",
        "market": "us_market"
    },
    "EQHEX": {
        "short_name": "Equable Shares Hedged Equity Fu",
        "long_name": "Equable Shares Hedged Equity Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks income, risk mitigation and long-term capital appreciation.\n The fund seeks to achieve its investment objective by investing in equity securities of U.S. issuers based on the S&P 500 Index (the \"index\") while hedging overall market exposure by writing (selling) exchange traded call options based on the same securities. Under normal market conditions, it will invest at least 80% of its net assets (plus any borrowings for investment purposes) in equity securities based on the index. The fund is non-diversified.",
        "manager_name": "Ronald A. Santella",
        "manager_bio": "Mr. Santella is the founder, Chief Executive Officer and Chief Investment Officer of the Adviser, and has over thirty years of experience in the financial markets as a successful entrepreneur and business. Mr. Santella started his career in 1985 at Oâ\u0080\u0099Connor and Associates in Chicago as a listed options trader. In 1986 he joined Grace Brothers as the head trader and portfolio manager for arbitrage strategies. In 1990, Mr. Santella founded and managed a hedge fund primarily focused on convertible bond and volatility arbitrage strategies. After a successful tenure of managing a series of hedge funds over the next 15 years, Mr. Santella established a family office in 2005 to invest his own capital, along with a limited number of partnersâ\u0080\u0099 capital, in alternative investment strategies. In 2008, Mr. Santella took the helm as CEO of Fox River Execution, an institutional brokerage firm, based in Geneva, Illinois. Under his leadership, Fox River aggressively grew its customer base, revenues and profit over a 2-year period; which resulted in the ultimate sale of the firm to SunGard in July of 2010. Since leaving SunGard in 2011, Mr. Santella has acted as an independent consultant, and has partnered with Woori Bank of Korea, SkyBridge Capital and ED&F Man Capital Markets to provide solutions and create products in alternatives, mutual funds and execution services for UIT sponsors.",
        "category": "Options-based",
        "family": "Equable Shares",
        "exchange": "NAS",
        "market": "us_market"
    },
    "FHEJX": {
        "short_name": "Delaware Hedged U.S. Equity Opp",
        "long_name": "Delaware Hedged U.S. Equity Opportunities Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks total return and, secondarily, capital preservation.\n The fund will seek to achieve its investment objective by investing in a broadly diversified portfolio of common stocks of any market capitalization while also investing in derivatives to help manage investment risk. It will invest at least 80% of its net assets (plus any borrowings for investment purposes) in equity securities of U.S. issuers and investments that provide exposure to such securities, including exchange-traded funds.",
        "manager_name": "Gregg R. Thomas",
        "manager_bio": "Mr. Thomas joined Wellington Management in 2002, where he currently serves as Senior Managing Director and Associate Director, Investment Strategy and Risk. \nAs associate director of Investment Strategy and Risk, Gregg conducts original research on portfolio and risk-management topics, leads various Wellington Management internal investment oversight processes, and analyzes key trends and investment risks across the equity, fixed income, asset allocation, and hedge fund product suites. In addition, he is a portfolio manager on certain multi-manager solutions offered by the firm, including Global Equities, International Equities, Hedged Equities, Japan Equities, and US Alpha strategies. Gregg is a member of a number of Wellington Managementâ\u0080\u0099s committees and oversight groups, including the Risk Management Committee, Fixed Income Risk Advisory Council, Equity Risk Advisory Council, Multi Asset Strategy Review Group, Equity Review Group II, New Product Working Group, and Philosophy and Process Panel, and represents Wellington Management as a member of the Buy Side Risk Managers Forum.\nPreviously, Gregg was an equity portfolio specialist and analyst at Wellington Management (2002 â\u0080\u0093 2006). Prior to rejoining the firm in 2002, he worked as a quantitative business analyst at Zurich Scudder Investments (2001), as a business analyst and data analyst in Wellington Managementâ\u0080\u0099s Information Services Group (1997 â\u0080\u0093 2001), and in various financial markets-related positions at IDD Information Services (1993 â\u0080\u0093 1997).\nGregg received his BS in finance, with high distinction, from the University of Rhode Island (1992). He holds the Chartered Financial Analyst designation.",
        "category": "Options-based",
        "family": "Delaware Funds by Macquarie",
        "exchange": "NAS",
        "market": "us_market"
    },
    "HMXAX": {
        "short_name": "AlphaCentric Premium Opportunit",
        "long_name": "AlphaCentric Premium Opportunity Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n Under normal circumstances, the fund invests primarily in (i) long and short futures and call and put options on futures on the S&P 500 Index, measures of market volatility, and/or securities that represent the return of the index (such as exchange traded funds like the SPDR Trust Series I units); (ii) cash and cash equivalents, including money market funds; and (iii) income securities of any maturity or credit quality, and investment companies that invest in such income securities (including affiliated and unaffiliated investment companies).",
        "manager_name": "Russell  Kellites",
        "manager_bio": "Russell Kellites has been a portfolio manager at AlphaCentric Advisors LLC since 2016 and has served as Managing Director of Theta Capital Partners since 2008. Prior to joining Theta Capital Partners, Mr. Kellitesâ\u0080\u0099 employment includes Goldman Sachs & Co where he was an Associate and Merrill Lynch & Co where he was a Vice President. Mr. Kellites attended Columbia University where he received a BS in computer science (cum laude), matriculated in the MS computer science program, with a focus in artificial intelligence, and received an MBA.",
        "category": "Options-based",
        "family": "AlphaCentric Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "HMXCX": {
        "short_name": "AlphaCentric Premium Opportunit",
        "long_name": "AlphaCentric Premium Opportunity Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n Under normal circumstances, the fund invests primarily in (i) long and short futures and call and put options on futures on the S&P 500 Index, measures of market volatility, and/or securities that represent the return of the index (such as exchange traded funds like the SPDR Trust Series I units); (ii) cash and cash equivalents, including money market funds; and (iii) income securities of any maturity or credit quality, and investment companies that invest in such income securities (including affiliated and unaffiliated investment companies).",
        "manager_name": "Russell  Kellites",
        "manager_bio": "Russell Kellites has been a portfolio manager at AlphaCentric Advisors LLC since 2016 and has served as Managing Director of Theta Capital Partners since 2008. Prior to joining Theta Capital Partners, Mr. Kellitesâ\u0080\u0099 employment includes Goldman Sachs & Co where he was an Associate and Merrill Lynch & Co where he was a Vice President. Mr. Kellites attended Columbia University where he received a BS in computer science (cum laude), matriculated in the MS computer science program, with a focus in artificial intelligence, and received an MBA.",
        "category": "Options-based",
        "family": "AlphaCentric Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "HRSAX": {
        "short_name": "Rational Tactical Return Fund C",
        "long_name": "Rational Tactical Return Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks total return consisting of long-term capital appreciation and income.\n The fund invests primarily in long and short call and put options on futures contracts on the Standard & Poor&#39;s 500 Index, and in cash, and cash equivalents. It achieves its investment objective in three ways: (1) Premium Collection - the fund collects premiums on options it sells; (2) Volatility Trading - the fund may enter into positions designed to hedge or profit from either an increase or a decrease in index volatility; and (3) Trend following - the fund may increase or decrease the balance of puts and calls based on trending market direction.",
        "manager_name": "Scott C. Kimple",
        "manager_bio": "Scott C. Kimple, is a Principal and Portfolio Manager of Warrington since its inception in 2008. Mr. Kimple also serves as the Portfolio Manager to private commodity pools sponsored by an affiliate of Warrington, as well as to separate commodity trading accounts. From 1991 to 2015, Mr. Kimple was employed by Morgan Stanley Smith Barney LLC and its predecessors (â\u0080\u009cMSSBâ\u0080\u009d) as a registered representative and was registered with the NFA as an Associated Person of MSSB. Mr. Kimple received a BBA in finance from Southern Methodist University and a MBA, with emphasis in Finance and Derivative Securities, from SMUâ\u0080\u0099s Cox School of Business.",
        "category": "Options-based",
        "family": "Rational Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "HRSTX": {
        "short_name": "Rational Tactical Return Fund I",
        "long_name": "Rational Tactical Return Fund Class Institutional",
        "currency": "USD",
        "summary": "The investment seeks total return consisting of long-term capital appreciation and income.\n The fund invests primarily in long and short call and put options on futures contracts on the Standard & Poor&#39;s 500 Index, and in cash, and cash equivalents. It achieves its investment objective in three ways: (1) Premium Collection - the fund collects premiums on options it sells; (2) Volatility Trading - the fund may enter into positions designed to hedge or profit from either an increase or a decrease in index volatility; and (3) Trend following - the fund may increase or decrease the balance of puts and calls based on trending market direction.",
        "manager_name": "Scott C. Kimple",
        "manager_bio": "Scott C. Kimple, is a Principal and Portfolio Manager of Warrington since its inception in 2008. Mr. Kimple also serves as the Portfolio Manager to private commodity pools sponsored by an affiliate of Warrington, as well as to separate commodity trading accounts. From 1991 to 2015, Mr. Kimple was employed by Morgan Stanley Smith Barney LLC and its predecessors (â\u0080\u009cMSSBâ\u0080\u009d) as a registered representative and was registered with the NFA as an Associated Person of MSSB. Mr. Kimple received a BBA in finance from Southern Methodist University and a MBA, with emphasis in Finance and Derivative Securities, from SMUâ\u0080\u0099s Cox School of Business.",
        "category": "Options-based",
        "family": "Rational Funds",
        "exchange": "NAS",
        "market": "us_market"
    },
    "JDAEX": {
        "short_name": "James Alpha Managed Risk Domest",
        "long_name": "James Alpha Managed Risk Domestic Equity Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation.\n The fund invests at least 80% of its net assets (plus any borrowings for investment purposes) in equity securities of U.S. issuers or investments that provide exposure to equity securities of U.S. issuers, and in derivatives and other instruments that have economic characteristics similar to such securities. It will seek to achieve its objective by combining a long equity strategy with an options hedging strategy that seeks to provide protection during significant equity market downturns.",
        "manager_name": "Edward  Boll",
        "manager_bio": "Edward Boll is the Founder, Chief Executive Officer, and Director of Portfolio Management of EAB Investment Group, LLC, prior to which he was the co-Founder of DC Trading Partners, LLC; a senior portfolio manager at Goldman Sachs SLK Hull Derivatives Group; and Founder of TFM Investment Group, New York Division.",
        "category": "Options-based",
        "family": "James Alpha Advisors",
        "exchange": "NAS",
        "market": "us_market"
    },
    "JEPRX": {
        "short_name": "JPMorgan Equity Premium Income ",
        "long_name": "JPMorgan Equity Premium Income Fund Class R6",
        "currency": "USD",
        "summary": "The investment seeks current income while maintaining prospects for capital appreciation.\n The fund seeks to provide the majority of the returns associated with its primary benchmark, the Standard & Poor&#39;s 500 Total Return Index (S&P 500 Index), while exposing investors to less risk through lower volatility and still offering incremental income. Under normal circumstances, it invests at least 80% of its assets in equity securities (80% Policy). In calculating the 80% Policy, the fund&#39;s equity investments will include common stocks and ELNs, as well as other equity securities.",
        "manager_name": "Hamilton  Reiner",
        "manager_bio": "Hamilton Reiner, a Managing Director of J.P. Morgan Investment Management, Inc., is responsible for implementing the Fundâ\u0080\u0099s overlay options strategy and for providing insight with respect to the impact to the options strategy of purchasing certain securities. Mr. Reiner has been the head of U.S. Equity Derivatives at JPMIM since 2012. He joined JPMorgan Chase in 2009 and from 2009 to 2012, he was a portfolio manager and head of U.S. Equity Derivatives at JPMorgan Chase. Prior to joining the firm, Mr. Reiner was head of the Equity Long/Short Prime Brokerage platform at Barclays Capital.",
        "category": "Options-based",
        "family": "JPMorgan",
        "exchange": "NAS",
        "market": "us_market"
    },
    "LQTIX": {
        "short_name": "Theta Income Fund Institutional",
        "long_name": "Theta Income Fund Institutional Class",
        "currency": "USD",
        "summary": "The investment seeks to generate current income with a low correlation to the risks and returns of major market indices.  Under normal market conditions, the fund seeks to achieve its investment objective by selling listed short-term put options to generate income to the fund while also purchasing intermediate-term put options for hedging purposes. It focuses primarily on equity index options which offer both European settlement (i.e., options can only be exercised at their expiration date) and cash settlement.",
        "manager_name": "Justin  Boller",
        "manager_bio": "",
        "category": "Options-based",
        "family": "LS",
        "exchange": "NAS",
        "market": "us_market"
    },
    "MAIPX": {
        "short_name": "MAI Managed Volatility Fund Ins",
        "long_name": "MAI Managed Volatility Fund Institutional Class",
        "currency": "USD",
        "summary": "The investment seeks income and long term capital appreciation.\n The fund will seek to achieve its investment objective principally by (1) investing in a diversified portfolio of equity securities, with a focus on those paying dividends, and (2) selling exchange listed options. The fund&#39;s investments in domestic equity securities are primarily in companies with large- and mid-sized market capitalizations. The Adviser&#39;s focus on large- and mid-cap total return-oriented stocks and a target equity weighting of 45-55% of total assets may limit the fund&#39;s ability to fully participate in sharply rising stock markets.",
        "manager_name": "Kurt D. Nye",
        "manager_bio": "Kurt D. Nye, CFA is a Managing Director of MAI Capital Management, LLC. Prior to joining the firm in 2011, Mr. Nye was an Investment Analyst with the Townsend Group where he provided portfolio modeling, investment due diligence, and analytical support to clients since 2010. Previously, Mr. Nye was a Senior Financial Analyst at Capital One where he focused on forecasting and analysis since 2008.",
        "category": "Options-based",
        "family": "MAI",
        "exchange": "NAS",
        "market": "us_market"
    },
    "NOVIX": {
        "short_name": "Glenmede International Secured ",
        "long_name": "Glenmede Global Secured Options Portfolio",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation and option premiums consistent with reasonable risk to principal.\n Under normal market circumstances, the Portfolio uses option writing strategies in an effort to obtain option premiums and reduce risk. At least 80% of the value of the fund&#39;s net assets (including borrowings for investment purposes) will be subject to secured option strategies, which are written covered call and/or secured put options.",
        "manager_name": "Sean  Heron",
        "manager_bio": "Sean E. Heron, CFA, is a Portfolio Manager, Options & Derivatives, for The Glenmede Trust Company, N.A. (GTC) and a Portfolio Manager for Glenmede Investment Management LP (GIM), an affiliate of GTC. Sean manages the secured options products and leads a team responsible for providing clients with options and some alternative strategies.\nMr. Heron began his career with Goldman Sachs. In 2003, he left the firm to help former Goldman Sachs Managing Director Thomas McGowan launch McGowan Investors, LP. \nMr. Heron graduated from LaSalle University with a B.A. in Finance and an M.B.A in Accounting. He received his Chartered Financial Analysts designationÂ® in 2004.\nMr. Heron is a board member of the CFA Society of Philadelphia and serves as an instructor for the CFA Exam and as an Adjunct Professor at Rutgers University.",
        "category": "Options-based",
        "family": "Glenmede",
        "exchange": "NAS",
        "market": "us_market"
    },
    "PPFAX": {
        "short_name": "Princeton Premium Fund - Class ",
        "long_name": "Princeton Premium Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation and income.\n The adviser utilize two principal investment strategies: a premium collection strategy involving sale or purchase of put options on the S&P 500 Index and investing in fixed income securities. The fund&#39;s adviser will determine the allocation between these strategies. The adviser intends to allocate between 30% to 100% of the fund&#39;s net assets to the premium collection strategy at any given time.",
        "manager_name": "Zachary  Slater",
        "manager_bio": "Mr. Slater joined Princeton Fund Advisors, LLC and its affiliates in 2011 to conduct and oversee research on new investment opportunities. His experience includes evaluating and monitoring traditional, alternative and private investment strategies. Additionally, he has experience transitioning strategies into different investment vehicles. Mr. Slater is responsible for sourcing new managers, conducting due diligence on potential managers and ongoing monitoring of current managers and investments. He holds a B.S. from the Daniels College of Business at the University of Denver.",
        "category": "Options-based",
        "family": "Princeton",
        "exchange": "NAS",
        "market": "us_market"
    },
    "PPFIX": {
        "short_name": "Princeton Premium Fund - Class ",
        "long_name": "Princeton Premium Fund Class I",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation and income.\n The adviser utilize two principal investment strategies: a premium collection strategy involving sale or purchase of put options on the S&P 500 Index and investing in fixed income securities. The fund&#39;s adviser will determine the allocation between these strategies. The adviser intends to allocate between 30% to 100% of the fund&#39;s net assets to the premium collection strategy at any given time.",
        "manager_name": "Zachary  Slater",
        "manager_bio": "Mr. Slater joined Princeton Fund Advisors, LLC and its affiliates in 2011 to conduct and oversee research on new investment opportunities. His experience includes evaluating and monitoring traditional, alternative and private investment strategies. Additionally, he has experience transitioning strategies into different investment vehicles. Mr. Slater is responsible for sourcing new managers, conducting due diligence on potential managers and ongoing monitoring of current managers and investments. He holds a B.S. from the Daniels College of Business at the University of Denver.",
        "category": "Options-based",
        "family": "Princeton",
        "exchange": "NAS",
        "market": "us_market"
    },
    "SDAYX": {
        "short_name": "Swan Defined Risk Growth Fund C",
        "long_name": "Swan Defined Risk Growth Fund Class Y Shares",
        "currency": "USD",
        "summary": "The investment seeks long term capital appreciation.\n The fund seeks to achieve its investment objective by investing directly, or indirectly in: capitalization-weighted U.S. large capitalization exchange-traded funds (\"ETFs\") that invest in equity securities that are represented in the S&P 500 Index, exchange-traded long-term put options on the S&P 500 Index for hedging purposes, and exchange-traded put and call options on various equity indices to generate additional returns.",
        "manager_name": "Randy  Swan",
        "manager_bio": "Randy Swan, President, is the founder of Swan Capital Management, LLC and Swan Global Management, LLC. Oversees the team that runs all of the firm's investment activities. Before starting the Sub-Adviser in 2014, the Adviser in 2012 and Swan Global Investments, LLC in 1997, Randy was a KPMG senior manager working in their Financial Services Group, primarily with insurance companies and risk managers. It was here where Randy conceived Swanâ\u0080\u0099s investment strategy of using the options market to manage portfolio risk, similar to how the insurance companies were managing their insurance portfolios.",
        "category": "Options-based",
        "family": "Swan",
        "exchange": "NAS",
        "market": "us_market"
    },
    "SDCAX": {
        "short_name": "Swan Defined Risk U.S. Small Ca",
        "long_name": "Swan Defined Risk U.S. Small Cap Fund Class A",
        "currency": "USD",
        "summary": "The investment seeks long term capital appreciation.\n The fund seeks to achieve its investment objective by investing directly, or indirectly through ETFs, in: equity securities of domestic small capitalization companies, exchange-traded long-term put options on U.S. exchanges for hedging purposes, and buying and selling exchange-traded put and call options on various ETFs, securities and equity indices to generate additional returns.",
        "manager_name": "Randy  Swan",
        "manager_bio": "Randy Swan, President, is the founder of Swan Capital Management, LLC and Swan Global Management, LLC. Oversees the team that runs all of the firm's investment activities. Before starting the Sub-Adviser in 2014, the Adviser in 2012 and Swan Global Investments, LLC in 1997, Randy was a KPMG senior manager working in their Financial Services Group, primarily with insurance companies and risk managers. It was here where Randy conceived Swanâ\u0080\u0099s investment strategy of using the options market to manage portfolio risk, similar to how the insurance companies were managing their insurance portfolios.",
        "category": "Options-based",
        "family": "Swan",
        "exchange": "NAS",
        "market": "us_market"
    },
    "SDFCX": {
        "short_name": "Swan Defined Risk Emerging Mark",
        "long_name": "Swan Defined Risk Emerging Markets Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks long term capital appreciation.\n The fund seeks to achieve its investment objective by investing directly, or indirectly through ETFs, in:foreign (including emerging markets) equity securities, including ADRs, of any market capitalization, exchange-traded long-term put options on U.S. exchanges for hedging purposes, and buying and selling exchange-traded put and call options on various ETFs and foreign equity indices to generate additional returns.",
        "manager_name": "Randy  Swan",
        "manager_bio": "Randy Swan, President, is the founder of Swan Capital Management, LLC and Swan Global Management, LLC. Oversees the team that runs all of the firm's investment activities. Before starting the Sub-Adviser in 2014, the Adviser in 2012 and Swan Global Investments, LLC in 1997, Randy was a KPMG senior manager working in their Financial Services Group, primarily with insurance companies and risk managers. It was here where Randy conceived Swanâ\u0080\u0099s investment strategy of using the options market to manage portfolio risk, similar to how the insurance companies were managing their insurance portfolios.",
        "category": "Options-based",
        "family": "Swan",
        "exchange": "NAS",
        "market": "us_market"
    },
    "SDRAX": {
        "short_name": "Swan Defined Risk Fund Class A",
        "long_name": "Swan Defined Risk Fund Class A Shares",
        "currency": "USD",
        "summary": "The investment seeks long term capital appreciation.\n The fund seeks to achieve its investment objective by investing directly, or indirectly through exchange traded funds (\"ETFs\"), in equity securities that are represented in the S&P 500 Index, exchange-traded long-term put options on the S&P 500 Index for hedging purposes, and buying and selling exchange-traded put and call options on various equity indices to generate additional returns.",
        "manager_name": "Randy  Swan",
        "manager_bio": "Randy Swan, President, is the founder of Swan Capital Management, LLC and Swan Global Management, LLC. Oversees the team that runs all of the firm's investment activities. Before starting the Sub-Adviser in 2014, the Adviser in 2012 and Swan Global Investments, LLC in 1997, Randy was a KPMG senior manager working in their Financial Services Group, primarily with insurance companies and risk managers. It was here where Randy conceived Swanâ\u0080\u0099s investment strategy of using the options market to manage portfolio risk, similar to how the insurance companies were managing their insurance portfolios.",
        "category": "Options-based",
        "family": "Swan",
        "exchange": "NAS",
        "market": "us_market"
    },
    "SLCPX": {
        "short_name": "Selective Premium Income Fund",
        "long_name": "Unified Series Trust - Selective Premium Income Fund",
        "currency": "USD",
        "summary": "The investment seeks generating income while protecting principal.\n The fund seeks to meet its objective primarily by engaging in covered call option transactions and cash covered put option transactions on \"Selective Companies.\" The adviser, uses its \"Selective Process\" to identify companies that the advisor believes (1) produce products or services for which there are few good substitutes, (2) have a durable competitive advantage, (3) are highly profitable, (4) have prudent debt levels, (5) have management that skillfully reinvests earnings, and (6) are led by outstanding individuals. It is non-diversified.",
        "manager_name": "Christopher J Devlin",
        "manager_bio": "Mr. Devlin, who holds the Chartered Financial Analyst (CFA) designation, is Chief Investment Officer of Selective Wealth Management, LLC and Portfolio Manager of the Selective Process strategy. Prior to forming the firm in 2012, Mr. Devlin managed the investment portfolio of Charis Equity in 2009 and 2010. Mr. Devlin earned Bachelorâ\u0080\u0099s degree in Engineering from Pennsylvania State University in 2007, and received a Masterâ\u0080\u0099s degree in Theology and Apologetics from Liberty University in 2012.",
        "category": "Options-based",
        "family": "Selective",
        "exchange": "NAS",
        "market": "us_market"
    }
}