{
    "0P00002C03.HK": {
        "short_name": "Hang Seng Investment Series Han",
        "long_name": "Hang Seng Investment Series Hang Seng Property Sector Flexipower A Acc",
        "currency": "HKD",
        "summary": "The Series is designed to offer a range of Funds, each with separate and distinct investment objective and policies. The current Funds and their investment objectives and policies are described in the Term Sheets for such Funds.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "Property - Indirect Asia",
        "family": "Hang Seng Investment Management Ltd",
        "exchange": "HKG",
        "market": "hk_market",
        "total_assets": null
    },
    "0P0000HLU8.F": {
        "short_name": "First Sentier Asian Property Se",
        "long_name": "First Sentier Asian Property Securities Fund Class A (Accumulation) EUR",
        "currency": "EUR",
        "summary": "The Fund aims to achieve an investment return from income and capital growth over the long-term (at least five years). The Fund invests at least 70% of its Net Asset Value in a broad selection of equity or equity-related securities issued by real estate investment trusts or companies that own, develop or manage real property across the Asian Region and which are listed, traded or dealt in on Regulated Markets in the Asian Region.",
        "manager_name": "Stephen  Hayes",
        "manager_bio": "Stephen Hayes is a Head of Global Property Securities for First State. In his role, Stephen is responsible for management of the Global Property Securities team, one of a number of First State investment teams. The team manages Domestic, Asian and Global Property Securities portfolios for a number of funds. Prior to re-joining First State in September 2012, Stephen was Managing Director at Perennial Real Estate Investments, where he worked for over six years. Before his time at Perennial, Stephen worked at First State Investments as Head of Property Securities. \nStephen holds a Bachelor of Commerce (Economics and Management) from the University of Wollongong and is a Fellow of the Financial Services Institute of Australia.",
        "category": "Property - Indirect Asia",
        "family": "First Sentier Investors (UK) Funds Ltd",
        "exchange": "FRA",
        "market": "dr_market",
        "total_assets": null
    },
    "0P00013O8H.F": {
        "short_name": "WI Immobilienaktien Asia Pacifi",
        "long_name": "WI Immobilienaktien Asia Pacific TX",
        "currency": "EUR",
        "summary": "N/A",
        "manager_name": "Jens  Pludra",
        "manager_bio": "",
        "category": "Property - Indirect Asia",
        "family": "Warburg Invest AG",
        "exchange": "FRA",
        "market": "dr_market",
        "total_assets": 111482080
    }
}