{
    "0P0000VQZ8.SZ": {
        "short_name": "BOCHK RMB Fixed Income Fund A",
        "long_name": "BOCHK RMB Fixed Income Fund A",
        "currency": "CNY",
        "summary": "\"BOCHK RMB Fixed Income Fund seeks to provide investors with long-term capital appreciation through investing in a portfolio primarily consisting of offshore RMB denominated and settled debt instruments which are issued or distributed outside mainland China. The Sub-Fund seeks to invest in RMB denominated and settled fixed-rate or floating-rate debt securities. \nThe Sub-Fund may also invest in other RMB denominated and settled deposits issued outside mainland China. \n\"",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "RMB Bond",
        "family": "BOCI-Prudential Asset Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "total_assets": 50394888
    },
    "0P00013K2C.HK": {
        "short_name": "HSBC Collective Investment Trus",
        "long_name": "HSBC Collective Investment Trust - HSBC All China Bond Fund AM2 HKD",
        "currency": "HKD",
        "summary": "The Sub-Fund aims to invest for total return (i.e. via both income and capital appreciation), through investments primarily in a portfolio of Chinese fixed income securities.\nThe Sub-Fund invests primarily in fixed income securities including:\nâ\u0080¢ offshore fixed income securities denominated in any currencies and issued outside of the PRC by the PRC government or Chinese companies;\nâ\u0080¢ offshore RMB denominated fixed income securities issued outside of the PRC by non-PRC entities;\nâ\u0080¢ onshore fixed income securities denominated in RMB, issued within the PRC and traded on the China Interbank Bond Market (â\u0080\u009cCIBMâ\u0080\u009d) through Bond Connect, the RQFII quota of the Investment Adviser and/or other means as may be permitted by the relevant regulations from time to time;\nâ\u0080¢ onshore exchange traded fixed income securities issued within the PRC and traded on the stock exchanges in the PRC through the RQFII quota of the Investment Adviser.",
        "manager_name": "Gregory Lok Hang Suen",
        "manager_bio": "Gregory Suen(Lok Hang Suen), Associate Director, Asian Fixed Income, has been working in the industry since 2000. Prior to joining HSBC in 2007, Mr. Suen worked as an investment manager at PCI Investment Management Limited. He holds a masterâ\u0080\u0099s degree from the University of Hong Kong, a bachelorâ\u0080\u0099s degree from the University of British Columbia (Canada). He is also a CFA charterholder and a Certified Public Accountant (CPA).",
        "category": "RMB Bond",
        "family": "HSBC Investment Funds (HK) Limited",
        "exchange": "HKG",
        "market": "hk_market",
        "total_assets": null
    },
    "0P000162UQ.TW": {
        "short_name": "SinoPac RMB Bond Fund TWD Acc",
        "long_name": "SinoPac RMB Bond Fund TWD Acc",
        "currency": "TWD",
        "summary": "n/a",
        "manager_name": "Ru Yu  Wu",
        "manager_bio": "",
        "category": "RMB Bond",
        "family": "SinoPac Securities Inv Trust Co., Ltd",
        "exchange": "TAI",
        "market": "tw_market",
        "total_assets": null
    },
    "0P000162UR.TW": {
        "short_name": "SinoPac RMB Bond Fund TWD Inc",
        "long_name": "SinoPac RMB Bond Fund TWD Inc",
        "currency": "TWD",
        "summary": "n/a",
        "manager_name": "Ru Yu  Wu",
        "manager_bio": "",
        "category": "RMB Bond",
        "family": "SinoPac Securities Inv Trust Co., Ltd",
        "exchange": "TAI",
        "market": "tw_market",
        "total_assets": null
    },
    "0P00016NF3.HK": {
        "short_name": "Fidelity FAP-RMB Bond S",
        "long_name": "Fidelity FAP-RMB Bond S",
        "currency": "HKD",
        "summary": "The fund is a feeder fund that invests in the RMB Bond Fund, a sub-fund of the Fidelity Global Investment Fund, (the â\u0080\u009cUnderlying Fundâ\u0080\u009d). The Underlying Fund aims to invest at least 70% of its net asset value in RMB denominated fixed income/debt securities issued or distributed outside mainland China and RMB deposits made outside mainland China (including but not limited to bonds, commercial papers, notes, certificates of deposits, and other deposits and money market instruments); and invest the remaining portion (i.e. up to 30%) of its net asset value in fixed income/debt securities and deposits that are denominated in currencies other than RMB, such as USD, HKD, Japanese Yen or Euro.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "RMB Bond",
        "family": "FIL Investment Management (HK) Ltd",
        "exchange": "HKG",
        "market": "hk_market",
        "total_assets": 46749428
    }
}