{
  "0P00000COD.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Allianz Global Investors GmbH",
    "long_name": "Allianz Rohstofffonds A EUR",
    "manager_bio": "",
    "manager_name": "Petra  Kühl",
    "market": "dr_market",
    "short_name": "Allianz Rohstofffonds A EUR",
    "summary": "The Fund aims to generate capital growth in the long term by mainly investing in natural resourcesrelated companies within the investment principles.\nThe Fund shall invest in equities, equity equivalent securities and participation certificates, that have been issued by companies whose sales and profits (according to the last annual report) are generated primarily by exploration, extraction or processing of natural resources.",
    "total_assets": 543087979.8046341
  },
  "0P00000DBW.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Amundi Deutschland GmbH",
    "long_name": "Amundi Aktien Rohstoffe A",
    "manager_bio": "",
    "manager_name": "Peter  Königbauer",
    "market": "dr_market",
    "short_name": "Amundi Aktien Rohstoffe A",
    "summary": "N/A",
    "total_assets": 87873351.98991394
  },
  "0P00000GAG.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "AXA Investment Managers Paris",
    "long_name": "AXA Or et Mati&#195;&#168;res Premi&#195;&#168;res C",
    "manager_bio": "",
    "manager_name": "Damien  Maisonniac",
    "market": "dr_market",
    "short_name": null,
    "summary": "L&#39;objectif de la SICAV est de chercher à répliquer la performance de l’indice composite de référence (2/3 l’indice FTSE World Precious Metals and Mining et 1/3 par l’indice FTSE World Oil, Gas and Coal), à la hausse comme à la baisse, diminuée des frais de fonctionnement et de gestion, des frais de transaction et de la fiscalité éventuelle applicable à la SICAV.\nLa SICAV aura pour objectif de maintenir l’écart de suivi entre l’évolution de sa valeur liquidative et l’évolution de l’indice à un niveau inférieur à 2% (ou de 10% de la volatilité de l’indice).",
    "total_assets": 165135189.8633728
  },
  "0P00000QRB.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Amundi Asset Management",
    "long_name": "LCL Actions Ressources Naturelles C",
    "manager_bio": "",
    "manager_name": "Stéphane  Soussan",
    "market": "dr_market",
    "short_name": "LCL Actions Ressources Naturell",
    "summary": "L&#39;objectif de gestion de l&#39;OPCVM est identique à celui de l&#39;OPCVM maître CPR Invest - Global Resources, à savoir :\nSurperformer (déduction faite des commissions applicables) l&#39;indicateur composite suivant : 1/3 indice Nyse Arca Gold Miners couvert en EUR, 1/3 indice MSCI World Energy (GICS Industry Group 1010) et 1/3 indice MSCI World Materials (GICS Industry Group 1510), libellé dans la devise de chaque catégorie d&#39;action concernée, à long terme (au moins 5 ans) en investissant dans des actions internationales principalement impliquées dans les activités liées à l&#39;énergie, à l&#39;or et les matériaux.\nLa performance sera celle de l&#39;OPCVM maître diminuée des frais de gestion propres au nourricier.",
    "total_assets": 24555619.263887405
  },
  "0P00000RP7.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Baring International Fund Mgrs (Ireland) Limited",
    "long_name": "Barings Global Umbrella Fund - Barings Global Resources Fund Class A EUR Inc",
    "manager_bio": "Duncan joined Barings in January 2014 as the Head of Global Resources. He is co-manager of the Barings Global Resources Fund. Duncan joined Barings from Martin Currie Investment Management where he was a lead Global Resources Portfolio Manager for nine years. Prior to this he worked at Merrill Lynch (now BoAML), Citigroup and Lehman Brothers as an equity research analyst, specialising in European energy companies. Before he worked in fund management, Duncan worked at Shell International, most latterly in the UK upstream business planning team, after starting his career as a finance graduate in management information for the Brent Oil Field. Duncan passed the CIMA exam in 1996 and holds a BA (Hons) in Economics from Nottingham University.",
    "manager_name": "Duncan  Goodwin",
    "market": "dr_market",
    "short_name": "Barings Global Umbrella Fund - ",
    "summary": "The investment objective of the Fund is to achieve long-term capital appreciation through investment in a diversified portfolio of the securities of Commodity Producers, being companies engaged in the extraction, production, processing and/or trading of commodities e.g. oil, gold, aluminium, coffee and sugar.",
    "total_assets": null
  },
  "0P00001AJ4.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "LBBW Asset Management Investment GmbH",
    "long_name": "LBBW Rohstoffe &amp; Ressourcen",
    "manager_bio": "",
    "manager_name": "Christoph  Schäfer",
    "market": "dr_market",
    "short_name": "LBBW Rohstoffe & Ressourcen",
    "summary": "The fund of funds mainly invests in equity funds. Within its investment limitations the fund invests in companies from the following sectors: raw materials, energy, consumer goods, food, supplier, pharmaceuticals, technology, engineering and industrial goods.",
    "total_assets": 34545196.12168503
  },
  "0P000080QV.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Agora Investments SGR Spa",
    "long_name": "Agora Materials R",
    "manager_bio": "",
    "manager_name": "Daniele  Demartis",
    "market": "dr_market",
    "short_name": "Agora Materials R",
    "summary": "Il Fondo si indirizza verso strumenti rappresentativi del capitale di rischio di società operanti in Paesi produttori di materie prime, senza vincoli predeterminati rispetto alla valuta di denominazione.",
    "total_assets": 4459611.0116631985
  },
  "0P00009PR9.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Amundi Asset Management",
    "long_name": "Amundi Actions Minergior PC",
    "manager_bio": "",
    "manager_name": "Arnaud  du Plessis",
    "market": "dr_market",
    "short_name": "Amundi Actions Minergior PC",
    "summary": "L&#39;objectif de gestion de l&#39;OPC AMUNDI ACTIONS MINERGIOR est identique à celui de l&#39;OPC maître CPR Invest - Global Resources, à savoir :\nl&#39;objectif du Compartiment est de surperformer (après frais applicables), sur le long terme (cinq ans minimum) et en investissant dans des actions internationales dont l&#39;activité principale est liée à l&#39;énergie, l&#39;or et les matériaux, un indicateur de référence dont la structure est la suivante : 1/3 indice Nyse Arca Gold Miners, 1/3 indice MSCI World Energy (GICS Industry Group 1010) et 1/3 indice MSCI World Materials (GICS Industry Group 1510).\nLa performance d&#39;AMUNDI ACTIONS MINERGIOR sera celle de l&#39;OPCVM maître diminuée des frais de gestion propres au nourricier.",
    "total_assets": 136897891.14403725
  },
  "0P0000JYFR.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Fideuram Investimenti SGR SPA",
    "long_name": "Fideuram Master Selection Equity Global Resources",
    "manager_bio": "",
    "manager_name": "Antonio  Peruggini",
    "market": "dr_market",
    "short_name": "Fideuram Master Selection Equit",
    "summary": "Principalmente parti di OICVM azionari, denominati in euro e dollari USA, che investono in azionari dei settori energy e materials di emittenti quotati nei mercati delle aree geografiche di riferimento e in strumenti finanziari derivati sulle materie prime collegati al tema delle risorse del pianeta, promossi o gestiti oltre che da terzi anche da Società rientranti nel Gruppo di appartenenza della SGR; rispetto al totale dell’attivo il controvalore dell’investimento in OICR collegati sarà contenuto. Una quota del totale delle attività del Comparto potrà essere, inoltre, investita in strumenti finanziari del mercato monetario quotati e in depositi bancari.",
    "total_assets": 6854770.199089527
  },
  "0P0000P1BW.TW": {
    "category": "Sector Equity Natural Resources",
    "currency": "TWD",
    "exchange": "TAI",
    "family": "Franklin Templeton Sinoam Sec Inv Mgmt",
    "long_name": "Franklin Templeton SinoAm Natural Res Eq",
    "manager_bio": "第一富蘭克林投信 投資研究部 資深分析師 91.10.21 － 迄今\n玉山投信 投資部 專員 90.10.02 － 91.09.30",
    "manager_name": "Senguei  Jheng",
    "market": "tw_market",
    "short_name": "Franklin Templeton SinoAm Natur",
    "summary": "N/A",
    "total_assets": 16021515.893268585
  },
  "0P0000T48S.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Allianz Global Investors GmbH",
    "long_name": "Allianz Rohstofffonds P EUR",
    "manager_bio": "",
    "manager_name": "Petra  Kühl",
    "market": "dr_market",
    "short_name": "Allianz Rohstofffonds P EUR",
    "summary": "The Fund aims to generate capital growth in the long term by mainly investing in natural resourcesrelated companies within the investment principles.\nThe Fund shall invest in equities, equity equivalent securities and participation certificates, that have been issued by companies whose sales and profits (according to the last annual report) are generated primarily by exploration, extraction or processing of natural resources.",
    "total_assets": 543087979.8046341
  },
  "0P000163GK.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Amundi Asset Management",
    "long_name": "Amundi Actions Ressources Naturelles P-C",
    "manager_bio": "",
    "manager_name": "Stéphane  Soussan",
    "market": "dr_market",
    "short_name": "Amundi Actions Ressources Natur",
    "summary": "L’objectif de gestion est , sur un horizon de placement de 5 ans, de réaliser une performance supérieur à son indice composé pour 50% de l’indice MSCI WORLD ENERGY et pour 50% de l&#39;indice MSCI WORLD MATERIALS (dividendes réinvestis), indices représentatifs des secteurs de l&#39;énergie et des matériaux, après prise en compte des frais courants.",
    "total_assets": 456141.4777984619
  },
  "0P00018OEH.F": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "FRA",
    "family": "Financière de la Cité",
    "long_name": null,
    "manager_bio": "",
    "manager_name": "Bruno  Demontrond",
    "market": "dr_market",
    "short_name": "FDC Ressources Naturelles",
    "summary": "L&#39;objectif de gestion est d&#39;obtenir, sur la durée de placement recommandée, une performance supérieure à celle de l’indice S&P Global Natural Resources Total Return Index (calculé dividendes réinvestis) exprimé en EUR.",
    "total_assets": 4320513.462760448
  },
  "0P0001AOZM.L": {
    "category": "Sector Equity Natural Resources",
    "currency": "GBp",
    "exchange": "LSE",
    "family": "T. Rowe Price UK Limited",
    "long_name": "T. Rowe Price Funds OEIC Global Natural Resources Equity Fund C 9 GBP",
    "manager_bio": "Shawn Driscoll is a vice president of T. Rowe Price Group, Inc. and T. Rowe Price Associates, Inc. Mr. Driscoll has been chairman of the committee since 2013. He joined the Firm in 2006 and his investment experience dates from 2003. He has served as a portfolio manager with the Firm throughout the past five years. Prior to joining the T. Rowe Price in 2006, he was employed by MTB Investment Advisors as an equity research analyst. Shawn was also employed by MPower Communications as an information technology project manager. He earned a BA in economics and mathematics from the University of Rochester and an MBA in finance and global business from New York University, Leonard N. Stern School of Business.",
    "manager_name": "Shawn T. Driscoll",
    "market": "gb_market",
    "short_name": "T. Rowe Price Funds OEIC Global",
    "summary": "To increase the value of its shares, over the long term, through growth in the value of its investments. The fund invests mainly in a widely diversified portfolio of stocks of natural resources or commodities-related companies. The companies may be anywhere in the world, including emerging markets. The fund may use derivatives for hedging and efficient portfolio management.",
    "total_assets": null
  },
  "AT0000A01VR3.VI": {
    "category": "Sector Equity Natural Resources",
    "currency": "EUR",
    "exchange": "VIE",
    "family": "Erste Asset Management GmbH",
    "long_name": "ESPA Stock Commodities EUR R01 A",
    "manager_bio": "",
    "manager_name": "Bernhard  Ruttenstorfer",
    "market": "at_market",
    "short_name": "ERSTE STOCK COMMODITIES EUR R01",
    "summary": "ESPA STOCK COMMODITIES invests in approximately 120 companies in the global commodities sector, which are selected based on fundamental, quantitative and technical stock analysis. The funds focus is on equities within the segments energy, metals and basic materials. FX-risk is usually not hedged.",
    "total_assets": null
  }
}
