{
    "0P00006FYV.SI": {
        "short_name": "LionGlobal Short Duration Bond ",
        "long_name": "LionGlobal Short Duration Bond Fund Class A (SGD) (Dist)",
        "currency": "SGD",
        "summary": "The investment objective of the Fund is to provide total return of capital growth and income over the medium to long term, through an actively managed portfolio of Singapore and international bonds, high quality interest rate securities, real\nestate investment trusts (â\u0080\u009cREITsâ\u0080\u009d), business trusts and other related securities.",
        "manager_name": "Chiong-Tuck  Phoon",
        "manager_bio": "",
        "category": "SGD Bond",
        "family": "Lion Global Investors Ltd",
        "exchange": "SES",
        "market": "sg_market"
    },
    "0P00006HYG.SI": {
        "short_name": "United Singapore Bond Fund",
        "long_name": "UOB United Global Portfolios - United Singapore Bond Fund",
        "currency": "SGD",
        "summary": "The investment objective of the Sub-Fund is to maximise returns over the longer term by investing mainly in bonds denominated in Singapore Dollars (issued by entities incorporated or domiciled globally) and bonds denominated in foreign currencies (issued by entities incorporated or domiciled in Singapore). Apart from investments in bonds, the Sub-Fund may also invest in money market instruments (denominated in SGD or foreign currencies), bond funds (including funds managed by the Managers) and time deposits in any currency. Investments shall be made in accordance with the CPF Investment Guidelines. There is no target industry or sector.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "SGD Bond",
        "family": "UOB Asset Management Ltd",
        "exchange": "SES",
        "market": "sg_market"
    },
    "0P00006HYS.SI": {
        "short_name": "United SGD Fund - Class A SGD A",
        "long_name": "UOB United SGD Fund Class A SGD Acc",
        "currency": "SGD",
        "summary": "The investment focus of the Fund is to invest substantially all its assets in money market and short term interest bearing debt instruments and bank deposits with the objective of achieving a yield enhancement over Singapore dollar deposits.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "SGD Bond",
        "family": "UOB Asset Management Ltd",
        "exchange": "SES",
        "market": "sg_market"
    },
    "0P00006O9V.SI": {
        "short_name": "Nikko AM Shenton Horizon Singap",
        "long_name": "Nikko AM Shenton Horizon Singapore Fixed Income Enhanced Fund - SGD Class",
        "currency": "SGD",
        "summary": "The Horizon Singapore Fixed Income Enhanced Fund aims to provide income and capital growth by investing primarily in money market and fixed income instruments in Singapore.",
        "manager_name": "Desmond  Soon",
        "manager_bio": ". Mr. Soon has been employed by Western Asset since 2012. Prior to joining Western Asset, Mr. Soon was VP, Portfolio Management at ST Asset Management from 2011 to 2012. Prior to joining ST Asset Management, Mr. Soon was Asia Fixed Income Analyst and Portfolio Manager at AMP Capital Investors beginning in 2011. Prior to joining AMP Capital Investors, Mr. Soon was Head, Fixed Income & Currency at DBS Asset Management from 2008 to 2010. Prior to joining DBS Asset Management, Mr. Soon was Investment Manager, Pacific Asset Management from 1996 to 2008.",
        "category": "SGD Bond",
        "family": "Nikko Asset Management Asia Limited",
        "exchange": "SES",
        "market": "sg_market"
    },
    "0P00006OH3.SI": {
        "short_name": "LionGlobal Singapore Fixed Inco",
        "long_name": "LionGlobal Singapore Fixed Income Investment A",
        "currency": "SGD",
        "summary": "The fund aims to achieve steady returns over time by investing primarily in bonds and other debt securities denominated in Singapore Dollars. In addition, the Fund may also invest in bonds and other debt securities in currencies other than the Singapore Dollar.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "SGD Bond",
        "family": "Lion Global Investors Ltd",
        "exchange": "SES",
        "market": "sg_market"
    }
}