{
  "0P00006FY5.SI": {
    "category": "Singapore Equity",
    "currency": "SGD",
    "exchange": "SES",
    "family": "Nikko Asset Management Asia Limited",
    "long_name": "Nikko AM Shenton Thrift Fund",
    "manager_bio": "Kam Yoke Meng joined DBSAM in December 2007 as Head of Asian Equities.\nHe has 16 years of fund management experience in OCBC Asset Management and Lion Capital\nYoke Meng graduated from the National University of Singapore with an Honours Degree in\nAccountancy. He is also a Chartered Financial Analyst.",
    "manager_name": "Yoke Meng Kam",
    "market": "sg_market",
    "short_name": "Nikko AM Shenton Thrift Fund",
    "summary": "The investment objective of the Fund is to maximize medium to long term capital appreciation by investing primarily in stocks listed on the Singapore Exchange Securities Trading Limited (\"SGX-ST\"). The Fund may also invest in companies listed on stock exchanges outside Singapore subject to a limit not exceeding 30% of the total value of the Deposited Property or such other amount as agreed from time to time between the Managers and the Trustee. The Fund invests in Singapore and Asia Pacific countries.",
    "total_assets": 57979364.86110592
  },
  "0P00006O9U.SI": {
    "category": "Singapore Equity",
    "currency": "SGD",
    "exchange": "SES",
    "family": "Nikko Asset Management Asia Limited",
    "long_name": "Nikko AM Shenton Singapore Dividend Equity Fund - SGD Class",
    "manager_bio": "",
    "manager_name": "Lai  Huan",
    "market": "sg_market",
    "short_name": "Nikko AM Shenton Singapore Divi",
    "summary": "The investment objective of the Fund is to achieve medium to long term capital appreciation. The Fund invests primarily in equities listed on the Singapore Exchange Securities Trading Limited that offer attractive and sustainable dividend payments and may also invest in equities listed outside of Singapore offering attractive and sustainable dividend payments.",
    "total_assets": null
  },
  "0P0001666N.SI": {
    "category": "Singapore Equity",
    "currency": "SGD",
    "exchange": "SES",
    "family": "Lion Global Investors Ltd",
    "long_name": "LionGlobal Singapore Dividend Equity Fund SGD Class",
    "manager_bio": "Name: Lim Fang Suan, CFA Designation: Director, Asian Equities, Years of experience: 23",
    "manager_name": "Fang Suan  Lim",
    "market": "sg_market",
    "short_name": "LionGlobal Singapore Dividend E",
    "summary": null,
    "total_assets": null
  }
}
