{
    "0P00006HY8.SI": {
        "short_name": "GrowthPath 2030",
        "long_name": "UOB GrowthPath Portfolios - UOB GrowthPath 2030 Fund",
        "currency": "SGD",
        "summary": "The objective of GrowthPath 2030 is to provide long-term capital appreciation for investors planning to begin to withdraw substantial portions of their investment approximately in the year 2030.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "Target Date 2026 - 2030",
        "family": "UOB Asset Management Ltd",
        "exchange": "SES",
        "market": "sg_market"
    },
    "0P000151GE.L": {
        "short_name": "Liontrust MA BirthStar® Target",
        "long_name": "Liontrust MA BirthStar Target Date 2026-30 Class R Accumulation",
        "currency": "GBp",
        "summary": "The Fund seeks to achieve capital growth and, gradually over time, to reduce the risk of capital erosion for investors planning to withdraw all or substantial portions of their investment in the Fund during or after the Target Date Range (which is 2026-30). The Fundâ\u0080\u0099s strategic asset allocation will alter over time, gradually reducing expected volatility on approach to the target date range and thereafter. The Fund also deploys a tactical asset allocation process that seeks to manage portfolio risk in the short term, mitigating the effect of extremes in the market. The ACDâ\u0080\u0099s and/or the Investment Adviserâ\u0080\u0099s assessment of the growth and volatility prospects of various assets classes may vary over time. Collective investment schemes are selected on the basis of their efficiency at tracking the performance of their reference investment indices.",
        "manager_name": "Sheldon  MacDonald",
        "manager_bio": "Sheldon joined Liontrust in Nov 2020. Previously he worked at Architas where he managed the Multi-Asset Blended Fund range. He oversaw fund selection and managed the products' asset allocation and investment strategies. He also lead the fund manager research across a number of sectors, including multi-asset and money market strategies. Before joining Architas in 2010, Sheldon was a fund of funds manager at Nedgroup Investments, part of Old Mutual Plc. As well as running a variety of long only multi-asset strategies, Sheldon has extensive experience in the hedge fund space and, prior to joining Nedgroup Investments, was Head of Derivative Trading at Old Mutual Asset Managers in South Africa. Sheldon has a BComm in Financial Accounting and Economics and holds the IMC. He has 22 years of investment experience.",
        "category": "Target Date 2026 - 2030",
        "family": "Liontrust Multi-Asset Limited",
        "exchange": "LSE",
        "market": "gb_market"
    },
    "0P0001CQCX.L": {
        "short_name": "BlackRock ACS LifePath 2025-202",
        "long_name": "BlackRock ACS LifePath 2025-2027 X1 GBP Accmulating",
        "currency": "GBp",
        "summary": "The fund is a target date retirement fund. The Fundâ\u0080\u0099s objective is to provide a total return with an asset allocation that\nchanges over time.",
        "manager_name": "",
        "manager_bio": "",
        "category": "Target Date 2026 - 2030",
        "family": "BlackRock Fund Managers Limited",
        "exchange": "LSE",
        "market": "gb_market"
    }
}