{"0P0000W48V.L": {"short_name": "Merian North American Equity Fu", "long_name": "Merian North American Equity Fund R GBP Acc", "currency": "GBp", "summary": "To seek to achieve capital growth by delivering a return, net of fees, greater than that of the MSCI North America Index with net dividends reinvested over rolling 3 year periods. The fund primarily invests (at least 70%) in a diversified portfolio of North American equities. North American equities are those of companies that are domiciled, incorporated or listed in North America, or that conduct a significant part of their business in North America.", "manager_name": "Ian  Heslop", "manager_bio": "Ian joined Merian in 2000 and is head of global equities. He manages a range of hedge and retail funds and segregated mandates, including market neutral and long only funds. Ian boasts more than 20 years of investment experience and the team has won numerous awards for its funds. Prior to joining the business, Ian was a UK quantitative fund manager at Barclays Global Investors. He holds an MA in chemistry from the University of Oxford and a PhD in medicinal chemistry, University of Edinburgh. He is an associate of the Society of Investment Professionals.", "category": "US Flex-Cap Equity", "family": "Merian Investment Management Limited", "exchange": "LSE", "market": "gb_market"}, "0P0000YBXF.L": {"short_name": "GAM North American Growth Instl", "long_name": "GAM North American Growth Instl GBP Acc", "currency": "GBp", "summary": "The objective of the Fund is to provide capital appreciation, primarily through investment in quoted securities in the USA and Canada. \nThe Fund is aimed at investors who see it as a convenient way of investing for growth over the medium to long term, and with less risk than investing directly in only a small number of USA and Canadian companies. It is a fund focusing on USA and Canadian markets, and may therefore be appropriate as part of a broader, global portfolio. It will be the policy of the Fund to invest at least 51 per cent. of its total assets in shares and other equity securities and equity rights. The remaining part (up to a maximum of 49 per cent. of the total assets of the Fund) may be invested in bonds and other debt securities and debt rights.", "manager_name": "Gordon  Grender", "manager_bio": "Grender has been associated with Global Asset Management since 1983 . Currently, he serves as director of GAM International Management Limited. Prior to joining GAM, he was with Kitcat and Aitken, London. He has been actively involved in fund management in North American stock markets since 1974.", "category": "US Flex-Cap Equity", "family": "GAM Sterling Management Limited", "exchange": "LSE", "market": "gb_market"}, "0P000160C7.L": {"short_name": "Findlay Park American GBP Unhed", "long_name": "Findlay Park American GBP Unhedged", "currency": "GBp", "summary": "The investment objective of the Fund is to achieve capital growth over the long term principally through investment in the securities of companies in the Americas. The Fund aims to achieve a return, over the long term, above the return of the Russell 1000 Net 30% Total Return Index. The Russell 1000 Net 30% Total Return Index has been chosen as the comparator benchmark because it includes a broad universe of US equities which is representative of the US equity market.", "manager_name": "James  Findlay", "manager_bio": "", "category": "US Flex-Cap Equity", "family": "Findlay Park Partners LLP", "exchange": "LSE", "market": "gb_market"}}