{"0P000070KP.TO": {"short_name": "CDSPI petite cap États-Unis (T", "long_name": "CDSPI US Small Cap (Trimark)", "currency": "CAD", "summary": "The Fund&#39;s investment objective is to provide strong capital growth over the long term. The Fund invests primarily in equities of American companies.", "manager_name": "Robert  Mikalachki", "manager_bio": "Rob is Head of Small-Cap Equities for Trimark Investments, based in Toronto.\n\nRob hails from London, Ontario. He began his career as an analyst at The Loyalty Group. He then worked as a senior associate in the investment banking division of PricewaterhouseCoopers before joining the company in 1999 as a small-caps investment analyst. Rob became a portfolio manager in 2000. He earned a BBA from Wilfrid Laurier University, and he holds the Chartered Financial Analyst designation.", "category": "US Small/Mid Cap Equity", "family": "CDSPI", "exchange": "TOR", "market": "ca_market"}, "0P00007146.TO": {"short_name": "GBC croissance américain", "long_name": "Pembroke American Growth Fund Inc.", "currency": "CAD", "summary": "To provide long-term growth through capital appreciation by investing primarily in smaller U.S. companies that is judged to have above-average growth potential or to be undervalued.", "manager_name": "Ian  Soutar", "manager_bio": "Mr. Aitken is currently the Managing Partner with Pembroke Management Ltd, overseeing all aspects of the firm's operations, including portfolio management, client services, business development, regulatory compliance, personnel and planning. He is also involved in a number of other not-for-profit organizations including The John Dobson Foundation, Martlet Research Trust and the St. Andrew's Society of Montreal.", "category": "US Small/Mid Cap Equity", "family": "Pembroke Private Wealth Management", "exchange": "TOR", "market": "ca_market"}, "0P0000V5KK.TO": {"short_name": "Mackenzie Cat Croiss moy cap am", "long_name": "Mackenzie US Mid Cap Growth Class - LB", "currency": "CAD", "summary": "The Fund seeks long-term growth of capital and a reasonable rate of return by investing primarily in U.S. equity securities. The Fund may also invest from time to time in equity securities of companies based outside of North America and in fixed income securities of U.S. and Canadian corporations and government bodies.", "manager_name": "Philip  Taller", "manager_bio": "Phil Taller, Senior Vice President, Investment Management, is the Head of the Mackenzie Growth Team. Philâ\u0080\u0099s area of expertise is U.S. mid-cap stocks. Phil's career in the investment industry began in 1991 as a Research Associate. Starting in 1995, Phil was at a leading Canadian mutual fund company as a Portfolio Manager on the Canadian equities team. His focus was on bottom-up company analysis.\nPhil has a Bachelorâ\u0080\u0099s degree from the University of Waterloo, an MBA from the Schulich School of Business at York University, and is a CFA charterholder.", "category": "US Small/Mid Cap Equity", "family": "Mackenzie Investments", "exchange": "TOR", "market": "ca_market"}}