{
    "0P00006O9J.SI": {
        "short_name": "Nikko AM Shenton Eight Portfoli",
        "long_name": "Nikko AM Shenton Eight Portfolio C",
        "currency": "SGD",
        "summary": "The investment objective of the fund is to achieve medium to long-term capital appreciation. The fund aims to achieve its objective by using a multi-manager approach to invest in global bonds and equities through investments in other schemes and seek portfolio diversification across geographical regions, sectors and industries. The investment focus of the Eight Portfolio C is to invest the assets of the Fund in one or more mutual fund(s) and unit trust(s) reflecting an underlying investment in equities and bonds in the proportion of approximately 60:40 respectively.",
        "manager_name": "Not  Disclosed",
        "manager_bio": "",
        "category": "USD Moderate Allocation",
        "family": "Nikko Asset Management Asia Limited",
        "exchange": "SES",
        "market": "sg_market"
    },
    "0P0001247P.L": {
        "short_name": "Prescient Global Funds PLC - 27",
        "long_name": "Prescient Global Funds PLC - 27four Global Balanced Fund of Funds Class B",
        "currency": "GBp",
        "summary": "The investment objective of the Fund is to generate excess returns above its Benchmark by strategically allocating assets across asset classes, investment themes, regions, countries, sectors and currencies through expert asset allocation, fund selection and portfolio construction processes.",
        "manager_name": "Fatima  Vawda",
        "manager_bio": "Over 12 years experience in the design of financial products and services;\nGraduated with distinction from Wits University in 1994;\n\n1995 - 1997: lectured in applied mathematics in the Department of Computational and Applied Mathematics at Wits University;\n\n1997 - 1999: joined Standard Corporate & Merchant Bank as an interest rate derivatives trader;\n\n2000 - 2003: worked for Peregrine Securities as a research/sales trader focused on hedge fund trading strategies;\n\n2003: founded Legae Capital, the first black owned and woman-managed fund of hedge funds in South Africa. Under Fatima, Legae Capital became one of SA's leading hedge fund multi-managers;\n\n2006: awarded the Financial Services Pioneer Award by ABSIP (Association for Black Securities and Investment Professionals), previously given to Tito Mboweni and Vuyani Ngalwana;\n\n2006: voted one of SA's top 20 black fund manager executives by the Financial Mail; In 2006 the portfolio of hedge funds managed by Fatima and her team at the time won the Top performing Fund of Hedge Fund award from Hedge Fund Intelligence.\n\n2007: founded 27four Investment Managers, South Africa's first black owned and women run institutional multi-manager.",
        "category": "USD Moderate Allocation",
        "family": "Prescient Fund Services (Ireland) Limited",
        "exchange": "LSE",
        "market": "gb_market"
    }
}