{
    "NVXCX": {
        "short_name": "Navigator Sentry Managed Volati",
        "long_name": "Navigator Sentry Managed Volatility Fund Class C",
        "currency": "USD",
        "summary": "The investment seeks negative correlation to the U.S. equity markets, including positive returns in unfavorable equity markets.\n The fund generally seeks negative correlation to the U.S. equity markets, in order to obtain positive returns in an unfavorable equity market. It may invest in options on securities and stock indexes (including index put-options), swaps, futures, structured notes, underlying funds including hedge funds, closed end funds, exchange traded funds (\"ETFs\") and other mutual funds (collectively, \"underlying funds\").",
        "manager_name": "K. Sean Clark",
        "manager_bio": "As Clark Capitalâ\u0080\u0099s Chief Investment Officer, Sean oversees all of the Firmâ\u0080\u0099s investment activities and heads the firmâ\u0080\u0099s portfolio team. Sean joined the firm in 1993 and is responsible for asset allocation and investment selection for Navigator Investment Solutions as well as directing ongoing market research and contributing to the development of proprietary products. Sean is a member of the Clark Capital Investment Team and the Executive Team. He graduated from the University of Delaware, earning a B.S. and an M.A. in Economics. Sean holds the Chartered Financial AnalystÂ® designation and is a member of the CFA Institute (formerly AIMR) and the Financial Analysts of Philadelphia, Inc. Sean is considered an industry expert and is often asked to appear on CNBC and Bloomberg television to share his views on the market. In addition, Sean has been featured in a number of articles in nationally distributed business journals and newspapers.\n\nCFAÂ® and Chartered Financial AnalystÂ® are registered trademarks owned by CFA Institute.",
        "category": "Volatility",
        "family": "Navigator Funds",
        "exchange": "NAS",
        "market": "us_market",
        "total_assets": 9084347
    }
}