{
    "HLPN.F": {
        "short_name": "HELLENIC PETR. NAM.EO2,18",
        "long_name": "Hellenic Petroleum S.A.",
        "summary": "Hellenic Petroleum S.A., together with its subsidiaries, operates in the energy sector primarily in Greece, South Eastern Europe, and the East Mediterranean. It operates through the Refining, Marketing, Exploration and Production of Hydrocarbons, Petro-chemicals, Gas and Power, and Other segments. The company engages in the refining, supply, and trading of petroleum products; marketing of fuels; production and trading of petrochemicals/chemicals; exploration and production of oil and gas; and generation and trading of power. It is also involved in the production, distribution, and trading of renewable energy sources; provision of financing and other financial services; retail trade of liquid fuels and LPG; operation of tankers; exploration and production of hydrocarbons; trade, distribution, and storage of oil products; and construction and operation of crude oil pipelines. In addition, the company engages in the owning of vessels; production and marketing of lubricants, polypropylene, and solvents; trading of imported plastics and chemicals; production and trade of BOPP films; construction and operation of fuel storage facilities; and provision of treasury, consulting, and engineering services. It operates a network of 1,703 service stations, 15 fuel storage and distribution facilities, 24 aircraft refueling stations in the Greek airports, 2 LPG bottling plants, and 1 lubricant production and packing site in Greece. Hellenic Petroleum S.A. was founded in 1998 and is headquartered in Maroussi, Greece.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Integrated",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Greece",
        "state": null,
        "city": "Marousi",
        "zipcode": "151 25",
        "website": "http://www.helpe.gr",
        "market_cap": 2003963136
    }
}