{
    "0C2.F": {
        "short_name": "CHUBU EL. PWR",
        "long_name": "Chubu Electric Power Company, Incorporated",
        "summary": "Chubu Electric Power Company, Incorporated, together with its subsidiaries, engages in the generation, transmission, distribution, and retail of electricity in Japan and internationally. The company operates through three segments: JERA, Power Network, and Customer Service & Sales. It generates electricity through thermal, nuclear, hydroelectric, wind, biomass, and solar sources. The company is also involved in the fuel upstream, power generation procurement, and wholesale of electricity and gas businesses; and provides power network services. In addition, it engages in the construction for the development and maintenance of electric utilities-related facilities; and manufacture of materials and machinery for electric utilities-related facilities. Further, the company is involved in the gas supply, on-site energy, consulting and investment, real estate management, IT businesses, etc. Chubu Electric Power Company, Incorporated was founded in 1951 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "1KS.F": {
        "short_name": "SHIZUOKA GAS CO. LTD.",
        "long_name": "Shizuoka Gas Co., Ltd.",
        "summary": "Shizuoka Gas Co., Ltd. produces, supplies, and sells city gas in Japan. The company also sells gas appliances; and undertakes contracts for gas related construction works. As of December 31, 2018, it served approximately 319,591 customers through a gas pipeline network of 4,425 km. The company was founded in 1910 and is headquartered in Shizuoka, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Shizuoka"
    },
    "2CJ.F": {
        "short_name": "KYUSHU EL. PWR",
        "long_name": "Kyushu Electric Power Company, Incorporated",
        "summary": "Kyushu Electric Power Company, Incorporated engages in the electric power business in Japan and internationally. The company operates through Domestic Electric Power, Other Energy Service, ICT Service, and Other segments. It generates electricity from nuclear, thermal, hydroelectric, geothermal, internal combustion, wind, solar, poultry dung fuel, and biomass power energy sources. The company also receipts, stores, vaporizes, delivers, and sells liquefied natural gas (LNG); purchases, operates, charters, and rents LNG carriers; manufactures and sells electric machinery, concrete poles, HV and LV insulators, and other products; and constructs, maintains, and repairs power generation facilities, as well as nursing home business. In addition, it engages in the heat supply activities; installation, maintenance, and management of electrical measurement equipment; environmental preservation work; consultation, planning, investigation, measurement, design, drafting, and care of civil engineering/construction projects; IT-related planning and consultation, and data center business; and provision of air cargo transportation, site management, and energy efficiency consultancy services. Further, the company offers telecommunication devices, and fiber-optic cable and broadband services; provides elderly nursing home management and nursing, temporary staffing, and job-placement services; develops, operates, and maintains information systems; develops and sells computer software; leases, manages, cleans, and maintains real estate properties; acquires and owns securities; and recycles used confidential documents. Additionally, it is involved in the clerical work acceptance on trust and consulting business; flame spray coating; investment activities; management of golf courses; subtitle production for broadcasting; and ownership of mining interests and assets. The company was founded in 1951 and is headquartered in Fukuoka City, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "3361.T": {
        "short_name": "TOELL CO.LTD",
        "long_name": "Toell Co.,Ltd.",
        "summary": "Toell Co.,Ltd. engages in the production, wholesale, and retail of liquefied petroleum gas in Japan and internationally. The company is involved in LPG container re-inspection, gas piping facility construction, simple gas, LPG consuming destination installation, other LPG related equipment, home service, general freight car transportation, warehouse, management of nurseries, communication, and call center businesses, as well as in the sale of food and daily necessities. It also sells propane and high pressure gases, and LPG related equipment; imports, manufactures, sells, wholesales, and exports pure water; produces and sells agricultural products; supplies electricity; generates photovoltaic power; and offers LPG cogeneration systems and fuel cells, gas heat pumps, and LPG generators, as well as CLOUD LINE, an optical line Internet service. Toell Co.,Ltd. was founded in 1963 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "3825.T": {
        "short_name": "REMIXPOINT INC",
        "long_name": "Remixpoint, Inc.",
        "summary": "Remixpoint, Inc. engages in the development and sale of energy management solutions, and energy-saving support consulting services in Japan. It also sells energy-saving equipment; and purchases and sells electric power. In addition, the company engages in the development and sale of used car assessment systems; buying and selling used cars; and consulting related to the buying and selling used cars. Further, the company engages in the management of transaction currency exchange; and planning, development, design, and operation of accommodation facilities. Remixpoint, Inc. was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "5974.T": {
        "short_name": "CHUGOKUKOGYO CO",
        "long_name": "Chugokukogyo Co.,Ltd.",
        "summary": "Chugokukogyo Co.,Ltd. manufactures and sells high pressure, iron construction, and facility equipment. The company manufactures and sells LP gas containers, storage tanks, and bulk storage tank; and designs, constructs, and inspects LP gas plants. It also offers inner cover for annealing furnaces and other iron structure products; FRP feed tank silage silos; FRP pharmaceutical tanks and covers; FRP automotive parts; livestock products, such as wet feeders and pipe libraries; BM deodorizers; and livestock wastewater treatment equipment. Chugokukogyo Co.,Ltd. was founded in 1950 and is headquartered in Kure, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kure"
    },
    "59K.F": {
        "short_name": "CHUGOKU EL. PWR",
        "long_name": "The Chugoku Electric Power Co., Inc.",
        "summary": "The Chugoku Electric Power Co., Inc. engages in generation, transmission, and distribution of electric power in Japan. The company operates through three segments: Electric Power, Comprehensive Energy Supply, and Information and Telecommunications. It generates power through hydroelectric, thermal, nuclear, biomass, coal, and other energy sources. The company also provides energy utilization services, such as the sale of liquefied natural gas and other fuels, and electricity and heat; electrical communications and data processing services; and environmental harmony creation, business/lifestyle support, electric power business support, and other services. In addition, it is involved in contracting construction and painting projects; the construction of power facilities; the repair of electric power meters, and electrical and telecommunications engineering works; the operation and management of power station equipment; and realty, building management, leasing, telecommunications, cogeneration, dispersed power sources, and other energy use businesses. Further, the company sells and leases electric water heaters; provides training services in thermal power generation technology and engineering, as well as civil engineering, construction consulting, logistics, day-care services, welfare agency services, and home nursing care services; explores for, develops, and produces energy resources; designs distribution equipment; manufactures electric machine tools, concrete, and civil engineering/foundation construction products; and manages nursing homes. Additionally, it is involved in accepting consignments to receive, store, convert into gas form, and deliver liquefied natural gas, as well as gas pipeline service business. The Chugoku Electric Power Co., Inc. was founded in 1951 and is headquartered in Hiroshima, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Hiroshima"
    },
    "5IE.F": {
        "short_name": "HOKKAIDO EL. PWR",
        "long_name": "Hokkaido Electric Power Company, Incorporated",
        "summary": "Hokkaido Electric Power Company, Incorporated generates, transmits, and distributes electricity in Japan. The company undertakes electrical and telecommunication, civil engineering and construction, piping, air-conditioning and water supply/drainage facility, and disaster prevention equipment works; manufactures and sells electricity meters; and inspects and installs electric meters. It also engages in the management of buildings; environmental conservation business; sale of fuel, equipment, and materials; public bathhouse, cleaning/security service, and utility pole advertising businesses; provision of consulting services in the areas of construction, civil engineering, electricity, environment, energy, and repair of housing appliances; construction, maintenance, operation, and repair of power generation facilities and various plants; sale of electric power generated by thermal, hydroelectric, photovoltaic, and wind power; unloading, storage, and delivery of imported coal; and marine transport agency and customs clearance activities. In addition, the company provides Ethernet communications network and Internet connection services; installation, maintenance, supervision, and consulting of information communication networks; Internet data center and other information processing related services; and sells network-related machinery and equipment, information processing equipment, and software. Further, it is involved in the consultation, development, operation, and management of education related information processing systems; leasing of LNG receiving facilities; and sale of corporate merchandise, gift products, sundries, food, etc. Additionally, the company engages in design, printing, and bookbinding operations; the production of closed captions; and the provision of document management, confidential-document destruction, and recycling services. Hokkaido Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sapporo, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "6HO.F": {
        "short_name": "HOKURIKU EL. PWR",
        "long_name": "Hokuriku Electric Power Company",
        "summary": "Hokuriku Electric Power Company supplies electricity through integrated power generation, transmission, and distribution systems in Japan. The company generates electricity through hydroelectric, thermal, and nuclear sources. It is also involved in the sale of LNG; maintenance of electrical power equipment; construction of thermal and nuclear power plant equipment; research, design, and administration of civil engineering and construction projects; wide-area Ethernet service and corporate Internet connectivity; development and maintenance of software; data center operations; environmental research, and design and execution of environmental greening projects; recycling and storage of confidential documents and archives; and sale of paper products. In addition, the company engages in the real estate leasing and management, temporary staffing, and equipment leasing activities; provision of nursing care/social welfare services, and telephone pole advertising and travel services; manufacture and sale of concrete poles and piles; and operation of the Hyakusen Yokocho online store. Hokuriku Electric Power Company was founded in 1951 and is headquartered in Toyama, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Toyama"
    },
    "9501.T": {
        "short_name": "TOKYO ELEC POWER CO HLDGS INC",
        "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
        "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9502.T": {
        "short_name": "CHUBU ELECTRIC POWER CO INC",
        "long_name": "Chubu Electric Power Company, Incorporated",
        "summary": "Chubu Electric Power Company, Incorporated, together with its subsidiaries, engages in the generation, transmission, distribution, and retail of electricity in Japan and internationally. The company operates through three segments: JERA, Power Network, and Customer Service & Sales. It generates electricity through thermal, nuclear, hydroelectric, wind, biomass, and solar sources. The company is also involved in the fuel upstream, power generation procurement, and wholesale of electricity and gas businesses; and provides power network services. In addition, it engages in the construction for the development and maintenance of electric utilities-related facilities; and manufacture of materials and machinery for electric utilities-related facilities. Further, the company is involved in the gas supply, on-site energy, consulting and investment, real estate management, IT businesses, etc. Chubu Electric Power Company, Incorporated was founded in 1951 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "9504.T": {
        "short_name": "CHUGOKU ELECTRIC POWER CO INC",
        "long_name": "The Chugoku Electric Power Co., Inc.",
        "summary": "The Chugoku Electric Power Co., Inc. engages in generation, transmission, and distribution of electric power in Japan. The company operates through three segments: Electric Power, Comprehensive Energy Supply, and Information and Telecommunications. It generates power through hydroelectric, thermal, nuclear, biomass, coal, and other energy sources. The company also provides energy utilization services, such as the sale of liquefied natural gas and other fuels, and electricity and heat; electrical communications and data processing services; and environmental harmony creation, business/lifestyle support, electric power business support, and other services. In addition, it is involved in contracting construction and painting projects; the construction of power facilities; the repair of electric power meters, and electrical and telecommunications engineering works; the operation and management of power station equipment; and realty, building management, leasing, telecommunications, cogeneration, dispersed power sources, and other energy use businesses. Further, the company sells and leases electric water heaters; provides training services in thermal power generation technology and engineering, as well as civil engineering, construction consulting, logistics, day-care services, welfare agency services, and home nursing care services; explores for, develops, and produces energy resources; designs distribution equipment; manufactures electric machine tools, concrete, and civil engineering/foundation construction products; and manages nursing homes. Additionally, it is involved in accepting consignments to receive, store, convert into gas form, and deliver liquefied natural gas, as well as gas pipeline service business. The Chugoku Electric Power Co., Inc. was founded in 1951 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Hiroshima"
    },
    "9505.T": {
        "short_name": "HOKURIKU ELECTRIC POWER CO",
        "long_name": "Hokuriku Electric Power Company",
        "summary": "Hokuriku Electric Power Company supplies electricity through integrated power generation, transmission, and distribution systems in Japan. The company generates electricity through hydroelectric, thermal, and nuclear sources. It is also involved in the sale of LNG; maintenance of electrical power equipment; construction of thermal and nuclear power plant equipment; research, design, and administration of civil engineering and construction projects; wide-area Ethernet service and corporate Internet connectivity; development and maintenance of software; data center operations; environmental research, and design and execution of environmental greening projects; recycling and storage of confidential documents and archives; and sale of paper products. In addition, the company engages in the real estate leasing and management, temporary staffing, and equipment leasing activities; provision of nursing care/social welfare services, and telephone pole advertising and travel services; manufacture and sale of concrete poles and piles; and operation of the Hyakusen Yokocho online store. Hokuriku Electric Power Company was founded in 1951 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Toyama"
    },
    "9506.T": {
        "short_name": "TOHOKU ELECTRIC POWER CO INC",
        "long_name": "Tohoku Electric Power Company, Incorporated",
        "summary": "Tohoku Electric Power Company, Incorporated, an energy service conglomerate, generates, transmits, and distributes electricity to residential customers in Japan and internationally. It operates in two segments, Electric Power Business and Construction Business. The company generates and supplies hydroelectric, thermal, geothermal, solar, and nuclear electricity. It is also involved in the construction of electrical, and telecommunication facilities and buildings; civil engineering operations; design and manufacture of electricity supply facilities; and business related to the research, survey, and analysis concerning environment preservation. Tohoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sendai, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sendai"
    },
    "9507.T": {
        "short_name": "SHIKOKU ELECTRIC POWER CO INC",
        "long_name": "Shikoku Electric Power Company, Incorporated",
        "summary": "Shikoku Electric Power Company, Incorporated generates, transmits, distributes, and sells electricity in Japan and internationally. The company operates through Electric Power Business, Telecommunications Business, Construction and Engineering Business, Energy Business, and Other Business segments. It generates electricity through nuclear, thermal, hydro, solar, wind, and biomass sources. The company also provides fiber optic internet, cost mobile, and data center and cloud-related services; and supplies gas. In addition, it offers nursing care facilities and lifestyle support services. The company operates electric power generating facilities with a total capacity of 5,435 MW; 209 substations; transmission lines of 3,391 km; and distribution lines of 46,125 km. It serves 2.1 million industrial, commercial, and residential customers. Shikoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takamatsu"
    },
    "9508.T": {
        "short_name": "KYUSHU ELECTRIC POWER CO INC",
        "long_name": "Kyushu Electric Power Company, Incorporated",
        "summary": "Kyushu Electric Power Company, Incorporated engages in the electric power business in Japan and internationally. The company operates through Domestic Electric Power, Other Energy Service, ICT Service, and Other segments. It generates electricity from nuclear, thermal, hydroelectric, geothermal, internal combustion, wind, solar, poultry dung fuel, and biomass power energy sources. The company also receipts, stores, vaporizes, delivers, and sells liquefied natural gas (LNG); purchases, operates, charters, and rents LNG carriers; manufactures and sells electric machinery, concrete poles, HV and LV insulators, and other products; and constructs, maintains, and repairs power generation facilities, as well as nursing home business. In addition, it engages in the heat supply activities; installation, maintenance, and management of electrical measurement equipment; environmental preservation work; consultation, planning, investigation, measurement, design, drafting, and care of civil engineering/construction projects; IT-related planning and consultation, and data center business; and provision of air cargo transportation, site management, and energy efficiency consultancy services. Further, the company offers telecommunication devices, and fiber-optic cable and broadband services; provides elderly nursing home management and nursing, temporary staffing, and job-placement services; develops, operates, and maintains information systems; develops and sells computer software; leases, manages, cleans, and maintains real estate properties; acquires and owns securities; and recycles used confidential documents. Additionally, it is involved in the clerical work acceptance on trust and consulting business; flame spray coating; investment activities; management of golf courses; subtitle production for broadcasting; and ownership of mining interests and assets. The company was founded in 1951 and is headquartered in Fukuoka City, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "9509.T": {
        "short_name": "HOKKAIDO ELECTRIC POWER CO INC",
        "long_name": "Hokkaido Electric Power Company, Incorporated",
        "summary": "Hokkaido Electric Power Company, Incorporated generates, transmits, and distributes electricity in Japan. The company undertakes electrical and telecommunication, civil engineering and construction, piping, air-conditioning and water supply/drainage facility, and disaster prevention equipment works; manufactures and sells electricity meters; and inspects and installs electric meters. It also engages in the management of buildings; environmental conservation business; sale of fuel, equipment, and materials; public bathhouse, cleaning/security service, and utility pole advertising businesses; provision of consulting services in the areas of construction, civil engineering, electricity, environment, energy, and repair of housing appliances; construction, maintenance, operation, and repair of power generation facilities and various plants; sale of electric power generated by thermal, hydroelectric, photovoltaic, and wind power; unloading, storage, and delivery of imported coal; and marine transport agency and customs clearance activities. In addition, the company provides Ethernet communications network and Internet connection services; installation, maintenance, supervision, and consulting of information communication networks; Internet data center and other information processing related services; and sells network-related machinery and equipment, information processing equipment, and software. Further, it is involved in the consultation, development, operation, and management of education related information processing systems; leasing of LNG receiving facilities; and sale of corporate merchandise, gift products, sundries, food, etc. Additionally, the company engages in design, printing, and bookbinding operations; the production of closed captions; and the provision of document management, confidential-document destruction, and recycling services. Hokkaido Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "9511.T": {
        "short_name": "OKINAWA ELECTRIC POWER COMPANY ",
        "long_name": "The Okinawa Electric Power Company, Incorporated",
        "summary": "The Okinawa Electric Power Company, Incorporated engages in the generation, transmission, and distribution of electricity in Okinawa Prefecture, Japan. The company generates electricity from thermal sources. It operates approximately 140 substations, as well as approximately 11,078 km distribution line networks. The company is also involved in the civil engineering, construction, electrical work, piping, electric telecommunication work, electric power system construction work, and inspection and maintenance activities; environmental survey, odor measurement, soil quality, examination, and land survey activities; supervision of construction; internet data center, call center, and aquaculture business; and landscaping projects. It studies and designs electric power facilities; installs air conditioning, sanitation, electric water-heating equipment, and EcoCute and induction heaters; sells and installs LED light fixtures; constructs internal combustion power generation equipment; sells and maintains electrical equipment; operates non-life insurance and advertising agencies; leases and maintains vehicles and properties; operates and installs electrical machinery and equipment, facilities, etc.; operations repair and consignment works; sells components for electrical facilities; offers computer system; and sells and leases computer and peripheral equipment. The company also buys, manages, sells, and leases real estate; plans, designs, and surveys renewable energy systems; constructs and maintains renewable energy and tiltable wind turbine facilities; sells natural gas and LNG; and installs, operates, and maintains power generation systems. It offers Internet solutions, energy, energy saving, management consultant, and ISO certification support training services; and sells, leases, installs, operates, and maintains equipment. The company was founded in 1972 and is based in Urasoe, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Urasoe"
    },
    "9514.T": {
        "short_name": "EF-ON INC",
        "long_name": "EF-ON Inc.",
        "summary": "EF-ON Inc., an energy service company, engages in the biomass power generation business. It is also involved in energy conservation support services, including the improvement of equipment renewal and operation, and improvement of the indoor environment; and collection and sale of biomass fuels. The company was formerly known as The First Energy Service Company Limited and changed its name to EF-ON Inc.in October 2016. EF-ON Inc. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9517.T": {
        "short_name": "EREX CO LTD",
        "long_name": "eREX Co.,Ltd.",
        "summary": "eREX Co.,Ltd. engages in the generation and supply of power in Japan. The company operates a biomass power plant. It is also involved in electricity trading. The company was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Independent Power Producers",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9532.T": {
        "short_name": "OSAKA GAS CO",
        "long_name": "Osaka Gas Co., Ltd.",
        "summary": "Osaka Gas Co., Ltd. provides gas, electricity, and other energy products and services in Japan and internationally. It operates through four segments: Domestic Energy/Gas, Domestic Energy/Electricity, International Energy, and Life & Business Solutions. The Domestic Energy/Gas segment engages in the design, construction, etc. of various plants related to gas, environmental conservation, and others; sale of gas appliances, and housing equipment and appliances; maintenance checks on gas equipment and appliances, and checks on gas meters, as well as collection of gas bills and others; and leasing, installment payments assistance, insurance agency, and others. This segment is also involved in the gas piping works; sale and construction of energy facilities and equipment, heating system supplies, and others; temporary staffing and call center operation activities; and provision of various research and consulting services. The Domestic Energy/Electricity segment supplies electric power. It generates and sells electricity from natural gas-fired thermal power plants, as well as wind, biomass, and solar resources. The International Energy segment engages in leasing LNG tankers; the development and investment of petroleum and natural gas; investment relating to energy supply business; and procurement and sale of LNG. The Life & Business Solutions segment manufactures and sells fine materials, carbon material products, activated carbon, wood protective coatings, absorbent functional materials, and resin additives; develops, leases, manages, and sells real estate properties; and develops software products and provides computer-based data processing services. This segment is also involved in the management and contracted operation of sports facilities and others. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "9534.T": {
        "short_name": "HOKKAIDO GAS CO",
        "long_name": "Hokkaido Gas Co., Ltd.",
        "summary": "Hokkaido Gas Co., Ltd. engages in gas, and heat and power supply businesses in Japan. The company is also involved in the purification and sale of gas by-products; production and sale of gas appliances, as well as related construction works; and other related works. It offers its services in Sapporo, Otaru, Hakodate, Chitose, Ishikari, Kitahiroshima, Eniwa, Hokuto, and Kitami. Hokkaido Gas Co., Ltd. was founded in 1911 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "9536.T": {
        "short_name": "SAIBU GAS CO LTD",
        "long_name": "Saibu Gas Co.,Ltd.",
        "summary": "Saibu Gas Co.,Ltd. produces, supplies, and sells natural gas in Japan. The company also utilizes LNG cryogenic energy; and sells LNG. In addition, it produces, sells, and installs gas equipment and apparatus, as well as undertakes related construction works. Saibu Gas Co.,Ltd. was founded in 1902 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "9537.T": {
        "short_name": "HOKURIKU GAS CO",
        "long_name": "Hokuriku Gas Co.,Ltd.",
        "summary": "Hokuriku Gas Co.,Ltd. engages in the gas business in Japan. The company produces, sells, and supplies gas to approximately 440,000 customers in Niigata, Nagaoka, Sanjo, Kashiwazaki, and Kamo cities, as well as in Tagami town and Kariwa village. It also undertakes gas construction contracts; and sells gas equipment. The company was founded in 1913 and is headquartered in Niigata, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Niigata"
    },
    "9539.T": {
        "short_name": "KEIYO GAS CO LTD",
        "long_name": "Keiyo Gas Co., Ltd.",
        "summary": "Keiyo Gas Co., Ltd. produces, supplies, and sells city gas in the northwest of Chiba Prefecture, Japan. It is also involved in the sale of gas equipment; and operation of gas fitting work. The company was founded in 1927 and is headquartered in Ichikawa, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Ichikawa"
    },
    "9543.T": {
        "short_name": "SHIZUOKA GAS CO LTD",
        "long_name": "Shizuoka Gas Co., Ltd.",
        "summary": "Shizuoka Gas Co., Ltd. produces, supplies, and sells city gas in Japan. The company also sells gas appliances; and undertakes contracts for gas related construction works. As of December 31, 2018, it served approximately 319,591 customers through a gas pipeline network of 4,425 km. The company was founded in 1910 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Shizuoka"
    },
    "9818.T": {
        "short_name": "DAIMARU ENAWIN CO.LTD",
        "long_name": "Daimaru Enawin Co., Ltd.",
        "summary": "Daimaru Enawin Co., Ltd. sells LP gas and petroleum products in Japan. The company's petroleum products include kerosene, and light and heavy oil. It also sells gas appliances, system kitchens, air conditioning equipment, household electric appliances, and solar systems; medical gases, home medical oxygen, and medical equipment; and industrial gases, welding and fusing equipment, welding materials, and industrial equipment, as well as undertakes renovation work. In addition, the company is involved in the mineral water home delivery and electric power agency businesses. Further, it rents equipment; generates power through solar energy; and offers security management services. Daimaru Enawin Co., Ltd. was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "EPWDF": {
        "short_name": "ELECTRIC POWER DEVELOPMENT",
        "long_name": "Electric Power Development Co. Ltd.",
        "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "FJG.F": {
        "short_name": "ELECTRIC POWER DEV.CO.LTD",
        "long_name": "Electric Power Development Co. Ltd.",
        "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KAEPF": {
        "short_name": "KANSAI ELECTRIC POWER CO INC",
        "long_name": "The Kansai Electric Power Company, Incorporated",
        "summary": "The Kansai Electric Power Company, Incorporated engages in the electric power, heat supply, gas supply, and telecommunications businesses in Japan. It operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate/Life segments. The company operates nuclear, hydropower, thermal, solar, wind, and biomass power generation facilities. It serves residential, commercial, and industrial customers. The company also offers IT/communication services comprising optical Internet, telephone, and television services under the Â\u0091eo HIKARI' brand name for households and businesses; and Â\u0091mineo' cell phone services. In addition, it engages in the real estate related activities, such as development of energy-saving apartment houses and buildings; and provision of lifestyle related services, as well as home security, health care, nursing care services, and temporary employee placement. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "KAEPY": {
        "short_name": "KANSAI ELECTRIC POWER CO INC",
        "long_name": "The Kansai Electric Power Company, Incorporated",
        "summary": "The Kansai Electric Power Company, Incorporated engages in the electric power, heat supply, gas supply, and telecommunications businesses in Japan. It operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate/Life segments. The company operates nuclear, hydropower, thermal, solar, wind, and biomass power generation facilities. It serves residential, commercial, and industrial customers. The company also offers IT/communication services comprising optical Internet, telephone, and television services under the Â\u0091eo HIKARI' brand name for households and businesses; and Â\u0091mineo' cell phone services. In addition, it engages in the real estate related activities, such as development of energy-saving apartment houses and buildings; and provision of lifestyle related services, as well as home security, health care, nursing care services, and temporary employee placement. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "KPO.F": {
        "short_name": "KANSAI EL. PWR",
        "long_name": "The Kansai Electric Power Company, Incorporated",
        "summary": "The Kansai Electric Power Company, Incorporated engages in the electric power, heat supply, gas supply, and telecommunications businesses in Japan. It operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate/Life segments. The company operates nuclear, hydropower, thermal, solar, wind, and biomass power generation facilities. It serves residential, commercial, and industrial customers. The company also offers IT/communication services comprising optical Internet, telephone, and television services under the Â\u0091eo HIKARI' brand name for households and businesses; and Â\u0091mineo' cell phone services. In addition, it engages in the real estate related activities, such as development of energy-saving apartment houses and buildings; and provision of lifestyle related services, as well as home security, health care, nursing care services, and temporary employee placement. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "KYSEY": {
        "short_name": "KYUSHU ELECTRIC POWER CO INC",
        "long_name": "Kyushu Electric Power Company, Incorporated",
        "summary": "Kyushu Electric Power Company, Incorporated engages in the electric power business in Japan and internationally. The company operates through Domestic Electric Power, Other Energy Service, ICT Service, and Other segments. It generates electricity from nuclear, thermal, hydroelectric, geothermal, internal combustion, wind, solar, poultry dung fuel, and biomass power energy sources. The company also receipts, stores, vaporizes, delivers, and sells liquefied natural gas (LNG); purchases, operates, charters, and rents LNG carriers; manufactures and sells electric machinery, concrete poles, HV and LV insulators, and other products; and constructs, maintains, and repairs power generation facilities, as well as nursing home business. In addition, it engages in the heat supply activities; installation, maintenance, and management of electrical measurement equipment; environmental preservation work; consultation, planning, investigation, measurement, design, drafting, and care of civil engineering/construction projects; IT-related planning and consultation, and data center business; and provision of air cargo transportation, site management, and energy efficiency consultancy services. Further, the company offers telecommunication devices, and fiber-optic cable and broadband services; provides elderly nursing home management and nursing, temporary staffing, and job-placement services; develops, operates, and maintains information systems; develops and sells computer software; leases, manages, cleans, and maintains real estate properties; acquires and owns securities; and recycles used confidential documents. Additionally, it is involved in the clerical work acceptance on trust and consulting business; flame spray coating; investment activities; management of golf courses; subtitle production for broadcasting; and ownership of mining interests and assets. The company was founded in 1951 and is headquartered in Fukuoka City, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Fukuoka City"
    },
    "OSGSF": {
        "short_name": "OSAKA GAS CO",
        "long_name": "Osaka Gas Co., Ltd.",
        "summary": "Osaka Gas Co., Ltd. provides gas, electricity, and other energy products and services in Japan and internationally. It operates through four segments: Domestic Energy/Gas, Domestic Energy/Electricity, International Energy, and Life & Business Solutions. The Domestic Energy/Gas segment engages in the design, construction, etc. of various plants related to gas, environmental conservation, and others; sale of gas appliances, and housing equipment and appliances; maintenance checks on gas equipment and appliances, and checks on gas meters, as well as collection of gas bills and others; and leasing, installment payments assistance, insurance agency, and others. This segment is also involved in the gas piping works; sale and construction of energy facilities and equipment, heating system supplies, and others; temporary staffing and call center operation activities; and provision of various research and consulting services. The Domestic Energy/Electricity segment supplies electric power. It generates and sells electricity from natural gas-fired thermal power plants, as well as wind, biomass, and solar resources. The International Energy segment engages in leasing LNG tankers; the development and investment of petroleum and natural gas; investment relating to energy supply business; and procurement and sale of LNG. The Life & Business Solutions segment manufactures and sells fine materials, carbon material products, activated carbon, wood protective coatings, absorbent functional materials, and resin additives; develops, leases, manages, and sells real estate properties; and develops software products and provides computer-based data processing services. This segment is also involved in the management and contracted operation of sports facilities and others. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "RPC.SG": {
        "short_name": "Remixpoint Inc. Registered Shar",
        "long_name": "Remixpoint, Inc.",
        "summary": "Remixpoint, Inc. engages in the development and sale of energy management solutions, and energy-saving support consulting services in Japan. It also sells energy-saving equipment; and purchases and sells electric power. In addition, the company engages in the development and sale of used car assessment systems; buying and selling used cars; and consulting related to the buying and selling used cars. Further, the company engages in the management of transaction currency exchange; and planning, development, design, and operation of accommodation facilities. Remixpoint, Inc. was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKECF": {
        "short_name": "TOKYO ELEC POWER CO HLDGS INC",
        "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
        "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKECY": {
        "short_name": "TOKYO ELEC POWER CO HLDGS INC",
        "long_name": "Tokyo Electric Power Company Holdings, Incorporated",
        "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKGSF": {
        "short_name": "TOKYO GAS CO",
        "long_name": "Tokyo Gas Co.,Ltd.",
        "summary": "Tokyo Gas Co., Ltd. produces, supplies, and sells city and liquid gas, and LNG in Japan. As of March 31, 2020, the company operated approximately 64,545 km pipeline network serving approximately 12.11 million customers. It also invests in venture companies and energy related venture capital funds; installs gas supply lines, water supply and drainage lines, air conditioning systems, and gas main and branch lines; checks safety of underground centers; inspects gas equipment construction; delivers liquefied petroleum gas (LPG); supplies hydrogen and gas; and installs hydrogen fuel cells. In addition, the company engages in the solar power, parcel, LNG tolling, heat supply utility, and independent power production businesses; LNG terminal operation and maintenance; sale of gas for industrial and chemical products; management of a hotel; participation in the shale gas development projects; sale of automotive LPG; and manufacture and sale of liquid carbon dioxide and dry ice. Further, it provides engineering services; sells gas, furniture upholstery, and coke; develops LNG cryogenic utilization technology; plans and manages events and showrooms; handles advertising and publishing; operates showrooms and a call center, and staffing; sells and maintains cogeneration systems; produces and sells LNG, condensate, domgas, coalseam gas, liquefied nitrogen, oxygen, and medical gas; and leases gas equipment and appliances, office equipment, and crediting administrations with installations. Additionally, the company offers building management, fire prevention patrol, travel agency, loan, information processing, software development, computer equipment sale, LNG transport, carriers charter, and rare gas services. It also provides meter, billing, exhaust system, and safety services; operates LPG shipping base; installs and maintains gas supply facilities; and develops, manages, and leases real estate and housing. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKGSY": {
        "short_name": "TOKYO GAS CO",
        "long_name": "Tokyo Gas Co.,Ltd.",
        "summary": "Tokyo Gas Co., Ltd. produces, supplies, and sells city and liquid gas, and LNG in Japan. As of March 31, 2020, the company operated approximately 64,545 km pipeline network serving approximately 12.11 million customers. It also invests in venture companies and energy related venture capital funds; installs gas supply lines, water supply and drainage lines, air conditioning systems, and gas main and branch lines; checks safety of underground centers; inspects gas equipment construction; delivers liquefied petroleum gas (LPG); supplies hydrogen and gas; and installs hydrogen fuel cells. In addition, the company engages in the solar power, parcel, LNG tolling, heat supply utility, and independent power production businesses; LNG terminal operation and maintenance; sale of gas for industrial and chemical products; management of a hotel; participation in the shale gas development projects; sale of automotive LPG; and manufacture and sale of liquid carbon dioxide and dry ice. Further, it provides engineering services; sells gas, furniture upholstery, and coke; develops LNG cryogenic utilization technology; plans and manages events and showrooms; handles advertising and publishing; operates showrooms and a call center, and staffing; sells and maintains cogeneration systems; produces and sells LNG, condensate, domgas, coalseam gas, liquefied nitrogen, oxygen, and medical gas; and leases gas equipment and appliances, office equipment, and crediting administrations with installations. Additionally, the company offers building management, fire prevention patrol, travel agency, loan, information processing, software development, computer equipment sale, LNG transport, carriers charter, and rare gas services. It also provides meter, billing, exhaust system, and safety services; operates LPG shipping base; installs and maintains gas supply facilities; and develops, manages, and leases real estate and housing. The company was founded in 1885 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TKT.F": {
        "short_name": "TOHOKU EL. PWR CO.",
        "long_name": "Tohoku Electric Power Company, Incorporated",
        "summary": "Tohoku Electric Power Company, Incorporated, an energy service conglomerate, generates, transmits, and distributes electricity to residential customers in Japan and internationally. It operates in two segments, Electric Power Business and Construction Business. The company generates and supplies hydroelectric, thermal, geothermal, solar, and nuclear electricity. It is also involved in the construction of electrical, and telecommunication facilities and buildings; civil engineering operations; design and manufacture of electricity supply facilities; business related to the research, survey, and analysis concerning environment preservation; and sale of natural gas to corporate customers and local municipal gas utilities through gas pipelines, tank trucks, and others. The company was founded in 1951 and is headquartered in Sendai, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Sendai"
    },
    "XSG.F": {
        "short_name": "SAIBU GAS CO. LTD",
        "long_name": "Saibu Gas Co.,Ltd.",
        "summary": "Saibu Gas Co.,Ltd. produces, supplies, and sells natural gas in Japan. The company also utilizes LNG cryogenic energy; and sells LNG. In addition, it produces, sells, and installs gas equipment and apparatus, as well as undertakes related construction works. Saibu Gas Co.,Ltd. was founded in 1902 and is headquartered in Fukuoka, Japan.",
        "currency": "EUR",
        "sector": "Utilities",
        "industry": "Utilities - Regulated Gas",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Fukuoka City"
    }
}