{"59K.F": {"short_name": "CHUGOKU EL. PWR", "long_name": "The Chugoku Electric Power Co., Inc.", "summary": "The Chugoku Electric Power Co., Inc. engages in generation, transmission, and distribution of electric power in Japan. The company operates through three segments: Electric Power, Comprehensive Energy Supply, and Information and Telecommunications. It generates power through hydroelectric, thermal, nuclear, biomass, coal, and other energy sources. The company also provides energy utilization services, such as the sale of liquefied natural gas and other fuels, and electricity and heat; electrical communications and data processing services; and environmental harmony creation, business/lifestyle support, electric power business support, and other services. In addition, it is involved in contracting construction and painting projects; the construction of power facilities; the repair of electric power meters, and electrical and telecommunications engineering works; the operation and management of power station equipment; and realty, building management, leasing, telecommunications, cogeneration, dispersed power sources, and other energy use businesses. Further, the company sells and leases electric water heaters; provides training services in thermal power generation technology and engineering, as well as civil engineering, construction consulting, logistics, day-care services, welfare agency services, and home nursing care services; explores for, develops, and produces energy resources; designs distribution equipment; manufactures electric machine tools, concrete, and civil engineering/foundation construction products; and manages nursing homes. Additionally, it is involved in accepting consignments to receive, store, convert into gas form, and deliver liquefied natural gas, as well as gas pipeline service business. The Chugoku Electric Power Co., Inc. was founded in 1951 and is headquartered in Hiroshima, Japan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Hiroshima"}, "5IE.F": {"short_name": "HOKKAIDO EL. PWR", "long_name": "Hokkaido Electric Power Company, Incorporated", "summary": "Hokkaido Electric Power Company, Incorporated generates, transmits, and distributes electricity in Japan. The company undertakes electrical and telecommunication, civil engineering and construction, piping, air-conditioning and water supply/drainage facility, and disaster prevention equipment works; manufactures and sells electricity meters; and inspects and installs electric meters. It also engages in the management of buildings; environmental conservation business; sale of fuel, equipment, and materials; public bathhouse, cleaning/security service, and utility pole advertising businesses; provision of consulting services in the areas of construction, civil engineering, electricity, environment, energy, and repair of housing appliances; construction, maintenance, operation, and repair of power generation facilities and various plants; sale of electric power generated by thermal, hydroelectric, photovoltaic, and wind power; unloading, storage, and delivery of imported coal; and marine transport agency and customs clearance activities. In addition, the company provides Ethernet communications network and Internet connection services; installation, maintenance, supervision, and consulting of information communication networks; Internet data center and other information processing related services; and sells network-related machinery and equipment, information processing equipment, and software. Further, it is involved in the consultation, development, operation, and management of education related information processing systems; leasing of LNG receiving facilities; and sale of corporate merchandise, gift products, sundries, food, etc. Additionally, the company engages in design, printing, and bookbinding operations; the production of closed captions; and the provision of document management, confidential-document destruction, and recycling services. Hokkaido Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sapporo, Japan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Sapporo"}, "6HO.F": {"short_name": "HOKURIKU EL. PWR", "long_name": "Hokuriku Electric Power Company", "summary": "Hokuriku Electric Power Company supplies electricity through integrated power generation, transmission, and distribution systems in Japan. The company generates electricity through hydroelectric, thermal, and nuclear sources. It is also involved in the sale of LNG; maintenance of electrical power equipment; construction of thermal and nuclear power plant equipment; research, design, and administration of civil engineering and construction projects; wide-area Ethernet service and corporate Internet connectivity; development and maintenance of software; data center operations; environmental research, and design and execution of environmental greening projects; recycling and storage of confidential documents and archives; and sale of paper products. In addition, the company engages in the real estate leasing and management, temporary staffing, and equipment leasing activities; provision of nursing care/social welfare services, and telephone pole advertising and travel services; manufacture and sale of concrete poles and piles; and operation of the Hyakusen Yokocho online store. Hokuriku Electric Power Company was founded in 1951 and is headquartered in Toyama, Japan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Toyama"}, "9501.T": {"short_name": "TOKYO ELEC POWER CO HLDGS INC", "long_name": "Tokyo Electric Power Company Holdings, Incorporated", "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9504.T": {"short_name": "CHUGOKU ELECTRIC POWER CO INC", "long_name": "The Chugoku Electric Power Co., Inc.", "summary": "The Chugoku Electric Power Co., Inc. engages in generation, transmission, and distribution of electric power in Japan. The company operates through three segments: Electric Power, Comprehensive Energy Supply, and Information and Telecommunications. It generates power through hydroelectric, thermal, nuclear, biomass, coal, and other energy sources. The company also provides energy utilization services, such as the sale of liquefied natural gas and other fuels, and electricity and heat; electrical communications and data processing services; and environmental harmony creation, business/lifestyle support, electric power business support, and other services. In addition, it is involved in contracting construction and painting projects; the construction of power facilities; the repair of electric power meters, and electrical and telecommunications engineering works; the operation and management of power station equipment; and realty, building management, leasing, telecommunications, cogeneration, dispersed power sources, and other energy use businesses. Further, the company sells and leases electric water heaters; provides training services in thermal power generation technology and engineering, as well as civil engineering, construction consulting, logistics, day-care services, welfare agency services, and home nursing care services; explores for, develops, and produces energy resources; designs distribution equipment; manufactures electric machine tools, concrete, and civil engineering/foundation construction products; and manages nursing homes. Additionally, it is involved in accepting consignments to receive, store, convert into gas form, and deliver liquefied natural gas, as well as gas pipeline service business. The Chugoku Electric Power Co., Inc. was founded in 1951 and is headquartered in Hiroshima, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Hiroshima"}, "9505.T": {"short_name": "HOKURIKU ELECTRIC POWER CO", "long_name": "Hokuriku Electric Power Company", "summary": "Hokuriku Electric Power Company supplies electricity through integrated power generation, transmission, and distribution systems in Japan. The company generates electricity through hydroelectric, thermal, and nuclear sources. It is also involved in the sale of LNG; maintenance of electrical power equipment; construction of thermal and nuclear power plant equipment; research, design, and administration of civil engineering and construction projects; wide-area Ethernet service and corporate Internet connectivity; development and maintenance of software; data center operations; environmental research, and design and execution of environmental greening projects; recycling and storage of confidential documents and archives; and sale of paper products. In addition, the company engages in the real estate leasing and management, temporary staffing, and equipment leasing activities; provision of nursing care/social welfare services, and telephone pole advertising and travel services; manufacture and sale of concrete poles and piles; and operation of the Hyakusen Yokocho online store. Hokuriku Electric Power Company was founded in 1951 and is headquartered in Toyama, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Toyama"}, "9506.T": {"short_name": "TOHOKU ELECTRIC POWER CO INC", "long_name": "Tohoku Electric Power Company, Incorporated", "summary": "Tohoku Electric Power Company, Incorporated, an energy service conglomerate, generates, transmits, and distributes electricity to residential customers in Japan and internationally. It operates in two segments, Electric Power Business and Construction Business. The company generates and supplies hydroelectric, thermal, geothermal, solar, and nuclear electricity. It is also involved in the construction of electrical, and telecommunication facilities and buildings; civil engineering operations; design and manufacture of electricity supply facilities; and business related to the research, survey, and analysis concerning environment preservation. Tohoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sendai, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sendai"}, "9507.T": {"short_name": "SHIKOKU ELECTRIC POWER CO INC", "long_name": "Shikoku Electric Power Company, Incorporated", "summary": "Shikoku Electric Power Company, Incorporated generates, transmits, distributes, and sells electricity in Japan and internationally. The company operates through Electric Power Business, Telecommunications Business, Construction and Engineering Business, Energy Business, and Other Business segments. It generates electricity through nuclear, thermal, hydro, solar, wind, and biomass sources. The company also provides fiber optic internet, cost mobile, and data center and cloud-related services; and supplies gas. In addition, it offers nursing care facilities and lifestyle support services. The company operates electric power generating facilities with a total capacity of 5,435 MW; 209 substations; transmission lines of 3,391 km; and distribution lines of 46,125 km. It serves 2.1 million industrial, commercial, and residential customers. Shikoku Electric Power Company, Incorporated was founded in 1951 and is headquartered in Takamatsu, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takamatsu"}, "9509.T": {"short_name": "HOKKAIDO ELECTRIC POWER CO INC", "long_name": "Hokkaido Electric Power Company, Incorporated", "summary": "Hokkaido Electric Power Company, Incorporated generates, transmits, and distributes electricity in Japan. The company undertakes electrical and telecommunication, civil engineering and construction, piping, air-conditioning and water supply/drainage facility, and disaster prevention equipment works; manufactures and sells electricity meters; and inspects and installs electric meters. It also engages in the management of buildings; environmental conservation business; sale of fuel, equipment, and materials; public bathhouse, cleaning/security service, and utility pole advertising businesses; provision of consulting services in the areas of construction, civil engineering, electricity, environment, energy, and repair of housing appliances; construction, maintenance, operation, and repair of power generation facilities and various plants; sale of electric power generated by thermal, hydroelectric, photovoltaic, and wind power; unloading, storage, and delivery of imported coal; and marine transport agency and customs clearance activities. In addition, the company provides Ethernet communications network and Internet connection services; installation, maintenance, supervision, and consulting of information communication networks; Internet data center and other information processing related services; and sells network-related machinery and equipment, information processing equipment, and software. Further, it is involved in the consultation, development, operation, and management of education related information processing systems; leasing of LNG receiving facilities; and sale of corporate merchandise, gift products, sundries, food, etc. Additionally, the company engages in design, printing, and bookbinding operations; the production of closed captions; and the provision of document management, confidential-document destruction, and recycling services. Hokkaido Electric Power Company, Incorporated was founded in 1951 and is headquartered in Sapporo, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sapporo"}, "9511.T": {"short_name": "OKINAWA ELECTRIC POWER COMPANY ", "long_name": "The Okinawa Electric Power Company, Incorporated", "summary": "The Okinawa Electric Power Company, Incorporated engages in the generation, transmission, and distribution of electricity in Okinawa Prefecture, Japan. The company generates electricity from thermal sources. It operates approximately 140 substations, as well as approximately 11,078 km distribution line networks. The company is also involved in the civil engineering, construction, electrical work, piping, electric telecommunication work, electric power system construction work, and inspection and maintenance activities; environmental survey, odor measurement, soil quality, examination, and land survey activities; supervision of construction; internet data center, call center, and aquaculture business; and landscaping projects. It studies and designs electric power facilities; installs air conditioning, sanitation, electric water-heating equipment, and EcoCute and induction heaters; sells and installs LED light fixtures; constructs internal combustion power generation equipment; sells and maintains electrical equipment; operates non-life insurance and advertising agencies; leases and maintains vehicles and properties; operates and installs electrical machinery and equipment, facilities, etc.; operations repair and consignment works; sells components for electrical facilities; offers computer system; and sells and leases computer and peripheral equipment. The company also buys, manages, sells, and leases real estate; plans, designs, and surveys renewable energy systems; constructs and maintains renewable energy and tiltable wind turbine facilities; sells natural gas and LNG; and installs, operates, and maintains power generation systems. It offers Internet solutions, energy, energy saving, management consultant, and ISO certification support training services; and sells, leases, installs, operates, and maintains equipment. The company was founded in 1972 and is based in Urasoe, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Urasoe"}, "9514.T": {"short_name": "EF-ON INC", "long_name": "EF-ON Inc.", "summary": "EF-ON Inc., an energy service company, engages in the biomass power generation business. It is also involved in energy conservation support services, including the improvement of equipment renewal and operation, and improvement of the indoor environment; and collection and sale of biomass fuels. The company was formerly known as The First Energy Service Company Limited and changed its name to EF-ON Inc.in October 2016. EF-ON Inc. was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "EPWDF": {"short_name": "ELECTRIC POWER DEVELOPMENT", "long_name": "Electric Power Development Co. Ltd.", "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "FJG.F": {"short_name": "ELECTRIC POWER DEV.CO.LTD", "long_name": "Electric Power Development Co. Ltd.", "summary": "Electric Power Development Co., Ltd. engages in the wholesale supply of hydroelectric and thermal power in Japan. It also generates and transmits electricity. The company owns and operates thermal power generation facilities with a total capacity of 8,849 MW; 60 hydroelectric power plants with a total capacity of 8,571 MW; 21 wind power facilities with a total capacity of 429 MW; and approximately 2,400 kilometers of power transmission lines, and 9 substations and converter stations. It also owns and operates power generation facilities with a total capacity of 6,308 MW that are located in Thailand, the United States, and China. In addition, the company is involved in unloading and transporting coal to thermal power plants; sale of fly ash; shipping of coal for thermal power plants; research and planning of environmental conservation; surveying and compensation of construction sites; provision of civil engineering, construction management, construction, facility maintenance, and business process outsourcing services; operation of welfare facilities; development of computer software; and marine transportation of ash and fly ash. Further, it constructs and maintains electronic and communication facilities; imports, sells, and transports coal; invests in coal mines; operates wood pellet manufacturing facilities and nuclear power plants; manufactures, sells, and markets activated coke; produces fertilizers using ash; operates and maintains telecommunication facilities and waste-fueled power generation plants; constructs and operates sewage sludge-based fuel manufacturing facility; procures forest offcut; and provides engineering services for atmospheric and water pollutant removal equipment. Additionally, the company offers consulting services, including technical cooperation related to electric power development and environmental preservation. Electric Power Development Co., Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "KAEPF": {"short_name": "KANSAI ELECTRIC POWER CO INC", "long_name": "The Kansai Electric Power Company, Incorporated", "summary": "The Kansai Electric Power Company, Incorporated engages in the electric power, heat supply, gas supply, and telecommunications businesses in Japan. It operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate/Life segments. The company operates nuclear, hydropower, thermal, solar, wind, and biomass power generation facilities. It serves residential, commercial, and industrial customers. The company also offers IT/communication services comprising optical Internet, telephone, and television services under the Â\u0091eo HIKARI' brand name for households and businesses; and Â\u0091mineo' cell phone services. In addition, it engages in the real estate related activities, such as development of energy-saving apartment houses and buildings; and provision of lifestyle related services, as well as home security, health care, nursing care services, and temporary employee placement. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "KAEPY": {"short_name": "KANSAI ELECTRIC POWER CO INC", "long_name": "The Kansai Electric Power Company, Incorporated", "summary": "The Kansai Electric Power Company, Incorporated engages in the electric power, heat supply, gas supply, and telecommunications businesses in Japan. It operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate/Life segments. The company operates nuclear, hydropower, thermal, solar, wind, and biomass power generation facilities. It serves residential, commercial, and industrial customers. The company also offers IT/communication services comprising optical Internet, telephone, and television services under the Â\u0091eo HIKARI' brand name for households and businesses; and Â\u0091mineo' cell phone services. In addition, it engages in the real estate related activities, such as development of energy-saving apartment houses and buildings; and provision of lifestyle related services, as well as home security, health care, nursing care services, and temporary employee placement. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "KPO.F": {"short_name": "KANSAI EL. PWR", "long_name": "The Kansai Electric Power Company, Incorporated", "summary": "The Kansai Electric Power Company, Incorporated engages in the electric power, heat supply, gas supply, and telecommunications businesses in Japan. It operates through Electric Power, Gas/Other Energies, IT/Communications, and Real Estate/Life segments. The company operates nuclear, hydropower, thermal, solar, wind, and biomass power generation facilities. It serves residential, commercial, and industrial customers. The company also offers IT/communication services comprising optical Internet, telephone, and television services under the Â\u0091eo HIKARI' brand name for households and businesses; and Â\u0091mineo' cell phone services. In addition, it engages in the real estate related activities, such as development of energy-saving apartment houses and buildings; and provision of lifestyle related services, as well as home security, health care, nursing care services, and temporary employee placement. The Kansai Electric Power Company, Incorporated was founded in 1951 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "TKECF": {"short_name": "TOKYO ELEC POWER CO HLDGS INC", "long_name": "Tokyo Electric Power Company Holdings, Incorporated", "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TKECY": {"short_name": "TOKYO ELEC POWER CO HLDGS INC", "long_name": "Tokyo Electric Power Company Holdings, Incorporated", "summary": "Tokyo Electric Power Company Holdings, Incorporated generates, transmits, distributes, and retails electric power in Japan and internationally. The company operates a portfolio of thermal, nuclear, solar, wind, hydro, and geothermal power plants. It is also involved in the gas sales business; and provision of consulting services for electricity companies. The company was formerly known as Tokyo Electric Power Company, Incorporated and changed its name to Tokyo Electric Power Company Holdings, Incorporated in April 2016. The company was founded in 1951 and is headquartered in Tokyo, Japan. Tokyo Electric Power Company Holdings, Incorporated is a subsidiary of Nuclear Damage Compensation and Decommissioning Facilitation Corporation.", "currency": "USD", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TKT.F": {"short_name": "TOHOKU EL. PWR CO.", "long_name": "Tohoku Electric Power Company, Incorporated", "summary": "Tohoku Electric Power Company, Incorporated, an energy service conglomerate, generates, transmits, and distributes electricity to residential customers in Japan and internationally. It operates in two segments, Electric Power Business and Construction Business. The company generates and supplies hydroelectric, thermal, geothermal, solar, and nuclear electricity. It is also involved in the construction of electrical, and telecommunication facilities and buildings; civil engineering operations; design and manufacture of electricity supply facilities; business related to the research, survey, and analysis concerning environment preservation; and sale of natural gas to corporate customers and local municipal gas utilities through gas pipelines, tank trucks, and others. The company was founded in 1951 and is headquartered in Sendai, Japan.", "currency": "EUR", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Sendai"}}