{
    "AMG1L.VS": {
        "short_name": "Amber Grid",
        "long_name": "AB Amber Grid",
        "summary": "AB Amber Grid operates as a natural gas transmission system company in the Republic of Lithuania. The company is involved in the transmission of natural gas through high pressure pipelines to system users. It also operates, maintains, and develops natural gas transmission system that includes gas transmission pipelines, gas compressor stations, gas metering and distribution stations, and cathodic protection installations, as well as data transmission and telecommunications systems. The company's natural gas transmission system consists of 2,115 km of gas transmission pipelines, 65 gas distribution stations, 3 gas metering stations, and 2 gas compressor stations. It serves companies operating in the sectors of electricity, district heating, and industry; and medium-sized local businesses, as well as natural gas suppliers receiving natural gas transmission services. The company was founded in 2013 and is based in Vilnius, the Republic of Lithuania. AB Amber Grid is a subsidiary of UAB EPSO-G.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "city": "Vilnius"
    },
    "KNF1L.VS": {
        "short_name": "Klaipedos Nafta",
        "long_name": "AB Klaipedos nafta",
        "summary": "AB Klaipedos nafta engages in the operation of oil terminal, oil products transshipment, and other related activities primarily in Lithuania. It operates through KNF, SGD, SNT, and GDP segments. The company also operates liquefied natural gas terminals. It transships oil products, including diesel fuel of various types, gasoline of various types, jet fuel, fuel oil of various types, biofuel, vacuum gas oil, and crude oil products; reloads crude oil and oil products into trucks; and accumulates and stores crude oil and oil products. The company also engages in the collection of waste water from sea vessels; mooring; inspection of quality parameters of oil products; blending of heavy and light oil products; and supply of fuel and water to vessels. In addition, it stores and handles oil products; and adds bio-additives and marks substances to oil products. The company was founded in 1994 and is based in Klaipeda, Lithuania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "LIT",
        "market": "vs_market",
        "country": "Lithuania",
        "city": "Klaipeda"
    },
    "XIC.F": {
        "short_name": "KLAIPEDOS NAFTA AB EO0,29",
        "long_name": "AB Klaipedos nafta",
        "summary": "AB Klaipedos nafta engages in the operation of oil terminal, oil products transshipment, and other related activities primarily in Lithuania. It operates through KNF, SGD, SNT, and GDP segments. The company also operates liquefied natural gas terminals. It transships oil products, including diesel fuel of various types, gasoline of various types, jet fuel, fuel oil of various types, biofuel, vacuum gas oil, and crude oil products; reloads crude oil and oil products into trucks; and accumulates and stores crude oil and oil products. The company also engages in the collection of waste water from sea vessels; mooring; inspection of quality parameters of oil products; blending of heavy and light oil products; and supply of fuel and water to vessels. In addition, it stores and handles oil products; and adds bio-additives and marks substances to oil products. The company was founded in 1994 and is based in Klaipeda, Lithuania.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Lithuania",
        "city": "Klaipeda"
    }
}