{
    "1696.HK": {
        "short_name": "SISRAM MED",
        "long_name": "Sisram Medical Ltd",
        "summary": "Sisram Medical Ltd, an investment holding company, designs, develops, manufactures, and sells energy-based aesthetic medical and minimally invasive treatment systems in the Asia Pacific, Europe, North America, Latin America, the Middle East, and Africa. It offers a portfolio of treatment systems for non-invasive medical aesthetic treatments, including hair removal, skin rejuvenation, skin resurfacing, vascular and pigmented lesions treatment, tattoo removal, acne treatment, cellulite reduction, body contouring, and skin tightening; and minimally invasive treatments, such as assisted liposuction and fat grafting, and feminine health, as well as treatment of varicose veins and ear, nose, and throat procedures. The company also provides beauty product line treatment systems, such as Rejuve and Reshape; and manufactures, distributes, and sells medical equipment. It offers its products under the Alma, Soprano, Harmony, ClearLift, Accent, BeautiFill, and FemiLift brands. The company sells its products directly to treatment providers and treatment recipients; and through distributors and direct sales. The company was founded in 2013 and is headquartered in Caesarea, Israel. Sisram Medical Ltd operates as a former subsidiary of Ample Up Limited.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "2RW.F": {
        "short_name": "REWALK ROBOTICS  IS -,01",
        "long_name": "ReWalk Robotics Ltd.",
        "summary": "ReWalk Robotics Ltd., a medical device company, designs, develops, and commercializes robotic exoskeletons for individuals with mobility impairments or other medical conditions. It offers ReWalk Personal for everyday use to paraplegic individuals at home and in their communities; and ReWalk Rehabilitation for exercise and therapy used in hospitals and rehabilitation centers in the United States and Europe. The company is also developing ReWalk Restore, a soft suit exoskeleton for rehabilitation of individuals suffering from a stroke. It markets and sells its products directly to third party payers, institutions and individuals, as well as through third-party distributors. The company was formerly known as Argo Medical Technologies Ltd. ReWalk Robotics Ltd. was founded in 2001 and is headquartered in Yokneam Ilit, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    },
    "ALMD.TA": {
        "short_name": "ALLIUM MEDICAL SOL",
        "long_name": "Allium Medical Solutions Ltd",
        "summary": "Allium Medical Solutions Ltd., a medical device company, develops, manufactures, and markets minimally invasive products in Israel and internationally. The company offers covered stents, such as ureteral, round posterior, triangular prostatic, bulbar, and biliary stents. It also provides uro-gynecology products, including EndoFast Reliant Systems for reinforcement; EndoFast Resorb kits for fixation of surgical mesh to tissues for tissue reinforcement; EndoFast Reliant MN, an implantable, sub-urethral support sling for the treatment of male stress urinary incontinence; and EndoFast Reliant SCP for fixation of surgical mesh to tissue for tissue reinforcement during laparotomy or laparoscopic Sacrocolpopexy approach. In addition, the company offers gastro-duodenal sleeves for the treatment of diabetes mellitus and obesity; and WIRION EPD system, an embolic protection system. Allium Medical Solutions Ltd. is headquartered in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "BIOV.TA": {
        "short_name": "BIO VIEW",
        "long_name": "Bio-View Ltd",
        "summary": "Bio-View Ltd develops, manufactures, and markets automated cell imaging and analysis solutions for use in cytology, cytogenetic, and pathology clinical and research laboratories in Israel and internationally. The company's products include Accord, a workbench microscope station for semi-automated fluorescent imaging and analysis; Accord Plus, an automatic fluorescent imaging system that automatically scans, analyses, and sorts a range of FISH samples in real-time; and Allegro Plus, an automatic fluorescent imaging system, which identifies various chromosomal aberrations under fluorescent light, such as amplifications, translocations, inversions, and deletions. It also offers DUET-3, an imaging and analysis platform that boasts an automated barcode reader, which enables scanning of various test types in a single scan batch; DeNovo, an automated scanning system for detection, analysis, and characterization of circulating tumor cells from peripheral blood; and Solo Workstation, an offline workstation that streamlines and enables review and analysis of test results away from the microscope. In addition, the company provides Solo Touch Workstation, an offline workstation, which streamlines the review and analysis of test results away from the microscope and on an intuitive touch screen; and SoloWeb, an online remote workstation that analyses, reports, and consults on BioView-scanned cases using web browsers various locations. Bio-View Ltd was founded in 2000 and is based in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rehovot"
    },
    "CKNTF": {
        "short_name": "CELL KINETICS LTD",
        "long_name": "Cell Kinetics Ltd.",
        "summary": "Cell Kinetics Ltd. engages in the refining and commercialization of CellScan and related technology. It focuses on the development and commercialization of a cell carrier technology known as CKChip, a platform static cytometry technology that enables the simultaneous examination of various individual live cells using simple imaging methods, such as fluorescence microscopy. The company was founded in 1992 and is headquartered in Lod, Israel. Cell Kinetics Ltd. is a subsidiary of Medis Technologies Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Lod"
    },
    "EFNC.TA": {
        "short_name": "ERECH FINANCE",
        "long_name": "Erech Finance Cahalacha Ltd",
        "summary": "Erech Finance Cahalacha Ltd operates as a medical equipment company. It provides therapeutic medical devices for diabetes. The company is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "EMITF": {
        "short_name": "ELBIT IMAGING LTD",
        "long_name": "Elbit Imaging Ltd.",
        "summary": "Elbit Imaging Ltd., together with its subsidiaries, engages in research and development, production, and marketing of treatment-oriented medical systems; and products to treat cancer diseases. Its treatment-oriented medical systems include magnetic resonance imaging for the purpose of performing noninvasive treatments in human beings. The company is also involved in the sale of plots in India. It has operations in the United States, Europe, and internationally. The company was founded in 1996 and is headquartered in Petach Tikva, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Petach Tikva"
    },
    "EMITF.TA": {
        "short_name": "ELBIT IMAGING LTD",
        "long_name": "Elbit Imaging Ltd.",
        "summary": "Elbit Imaging Ltd., together with its subsidiaries, engages in research and development, production, and marketing of treatment-oriented medical systems; and products to treat cancer diseases. Its treatment-oriented medical systems include magnetic resonance imaging for the purpose of performing noninvasive treatments in human beings. The company is also involved in the sale of plots in India. It has operations in the United States, Europe, and internationally. The company was founded in 1996 and is headquartered in Petach Tikva, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petach Tikva"
    },
    "EMTC.TA": {
        "short_name": "ELBIT MEDICAL TECH",
        "long_name": "Elbit Medical Technologies Ltd",
        "summary": "Elbit Medical Technologies Ltd engages in the biomedical business. The company is developing an MR-guided ultrasound treatment platform to address various neurosurgery, oncology, and gynecology indications in noninvasive and personalized treatments. It is also involved in the development of therapeutic products based on cells derived from the umbilical cord blood. The company is based in Petah Tikva, Israel. Elbit Medical Technologies Ltd is a subsidiary of Elbit Imaging Ltd.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "HUMX.TA": {
        "short_name": "HUMAN XTENSIONS LT",
        "long_name": "Human Xtensions Ltd.",
        "summary": "Human Xtensions Ltd. develops unmediated surgical systems. It offers HandX, a handheld medical device for use in laparoscopic procedures. The company was founded in 2012 and is based in Netanya, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "INCR.TA": {
        "short_name": "INTERCURE LTD",
        "long_name": "InterCure Ltd",
        "summary": "InterCure Ltd engages in the research, cultivation, production, marketing, and distribution of cannabis products for medical use in Israel and internationally. It also invests in bioscience, life sciences, medical equipment, and biotechnology sectors. The company was incorporated in 1994 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "INMD": {
        "short_name": "InMode Ltd.",
        "long_name": "InMode Ltd.",
        "summary": "InMode Ltd. designs, develops, manufactures, and markets minimally-invasive aesthetic medical products based on its proprietary radio frequency assisted lipolysis and deep subdermal fractional radio frequency technologies. The company offers minimally-invasive aesthetic medical products for various procedures, such as liposuction with simultaneous skin tightening, body and face contouring, and ablative skin rejuvenation treatments. It also designs, develops, manufactures, and markets non-invasive medical aesthetic products that target an array of procedures, including permanent hair reduction, facial skin rejuvenation, wrinkle reduction, cellulite treatment, skin appearance and texture, and superficial benign vascular and pigmented lesions. InMode Ltd. offers its products directly in the United States, Canada, the United Kingdom, Spain, Australia, and India, as well as indirectly through distributors in 46 countries. The company was formerly known as Invasix Ltd. and changed its name to InMode Ltd. in November 2017. InMode Ltd. was founded in 2008 and is headquartered in Yokneam, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Yokneam"
    },
    "IRCLF": {
        "short_name": "INTERCURE LTD",
        "long_name": "InterCure Ltd.",
        "summary": "InterCure Ltd. invests in the biomedical, life sciences, and biotechnology sectors in Israel and internationally. The company was formerly known as Ben Gavish Ltd. and changed its name to InterCure Ltd. in June 1997. InterCure Ltd. was founded in 1994 and is based in Hadera, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "IRME": {
        "short_name": "IR-MED INC",
        "long_name": "IR-Med Inc.",
        "summary": "IR-Med Inc., a medical device company, focuses on the development of infra-red (IR) and artificial intelligence technologies to address the diagnosis of common medical ailments. It offers PressureSafe, a non-invasive and real-time optical monitoring device for the preemptive detection of pressure injury; and Nobiotics, an advanced otoscope that works on IR-spectrographic analysis technology providing doctors an immediate indication of the infection being viral or bacterial. The company also engages in developing a real-time noninvasive optical monitor to determine Propofol blood concentration. IR-Med Inc. is based in Rosh Pinna, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Rosh Pinna"
    },
    "ITMMF": {
        "short_name": "ITAMAR MEDICAL LTD",
        "long_name": "Itamar Medical Ltd.",
        "summary": "Itamar Medical Ltd. engages in the research, development, marketing, sale, and leasing of non-invasive medical devices for the cardiology market. The company offers medical devices based on Peripheral Arterial Tone (PAT) signal, which measures changes in the patient's peripheral arterial pulse volumes and various parameters of arterial activities. It provides WatchPAT device, which enables home sleep tests for various sleeping disorders, including obstructive sleep apnea; and Endo PAT device that diagnoses endothelial dysfunction. The company operates in the United States, Canada, Europe, Israel, Japan, the Asia Pacific, and other countries. Itamar Medical Ltd. has a collaboration agreement with SoClean Inc. to offer WatchPAT ONE home sleep apnea test and digital health services through direct-to-consumer channels. The company was formerly known as Itamar Medical (CM) 1997 Ltd. and changed its name to Itamar Medical Ltd. in July 2000. Itamar Medical Ltd. was founded in 1997 and is headquartered in Caesarea, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "ITMR": {
        "short_name": "Itamar Medical Ltd. - American ",
        "long_name": "Itamar Medical Ltd.",
        "summary": "Itamar Medical Ltd. engages in the research, development, marketing, sale, and leasing of non-invasive medical devices for the cardiology market. The company offers medical devices based on Peripheral Arterial Tone (PAT) signal, which measures changes in the patient's peripheral arterial pulse volumes and various parameters of arterial activities. It provides WatchPAT device, which enables home sleep tests for various sleeping disorders, including obstructive sleep apnea; and Endo PAT device that diagnoses endothelial dysfunction. The company operates in the United States, Canada, Europe, Israel, Japan, the Asia Pacific, and other countries. Itamar Medical Ltd. has a collaboration agreement with SoClean Inc. to offer WatchPAT ONE home sleep apnea test and digital health services through direct-to-consumer channels. The company was formerly known as Itamar Medical (CM) 1997 Ltd. and changed its name to Itamar Medical Ltd. in July 2000. Itamar Medical Ltd. was founded in 1997 and is headquartered in Caesarea, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "ITMR.TA": {
        "short_name": "ITAMAR MEDICAL LTD",
        "long_name": "Itamar Medical Ltd.",
        "summary": "Itamar Medical Ltd. engages in the research, development, marketing, sale, and leasing of non-invasive medical devices for the cardiology market. The company offers medical devices based on Peripheral Arterial Tone (PAT) signal, which measures changes in the patient's peripheral arterial pulse volumes and various parameters of arterial activities. It provides WatchPAT device, which enables home sleep tests for various sleeping disorders, including obstructive sleep apnea; and Endo PAT device that diagnoses endothelial dysfunction. The company operates in the United States, Canada, Europe, Israel, Japan, the Asia Pacific, and other countries. Itamar Medical Ltd. has a collaboration agreement with SoClean Inc. to offer WatchPAT ONE home sleep apnea test and digital health services through direct-to-consumer channels. The company was formerly known as Itamar Medical (CM) 1997 Ltd. and changed its name to Itamar Medical Ltd. in July 2000. Itamar Medical Ltd. was founded in 1997 and is headquartered in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "MDGS": {
        "short_name": "Medigus Ltd.",
        "long_name": "Medigus Ltd.",
        "summary": "Medigus Ltd., a medical device company, develops, produces, and markets minimally invasive endo-surgical tools and direct visualization technology in the United States, Europe, Asia, and internationally. It offers Medigus Ultrasonic Surgical Endostapler, an endoscopy system, which is used for the treatment of gastroesophageal reflux disease. Medigus Ltd. was founded in 1999 and is headquartered in Omer, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "city": "Omer"
    },
    "MDGS.TA": {
        "short_name": "MEDIGUS",
        "long_name": "Medigus Ltd.",
        "summary": "Medigus Ltd., a medical device company, develops, produces, and markets minimally invasive endo-surgical tools and direct visualization technology in the United States, Europe, Asia, and internationally. It offers Medigus Ultrasonic Surgical Endostapler, an endoscopy system, which is used for the treatment of gastroesophageal reflux disease. Medigus Ltd. was founded in 1999 and is headquartered in Omer, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Omer"
    },
    "NNOX": {
        "short_name": "NANO-X IMAGING LTD",
        "long_name": "Nano-X Imaging Ltd.",
        "summary": "Nano-X Imaging Ltd. engages in developing and producing X-ray source technology for the medical imaging industry in the United States. It develops novel digital X-ray source, a microelectromechanical system-based semiconductor cathode that achieves electron emission by a non-thermionic low-voltage trigger to nano-scale molybdenum cones. The company also develops a prototype of the Nanox.ARC, a medical imaging system incorporating its novel digital X-ray source; and Nanox.CLOUD, a companion cloud software designed to deliver medical screening as a service. Nano-X Imaging Ltd. was incorporated in 2018 and is based in Neve Ilan, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Neve Ilan"
    },
    "NSPR": {
        "short_name": "InspireMD Inc.",
        "long_name": "InspireMD, Inc.",
        "summary": "InspireMD, Inc., a medical device company, focuses on the development and commercialization of proprietary MicroNet stent platform technology for the treatment of vascular and coronary diseases in Europe, Latin America, the Middle East, and Asia. The company offers CGuard carotid embolic prevention system for use in carotid artery applications; and MGuard Prime embolic protection systems for use in patients with acute coronary syndromes, notably acute myocardial infarction, and saphenous vein graft coronary interventions. It is also developing NGuard, a neurovascular flow diverter that diverts blood flow away from cerebral aneurysms and seals the aneurysms. The company sells its products through local distributors. InspireMD, Inc. is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASE",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "RWLK": {
        "short_name": "ReWalk Robotics Ltd.",
        "long_name": "ReWalk Robotics Ltd.",
        "summary": "ReWalk Robotics Ltd., a medical device company, designs, develops, and commercializes robotic exoskeletons for individuals with mobility impairments or other medical conditions. It offers ReWalk Personal for everyday use to paraplegic individuals at home and in their communities; and ReWalk Rehabilitation for exercise and therapy used in hospitals and rehabilitation centers in the United States and Europe. The company is also developing ReWalk Restore, a soft suit exoskeleton for rehabilitation of individuals suffering from a stroke. It markets and sells its products directly to third party payers, institutions and individuals, as well as through third-party distributors. The company was formerly known as Argo Medical Technologies Ltd. ReWalk Robotics Ltd. was founded in 2001 and is headquartered in Yokneam Ilit, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    }
}