{
  "DANE.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Medical Care Facilities",
    "long_name": "Danel (Adir Yeoshua) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "DANEL-ADIR YEHOSHU",
    "state": null,
    "summary": "Danel (Adir Yeoshua) Ltd provides human resources services in Israel. It offers recruitment, placement, and employment services in the areas of employment, nursing, welfare, education, hi-tech, cleantech, biotech, finance, and others; and nursing services, such as nursing law services, private care in hospitals, private care by caregivers, assistance to holocaust survivors and foreign caregivers. The company also operates a social-rehabilitation day club, which provides social and recreational activities for the victims of hostile acts, as well as offers housing, education, employment, and other services. It serves government ministries, public bodies, the defense industries, and private companies. Danel (Adir Yeoshua) Ltd was founded in 1974 and is based in Ramat Gan, Israel.",
    "website": "http://www.danel-jobs.co.il",
    "zipcode": null
  },
  "GOHO.TA": {
    "city": "Tel-Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Medical Care Facilities",
    "long_name": "Golden House Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "GOLDEN HOUSE",
    "state": null,
    "summary": "Golden House Ltd provides assisted independent living services for elderly population in Israel. It operates The Golden Age House TA, an assisted independent living house that contains 300 housing units, as well as public spaces, including a lobby, club, restaurant, coffee shop, library, movie theatre, synagogue, classroom, lecture room, fitness center, spa, and green garden terrace. The company also offers nursing care services. Golden House Ltd was founded in 1982 and is based in Tel-Aviv, Israel.",
    "website": "http://www.golden-house.co.il",
    "zipcode": "67320"
  },
  "ICCM.TA": {
    "city": "Caesarea",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Medical Care Facilities",
    "long_name": "IceCure Medical Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "ICECURE MEDICAL LT",
    "state": null,
    "summary": "IceCure Medical Ltd develops and markets minimally invasive cryoablation therapies for women's health and oncology markets. It offers ProSense system, a cryoablation solution for breast tumors. The company was founded in 2006 and is headquartered in Caesarea, Israel.",
    "website": "http://www.icecure-medical.com",
    "zipcode": "3079504"
  },
  "ICUSF": {
    "city": "Caesarea",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Medical Care Facilities",
    "long_name": "IceCure Medical Ltd",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ICECURE MEDICAL LTD",
    "state": null,
    "summary": "IceCure Medical Ltd develops and markets minimally invasive cryoablation therapies for women's health and oncology markets. It offers ProSense system, a cryoablation solution for breast tumors. The company was founded in 2006 and is headquartered in Caesarea, Israel.",
    "website": "http://www.icecure-medical.com",
    "zipcode": "3079504"
  },
  "MRHL.TA": {
    "city": "Bnei Brak",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Medical Care Facilities",
    "long_name": "Merchavia Holdings and Investments Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "MERCHAVIA HOLD",
    "state": null,
    "summary": "Merchavia Holdings and Investments Ltd. invests in life science companies in Israel. It has a strategic partnership with Cleveland clinic in the United States. The company was formerly known as Nepco Star Ltd. and changed its name to Merchavia Holdings and Investments Ltd. in November 2014. Merchavia Holdings and Investments Ltd. was founded in 1972 and is headquartered in Bnei Brak, Israel.",
    "website": "http://merchavia.com",
    "zipcode": "5126112"
  },
  "NVLG.TA": {
    "city": "Modi'in-Maccabim-Re'ut",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Medical Care Facilities",
    "long_name": "Novolog (Pharm-Up 1966) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "NOVOLOG",
    "state": null,
    "summary": "Novolog (Pharm-Up 1966) Ltd provides healthcare services in Israel. It offers medical devices to healthcare institutions and patients in their homes; and medical logistics services to pharmaceutical and medical device companies. The company also produces and disseminates medical content and tools to the general public and medical community; and develops personalized treatment programs and initiates home visits by nurses. In addition, it provides health and medical process management services for corporations; and supplies sterilization services using ethylene oxide gas for medical and laboratory products, as well as offers direct access to health and wellness ecosystem for international corporations. The company is based in Modi'in-Maccabim-Re'ut, Israel.",
    "website": "http://www.novolog.co.il",
    "zipcode": "717131"
  }
}
