{
    "BFLD": {
        "short_name": "BROADCAST LIVE DIGITAL CORP",
        "long_name": "Broadcast Live Digital Corp.",
        "summary": "Broadcast Live Digital Corp. is a shell company that does not have significant operations. The company was formerly known as Brookfield Resources Inc. and changed its name to Broadcast Live Digital Corp. in August 2013. Broadcast Live Digital Corp. was incorporated in 2010 and is based in Mississauga, Canada.",
        "currency": "USD",
        "sector": "Services",
        "industry": "Entertainment - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Mississauga"
    },
    "CNIN.MX": {
        "short_name": "CANADIAN NATIONAL RAILWAYS CO",
        "long_name": "Canadian National Railway Company",
        "summary": "Canadian National Railway Company, together with its subsidiaries, engages in the rail and related transportation business. Its portfolio of goods includes petroleum and chemicals, grain and fertilizers, coal, metals and minerals, forest products, intermodal, and automotive products serving exporters, importers, retailers, farmers, and manufacturers. The company operates a network of 19,500 route miles of track spanning Canada and the United States. It also provides vessels and docks, transloading and distribution, automotive logistics, and freight forwarding and transportation management services. The company was founded in 1919 and is headquartered in Montreal, Canada.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Railroads",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Montreal"
    },
    "QSRN.MX": {
        "short_name": "RESTAURANT BRANDS INTL INC",
        "long_name": "Restaurant Brands International Inc.",
        "summary": "Restaurant Brands International Inc. owns, operates, and franchises quick service restaurants under the Tim Hortons (TH), Burger King (BK), and Popeyes (PLK) brands. The company operates through three segments: TH, BK, and PLK. Its restaurants offer blend coffee, tea, espresso-based hot and cold specialty drinks, donuts, Timbits, bagels, muffins, cookies and pastries, grilled paninis, classic sandwiches, wraps, soups, hamburgers, chicken and other specialty sandwiches, french fries, soft drinks, chicken, chicken tenders, fried shrimp and other seafood, red beans and rice, and other food items. As of December 31, 2020, the company owned or franchised a total of 4,949 TH restaurants, 18,625 BK restaurants, and 3,451 PLK restaurants in approximately 100 countries worldwide and U.S. territories. Restaurant Brands International Inc. was founded in 1954 and is headquartered in Toronto, Canada.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Restaurants",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "TFIIN.MX": {
        "short_name": "TFI INTERNATIONAL INC",
        "long_name": "TFI International Inc.",
        "summary": "TFI International Inc. provides transportation and logistics services in the United States, Canada, and Mexico. The company operates through Package and Courier, Less-Than-Truckload (LTL), Truckload (TL), and Logistics segments. The Package and Courier segment engages in the pickup, transport, and delivery of items. The LTL segment is involved in the pickup, consolidation, transportation, and delivery of smaller loads. The TL segment offers expedited transportation, flatbed, tank container, and dedicated services, as well as TL brokerage services. This segment carries full loads directly from the customer to the destination using a closed van or specialized equipment. The Logistics segment provides asset-light logistics services, including brokerage, freight forwarding, and transportation management, as well as small package parcel delivery. As of December 31, 2020, the company had 7,867 tractors, 25,520 trailers, and 9,926 independent contractors. The company was formerly known as TransForce Inc. and changed its name to TFI International Inc. in December 2016. TFI International Inc. is headquartered in Saint-Laurent, Canada.",
        "currency": "MXN",
        "sector": "Services",
        "industry": "Trucking",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "city": "Saint-Laurent"
    }
}