{"BFLD": {"short_name": "BROADCAST LIVE DIGITAL CORP", "long_name": "Broadcast Live Digital Corp.", "summary": "Broadcast Live Digital Corp. is a shell company that does not have significant operations. The company was formerly known as Brookfield Resources Inc. and changed its name to Broadcast Live Digital Corp. in August 2013. Broadcast Live Digital Corp. was incorporated in 2010 and is based in Mississauga, Canada.", "currency": "USD", "sector": "Services", "industry": "Entertainment - Diversified", "exchange": "PNK", "market": "us_market", "country": "Canada", "city": "Mississauga"}, "CNIN.MX": {"short_name": "CANADIAN NATIONAL RAILWAYS CO", "long_name": "Canadian National Railway Company", "summary": "Canadian National Railway Company, together with its subsidiaries, engages in the rail and related transportation business. The company's portfolio of goods comprises petroleum and chemicals, fertilizers, coal, metals and minerals, forest products, grain, intermodal, and automotive products serving exporters, importers, retailers, farmers, and manufacturers. It operates a network of approximately 20,000 route miles of track in Canada and mid-America ranging from the Atlantic and Pacific oceans to the Gulf of Mexico. The company also provides trucking services, such as door-to-door, import and export dray, interline, and other specialized services; and supply chain services, which include transloading and distribution, customs brokerage, freight forwarding, marine shipping, and private car storage services, as well as operates logistics parks. It serves the cities and ports of Vancouver, Prince Rupert, Montreal, Halifax, New Orleans, and Mobile (Alabama), as well as the metropolitan areas of Toronto, Edmonton, Winnipeg, Calgary, Chicago, Memphis, Detroit, Duluth/Superior, and Jackson with connections to various points in North America. Canadian National Railway Company was founded in 1919 and is headquartered in Montreal, Canada.", "currency": "MXN", "sector": "Services", "industry": "Railroads", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Montreal"}, "QSRN.MX": {"short_name": "RESTAURANT BRANDS INTL INC", "long_name": "Restaurant Brands International Inc.", "summary": "Restaurant Brands International Inc. owns, operates, and franchises quick service restaurants under the Tim Hortons (TH), Burger King (BK), and Popeyes (PLK) brand names. The company operates through three segments: TH, BK, and PLK. Its restaurants offer blend coffee, tea, espresso-based hot and cold specialty drinks, donuts, Timbits, bagels, muffins, cookies and pastries, grilled paninis, classic sandwiches, wraps, soups, hamburgers, chicken and other specialty sandwiches, french fries, soft drinks, chicken, chicken tenders, fried shrimp and other seafood, red beans and rice, and other food items. As of December 31, 2019, the company owned or franchised a total of 4,932 TH restaurants, 18,838 BK restaurants, and 3,316 PLK restaurants in approximately 100 countries worldwide and U.S. territories. Restaurant Brands International Inc. was founded in 1954 and is headquartered in Toronto, Canada.", "currency": "MXN", "sector": "Services", "industry": "Restaurants", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Toronto"}, "RME.TO": {"short_name": "ROCKY MOUNTAIN DEALERSHIPS INC.", "long_name": "Rocky Mountain Equipment Alberta Ltd", "summary": "Rocky Mountain Dealerships Inc., through its subsidiaries, sells, rents, leases, and provides support services for new and used agriculture and industrial equipment. The company provides tractors, planters, air drills and carts, sprayers, floaters, liquid nutrient applicators, balers, combines and combine heads, tillage, loaders and attachments, mowers and conditioners, and windrowers, as well as used equipment and replacement parts for agriculture and construction applications. It also offers third-party equipment financing and insurance services; and in-branch and mobile/on-site repair and maintenance services, as well as provides or arranges other ancillary offerings, such as GPS signal subscriptions. The company offers products of various brands, such as Case IH Agriculture, Case Construction, New Holland, Bourgault, Seed Hawk, MacDon, and Claas through its store and online. As of March 10, 2020, it operated a dealership network of 37 branches under the Rocky Mountain Equipment and RME Deal Zone USA trade names in Alberta, Manitoba, and Saskatchewan, Western Canada, as well as Tonganoxie, Kansas. Rocky Mountain Dealerships Inc. was incorporated in 2007 and is headquartered in Calgary, Canada. As of December 22, 2020, Rocky Mountain Dealerships Inc. was taken private.", "currency": "CAD", "sector": "Services", "industry": "Industrial Equipment Wholesale", "exchange": "TOR", "market": "ca_market", "country": "Canada", "city": "Calgary"}, "TFIIN.MX": {"short_name": "TFI INTERNATIONAL INC", "long_name": "TFI International Inc.", "summary": "TFI International Inc. provides transportation and logistics services in the United States, Canada, and Mexico. The company operates through Package and Courier, Less-Than-Truckload (LTL), Truckload (TL), and Logistics segments. The Package and Courier segment engages in the pickup, transport, and delivery of items. The LTL segment is involved in the pickup, consolidation, transportation, and delivery of smaller loads. The TL segment offers expedited transportation, flatbed, tank container, and dedicated services, as well as TL brokerage services. This segment carries full loads directly from the customer to the destination using a closed van or specialized equipment. The Logistics segment provides asset-light logistics services, including brokerage, freight forwarding, and transportation management, as well as small package parcel delivery. The company is also involved in the transportation and storage of food grade liquids, industrial chemicals, specialty oils, and waxes; transportation of dry and liquid bulk and offers other value-add services; provision of transportation services for explosives, mining and steel products, electronics, and household goods; and provision of contract hauling services for aggregate materials, wood by-products, agriculture/commodities, beets, dry bulk materials, railroad traction sand, and food grade product materials. In addition, it transports viscous materials and provides a patented solution for the storage, handling, and transportation of these materials for the food and industrial products industries; offers medical logistics, final mile, and brokerage services; and provides brokerage, direct trucking, and warehousing services. As of December 31, 2019, TFI International Inc. had 7,772 tractors, 25,505 trailers, and 9,826 independent contractors. The company was formerly known as TransForce Inc. and changed its name to TFI International Inc. in December 2016. TFI International Inc. is headquartered in Montreal, Canada.", "currency": "MXN", "sector": "Services", "industry": "Trucking", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Montreal"}, "TNKN.MX": {"short_name": "TEEKAY TANKERS LTD", "long_name": "Teekay Tankers Ltd.", "summary": "Teekay Tankers Ltd. provides marine transportation services to oil industries in Bermuda and internationally. It operates through two segments, Tanker and Ship-to-ship Transfer (STS). The company offers voyage and time charter services; and offshore STS transfer services of commodities primarily crude oil and refined oil products, as well as liquid gases and various other products. It also provides tanker commercial and technical management, LNG terminal management, consultancy, procurement, and equipment rental services; and lightering support services, including full service lightering and other lightering support services. As of December 31, 2019, the company owned and leased 55 double-hull oil tankers, 2 ship-to-ship support vessels, and 9 time chartered-in tankers. Its vessels are employed through a mix of short- or medium-term fixed-rate time charter contracts and spot tanker market trading. Teekay Tankers Ltd. was founded in 2007 and is based in Vancouver, Canada.", "currency": "MXN", "sector": "Services", "industry": "Shipping", "exchange": "MEX", "market": "mx_market", "country": "Canada", "city": "Vancouver"}}