{
    "ADI.JO": {
        "short_name": "Adapt IT Holdings Ltd",
        "long_name": "Adapt IT Holdings Limited",
        "summary": "Adapt IT Holdings Limited provides information and communications technology services in South Africa and internationally. Its Education segment provides enterprise resource planning solutions for use in educational institutions; and ITS integrator support, automated exam and class timetabling, training and consulting, and learning relationship management system services, as well as implementation, customization, development, and integration services. The company's Manufacturing segment offers integrated workforce management system solutions for the manufacturing, agri-processing, security resource, and utilities sectors; and business advisory, software development, implementation, systems integration, sustainability reporting, and ERP support services. Its Financial Services segment provides software solutions that automate financial statement and assurance engagements, streamline tax management processes, and enable simplified time and billing management; and software implementation services. The company's Energy segment designs, implements, and supports SAP and supply chain solutions within the oil and gas sector. Its Communications segment offers telecommunications solutions; and services, such as software as a service, APN-as-a-service, analytics-as-a-service, telecommunication and technology expense management, customer experience and self-service advisory, enterprise data services and connectivity, and enterprise performance management. The company's Hospitality segment provides integrated software and hardware solutions to the hospitality industries; and consulting, project management, implementation, hosting and database, application, and support services. The company is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "1687",
        "website": "http://www.adaptit.com",
        "full_time_employees": 1117
    },
    "ADR.JO": {
        "short_name": "Adcorp Holdings Limited",
        "long_name": "Adcorp Holdings Limited",
        "summary": "Adcorp Holdings Limited provides workplace solutions in South Africa and Australia. It operates through Industrial Services, Support Services, Professional Services, Financial Services, and Training Services segments. The company offers permanent recruitment and flexible staffing, professional IT, business process outsourcing, training, and financial services; and agency agreement, shared, managed, emergent business, payroll card, and project management products and services. Adcorp Holdings Limited was founded in 1968 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://www.adcorpgroup.com",
        "full_time_employees": null
    },
    "AEG.JO": {
        "short_name": "Aveng Group Limited",
        "long_name": "Aveng Limited",
        "summary": "Aveng Limited, together with its subsidiaries, engages in the construction and engineering, and mining businesses worldwide. The company operates as an engineering, construction, building, and maintenance contractor for the building, infrastructure, and resource markets focusing on tunnel and pipeline, railway infrastructure, marine and mechanical, industrial building, oil and gas, and mining and mineral projects. It also provides open cut and underground mining services. Aveng Limited is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2076",
        "website": "http://aveng.co.za",
        "full_time_employees": 9982
    },
    "AFDG": {
        "short_name": "AFRICAN DISCOVERY GROUP INC",
        "long_name": "African Discovery Group, Inc.",
        "summary": "African Discovery Group, Inc. offers daily rental of vehicles to business and leisure customers through company-owned stores in South Africa. The company was formerly known as Earn-A-Car, Inc. and changed its name to African Discovery Group, Inc. in November 2020. African Discovery Group, Inc. is based in Benoni, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Benoni",
        "zipcode": "1522",
        "website": "http://africandiscoverygroup.com",
        "full_time_employees": 38
    },
    "ATI.JO": {
        "short_name": "Afristrat Inv Hldgs Ltd",
        "long_name": "Afristrat Investment Holdings Limited",
        "summary": "Afristrat Investment Holdings Limited, together with its subsidiaries, provides financial services in South Africa, Botswana, Zambia, Eswatini, and Mauritius. The company operates through Credit, Investment Services, and Equity Holdings segments. It offers secured credit funding to commercial clients, such as business credit in the form of medium-term loans subject to security cover; and supply chain and/or enterprise development solutions to integrate vendors into the supply chain. The company also provides financial investment products to the retail market. In addition, it offers strategic investment services in managed profit focused companies. Further, the company provides debt collection, management, treasury, and property investment services. The company was formerly known as Ecsponent Limited and changed its name to Afristrat Investment Holdings Limited in October 2020. Afristrat Investment Holdings Limited was founded in 1995 and is based in Pretoria, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Pretoria",
        "zipcode": "0145",
        "website": "http://www.afristrat.co.za",
        "full_time_employees": null
    },
    "AVEPY": {
        "short_name": "AVENG",
        "long_name": "Aveng Limited",
        "summary": "Aveng Limited, together with its subsidiaries, engages in the construction and engineering, and mining businesses worldwide. The company operates as an engineering, construction, building, and maintenance contractor for the building, infrastructure, and resource markets focusing on tunnel and pipeline, railway infrastructure, marine and mechanical, industrial building, oil and gas, and mining and mineral projects. It also provides open cut and underground mining services. Aveng Limited is based in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2076",
        "website": "http://aveng.co.za",
        "full_time_employees": 9982
    },
    "B2K.F": {
        "short_name": "BELL EQUIPMENT LTD",
        "long_name": "Bell Equipment Limited",
        "summary": "Bell Equipment Limited manufactures and distributes materials handling equipment primarily for agriculture, forestry, waste-handling, and construction industries worldwide. The company offers articulated dump trucks (ADT), crawler dozers, excavators, low profile ADT, motor graders, tractor loader backhoes, wheeled loaders, dumper trailers, and haulage tractors; and feller bunchers, forwarders, harvesters, loggers, matriarch forestry machines, skidders, timber trucks, and waratah heads. It also provides articulated tractors, cane loaders, forklifts, haulage tractors, matriarch canepro and slew loaders, and trailers; and asphalt construction finishers/pavers and rollers, cold milling/stabilizers and recyclers, earth and sanitary landfill construction rollers, light equipment, and waste management. In addition, the company offers cone crushers, conveyor, impact and jaw crushers, and screens; and wheel conversions, cane cranes, concrete mixers, container handlers, custom load bodies, fire trucks, hooklift trucks, rockscalers, TLB variations, versa trucks, and water tankers. Further, it provides lubricants, parts, and simulators; and financing, training, pre owed equipment, and maintenance services. The company sells its products through a network of customer service centers, strategic alliances, and independent dealers. Bell Equipment Limited was founded in 1954 and is headquartered in Richards Bay, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Richards Bay",
        "zipcode": "3900",
        "website": "http://www.bellequipment.com",
        "full_time_employees": null
    },
    "B7P.F": {
        "short_name": "RAUBEX GROUP LTD  RC -,01",
        "long_name": "Raubex Group Limited",
        "summary": "Raubex Group Limited operates in the construction industry in South Africa and internationally. The company operates in three segments: Materials, Roads and Earthworks, and Infrastructure. The Materials segment operates commercial quarry, which supplies aggregates; contract crushing; and materials handling and processing services for the mining industry. The Roads and Earthworks segment is involved in the road construction and earthworks, and surfacing and rehabilitation activities, including the manufacturing and laying of asphalt, chip and spray, surface dressing, enrichments, and slurry seals, as well as the manufacture and distribution of value added bituminous products. The Infrastructure segment undertakes infrastructure projects, such as renewable energy, rail, telecommunications, pipeline construction, housing infrastructure, and commercial building refurbishment and construction projects. Raubex Group Limited was founded in 1974 and is headquartered in Bloemfontein, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Bloemfontein",
        "zipcode": "9300",
        "website": "http://www.raubex.com",
        "full_time_employees": 4185
    },
    "BAW.JO": {
        "short_name": "Barloworld Ltd",
        "long_name": "Barloworld Limited",
        "summary": "Barloworld Limited distributes products that provide integrated rental, fleet management, product support, and logistics solutions in South Africa, Europe, and Russia. The company operates through Equipment and Handling, and Automotive and Logistics segments. It offers short-term vehicle rental services; long-term leasing and fleet management services; insurance products; aftermarket service, including parts sales; and salvage management solution. The company also sells new, used, and demo cars; engages in the franchised motor vehicle retailing under Audi, BMW, Ford, Toyota, Lexus, Isuzu, Mazda, Volkswagen, and Mercedes-Benz brands; and invests in online platforms and toolsets for asset disposals. In addition, it operates as a dealer for the Cat construction, mining, and industrial machines; rents Cat machines; supplies power train, engines, and hydraulics to the mining and civil engineering customers; and provides after-sales solutions through service centers. In addition, it offers warehousing and distribution, supply chain advisory and management, freight forwarding, and transport management services; provides supply chain planning, environmental, rail supply chain, and temperature controlled solutions. Barloworld Limited was founded in 1902 and is based in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2146",
        "website": "http://www.barloworld.com",
        "full_time_employees": 12824
    },
    "BDVSF": {
        "short_name": "BIDVEST GROUP LTD",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "full_time_employees": null
    },
    "BDVSY": {
        "short_name": "BIDVEST GROUP LTD",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "full_time_employees": null
    },
    "BEL.JO": {
        "short_name": "Bell Equipment Ltd",
        "long_name": "Bell Equipment Limited",
        "summary": "Bell Equipment Limited manufactures and distributes materials handling equipment primarily for agriculture, forestry, waste-handling, and construction industries worldwide. The company offers articulated dump trucks (ADT), crawler dozers, excavators, low profile ADT, motor graders, tractor loader backhoes, wheeled loaders, dumper trailers, and haulage tractors; and feller bunchers, forwarders, harvesters, loggers, matriarch forestry machines, skidders, timber trucks, and waratah heads. It also provides articulated tractors, cane loaders, forklifts, haulage tractors, matriarch canepro and slew loaders, and trailers; and asphalt construction finishers/pavers and rollers, cold milling/stabilizers and recyclers, earth and sanitary landfill construction rollers, light equipment, and waste management. In addition, the company offers cone crushers, conveyor, impact and jaw crushers, and screens; and wheel conversions, cane cranes, concrete mixers, container handlers, custom load bodies, fire trucks, hooklift trucks, rockscalers, TLB variations, versa trucks, and water tankers. Further, it provides lubricants, parts, and simulators; and financing, training, pre owed equipment, and maintenance services. The company sells its products through a network of customer service centers, strategic alliances, and independent dealers. Bell Equipment Limited was founded in 1954 and is headquartered in Richards Bay, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Richards Bay",
        "zipcode": "3900",
        "website": "http://www.bellequipment.com",
        "full_time_employees": null
    },
    "BIK.JO": {
        "short_name": "Brikor Ltd",
        "long_name": "Brikor Limited",
        "summary": "Brikor Limited, together with its subsidiaries, manufactures and supplies building and construction materials in South Africa. The company operates through Bricks and Coal segments. It is involved in the provision of plaster bricks and semi-face clay bricks; and coal mining operations. The company serves customers in housing, residential, commercial, industrial, civil engineering, and infrastructure projects. Brikor Limited was incorporated in 1998 and is based in Nigel, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Nigel",
        "zipcode": "1490",
        "website": "http://brikor.co.za",
        "full_time_employees": null
    },
    "BRL1.F": {
        "short_name": "BARLOWORLD  RC-,05",
        "long_name": "Barloworld Limited",
        "summary": "Barloworld Limited distributes products that provide integrated rental, fleet management, product support, and logistics solutions in South Africa, Europe, and Russia. The company operates through Equipment and Handling, and Automotive and Logistics segments. It offers short-term vehicle rental services; long-term leasing and fleet management services; insurance products; aftermarket service, including parts sales; and salvage management solution. The company also sells new, used, and demo cars; engages in the franchised motor vehicle retailing under Audi, BMW, Ford, Toyota, Lexus, Isuzu, Mazda, Volkswagen, and Mercedes-Benz brands; and invests in online platforms and toolsets for asset disposals. In addition, it operates as a dealer for the Cat construction, mining, and industrial machines; rents Cat machines; supplies power train, engines, and hydraulics to the mining and civil engineering customers; and provides after-sales solutions through service centers. In addition, it offers warehousing and distribution, supply chain advisory and management, freight forwarding, and transport management services; provides supply chain planning, environmental, rail supply chain, and temperature controlled solutions. Barloworld Limited was founded in 1902 and is based in Sandton, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2146",
        "website": "http://www.barloworld.com",
        "full_time_employees": 12824
    },
    "BRRAY": {
        "short_name": "BARLOWORLD",
        "long_name": "Barloworld Limited",
        "summary": "Barloworld Limited distributes products that provide integrated rental, fleet management, product support, and logistics solutions in South Africa, Europe, and Russia. The company operates through Equipment and Handling, and Automotive and Logistics segments. It offers short-term vehicle rental services; long-term leasing and fleet management services; insurance products; aftermarket service, including parts sales; and salvage management solution. The company also sells new, used, and demo cars; engages in the franchised motor vehicle retailing under Audi, BMW, Ford, Toyota, Lexus, Isuzu, Mazda, Volkswagen, and Mercedes-Benz brands; and invests in online platforms and toolsets for asset disposals. In addition, it operates as a dealer for the Cat construction, mining, and industrial machines; rents Cat machines; supplies power train, engines, and hydraulics to the mining and civil engineering customers; and provides after-sales solutions through service centers. In addition, it offers warehousing and distribution, supply chain advisory and management, freight forwarding, and transport management services; provides supply chain planning, environmental, rail supply chain, and temperature controlled solutions. Barloworld Limited was founded in 1902 and is based in Sandton, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2146",
        "website": "http://www.barloworld.com",
        "full_time_employees": 12824
    },
    "BVT.JO": {
        "short_name": "Bidvest Ltd",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "full_time_employees": null
    },
    "BWO.L": {
        "short_name": "BARLOWORLD LD ORD R0.05",
        "long_name": "Barloworld Limited",
        "summary": "Barloworld Limited distributes products that provide integrated rental, fleet management, product support, and logistics solutions in South Africa, Europe, and Russia. The company operates through Equipment and Handling, and Automotive and Logistics segments. It offers short-term vehicle rental services; long-term leasing and fleet management services; insurance products; aftermarket service, including parts sales; and salvage management solution. The company also sells new, used, and demo cars; engages in the franchised motor vehicle retailing under Audi, BMW, Ford, Toyota, Lexus, Isuzu, Mazda, Volkswagen, and Mercedes-Benz brands; and invests in online platforms and toolsets for asset disposals. In addition, it operates as a dealer for the Cat construction, mining, and industrial machines; rents Cat machines; supplies power train, engines, and hydraulics to the mining and civil engineering customers; and provides after-sales solutions through service centers. In addition, it offers warehousing and distribution, supply chain advisory and management, freight forwarding, and transport management services; provides supply chain planning, environmental, rail supply chain, and temperature controlled solutions. Barloworld Limited was founded in 1902 and is based in Sandton, South Africa.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2146",
        "website": "http://www.barloworld.com",
        "full_time_employees": 12824
    },
    "CGN.JO": {
        "short_name": "Cognition Holdings Ltd",
        "long_name": "Cognition Holdings Limited",
        "summary": "Cognition Holdings Limited, together with its subsidiaries, provides active data exchange, and knowledge creation and management services primarily in South Africa. The company's active data exchange services include short message, interactive voice response, Vmail one-on-one marketing, mobi, fulfillment, call center, bespoke, and unstructured supplementary service data services, as well as advertising, promotion, direct marketing, and CRM services; and conference call, IM, email, airtime sales, fax2email, email2fax, corporate fax, airtime sales, and auto receptionist services. It also provides Knowledge 350Â°, a 15 step business process, which creates an integrated and logical process that assists companies to build databases and to move from segmenting customers to single customer profiles with detailed demographics and psychographics. In addition, the company offers MyPoint that enables panellists to complete surveys and rewards them with points, prizes, and benefits; Community Builds, an interactive relationship-building program; qualitative and quantitative market research services; and omnibus/syndicated studies. Further, it provides Web development services, as well as associated search engine optimization input services; SecurDox, a document exchange services; and annual quantifications, reports tracking, in-store, in-store observation, and liquor in-store pricing, as well as print ad tracking, and commissioned and consumer research services. The company was formerly known as FoneWorx Holdings Limited and changed its name to Cognition Holdings Limited in January 2015. Cognition Holdings Limited is headquartered in Randburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Randburg",
        "zipcode": "2194",
        "website": "http://www.cognitionholdings.co.za",
        "full_time_employees": 205
    },
    "CSG.JO": {
        "short_name": "CSG Holdings Ltd",
        "long_name": "CSG Holdings Limited",
        "summary": "CSG Holdings Limited, together with its subsidiaries, provides facilities management, security and risk solutions, and staffing solutions primarily in South Africa, Mozambique, Malawi, and Botswana. It offers temporary outsourced personnel, permanent placements, timekeeping, payroll, human resource, and industrial relations services. The company also manages restaurant staff members, as well as supplies meals to students, patients in hospitals, corporate head offices, and mines and construction sites; and specialized cleaning services to the hospitality, healthcare, and commercial industries. In addition, it offers remote site (camp) services, which include accommodation, catering, laundry, cleaning, and maintenance services; and contract catering and events management services. Further, the company provides integrated security services, such as safety surveillance and access control services to residential and commercial clients; and specialized security risk services, including monitoring software. Additionally, it offers training and skills development services; cleaning and mining services to the mining and construction industry; and financing and related services, as well as operates as a franchisor to security companies. CSG Holdings Limited was incorporated in 2006 and is headquartered in Pretoria, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Pretoria",
        "zipcode": "0181",
        "website": "http://www.csgholdings.co.za",
        "full_time_employees": 8938
    },
    "DNB.JO": {
        "short_name": "Deneb Investments Ltd",
        "long_name": "Deneb Investments Limited",
        "summary": "Deneb Investments Limited, an investment company, distributes branded products in South Africa and internationally. The company's Property segment owns and manages a portfolio of industrial and commercial properties situated in KwaZulu-Natal and the Western Cape. Its Branded Product Distribution segment sources and distributes Prima Toys, Prima Interactive, Prima Baby, The Empire Group, Oops, HTIC, Seartec, The Kid Zone, OfficeBox, Clever Little Monkey, and Brand ID products. The Industrial Product Manufacturing segment manufactures specialized industrial products for the mining, agricultural, construction, automotive, hospitality, and retail markets; and textiles. The Automotive Parts Manufacturing segment engages in the manufacturing of tubular and exhaust-related components. Deneb Investments Limited was incorporated in 2013 and is based in Cape Town, South Africa. Deneb Investments Limited is a subsidiary of Hosken Consolidated Investments Limited.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.deneb.co.za",
        "full_time_employees": 2581
    },
    "ENX.JO": {
        "short_name": "enX Group LImited",
        "long_name": "enX Group Limited",
        "summary": "enX Group Limited, together with its subsidiaries, provides industrial, petrochemical, and fleet management and logistics products and related services primarily to industrial and commercial sectors. The company operates through enX Equipment, enX Fleet, and enX Petrochemicals segments. The enX Equipment segment provides distribution, rental, and value added services for industrial and materials handling equipment; manufactures, installs, and maintains diesel generators, and distributes various industrial and marine engines, as well as provides temporary power; and distributes professional woodworking equipment, and tooling and edging products, as well as provides associated services, such as blade sharpening and equipment maintenance services. This segment also distributes forklifts, BT warehousing equipment, konecranes heavy duty forklifts, container handling equipment, terminal tractors, batteries and chargers, industrial cleaning equipment, and truck mounted cranes. The enX Petrochemicals segment produces and markets oil lubricants and greases; and distributes plastics, polymers, rubber, and specialty chemicals. The enX Fleet segment provides leasing, fleet management, outsourcing solutions, maintenance, warranty management and vehicle tracking solutions. This segment also offers fleet management solutions for commercial vehicle fleet owners and logistics solutions. It has operations in South Africa, sub-Saharan Africa, the United Kingdom, and Ireland. The company was formerly known as Austro Group Limited and changed its name to enX Group Limited in January 2015. enX Group Limited was founded in 2007 and is based in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "1600",
        "website": "http://www.enxgroup.co.za",
        "full_time_employees": 2275
    },
    "GND.JO": {
        "short_name": "Grindrod Ltd",
        "long_name": "Grindrod Limited",
        "summary": "Grindrod Limited, through its subsidiaries, provides freight and logistics services in South Africa and internationally. The company operates through Port and Terminals, Logistics, and Group and Other segments. It engages in the road transportation of motor vehicles, petroleum products, and liquified gases; cross dock and warehousing, containerized cargo by rail and road, containerization of bulk commodities, road transportation of dry bulk commodities, and sale and leasing of new and used containers; and provision of depot services, as well as clearing and forwarding, and cross border facilitation services. The company also provides sea freight logistics services; ships agency, technical, maritime, marine and industrial engineering, cross border and project logistics, and container services; freight forwarding, customs brokerage, and related logistics services; and rail services, including consultancy, stock leasing and finance, and managing services. In addition, it offers international inbound and domestic leisure tourism services, as well as arranges conferences and events; operates ports and terminals; and provides stevedoring services comprising handling of bulk commodities, break bulk commodities, containers, and vehicles. Further, the company offers financial services comprising cash deposit management services; overdrafts, term loans and invoice discounting facilities, and mezzanine finance; originates and manages unlisted redeemable preference shares; issues notes; retail banking products and services; and property lending services. Additionally, it is involved in the private equity investment business. Grindrod Limited was founded in 1910 and is based in Durban, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4001",
        "website": "http://www.grindrod.co.za",
        "full_time_employees": null
    },
    "GNDP.JO": {
        "short_name": "Grindrod Ltd Pref",
        "long_name": "Grindrod Limited",
        "summary": "Grindrod Limited, through its subsidiaries, provides freight and logistics services in South Africa and internationally. The company operates through Port and Terminals, Logistics, and Group and Other segments. It engages in the road transportation of motor vehicles, petroleum products, and liquified gases; cross dock and warehousing, containerized cargo by rail and road, containerization of bulk commodities, road transportation of dry bulk commodities, and sale and leasing of new and used containers; and provision of depot services, as well as clearing and forwarding, and cross border facilitation services. The company also provides sea freight logistics services; ships agency, technical, maritime, marine and industrial engineering, cross border and project logistics, and container services; freight forwarding, customs brokerage, and related logistics services; and rail services, including consultancy, stock leasing and finance, and managing services. In addition, it offers international inbound and domestic leisure tourism services, as well as arranges conferences and events; operates ports and terminals; and provides stevedoring services comprising handling of bulk commodities, break bulk commodities, containers, and vehicles. Further, the company offers financial services comprising cash deposit management services; overdrafts, term loans and invoice discounting facilities, and mezzanine finance; originates and manages unlisted redeemable preference shares; issues notes; retail banking products and services; and property lending services. Additionally, it is involved in the private equity investment business. Grindrod Limited was founded in 1910 and is based in Durban, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4001",
        "website": "http://www.grindrod.co.za",
        "full_time_employees": null
    },
    "HCI.JO": {
        "short_name": "Hosken Cons Inv Ltd",
        "long_name": "Hosken Consolidated Investments Limited",
        "summary": "Hosken Consolidated Investments Limited, an investment holding company, operates in hotel and leisure, interactive gaming, media and broadcasting, transport, mining, and property businesses principally in South Africa. It owns and operates hotels and casinos; operates bingo centers and sites, gaming machines, and vslots; and provides transport services. The company is also involved in the mining of coal resources; oil and gas exploration activities; and operation of conference and exhibition, industrial, inner city housing, mixed use precincts, office, student accommodation, and retail properties. In addition, it engages in the textile and non-woven textile manufacturing, toy distribution, and property investment activities. Further, the company offers inrange, a ball tracking radar system and associated visualisation interfaces that hooks golfers with a data-driven experience at golf driving ranges; and IT professional services. Additionally, it operates private commercial free-to-air television channel. The company was incorporated in 1973 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8005",
        "website": "http://www.hci.co.za",
        "full_time_employees": null
    },
    "HDC.JO": {
        "short_name": "Hudaco Industries Ltd",
        "long_name": "Hudaco Industries Limited",
        "summary": "Hudaco Industries Limited imports and distributes automotive, industrial, and electrical consumable products primarily in the southern African region. It operates through two segments, Consumer-Related Products and Engineering Consumables. The Consumer-Related Products segment distributes clutch kits, automotive ignition leads, oil and hydraulic seals, wheels, brake and clutch hydraulics, mountings, bushes, hydraulic repair kits, cylinders, hoses, CV joints, wheel hubs, suspension components, and vehicle components to the automotive and industrial after-market; lead acid, solar batteries, chargers, and battery management equipment; power tools, marine engines, survey instruments, rivets, and fasteners; and intrusion detection, access control, fire detection, and surveillance/CCTV solutions, including IP/GSM network and support services. This segment also distributes professional mobile radio equipment and radio systems integrators; wireless networking, VoIP, and video products; and communication management software, solutions, and equipment. The Engineering Consumables segment manufactures and distributes hydraulic and pneumatic products; dragline hoses; conveyor drive pulleys; idlers; and ferrous and non-ferrous castings, as well as designs, services, and repairs systems. This segment also distributes diesel engines and spares, and support services; chains, seals, geared and electric motors, beltings, drivetrains, filtration solutions, kits and accessories, and industrial hoses; and electrical power transmission products, bearings, thermoplastic pipes and fittings, and steel. The company primarily serves wholesale and retail, automotive, manufacturing, mining, exports, security, alternative energy, construction, agricultural, and public sectors. Hudaco Industries Limited was founded in 1891 and is headquartered in Edenvale, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Edenvale",
        "zipcode": "1609",
        "website": "http://www.hudaco.co.za",
        "full_time_employees": 3587
    },
    "HPR.JO": {
        "short_name": "Hosken Pax Log and Rail",
        "long_name": "Hosken Passenger Logistics and Rail Limited",
        "summary": "Hosken Passenger Logistics and Rail Limited, an investment holding company, operates in the commuter transport sector. It operates buses for scheduled passenger services; and commuter and luxury coaches in the schools and tourism markets. The company was incorporated in 2015 and is based in Cape Town, South Africa. Hosken Passenger Logistics and Rail Limited is a subsidiary of Hosken Consolidated Investments Limited.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7460",
        "website": "http://www.hplr.co.za",
        "full_time_employees": null
    },
    "I5J.F": {
        "short_name": "INVICTA HLDGS  RC-,05",
        "long_name": "Invicta Holdings Limited",
        "summary": "Invicta Holdings Limited, an investment holding company, distributes engineering components and consumables, and provides technical services and solutions in South Africa, Singapore, and rest of Africa. It operates through three segments: Engineering Solutions Group, Capital Equipment Group, and Kian Ann Engineering. The company distributes engineering consumables, including bearings, seals and gaskets, power transmissions, material handling solutions, fasteners, geared and electric drives, and motor and tools; fluid technology products and solutions, such as hydraulic, pneumatic, filtration, and lubrication; and technical design, on-site installation, maintenance, breakdown, condition monitoring, as well as design engineering and failure analysis services, and belting products. It also distributes vibrating equipment; industrial gearbox units; tools and equipment, including personal protective equipment, lifting, and welding products; vibrator motors, and tensioning and suspension systems; and automotive components and solutions. In addition, the company imports, supplies, and distributes agricultural machinery, implements, and related spare parts; construction and mining equipment, such as crawler excavators, wheel loaders, wheel excavators, wheel excavators, mini-excavators, backhoe loaders, skid-steer loaders, crushing and screening equipment, ground-engaging tools, articulated dump trucks, hydraulic hammers, and turf related machinery; after-market replacement spare parts for agricultural machinery; heavy machinery parts and diesel engine components; and forklift trucks and equipment. Further, it holds properties; and involved in the financial and treasury activities. The company is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2001",
        "website": "http://www.invictaholdings.co.za",
        "full_time_employees": 4500
    },
    "IHLDY": {
        "short_name": "IMPERIAL LOGISTICS LTD",
        "long_name": "Imperial Logistics Limited",
        "summary": "Imperial Logistics Limited provides integrated market access and logistics solutions in Africa, Europe, and Internationally. It offers outsourced integrated freight management services, such as road, air, and ocean freight management services; contract logistics services, including warehousing, distribution, and synchronization management; and sourcing, warehousing, distribution, synchronisation, and transportation management services. The company also operates as the lead logistics provider. It serves primarily healthcare, consumer, automotive, chemicals, and industrial markets. The company was formerly known as Imperial Holdings Limited and changed its name to Imperial Logistics Limited in December 2018. The company is headquartered in Bedfordview, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2007",
        "website": "http://www.imperiallogistics.com",
        "full_time_employees": 25000
    },
    "IPL.JO": {
        "short_name": "Imperial Logistics Ltd",
        "long_name": "Imperial Logistics Limited",
        "summary": "Imperial Logistics Limited provides integrated market access and logistics solutions in Africa, Europe, and Internationally. It offers outsourced integrated freight management services, such as road, air, and ocean freight management services; contract logistics services, including warehousing, distribution, and synchronization management; and sourcing, warehousing, distribution, synchronisation, and transportation management services. The company also operates as the lead logistics provider. It serves primarily healthcare, consumer, automotive, chemicals, and industrial markets. The company was formerly known as Imperial Holdings Limited and changed its name to Imperial Logistics Limited in December 2018. The company is headquartered in Bedfordview, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2007",
        "website": "http://www.imperiallogistics.com",
        "full_time_employees": 25000
    },
    "ISB.JO": {
        "short_name": "Insimbi Ind Hldgs Ltd",
        "long_name": "Insimbi Industrial Holdings Limited",
        "summary": "Insimbi Industrial Holdings Limited provides ferrous and non-ferrous alloys, and refractory materials for the steel, aluminum, cement, foundry, plastics, paper, and pulp industries. It operates through four segments: Non-Ferrous, Ferrous, Refractory, and Plastics. The Non-Ferrous segment supplies non-ferrous recycled metals for the automotive, heavy aluminum, and powder coating industries. The Ferrous segment offers steel and polypropylene fibers to the welding and optical industries, as well as various ferrous-based recycled metals; and supplies raw materials for the steel industry. The Refractory segment provides refractory requirements of steel and cement industries; and supplies industrial heat resistant textiles. The Plastics segment offers plastic packaging products for chemical, agricultural, and food industries. It also exports its products. The company operates in Africa, Asia, Australia, Europe, North and South America, and South Africa. Insimbi Industrial Holdings Limited was founded in 1970 and is based in Germiston, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Germiston",
        "zipcode": "1407",
        "website": "http://insimbi-group.co.za",
        "full_time_employees": 701
    },
    "IUC1.F": {
        "short_name": "IMPERIAL LOGIS.NEW RC-,04",
        "long_name": "Imperial Logistics Limited",
        "summary": "Imperial Logistics Limited provides integrated market access and logistics solutions in Africa, Europe, and Internationally. It offers outsourced integrated freight management services, such as road, air, and ocean freight management services; contract logistics services, including warehousing, distribution, and synchronization management; and sourcing, warehousing, distribution, synchronisation, and transportation management services. The company also operates as the lead logistics provider. It serves primarily healthcare, consumer, automotive, chemicals, and industrial markets. The company was formerly known as Imperial Holdings Limited and changed its name to Imperial Logistics Limited in December 2018. The company is headquartered in Bedfordview, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2007",
        "website": "http://www.imperiallogistics.com",
        "full_time_employees": 25000
    },
    "IVT.JO": {
        "short_name": "Invicta Holdings Ltd",
        "long_name": "Invicta Holdings Limited",
        "summary": "Invicta Holdings Limited, an investment holding company, distributes engineering components and consumables, and provides technical services and solutions in South Africa, Singapore, and rest of Africa. It operates through three segments: Engineering Solutions Group, Capital Equipment Group, and Kian Ann Engineering. The company distributes engineering consumables, including bearings, seals and gaskets, power transmissions, material handling solutions, fasteners, geared and electric drives, and motor and tools; fluid technology products and solutions, such as hydraulic, pneumatic, filtration, and lubrication; and technical design, on-site installation, maintenance, breakdown, condition monitoring, as well as design engineering and failure analysis services, and belting products. It also distributes vibrating equipment; industrial gearbox units; tools and equipment, including personal protective equipment, lifting, and welding products; vibrator motors, and tensioning and suspension systems; and automotive components and solutions. In addition, the company imports, supplies, and distributes agricultural machinery, implements, and related spare parts; construction and mining equipment, such as crawler excavators, wheel loaders, wheel excavators, wheel excavators, mini-excavators, backhoe loaders, skid-steer loaders, crushing and screening equipment, ground-engaging tools, articulated dump trucks, hydraulic hammers, and turf related machinery; after-market replacement spare parts for agricultural machinery; heavy machinery parts and diesel engine components; and forklift trucks and equipment. Further, it holds properties; and involved in the financial and treasury activities. The company is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2001",
        "website": "http://www.invictaholdings.co.za",
        "full_time_employees": 4500
    },
    "IVTP.JO": {
        "short_name": "Invicta Hldgs Ltd pref",
        "long_name": "Invicta Holdings Limited",
        "summary": "Invicta Holdings Limited, an investment holding company, distributes engineering components and consumables, and provides technical services and solutions in South Africa, Singapore, and rest of Africa. It operates through three segments: Engineering Solutions Group, Capital Equipment Group, and Kian Ann Engineering. The company distributes engineering consumables, including bearings, seals and gaskets, power transmissions, material handling solutions, fasteners, geared and electric drives, and motor and tools; fluid technology products and solutions, such as hydraulic, pneumatic, filtration, and lubrication; and technical design, on-site installation, maintenance, breakdown, condition monitoring, as well as design engineering and failure analysis services, and belting products. It also distributes vibrating equipment; industrial gearbox units; tools and equipment, including personal protective equipment, lifting, and welding products; vibrator motors, and tensioning and suspension systems; and automotive components and solutions. In addition, the company imports, supplies, and distributes agricultural machinery, implements, and related spare parts; construction and mining equipment, such as crawler excavators, wheel loaders, wheel excavators, wheel excavators, mini-excavators, backhoe loaders, skid-steer loaders, crushing and screening equipment, ground-engaging tools, articulated dump trucks, hydraulic hammers, and turf related machinery; after-market replacement spare parts for agricultural machinery; heavy machinery parts and diesel engine components; and forklift trucks and equipment. Further, it holds properties; and involved in the financial and treasury activities. The company is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2001",
        "website": "http://www.invictaholdings.co.za",
        "full_time_employees": 4500
    },
    "JSC.JO": {
        "short_name": "Jasco Electron Hldgs Ltd",
        "long_name": "Jasco Electronics Holdings Limited",
        "summary": "Jasco Electronics Holdings Limited provides solutions in the areas of telecommunications, information technology, energy, and industry in South Africa and internationally. The company offers contact center solutions; unified communications solutions, including telephony, messaging systems, conferencing, analytics and reporting, and integration; and IT infrastructure solutions, such as data networking, connectivity, intelligent systems, professional, and managed services. It also engages in the design, installation, and maintenance of smart technology solutions for security and fire applications; and provision of smart building solutions covering rooftop management, telecommunications, power, renewable energy, security, fire, IT infrastructure, and building management. In addition, the company offers a range of infrastructure products and services for access, transmission, and operational support systems and outside plant, as well as rents space on its existing infrastructure to telecommunications operators and service providers; and data center services. Further, it designs, builds, installs, integrates, and maintains video and audio solutions for broadcasters, as well as production and post-production houses; provides power solutions for UPS, generators, transformers, voltage stabilizers, and surge protection and monitoring equipment; and offers photovoltaic energy production solutions, as well as integrated water network management and event management solutions. Additionally, the company manufactures components for plastic injection moldings and metal pressings, as well as manufactures and assembles wire harness products for the domestic appliance industry; offers paint and print solutions for plastic molded components; provides electrical plugs, adaptors, and extensions under the Snapper brand; and manufactures salt water chlorination systems. Jasco Electronics Holdings Limited was founded in 1976 and is headquartered in Midrand, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Midrand",
        "zipcode": "1685",
        "website": "http://www.jasco.co.za",
        "full_time_employees": 670
    },
    "KAP.JO": {
        "short_name": "KAP Industrial Hldgs Ltd",
        "long_name": "KAP Industrial Holdings Limited",
        "summary": "KAP Industrial Holdings Limited engages in the contractual logistics, passenger transport, timber, chemical, automotive components, and bedding businesses in South Africa, rest of Africa, Europe, the Middle East, Asia, Australasia, the Americas. It operates through Diversified Industrial, Diversified chemical, and Diversified Logistics segments. The Diversified Industrial segment manufactures and sells forestry and timber products, such as sawlogs, poles, pulpwood, structural timber, particleboard and medium-density fiberboard products, foils, worktops, melamine face boards, gloss boards, formaldehyde and UF resin, and impregnated paper; and bedding products comprising mattresses and base sets, foam and related products, mattress ticking, and non-woven spunbond products. This segment also offers automotive components, including textile-based automotive acoustic and soft trim components; underfloor systems for thermal and impact protection and aluminum heatshields; overlay carpets/loose-lay vehicle mats and tonneau covers; polyurethane flexible foam, molded seats, conventional and pour-in-place headrests, foam pads, side bolsters, and armrests; polyester and polyether flexible, semi-rigid, and rigid thermoformable foams; acoustically engineered tufted automotive carpets; and automotive accessories made from mild and stainless steel. The Diversified Chemical segment manufactures polyethylene terephthalate, high-density polyethylene, and polypropylene. The Diversified Logistics segment designs, implements, and manages supply chain, warehousing, and logistics services to the petroleum, chemical, food, agriculture, mining, cement, and general freight and warehousing sectors; and provides personnel, tourist, intercity, and commuter transport services. The company is headquartered in Stellenbosch, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.kap.co.za",
        "full_time_employees": null
    },
    "LDYA.F": {
        "short_name": "MURRAY ROBERTS  O.N.",
        "long_name": "Murray & Roberts Holdings Limited",
        "summary": "Murray & Roberts Holdings Limited, an investment holding company, operates in the mining, energy, resources, infrastructure, power, industrial, and water markets. It offers services for energy, resources, and infrastructure platforms, such as engineering, construction, commission, operations, and maintenance, as well as engineering, procurement, and construction (EPC) services for metals and minerals, and infrastructure markets in Australia, Scotland, South Korea, and the United States. The company also provides services for mining platforms, including feasibility studies, specialist engineering, vertical and decline shaft construction, mine development, and specialist mining services, such as raise boring and grouting, as well as contract mining for projects in Australia, Canada, Indonesia, Mongolia, South Africa, the United States, Mexico, Chile, and Zambia. In addition, it offers services to power, industrial, and water platforms consisting of feasibility studies, detailed engineering, procurement, construction, commissioning, and repairs and maintenance work, as well as provides services to other markets, including petrochemicals, metals and minerals, and paper and pulp. Murray & Roberts Holdings Limited was founded in 1902 and is headquartered in Bedfordview, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2007",
        "website": "http://www.murrob.com",
        "full_time_employees": 9049
    },
    "MDI.JO": {
        "short_name": "Master Drilling Grp Ltd",
        "long_name": "Master Drilling Group Limited",
        "summary": "Master Drilling Group Limited, an investment holding company, provides specialized drilling services to blue chip major and mid-tier companies in the mining, civil engineering, construction, and hydro-electric power sectors. The company offers rock boring services, including raise, horizontal raise, slot, tunnel, blind hole, and reef boring; slim drilling services, such as blast hole, de-watering, core, percussion, reverse circulation, and mud and air rotary drilling; and support services, which include directional drilling, stage and remote-operated shaft support, piling, scan mobile, analyzing ore, and core yard management. It operates in Africa, Central and North America, South America, and internationally. Master Drilling Group Limited was founded in 1986 and is based in Fochville, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Fochville",
        "zipcode": "2515",
        "website": "http://www.masterdrilling.com",
        "full_time_employees": null
    },
    "MFL.JO": {
        "short_name": "Metrofile Holdings Ltd",
        "long_name": "Metrofile Holdings Limited",
        "summary": "Metrofile Holdings Limited, an investment holding company, provides records and information management services in South Africa, Botswana, Kenya, Mozambique, and the Middle East. The company provides records storage and management services, including archive, active, hosting, and stationery services; backup storage services comprising vault and managed services; records management consultancy and software integration; document shredding; and image processing services, such as digital and analogue services. It also offers business process outsourcing services, which includes proof of delivery solutions, track and trace management, sensitive information protection, procurement tracking solutions, claims processing, human resource services, electronic exam marking system, and business continuity and work area recovery service. In addition, the company provides filing solutions, including office filing stationery, archive filing boxes, bulk filing solutions, filing cabinets, shelving and steel products, and scanners, as well as software solutions; and ScreenWell, a digital solution to capture, track, and manage daily temperature screening, health questionnaires, and workplace policy compliance for returning staff and visitors. It serves clients in financial services, healthcare, mining, public, and retail sectors. The company was formerly known as MGX Holdings Limited and changed its name to Metrofile Holdings Limited in February 2005. Metrofile Holdings Limited was founded in 1983 and is based in Illovo, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Illovo",
        "zipcode": "2196",
        "website": "http://www.metrofilegroup.com",
        "full_time_employees": 1461
    },
    "MUR.JO": {
        "short_name": "Murray & Roberts Hldgs",
        "long_name": "Murray & Roberts Holdings Limited",
        "summary": "Murray & Roberts Holdings Limited, an investment holding company, operates in the mining, energy, resources, infrastructure, power, industrial, and water markets. It offers services for energy, resources, and infrastructure platforms, such as engineering, construction, commission, operations, and maintenance, as well as engineering, procurement, and construction (EPC) services for metals and minerals, and infrastructure markets in Australia, Scotland, South Korea, and the United States. The company also provides services for mining platforms, including feasibility studies, specialist engineering, vertical and decline shaft construction, mine development, and specialist mining services, such as raise boring and grouting, as well as contract mining for projects in Australia, Canada, Indonesia, Mongolia, South Africa, the United States, Mexico, Chile, and Zambia. In addition, it offers services to power, industrial, and water platforms consisting of feasibility studies, detailed engineering, procurement, construction, commissioning, and repairs and maintenance work, as well as provides services to other markets, including petrochemicals, metals and minerals, and paper and pulp. Murray & Roberts Holdings Limited was founded in 1902 and is headquartered in Bedfordview, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bedfordview",
        "zipcode": "2007",
        "website": "http://www.murrob.com",
        "full_time_employees": 9049
    },
    "N09.F": {
        "short_name": "NOVUS HOLDINGS LTD",
        "long_name": "Novus Holdings Limited",
        "summary": "Novus Holdings Limited engages in the printing and manufacturing businesses in South Africa and internationally. It operates through three segments: Printing, Packaging, and Other. The company offers gravure, heatset, coldset, sheet-fed, and security and digital printing services. It prints books and directories, magazines, newspapers, leaflets, flyers, newsletters, textbooks, workbooks, examination papers, answer books, and retail and promotional catalogues, as well as security materials, such as ballot papers, voter registration forms, census forms, and other confidential materials. The company is also involved in the printing of wet-glue, wrap-around, and pressure sensitive labels; and manufacture and supply of flexible packaging solutions, such as boutique/retail, security, and carrier bags, as well as form, fill, and seal bags for FMCG, pet, chemical, retail, and security industries. In addition, it operates a training institution that offers a range of technical, life skills, management, leadership, and IT and systems courses and programs. The company was incorporated in 2008 and is headquartered in Cape Town, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7441",
        "website": "http://www.novus.holdings",
        "full_time_employees": null
    },
    "NQL1.F": {
        "short_name": "BIDVEST GROUP LTD. RC-,05",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "full_time_employees": null
    },
    "NVS.JO": {
        "short_name": "Novus Holdings Limited",
        "long_name": "Novus Holdings Limited",
        "summary": "Novus Holdings Limited engages in the printing and manufacturing businesses in South Africa and internationally. It operates through three segments: Printing, Packaging, and Other. The company offers gravure, heatset, coldset, sheet-fed, and security and digital printing services. It prints books and directories, magazines, newspapers, leaflets, flyers, newsletters, textbooks, workbooks, examination papers, answer books, and retail and promotional catalogues, as well as security materials, such as ballot papers, voter registration forms, census forms, and other confidential materials. The company is also involved in the printing of wet-glue, wrap-around, and pressure sensitive labels; and manufacture and supply of flexible packaging solutions, such as boutique/retail, security, and carrier bags, as well as form, fill, and seal bags for FMCG, pet, chemical, retail, and security industries. In addition, it operates a training institution that offers a range of technical, life skills, management, leadership, and IT and systems courses and programs. The company was incorporated in 2008 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7441",
        "website": "http://www.novus.holdings",
        "full_time_employees": null
    },
    "OHZ.F": {
        "short_name": "OMNIA HLDGS LTD  O.N.",
        "long_name": "Omnia Holdings Limited",
        "summary": "Omnia Holdings Limited, through its subsidiaries, provides specialized chemical products and services used in the agriculture, mining, and chemical industries in South Africa and internationally. Its Agriculture division produces and trades in granular, liquid, and specialty fertilizers, as well as humates, and value-added services and solutions to a range of customer base, including commercial and small-scale farmers, co-operatives, and other corporate clients; and researches and develops, produces, distributes, and sells a range of patented agriculture biological products that include bio stimulants, adjuvants, crop protection products, liquid foliar fertilizers, and soil conditioners. This division is also involved in the wholesale and trading of agriculture commodities. The company's Mining division provides bulk emulsion and blended bulk explosives for the opencast mining industry; produces electronic delay detonators and shocktube initiating systems; and supplies explosive boosters. This division also manufactures packaged explosives for underground mining and specialized surface blasting operations; and offers specialized chemicals and chemical-based solutions, as well as logistical and specialized value-add services. Its Chemicals division manufactures and distributes specialty, functional, and effect chemicals, as well as polymers, lubricant additives, base oils, and process oils and chemicals. This division also manufactures and distributes chemicals, and provides technical support for the treatment of potable water. Omnia Holdings Limited was founded in 1953 and is based in Bryanston, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2021",
        "website": "http://www.omnia.co.za",
        "full_time_employees": 4426
    },
    "OLG.JO": {
        "short_name": "Onelogix Group Ltd",
        "long_name": "OneLogix Group Limited",
        "summary": "OneLogix Group Limited, together with its subsidiaries, provides logistics and related services in South Africa. It operates through three segments: Abnormal Logistics, Primary Products Logistics, and Other. The company offers project and abnormal freight logistics; local and cross-border auto-logistics; logistics services for solvents, acids, food grade products, liquid petroleum, gas, cryogenics, and dry bulk products; general freight and commodities movement services; refrigerated logistics services for agricultural products, such as fruit and vegetable market; and transport vehicles, including new commercial vehicles through a fleet of 300 trucks and trailers. It also provides import and export warehouse handling and clearing and forwarding services; distributes agricultural inputs and final products; repairs passenger vehicles, commercial vehicles, and structural chassis; and rebuilds cabs, as well as offers spray painting services. In addition, the company offers logistics related accounting software. OneLogix Group Limited was founded in 2000 and is headquartered in Kempton Park, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Kempton Park",
        "zipcode": "1619",
        "website": "http://www.onelogix.com",
        "full_time_employees": null
    },
    "OMN.JO": {
        "short_name": "Omnia Holdings Ltd",
        "long_name": "Omnia Holdings Limited",
        "summary": "Omnia Holdings Limited, through its subsidiaries, provides specialized chemical products and services used in the agriculture, mining, and chemical industries in South Africa and internationally. Its Agriculture division produces and trades in granular, liquid, and specialty fertilizers, as well as humates, and value-added services and solutions to a range of customer base, including commercial and small-scale farmers, co-operatives, and other corporate clients; and researches and develops, produces, distributes, and sells a range of patented agriculture biological products that include bio stimulants, adjuvants, crop protection products, liquid foliar fertilizers, and soil conditioners. This division is also involved in the wholesale and trading of agriculture commodities. The company's Mining division provides bulk emulsion and blended bulk explosives for the opencast mining industry; produces electronic delay detonators and shocktube initiating systems; and supplies explosive boosters. This division also manufactures packaged explosives for underground mining and specialized surface blasting operations; and offers specialized chemicals and chemical-based solutions, as well as logistical and specialized value-add services. Its Chemicals division manufactures and distributes specialty, functional, and effect chemicals, as well as polymers, lubricant additives, base oils, and process oils and chemicals. This division also manufactures and distributes chemicals, and provides technical support for the treatment of potable water. Omnia Holdings Limited was founded in 1953 and is based in Bryanston, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2021",
        "website": "http://www.omnia.co.za",
        "full_time_employees": 4426
    },
    "PMV.JO": {
        "short_name": "Primeserv Group Ltd",
        "long_name": "Primeserv Group Limited",
        "summary": "Primeserv Group Limited, an investment holding company, provides integrated business support services in South Africa. It operates through two segments, Staffing Services, and Training and Consulting Services. The company offers staffing services, such as permanent recruitment, temporary recruitment, temporary employment, payroll, functional outsourcing, business process outsourcing, time and attendance system, customized management information reporting, HR and IR, mega-project, wellness programs, and lifestyle and employee benefit services, as well as productivity services and solutions. It also provides training and consulting services that include technical training, corporate training, and human capital consulting services. In addition, the company offers accredited training and skills development, and learnership services, as well as operates skills training centers. It serves a range of industries and sectors, including agriculture, automotive, banking, building and construction, design and draughting, drivers and transportation, engineering and fabrication, facilities management, financial and insurance, food production, FMCG, government services, harbors and railways, hospital, nursing, medical, logistics and distribution centers, mechanical, merchandising, mining, paper and pulp, petrochemical, pharmaceutical, power generation, retail and wholesale, secretarial and office support, tourism and hospitality, telecoms, telemarketing and call centers, warehousing, and waste management. The company is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.primeserv.co.za",
        "full_time_employees": null
    },
    "RBX.JO": {
        "short_name": "Raubex Group Ltd",
        "long_name": "Raubex Group Limited",
        "summary": "Raubex Group Limited operates in the construction industry in South Africa and internationally. The company operates in three segments: Materials, Roads and Earthworks, and Infrastructure. The Materials segment operates commercial quarry, which supplies aggregates; contract crushing; and materials handling and processing services for the mining industry. The Roads and Earthworks segment is involved in the road construction and earthworks, and surfacing and rehabilitation activities, including the manufacturing and laying of asphalt, chip and spray, surface dressing, enrichments, and slurry seals, as well as the manufacture and distribution of value added bituminous products. The Infrastructure segment undertakes infrastructure projects, such as renewable energy, rail, telecommunications, pipeline construction, housing infrastructure, and commercial building refurbishment and construction projects. Raubex Group Limited was founded in 1974 and is headquartered in Bloemfontein, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bloemfontein",
        "zipcode": "9300",
        "website": "http://www.raubex.com",
        "full_time_employees": 4185
    },
    "REU1.F": {
        "short_name": "REUNERT LTD O.N.",
        "long_name": "Reunert Limited",
        "summary": "Reunert Limited operates in the fields of electrical engineering, information communication technologies (ICT), and applied electronics in South Africa, Australia, Lesotho, South Asia, the United States, and Zambia. The company's Electrical Engineering segment designs, manufactures, installs, and maintains power cables; copper and optical fiber telecommunications cables and cable ducts; low-voltage electrical distribution, protection, and control equipment; copper casted rods; and overhead aluminum conductors. It serves mining, utilities, municipalities, government and state-owned entities (SOEs), and building industries. Its ICT segment provides multi-functional printer devices, managed print software and solutions, production printing devices, document management solutions, smart solutions, surveillance and access controls, and telephony and connectivity solutions; and asset-backed financial solutions. This segment also provides voice, data, and hosted services through fixed-line and wireless access circuits; cloud-based virtual private branch exchange services; network telecommunications services; converged enterprise network and communications solutions; and hosted call recording, geographic number portability, and business Internet access products. It serves corporate and retail customers, small and medium-sized enterprises, and government and SOEs. The company's Applied Electronics segment offers search and tracking radar systems and subsystems; secure communication systems; secure network-centric solutions; cryptographic products and solutions; electronic components; remote controlled stabilized weapons platforms; energy engineering and storage solutions; and robotics systems. It serves corporates, municipalities, governments, SOEs, local and international defense forces, and mining houses. The company was founded in 1888 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://www.reunert.com",
        "full_time_employees": null
    },
    "RLO.JO": {
        "short_name": "Reunert Ltd",
        "long_name": "Reunert Limited",
        "summary": "Reunert Limited operates in the fields of electrical engineering, information communication technologies (ICT), and applied electronics in South Africa, Australia, Lesotho, South Asia, the United States, and Zambia. The company's Electrical Engineering segment designs, manufactures, installs, and maintains power cables; copper and optical fiber telecommunications cables and cable ducts; low-voltage electrical distribution, protection, and control equipment; copper casted rods; and overhead aluminum conductors. It serves mining, utilities, municipalities, government and state-owned entities (SOEs), and building industries. Its ICT segment provides multi-functional printer devices, managed print software and solutions, production printing devices, document management solutions, smart solutions, surveillance and access controls, and telephony and connectivity solutions; and asset-backed financial solutions. This segment also provides voice, data, and hosted services through fixed-line and wireless access circuits; cloud-based virtual private branch exchange services; network telecommunications services; converged enterprise network and communications solutions; and hosted call recording, geographic number portability, and business Internet access products. It serves corporate and retail customers, small and medium-sized enterprises, and government and SOEs. The company's Applied Electronics segment offers search and tracking radar systems and subsystems; secure communication systems; secure network-centric solutions; cryptographic products and solutions; electronic components; remote controlled stabilized weapons platforms; energy engineering and storage solutions; and robotics systems. It serves corporates, municipalities, governments, SOEs, local and international defense forces, and mining houses. The company was founded in 1888 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://www.reunert.com",
        "full_time_employees": null
    },
    "RNRTY": {
        "short_name": "REUNERT",
        "long_name": "Reunert Limited",
        "summary": "Reunert Limited operates in the fields of electrical engineering, information communication technologies (ICT), and applied electronics in South Africa, Australia, Lesotho, South Asia, the United States, and Zambia. The company's Electrical Engineering segment designs, manufactures, installs, and maintains power cables; copper and optical fiber telecommunications cables and cable ducts; low-voltage electrical distribution, protection, and control equipment; copper casted rods; and overhead aluminum conductors. It serves mining, utilities, municipalities, government and state-owned entities (SOEs), and building industries. Its ICT segment provides multi-functional printer devices, managed print software and solutions, production printing devices, document management solutions, smart solutions, surveillance and access controls, and telephony and connectivity solutions; and asset-backed financial solutions. This segment also provides voice, data, and hosted services through fixed-line and wireless access circuits; cloud-based virtual private branch exchange services; network telecommunications services; converged enterprise network and communications solutions; and hosted call recording, geographic number portability, and business Internet access products. It serves corporate and retail customers, small and medium-sized enterprises, and government and SOEs. The company's Applied Electronics segment offers search and tracking radar systems and subsystems; secure communication systems; secure network-centric solutions; cryptographic products and solutions; electronic components; remote controlled stabilized weapons platforms; energy engineering and storage solutions; and robotics systems. It serves corporates, municipalities, governments, SOEs, local and international defense forces, and mining houses. The company was founded in 1888 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://www.reunert.com",
        "full_time_employees": null
    },
    "S8G1.F": {
        "short_name": "SUPER GROUP LTD  RC 1",
        "long_name": "Super Group Limited",
        "summary": "Super Group Limited engages in the supply chain management, dealership, and fleet management activities in South Africa, sub-Saharan Africa, Australia, Europe, New Zealand, and the United Kingdom. The company operates through seven segments: Supply Chain Africa, Supply Chain Europe, Fleet Africa, SG Fleet, Dealerships SA, Dealerships UK, and Services. It offers supply chain services, including supply chain optimization, consulting, technology, procurement, third party distribution, transport, multi-temperature controlled product distribution, bulk raw material transportation, warehousing, inbound and outbound freight forwarding, customs clearing, import and export consolidation, international airfreight, and bonded cross-border transportation to the automotive, construction, food and beverage, manufacturing, paper and pulp, petrochemical, mining, pharmaceutical, consumer goods, and retail industries. The company also provides fleet management solutions for specific transport and vehicle management needs of various customers; and various value-added services, such as driver, fuel, and tire management; accident and insurance administration; fleet optimization and route planning; vehicle tracking and recovery; and access to its call center services. In addition, it offers a range of leasing and salary packaging solutions to corporate and government customers; and contract hire solutions to small and large enterprises, as well as to public sector. Further, the company provides new and used passenger cars and light commercial vehicles, as well as finance, insurance, vehicle servicing, and parts through its motor dealerships. As of June 30, 2020, it operated 44 franchised motor dealerships in South Africa and 28 franchised motor dealerships in the United Kingdom. Super Group Limited was incorporated in 1943 and is headquartered in Sandton, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.supergroup.co.za",
        "full_time_employees": null
    },
    "SNV.JO": {
        "short_name": "Santova Logistics Ltd",
        "long_name": "Santova Limited",
        "summary": "Santova Limited provides logistics solutions in Africa, the Asia Pacific, the United Kingdom, and Europe. It operates through Logistics Services and Financial Services segments. The company offers statutory solutions, including customs and excise clearing and consultation, disbursement funding, bonded warehousing and in-bond transit management, and maritime law consultancy solutions; transit solutions, such as international freight forwarding, express courier, intermodal transport, and vessel chartering solutions; and warehousing and distribution solutions comprising storage, pick and pack, kitting, transport planning, and transport management solutions. It also provides project and specialized out of gauge cargo management services; and value added services that include product quality inspections, port supervision and wharf inspection services, and groupage, and consolidation and deconsolidation services, as well as price tagging, packaging, and labelling services. In addition, the company offers supply chain solutions; international insurance products; marine insurance products, which comprise cargo, transit cover, stock throughputs, and strikes and war risks insurance products; and general insurance products, including business and personal assets, indemnity, motor, liability, specialized, financial, and engineering and construction coverages. Further, it provides door-to-door courier services; client sourcing and procurement management solutions; and information technology solutions for supply chain. The company is headquartered in Durban, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4319",
        "website": "http://www.santova.com",
        "full_time_employees": 319
    },
    "SOH.JO": {
        "short_name": "South Ocean Holdings Ltd",
        "long_name": "South Ocean Holdings Limited",
        "summary": "South Ocean Holdings Limited, an investment holding company, manufactures and distributes electric wires in South Africa. The company operates through two segments, Electrical Cable Manufacturing, and Property Investments. It offers bare copper earth wires, general purpose house wires, flat-twin and earth cables, surface wiring, twin illumination cables, cabtyre, single core flex, solid panel wire, flex power, ripcord, mains cord, submersible pump cables, nitrile trailing cables, PVC nitrile welding cables, flame retardant armoured cables, low halogen armoured cables, armoured cables, single core double PVC cables, single core double PVC AWA PVC cables, aluminium conductors, aluminium conductor steel reinforced, low-voltage aerial bundle conductors, and conduit pipes. In addition, it invests in properties. The company sells its products to electrical wholesalers and distributors. South Ocean Holdings Limited was founded in 1989 and is headquartered in Alrode, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Alrode",
        "zipcode": "1451",
        "website": "http://www.southoceanholdings.co.za",
        "full_time_employees": 473
    },
    "SPG.JO": {
        "short_name": "Super Group Ltd",
        "long_name": "Super Group Limited",
        "summary": "Super Group Limited engages in the supply chain management, dealership, and fleet management activities in South Africa, sub-Saharan Africa, Australia, Europe, New Zealand, and the United Kingdom. The company operates through seven segments: Supply Chain Africa, Supply Chain Europe, Fleet Africa, SG Fleet, Dealerships SA, Dealerships UK, and Services. It offers supply chain services, including supply chain optimization, consulting, technology, procurement, third party distribution, transport, multi-temperature controlled product distribution, bulk raw material transportation, warehousing, inbound and outbound freight forwarding, customs clearing, import and export consolidation, international airfreight, and bonded cross-border transportation to the automotive, construction, food and beverage, manufacturing, paper and pulp, petrochemical, mining, pharmaceutical, consumer goods, and retail industries. The company also provides fleet management solutions for specific transport and vehicle management needs of various customers; and various value-added services, such as driver, fuel, and tire management; accident and insurance administration; fleet optimization and route planning; vehicle tracking and recovery; and access to its call center services. In addition, it offers a range of leasing and salary packaging solutions to corporate and government customers; and contract hire solutions to small and large enterprises, as well as to public sector. Further, the company provides new and used passenger cars and light commercial vehicles, as well as finance, insurance, vehicle servicing, and parts through its motor dealerships. As of June 30, 2020, it operated 44 franchised motor dealerships in South Africa and 28 franchised motor dealerships in the United Kingdom. Super Group Limited was incorporated in 1943 and is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.supergroup.co.za",
        "full_time_employees": null
    },
    "SSK.JO": {
        "short_name": "Stefanuti Stck Hldgs Ltd",
        "long_name": "Stefanutti Stocks Holdings Limited",
        "summary": "SStefanutti Stocks Holdings Limited operates as a construction company in South Africa, sub-Saharan Africa, and the United Arab Emirates. It operates through Construction & Mining, Building, Mechanical & Electrical, and Other segments. The Construction & Mining segment constructs roads, terraces for new developments, mining infrastructure and rehabilitation, bulk pipelines, and mine residue disposal facilities, as well as provides fiber optic cable trenching, open-pit contract mining, and municipal services. This segment also undertakes civil engineering and structural concrete construction, as well as geotechnical and marine projects, including general and specialized concrete construction for infrastructure, mining, and industrial markets. The Building segment constructs commercial, industrial, residential, and leisure buildings, including residential developments for mining and industrial companies, as well as low-cost and affordable housing for the public sector. The Mechanical and Electrical segment undertakes mechanical and electrical installation and construction works. Stefanutti Stocks Holdings Limited was founded in 1971 and is based in Kempton Park, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Kempton Park",
        "zipcode": "1619",
        "website": "http://www.stefanuttistocks.com",
        "full_time_employees": null
    },
    "TRE.JO": {
        "short_name": "Trencor Ltd",
        "long_name": "Trencor Limited",
        "summary": "Trencor Limited, an investment holding company, owns, leases, manages, and trades in dry freight, tank, and refrigerated marine cargo containers to transportation and other companies worldwide. Trencor Limited was founded in 1929 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8001",
        "website": "http://www.trencor.net",
        "full_time_employees": 6
    },
    "TRL.JO": {
        "short_name": "Trellidor Hldgs Ltd",
        "long_name": "Trellidor Holdings Limited",
        "summary": "Trellidor Holdings Limited manufactures and distributes security gates and window burglar proofing products. The company offers retractable security gates, security shutters, fixed burglar bars, burglar and clear guards, roller style shutters, cottage guards, and polycarbonate bar products for doors, windows, patios, safe rooms, offices, and estates, as well as retail properties. It also provides roller blinds, venetian blinds, vertical blinds, woven blinds, and shutters; and cornices, skirting, ceiling roses, and wall panels. It sells its products through a network of franchises. The company was formerly known as Trellicor Holding Proprietary Limited and changed its name to Trellidor Holdings Limited in September 2015. Trellidor Holdings Limited was incorporated in 1970 and is headquartered in Durban, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Durban",
        "zipcode": "4016",
        "website": "http://www.trellidor.co.za",
        "full_time_employees": null
    },
    "UG8K.F": {
        "short_name": "AVENG LTD.  RC-,05",
        "long_name": "Aveng Limited",
        "summary": "Aveng Limited, together with its subsidiaries, engages in the construction and engineering, and mining businesses worldwide. The company operates as an engineering, construction, building, and maintenance contractor for the building, infrastructure, and resource markets focusing on tunnel and pipeline, railway infrastructure, marine and mechanical, industrial building, oil and gas, and mining and mineral projects. It also provides open cut and underground mining services. Aveng Limited is based in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2076",
        "website": "http://aveng.co.za",
        "full_time_employees": 9982
    },
    "VLE.JO": {
        "short_name": "Value Group Ltd",
        "long_name": "Value Group Limited",
        "summary": "Value Group Limited, through its subsidiaries, provides supply chain solutions in South Africa. It operates through General Distribution, Truck Rental and Other, and Retail Logistics segments. The company offers distribution services, including express courier, breakbulk, retail delivery, DC delivery, front door delivery, home delivery, informal trade, forecourts, dangerous goods, over-border, cross-border, and reverse logistics services; and warehousing services, such as dedicated, multi-principal, transshipment, bonded, dangerous goods, managed solution, and value added services. It is also involved in the fleet management; materials handling and commercial vehicle rental and leasing; clearing and forwarding activities; and wholesale of various fast moving consumer goods to the convenience, formal, and informal sectors, which primarily includes independent traders, fuel forecourts, and small retailers. In addition, the company offers import and export services, such as international courier, container haulage, and intermodal services; and materials handling services that include rentals, FMLs, outright purchases, repairs and maintenance, spares accessories, and tires; transport services, which include truck rental, refrigerated fleet, film fleet, mine spec, FML, linehaul, and dedicated distribution services; and truck, trailer, and forklift repairs and maintenance services, as well as panel beating and branding services. It serves automotive, electronics, chemical, textile, packaging, mining, construction, telecommunications, and pharmaceutical industries. Value Group Limited was founded in 1981 and is headquartered in Isando, South Africa. Value Group Limited is a subsidiary of Lougot Property Investments (Pty) Ltd.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Isando",
        "zipcode": "1600",
        "website": "http://www.value.co.za",
        "full_time_employees": 3634
    },
    "WBO.JO": {
        "short_name": "Wilson Bayly Hlm-Ovc Ltd",
        "long_name": "Wilson Bayly Holmes-Ovcon Limited",
        "summary": "Wilson Bayly Holmes-Ovcon Limited engages in civil engineering and building construction activities in Africa, Australia, and the United Kingdom. It operates through six segments: Building and Civil Engineering, Roads and Earthworks, Australia, the United Kingdom, Property Developments, and Construction Materials. The company constructs retail shopping centres, commercial buildings, hotels, hospitals, and residential apartments primarily for the private sector, as well as civil engineering related infrastructure for the mining, industrial, energy, and oil and gas sectors. It also undertakes roads and earthworks, such as water and gas pipelines, and other infrastructure projects; retail, residential, and commercial building projects for the private building sector, as well as various engineering disciplines servicing the road and mining sectors, and telecommunications; and building refurbishments and fit-out projects. In addition, the company acquires, develops, and sells land; and manufactures and sells long-steel products. Wilson Bayly Holmes-Ovcon Limited was founded in 1970 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2090",
        "website": "http://www.wbho.co.za",
        "full_time_employees": null
    },
    "WKF.JO": {
        "short_name": "Workforce Holdings Ltd",
        "long_name": "Workforce Holdings Limited",
        "summary": "Workforce Holdings Limited, an investment holding company, provides human capital solutions in South Africa, Mozambique, Namibia, Botswana, and Mauritius. The company operates through four segments: Staffing and Outsourcing, Training, Financial Services, and Healthcare. The company offers temporary employment, functional outsourcing, permanent placement recruitment, executive search, specialist staffing, short-and long-term hires, payroll and other systems management, and HR and IR consulting services, as well as disability and turnkey staffing, and business process outsourcing solutions. It also provides accredited short courses, online courses and bursaries, skills programs, full qualifications, and adult education training services, as well as contractor on-boarding services; and learnerships and apprenticeships programs. In addition, the company offers death and disability cover, funeral cover, hospital cover, day-to-day medical insurance, and financial and mobile products and services, as well as lending services. Further, it offers recruitment and placement of medical professionals for hospitals and frail-care homes, primary and occupational healthcare, employee health and wellness programs, and health risk assessments, as well as lifestyle benefits. Workforce Holdings Limited was founded in 1972 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2193",
        "website": "http://www.workforce.co.za",
        "full_time_employees": 1259
    },
    "WQ9.F": {
        "short_name": "WILSON BAYLY HOL.-OVCON",
        "long_name": "Wilson Bayly Holmes-Ovcon Limited",
        "summary": "Wilson Bayly Holmes-Ovcon Limited engages in civil engineering and building construction activities in Africa, Australia, and the United Kingdom. It operates through six segments: Building and Civil Engineering, Roads and Earthworks, Australia, the United Kingdom, Property Developments, and Construction Materials. The company constructs retail shopping centres, commercial buildings, hotels, hospitals, and residential apartments primarily for the private sector, as well as civil engineering related infrastructure for the mining, industrial, energy, and oil and gas sectors. It also undertakes roads and earthworks, such as water and gas pipelines, and other infrastructure projects; retail, residential, and commercial building projects for the private building sector, as well as various engineering disciplines servicing the road and mining sectors, and telecommunications; and building refurbishments and fit-out projects. In addition, the company acquires, develops, and sells land; and manufactures and sells long-steel products. Wilson Bayly Holmes-Ovcon Limited was founded in 1970 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2090",
        "website": "http://www.wbho.co.za",
        "full_time_employees": null
    }
}