{
    "ADI.JO": {
        "short_name": "Adapt IT Holdings Ltd",
        "long_name": "Adapt IT Holdings Limited",
        "summary": "Adapt IT Holdings Limited provides information and communications technology services in South Africa and internationally. Its Education segment provides enterprise resource planning solutions for use in educational institutions; and ITS integrator support, automated exam and class timetabling, training and consulting, and learning relationship management system services, as well as implementation, customization, development, and integration services. The company's Manufacturing segment offers integrated workforce management system solutions for the manufacturing, agri-processing, security resource, and utilities sectors; and business advisory, software development, implementation, systems integration, sustainability reporting, and ERP support services. Its Financial Services segment provides software solutions that automate financial statement and assurance engagements, streamline tax management processes, and enable simplified time and billing management; and software implementation services. The company's Energy segment designs, implements, and supports SAP and supply chain solutions within the oil and gas sector. Its Communications segment offers telecommunications solutions; and services, such as software as a service, APN-as-a-service, analytics-as-a-service, telecommunication and technology expense management, customer experience and self-service advisory, enterprise data services and connectivity, and enterprise performance management. The company's Hospitality segment provides integrated software and hardware solutions to the hospitality industries; and consulting, project management, implementation, hosting and database, application, and support services. The company is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "1687",
        "website": "http://www.adaptit.com",
        "market_cap": 890830400
    },
    "BDVSF": {
        "short_name": "BIDVEST GROUP LTD",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "market_cap": 4783932928
    },
    "BDVSY": {
        "short_name": "BIDVEST GROUP LTD",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "market_cap": 4847013376
    },
    "BIK.JO": {
        "short_name": "Brikor Ltd",
        "long_name": "Brikor Limited",
        "summary": "Brikor Limited, together with its subsidiaries, manufactures and supplies building and construction materials in South Africa. The company operates through Bricks and Coal segments. It is involved in the provision of plaster bricks and semi-face clay bricks; and coal mining operations. The company serves customers in housing, residential, commercial, industrial, civil engineering, and infrastructure projects. Brikor Limited was incorporated in 1998 and is based in Nigel, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Nigel",
        "zipcode": "1490",
        "website": "http://brikor.co.za",
        "market_cap": 969186688
    },
    "BVT.JO": {
        "short_name": "Bidvest Ltd",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "market_cap": 67699171328
    },
    "DNB.JO": {
        "short_name": "Deneb Investments Ltd",
        "long_name": "Deneb Investments Limited",
        "summary": "Deneb Investments Limited, an investment company, distributes branded products in South Africa and internationally. The company's Property segment owns and manages a portfolio of industrial and commercial properties situated in KwaZulu-Natal and the Western Cape. Its Branded Product Distribution segment sources and distributes Prima Toys, Prima Interactive, Prima Baby, The Empire Group, Oops, HTIC, Seartec, The Kid Zone, OfficeBox, Clever Little Monkey, and Brand ID products. The Industrial Product Manufacturing segment manufactures specialized industrial products for the mining, agricultural, construction, automotive, hospitality, and retail markets; and textiles. The Automotive Parts Manufacturing segment engages in the manufacturing of tubular and exhaust-related components. Deneb Investments Limited was incorporated in 2013 and is based in Cape Town, South Africa. Deneb Investments Limited is a subsidiary of Hosken Consolidated Investments Limited.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7925",
        "website": "http://www.deneb.co.za",
        "market_cap": 866010176
    },
    "HCI.JO": {
        "short_name": "Hosken Cons Inv Ltd",
        "long_name": "Hosken Consolidated Investments Limited",
        "summary": "Hosken Consolidated Investments Limited, an investment holding company, operates in hotel and leisure, interactive gaming, media and broadcasting, transport, mining, and property businesses principally in South Africa. It owns and operates hotels and casinos; operates bingo centers and sites, gaming machines, and vslots; and provides transport services. The company is also involved in the mining of coal resources; oil and gas exploration activities; and operation of conference and exhibition, industrial, inner city housing, mixed use precincts, office, student accommodation, and retail properties. In addition, it engages in the textile and non-woven textile manufacturing, toy distribution, and property investment activities. Further, the company offers inrange, a ball tracking radar system and associated visualisation interfaces that hooks golfers with a data-driven experience at golf driving ranges; and IT professional services. Additionally, it operates private commercial free-to-air television channel. The company was incorporated in 1973 and is based in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "8005",
        "website": "http://www.hci.co.za",
        "market_cap": 5903510016
    },
    "JSC.JO": {
        "short_name": "Jasco Electron Hldgs Ltd",
        "long_name": "Jasco Electronics Holdings Limited",
        "summary": "Jasco Electronics Holdings Limited provides solutions in the areas of telecommunications, information technology, energy, and industry in South Africa and internationally. The company offers contact center solutions; unified communications solutions, including telephony, messaging systems, conferencing, analytics and reporting, and integration; and IT infrastructure solutions, such as data networking, connectivity, intelligent systems, professional, and managed services. It also engages in the design, installation, and maintenance of smart technology solutions for security and fire applications; and provision of smart building solutions covering rooftop management, telecommunications, power, renewable energy, security, fire, IT infrastructure, and building management. In addition, the company offers a range of infrastructure products and services for access, transmission, and operational support systems and outside plant, as well as rents space on its existing infrastructure to telecommunications operators and service providers; and data center services. Further, it designs, builds, installs, integrates, and maintains video and audio solutions for broadcasters, as well as production and post-production houses; provides power solutions for UPS, generators, transformers, voltage stabilizers, and surge protection and monitoring equipment; and offers photovoltaic energy production solutions, as well as integrated water network management and event management solutions. Additionally, the company manufactures components for plastic injection moldings and metal pressings, as well as manufactures and assembles wire harness products for the domestic appliance industry; offers paint and print solutions for plastic molded components; provides electrical plugs, adaptors, and extensions under the Snapper brand; and manufactures salt water chlorination systems. Jasco Electronics Holdings Limited was founded in 1976 and is headquartered in Midrand, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Midrand",
        "zipcode": "1685",
        "website": "http://www.jasco.co.za",
        "market_cap": 85289480
    },
    "KAP.JO": {
        "short_name": "KAP Industrial Hldgs Ltd",
        "long_name": "KAP Industrial Holdings Limited",
        "summary": "KAP Industrial Holdings Limited engages in the contractual logistics, passenger transport, timber, chemical, automotive components, and bedding businesses in South Africa, rest of Africa, Europe, the Middle East, Asia, Australasia, the Americas. It operates through Diversified Industrial, Diversified chemical, and Diversified Logistics segments. The Diversified Industrial segment manufactures and sells forestry and timber products, such as sawlogs, poles, pulpwood, structural timber, particleboard and medium-density fiberboard products, foils, worktops, melamine face boards, gloss boards, formaldehyde and UF resin, and impregnated paper; and bedding products comprising mattresses and base sets, foam and related products, mattress ticking, and non-woven spunbond products. This segment also offers automotive components, including textile-based automotive acoustic and soft trim components; underfloor systems for thermal and impact protection and aluminum heatshields; overlay carpets/loose-lay vehicle mats and tonneau covers; polyurethane flexible foam, molded seats, conventional and pour-in-place headrests, foam pads, side bolsters, and armrests; polyester and polyether flexible, semi-rigid, and rigid thermoformable foams; acoustically engineered tufted automotive carpets; and automotive accessories made from mild and stainless steel. The Diversified Chemical segment manufactures polyethylene terephthalate, high-density polyethylene, and polypropylene. The Diversified Logistics segment designs, implements, and manages supply chain, warehousing, and logistics services to the petroleum, chemical, food, agriculture, mining, cement, and general freight and warehousing sectors; and provides personnel, tourist, intercity, and commuter transport services. The company is headquartered in Stellenbosch, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Stellenbosch",
        "zipcode": "7600",
        "website": "http://www.kap.co.za",
        "market_cap": 11643520000
    },
    "NQL1.F": {
        "short_name": "BIDVEST GROUP LTD. RC-,05",
        "long_name": "The Bidvest Group Limited",
        "summary": "The Bidvest Group Limited operates in trading, services, and distribution businesses. The company operates through Services, Branded Products, Freight, Automotive, Commercial Products, Financial Services, and Properties segments. It engages in the motor retail, vehicle auctioneering, snappdrive, and car rental activities; provision of road assistance, vehicle towing, tyre replacement, fuel top up, locksmith, and legal advice services; and manufacture and trading of consumer and industrial day-to-day branded products. The company also distributes electrical, cable and allied products, solutions, and services to wholesale, industrial, mining, contractor, construction, engineering, and retail sectors; and offers a range of banking, insurance, and other financial services for the corporate, business, and individual markets. In addition, it provides freight management services; suite of services relating to office products, office automation, software solutions for businesses, and office furniture; and facilities management, security, travel, aviation, and allied services; and commercial, industrial, financial, automotive, freight, and logistics services. Further, the company develops, owns, and manages various properties; and provides professional property services, as well as engages in the food and distribution business. The Bidvest Group Limited was founded in 1988 and is headquartered in Johannesburg, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2196",
        "website": "http://www.bidvest.co.za",
        "market_cap": 4102394112
    },
    "OHZ.F": {
        "short_name": "OMNIA HLDGS LTD  O.N.",
        "long_name": "Omnia Holdings Limited",
        "summary": "Omnia Holdings Limited, through its subsidiaries, provides specialized chemical products and services used in the agriculture, mining, and chemical industries in South Africa and internationally. Its Agriculture division produces and trades in granular, liquid, and specialty fertilizers, as well as humates, and value-added services and solutions to a range of customer base, including commercial and small-scale farmers, co-operatives, and other corporate clients; and researches and develops, produces, distributes, and sells a range of patented agriculture biological products that include bio stimulants, adjuvants, crop protection products, liquid foliar fertilizers, and soil conditioners. This division is also involved in the wholesale and trading of agriculture commodities. The company's Mining division provides bulk emulsion and blended bulk explosives for the opencast mining industry; produces electronic delay detonators and shocktube initiating systems; and supplies explosive boosters. This division also manufactures packaged explosives for underground mining and specialized surface blasting operations; and offers specialized chemicals and chemical-based solutions, as well as logistical and specialized value-add services. Its Chemicals division manufactures and distributes specialty, functional, and effect chemicals, as well as polymers, lubricant additives, base oils, and process oils and chemicals. This division also manufactures and distributes chemicals, and provides technical support for the treatment of potable water. Omnia Holdings Limited was founded in 1953 and is based in Bryanston, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2021",
        "website": "http://www.omnia.co.za",
        "market_cap": 558656128
    },
    "OMN.JO": {
        "short_name": "Omnia Holdings Ltd",
        "long_name": "Omnia Holdings Limited",
        "summary": "Omnia Holdings Limited, through its subsidiaries, provides specialized chemical products and services used in the agriculture, mining, and chemical industries in South Africa and internationally. Its Agriculture division produces and trades in granular, liquid, and specialty fertilizers, as well as humates, and value-added services and solutions to a range of customer base, including commercial and small-scale farmers, co-operatives, and other corporate clients; and researches and develops, produces, distributes, and sells a range of patented agriculture biological products that include bio stimulants, adjuvants, crop protection products, liquid foliar fertilizers, and soil conditioners. This division is also involved in the wholesale and trading of agriculture commodities. The company's Mining division provides bulk emulsion and blended bulk explosives for the opencast mining industry; produces electronic delay detonators and shocktube initiating systems; and supplies explosive boosters. This division also manufactures packaged explosives for underground mining and specialized surface blasting operations; and offers specialized chemicals and chemical-based solutions, as well as logistical and specialized value-add services. Its Chemicals division manufactures and distributes specialty, functional, and effect chemicals, as well as polymers, lubricant additives, base oils, and process oils and chemicals. This division also manufactures and distributes chemicals, and provides technical support for the treatment of potable water. Omnia Holdings Limited was founded in 1953 and is based in Bryanston, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Bryanston",
        "zipcode": "2021",
        "website": "http://www.omnia.co.za",
        "market_cap": 9392151552
    }
}