{
    "ATI.JO": {
        "short_name": "Afristrat Inv Hldgs Ltd",
        "long_name": "Afristrat Investment Holdings Limited",
        "summary": "Afristrat Investment Holdings Limited, together with its subsidiaries, provides financial services in South Africa, Botswana, Zambia, Eswatini, and Mauritius. The company operates through Credit, Investment Services, and Equity Holdings segments. It offers secured credit funding to commercial clients, such as business credit in the form of medium-term loans subject to security cover; and supply chain and/or enterprise development solutions to integrate vendors into the supply chain. The company also provides financial investment products to the retail market. In addition, it offers strategic investment services in managed profit focused companies. Further, the company provides debt collection, management, treasury, and property investment services. The company was formerly known as Ecsponent Limited and changed its name to Afristrat Investment Holdings Limited in October 2020. Afristrat Investment Holdings Limited was founded in 1995 and is based in Pretoria, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Pretoria",
        "zipcode": "0145",
        "website": "http://www.afristrat.co.za",
        "market_cap": "Small Cap"
    },
    "MFL.JO": {
        "short_name": "Metrofile Holdings Ltd",
        "long_name": "Metrofile Holdings Limited",
        "summary": "Metrofile Holdings Limited, an investment holding company, provides records and information management services in South Africa, Botswana, Kenya, Mozambique, and the Middle East. The company provides records storage and management services, including archive, active, hosting, and stationery services; backup storage services comprising vault and managed services; records management consultancy and software integration; document shredding; and image processing services, such as digital and analogue services. It also offers business process outsourcing services, which includes proof of delivery solutions, track and trace management, sensitive information protection, procurement tracking solutions, claims processing, human resource services, electronic exam marking system, and business continuity and work area recovery service. In addition, the company provides filing solutions, including office filing stationery, archive filing boxes, bulk filing solutions, filing cabinets, shelving and steel products, and scanners, as well as software solutions; and ScreenWell, a digital solution to capture, track, and manage daily temperature screening, health questionnaires, and workplace policy compliance for returning staff and visitors. It serves clients in financial services, healthcare, mining, public, and retail sectors. The company was formerly known as MGX Holdings Limited and changed its name to Metrofile Holdings Limited in February 2005. Metrofile Holdings Limited was founded in 1983 and is based in Illovo, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Illovo",
        "zipcode": "2196",
        "website": "http://www.metrofilegroup.com",
        "market_cap": "Small Cap"
    },
    "N09.F": {
        "short_name": "NOVUS HOLDINGS LTD",
        "long_name": "Novus Holdings Limited",
        "summary": "Novus Holdings Limited engages in the printing and manufacturing businesses in South Africa and internationally. It operates through three segments: Printing, Packaging, and Other. The company offers gravure, heatset, coldset, sheet-fed, and security and digital printing services. It prints books and directories, magazines, newspapers, leaflets, flyers, newsletters, textbooks, workbooks, examination papers, answer books, and retail and promotional catalogues, as well as security materials, such as ballot papers, voter registration forms, census forms, and other confidential materials. The company is also involved in the printing of wet-glue, wrap-around, and pressure sensitive labels; and manufacture and supply of flexible packaging solutions, such as boutique/retail, security, and carrier bags, as well as form, fill, and seal bags for FMCG, pet, chemical, retail, and security industries. In addition, it operates a training institution that offers a range of technical, life skills, management, leadership, and IT and systems courses and programs. The company was incorporated in 2008 and is headquartered in Cape Town, South Africa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7441",
        "website": "http://www.novus.holdings",
        "market_cap": "Small Cap"
    },
    "NVS.JO": {
        "short_name": "Novus Holdings Limited",
        "long_name": "Novus Holdings Limited",
        "summary": "Novus Holdings Limited engages in the printing and manufacturing businesses in South Africa and internationally. It operates through three segments: Printing, Packaging, and Other. The company offers gravure, heatset, coldset, sheet-fed, and security and digital printing services. It prints books and directories, magazines, newspapers, leaflets, flyers, newsletters, textbooks, workbooks, examination papers, answer books, and retail and promotional catalogues, as well as security materials, such as ballot papers, voter registration forms, census forms, and other confidential materials. The company is also involved in the printing of wet-glue, wrap-around, and pressure sensitive labels; and manufacture and supply of flexible packaging solutions, such as boutique/retail, security, and carrier bags, as well as form, fill, and seal bags for FMCG, pet, chemical, retail, and security industries. In addition, it operates a training institution that offers a range of technical, life skills, management, leadership, and IT and systems courses and programs. The company was incorporated in 2008 and is headquartered in Cape Town, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Cape Town",
        "zipcode": "7441",
        "website": "http://www.novus.holdings",
        "market_cap": "Small Cap"
    }
}