{
    "ADR.JO": {
        "short_name": "Adcorp Holdings Limited",
        "long_name": "Adcorp Holdings Limited",
        "summary": "Adcorp Holdings Limited provides workplace solutions in South Africa and Australia. It operates through Industrial Services, Support Services, Professional Services, Financial Services, and Training Services segments. The company offers permanent recruitment and flexible staffing, professional IT, business process outsourcing, training, and financial services; and agency agreement, shared, managed, emergent business, payroll card, and project management products and services. Adcorp Holdings Limited was founded in 1968 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    },
    "WKF.JO": {
        "short_name": "Workforce Holdings Ltd",
        "long_name": "Workforce Holdings Limited",
        "summary": "Workforce Holdings Limited, an investment holding company, provides human capital solutions in South Africa, Mozambique, Namibia, Botswana, and Mauritius. The company operates through four segments: Staffing and Outsourcing, Training, Financial Services, and Healthcare. The company offers temporary employment, functional outsourcing, permanent placement recruitment, executive search, specialist staffing, short-and long-term hires, payroll and other systems management, and HR and IR consulting services, as well as disability and turnkey staffing, and business process outsourcing solutions. It also provides accredited short courses, online courses and bursaries, skills programs, full qualifications, and adult education training services, as well as contractor on-boarding services; and learnerships and apprenticeships programs. In addition, the company offers death and disability cover, funeral cover, hospital cover, day-to-day medical insurance, and financial and mobile products and services, as well as lending services. Further, it offers recruitment and placement of medical professionals for hospitals and frail-care homes, primary and occupational healthcare, employee health and wellness programs, and health risk assessments, as well as lifestyle benefits. Workforce Holdings Limited was founded in 1972 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "city": "Johannesburg"
    }
}