{
    "ADR.JO": {
        "short_name": "Adcorp Holdings Limited",
        "long_name": "Adcorp Holdings Limited",
        "summary": "Adcorp Holdings Limited provides workplace solutions in South Africa and Australia. It operates through Industrial Services, Support Services, Professional Services, Financial Services, and Training Services segments. The company offers permanent recruitment and flexible staffing, professional IT, business process outsourcing, training, and financial services; and agency agreement, shared, managed, emergent business, payroll card, and project management products and services. Adcorp Holdings Limited was founded in 1968 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2191",
        "website": "http://www.adcorpgroup.com",
        "market_cap": "Small Cap"
    },
    "CSG.JO": {
        "short_name": "CSG Holdings Ltd",
        "long_name": "CSG Holdings Limited",
        "summary": "CSG Holdings Limited, together with its subsidiaries, provides facilities management, security and risk solutions, and staffing solutions primarily in South Africa, Mozambique, Malawi, and Botswana. It offers temporary outsourced personnel, permanent placements, timekeeping, payroll, human resource, and industrial relations services. The company also manages restaurant staff members, as well as supplies meals to students, patients in hospitals, corporate head offices, and mines and construction sites; and specialized cleaning services to the hospitality, healthcare, and commercial industries. In addition, it offers remote site (camp) services, which include accommodation, catering, laundry, cleaning, and maintenance services; and contract catering and events management services. Further, the company provides integrated security services, such as safety surveillance and access control services to residential and commercial clients; and specialized security risk services, including monitoring software. Additionally, it offers training and skills development services; cleaning and mining services to the mining and construction industry; and financing and related services, as well as operates as a franchisor to security companies. CSG Holdings Limited was incorporated in 2006 and is headquartered in Pretoria, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Pretoria",
        "zipcode": "0181",
        "website": "http://www.csgholdings.co.za",
        "market_cap": "Small Cap"
    },
    "PMV.JO": {
        "short_name": "Primeserv Group Ltd",
        "long_name": "Primeserv Group Limited",
        "summary": "Primeserv Group Limited, an investment holding company, provides integrated business support services in South Africa. It operates through two segments, Staffing Services, and Training and Consulting Services. The company offers staffing services, such as permanent recruitment, temporary recruitment, temporary employment, payroll, functional outsourcing, business process outsourcing, time and attendance system, customized management information reporting, HR and IR, mega-project, wellness programs, and lifestyle and employee benefit services, as well as productivity services and solutions. It also provides training and consulting services that include technical training, corporate training, and human capital consulting services. In addition, the company offers accredited training and skills development, and learnership services, as well as operates skills training centers. It serves a range of industries and sectors, including agriculture, automotive, banking, building and construction, design and draughting, drivers and transportation, engineering and fabrication, facilities management, financial and insurance, food production, FMCG, government services, harbors and railways, hospital, nursing, medical, logistics and distribution centers, mechanical, merchandising, mining, paper and pulp, petrochemical, pharmaceutical, power generation, retail and wholesale, secretarial and office support, tourism and hospitality, telecoms, telemarketing and call centers, warehousing, and waste management. The company is headquartered in Sandton, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Sandton",
        "zipcode": "2196",
        "website": "http://www.primeserv.co.za",
        "market_cap": "Small Cap"
    },
    "WKF.JO": {
        "short_name": "Workforce Holdings Ltd",
        "long_name": "Workforce Holdings Limited",
        "summary": "Workforce Holdings Limited, an investment holding company, provides human capital solutions in South Africa, Mozambique, Namibia, Botswana, and Mauritius. The company operates through four segments: Staffing and Outsourcing, Training, Financial Services, and Healthcare. The company offers temporary employment, functional outsourcing, permanent placement recruitment, executive search, specialist staffing, short-and long-term hires, payroll and other systems management, and HR and IR consulting services, as well as disability and turnkey staffing, and business process outsourcing solutions. It also provides accredited short courses, online courses and bursaries, skills programs, full qualifications, and adult education training services, as well as contractor on-boarding services; and learnerships and apprenticeships programs. In addition, the company offers death and disability cover, funeral cover, hospital cover, day-to-day medical insurance, and financial and mobile products and services, as well as lending services. Further, it offers recruitment and placement of medical professionals for hospitals and frail-care homes, primary and occupational healthcare, employee health and wellness programs, and health risk assessments, as well as lifestyle benefits. Workforce Holdings Limited was founded in 1972 and is headquartered in Johannesburg, South Africa.",
        "currency": "ZAc",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "JNB",
        "market": "za_market",
        "country": "South Africa",
        "state": null,
        "city": "Johannesburg",
        "zipcode": "2193",
        "website": "http://www.workforce.co.za",
        "market_cap": "Small Cap"
    }
}