{
    "AEU.F": {
        "short_name": "PRYSMIAN S.P.A.  EO 0,10",
        "long_name": "Prysmian S.p.A.",
        "summary": "Prysmian S.p.A. produces, distributes, and sells cables and systems, and related accessories for the energy and telecommunications industries worldwide. The company operates through three segments: Energy, Projects, and Telecom. The Energy segment comprising trade and installers; power distribution and overhead transmission lines; and industrial and network components for various industries, which includes oil and gas, downhole technology, elevators, automotive, nuclear, mining, marine, and infrastructure sectors, as well as for renewable energy field, military, railways, and cranes. The Projects segment designs, manufactures, and installs high and extra high voltage cables for underground and submarine power transmission; high voltage cabling systems for terrestrial and submarine applications; provides submarine interconnections between countries and between off shore wind farms and the mainland, which is used for generation and distribution of electricity. The Telecom segment manufactures cable systems and connectivity products comprising optical fiber, optical cables, connectivity components and accessories, optical ground wires, and copper cables used in telecommunication networks. Prysmian S.p.A. is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "city": "Milan"
    },
    "CMB.MI": {
        "short_name": "CEMBRE",
        "long_name": "Cembre S.p.A.",
        "summary": "Cembre S.p.A., together with its subsidiaries, manufactures and sells electrical connectors and related tools in Italy, rest of Europe, and internationally. The company offers pre-insulated, un-insulated, and other types of electrical connectors, as well as flexible braids for earthing moving elements; mechanical tools for crimping electrical connectors, and cutting and preparing cables; hydraulic tools for crimping electrical connectors, and cutting and preparing conductors; products for railway electrical connections; and machinery for track maintenance; and hand tools. It also provides cable glands and fixing components, brass and steel cable glands and fixing components, brass extensions, brass reducer bushes and converters, rutaseal grommets, and modular retaining clips; and identification and labeling systems, such as thermal transfer systems, manual cable marking systems, document wallets, and warning labels. In addition, the company offers heat-shrinkable tubing products, cable ties and tooling, cable and conduit clips, cable preparation tools, hand tools, insulated covers for uninsulated connectors, and cast resin cable joints. Its products are used in power production and transport, electrical systems, and industrial and railway applications. The company was founded in 1969 and is headquartered in Brescia, Italy. Cembre S.p.A. is a subsidiary of Lysne S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Brescia"
    },
    "IRC.MI": {
        "short_name": "IRCE",
        "long_name": "IRCE S.p.A.",
        "summary": "IRCE S.p.A. manufactures and sells winding wires and electrical cables in Italy and internationally. The company offers enameled copper and aluminum round wires, and copper and aluminum rectangular wires for use in electric motors, generators, transformers, compressors, inductors, relays, solenoid valves, etc. It also provides wiring cables, low voltage and medium voltage building and industrial cables, data cables, and power cords with plugs for the construction of electricity plants in residential and industrial buildings, as well as for the wiring and cabling of electrical appliances. The company was founded in 1947 and is based in Imola, Italy. IRCE S.p.A. is a subsidiary of Aequafin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Imola"
    },
    "IRQ.SG": {
        "short_name": "IRCE S.P.A. Azioni nom. EO 0,52",
        "long_name": "IRCE S.p.A.",
        "summary": "IRCE S.p.A. manufactures and sells winding wires and electrical cables in Italy and internationally. The company offers enameled copper and aluminum round wires, and copper and aluminum rectangular wires for use in electric motors, generators, transformers, compressors, inductors, relays, solenoid valves, etc. It also provides wiring cables, low voltage and medium voltage building and industrial cables, data cables, and power cords with plugs for the construction of electricity plants in residential and industrial buildings, as well as for the wiring and cabling of electrical appliances. The company was founded in 1947 and is based in Imola, Italy. IRCE S.p.A. is a subsidiary of Aequafin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Italy",
        "city": "Imola"
    },
    "MLITN.PA": {
        "short_name": "ITALY INNOVAZIONI",
        "long_name": "Italy Innovazioni S.P.A.",
        "summary": "Italy Innovazioni S.P.A. engages in the design, prototyping, production, and marketing of electric outlets for homes and offices in Italy and internationally. Its products include Hide, a recessed electrical outlet; SlideBox, an adjustable electrical box; and SuperDual, a multistandard socket. The company is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Italy",
        "city": "Rome"
    }
}