{
  "1S3.F": {
    "city": "Empoli",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "SeSa S.p.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SESA S.P.A.",
    "state": "FI",
    "summary": "SeSa S.p.A., through its subsidiaries, distributes value-added information technology (IT) products and solutions in Italy. Its Software and System Integration sector offers software and IT products and services; ICT products and solutions, as well as system integration services; IT infrastructure and IoT solutions; artificial intelligence and machine learning solutions; digital and business application services; and HR management solutions, as well as operates solutions on the Microsoft Dynamics platform. It also provides cloud services; digital security services; digital manufacturing, processing, and transformation solutions; management, maintenance, technical assistance, and repair services for computers and IT products; and strategic outsourcing services, as well as operates in the cloud computing and systems assistance sectors. In addition, this sector develops and markets ERP software and applications; offers solutions and integrated services on the SAP Business One platform; develops 3cad products for the furniture industry; produces and markets software products, as well as provides IT services for the retail sector; offers project management services; and provides product lifecycle management solutions for manufacturing sector. The company's Business Services sector supplies business process outsourcing, digital transformation, and fleet management and operations services; and physical and logical security services for banks and operators in the retail sector. Its Value Added Distribution sector engages in the value added distribution of technological, enterprise software and datacenter solutions; management of networking solutions; providing design services for IT solutions; marketing Hitachi data systems solutions; and distribution of the Adobe brand. The company's Corporate sector offers logistics services; and marketing and promotion services for the ICT channel. SeSa S.p.A. is headquartered in Empoli, Italy. SeSa S.p.A. is a subsidiary of ITH S.p.A.",
    "website": "http://www.sesa.it",
    "zipcode": "50053"
  },
  "7T4.F": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Tinexta S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TINEXTA S.P.A.",
    "state": "RM",
    "summary": "Tinexta S.p.A. provides digital trust, credit information and management, and innovation and marketing services to large companies, banks, insurance and financial companies, SMEs, associations, and professionals in Italy and internationally. The company offers IT solutions for digital identity and the dematerialization of processes according to the applicable legislation, such as certified electronic mail, electronic storage, digital signature, digital certification, e-invoicing, electronic archiving, and e-enterprise solutions; various solutions for secure and simplified transmission of legal and financial documents; web services for accessing public administration database; additional services for the management of professional associations and billing, and IT protocol; and designs and develops IT services and solutions for SMEs, trade associations, professional firms, agencies, and financial intermediaries. The company also offers cyber security solutions; services to support decision-making processes; credit information and management services; and software solutions to comply with tax obligations, employment legislations, and other regulations, as well as electronic filing of documents and management of civil proceedings. In addition, it provides real estate information and appraisal services; and consulting services for grants, loans and tax relief, and industrial innovation, as well as temporary export management consultancy services for SMEs. The company was formerly known as Tecnoinvestimenti S.p.A. and changed its name to Tinexta S.p.A. in November 2018. The company was founded in 2009 and is headquartered in Rome, Italy. Tinexta S.p.A. is a subsidiary of Tecno Holding S.p.A.",
    "website": "http://www.tinexta.com",
    "zipcode": "00187"
  },
  "AIW.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Almawave S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "ALMAWAVE",
    "state": "RM",
    "summary": "Almawave S.r.l. develops customer relations management solutions. It offers Iride Suite that integrates semantics, statistics, automatic speech recognition, and adaptive interface into one single platform; and generates information on management processes across various communication channels, such as customer journey, perception of products and services, occurrence of critical issues and risks, knowledge, and skill management. The company also provides social analysis solutions. It serves top management, sales and marketing, customer operations, information technology, public relations, and organization markets. The company was founded in 2008 and is based in Rome, Italy with additional offices in San Francisco, California; Milano, Firenze, and Trento, Italy; and Sao Paulo and Belo Horizonte, Brazil. Almawave S.r.l. operates as a subsidiary of Almaviva - The Italian Innovation Company S.p.A.",
    "website": "http://www.almawave.it",
    "zipcode": "00137"
  },
  "BEST.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Be Shaping The Future S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BE",
    "state": "RM",
    "summary": "Be Shaping The Future S.p.A. provides business consulting, information technology, and professional services in Italy, Germany, Austria, Switzerland, the United Kingdom, Spain, Poland, Ukraine, and Romania. It operates through Business Consulting and ICT Solutions segments. The Business Consulting segment offers business consulting services in the areas of payment systems, planning and control methods, regulatory compliance, information gathering, and corporate governance systems for financial processes and asset management. This segment provides management consulting services for financial institutions; financial services consulting services in the banking and financial sectors; consulting and development services in the areas of accounting, bank reporting, and compliance; and advisory services for operators in the payments industry. The ICT Solutions segment offers ICT consulting and system integration services for proprietary products/platforms. This segment also develops digital, web, and mobile solutions; and web-based and multimedia software solutions. The company was formerly known as Be Think, Solve, Execute S.p.A. and changed its name to Be Shaping The Future S.p.A. in May 2020. The company was founded in 1987 and is headquartered in Rome, Italy.",
    "website": "http://www.be-tse.it",
    "zipcode": "00144"
  },
  "CIRC.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Circle S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CIRCLE",
    "state": "MI",
    "summary": "Circle S.p.A. provides process and management consulting services, technological solutions, and digital marketing solutions for transport and logistics sector. It offers Milos, a modular software for the optimization of transport of containers, trailers, vehicles, and various types of goods along the supply chain; Sinfomar, a port community system; and Connecting EU that assists public actors and private companies in developing new businesses through specific instruments of project anticipation and EU branding. The company also provides digital multichannel marketing services. Circle S.p.A. was founded in 2012 and is based in Milan, Italy.",
    "website": "http://www.circletouch.eu",
    "zipcode": "20124"
  },
  "DAF.F": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Be Shaping The Future S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "BE SHAPING THE FUTURE SPA",
    "state": "RM",
    "summary": "Be Shaping The Future S.p.A. provides business consulting, information technology, and professional services in Italy, Germany, Austria, Switzerland, the United Kingdom, Spain, Poland, Ukraine, and Romania. It operates through Business Consulting and ICT Solutions segments. The Business Consulting segment offers business consulting services in the areas of payment systems, planning and control methods, regulatory compliance, information gathering, and corporate governance systems for financial processes and asset management. This segment provides management consulting services for financial institutions; financial services consulting services in the banking and financial sectors; consulting and development services in the areas of accounting, bank reporting, and compliance; and advisory services for operators in the payments industry. The ICT Solutions segment offers ICT consulting and system integration services for proprietary products/platforms. This segment also develops digital, web, and mobile solutions; and web-based and multimedia software solutions. The company was formerly known as Be Think, Solve, Execute S.p.A. and changed its name to Be Shaping The Future S.p.A. in May 2020. The company was founded in 1987 and is headquartered in Rome, Italy.",
    "website": "http://www.be-tse.it",
    "zipcode": "00144"
  },
  "DGV.MI": {
    "city": "Milan",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Digital Value S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DIGITAL VALUE",
    "state": "MI",
    "summary": "Digital Value S.p.A. provides technology and service solutions to the telecommunications, utilities, energy, defense, transportation, and finance sectors in Italy. It offers services in the areas of data center and hybrid cloud, networking and intelligence networks, infrastructural enterprise software, ICT security and cybersecurity, and digital transformation. The company is headquartered in Milan, Italy.",
    "website": "http://www.digitalvalue.it",
    "zipcode": "20124"
  },
  "FOS.MI": {
    "city": "Genoa",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Fos S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "FOS",
    "state": "GE",
    "summary": "Fos S.p.A. provides technological consultancy services in Italy. The company engages in design and implementation of software solutions for health/medical and transport and shipping industries, banks and insurance companies, central and local public administrations; environment development; design software development; and software configuration management. It is also involved in design and implementation network operations centers and access solutions to business applications; design, installation, and management of local network and datacenter architectures, and corporate VPNs and application portals; design and management of geographic networks and dynamic routing protocols; provision of cyber security solutions comprising design and operational management of security architectures; definition and implementation of IS policies for sensitive data protection; and configuration of the security policies, as well as provision of cloud computing services, and solutions for Big Data/mail/database optimization projects; network, security, server, storage, back-up consolidation; and disaster recovery and business continuity solutions. In addition, the company offers integrated repair and testing of electronic equipment for telecommunications, gaming, railway, and medical sectors; and development, prototyping, testing, and engineering solutions for different application fields, such as industry 4.0, health, energy, agriculture, and environment. Further, it provides specialized services for industrial automation, including supervision and monitoring systems, control rooms, building management systems, consumption monitoring, and remote meter reading; intervention management, teams and personnel management, predictive maintenance, and spare parts warehouse management; and 3D services comprising technical modeling, visual modeling, animation, prototyping, virtual and augmented reality, and simulation and analysis. The company was founded in 1999 and is based in Genoa, Italy.",
    "website": "http://www.gruppofos.it/index.php/it",
    "zipcode": "16126"
  },
  "ITW.MI": {
    "city": "Ravenna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Itway S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "IT WAY",
    "state": "RA",
    "summary": "Itway S.p.A. engages in the cybersecurity, data science, and safety business. The company offers consultancy, planning, and system integration services in the field of cyber security, such as GDPR and Internet of Things, as well as work safety in the environment, health, and safety sectors. It also provides data science and data management services and solutions for the scientific and cultural heritage markets, as well as big data services; and managed security services and network monitoring services. In addition, the company distributes software and hardware products; involved in the certification of the software technologies; and offers pre- and post-sales technical assistance services. It offers a combination of services that cover the range of activities connected to the management of information systems and security of large- and medium-sized firms. The company was founded in 1996 and is headquartered in Ravenna, Italy.",
    "website": "http://www.itway.com",
    "zipcode": "48124"
  },
  "IW3.F": {
    "city": "Ravenna",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Itway S.p.A.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ITWAY SPA",
    "state": "RA",
    "summary": "Itway S.p.A. engages in the cybersecurity, data science, and safety business. The company offers consultancy, planning, and system integration services in the field of cyber security, such as GDPR and Internet of Things, as well as work safety in the environment, health, and safety sectors. It also provides data science and data management services and solutions for the scientific and cultural heritage markets, as well as big data services; and managed security services and network monitoring services. In addition, the company distributes software and hardware products; involved in the certification of the software technologies; and offers pre- and post-sales technical assistance services. It offers a combination of services that cover the range of activities connected to the management of information systems and security of large- and medium-sized firms. The company was founded in 1996 and is headquartered in Ravenna, Italy.",
    "website": "http://www.itway.com",
    "zipcode": "48124"
  },
  "IW7.F": {
    "city": "Molfetta",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Exprivia S.p.A.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EXPRIVIA SPA  EO 0,52",
    "state": "BA",
    "summary": "Exprivia S.p.A. provides digital transformation solutions in Italy and internationally. The company offers big data and analytics, cloud, Internet of things, IT security, mobile, SAP, and business process outsourcing solutions. It also designs and manages services and infrastructure for call centers, contact centers, and helpdesks; and develops ground stations for the reception and processing of satellite data. In addition, the company organizes and manages Master in Management and Industrial Development program, as well as specialized seminars and training courses for companies and public administration; offers professional and project development services in the SAP environment, IT infrastructure, and WEB portal development; and provides healthcare solutions and information systems. It serves the banking, finance, and insurance; telecom and media; energy and utilities; aerospace and defense; manufacturing and distribution; healthcare; and public sector industries. The company is headquartered in Molfetta, Italy.",
    "website": "http://www.exprivia.it",
    "zipcode": "70056"
  },
  "REJA.F": {
    "city": "Turin",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Reply S.p.A.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "REPLY S.P.A.  EO 0,13",
    "state": "TO",
    "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.",
    "website": "http://www.reply.com/en/",
    "zipcode": "10143"
  },
  "RETI.MI": {
    "city": "Busto Arsizio",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Reti S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "RETI",
    "state": "VA",
    "summary": "Reti S.p.A. provides IT consulting services. The company offers application solutions for the management of business processes, sharing of information, and facilitation of collaborative processes; and develops IT platforms and infrastructures for the networking and digitization needs of its customers, as well as management and assistance services on infrastructures and applications. It is also involved in the implementation of business strategies. The company operates in the areas of project management and business analysis, ERP, cloud, IOT, business and artificial intelligence, and cyber security. Reti S.p.A. was founded in 1994 and is based in Busto Arsizio, Italy.",
    "website": "http://www.reti.it",
    "zipcode": "21052"
  },
  "REY.MI": {
    "city": "Turin",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Reply S.p.A.",
    "market": "it_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "REPLY",
    "state": "TO",
    "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.",
    "website": "http://www.reply.com/en/",
    "zipcode": "10143"
  },
  "RPYTF": {
    "city": "Turin",
    "country": "Italy",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Reply S.p.A.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "REPLY SPA",
    "state": "TO",
    "summary": "Reply S.p.A. provides consulting, system integration, application management, and business process outsourcing services in Italy and internationally. The company implements solutions based on communication channels and digital media. It offers Brick Reply, a manufacturing operations management platform for the management and control of a factory; China Beats, a cloud-based market intelligence and social listening solution; Discovery Reply, an enterprise digital asset management platform; HI Connect, solution for the Internet of Things sphere that enables objects to connect in the network for communication; Logistics Execution Architecture Reply, a digital platform for agile and connected supply chains; and Pulse Reply, a solution that combines data science and marketing intelligence activities in an agile dashboard. The company also provides Sonar Reply, a solution for trend research; TamTamy, a platform for creating digital workplaces, enterprise social networks, and digital communities; Click Reply, a supply chain execution platform; Definio Reply, a technological platform for the collection, analysis, control, processing, and distribution of financial data; Ticuro Reply, a cloud-based platform solution for the connection of medical devices, as well as wearable and environmental sensors; and X-RAIS Reply, a reply artificial intelligence solution to support radiological diagnosis processes. In addition, it offers business process outsourcing services in the areas of finance and administration, human resources, and pharmaceutical; and CFO services. It serves automotive, energy and utilities, financial services, logistics and manufacturing, public sector and healthcare, retail and consumer products, and telco and media industries. Reply has an agreement with Amazon Web Services. The company was founded in 1995 and is headquartered in Turin, Italy.",
    "website": "http://www.reply.com/en/",
    "zipcode": "10143"
  },
  "SES.MI": {
    "city": "Empoli",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "SeSa S.p.A.",
    "market": "it_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "SESA",
    "state": "FI",
    "summary": "SeSa S.p.A., through its subsidiaries, distributes value-added information technology (IT) products and solutions in Italy. Its Software and System Integration sector offers software and IT products and services; ICT products and solutions, as well as system integration services; IT infrastructure and IoT solutions; artificial intelligence and machine learning solutions; digital and business application services; and HR management solutions, as well as operates solutions on the Microsoft Dynamics platform. It also provides cloud services; digital security services; digital manufacturing, processing, and transformation solutions; management, maintenance, technical assistance, and repair services for computers and IT products; and strategic outsourcing services, as well as operates in the cloud computing and systems assistance sectors. In addition, this sector develops and markets ERP software and applications; offers solutions and integrated services on the SAP Business One platform; develops 3cad products for the furniture industry; produces and markets software products, as well as provides IT services for the retail sector; offers project management services; and provides product lifecycle management solutions for manufacturing sector. The company's Business Services sector supplies business process outsourcing, digital transformation, and fleet management and operations services; and physical and logical security services for banks and operators in the retail sector. Its Value Added Distribution sector engages in the value added distribution of technological, enterprise software and datacenter solutions; management of networking solutions; providing design services for IT solutions; marketing Hitachi data systems solutions; and distribution of the Adobe brand. The company's Corporate sector offers logistics services; and marketing and promotion services for the ICT channel. SeSa S.p.A. is headquartered in Empoli, Italy. SeSa S.p.A. is a subsidiary of ITH S.p.A.",
    "website": "http://www.sesa.it",
    "zipcode": "50053"
  },
  "SOU.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Sourcesense S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SOURCESENSE",
    "state": "RM",
    "summary": "Sourcesense S.p.A. develops and sells Open Source cloud based software solutions in Italy. The company offers solutions for business transformation. It serves clients in industrial and service, telco and utility, publishing and media, banking and insurance, fashion and gaming, and public administration sectors. The company was founded in 2001 and is based in Rome, Italy.",
    "website": "http://www.sourcesense.com",
    "zipcode": "00144"
  },
  "TNXT.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Tinexta S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TINEXTA",
    "state": "RM",
    "summary": "Tinexta S.p.A. provides digital trust, credit information and management, and innovation and marketing services to large companies, banks, insurance and financial companies, SMEs, associations, and professionals in Italy and internationally. The company offers IT solutions for digital identity and the dematerialization of processes according to the applicable legislation, such as certified electronic mail, electronic storage, digital signature, digital certification, e-invoicing, electronic archiving, and e-enterprise solutions; various solutions for secure and simplified transmission of legal and financial documents; web services for accessing public administration database; additional services for the management of professional associations and billing, and IT protocol; and designs and develops IT services and solutions for SMEs, trade associations, professional firms, agencies, and financial intermediaries. The company also offers cyber security solutions; services to support decision-making processes; credit information and management services; and software solutions to comply with tax obligations, employment legislations, and other regulations, as well as electronic filing of documents and management of civil proceedings. In addition, it provides real estate information and appraisal services; and consulting services for grants, loans and tax relief, and industrial innovation, as well as temporary export management consultancy services for SMEs. The company was formerly known as Tecnoinvestimenti S.p.A. and changed its name to Tinexta S.p.A. in November 2018. The company was founded in 2009 and is headquartered in Rome, Italy. Tinexta S.p.A. is a subsidiary of Tecno Holding S.p.A.",
    "website": "http://www.tinexta.com",
    "zipcode": "00187"
  },
  "VNT.MI": {
    "city": "Rome",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Vantea SMART S.p.A.",
    "market": "it_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "VANTEA SMART",
    "state": "RM",
    "summary": "Vantea SMART S.p.A., an Information Technology company, engages in the provision of cybersecurity solutions and services. It develops software products and digital e-commerce platforms. The company's cybersecurity related solutions cover services for countermeasures and on assets, monitoring and automatic response services, and governance services; and security operations, on-site specialist support, security consulting, and support services on security solutions. It also provides solutions in the ERP sector; distribution sector comprising food and beverage; and concierge sector. The company was founded in 1993 and is based in Rome, Italy.",
    "website": "http://www.vantea.com",
    "zipcode": "00131"
  },
  "XPR.MI": {
    "city": "Molfetta",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Information Technology Services",
    "long_name": "Exprivia S.p.A.",
    "market": "it_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "EXPRIVIA",
    "state": "BA",
    "summary": "Exprivia S.p.A. provides digital transformation solutions in Italy and internationally. The company offers big data and analytics, cloud, Internet of things, IT security, mobile, SAP, and business process outsourcing solutions. It also designs and manages services and infrastructure for call centers, contact centers, and helpdesks; and develops ground stations for the reception and processing of satellite data. In addition, the company organizes and manages Master in Management and Industrial Development program, as well as specialized seminars and training courses for companies and public administration; offers professional and project development services in the SAP environment, IT infrastructure, and WEB portal development; and provides healthcare solutions and information systems. It serves the banking, finance, and insurance; telecom and media; energy and utilities; aerospace and defense; manufacturing and distribution; healthcare; and public sector industries. The company is headquartered in Molfetta, Italy.",
    "website": "http://www.exprivia.it",
    "zipcode": "70056"
  }
}
