{
    "ABT.MI": {
        "short_name": "ABITARE IN",
        "long_name": "Abitare In S.p.A.",
        "summary": "Abitare In S.p.A. develops, constructs, and sells residential buildings and apartments in Milan. The company is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20123",
        "website": "http://www.abitareinspa.com",
        "market_cap": 146817008
    },
    "CASA.MI": {
        "short_name": "CASASOLD",
        "long_name": "CASASOLD S.p.A.",
        "summary": "CASASOLD S.p.A. operates as a real estate sales services company in Italy. The company is involved in the renovation and sale of old apartments and offices. It serves real estate buyers and sellers, and agents. CASASOLD S.p.A. was incorporated in 2018 and is based in Trento, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TN",
        "city": "Trento",
        "zipcode": "38122",
        "website": "http://casasold.it",
        "market_cap": 1171500
    },
    "CBB.MI": {
        "short_name": "CLEANBNB",
        "long_name": "CleanBnB S.p.A.",
        "summary": "CleanBnB S.p.A. operates an integrated platform with the online channels of reservations for houses and apartments for holidays. Its platform offers service to property owners who want to rent them for short periods. The company's services include online management of the property profile, management of guest requests, management of rates and collections. The company was founded in 2016 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20146",
        "website": "http://www.cleanbnb.net",
        "market_cap": 11275848
    },
    "CIA.MI": {
        "short_name": "CIA",
        "long_name": "Compagnia Immobiliare Azionaria S.p.A.",
        "summary": "Compagnia Immobiliare Azionaria S.p.A. operates in the real estate sector in Italy. It leases and sells real estate properties. The company also offers timeshare management services; and delivers facility, such as routine maintenance, adjustment of structures and facilities, ancillary services, and other services. In addition, it invests in agriculture and farm holidays. The company was founded in 2002 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20122",
        "website": "http://www.compagniaimmobiliareazionaria.it",
        "market_cap": 10337073
    },
    "GAB.MI": {
        "short_name": "GABETTI",
        "long_name": "Gabetti Property Solutions S.p.A.",
        "summary": "Gabetti Property Solutions S.p.A., through its subsidiaries, engages in the acquisition, development, management, and brokerage of real estate properties in Italy and internationally. The company provides consultancy services for the purchase, sale, rental, and evaluation of residential properties; consultancy services for the purchase, sale, leasing, and enhancement of properties for tertiary, industrial, and commercial use, as well as for real estate trading operations; and new constructions and enhancements of existing free and/or leased buildings brokerage and consultancy services to real estate operators, institutions, banks, insurance companies, real estate funds, builders and developers, and institutional investors. It also offers audit, technical, and health safety and energy services in the real estate sector; properties and facilities management services, including administrative, accounting, goalkeeper, and project management, as well as condominium administration and technical services; insurance services; and loans and corporate leasing, market study, research, feasibility study, investment analysis, and evaluation services for the real estate properties. In addition, the company provides financial services, such as mortgage home, employee and personal loans, and consulting insurance; credit brokerage services; non-performing loans recovery services to credit institutions; real estate franchise services; condominium administration franchise services; and network services for the redevelopment of buildings, as well as manages short-term rental of corporate and luxury properties. Further, it operates wikicasa.it, a portal that provides digital marketing services for real estate professionals. Gabetti Property Solutions S.p.A. was founded in 1950 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20139",
        "website": "http://www.gabettigroup.com",
        "market_cap": 80729040
    },
    "TCM.MI": {
        "short_name": "TECMA SOLUTIONS",
        "long_name": "Tecma Solutions S.p.A.",
        "summary": "TecMa Solutions S.p.A., a tech company, provides technical marketing, business strategies, and other real estate related services to real estate investors, developers, and companies. The company develops go-to-market strategies for enhancing new residential real estate projects, and speeding up and facilitating sales operations through a digitized technological platform. It develops marketing and commercial strategies; plans marketing suites in which sales representatives meet and engage with prospective clients; provides sales tools to support broker agency; and offers virtual architecture that generates buying experiences. The company was founded in 2012 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20159",
        "website": "http://www.tecmasolutions.com",
        "market_cap": null
    },
    "VIA.MI": {
        "short_name": "VIANINI",
        "long_name": "Vianini S.p.A.",
        "summary": "Vianini S.p.A. engages in the development, sale, leasing, and maintenance of real estate properties. Its real estate portfolio includes apartments located in residential areas. The company was formerly known as Vianini Industria S.p.A. The company was founded in 1892 and is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00195",
        "website": "http://www.vianinispa.com",
        "market_cap": 32814888
    },
    "YIV.MI": {
        "short_name": "IMVEST",
        "long_name": "Imvest S.p.A.",
        "summary": "Imvest S.p.A. engages in the real estate business in Italy. The company leases commercial and office buildings to public bodies, large scale distribution, industrial and banking groups, etc. It also manages the construction of real estate properties; and purchases and resells real estate complexes, building blocks, and building lots primarily to individuals. The company is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00187",
        "website": "http://www.imvest.it",
        "market_cap": 58393008
    }
}