{
    "AV.MI": {
        "short_name": "ANTARES VISION",
        "long_name": "Antares Vision S.p.A.",
        "summary": "Antares Vision S.p.A. provides track and trace, and inspection systems for the security and traceability of the products. It offers track and trace products, including serialization modules, aggregation systems, software suites, verification and decommissioning solutions, logistics and warehouse tracking system, and bottle tracking system for food, cosmetics, medical, pharmaceutical, and beverage sectors. The company also provides beverage inspection solutions, including glass inspection system, cap level control system, bottle orientation system, bottle visual rotating system, and printing control system; food inspection solutions comprising contamination detection system and container inspection system; cosmetic inspection solutions; inspection solutions for medical devices; pharmaceutical inspection machines, such as tablets and capsules inspector, parenteral visual rotating inspections system, raised stopper inspection system, and LYO-check system; and turnkey inspection solutions for beverage from FT system. In addition, it offers smart data management solutions for accurate statistics, predictive analysis, and business intelligence; remote support, software maintenance, and on site intervention services; certification training courses; remote assistance services; spare parts; and consulting services. Antares Vision S.p.A. was founded in 2007 and is headquartered in Travagliato, Italy. Antares Vision S.p.A. is a subsidiary of Regolo S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Travagliato",
        "zipcode": "25039",
        "website": "http://www.antaresvision.com",
        "full_time_employees": 751
    },
    "SEB.MI": {
        "short_name": "SEBINO",
        "long_name": "Sebino S.p.A.",
        "summary": "Sebino S.p.A. engages in the design, development, installation, and maintenance of fire-fighting systems for the detection of fires or intrusions. It also provides security system integration services for smoke detection, anti-intrusion, access control, video surveillance with video analysis, and other systems; and services for system, fire prevention, security, smoke detection, and CCTV. The company was founded in 1979 and is headquartered in Madone, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BG",
        "city": "Madone",
        "zipcode": "24040",
        "website": "http://www.sebino.eu",
        "full_time_employees": null
    },
    "TWL.MI": {
        "short_name": "TRAWELL CO",
        "long_name": "TraWell Co S.p.A.",
        "summary": "TraWell Co S.p.A., together with its subsidiaries, provides baggage protection services at airports in Europe, Russia, North America, and South America. It offers luggage wrapping, baggage tracking, bike box, luggage storage, and bag weighing scale services; and various travel accessories and products. The company also provides SafeBag24, a lost and found concierge service. In addition, it offers additional services, such as luggage deposits, luggage deliveries, concierge services, etc. The company was formerly known as Safe Bag S.p.A. and changed its name to TraWell Co S.p.A. in November 2018. TraWell Co S.p.A. was founded in 1997 and is headquartered in Gallarate, Italy. TraWell Co S.p.A. operates as a subsidiary of RG Holding S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VA",
        "city": "Gallarate",
        "zipcode": "21013",
        "website": "http://www.safe-bag.com",
        "full_time_employees": 361
    }
}