{
    "CREG.VI": {
        "short_name": "CREACTIVES GROUP S.P.A",
        "long_name": "Creactives Group S.p.A.",
        "summary": "Creactives Group S.p.A. provides a suite of applications for supply chain in Italy, Austria, Belgium, Germany, Portugal, Spain, Sweden, China, and the United Arab Emirates. Its solutions enable to optimize procurement processes, provide real-time insights, cleansing and enriching business data overcoming geographical, language, and backend systems barriers. The company offers MG Prompt, a virtual assistant that supports the end-user in categorizing data entries, including supplier onboarding, new material master data, free text order, and demand planning; UNSPSC Prompt, a virtual assistant that support the end-user in categorizing data entries based on UNSPSC Taxonomy; Matcher, a virtual assistant, which supports the end-user in material and services searches; and Smart Creaction, a virtual assistant that suggests suitable existing materials or drives the creation of a new one exploiting the description of the material provided by the end-user. It also provides Technical Attribute Management, a tool to cleanse, enrich, deduplicate, and govern the evolution of material master data, exploiting various description of the materials stored in the back-end systems, and creating a single version of the truth; and Total Spend Visibility, a service to categorize and enrich spending data for analytics. The company serves manufacturing, oil and gas/mining, and logistics companies, as well as utilities. Creactives Group S.p.A. was founded in 2000 and is based in Bologna, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Italy",
        "city": "Bologna"
    },
    "EXSY.MI": {
        "short_name": "EXPERT SYSTEM",
        "long_name": "Expert System S.p.A.",
        "summary": "Expert System S.p.A. develops and sells cognitive computing software products based on artificial intelligence (AI) algorithms to read and understand written language in Italy and internationally. The company offers Cogito cognitive technology for cognitive computing; Cogito Discover for text analytics, and extraction and categorization software; Cogito Intelligence Platform, an information intelligence software for real-time analysis of unstructured data streams; Cogito Answers, a customer support automation software that allows human like interaction between customers and internal staff; and Cogito for Claims that automate insurance claims management with natural language understanding. It also provides Cogito for Underwriting to enhance the insurance underwriting process and streamlines the risk assessment; Cogito Studio, a fully integrated development environment for building and deploying a custom AI-based text model that leverages the cognitive abilities of the Cogito platform; and Clinical Research Navigator that supports biomedical researchers with a single platform for revealing insights to drive their research and support discovery of therapies for infectious diseases, such as COVID-19 and other health crises. In addition, the company offers Medical Intelligence Platform that provides information analysts with a solution to acquire, analyze, search, and explore data points related to biological risks; and Cogito for Life Sciences to mimic the human like comprehension of scientific content, such as publications, patents, clinical trials, or medical reports. The company serves the banking and insurance, public administration, life science and pharma, oil and gas, media and publishing, and telco and utilities industries, as well as defense, and intelligence and law enforcement industries. Expert System S.p.A. was founded in 1989 and is headquartered in Modena, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Modena"
    },
    "MAIL.MI": {
        "short_name": "MAILUP",
        "long_name": "MailUp S.p.A.",
        "summary": "Mailup S.p.A., together with its subsidiaries, engages in the cloud marketing technology business in Italy, other European countries, the Americas, and Asia. It operates through E-mail Marketing, Mobile Marketing/Messaging, and Marketing Automation Segments. The company is involved in the development and sale of technologies for the mass sending of e-mails and mobile messaging through the SMS channel for marketing and transaction purposes. It also provides e-mail and newsletter editing tools; marketing technology solutions; and professional consulting services. In addition, the company offers MailUp, a platform that offers data presentation tools, including statistics for engagement that presents statistical data to help users enhance the effectiveness of their campaigns through e-mail and then to take corrective actions to enhance the performance of future campaigns, as well as the multi-list dashboard feature, which is a summary tool to have an immediate overview of the progress of campaigns. Further, it provides BEE, a drag-and-drop editor for e-mails and landing pages; Acumbamail, a Spanish e-mail marketing platform, which allows the creation, sending, and management of multi-channel marketing campaign; and Datatrics platform, which allows the marketing teams to build experiences based on data managed by artificial intelligence. Mailup S.p.A. was founded in 2002 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "MAPS.MI": {
        "short_name": "MAPS",
        "long_name": "Maps S.p.A.",
        "summary": "Maps S.p.A., a software solution provider, designs and develops technological solutions to support decision-making processes in public and private businesses and organizations. It offers Webdistilled, a semantic analysis system for marketing and communications agencies; Clinika, a semantics-based processing tool for clinical data; GZoom that supports governance in public bodies and complex organizations; and Greennebula, a cloud system for online management of environmental permits. The company is headquartered in Parma, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Parma"
    },
    "MSPAF": {
        "short_name": "MAILUP SPA",
        "long_name": "MailUp S.p.A.",
        "summary": "Mailup S.p.A., together with its subsidiaries, engages in the cloud marketing technology business in Italy, other European countries, the Americas, and Asia. It operates through E-mail Marketing, Mobile Marketing/Messaging, and Marketing Automation Segments. The company is involved in the development and sale of technologies for the mass sending of e-mails and mobile messaging through the SMS channel for marketing and transaction purposes. It also provides e-mail and newsletter editing tools; marketing technology solutions; and professional consulting services. In addition, the company offers MailUp, a platform that offers data presentation tools, including statistics for engagement that presents statistical data to help users enhance the effectiveness of their campaigns through e-mail and then to take corrective actions to enhance the performance of future campaigns, as well as the multi-list dashboard feature, which is a summary tool to have an immediate overview of the progress of campaigns. Further, it provides BEE, a drag-and-drop editor for e-mails and landing pages; Acumbamail, a Spanish e-mail marketing platform, which allows the creation, sending, and management of multi-channel marketing campaign; and Datatrics platform, which allows the marketing teams to build experiences based on data managed by artificial intelligence. Mailup S.p.A. was founded in 2002 and is headquartered in Milan, Italy.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "city": "Milan"
    },
    "NSP.MI": {
        "short_name": "NEOSPERIENCE",
        "long_name": "Neosperience S.p.A.",
        "summary": "Neosperience S.p.A. develops cloud based software platform. Its platform enables users to understand, engage, and grow customers. The company is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "PITE.MI": {
        "short_name": "PITECO",
        "long_name": "PITECO S.p.A.",
        "summary": "PITECO S.p.A. engages in the design, development, and implementation of solutions for treasury, finance, and financial planning management worldwide. The company offers PITECO EVO, a platform designed to manage cash management, payment factory, financial planning, global liquidity management, and supply chain finance; PITECO CBC, a corporate banking communication platform that manages automation of the authorization workflows; and PITECO FRM that supports corporate financial risk management processes in compliance with the international accounting codes and observing financial risk exposures. It also provides MATCH.IT, a solution to analyze and match complex data; and PITECO AT.PRO, an information system for the back and middle office management of securities portfolio. In addition, the company offers consultancy and assistance services, including consultancy tailored to client needs, customer care, software customizing, customizable product releases, and application management. It serves various customers in automation and paper, automotive, chemical and pharmaceutical, healthcare, construction and tile, consumer goods, fashion, finance and insurance, food, logistics and travelling, mechanics and steel, media, retail, services, telecom, utilities, and oil and gas industries. The company was founded in 1980 and is headquartered in Milan, Italy. PITECO S.p.A. is a subsidiary of DEDAGROUP spa.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "TXE.F": {
        "short_name": "TXT E-SOLUTIONS  EO-,50",
        "long_name": "TXT e-solutions S.p.A.",
        "summary": "TXT e-solutions S.p.A., together with its subsidiaries, provides software solutions in Italy and internationally. The company operates through two divisions, Aerospace, Aviation & Automotive, and Fintech. It provides on-board software, flight simulators, training systems, flight support systems, and advanced manufacturing solutions, as well as specialized engineering services to aerospace companies and airline operators. The company also offers on-board software and systems for the automotive and transport sectors. It also offers solutions and services for the banking and finance industry; solutions for credit collection and non-performing loans management; risk management and AML solutions; treasury; payments solutions; and consulting services. The company was formerly known as TXT Ingegneria Informatica S.p.A. and changed its name to TXT e-solutions S.p.A. in March 2000. TXT e-solutions S.p.A. was founded in 1989 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "city": "Milan"
    },
    "TXT.MI": {
        "short_name": "TXT E-SOLUTIONS",
        "long_name": "TXT e-solutions S.p.A.",
        "summary": "TXT e-solutions S.p.A., together with its subsidiaries, provides software solutions in Italy and internationally. The company operates through two divisions, Aerospace, Aviation & Automotive, and Fintech. It provides on-board software, flight simulators, training systems, flight support systems, and advanced manufacturing solutions, as well as specialized engineering services to aerospace companies and airline operators. The company also offers on-board software and systems for the automotive and transport sectors. It also offers solutions and services for the banking and finance industry; solutions for credit collection and non-performing loans management; risk management and AML solutions; treasury; payments solutions; and consulting services. The company was formerly known as TXT Ingegneria Informatica S.p.A. and changed its name to TXT e-solutions S.p.A. in March 2000. TXT e-solutions S.p.A. was founded in 1989 and is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "YSFT.MI": {
        "short_name": "SOFTEC",
        "long_name": "Softec S.p.A.",
        "summary": "Softec S.p.A., a digital platform company, provides customer experience designer services in Italy and internationally. Its cloud-based platform enables the collection, aggregation, inspection, and correlation of data about physical and nonphysical spaces to provide useful information to enhance users' experiences. The company offers experience design, data driven marketing, platform, and digital transformation services. It serves the banking, insurance, tourism, leisure, healthcare, retail, GDO, manufacturing, and food and beverage industries. The company was founded in 1998 and is headquartered in Milan, Italy. Softec S.p.A. is a subsidiary of Fullsix S.p.A.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    }
}