{
    "EK4.F": {
        "short_name": "EMAK SPA  EO 0,26",
        "long_name": "Emak S.p.A.",
        "summary": "Emak S.p.A., together with its subsidiaries, develops, manufactures, and markets various products in the outdoor power equipment, pumps and high pressure water jetting, and components and accessories business areas. The company offers brush cutters, lawnmowers, garden tractors, chainsaws, tillers, motor hoes, and walking tractors for gardening, forestry, and small agricultural equipment under the Oleo-Mac, Efco, Bertolini, Nibbi, and Staub brands. It also provides centrifugal and diaphragm pumps for agriculture; piston pumps for the industrial sector; professional and semi-professional high-pressure washers, floor washing drying machines, and vacuum cleaners; and hydrodynamic units and urban cleaning machines under the Comet, HPP, Lemasa, PTC Waterjetting Equipment, PTC Urban Cleaning Equipment, and Lavor brands. In addition, the company offers lines and heads for brush-cutters; chainsaw accessories; pistols, valves, and nozzles for pressure cleaners and agricultural applications; precision farming sensors and computers; and technical seats and spare parts for tractors under the Tecomec, Mecline, and Sabart brands, as well as other third party brands. It serves customers through specialized dealers, and own branches, as well as through a network of distributors. The company has operations in Italy, rest of Europe, the Americas, Asia, Africa, and Oceania. Emak S.p.A. was founded in 1972 and is headquartered in Bagnolo in Piano, Italy. Emak S.p.A. is a subsidiary of Yama S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RE",
        "city": "Bagnolo In Piano",
        "zipcode": "42011",
        "website": "http://www.emak.it",
        "market_cap": "Small Cap"
    },
    "EM.MI": {
        "short_name": "EMAK",
        "long_name": "Emak S.p.A.",
        "summary": "Emak S.p.A., together with its subsidiaries, develops, manufactures, and markets various products in the outdoor power equipment, pumps and high pressure water jetting, and components and accessories business areas. The company offers brush cutters, lawnmowers, garden tractors, chainsaws, tillers, motor hoes, and walking tractors for gardening, forestry, and small agricultural equipment under the Oleo-Mac, Efco, Bertolini, Nibbi, and Staub brands. It also provides centrifugal and diaphragm pumps for agriculture; piston pumps for the industrial sector; professional and semi-professional high-pressure washers, floor washing drying machines, and vacuum cleaners; and hydrodynamic units and urban cleaning machines under the Comet, HPP, Lemasa, PTC Waterjetting Equipment, PTC Urban Cleaning Equipment, and Lavor brands. In addition, the company offers lines and heads for brush-cutters; chainsaw accessories; pistols, valves, and nozzles for pressure cleaners and agricultural applications; precision farming sensors and computers; and technical seats and spare parts for tractors under the Tecomec, Mecline, and Sabart brands, as well as other third party brands. It serves customers through specialized dealers, and own branches, as well as through a network of distributors. The company has operations in Italy, rest of Europe, the Americas, Asia, Africa, and Oceania. Emak S.p.A. was founded in 1972 and is headquartered in Bagnolo in Piano, Italy. Emak S.p.A. is a subsidiary of Yama S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RE",
        "city": "Bagnolo In Piano",
        "zipcode": "42011",
        "website": "http://www.emak.it",
        "market_cap": "Small Cap"
    },
    "FVI.MI": {
        "short_name": "FERVI",
        "long_name": "Fervi S.p.A.",
        "summary": "Fervi S.p.A. designs, manufactures, sources, and sells machinery, tools, and equipment. Its products include metal and wood working, finishing, and lifting and handling machinery, as well as presses and hydraulic pumps, lathes, mills and drills, and car and motorcycle workshop products; machinery accessories, which include machine vices, tables and dividers, chucks and live centers, tool posts and tool holders, turning and milling, and other machinery accessories; and abrasives, such as flap discs, cutting wheels, cleaning and polishing products, abrasive belts, abrasive wheels, and wire brushes. The company also provides micrometers, dial indicators, measuring tools, scales, analogic and digital meters, precision tapes, and levels and goniometers, as well as calipers, height gauges, and protractors; gauge blocks, screw gauges, and hole plain gauges; dial and digital calipers, magnifier lens and multimeters, micrometers and feelers, rulers, screw pitch gauges, and vernier calipers; and square, levels, and measuring tapes, as well as cleaning and maintenance products. In addition, it offers hardware products, such as wrenches, cutting tools, socket wrenches and screw extractors, screwdrivers and hand riveters, pliers, hammers, files, workshop furniture, and sets and fastenings. Further, the company provides cutting tools, including milling tools, taps and dies, sprays and greaser guns, drills and hole saws, inserts, lathe tools, tool bits, thread repair tools, and bandsaw and saw blades. Additionally, it offers bench vices, clamps and anvils, soldering and hot air guns, and equipment for liquid and fluids; and general tools for construction and packaging, pneumatic, gardening, and safety and protection, as well as heaters, lighting products, and lenses. The company was formerly known as Veprug S.r.l. Fervi S.p.A. is based in Vignola, Italy. Fervi S.p.A. is a subsidiary of 1979 Investimenti S.R.L.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MO",
        "city": "Vignola",
        "zipcode": "41058",
        "website": "http://www.fervi.com",
        "market_cap": "Small Cap"
    },
    "VIM.MI": {
        "short_name": "VIMI FASTENERS",
        "long_name": "vimi fasteners S.p.a.",
        "summary": "Vimi Fasteners S.p.A. manufactures and supplies various fastener systems for the automotive, industrial engine and vehicle, oil and gas, and aerospace and motorsport markets in Italy. The company offers crankcase screws and studs, cylinder head screws, flywheel bolts, bearing cap screws, connecting rod screws, screws for timing belt pulleys, adjusting screws for rocker arm distribution, and studs for exhaust systems and turbocharger screws; and turbocharger shafts, high temperature resistance studs and screws, and pins. It also provides exhaust manifold and exhaust systems, including locking knurling studs, and special screws and studs for high temperature applications; power transmission products; braking systems; and suspensions and wheel hubs. The company was formerly known as Viterie Mirabello. Vimi Fasteners S.p.A. founded in 1967 and is headquartered in Novellara, Italy. Vimi Fasteners S.p.A. operates as a subsidiary of Finregg S.p.a.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RE",
        "city": "Novellara",
        "zipcode": "42017",
        "website": "http://www.vimifasteners.com",
        "market_cap": "Small Cap"
    }
}