{
    "1301.SR": {
        "short_name": "United Wire Factories Co.",
        "long_name": "United Wire Factories Company",
        "summary": "United Wire Factories Company manufactures and sells steel wire products for the civil, agricultural, and industrial sectors in the Kingdom of Saudi Arabia. The company provides steel rebars, wire meshes, ladder meshes, nails, and fences, as well as tying, concertina, and barbed wires for use in the construction and building materials sector. It also offers bailing and black annealed wires, cloth hangers, welded wire mesh sheets and rolls, and staple clips for use in civil sector; and black drawn, galvanized, PVC coated, and deformed wires for use in industrial products. In addition, the company also offers lattice wires, metal braiding wires, reinforcing steel bars, reinforcing steels, metal strips, plastic tapes, oxygen wires, metal bondings, and woods, as well as carpentry, iron, angles, rectangles, rectification, cutting, reinforcing, smelting, and rolling of iron, and import and export. United Wire Factories Company was founded in 1990 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11383",
        "website": "http://unitedwires.com.sa",
        "market_cap": "Small Cap"
    },
    "1302.SR": {
        "short_name": "Bawan Co.",
        "long_name": "Bawan Company",
        "summary": "Bawan Company manufactures and sells building materials to infrastructure, industrial, and commercial and residential development projects in Saudi Arabia, the Arab Gulf, the Middle East, and North Africa. It operates through Metal and Wood, Plastic, Electrical, and Concrete segments. It engages in cutting and bending custom-made steel; manufacturing stainless steel wires and resin epoxy corrosion resistant steel re-bars; iron formation activities; production of corrugated sheets, forming steel bars, wire rod coils, and cold and hot rolled coils; and provision of hand trucks and trolleys, plastering nets, decorative metal pipes, metal props and steel frame scaffolds, metal doors, sliding gates, aluminum doors and windows, hanging aluminum and glass products, ceiling domes, and building claddings. It provides various wood products, including wooden panels covered with melamine; wooden decorative panels; wood packaging materials, such as wooden pallets, packaging boxes, cable drums, and others; and doors, cabinets, and supplementary wooden and hardware products. It offers oil filled electrical hermetically sealed transformers; medium and low voltage electrical products, power substations, electric automation systems, electric safety and security systems, and low-current systems; and electrical transformers. It provides precast and pre-stressed products comprising twin tiles, stairways, concrete columns and beams, concrete tiles, pre-stressed concrete sections, reinforced concrete beams, insulated concrete forms, sidewalk tiles, precast concrete panels, hollow ceilings, concrete columns, bridges, load-bearing walls, retaining walls, fences, concrete traffic barriers, aesthetic concrete elements, car bumpers, architectural wall claddings, and insulating walls and stairways, as well as ready-mix concrete products. It offers plastic packaging and insulation products, and logistics services. The company founded in 1980 and is headquartered in Riyadh, Saudi Arabia. Bawan Company operates as a subsidiary of Atheel Holding Co.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": null,
        "website": "http://www.bawan.com.sa",
        "market_cap": "Small Cap"
    },
    "1330.SR": {
        "short_name": null,
        "long_name": "Abdullah Abdul Mohsin Al-Khodari Sons Company",
        "summary": "Abdullah Abdul Mohsin Al-Khodari Sons Company operates as a general contracting company in the Middle East. The company is primarily involved in civil engineering, roads and bridges, railways, buildings and infrastructure, water and waste water treatment, oil and gas pipelines in support of petrochemical production, city cleaning and environment, land transportation, and operation and maintenance activities. It also undertakes resorts and housing projects. The company was founded in 1966 and is headquartered in Al Khobar, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.alkhodari.com",
        "market_cap": "Micro Cap"
    },
    "1831.SR": {
        "short_name": "Maharah Human Resources Co.",
        "long_name": "Maharah for Human Resources Company",
        "summary": "Maharah for Human Resources Company offers recruitment services for public and private sectors in the Kingdom of Saudi Arabia and the United Arab Emirates. It operates in two segments, Corporate and Individual. The Corporate segment provides labor force services to various industries comprising retail, hospitality, healthcare, operation and maintenance, and banking. The Individual segment offers worker rental services; and khidma, a program for providing part-time housekeepers and home care nurses on an hourly basis, as well as full-time home care nurses. Maharah for Human Resources Company also offers building cleaning services; and operates an online recruitment platform. The company was formerly known as Maharah Foreign Recruitment Company and changed its name to Maharah for Human Resources Company in April 2017. Maharah for Human Resources Company was founded in 2013 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13325",
        "website": "http://www.maharah.com",
        "market_cap": "Small Cap"
    },
    "2030.SR": {
        "short_name": "Saudi Arabia Refineries Co.",
        "long_name": "Saudi Arabia Refineries Co.",
        "summary": "Saudi Arabia Refineries Co. engages in the extraction of crude oil in the Kingdom of Saudi Arabia. It is also involved in the construction of refineries and petrochemical plants; buying and selling of lands and real estate; and management and leasing of non-residential real estate properties, as well as dealing in securities. Saudi Arabia Refineries Co. was founded in 1960 and is based in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "23215",
        "website": "http://www.almasafi.com.sa",
        "market_cap": "Small Cap"
    },
    "2040.SR": {
        "short_name": "Saudi Ceramic Co.",
        "long_name": "Saudi Ceramic Company",
        "summary": "Saudi Ceramic Company manufactures and sells ceramic products, water heaters, and other products in Saudi Arabia and internationally. The company offers floor tiles; sanitary ware, such as wash basins, water closets, seat covers, flushing mechanisms, and wash basin mixers; bathroom accessories, including soap holders, towel rods, tissue roll dispensers, shower heads, shattafs, robe hooks, and mirrors; and other products comprising bathtubs, shower trays, bath mixers, and electrical products. It also provides electric, smart, and solar water heaters, as well as spare parts; ceramic road markers; and plastics and acrylics; boilers, special paints for ceramic products, red pottery bricks and derivatives, plastic and ceramic pipes; and drinking water coolers, bathtubs, plastic and ceramic showers, plastic road signs, and various construction and housing project solutions. In addition, the company engages in the extraction, processing, formation, and marketing of raw materials, including silica sand, dolomite, feldspar, red clay, kaolin, limestone, gypsum powder, sandstone, and sand; quarry and mining sites management; construction and management of crushers and mills in raw material sites; and collection of various materials for recycling, including recycling and collection of waste and materials. Further, it is involved in the import, wholesale and retail trade, and electronic commerce of building materials and other products for government and private enterprises. Additionally, the company engages in the construction, repair, reconstruction, and installation of factories and laboratories, and buildings; prefabricated concrete; installation of machinery, equipment, and industrial machinery; and project implementation; repair of vehicles; and operation of restaurants. It offers its products through distributors and wholesalers, as well as through a network of 30 showrooms. The company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11481",
        "website": "http://www.saudiceramics.com",
        "market_cap": "Small Cap"
    },
    "2160.SR": {
        "short_name": "Saudi Arabian Amiantit Co.",
        "long_name": "The Saudi Arabian Amiantit Company",
        "summary": "The Saudi Arabian Amiantit Company, together with its subsidiaries, manufactures and sells various types of pipes and related products in Saudi Arabia, Europe, and internationally. The company operates in two segments, Pipe Manufacturing and Technology, and Water Management. It offers pipe system products, including glass reinforced polyester, glass reinforced vinylester, glass reinforced epoxy, ductile iron, thermoplastic, and reinforced concrete pipes; and develops and licenses related technologies. The company also manufactures and sells underground and aboveground tanks, such as water tanks, chemical tanks, septic tanks, and fuel tanks for residential and industrial applications; and supplies ribbed and non-ribbed, and single wall and double wall tanks, as well as installs underground tanks. In addition, it provides rubber rings and gaskets for the use in pipes and fittings; grommets and bushes for anti-vibration isolation and compression mounting in A/C systems; duct sealing units for use in air condition ducts; insulation tubes and sheets for thermal insulation in refrigeration, heating, ventilation, and air conditioning applications; and industrial valves for water applications. Further, the company offers manholes for the inspection and maintenance, ventilation, cleaning, and flushing of drains or sewers, as well as for housing of pumping stations and inlet drain pits; and fiberglass products, which are used in pipe and tank, transportation, construction, marine, electrical/electronic, wind energy, consumer goods, aerospace, etc. applications. Additionally, it provides water management, and related consultancy and engineering services. The company serves customers in the municipal and urban development, industrial, oil and gas, water transmission and distribution, and water well industries. The Saudi Arabian Amiantit Company was founded in 1968 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "32234",
        "website": "http://www.amiantit.com",
        "market_cap": "Micro Cap"
    },
    "2240.SR": {
        "short_name": "Zamil Industrial Investment Co.",
        "long_name": "Zamil Industrial Investment Company",
        "summary": "Zamil Industrial Investment Company, together with its subsidiaries, engages in the design and engineering, manufacturing, and fabrication of construction materials, pre-engineering steel buildings, steel structures, air conditions, and climate control systems for commercial, industrial, and residential applications, as well as for telecom and broadcasting towers, process equipment, fiberglass, rockwool and engineering plastic foam insulation, and solar power projects. It operates through four segments: Air Conditioners Industry, Steel Industry, Insulation Industry, and Corporate and Others. The Air Conditioners Industry segment produces window, split, and central air conditioners; electrical and gas ovens; automatic dryers; microwave ovens; air-conditioning ducts/channels; household refrigerators; and automatic washing machines, as well as engages in the installation, maintenance, operation, and leasing of air conditioning and refrigeration systems. The Steel Industry segment engages in constructing, managing, and operating industrial projects, airports, and warehouses; constructing and providing fire protection services for building and structures; building, repairing, and maintaining the communication towers. This segment is also involved in the business of steel sheets works, heavy equipment and its spare parts, and storage tanks; installation of containers and pumps; and implementation of electric works. The Insulation Industry segment engages in the production of insulation products, including fiberglass for thermal insulation of central air conditioners, pre-insulated pipes, glass wool, rock wool, and engineering plastic foam insulations. The Corporate and Others segment is involved in the provision of corporate and shared services, as well as training and investment activities. It operates in Saudi Arabia, other Asian countries, and Africa. Zamil Industrial Investment Company was founded in 1998 and is headquartered in Dammam, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Dammam",
        "zipcode": "31424",
        "website": "http://www.zamilindustrial.com",
        "market_cap": "Small Cap"
    },
    "2360.SR": {
        "short_name": "Saudi vitrified clay pipes co.",
        "long_name": "Saudi Vitrified Clay Pipe co.",
        "summary": "Saudi Vitrified Clay Pipe co. manufactures and sells vitrified clay pipes and fittings in Saudi Arabia and internationally. It offers pipes, perforated pipes, flexible joints, junctions, bends, special fittings, and accessories. The company was founded in 1977 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11442",
        "website": "http://www.svcp-sa.com",
        "market_cap": "Small Cap"
    },
    "4031.SR": {
        "short_name": "Saudi Ground Services Co.",
        "long_name": "Saudi Ground Services Company",
        "summary": "Saudi Ground Services Company provides ground-handling services for passengers and aircraft in the Kingdom of Saudi Arabia. It offers a range of passenger services, including arrival and transfer, passenger manifesting and seat allocation, station management, gate, and VIP services, as well as check-in services, such as boarding pass and baggage tagging, and load planning and pre-flight editing services. The company also provides baggage handling services comprising baggage sorting and transportation, and lost and found services; ramp services; cargo loading/offloading services; and fleet cleaning services, such as cabin grooming, deep cleaning, and turnaround cleaning, as well as water and toilet services. In addition, it offers operation services and traffic control services. The company was founded in 2008 and is based in Jeddah, the Kingdom of Saudi Arabia. Saudi Ground Services Company is a subsidiary of Saudi Arabian Airlines Corporation.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21572",
        "website": "http://www.saudiags.com",
        "market_cap": "Small Cap"
    },
    "4051.SR": {
        "short_name": "Baazeem Trading Co.",
        "long_name": "Baazeem Trading Co.",
        "summary": "Baazeem Trading Co. operates as a FMCG distribution company. The company offers household cleaning solutions, such as sponge, scrubbers, steel wool, brooms, wipers, trash bags, food storage bags, table covers, and others; liquid detergents; cleaners; tuna; starch sprays; plastic oven bags; toilet cleaning products; and bed linens. It sells its products through business to business, discount store, and wholesale and retail channels in the United Arab Emirates, the Kingdom of Bahrain, and the Sultanate of Oman. The company was founded in 1978 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11451",
        "website": "http://baazeem.com",
        "market_cap": "Small Cap"
    },
    "4080.SR": {
        "short_name": "Aseer Trading\\, Tourism and Man",
        "long_name": "Aseer Trading, Tourism and Manufacturing Co.",
        "summary": "Aseer Trading, Tourism and Manufacturing Co., an investment holding company, engages in the industry, trade, tourism, agriculture, real estate development, and contracting activities. It invests in preserved food, real estate development, building and construction materials, electrical and electronic home appliances, petrochemical and derivatives, and financial and service sectors. The company was founded in 1977 and is headquartered in Abha, Saudi Arabia. Aseer Trading, Tourism and Manufacturing Co. is a subsidiary of Dallah Albaraka Holding Company.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Abha",
        "zipcode": null,
        "website": "http://www.aseercorp.com.sa",
        "market_cap": "Small Cap"
    },
    "4100.SR": {
        "short_name": "Makkah Construction and Develop",
        "long_name": "Makkah Construction & Development Company",
        "summary": "Makkah Construction & Development Company invests in, buys, develops, owns, manages, and rents real estate properties in the Kingdom of Saudi Arabia. It also undertakes engineering, construction, reconstruction, maintenance, demolition, and survey works. The company was founded in 1989 and is headquartered in Mecca, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Mecca",
        "zipcode": "21955",
        "website": "http://www.mcdc.com.sa",
        "market_cap": "Mid Cap"
    },
    "4110.SR": {
        "short_name": "Batic Investments and Logistics",
        "long_name": "Batic Investments and Logistics Company",
        "summary": "Batic Investments and Logistics Co. invests in logistic, private security, and related technologies in the Kingdom of Saudi Arabia. It provides ground and refrigerated transport. The company was founded in 1984 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11472",
        "website": "http://www.batic.com.sa",
        "market_cap": "Small Cap"
    },
    "6004.SR": {
        "short_name": "Saudi Airlines Catering Co.",
        "long_name": "Saudi Airlines Catering Company",
        "summary": "Saudi Airlines Catering Company offers catering and other support services to flights operated by Saudi Arabian and other airlines in the Kingdom of Saudi Arabia. The company operates through three segments: Inflight, Retail, and Catering and Facilities. It offers in-flight catering services; and manages airport lounges. The company also provides SkySales, an in-flight shopping service; catering, accommodation management, laundry, and cleaning services to companies in remote sites; and on-platform and onboard catering services for passengers in rail terminals. In addition, it offers catering services to private sector firms and government offices, as well as hospitals and clinics; commercial laundry services to airlines, hotels, industrial operations, hospitals, and other clients; Hajj and Umrah catering services; and security services. Saudi Airlines Catering Company was founded in 1981 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21413",
        "website": "http://www.saudiacatering.com/en/home",
        "market_cap": "Small Cap"
    }
}