{
    "4031.SR": {
        "short_name": "Saudi Ground Services Co.",
        "long_name": "Saudi Ground Services Company",
        "summary": "Saudi Ground Services Company provides ground-handling services for passengers and aircraft in the Kingdom of Saudi Arabia. It offers a range of passenger services, including arrival and transfer, passenger manifesting and seat allocation, station management, gate, and VIP services, as well as check-in services, such as boarding pass and baggage tagging, and load planning and pre-flight editing services. The company also provides baggage handling services comprising baggage sorting and transportation, and lost and found services; ramp services; cargo loading/offloading services; and fleet cleaning services, such as cabin grooming, deep cleaning, and turnaround cleaning, as well as water and toilet services. In addition, it offers operation services and traffic control services. The company was founded in 2008 and is based in Jeddah, the Kingdom of Saudi Arabia. Saudi Ground Services Company is a subsidiary of Saudi Arabian Airlines Corporation.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21572",
        "website": "http://www.saudiags.com",
        "market_cap": "Small Cap"
    },
    "6004.SR": {
        "short_name": "Saudi Airlines Catering Co.",
        "long_name": "Saudi Airlines Catering Company",
        "summary": "Saudi Airlines Catering Company offers catering and other support services to flights operated by Saudi Arabian and other airlines in the Kingdom of Saudi Arabia. The company operates through three segments: Inflight, Retail, and Catering and Facilities. It offers in-flight catering services; and manages airport lounges. The company also provides SkySales, an in-flight shopping service; catering, accommodation management, laundry, and cleaning services to companies in remote sites; and on-platform and onboard catering services for passengers in rail terminals. In addition, it offers catering services to private sector firms and government offices, as well as hospitals and clinics; commercial laundry services to airlines, hotels, industrial operations, hospitals, and other clients; Hajj and Umrah catering services; and security services. Saudi Airlines Catering Company was founded in 1981 and is headquartered in Jeddah, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21413",
        "website": "http://www.saudiacatering.com/en/home",
        "market_cap": "Small Cap"
    }
}