{"4051.SR": {"short_name": "Baazeem Trading Co.", "long_name": "Baazeem Trading Co.", "summary": "Baazeem Trading Co. operates as a FMCG distribution company. It also offers household cleaning solutions, such as sponge, scrubbers, steel wool, brooms, wipers, trash bags, food storage bags, table covers, and others. It sells its products through B2B channel, discount store, and wholesale and retail formats in the United Arab Emirates, the Kingdom of Bahrain, and the Sultanate of Oman. The company was founded in 1978 and is headquartered in Riyadh, Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}, "4080.SR": {"short_name": "Aseer Trading\\, Tourism and Man", "long_name": "Aseer Trading, Tourism and Manufacturing Co.", "summary": "Aseer Trading, Tourism and Manufacturing Co., an investment holding company, engages in the industry, trade, tourism, agriculture, real estate development, and contracting activities. It invests in preserved food, real estate development, building and construction materials, electrical and electronic home appliances, petrochemical and derivatives, and financial and service sectors. The company was founded in 1977 and is headquartered in Abha, Saudi Arabia. Aseer Trading, Tourism and Manufacturing Co. is a subsidiary of Dallah Albaraka Holding Company.", "currency": "SAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Abha"}, "4130.SR": {"short_name": "Al Baha Investment & Developmen", "long_name": "Al-Baha Investment & Development Co.", "summary": "Al-Baha Investment & Development Co. engages in industrial projects, tourism, commercial agency, and repair and maintenance businesses in the Kingdom of Saudi Arabia. It owns and reclaims agricultural land for use in the establishment of agricultural and livestock production projects. The company also establishes, invests, manages, operates, and maintains leisure and tourism enterprises and projects. In addition, it establishes refrigeration stores. Further, the company operates wedding halls, villas, cafes, and restaurants, as well as engages in the transportation business. Additionally, it produces artificial leathers, cloths, and papers, which is used to manufacture office furniture, car seat, etc. Al-Baha Investment & Development Co. was founded in 1993 and is based in Al Bahah, the Kingdom of Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Al Bahah"}, "4141.SR": {"short_name": "Al-Omran Industrial Trading Co.", "long_name": "Al-Omran Industrial Trading Co.", "summary": "Al-Omran Industrial Trading Co. manufactures and sells air conditioning products. The company also provides cashers, refrigerators and freezers, washers, shopping carts, desert air conditioners and coolers, supermarket and warehouse shelves, and plastic products. It serves home and commercial appliance industries. The company was founded in 2003 and is based in Riyadh, Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}}