{"1330.SR": {"short_name": null, "long_name": "Abdullah Abdul Mohsin Al-Khodari Sons Company", "summary": "Abdullah Abdul Mohsin Al-Khodari Sons Company operates as a general contracting company in the Middle East. The company is primarily involved in civil engineering, roads and bridges, railways, buildings and infrastructure, water and waste water treatment, oil and gas pipelines in support of petrochemical production, city cleaning and environment, land transportation, and operation and maintenance activities. It also undertakes resorts and housing projects. The company was founded in 1966 and is headquartered in Al Khobar, Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Al Khobar"}, "2320.SR": {"short_name": "Al-Babtain Power and Telecommun", "long_name": "Al-Babtain Power and Telecommunication Co.", "summary": "Al-Babtain Power and Telecommunication Co. provides solutions for power and telecommunications infrastructure in Saudi Arabia, Egypt, and France. The company offers outdoor lighting products, including street, flood, and obstruction lighting products; high mast lighting products; and lighting, mid hinged, and traffic poles, as well as flagpoles. It also manufactures transmission towers; distribution poles for overhead L.T/M.T lines; H.T transmission pole/single circuits; H.T transmission poles/double circuits; transmission monopoles for high voltage overhead lines; and testing stations. In addition, the company offers broadcasting towers; guyed mast towers; telecommunication monopoles; self-support towers; rapid deployment solutions; camouflage solutions; and rooftops. Further, it provides integrated security solutions, distribution antenna systems, and integrated traffic solutions. Al-Babtain Power and Telecommunication Co. was founded in 1955 and is based in Riyadh, Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Riyadh"}, "4100.SR": {"short_name": "Makkah Construction and Develop", "long_name": "Makkah Construction & Development Company", "summary": "Makkah Construction & Development Company invests in, buys, develops, owns, manages, and rents real estate properties in the Kingdom of Saudi Arabia. It also undertakes engineering, construction, reconstruction, maintenance, demolition, and survey works. The company was founded in 1989 and is headquartered in Mecca, the Kingdom of Saudi Arabia.", "currency": "SAR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SAU", "market": "sr_market", "country": "Saudi Arabia", "city": "Mecca"}}