{
  "INGEVEC.SN": {
    "city": "Santiago de Chile",
    "country": "Chile",
    "currency": "CLP",
    "exchange": "SGO",
    "industry": "Real Estate - Development",
    "long_name": "Ingevec S.A.",
    "market": "cl_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "INGEVEC SA",
    "state": null,
    "summary": "Ingevec S.A., together with its subsidiaries, engages in the engineering and construction of public and private infrastructure in Chile. The company is involved in the construction of residential buildings and homes, as well as commercial, industrial, and civil works. It also engages in investment, management, and development of real estate projects, as well as the provision of construction services. The company was founded in 1983 and is based in Santiago, Chile.",
    "website": "http://www.ingevec.cl",
    "zipcode": null
  },
  "MANQUEHUE.SN": {
    "city": "Vitacura",
    "country": "Chile",
    "currency": "CLP",
    "exchange": "SGO",
    "industry": "Real Estate - Development",
    "long_name": "Inmobiliaria Manquehue S.A.",
    "market": "cl_market",
    "market_cap": "Micro Cap",
    "sector": "Real Estate",
    "short_name": "INMOBIL MANQUEHUE",
    "state": null,
    "summary": "Inmobiliaria Manquehue S.A. provides real estate development services in Chile. It designs, develops, and sells houses and apartments in the Metropolitan region. The company also sells cloths for residential development and equipment. Inmobiliaria Manquehue S.A. was formerly known as Inmobiliaria y Urbanizadora and changed its name to Inmobiliaria Manquehue S.A. in 2007. The company was founded in 1978 and is based in Vitacura, Chile.",
    "website": "http://imanquehue.com",
    "zipcode": null
  },
  "PARAUCO.SN": {
    "city": "Santiago",
    "country": "Chile",
    "currency": "CLP",
    "exchange": "SGO",
    "industry": "Real Estate - Development",
    "long_name": "Parque Arauco S.A.",
    "market": "cl_market",
    "market_cap": "Small Cap",
    "sector": "Real Estate",
    "short_name": "PARQUE ARAUCO SA",
    "state": null,
    "summary": "Parque Arauco S.A. owns, develops, operates, and manages multi-format commercial real estate assets. The company owns and operates four shopping center formats, including regional, neighborhood, outlet malls, and strip centers. Its tenants include department stores, home improvement stores, supermarkets, restaurants, cinemas, health centers, and smaller stores. As of April 22, 2020, the company had 8 regional shopping centers, 1 neighborhood center, 4 premium outlet malls, and 15 strip centers in Chile; 6 regional shopping centers, 9 neighborhood centers, 2 premium outlet malls, and 3 strip centers in Peru; and 3 regional shopping centers and 1 premium outlet mall in Colombia with a total gross leasable area of 1,075,500 square meters. The company was formerly known as Cocentral Compañía de Centros Comerciales S.A. and changed its name to Parque Arauco S.A. in 1992. Parque Arauco S.A. was founded in 1979 and is based in Santiago, Chile.",
    "website": "http://www.parauco.com",
    "zipcode": null
  }
}
