{
    "BLDN.QA": {
        "short_name": "Baladna QPSC",
        "long_name": "Baladna Q.P.S.C.",
        "summary": "Baladna Q.P.S.C. produces and sells dairy products in the State of Qatar. The company operates through Dairy, Farm, and Other Activities segments. The Dairy segment offers fresh milk, yoghurt, cheese, labneh, cream, dessert, ghee, long life milk, and other dairy products, as well as Laban and Ayran milk drinks. The Farm segment is involved in slaughtering cows and selling beef meat. The Other Activities segment produces and sells sweet and frozen products, as well as sells livestock feed and medicines. It also offers fruit juices and related products; fertilizer compost; and plastic packaging materials to external parties. In addition, the company engages in the trade of food materials; retail of dairy products, eggs, olives, and pickles in specialized stores; and wholesale of soft drinks, juices, and mineral water. It serves retail outlet, as well as hotel, restaurant, and catering customers. The company was incorporated in 2014 and is headquartered in Al Khor, Qatar.",
        "currency": "QAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Al Khor",
        "zipcode": null,
        "website": "http://baladna.com",
        "market_cap": "Mid Cap"
    },
    "FALH.QA": {
        "short_name": "Al Faleh Educational Holding QP",
        "long_name": "Al Faleh Educational Holding",
        "summary": "Al Faleh Educational Holding operates educational institutions. It operates schools for kids from age 3 to 18, a college, and training center. The company is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.alfaleh.edu.qa",
        "market_cap": null
    },
    "WDAM.QA": {
        "short_name": "Widam Food QPSC",
        "long_name": "Widam Food Company Q.P.S.C.",
        "summary": "Widam Food Company Q.P.S.C. engages in slaughtering of sheep and cattle in the State of Qatar. It is also involved in the import and trade of livestock, meat, and feed products; supply of fresh meat and related products; and sale of live and frozen meats. The company was formerly known as Qatar Company for Meat and Livestock Trading (MAWASHI) Q.S.C. and changed its name to Widam Food Company Q.P.S.C. in March 2013. Widam Food Company Q.P.S.C. was incorporated in 2003 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.widam.com.qa",
        "market_cap": "Small Cap"
    },
    "ZHCD.QA": {
        "short_name": "Zad Holding QPSC",
        "long_name": "Zad Holding Company Q.P.S.C.",
        "summary": "Zad Holding Company Q.P.S.C. manufactures and distributes fast-moving-consumer-goods in Qatar and internationally. It operates through Investment and Managed Services; Trading, Manufacturing, Distribution and Services; and Contracting, Real Estate and Others segments. The company manufactures various flour and wheat based products under the QFM brand; and refines and packs various types of edible oils, such as sunflower, corn, canola, palm, and frying oil. It also produces and markets pasta and various bakery products, including sliced breads, croissants, cakes, filled rolls, muffins, and buns; frozen meat products comprising processed beef, mutton, chicken, and vegetable products under the Al Arabia brand. In addition, the company provides property management and after sales services; constructs roads, water supply and sewerage projects, industrial structures, and buildings; leases and rents transport and heavy equipment; provides logistics solutions; and transports construction materials, such as asphalt, sand, and fill materials. Further, it manufactures and supplies ready mix concrete and asphalt; crushing services; trades in bran and barley, food stuff, and cleaning items; and invests in commodities. The company was incorporated in 1969 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.zad.qa",
        "market_cap": "Mid Cap"
    }
}