{
    "BLDN.QA": {
        "short_name": "Baladna QPSC",
        "long_name": "Baladna Q.P.S.C.",
        "summary": "Baladna Q.P.S.C. produces and sells dairy products in the State of Qatar. The company operates through Dairy, Farm, and Other Activities segments. The Dairy segment offers fresh milk, yoghurt, cheese, labneh, cream, dessert, ghee, long life milk, and other dairy products, as well as Laban and Ayran milk drinks. The Farm segment is involved in slaughtering cows and selling beef meat. The Other Activities segment produces and sells sweet and frozen products, as well as sells livestock feed and medicines. It also offers fruit juices and related products; fertilizer compost; and plastic packaging materials to external parties. In addition, the company engages in the trade of food materials; retail of dairy products, eggs, olives, and pickles in specialized stores; and wholesale of soft drinks, juices, and mineral water. It serves retail outlet, as well as hotel, restaurant, and catering customers. The company was incorporated in 2014 and is headquartered in Al Khor, Qatar.",
        "currency": "QAR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Al Khor"
    },
    "WDAM.QA": {
        "short_name": "Widam Food QPSC",
        "long_name": "Widam Food Company Q.P.S.C.",
        "summary": "Widam Food Company Q.P.S.C. engages in slaughtering sheep and cattle in the State of Qatar. It is also involved in the import and trade of livestock, meat, and feed products; supply of fresh meat and related products; and sale of live and frozen meats. The company was formerly known as Qatar Company for Meat and Livestock Trading (MAWASHI) Q.S.C. and changed its name to Widam Food Company Q.P.S.C. in March 2013. Widam Food Company Q.P.S.C. was founded in 2003 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    }
}