{
    "MHM.NZ": {
        "short_name": "MHM Automation Limited",
        "long_name": "MHM Automation Limited",
        "summary": "MHM Automation Limited, together with its subsidiaries, designs and supplies automated systems and equipment for the food processing and logistics sectors in New Zealand and Australia. The company designs and fabricates stainless steel and associated equipment for industrial, dairy, wine, and food sectors; and sells and services specialized food cutting equipment. It also designs, manufactures, delivers, and services automated handling systems primarily for the food sector; and designs, manufactures, and installs chilling and freezing tunnels, and plate freezing systems to the food industry, as well as offers related services, spare parts, and support. In addition, the company develops and commercializes S-clave, a patented system for the sterilization of medical equipment in a non-porous container system. The company was formerly known as Mercer Group Limited. MHM Automation Limited was founded in 1884 and is based in Christchurch, New Zealand.",
        "currency": "NZD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "city": "Christchurch"
    },
    "SCT.NZ": {
        "short_name": "Scott Technology Limited Ordina",
        "long_name": "Scott Technology Limited",
        "summary": "Scott Technology Limited, an investment holding company, designs, manufactures, sells, and services automated and robotic production lines, and processes for various industries in New Zealand and internationally. The company operates through Australasia Manufacturing, Americas Manufacturing, Europe Manufacturing and China Manufacturing segments. The company manufactures and sells automated laboratory sampling equipment for the mining industry; high temperature superconductor equipment; patented centrifuge technology for the honey and fish processing industries; automated guided vehicles under the Transbotics brand; band-saw machines under the BladeStop brand; and x-ray and sorting technology, as well as offers robot systems under the RobotWorx brand. It also offers industrial services and systems, which includes conventional and robot palletisers, depalletisers, pallet conveyors, case conveyors, and order preparation systems with stacker cranes and other material handling equipment, as well as software package Maestro+ under the Alvey brand name; and automated heavy gauge precision metal stamping equipment under the DC Ross brand. In addition, the company provides cryogen-free electromagnetic products, such as solenoids, current leads, coils, magnets, current systems, and magnetic resonance systems under the HTS-110 brand name; and sample preparation equipment under the ROCKLABS brand. It serves appliances, materials handling and logistics, meat processing, mining, and other industrial automation industries. Scott Technology Limited was founded in 1913 and is based in Dunedin, New Zealand.",
        "currency": "NZD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "city": "Dunedin"
    },
    "SKL.NZ": {
        "short_name": "Skellerup Holdings Limited Ordi",
        "long_name": "Skellerup Holdings Limited",
        "summary": "Skellerup Holdings Limited manufactures, markets, and distributes technical polymer and elastomer products for various specialist industrial and agricultural applications. It operates through Agri and Industrial segments. The company offers food grade dairy rubberware, including liners and tubing products, and rubber footwear for agricultural applications; milk filters; milk liners, tubing, and accessories; feeding teats; dairy vacuum pumps; and dairy hygiene and livestock health management products, as well as mastitis prevention and mastitis detection equipment. It also provides sealing and waterproofing products for roofing, plumbing, and civil/underground applications; pipe seals, diaphragms, washers, gaskets, customized rubber moldings, check valves, O rings, disks, and other components for use in automotive, industrial, mining pipe, valve, and medical industries; high precision rubber and plastic components for the automotive, flow control, appliance, and industrial markets; and fabric reinforced diaphragms, and rubber metal seat valves and injector components. In addition, the company offers EVA, PE, and various blended foams for marine, sports, leisure, orthotic, and construction applications; foam and soft material products; and live wall systems for installation in new and existing chutes. It operates primarily in New Zealand, Australia, North America, the United Kingdom, Ireland, rest of Europe, Asia, and internationally. Skellerup Holdings Limited was founded in 1910 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "city": "Auckland"
    }
}