{
    "PGW.NZ": {
        "short_name": "PGG Wrightson Limited Ordinary ",
        "long_name": "PGG Wrightson Limited",
        "summary": "PGG Wrightson Limited provides goods and services for agricultural sector in New Zealand. The company operates in two segments, Agency, and Retail & Water. It operates rural supplies stores that offer a range of products in various categories, such as fencing, agricultural chemicals, animal health, animal equipment and handling, clothing, fertilizer, home and garden, machinery, animal feed and nutrition, seeds, water and irrigation, horticulture, pet supplies, safety equipment, and dairy shed supplies. The company also provides agency services for the sale, purchase, and service of livestock through auction, private and on-farm sales, and online trading of livestock; irrigation and water services to farmers and horticulturists; and markets and exports wool products. In addition, it offers insurance products; fruit fed supplies; and rural supplies, as well as farm maintenance, soil and crop nutrition, and plant and soil testing. Further, the company provides real estate services, including rural, lifestyle, residential, and commercial properties. PGG Wrightson Limited was founded in 1841 and is based in Christchurch, New Zealand.",
        "currency": "NZD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8053",
        "website": "http://www.pggwrightson.co.nz",
        "market_cap": "Micro Cap"
    },
    "STG.AX": {
        "short_name": "STRAKER TL FPO",
        "long_name": "Straker Translations Limited",
        "summary": "Straker Translations Limited, together with its subsidiaries, engages in the provision of translation services in Asia Pacific, Europe, the Middle East, Africa, and North America. The company operates AI-POWERED RAY, a suite of customizable AI and automation translation tools that creates a first draft translation and matching the customer's content with one or more of the approximately 10,000 crowd-sourced human freelance translators for refinement. It offers corporate and business translation services, such as e-commerce translation, financial translation, human resources translation, legal document translation, marketing content translation, medical document translation, technical document translation, Website translation, audio and video translation, and document translation services, as well as desktop publishing services. The company also provides language translation services; machine translation services; immigration, legal, and ECFMG translation services; birth, death, and marriage certificates translation services; and passports, visa, medical, personal and private docs, drivers license, police and legal documents, academic records and transcripts, insurance, and other document translation services, as well as translation automation solutions comprising API translation solutions. Its platform supports African, Asian, Eastern European, European, Indian, Middle Eastern, and other languages. Straker Translations Limited was incorporated in 1999 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "0632",
        "website": "http://www.strakertranslations.com",
        "market_cap": "Micro Cap"
    }
}