{
    "AAVAS.NS": {
        "short_name": "AAVAS FINANCIERS L",
        "long_name": "Aavas Financiers Limited",
        "summary": "Aavas Financiers Limited provides housing loans to customers belonging to low and middle income segments in semi-urban and rural areas in India. The company offers home loans for flats, houses, and bungalows, as well as resale properties; land purchase and construction loans, including finance for self-construction of residential house; and home improvement loans, which include loans for tiling or flooring, plaster, painting, etc. It also provides home equity loans; and micro, small, and medium enterprise loans for business expansion, purchase of equipment, working capital, etc., as well as balance transfer products. As of March 31, 2020, it operated through 250 branches covering in 10 states, including Rajasthan, Maharashtra, Gujarat, Madhya Pradesh, Haryana, Delhi, Chhattisgarh, Uttar Pradesh, Uttarakhand, and Punjab. The company was formerly known as AU Housing Finance Limited and changed its name to Aavas Financiers Limited in February 2017. Aavas Financiers Limited was incorporated in 2011 and is based in Jaipur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jaipur",
        "zipcode": "302020",
        "website": "http://www.aavas.in",
        "market_cap": "Mid Cap"
    },
    "ABCAPITAL.NS": {
        "short_name": "ADITYA BIRLA CAPIT",
        "long_name": "Aditya Birla Capital Limited",
        "summary": "Aditya Birla Capital Limited, through its subsidiaries, provides various financial products and services in India and internationally. It offers life insurance products, such as protection, wealth with protection, children's future, health, retirement, and savings with protection insurance; health; wellness; motor, damage, natural calamities, personal accident cover, and third party legal liability; and travel insurance products. The company also provides financing solutions, such as home loans, loans against property, and personal loans; lines of credit, business loans, working capital demand loans, and supply chain financing solutions for small and medium enterprises; and loans against shares, mutual funds, and life insurance policy, as well as ESOP and IPO financing, and promoter and margin trade funding services. In addition, it offers investment services, such as mutual funds, pension funds, stocks and securities, real estate investment, wealth management, and portfolio management services. Further, the company provides financial and IT enabled services; private equity investment, and advisory and management services; stock broking and depository services; and risk advisory, fund management, asset management, and trustee services, as well as other business support and value added services. Additionally, it offers advising solutions, such as MoneyForLife Planner, an online tool that offers personalized financial planning solution; and ABC of Money, which provides money solutions. The company was formerly known as Aditya Birla Financial Services Limited and changed its name to Aditya Birla Capital Limited in June 2017. The company was incorporated in 2007 and is based in Mumbai, India. Aditya Birla Capital Limited is a subsidiary of Grasim Industries Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.adityabirlacapital.com",
        "market_cap": "Mid Cap"
    },
    "ALMONDZ.NS": {
        "short_name": "ALMONDZ GLOBAL SEC",
        "long_name": "Almondz Global Securities Limited",
        "summary": "Almondz Global Securities Limited operates as an investment bank in India. The company operates through Debt and Equity Market Operations, Consultancy and Advisory Fees, Wealth Advisory/Broking Activities, Finance Activities, and Healthcare Services segments. It offers corporate finance advisory services, including initial public offerings (IPOs), follow-on public offerings, rights issues, takeovers, delisting, buy backs, and equity valuations; private equity, merger and acquisition, and corporate restructuring services; debt private placement, loan syndication, and debt restructuring services, as well as issues bonds; and infrastructure advisory, joint venture, and project advisory services, as well as merchant banking and underwriting services. The company also provides equity broking services, such as institutional equity, retail equity, equity research, and portfolio management; debt portfolio management services comprising money market operation and debt trading; and wealth management services, which include mutual funds, equity and debt IPOs, derivative strategies, and other financial products. In addition, it offers commodity, real estate, and insurance broking services, as well as healthcare services; grants loans; and establishes, administers, owns, and operates eye care hospitals. The company was founded in 1994 and is headquartered in New Delhi, India. Almondz Global Securities Limited is a subsidiary of Avonmore Capital & Management Services Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.almondzglobal.com",
        "market_cap": "Nano Cap"
    },
    "ANGELBRKG.NS": {
        "short_name": "Angel Broking Limited",
        "long_name": "Angel Broking Limited",
        "summary": "Angel Broking Limited provides broking and advisory services, margin funding, loans against shares, and financial products to its clients under the Angel Broking brand in India. The company operates in three segments: broking and Related Services; Finance and Investing Activities; and Health and Allied Fitness Activities. It offers broking services through online and digital platforms, and trading terminals, as well as network of sub-brokers. The company's products include equity, commodities, derivatives, and currency trading. Its services comprise portfolio management, investment advisory, intraday trading, trading account, portfolio health score, initial public offering, and DEMAT account, as well as loans against shares. The company also engages in the investment activities; and operation of fitness centers. Angel Broking Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.angelbroking.com",
        "market_cap": "Small Cap"
    },
    "ARMANFIN.NS": {
        "short_name": "ARMAN FINANCIAL SE",
        "long_name": "Arman Financial Services Limited",
        "summary": "Arman Financial Services Limited, together with its subsidiary, operates as a non-banking finance company in India. It offers financing for the purchase of two and three wheelers. The company also provides loans to micro, small, and medium enterprises; and group based microfinance services. It operates through a network of 211 branches and 55 dealer touch-points. The company was incorporated in 1992 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380014",
        "website": "http://www.armanindia.com",
        "market_cap": "Micro Cap"
    },
    "ATNINTER.NS": {
        "short_name": "ATN INTERNATIONAL",
        "long_name": "ATN International Limited",
        "summary": "ATN International Limited engages in the trading of shares and securities in India. The company was incorporated in 1983 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700072",
        "website": "http://www.atninternational.co.in",
        "market_cap": "Nano Cap"
    },
    "AUBANK.NS": {
        "short_name": "AU SMALL FINANCE B",
        "long_name": "AU Small Finance Bank Limited",
        "summary": "AU Small Finance Bank Limited provides various banking and financial services in India. It operates through Treasury, Retail Banking, Wholesale Banking, and Other Banking Operations segments. The company offers savings and current accounts; fixed and recurring deposits; locker services; point of sale machines; mutual funds; general, fire, life, and health insurance products; and investment products. It also provides vehicle, commercial vehicle, tractor, two-wheeler, home, consumer finance and personal, gold, secured business, and agri-SME loans, as well as NBFC/HFC/MFI lending; business banking, trade finance and forex; and construction and builder finances. In addition, the company offers bank guarantee, letters of credit, discounting of letter of credit, clean bill discounting, import and export bill collections, and inward and outward remittance services; digital banking services, such as Internet, missed call and mobile banking; unified payment interface and Bharat bill payment systems; and EMI payment and other payments services; and government banking services to central government, states governments, central and state public sector undertakings, boards, defense, urban local bodies, and other government departments. As of March 31, 2020, it operated 406 bank branches, 122 banking outlets, 88 business correspondents, 31 asset centers, 13 offices, and 356 ATMs. The company was formerly known as AU Financiers (India) Limited and changed its name to AU Small Finance Bank Limited in May 2017. AU Small Finance Bank Limited was founded in 1996 and is headquartered in Jaipur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jaipur",
        "zipcode": "302001",
        "website": "http://www.aubank.in",
        "market_cap": "Mid Cap"
    },
    "AUSOMENT.NS": {
        "short_name": "AUSOM ENTERPRISE",
        "long_name": "Ausom Enterprise Limited",
        "summary": "Ausom Enterprise Limited engages in the trading activities in India. It trades in commodities, bullions, gold jewelry, shares and securities, diamonds, derivatives, and units of mutual funds. The company was formerly known as Core Emballage Limited. Ausom Enterprise Limited was incorporated in 1984 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.ausom.in",
        "market_cap": "Nano Cap"
    },
    "AXISBANK.NS": {
        "short_name": "AXIS BANK",
        "long_name": "Axis Bank Limited",
        "summary": "Axis Bank Limited provides corporate and retail banking products and services in India and internationally. The company's deposit products include savings, salary, and current accounts, as well as fixed, recurring, tax saver fixed, and flexi deposits. It also provides home, personal, holiday, car, business, gold, two wheeler, working capital, and education loans, as well as loans against properties, securities, and fixed deposits; and commercial vehicle and construction equipment loans. In addition, the company offers safe deposit locker, safe custodian, and pension system services; foreign exchange services; investment products; and life, general, home, health, travel, motor, and business guard insurance products. Further, it provides cash management, trade, treasury, capital market, corresponding banking and financial institutions, pension, and bullion services; debit and credit cards; mutual funds, public provident funds, demat accounts, and systematic investment plan; products and services for non-resident Indians; agricultural and rural banking products and services; and burgundy and priority banking products and services. Additionally, the company offers corporate, online, mobile, and phone banking; trade finance; and risk management solutions. Axis Bank Limited operates approximately 4,528 domestic branches with 12,044 ATMs and 5,433 cash recyclers; 11 overseas offices with branches at Singapore, Hong Kong, Dubai, Colombo, Shanghai, and Gift City-IBU; and representative offices at Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.axisbank.com",
        "market_cap": "Large Cap"
    },
    "BAJAJFINSV.NS": {
        "short_name": "BAJAJ FINSERV LTD",
        "long_name": "Bajaj Finserv Ltd.",
        "summary": "Bajaj Finserv Ltd. (Â\u0091Bajaj Finserv', Â\u0091BFS' or Â\u0091the Company') is the holding company for the various financial services businesses under the Bajaj group. It serves millions of customers by providing solutions for asset acquisition through financing, asset protection through general insurance, family and income protection in the form of life and health insurance and retirement and savings solutions.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411014",
        "website": "http://www.bajajfinserv.in/corporate-bajaj-finserv",
        "market_cap": "Large Cap"
    },
    "BAJAJHLDNG.NS": {
        "short_name": "BAJAJ HLDG & INVES",
        "long_name": "Bajaj Holdings & Investment Limited",
        "summary": "Bajaj Holdings & Investment Limited operates as an investment company in India. It invests in companies operating in the auto, construction/infra, telecom, material/resources/oil and gas, consumer/education, technology, pharmaceutical/agrochemical/healthcare, financial, and other sectors. The company was founded in 1926 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411035",
        "website": "http://www.bhil.in",
        "market_cap": "Mid Cap"
    },
    "BAJFINANCE.NS": {
        "short_name": "BAJAJ FINANCE LTD",
        "long_name": "Bajaj Finance Limited",
        "summary": "Bajaj Finance Ltd. operates as a non-banking financial company in India. It offers durable, lifestyle, digital product, two and three wheeler, retailer, developer, used car, vendor, light engineering, corporate, and warehouse finance; personal, gold, home, business, working capital, and professional loans; and loan against fixed deposits, shares, properties, and securities. The company provides extended warranty; retail EMI; e-commerce; lease rental discounting; EMI cards, and co-branded credit cards and wallets, as well as offers investment services, such as fixed deposits and mutual funds. The company was formerly known as Bajaj Auto Finance Limited and changed its name to Bajaj Finance Limited in September 2010. The company was incorporated in 1987 and is based in Pune, India. Bajaj Finance Ltd. is a subsidiary of Bajaj Finserv Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411 014",
        "website": "http://www.bajajfinserv.in/corporate-bajaj-finance",
        "market_cap": "Large Cap"
    },
    "BANDHANBNK.NS": {
        "short_name": "BANDHAN BANK LTD",
        "long_name": "Bandhan Bank Limited",
        "summary": "Bandhan Bank Limited provides commercial banking services in India. It operates through Treasury, Retail Banking, Corporate/Wholesale Banking, and Other Banking Business segments. The company offers savings, current, fixed deposit, and corporate salary accounts. It also provides retail loans, such as home loans, two wheeler loans, and loans against property and term deposits, as well as personal and gold loans; MSME loans, including business, equipment, commercial vehicle, working capital, and term loans; small enterprise loans; microloans for home-based businesses; and agriculture loans. In addition, the company invests in sovereign securities; offers liability products, card services, Internet and mobile banking, ATM, trading, and NRI services; and distributes third party products. As of March 31, 2020, it operated 1,018 branches, 3,346 banking units, 195 home loan centers, and 485 ATMs. The company was founded in 2015 and is headquartered in Kolkata, India. Bandhan Bank Limited is a subsidiary of Bandhan Financial Holdings Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700091",
        "website": "http://www.bandhanbank.com",
        "market_cap": "Mid Cap"
    },
    "BANKBARODA.NS": {
        "short_name": "BK OF BARODA",
        "long_name": "Bank of Baroda",
        "summary": "Bank of Baroda provides various banking products and services to individual, government departments, and corporate customers. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. It offers fixed, current, recurring, and savings deposit products, as well as NRI account and foreign currency deposits. The company also provides loans, such as home, education, vehicle, personal, mortgage, commission agents, and traders loans, as well as advances against securities and gold ornaments/jewelries, and loans for public issues/initial public offers; professional, composite, small business borrower, capital expenditure, bridge, and short term corporate loans, as well as loans for micro, small, and medium enterprises; working capital finance, term finance, commercial vehicle finance, export and import finance, bill finance, lines of credit, loans against rent receivables, term finance, project finance, infrastructure finance, loans for takeover of accounts, foreign currency credit, supply chain finance, and non-fund based services; and debit, prepaid, and credit cards. In addition, it offers loans and advances, and pensions and government schemes to rural and agricultural customers; life insurance, general insurance, and health insurance products, as well as mutual funds; appraisal, merchant banking, cash management, remittance, collection, electronic clearing, correspondent banking, treasury, trade finance, investment, lockers, and capital market services; and digital banking services, including mobile banking, internet payment gateway, Bharat bill payment system, Baroda FASTag, self-service passbook printer, and Baroda TabiT. Further, the company offers banking solutions for start-ups. As of March 31, 2020, it operated a network of 9,482 branches; 101 overseas branches; 13,193 ATMs; and 1,252 e-lobbies. Bank of Baroda was founded in 1908 and is headquartered in Vadodara, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390007",
        "website": "http://www.bankofbaroda.in",
        "market_cap": "Mid Cap"
    },
    "BANKINDIA.NS": {
        "short_name": "BK OF INDIA",
        "long_name": "Bank of India Limited",
        "summary": "Bank of India Limited provides various banking products and services. It operates through Treasury Operations, Wholesale Banking, and Retail Banking segments. The company accepts various deposit products, such as savings, current, salary, term, and tax saving deposits. It also offers home, education, vehicle, personal, pensioner, holiday, top-up, and demand/term loans, as well as loan for Pradhan Mantri Awas Yojana and against property; housing loans to NRIs/PIOs; overdraft against securities; loans against FCNR deposits; and loans for corporate and MSME customers. In addition, the company provides cash management services; trade finance; online share trading services; insurance products and services; mutual fund products; portfolio management services; credit, debit, and prepaid cards; and remittance, online banking and payment, online income tax return, and ATM and other kiosk services, as well as cards, loans, and services to rural customers. As of March 31, 2020, it operated 5,083 branches in India; and 24 branches and 1 representative office internationally. The company was founded in 1906 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.bankofindia.co.in",
        "market_cap": "Mid Cap"
    },
    "BFINVEST.NS": {
        "short_name": "BF INVESTMENT LTD",
        "long_name": "BF Investment Limited",
        "summary": "BF Investment Limited operates as a non deposit taking core investment company in India. It is involved in the loans and investments business. The company was incorporated in 2009 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411036",
        "website": "http://www.bfilpune.com",
        "market_cap": "Micro Cap"
    },
    "BINDALAGRO.NS": {
        "short_name": "OSWAL GREENTECH LI",
        "long_name": "Oswal Greentech Limited",
        "summary": "Oswal Greentech Limited develops and promotes residential and commercial real estate projects in India. The company operates through Real Estate and Investment segments. It is also involved in the trading of real estate assets. In addition, the company invests in equity instruments and other securities. The company was formerly known as Oswal Chemicals & Fertilizers Limited and changed its name to Oswal Greentech Limited in November 2011. Oswal Greentech Limited was incorporated in 1981 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.oswalgreens.com",
        "market_cap": "Micro Cap"
    },
    "BIRLAMONEY.NS": {
        "short_name": "ADITYA BIRLA MONEY",
        "long_name": "Aditya Birla Money Limited",
        "summary": "Aditya Birla Money Limited engages in the securities brokerage and financial product distribution businesses in India. It provides broking, portfolio management, depository, and e-insurance repository services; and invests in debt instruments and mutual funds. The company also offers equity and derivative trading services through NSE and BSE; currency derivatives on MCX-SX; and commodities trading services through MCX and NCDEX. Aditya Birla Money Limited operates through 41 branches and 755 franchised offices. The company was incorporated in 1995 and is based in Chennai, India. Aditya Birla Money Limited is a subsidiary of Aditya Birla Capital Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://stocksandsecurities.adityabirlacapital.com",
        "market_cap": "Nano Cap"
    },
    "BLBLIMITED.NS": {
        "short_name": "BLB",
        "long_name": "BLB Limited",
        "summary": "BLB Limited provides securities brokerage services in India. It trades and invests in shares, securities, and commodities. The company was founded in 1965 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110002",
        "website": "http://www.blblimited.com",
        "market_cap": "Nano Cap"
    },
    "BLUECHIP.NS": {
        "short_name": "BLUE CHIP INDIA",
        "long_name": "Blue Chip India Limited",
        "summary": "Blue Chip India Limited engages in the fund based activities in India. It sells equity shares. The company was incorporated in 1993 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700072",
        "website": "http://www.bluechipind.net",
        "market_cap": "Nano Cap"
    },
    "BSE.NS": {
        "short_name": "BSE LIMITED",
        "long_name": "BSE Limited",
        "summary": "BSE Limited, together with its subsidiaries, provides a platform for trading in equity, debt instruments, derivatives, and mutual funds in India and internationally. The company also offers securities, data dissemination, and depository services. In addition, it provides clearing and settlement; IT support; training; and investment services, as well as engages in the corporate social responsibility activities. The company was formerly known as Bombay Stock Exchange Limited and changed its name to BSE Limited in July 2011. BSE Limited was founded in 1875 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Data & Stock Exchanges",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.bseindia.com",
        "market_cap": "Small Cap"
    },
    "CAMS.NS": {
        "short_name": "Computer Age Mngt Ser Ltd",
        "long_name": "Computer Age Management Services Limited",
        "summary": "Computer Age Management Services Pvt. Ltd., a mutual fund transfer agency, provides services for investors, distributors, asset management companies, and demat account holders in India. It offers investor services, such as myCAMS, an application for financial transactions; and SMSBack Service, a suite of services to access account via SMS, as well as direct plans and others. The company also provides common mutual fund transaction system, an integrated solution to access information relating to, and transact on schemes of various mutual funds; and FUNDSNet, a platform that allows channel intermediaries to use Internet and submit requests for transactions and to provide customer statements, including wrap statements. In addition, it offers Distributor Mailback Service that enables distributors to request historical NAVs, account statements, and transactions of their customers on an ad-hoc basis, as well as provides mail back systems to check sales performance by city, find individual distributor performance and ranking, investor queries, and others. Further, the company provides service network that enables same day transaction processing, including submit transactions, service request, make enquiries about balance, valuation, and ask for statement; NIGO transactions; and account information to verify current balance, obtain an account statement, review sales performance of fund or of a distributor, and transact on behalf of investors using eISC, a secure intranet based application. Additionally, it offers NAV and dividend history of various mutual fund schemes; and depository services, such as demat account opening, dematerialization, rematerialization, transaction statement and execution, pledge, and other demat related services for demat account holders. It serves customers through a network of service centers in India. The company was incorporated in 1988 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://new.camsonline.com",
        "market_cap": "Small Cap"
    },
    "CANBK.NS": {
        "short_name": "CANARA BANK",
        "long_name": "Canara Bank",
        "summary": "Canara Bank provides various banking products and services in India and internationally. It offers personal banking services, such as savings and deposits comprising savings accounts, current accounts, recurring deposits, fixed deposits, unclaimed deposits, deposit schemes for senior citizens, re-investment plans, and others; loan products, such as housing, home improvement, vehicle, site, teachers, gold, mortgage, housing-cum-solar, consumer, and other loans; life, general, and health insurance products; consultancy services, which cover personal tax assistance and investment counselling, estate and wills services, private and charitable trustee services, debenture and security trusteeship, and attorneyship; foreign exchange and international banking services; mutual funds; and safe deposit lockers, depository, safe custody, and card services. The company also provides corporate banking products and services, including accounts and deposits, such as current, fixed, and recurring deposits; supply chain finance management; loans and advances comprising working capital finance, term loans, infrastructure financing, and export finance; syndication services; IPO monitoring services; and merchant and commercial banking, escrow bankers/ASBA, underwriting, and investments services. In addition, it offers NRI banking products and services, such as remittance facilities; loans and advances, such as home, home improvement, vehicle, rent, mortgage, and site loans; and investment and online trading facilities. As of March 31, 2020, the company operated 6,329 branches, including 291 specialized branches and 5 overseas branches and 8,850 ATMs. Canara Bank was founded in 1906 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560002",
        "website": "http://www.canarabank.com",
        "market_cap": "Mid Cap"
    },
    "CANFINHOME.NS": {
        "short_name": "CANFIN HOMES",
        "long_name": "Can Fin Homes Limited",
        "summary": "Can Fin Homes Limited provides housing finance services primarily to individuals and builders/developers in India. The company offers housing loans, such as individual housing loans, affordable housing loans, composite loans, and top-up loans; and non-housing loans, including mortgage loans, site loans, loans for commercial properties, loans against rent receivables, personal loans, loans for children education, and loans for pensioners, as well as fixed and cumulative deposits. As of March 31, 2020, it operated 165 branches, 21 affordable housing loan centers, and 14 satellite offices. Can Fin Homes Limited was founded in 1987 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560004",
        "website": "http://www.canfinhomes.com",
        "market_cap": "Small Cap"
    },
    "CAPTRUST.NS": {
        "short_name": "CAPITAL TRUST LTD.",
        "long_name": "Capital Trust Limited",
        "summary": "Capital Trust Limited, a non-banking finance company, provides capital and micro business loans in India. The company serves agriculture, dairy and livestock, food, home improvement loan, manufacturing, multi-utility, retail, services, small commercial vehicle, trading, and two wheeler sectors. It operates in 10 states through 251 branches in Delhi, Uttar Pradesh, Uttarakhand, Madhya Pradesh, Punjab, Rajasthan, Odisha, Bihar, Chhattisgarh, and Jharkhand. The company was founded in 1985 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110030",
        "website": "http://www.capitaltrust.in",
        "market_cap": "Nano Cap"
    },
    "CARERATING.NS": {
        "short_name": "CARE RATINGS LTD",
        "long_name": "CARE Ratings Limited",
        "summary": "CARE Ratings Limited, a credit rating agency, provides various rating and grading services in India, Mauritius, and Nepal. The company offers corporate rating services, such as corporate debt, bank loan, issuer, corporate governance, and recovery rating; financial sector rating services, which cover banks, credit quality, capital protection oriented schemes, insurance, NBFCs, securitization, and housing finance companies; and public finance rating services that cover ratings of state government entities and urban local bodies, as well as project finance, infrastructure sector, MLD valuation, and small and medium enterprises. It also provides grading services for educational institutes, IPOs, industrial training institutes, construction companies, shipyard companies, maritime training institutes, renewable energy service companies and system integrators, micro finance institutions, and energy service companies, as well as provides equity research and grading services, and real estate project star and REIT rating services. CARE Ratings Limited operates 10 branches in India. The company was formerly known as Credit Analysis and Research Limited and changed its name to CARE Ratings Limited in June 2017. CARE Ratings Limited was founded in 1993 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Data & Stock Exchanges",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400022",
        "website": "http://www.careratings.com",
        "market_cap": "Micro Cap"
    },
    "CDSL.NS": {
        "short_name": "CENTRAL DEPOSITORY",
        "long_name": "Central Depository Services (India) Limited",
        "summary": "Central Depository Services (India) Limited provides depository services in India. The company offers various services, such as account opening, dematerialization, processing delivery and receipt instructions, account statement, re-materialization, pledging, nomination, transmission of securities, change in address, bank account details, and SMS services for depository participants. It also provides facilities to issuers to credit securities to a shareholder's or applicants demat accounts; KYC services in respect of investors in capital markets to capital market intermediaries; facilities holding of insurance policies in electronic form to the holders of these policies; and facilitate holding and transacting in electronic negotiable warehouse receipts. In addition, it offers services, such as electronic access to security information, electronic access to security information and execution of secured transaction, e-voting, e-locker, and mobile application. It serves investors through depository participants, issuer companies, capital market intermediaries, insurance companies, and warehouse service providers/warehouses. The company was incorporated in 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.cdslindia.com",
        "market_cap": "Small Cap"
    },
    "CENTRALBK.NS": {
        "short_name": "CENTRAL BANK OF IN",
        "long_name": "Central Bank of India",
        "summary": "Central Bank of India operates as a commercial bank in India. It offers deposit products, which include savings and current accounts, time deposits, fixed deposits, and recurring deposit schemes; and loans, including housing, vehicle, property, personal, senior citizens, education, corporate mortgage and rental, and agricultural, as well as micro small and medium enterprises loans. The company also provides credit, debit, and prepaid/gift cards, as well as cash management, mutual funds, depository, payments, mobile and Internet banking, and ATM services, as well as remittance services. In addition, it offers investment banking services, such as debt syndication, financial modeling and valuation, merger and acquisition advisory, corporate restructuring, equity products, equity research, and wealth and portfolio management, as well as trusteeship services. Further, the company sells and distributes life, general, and health insurance products, including unit linked, whole life, children, money back, endowment, pension, health, property, personal, fire, burglary, engineering, motor, package, travel, and group insurance products, as well as protection and retirement solutions. As of March 31, 2020, it operated through a network of 4,651 branches; 3,642 ATMs; 10 satellite offices; and 1 extension counter. The company was founded in 1911 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.centralbankofindia.co.in",
        "market_cap": "Small Cap"
    },
    "CENTRUM.NS": {
        "short_name": "CENTRUM CAPITAL",
        "long_name": "Centrum Capital Limited",
        "summary": "Centrum Capital Limited, together with its subsidiaries, provides various financial services for institutions and individuals in India. It operates through Institutional Business, Wealth Management & Distribution, Housing Finance Business, and SME / Micro Credit Lending Business segments. The company offers investment banking services, including equity initial public offerings (IPO), follow-on public offerings and rights issues, pre-IPO placements, qualified institutional placements, American depository receipts, global depository receipts, convertible issuances, buybacks and delisting, open offers and takeovers, and valuation advisory services, as well as alternative investment markets; and mergers and acquisitions, private equity, and structured finance advisory services. It also provides services in the areas of working capital, term loans/corporate loans, project finance, and external commercial borrowings/foreign currency loans; and housing finance, SME and MSME finance, and micro finance. In addition, the company offers private debt, public equity, venture capital, and real estate advisory services; money changing, portfolio management, retail broking, and defense and infrastructure advisory services, as well as trades in bonds. Further, it offers wealth management, stock broking, and insurance services. Centrum Capital Limited was incorporated in 1977 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.centrum.co.in",
        "market_cap": "Micro Cap"
    },
    "CHOLAFIN.NS": {
        "short_name": "CHOLAMANDALAM INV",
        "long_name": "Cholamandalam Investment and Finance Company Limited",
        "summary": "Cholamandalam Investment and Finance Company Limited, a non-banking finance company, provides various financial services in India. The company operates through three segments: Vehicle Finance Loans, Home Equity, and Other Loans. It offers two wheeler and commercial vehicle loans, tractor loans, car and MUV loans, and construction equipment loans, as well as loans to automobile dealers; loans against properties; home loans for self-construction, loans for the purchase of plots and ready to occupy homes, and balance transfer facility for existing home loans; home equity loans; business loans for small and medium enterprises; rural and agri-loans; and refinance against existing vehicles. The company also provides wealth management services that cover mutual funds, fixed deposits and bonds, life and general insurance, and home loans for private individuals and professionals; investment advisory services; and stock broking services for mutual funds, stocks and derivatives, exchange traded funds, and bonds, as well as Internet broking, demat, and depository participant services. As of March 31, 2020 it operated through a network of 1091 branches. The company was founded in 1978 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600001",
        "website": "http://www.cholamandalam.com",
        "market_cap": "Mid Cap"
    },
    "CHOLAHLDNG.NS": {
        "short_name": "CHOLAMANDALAM FIN",
        "long_name": "Cholamandalam Financial Holdings Limited",
        "summary": "Cholamandalam Financial Holdings Limited, an investment company, provides financial services in India. It operates through Financial Services, Insurance and Allied Services, and Other Business segments. The company provides vehicle finance, home loans, home equity loans, SME loans, investment advisory and stock broking services, and various other financial services. It also offers motor, health, property, accident, engineering, home, rural, liability, marine, and travel insurance for individuals and corporates. The company was formerly known as TI Financial Holdings Limited and changed its name to Cholamandalam Financial Holdings Limited in March 2019. Cholamandalam Financial Holdings Limited was incorporated in 1949 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600001",
        "website": "http://cholafhl.com",
        "market_cap": "Small Cap"
    },
    "CKFSL.NS": {
        "short_name": "COX & KINGS FINANC",
        "long_name": "Cox and Kings Financial Service Limited",
        "summary": "Cox & Kings Financial Service Limited provides forex services to financial institutions, corporates, individual travelers, and students in India. It engages in buying and selling foreign currency notes and internationally accepted multi-currency travel cards; and issues demand drafts/ travelers cheques, outward remittances, tour remittances. The company was incorporated in 2016 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400059",
        "website": "http://www.ckfsl.com",
        "market_cap": "Nano Cap"
    },
    "CONSOFINVT.NS": {
        "short_name": "CONSOLIDATED FINVE",
        "long_name": "Consolidated Finvest & Holdings Limited",
        "summary": "Consolidated Finvest & Holdings Limited operates as a non-banking financial company in India. The company invests in shares, stocks, bonds, debentures, mutual funds, and inter corporate deposits and loans. It also provides loans. The company was incorporated in 1993 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.consofinvest.com",
        "market_cap": "Nano Cap"
    },
    "CREDITACC.NS": {
        "short_name": "CREDITACCESS GRAME",
        "long_name": "CreditAccess Grameen Limited",
        "summary": "CreditAccess Grameen Limited, a non-banking financial company, provides micro finance services for women from poor and low income households in India. The company offers microcredit loans for income generation, home improvement, emergency, and family welfare, as well as life insurance and national pension scheme. It also provides retail finance loans, such as Grameen Udyog, Grameen Savaari, Grameen Vikas, Grameen Suvidha, and Grameen Vaahan. The company was formerly known as Grameen Koota Financial Services Private Limited and changed its name to CreditAccess Grameen Limited in January 2018. CreditAccess Grameen Limited was incorporated in 1991 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560071",
        "website": "http://www.creditaccessgrameen.com",
        "market_cap": "Small Cap"
    },
    "CREST.NS": {
        "short_name": "CREST VENTURES",
        "long_name": "Crest Ventures Limited",
        "summary": "Crest Ventures Limited operates as a non-banking finance company in India. It operates through three segments: Real Estate, Financial Services, and Investment and Credit. The company develops various real estate projects, such as residential and commercial projects, malls, hotel, and townships. It also provides financial services, including asset management; mutual fund distribution services; and investment management services to family offices and high net worth individuals, as well as deals in wholesale debt markets, foreign exchange markets, interest rate swaps, and currency options. In addition, the company offers destination and event management services, such as tours; meetings, incentives, conferencing, and exhibitions; events; and online services. The company was formerly known as Sharyans Resources Limited and changed its name to Crest Ventures Limited in September 2014. Crest Ventures Limited was incorporated in 1982 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.crest.co.in",
        "market_cap": "Nano Cap"
    },
    "CRISIL.NS": {
        "short_name": "CRISIL LTD",
        "long_name": "CRISIL Limited",
        "summary": "CRISIL Limited, an analytical company, together with its subsidiaries, provides ratings, data, research, and analytics and solutions in India, Europe, North America, and internationally. It operates through three segments: Ratings, Research, and Advisory. The Ratings services segment offers credit ratings for corporates, banks, bank loans, and small and medium enterprises; credit analysis services; grading services; and analytical services. The Research segment provides research and analytical services, industry reports, customized research assignments, subscription to data services, independent equity research, initial public offering grading, and training services. The Advisory segment offers advisory services; and range of risk management tools, analytics, and solutions to financial institutions, banks, and corporates. The company was formerly known as The Credit Rating Information Services of India Limited and changed its name to CRISIL Limited in December 2003. CRISIL Limited was incorporated in 1987 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Data & Stock Exchanges",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400076",
        "website": "http://www.crisil.com",
        "market_cap": "Mid Cap"
    },
    "CSBBANK.NS": {
        "short_name": "CSB Bank Limited",
        "long_name": "CSB Bank Limited",
        "summary": "CSB Bank Limited provides various banking products and services for small and medium enterprises, retail, and NRI customers in India. It operates in four segments: Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company accepts various deposits products include current accounts, savings bank accounts, corporate salary savings accounts, term deposit accounts, cumulative deposit accounts, and other deposit products, as well as products for NRI customers. It also offers term, working capital, commercial vehicle, personal, home, vehicle, education, agricultural, corporate, and gold loans; loans against properties; and export finance, import finance, bill finance, letters of credit, buyers'/suppliers' credit, bank guarantee, inland bill discounting, bills discounted under domestic letters of credit, cash management, treasury, and trade receivables discounting system bill discounting services. In addition, the company invests in sovereign and corporate debt instruments, undertakes proprietary trading in equity and fixed income securities and foreign exchange, and invests in certificate of deposits and mutual funds. Further, it provides money transfer and remittance, utility and bill payments, Internet and mobile banking, foreign exchange, insurance products distribution, safe deposit locker, and institutional fee collection services. It operates through a network of approximately 411 branches and 300 ATMs. The company was formerly known as The Catholic Syrian Bank Limited and changed its name to CSB Bank Limited in June 2019. CSB Bank Limited was incorporated in 1920 and is headquartered in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680020",
        "website": "http://www.csb.co.in",
        "market_cap": "Small Cap"
    },
    "CUB.NS": {
        "short_name": "CITY UNION BANK",
        "long_name": "City Union Bank Ltd.",
        "summary": "City Union Bank Ltd. provides various banking products and services to personal and corporate clients in India. The company operates through four segments: Corporate/Wholesale Banking, Retail Banking, Treasury, and Other Banking Operations. It offers savings and current accounts; salary and NRI accounts; and fixed deposits, flexi fix, recurring, and tax saver deposits. The company also provides four and two wheeler, educational, housing, consumer, jewel, agricultural, working capital, small road transport operator, and foreign currency loans; micro credit, cash credits, bank guarantees, letters of credit, bills finance, and overdrafts services; and international business services, including export, import, remittances, deposits, correspondent banks, and treasury risk management services. In addition, it offers locker facilities, cards, automated teller machines (ATMs), and point of sales services, as well as demat and insurance services; and real time gross settlement, immediate payment service, national automatic clearing house, and national electronic fund transfer services. Further, the company provides cash management, electronic payment, digital and other tech, and payment to government services. As of March 31, 2020, it operated through a network of 700 branches and 1,793 ATMs. The company was formerly known as The Kumbakonam City Union Bank Limited and changed its name to City Union Bank Ltd. in November 1987. City Union Bank Ltd. was incorporated in 1904 and is based in Kumbakonam, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kumbakonam",
        "zipcode": "612001",
        "website": "http://www.cityunionbank.com",
        "market_cap": "Small Cap"
    },
    "DBSTOCKBRO.NS": {
        "short_name": "DB INTL STOCK BROK",
        "long_name": "DB (International) Stock Brokers Limited",
        "summary": "DB (International) Stock Brokers Limited provides stock broking and depository participant services in India. It also offers non-resident Indian services, such as equity and derivative trading, mutual fund and initial public offering investment, and procurement of permanent account number cards and RBI permissions. DB (International) Stock Brokers Limited was founded in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.dbonline.in",
        "market_cap": "Nano Cap"
    },
    "DCBBANK.NS": {
        "short_name": "DCB BANK LIMITED",
        "long_name": "DCB Bank Limited",
        "summary": "DCB Bank Limited provides various banking and financial products and services in India. It operates through Treasury Operations, Wholesale Banking, Retail Banking, and Other Banking Operations segments. The Treasury Operations segment engages in various financial markets activities undertaken on behalf of the company's customers, proprietary trading, maintenance of reserve requirements, and resource mobilization from other banks and financial institutions. The Wholesale Banking segment's activities include lending, deposit taking, and other services offered to corporate customers. The Retail Banking segment's activities comprise lending, deposit taking, and other services offered to retail customers. The Other Banking Operations segment provides para banking services, such as third-party product distribution, merchant banking, etc. As of March 31, 2021, it operated through a network of 352 branches across 19 states and 3 union territories. The company was formerly known as Development Credit Bank Limited and changed its name to DCB Bank Limited in October 2013. DCB Bank Limited was founded in 1930 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.dcbbank.com",
        "market_cap": "Small Cap"
    },
    "DCMFINSERV.NS": {
        "short_name": "DCM FINANCIAL SERV",
        "long_name": "DCM Financial Services Limited",
        "summary": "DCM Financial Services Limited does not have significant operations. Previously, it was involved in the auto finance business. The company was incorporated in 1991 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110020",
        "website": "http://www.dfslonline.com",
        "market_cap": "Nano Cap"
    },
    "DHANBANK.NS": {
        "short_name": "DHANLAXMI BANK LTD",
        "long_name": "Dhanlaxmi Bank Limited",
        "summary": "Dhanlaxmi Bank Limited provides various banking and financial services in India. It operates through Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business Operations segments. The company offers deposit products, such as savings and current accounts, and term deposits; loans, including property, car, commercial, personal, education, and business loans, as well as loans against securities; and foreign exchange services comprising foreign currency cash, cheque deposits, foreign currency demand drafts, remittances, and foreign exchange cards. It also provides export and import services; credit products comprising industrial and trade advance, import export assistance, and agricultural assistance; corporate salary accounts; and cash management services, as well as life, health, and car insurance products. In addition, the company offers non-resident Indians (NRI) banking services, such as non-residential external accounts, non-resident ordinary accounts, recurring and term deposits, foreign currency non-resident fixed deposits, and resident foreign currency accounts, as well as money transfer services and NRI property loans; and micro and agricultural banking, and financial planning services. Further, it provides SME banking services, including working capital facilities, trade facilities, and capacity expansion services; credit, debit, and gift cards; and investment, depository, and online banking services, as well as locker facilities. As of March 31, 2020, it had 247 branches and 254 ATMs across 14 States and 1 Union Territory. The company was founded in 1927 and is based in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680002",
        "website": "http://www.dhanbank.com",
        "market_cap": "Micro Cap"
    },
    "DHANI.NS": {
        "short_name": "DHANI SERVICES LIMITED",
        "long_name": "Dhani Services Limited",
        "summary": "Dhani Services Limited provides securities, commodities, and derivatives broking services in India. Its broking services include equity, derivative, commodity, and currency trading, as well as Demat accounts. The company also offers mutual funds and initial public offerings. In addition, it operates as a stock and share broker on the National Stock Exchange of India Limited and the BSE Limited; and commodity broker on the Multi Commodity Exchange of India Limited and the National Commodity and Derivative Exchange Limited. Further, the company is involved in the cross sale of real estate properties; and provision of other ancillary services relating to broking activities, as well as offers consumer and business loans through digitally enabled loan fulfillment solutions. Additionally, it provides asset reconstruction and related services; and site visit assistance and home loans for residential projects, as well as operates online trading platforms. The company was formerly known as Indiabulls Ventures Limited and changed its name to Dhani Services Limited in October 2020. Dhani Services Limited was incorporated in 1995 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122016",
        "website": "http://www.dhani.com",
        "market_cap": "Small Cap"
    },
    "DHFL.NS": {
        "short_name": "DEWAN HOUSING FIN",
        "long_name": "Dewan Housing Finance Corporation Limited",
        "summary": "Dewan Housing Finance Corporation Limited operates as a housing finance company in India. The company offers home loans, such as new home; and home renovation, construction, and extension loans to Lower and middle income, salaried and self-employed individuals. The company operates a network of 305 locations. The company was formerly known as Dewan Housing Development Finance Limited and changed its name to Dewan Housing Finance Corporation Limited in August 1992. Dewan Housing Finance Corporation Limited was founded in 1984 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.dhfl.com",
        "market_cap": "Micro Cap"
    },
    "DHUNINV.NS": {
        "short_name": "DHUNSERI INVESTMEN",
        "long_name": "Dhunseri Investments Limited",
        "summary": "Dhunseri Investments Limited formerly known as DI Marketing Limited. Dhunseri Investments Limited was founded on 4th February, 1997 is based in West Bengal, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.dhunseriinvestments.com",
        "market_cap": "Nano Cap"
    },
    "DOLAT.NS": {
        "short_name": "Dolat Investments Ltd",
        "long_name": "Dolat Investments Limited",
        "summary": "Dolat Investments Limited trades in shares, securities, commodities, and other financial products through various trading platforms in India. It also invests in stocks, commodities, and derivatives. The company was incorporated in 1983 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400058",
        "website": "http://www.dolatinvest.com",
        "market_cap": "Micro Cap"
    },
    "DVL.NS": {
        "short_name": "DHUNSERI VENTURES",
        "long_name": "Dhunseri Ventures Limited",
        "summary": "Dhunseri Ventures Limited primarily engages in the trading operations of PET resin. The company operates in two segments, Treasury Operations and Trading. It also undertakes treasury operations in shares and securities of other bodies corporate; develops and provides infrastructure facilities in special economic zones for information technology and information technology enabled services; and manufactures and retails confectioneries. In addition, the company manufactures, processes, buys, imports, exports, deals in, and sells various food products for food and beverages industries, as well as its related businesses. Further, it manufactures polyester films. It operates in Italy, India, and internationally. The company was formerly known as Dhunseri Petrochem Limited and changed its name to Dhunseri Ventures Limited in December 2018. The company was incorporated in 1916 and is based in Kolkata, India. Dhunseri Ventures Limited is a subsidiary of Dhunseri Investments Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.aspetindia.com",
        "market_cap": "Micro Cap"
    },
    "EBIXFOREX.NS": {
        "short_name": "EBIXCASH WRLD MONEY IND",
        "long_name": "Ebixcash World Money India Limited",
        "summary": "Ebixcash World Money India Limited provides money changing and transfer services in India. It primarily offers foreign exchange and outward and inward remittance services, prepaid and gift cards, and travel insurance services for its corporate and retail clients. The company was formerly known as Weizmann Forex Limited and changed its name to Ebixcash World Money India Limited in January 2020. The company was founded in 1985 and is based in Mumbai, India. Ebixcash World Money India Limited operates as a subsidiary of EbixCash World Money Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.indiaforexonline.com",
        "market_cap": "Micro Cap"
    },
    "EDELWEISS.NS": {
        "short_name": "EDELWEISS FIN SERV",
        "long_name": "Edelweiss Financial Services Limited",
        "summary": "Edelweiss Financial Services Limited provides financial products and services to individuals and institutions in India. It offers retail credit products, such as home loans, SME and business loans, loans against shares, and agricultural and rural finance; corporate credit products, including structured collateralized credit and wholesale mortgage; and distressed credit. The company also provides personal and private wealth management services; asset management products and services comprising mutual funds, alternate asset advisory, multi strategy funds, and distressed assets resolution; and capital markets services that include investment banking, institutional equities, forex and rates, asset, and financial product distribution services. In addition, it offers life and general insurance products. The company was formerly known as Edelweiss Capital Limited and changed its name to Edelweiss Financial Services Limited in August 2011. Edelweiss Financial Services Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.edelweissfin.com",
        "market_cap": "Small Cap"
    },
    "EMKAY.NS": {
        "short_name": "EMKAY GLOBAL FIN",
        "long_name": "Emkay Global Financial Services Limited",
        "summary": "Emkay Global Financial Services Limited, through its subsidiaries, provides stock broking, institutional equities, investment banking, portfolio management, and wealth management services in India. The company offers equity broking, asset management, currency and commodity advisory and broking, trading and investment education, investment management, alternative investment fund, lending, depository participant, wealth and investment advisory, and retail broking services. It also provides investment solutions, such as portfolio creation, investment planning, portfolio monitoring, transactional support, MIS and information support, and advisory services; and estate and succession planning, mutual fund advisory, cash and derivatives brokerage, and equity-based research advisory services, as well as distributes third party financial products. In addition, the company offers equity research, equity capital market, merchant banking, debt advisory, private equity placement, qualified institutional placement, rights issue, and corporate advisory services. It serves institutional investors, mutual funds, hedge funds, banks, insurance companies, private equity firms, corporate houses, small and medium sized enterprises, and high net worth individuals. The company was formerly known as Emkay Share and Stock Brokers Limited and changed its name to Emkay Global Financial Services Limited in June 2008. Emkay Global Financial Services Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400028",
        "website": "http://www.emkayglobal.com",
        "market_cap": "Nano Cap"
    },
    "EQUITAS.NS": {
        "short_name": "EQUITAS HOLDINGS",
        "long_name": "Equitas Holdings Limited",
        "summary": "Equitas Holdings Limited, through its subsidiaries, operates as a non-banking financial institution in India. The company operates in Banking and Finance, and Others segments. It accepts current and savings accounts, and term deposits; and offers micro finance loans, vehicle finance, housing finance, micro and small enterprises loans, agri loans, gold loans, business loans, etc. The company also offers online freight facilitation services under the Wowtruck brand name. It serves individuals, and micro and small enterprises. Equitas Holdings Limited was founded in 2007 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://www.equitas.in",
        "market_cap": "Small Cap"
    },
    "EQUITASBNK.NS": {
        "short_name": "Equitas Small Fin Bnk Ltd",
        "long_name": "Equitas Small Finance Bank Limited",
        "summary": "Equitas Small Finance Bank Limited provides banking and financial services in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. The company offers current, savings, and salary accounts; and term, bulk, and certificates of deposits. It also provides small business loans comprising secured business, self employed and salaried, agri, and housing loans; group loans to microentrepreneurial women; vehicle finance for used and new commercial vehicles, and used passenger cars; micro and small enterprise finance, such as working capital loans, and fund based and non-fund based products; and loans to financial institutions and corporates. In addition, the company offers insurance, FASTag, and asset management services; ATM and debit cards/point of sale services; call centre services; and mobile, phone, and internet banking services. It has 854 banking outlets and 322 ATMs. The company was formerly known as Equitas Finance Limited and changed its name to Equitas Small Finance Bank Limited in September 2016. Equitas Small Finance Bank Limited was incorporated in 1993 and is headquartered in Chennai, India. Equitas Small Finance Bank Limited operates as a subsidiary of Equitas Holdings Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://www.equitasbank.com",
        "market_cap": "Small Cap"
    },
    "FEDERALBNK.NS": {
        "short_name": "FED BANK",
        "long_name": "The Federal Bank Limited",
        "summary": "The Federal Bank Limited engages in commercial banking activities in India. It operates through four segments: Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company's deposit products include savings accounts, current accounts, demat accounts, salary accounts, fixed deposits, cash certificates, recurring deposits, exchange earner's foreign currency accounts, gilt accounts, and NRI deposit schemes. Its loan portfolio comprises gold, housing, car, property, educational or career, cash, instant digital, business, and agriculture and agricultural allied loans; travel, gift, debit, and credit cards; and loans against fixed deposits. The company also provides life, health, and general insurance products; mutual funds, online trading, and national pension system, as well as term loans, project finance, bill discounting, working capital loans, bank guarantees, letter of credit, packing credit limit, rediscounting of export bills, Internet banking, mobile banking, ATM, telephone banking services. As of March 31, 2019, it operated through a network of 1,251 branches and 1,669 ATMs. The company was formerly known as Travancore Federal Bank Limited and changed its name to The Federal Bank Limited in March 1947. The Federal Bank Limited was incorporated in 1931 and is headquartered in Aluva, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Aluva",
        "zipcode": "683101",
        "website": "http://www.federalbank.co.in",
        "market_cap": "Mid Cap"
    },
    "GEOJITFSL.NS": {
        "short_name": "GEOJIT FINANCIAL S",
        "long_name": "Geojit Financial Services Limited",
        "summary": "Geojit Financial Services Limited, an investment services company, provides broking and financial services in India, Oman, Kuwait, the United Arab Emirates, and Saudi Arabia. The company operates through Financial Services and Software Services segments. The Financial Services segment offers brokerage, depository, financial products distribution, portfolio management, and other related services. The Software services segment develops and maintains software. It also provides a range of value-added products and services, such as equities, derivatives, mutual funds, life and general insurance, financial planning, and fixed deposits. The company was formerly known as Geojit BNP Paribas Financial Services Limited and changed its name to Geojit Financial Services Limited in February 2017. Geojit Financial Services Limited was founded in 1987 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682024",
        "website": "http://www.geojit.com",
        "market_cap": "Micro Cap"
    },
    "GICHSGFIN.NS": {
        "short_name": "GIC HOUSING FINANC",
        "long_name": "GIC Housing Finance Limited",
        "summary": "GIC Housing Finance Limited provides housing finance services in India. It grants housing loans to individuals, as well as to persons/entities engaged in construction of houses/flats for residential purposes. As of March 31, 2020, it had 75 offices. The company was formerly known as GIC Grih Vitta Limited and changed its name to GIC Housing Finance Limited in November 1993. GIC Housing Finance Limited was incorporated in 1989 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.gichfindia.com",
        "market_cap": "Micro Cap"
    },
    "GICRE.NS": {
        "short_name": "GENERAL INSURANCE",
        "long_name": "General Insurance Corporation of India",
        "summary": "General Insurance Corporation of India provides reinsurance services in India and internationally. It offers property, energy, marine, engineering, liability, spares, health, agriculture/weather, motor and workmen compensation, fire, aviation, life reinsurance, and miscellaneous products, as well as marine hull, cargo, and offshore energy reinsurance products. The company also provides reinsurance solutions for the Afro-Asian region and reinsurance programs in South East Asia, the Middle East, and Africa. General Insurance Corporation of India was founded in 1972 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.gicofindia.com/en",
        "market_cap": "Mid Cap"
    },
    "GLFL.NS": {
        "short_name": "GUJARAT LEASE",
        "long_name": "Gujarat  Lease Financing Limited",
        "summary": "Gujarat Lease Financing Limited does not have significant operations. Previously, it was engaged in the various spheres of financial services. The company was incorporated in 1983 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.gujaratleasefinancing.co.in",
        "market_cap": "Nano Cap"
    },
    "HBSL.NS": {
        "short_name": "HB STOCKHOLDINGS",
        "long_name": "HB Stockholdings Limited",
        "summary": "HB Stockholdings Limited, a non-banking financial company, engages in the investment and finance activities in India. It is involved in the investment, purchase, and sale of securities. The company was formerly known as HB Portfolio Leasing Limited and changed its name to HB Stockholdings Limited in February 1997. HB Stockholdings Limited was incorporated in 1985 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.hbstockholdings.com",
        "market_cap": "Nano Cap"
    },
    "HDB": {
        "short_name": "HDFC Bank Limited",
        "long_name": "HDFC Bank Limited",
        "summary": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2020, it had 5,416 branches and 13,640 automated teller machines in 2,803 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.hdfcbank.com",
        "market_cap": "Large Cap"
    },
    "HDFA.F": {
        "short_name": "HDFC BANK LTD ADR/3 IR 10",
        "long_name": "HDFC Bank Limited",
        "summary": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2020, it had 5,416 branches and 13,640 automated teller machines in 2,803 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.hdfcbank.com",
        "market_cap": "Large Cap"
    },
    "HDFC.NS": {
        "short_name": "HOUSING DEVEL FIN",
        "long_name": "Housing Development Finance Corporation Limited",
        "summary": "Housing Development Finance Corporation Limited provides housing finance to individuals and corporate customers in India. It operates through Loans, Life Insurance, General Insurance, Asset Management, and Others segments. The company accepts fixed deposits, such as monthly income plans, non-cumulative interest plans, annual income plans, and cumulative options; and trust deposits. It offers loans for the purchase and construction of houses; home improvement and extension, plot, and top-up loans; loans to agriculturists, planters, horticulturists, and dairy farmers; loans for the salaried/self-employed individuals; loans for non-resident Indians; loans against property; and loans for non-residential premises and commercial plots, as well as education loans. In addition, the company provides cross-selling products and services; investment advisory services; life insurance products; general insurance products, including motor, health, travel, crop, home, personal accident, property, marine, aviation, and liability insurance; venture capital funds; asset management services comprising portfolio management, mutual fund, and property investment management; and other services consisting of project management, investment consultancy, and property related services. As of March 31, 2020, it operated through a network of 585 outlets; and 3 representative offices in Dubai, London, and Singapore. The company was founded in 1977 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.hdfc.com",
        "market_cap": "Large Cap"
    },
    "HDFCAMC.NS": {
        "short_name": "HDFC ASSET MANAGEM",
        "long_name": "HDFC Asset Management Company Limited",
        "summary": "HDFC Asset Management Company Limited is a publically owned investment manager. The firm launches and manages equity, fixed income, and balanced mutual funds for its clients. It manages equity, fixed income, balanced, and real estate portfolios. The firm invests in public equity and fixed income markets. The firm employs fundamental analysis to make its investments. HDFC Asset Management Company Limited was founded on December 10, 1999 and is based in Mumbai, Maharashtra. HDFC Asset Management Company Limited operates as a subsidiary of Housing Development Finance Corporation Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.hdfcfund.com",
        "market_cap": "Mid Cap"
    },
    "HDFCBANK.NS": {
        "short_name": "HDFC BANK",
        "long_name": "HDFC Bank Limited",
        "summary": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, Other Banking Business, and Unallocated segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of March 31, 2020, it had 5,416 branches and 13,640 automated teller machines in 2,803 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.hdfcbank.com",
        "market_cap": "Large Cap"
    },
    "HDFCLIFE.NS": {
        "short_name": "HDFC LIFE INSURANC",
        "long_name": "HDFC Life Insurance Company Limited",
        "summary": "HDFC Life Insurance Company Limited provides individual and group insurance solutions in India. The company offers various insurance plans and policies, such as protection, health, children's, savings and investment, women's, retirement, rural and social, unit linked insurance, NRI, and group insurance plans. It operates through a network of 421 branches. The company was formerly known as HDFC Standard Life Insurance Company Limited changed its name to HDFC Life Insurance Company Limited in January 2019. The company was founded in 2000 and is based in Mumbai, India. HDFC Life Insurance Company Limited operates as a subsidiary of Housing Development Finance Corporation Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400011",
        "website": "http://www.hdfclife.com",
        "market_cap": "Large Cap"
    },
    "HEXATRADEX.NS": {
        "short_name": "HEXA TRADEX LTD",
        "long_name": "Hexa Tradex Limited",
        "summary": "Hexa Tradex Limited engages in the trading, and investment and financing businesses in India. The company was incorporated in 2010 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.hexatradex.com",
        "market_cap": "Micro Cap"
    },
    "HOMEFIRST.NS": {
        "short_name": "Home First Fin Co Ind Ltd",
        "long_name": "Home First Finance Company India Limited",
        "summary": "Home First Finance Company India Limited operates as a housing finance company in India. The company offers housing loans for the purchase or construction of homes, loans against property, developer finance loans, and loans for purchase of commercial property. It serves salaried and self-employed customers. The company was founded in 2010 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400059",
        "website": "http://www.homefirstindia.com",
        "market_cap": "Small Cap"
    },
    "HOTELRUGBY.NS": {
        "short_name": "HOTEL RUGBY LTD",
        "long_name": "Hotel Rugby Limited",
        "summary": "Hotel Rugby Limited does not have significant operations. Previously, the company was involved in the hotel business, which provided catering services, as well as prepared and sold sweets and savories; and operated restaurants. Hotel Rugby Limited was incorporated in 1991 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400002",
        "website": "http://www.hotelrugby.co.in",
        "market_cap": "Nano Cap"
    },
    "HUDCO.NS": {
        "short_name": "HOUSING & URBAN",
        "long_name": "Housing and Urban Development Corporation Limited",
        "summary": "Housing and Urban Development Corporation Limited provides long term finance for the construction of houses and to undertake housing and urban infrastructure development programs in India. The company offers loans for housing projects, such as urban and rural housing, co-operative housing, community toilets, slum upgradation, staff housing, repairs and renewals, land acquisition, building technology, and implementing agencies comprising state government bodies, co-operative societies, corporate borrowers, and joint sectors. It also provides financing for infrastructure projects in the sectors of water supply; sewerage; drainage; solid waste management; roads and transport; power generation, transmission, and distribution; telecom sector and industrial infrastructure; and social infrastructure component, such as national games village, stadiums, sports complexes, shooting ranges, parks and play grounds, health centers, government hospitals, working women hostels, schools and colleges, universities, state vidhan sabha sadans, law chambers, police academies and stations, fire stations, courts/collectorates/office buildings, rehabilitation centers, auditoriums, convention halls, crematoriums, abattoirs, etc., as well as commercial infrastructure component, including office buildings, shopping centers, market complexes, theatres/multiplexes/auditorials, trade and business centers, hotels, etc. In addition, the company offers consultancy services, including URP services, environmental engineering, and government programs consultancy services; and disaster mitigation services. Further, it provides home loans for individuals. Housing and Urban Development Corporation Limited was founded in 1970 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://www.hudco.org",
        "market_cap": "Small Cap"
    },
    "IBN.BA": {
        "short_name": "ICICI BANK",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "ARS",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "IBN": {
        "short_name": "ICICI Bank Limited",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "IBULHSGFIN.NS": {
        "short_name": "INDIABULLS HOUSING",
        "long_name": "Indiabulls Housing Finance Limited",
        "summary": "Indiabulls Housing Finance Limited, together with its subsidiaries, operates as a housing finance company. The company offers secured mortgage-backed housing loans to salaried and self-employed individuals; and loans against property. It also provides NRI home, home renovation and extension, and rural loans; and insurance products. The company serves finance and lending services to co-operative society, association of persons, individuals, companies, institutions, firms, builders, developers, contractors, tenants, and others. It operates approximately 141 branches. Indiabulls Housing Finance Limited was founded in 2000 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.indiabullshomeloans.com",
        "market_cap": "Small Cap"
    },
    "ICBA.F": {
        "short_name": "ICICI BANK LTD ADR/2",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "ICICIBANK.NS": {
        "short_name": "ICICI BANK",
        "long_name": "ICICI Bank Limited",
        "summary": "ICICI Bank Limited provides various banking products and financial services in India and internationally. It operates in Retail Banking, Wholesale Banking, Treasury, and Others Banking segments. The company offers savings, salary, pension, current, and other accounts; and fixed, recurring, and security deposits. It also provides home, car, two wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, such as working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and secured loans for credit card swipes, as well as loans for new entities, and schools and colleges; and credit, debit, prepaid, travel, and corporate cards. In addition, the company offers insurance products; pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, and initial public offerings, as well as other online investment services; and farmer finance, tractor loans, and micro banking services, as well as other services to agri traders and processors, and agri corporates. Further, it provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, project and technology finance, and institutional banking services, as well as Internet, mobile, and phone banking services. Additionally, the company offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, and pension fund management services. As of March 31, 2020, it had a network of 5,324 branches, 15,688 ATMs, 1,638 insta-banking kiosks, 483,538 POS terminals, and 1,791 cash acceptance machines. ICICI Bank Limited was founded in 1955 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.icicibank.com",
        "market_cap": "Large Cap"
    },
    "ICICIGI.NS": {
        "short_name": "ICICI LOMBARD GEN",
        "long_name": "ICICI Lombard General Insurance Company Limited",
        "summary": "ICICI Lombard General Insurance Company Limited provides various general insurance products and services in India. The company offers motor, car, two wheeler, health, health booster, personal accident, international travel, home, marine, workmen compensation, NRI, business, third party, crop, rural, and cyber insurance products; and provides reinsurance services. The company was incorporated in 2000 and is based in Mumbai, India. ICICI Lombard General Insurance Company Limited is a subsidiary of ICICI Bank Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.icicilombard.com",
        "market_cap": "Mid Cap"
    },
    "ICICIPRULI.NS": {
        "short_name": "ICICI PRUDENTIAL L",
        "long_name": "ICICI Prudential Life Insurance Company Limited",
        "summary": "ICICI Prudential Life Insurance Company Limited provides life insurance, pension, and health insurance products to individuals and groups in India. It offers participating, non-participating non-linked, and non-participating linked. The company also provides term life, health, savings, and retirement insurance products; and pension fund management services. It distributes its products through individual and corporate agents, banks, and brokers, as well as through its own sales force and website. The company was founded in 2000 and is based in Mumbai, India. ICICI Prudential Life Insurance Company Limited is a subsidiary of ICICI Bank Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.iciciprulife.com",
        "market_cap": "Large Cap"
    },
    "ICRA.NS": {
        "short_name": "ICRA LTD",
        "long_name": "ICRA Limited",
        "summary": "ICRA Limited operates as an independent and professional investment information, and credit rating agency in India and internationally. The company operates through Rating, Research and Other Services; Consulting Services; and Outsourced and Information Services segments. It offers credit, bank loan, structured finance, issuer, project finance, mutual fund, and fund management quality rating services. The company also provides grading services banking and finance, insurance, and hydro-electricity sector; industry research services in the areas of business and profitability outlook, industry analysis, competitive landscape, impact of regulatory environment, benchmarking of companies, industry credit profile, company profile on listed players, etc.; and consulting services and solutions. In addition, it offers financial information products and services, as well as KPO services. The company was formerly known as Investment Information and Credit Rating Agency of India Limited. ICRA Limited was founded in 1991 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Data & Stock Exchanges",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.icra.in",
        "market_cap": "Small Cap"
    },
    "IDBI.NS": {
        "short_name": "IDBI BANK LTD",
        "long_name": "IDBI Bank Limited",
        "summary": "IDBI Bank Limited provides banking and financial solutions to retail and corporate clients in India. The company offers savings and current accounts, corporate payroll accounts, and fixed deposits; home, auto, education, and personal loans, as well as loans against properties and securities; debit, credit, and prepaid cards; phone, mobile, and Internet banking services; and investment advisory and capital market services, as well as lockers. The company also provides fund based assistance, including term loans; working capital; packing credit to exporters; receivable buyout with recourse; channel financing for dealers of corporates; scheme for financing automated teller machines (ATM)/cash dispense vendors; bill discounting; technology upgrading fund scheme for textile and jute industries; and lending to non-banking finance companies/housing finance companies and commercial real estate sector. In addition, it offers bank and performance guarantees, letters of credit, and buyers credit; cash management, treasury, trade finance, and foreign currency services; and debt syndication and advisory services. Further, the company provides finance to micro, small, and medium enterprises; agriculture finance; and products and services for non-resident Indians, as well as equity, debt and gold products. Additionally, it offers information technology and security, and contact center services; and mutual fund, security trusteeship assignments, share pledge trustee, venture capital fund, safe keeping, escrow agency, and other trusteeship services, as well as acts as a trustee to securitization transactions and bond/debentures. As of March 31, 2020, the company operated 1,892 branches, 3,683 ATMs, and 58 e-lounges. The company was formerly known as IDBI Ltd. and changed its name to IDBI Bank Limited in May 2008. The company was founded in 1964 and is headquartered in Mumbai, India. IDBI Bank Limited is a subsidiary of Life Insurance Corporation of India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 005",
        "website": "http://www.idbibank.in",
        "market_cap": "Mid Cap"
    },
    "IDFC.NS": {
        "short_name": "IDFC LIMITED",
        "long_name": "IDFC Limited",
        "summary": "IDFC Limited, together with its subsidiaries, engages in the investment activities in India. The company operates through Financing and Asset Management segments. It is also involved in the portfolio management, mutual fund, and other alternative funds activities; and provides investment banking and brokerage services. The company was formerly known as Infrastructure Development Finance Company Limited and changed its name to IDFC Limited in July 2012. IDFC Limited was founded in 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.idfc.com",
        "market_cap": "Small Cap"
    },
    "IDFCFIRSTB.NS": {
        "short_name": "IDFC FIRST BANK",
        "long_name": "IDFC First Bank Limited",
        "summary": "IDFC First Bank Limited provides various banking and financial products and services to corporates, individuals, multi-national companies, SMEs/entrepreneurs, financial institutions, and the government in India. It operates through four segments: Treasury, Corporate and Wholesale Banking, Retail Banking, and Other Banking Business. The company offers savings, corporate salary, and current accounts; fixed, recurring, and travel deposits; debit and prepaid cards; and payment services. It also provides personal, consumer durable, home, car, two wheeler, commercial vehicle, equipment hypothecation, business, working capital, business, and micro enterprise loans, as well as loan against property and loan for women; investment services covering mutual funds, gold bonds, and investment linked insurance solutions; term, health, motor, home, investment linked, travel, and pradhan mantri insurance; and mobile and Internet banking services. In addition, the company offers cash management and forex services; wholesale banking services, such as investment banking services; and investment management solutions. As of May 27, 2020, it operated 464 branches and 356 ATMs across 20 states and 66 districts. The company was formerly known as IDFC Bank Limited and changed its name to IDFC First Bank Limited in January 2019. The company was incorporated in 2014 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.idfcfirstbank.com",
        "market_cap": "Mid Cap"
    },
    "IEX.NS": {
        "short_name": "INDIAN ENERGY EXCH",
        "long_name": "Indian Energy Exchange Limited",
        "summary": "Indian Energy Exchange Limited operates a power trading platform. The company enables price discovery and risk management for participants of the electricity market, including industries eligible for open access. Its products include Day-Ahead-Market, a physical electricity trading market for deliveries for any/some/all 15 minute time blocks in 24 hours of next day starting from midnight; Term-Ahead-Market that provides a range of products allowing participants to buy/sell electricity on intra-day, day-ahead contingency, and daily and weekly contracts; Real-Time Market, an auction session every half an hour with power to be delivered after 4 time blocks or an hour after gate closure of the auction; Renewable Energy Certificates to ease the purchase of renewable energy by the state utilities and obligated entities; and Energy Saving Certificates. The company was incorporated in 2007 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.iexindia.com",
        "market_cap": "Small Cap"
    },
    "IFCI.NS": {
        "short_name": "IFCI LTD",
        "long_name": "IFCI Limited",
        "summary": "IFCI Limited provides non-banking financial services to the public sector in India. The company offers project finance for the power sector, including renewable energy, telecommunications, roads, oil and gas, ports, airports, basic metals, chemicals, pharmaceuticals, electronics, textiles, real estate, smart cities, urban infrastructure, etc. It also provides corporate finance, such as balance sheet funding, loan against shares, lease rental discounting, promoter funding, long term working capital requirement, capital expenditure, and regular maintenance capex services, as well as short term loans for various businesses that include bridge financing and short term working capital to small, mid, and large corporates. In addition, the company offers financial/investment appraisal, business reengineering, and advisory services for various corporate houses and companies; and structured debt/mezzanine products, as well as assistance in sponsor financing, acquisition financing, pre-IPO financing, off-balance sheet structured solutions, and others. Further, it provides sales and resolution services for non-performing assets; nodal agency services; and credit enhancement guarantee scheme for scheduled castes, as well as acts as debenture trustee for debenture issues. Additionally, the company offers factoring, broking, merchant banking, currency trading, , mutual fund distribution and advisory, insurance products distribution, real estate and infrastructure, venture capital fund, technical consultancy, stamp duty collection, and depository participation services. It provides financial support services for airports, roads, telecom, power, real estate, manufacturing, and services sectors; and other allied industries. The company was formerly known as Industrial Finance Corporation of India and changed its name to IFCI Limited in October 1999. IFCI Limited was founded in 1948 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110019",
        "website": "http://www.ifciltd.com",
        "market_cap": "Small Cap"
    },
    "IIFL.NS": {
        "short_name": "IIFL FINANCE LTD",
        "long_name": "IIFL Finance Limited",
        "summary": "IIFL Finance Limited provides various financial products and services in India and internationally. The company offers home, personal, and gold loans; business loans, including loans against property, medium and small enterprise financing, micro finance, developer and construction finance, real estate finance, and capital market finance; and digital finance. It also provides wealth and asset management, and real estate broker and consulting services; investment banking services, including equity and debt capital market, and private equity and M&A advisory services; and mutual funds, equity, derivatives/futures, options, commodities, and currency trading, as well as research services. IIFL Holdings Limited serves retail and corporate, high net-worth individual, and institutional and retail customers. The company was formerly known as IIFL Holdings Limited and changed its name to IIFL Finance Limited in May 2019. IIFL Finance Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400069",
        "website": "http://www.iifl.com",
        "market_cap": "Small Cap"
    },
    "IIFLSEC.NS": {
        "short_name": "IIFL SECURITIES",
        "long_name": "IIFL Securities Limited",
        "summary": "IIFL Securities Limited provides capital market services in primary and secondary market in India, the United States, and the United Kingdom. The company offers retail broking products and services comprising equity, commodities and currency broking, and equity research; advisory services, including financial planning, equity portfolio, access to alternate investments, and retirement and estate planning; broking services; research and corporate services; investment banking services, consisting of initial public offerings, qualified investment, right and preferential issues, and follow-on public offer, as well as corporate advisory, including M&A, share buybacks, tender offers, and delisitings; and advisory services for private equity placements, and mergers and acquisitions. It also distributes third party financial products, such as mutual funds, insurance, PMS, AIF, fixed deposits, loans, and pension products. It serves retail and mass affluent investors, domestic and foreign institutional investors, sovereign wealth funds, banks, and private equity funds and corporates. The company was formerly known as India Infoline Limited and changed its name to IIFL Securities Limited in February 2018. IIFL Securities Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400069",
        "website": "http://www.indiainfoline.com",
        "market_cap": "Micro Cap"
    },
    "IIFLWAM.NS": {
        "short_name": "IIFL Wealth Mgmt Ltd",
        "long_name": "IIFL Wealth Management Limited",
        "summary": "IIFL Wealth Management Limited provides wealth and asset management services primarily in India. It offers wealth management services, such as financial product distribution, advisory, equity and debt broking, non-discretionary portfolio management, discretionary portfolio management, corporate advisory services, and managing financial products, as well as investment activities and advisory services. The company also provides lending solutions comprising credit solutions against financial assets, promoter securities, and real estate; IPO, employee stock option plan, and margin trade financing; and structured financing solution. In addition, it offers estate planning services, such as wealth structuring and succession planning solution; and asset management solutions, including mutual funds, alternative investment funds, and portfolio management services. IIFL Wealth Management Limited serves high net worth and ultra-high net worth individuals, affluent families, family offices, and institutional clients. The company was founded in 2008 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.iiflwealth.com",
        "market_cap": "Small Cap"
    },
    "IITL.NS": {
        "short_name": "INDUSTRIAL INV TRU",
        "long_name": "Industrial Investment Trust Limited",
        "summary": "Industrial Investment Trust Limited, a non-banking financial company, engages in the investment activities in India. It invests in securities, including shares, mutual funds, debentures, and bonds. The company also provides private equity, margin funding, and loans and advances; and equity trading, stock broking, depository, investment advisory, mutual fund distribution, and business consultancy services. In addition, it is involved in the real estate development activities and construction of residential complex, as well as offers real estate advisory services. Further, it provides life, general, and health insurance broking services. The company was incorporated in 1933 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.iitlgroup.com",
        "market_cap": "Nano Cap"
    },
    "INDBANK.NS": {
        "short_name": "INDBANK MERCH BANK",
        "long_name": "Indbank Merchant Banking Services Limited",
        "summary": "Indbank Merchant Banking Services Limited provides merchant banking, stock broking, depository participant, and allied services in India. It also distributes mutual funds. The company was incorporated in 1989 and is based in Chennai, India. Indbank Merchant Banking Services Limited is a subsidiary of Indian Bank.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600035",
        "website": "http://www.indbankonline.com",
        "market_cap": "Nano Cap"
    },
    "INDIANB.NS": {
        "short_name": "INDIAN BANK",
        "long_name": "Indian Bank",
        "summary": "Indian Bank provides various banking product and services. The company provides deposit products, including savings and current accounts, term deposits, and Non Resident Indian (NRI) accounts. It also offers agriculture, group, personal/individual, micro small and medium enterprises, education, and NRI loans. In addition, the company provides Internet and mobile banking, as well as Ministry of Corporate Affairs payment, money gram, money transfer, remittance, and multicity check facility services; debit and credit cards; insurance services; direct and indirect tax payment services; debenture trustee services; and merchant banking and housing finance services. As of March 31, 2020, it operated 2,887 branches comprising 740 rural, 833 semi urban, 637 urban, and 677 metropolitan branches in India; 3 foreign branches in Singapore, Colombo, and Jaffna; and 4059 automated teller machines. Indian Bank was founded in 1907 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600014",
        "website": "http://www.indianbank.in",
        "market_cap": "Mid Cap"
    },
    "INDOSTAR.NS": {
        "short_name": "INDOSTAR CAP FIN",
        "long_name": "IndoStar Capital Finance Limited",
        "summary": "IndoStar Capital Finance Limited, a non-banking financial company, provides various financing services to corporates, and small and medium enterprises in India. It offers secured corporate lending products, including senior secured debt, structured financing, promoter funding, mezzanine funding, structured and acquisition financing, and real estate developer financing products; as well as loans for construction of commercial and residential properties. The company also provides SME lending products including self-occupied residential and commercial property, working capital, and business expansion or other requirements; vehicle finance; and housing finance. In addition, it offers investment advisory and asset management services. The company was incorporated in 2009 and is based in Mumbai, India. IndoStar Capital Finance Limited is a subsidiary of IndoStar Capital (Mauritius).",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.indostarcapital.com",
        "market_cap": "Small Cap"
    },
    "INDOTHAI.NS": {
        "short_name": "INDO THAI SECURITI",
        "long_name": "Indo Thai Securities Ltd.",
        "summary": "Indo Thai Securities Ltd. engages in stock and share brokers, depository participants, and other related ancillary businesses in India. The company trades in equities and derivatives, commodities derivatives, and currency derivatives; and provides online future trading through a network of 11 branches, authorized persons, etc. It also offers depository services; initial public offerings; life, health, motor/vehicle, fire, marine, travel, and indemnity insurance products; and mutual funds. In addition, it provides portfolio management services, non-convertible debentures, bonds, fixed deposits, and wealth management, as well as co-working spaces. Further, the company is involved in the real estate and consultancy business, as well as operates trading platform, and mobile and desktop applications under the Winstock name. It serves corporate clients, high net worth individuals, and retail investors. Indo Thai Securities Ltd. was founded in 1995 and is headquartered in Indore, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452010",
        "website": "http://www.indothai.co.in",
        "market_cap": "Nano Cap"
    },
    "INDUSINDBK.NS": {
        "short_name": "INDUSIND BANK LTD",
        "long_name": "IndusInd Bank Limited",
        "summary": "IndusInd Bank Limited provides various banking products and services to individuals, NRIs, business owners, corporates, and government and financial institutions. It operates through Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking business segments. The company offers current, savings, defense and corporate salary, and RFC accounts; and fixed and FCNR, sweep in/out deposits, senior citizen schemes, young saver deposits, and recurring and RFC deposits, as well as Rupee multiplier products. It also provides home, personal, car, two wheeler, gold, agricultural, and medical equipment loans, as well as loans against property and securities; business loans; and loan on credit cards. In addition, the company offers transaction banking services, including letters of credit/guarantees, structured trade and export finance, and import finance solutions, as well as cash management and remittance services; investment products, such as demat account, mutual fund, gold bond, national pension system, and equity trading; project finance, debt underwriting and placement, advisory related to M&A and equity raise, structured credit products, etc.; and health, general, life, and card protection insurance. Further, it provides debit, credit, forex, and commercial cards; individual outward remittances, foreign currency bank notes and demand drafts, and travelers cheque; financial inclusion products; trade and foreign exchange accounts; real estate developer financing and bullion services; correspondent banking services; and forex and derivative desk, information and advisory, and remittances through forex channel services. As of December 31, 2020, the company had 1,915 branches and 2,835 ATMs in India, as well as representative offices in London, Dubai, and Abu Dhabi. IndusInd Bank Limited was founded in 1994 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.indusind.com",
        "market_cap": "Large Cap"
    },
    "INFOMEDIA.NS": {
        "short_name": "INFOMEDIA PRESS LI",
        "long_name": "Infomedia Press Limited",
        "summary": "Infomedia Press Limited does not have significant operations. The company intends to evaluate various options, including starting a new line of business. Previously, it was involved in printing business. The company was formerly known as Infomedia 18 Limited and changed its name to Infomedia Press Limited in July 2012. The company was incorporated in 1955 and is based in Mumbai, India. Infomedia Press Limited is a subsidiary of Network18 Media & Investments Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Shell Companies",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.infomediapress.in",
        "market_cap": "Nano Cap"
    },
    "INVENTURE.NS": {
        "short_name": "INVENTURE GROWTH &",
        "long_name": "Inventure Growth & Securities Limited",
        "summary": "Inventure Growth & Securities Limited, together with its subsidiaries, provides various financial products and services in India. The company offers shares and other securities broking, financial product distribution, institutional broking, and mutual fund investment services. It also provides consumer and business loans, loans against properties and securities, inter corporate deposits, salaried personal loans, and gold loans, as well as financial institutions group lending services; commodities broking and hedging services, and arbitrage products; and life and general insurance broking services, as well as risk management solutions. In addition, the company offers issue management, leasing and hire purchase, loan syndication, mergers and acquisitions, treasury and portfolio management, project advisory, structured debt placement, mergers and acquisitions, capital markets, private equity, stressed assets resolution, etc.; and manages funds. Further, it engages in the real estate business. It serves institutional clients, HNIs, and retail investors through 224 business locations, including branches, franchisees, and sub-brokers. Inventure Growth & Securities Limited was founded in 1995 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 093",
        "website": "http://www.inventuregrowth.com",
        "market_cap": "Nano Cap"
    },
    "IOB.NS": {
        "short_name": "INDIAN OVERSEAS BK",
        "long_name": "Indian Overseas Bank",
        "summary": "Indian Overseas Bank provides various banking products and services. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. It offers saving bank and current accounts, term deposits, retail loans, debit and credit cards, NRI accounts, agricultural and rural banking products, MSME loans, and merchant banking services. The company operates through 3270 branches and 3032 ATMs in India. It also operates through branches located in Singapore, Hong Kong, Bangkok, and Sri Lanka. Indian Overseas Bank was founded in 1937 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://www.iob.in",
        "market_cap": "Mid Cap"
    },
    "IRFC.NS": {
        "short_name": "Indian Railway Fin Corp L",
        "long_name": "Indian Railway Finance Corporation Limited",
        "summary": "Indian Railway Finance Corporation Limited operates as a financing company in India. The company engages in borrowing funds from the financial markets to finance the acquisition/creation of assets that are leased out to the Indian Railways as finance lease. It also operates as a non-deposit taking non-banking financial and infrastructure finance company. The company was founded in 1986 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110021",
        "website": "http://www.irfc.nic.in",
        "market_cap": "Mid Cap"
    },
    "ISEC.NS": {
        "short_name": "ICICI SEC. LTD",
        "long_name": "ICICI Securities Limited",
        "summary": "ICICI Securities Limited provides institutional and retail broking, merchant banking, and advisory services to corporates, financial institutions, high net-worth individuals, and retail investors in India. The company operates through three segments: Investment & Trading, Broking & Commission, and Advisory Services. It operates ICICIdirect.com, an online broking platform to invest in equity, derivatives, currency futures, and margin trading funding; and distributes financial products and services, such as mutual funds, fixed deposits, loans, tax services, pension products, rental discounting, asset financing, overdraft, and life and general insurance products. The company also provides private wealth management services, such as investment solutions, protection, mortgages and loans, tax advisory, estate planning, and real estate services, as well as alternative investment, raising equity capital, debt syndication, and monetizing assets services; and operates approximately 172 ICICIdirect branches in 70 cities. In addition, it offers equity capital market products and services, including initial public offerings, qualified institutional placements, issues rights, follow-on offerings, issues preferential, block deal, algo trading, corporate access, investor meets, and equity research; and corporate finance services comprising equity capital market, debt advisory, mergers and acquisitions, advisory, private equity, structured products, restructuring, equity-debt issue management services, and other related activities. The company was formerly known as ICICI Securities and Finance Company Limited and changed its name to ICICI Securities Limited in April 2003. The company was incorporated in 1995 and is headquartered in Mumbai, India. ICICI Securities Limited is a subsidiary of ICICI Bank Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.icicisecurities.com",
        "market_cap": "Mid Cap"
    },
    "IVC.NS": {
        "short_name": "IL & FS INVESTMENT",
        "long_name": "IL&FS Investment Managers Limited",
        "summary": "IL&FS Investment Managers Limited is the private equity, venture capital, and real estate investment arm of Infrastructure Leasing & Financial Services Limited. The firm specializes in seed capital, late venture, growth capital, expansions, middle market, restructuring, stressed assets, recapitalizations, buyouts investments, and real estate investments in high-growth real estate assets including office, residential, retail, integrated townships, special economic zones, hospitality, and mixed-use properties. It also makes debt investments as well as investment banking led private equity transactions focused on opportunities arising from stressed assets. The firm seeks to invest in energy, materials, logistics, agricultural services, auto components, textiles, healthcare, power, waste management, toll roads and cable infrastructure, biotechnology, niche manufacturing, retail, media, consumer services, consumer brands, pharmaceuticals, manufacturing, airport services, highways and rail tracks, marine ports and services, infrastructure and related services, telecom, city gas distribution, shipyards, life sciences, real estate, waste water treatment, information technology, and information technology enabled services companies. It seeks to invest in Middle East, Asian markets with a focus on India, Tamil Nadu, and Delhi; and China. It seeks to invest between $15 million and $100 million in companies with market capitalization of $50 million and $150 million. The firm prefers to make seed capital funding in infrastructure projects in the range of $2 million and $10 million. In the real estate sector, it seeks to invest between $20 million and $50 million. The firm seeks to hold its investments for a period between three years and five years. It seeks to make private equity investments in post revenue companies. The firm prefers to take a seat on the board of directors of its portfolio companies. IL&FS Investment Managers Limited was founded in 1989 and is based in Mumbai, India with additional offices in Bengaluru, India and Mauritius.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.iimlindia.com",
        "market_cap": "Nano Cap"
    },
    "J&KBANK.BO": {
        "short_name": "JAMMU & KASHMIR BANK LTD.",
        "long_name": "The Jammu and Kashmir Bank Limited",
        "summary": "The Jammu and Kashmir Bank Limited provides various banking products and services for household, and small and medium enterprises in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business segments. The company offers various accounts, such as savings, salary, pension, and current accounts; and term deposits. It also offers housing, consumer, education, term, car, coaching fee, and skill loans; and Saholiat/Saral, laptop/PC, smartphone, primary education, modular kitchen, and two-wheeler finance, as well as festival advance and cash credit schemes, and loan against gold. In addition, the company provides finance for commercial vehicles, school buses, passenger buses/mini buses, craft development, craftsmen livelihood, handicrafts, commercial premises, contractor, mini sheep farm establishment, construction equipment, small businessmen, and tourism; mortgage loans for trade and service sector, loans against mortgage of immovable property, fair price shop scheme, and all-terrain vehicles/snowmobile finance scheme; and agricultural loans. Further, it offers mutual funds, life and non-life insurance products, and nonresident banking services; and Internet and mobile banking, ATM, as well as debit, credit, and prepaid cards. As of March 31, 2020, The Jammu and Kashmir Bank Limited operated 955 branches in 17 states and 4 union territories; and 1354 ATM's. The company was founded in 1938 and is headquartered in Srinagar, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "BSE",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Srinagar",
        "zipcode": "190001",
        "website": "http://www.jkbank.com",
        "market_cap": "Micro Cap"
    },
    "J&KBANK.NS": {
        "short_name": "JAMMU & KASHMIR BA",
        "long_name": "The Jammu and Kashmir Bank Limited",
        "summary": "The Jammu and Kashmir Bank Limited provides various banking products and services for household, and small and medium enterprises in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Business segments. The company offers various accounts, such as savings, salary, pension, and current accounts; and term deposits. It also offers housing, consumer, education, term, car, coaching fee, and skill loans; and Saholiat/Saral, laptop/PC, smartphone, primary education, modular kitchen, and two-wheeler finance, as well as festival advance and cash credit schemes, and loan against gold. In addition, the company provides finance for commercial vehicles, school buses, passenger buses/mini buses, craft development, craftsmen livelihood, handicrafts, commercial premises, contractor, mini sheep farm establishment, construction equipment, small businessmen, and tourism; mortgage loans for trade and service sector, loans against mortgage of immovable property, fair price shop scheme, and all-terrain vehicles/snowmobile finance scheme; and agricultural loans. Further, it offers mutual funds, life and non-life insurance products, and nonresident banking services; and Internet and mobile banking, ATM, as well as debit, credit, and prepaid cards. As of March 31, 2020, The Jammu and Kashmir Bank Limited operated 955 branches in 17 states and 4 union territories; and 1354 ATM's. The company was founded in 1938 and is headquartered in Srinagar, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Srinagar",
        "zipcode": "190001",
        "website": "http://www.jkbank.com",
        "market_cap": "Micro Cap"
    },
    "JINDALPHOT.NS": {
        "short_name": "JINDAL PHOTO LTD",
        "long_name": "Jindal Photo Limited",
        "summary": "Jindal Photo Limited primarily invests in the shares of companies in India. It also provides management consultancy services. The company was incorporated in 2004 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.jindalphoto.com",
        "market_cap": "Nano Cap"
    },
    "JMFINANCIL.NS": {
        "short_name": "JM FINANCIAL",
        "long_name": "JM Financial Limited",
        "summary": "JM Financial Limited provides a range of financial products and services to corporations, financial institutions, high net-worth individuals, and retail investors in India. It operates through four segments: Investment Banking, Wealth Management and Securities Business; Mortgage Lending; Distressed Credit; and Asset Management. The Investment Banking, Wealth Management and Securities Business segment manages capital markets transactions, as well as advises on mergers and acquisitions, and private equity syndication. This segment also provides investment advisory and distribution services, which include equity brokerage, wealth management, and capital market lending for wealth management and broking clients, as well as distributes financial products; and administers and manages private equity and real estate funds. The Mortgage Lending segment provides finance against commercial and residential real estate to a range of corporates and non-corporate clients, as well as includes housing finance business, and lending to education institutions. The Distressed Credit segment provides securitization and reconstruction of financial assets. The Asset Management segment manages mutual fund assets through various schemes by offering a range of investment options to institutional and corporate clients, as well as high net worth individuals. JM Financial Limited was founded in 1973 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.jmfl.com",
        "market_cap": "Small Cap"
    },
    "JPOLYINVST.NS": {
        "short_name": "JINDAL POLY INV &",
        "long_name": "Jindal Poly Investment and Finance Company Limited",
        "summary": "Jindal Poly Investment and Finance Company Limited engages in investment activities in India. The company was incorporated in 2012 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.jpifcl.com",
        "market_cap": "Nano Cap"
    },
    "KARURVYSYA.NS": {
        "short_name": "KARUR VYSYA BANK",
        "long_name": "The Karur Vysya Bank Limited",
        "summary": "The Karur Vysya Bank Limited provides various banking and financial services for personal and corporate customers in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. The company offers savings and current accounts; recurring and tax saving deposits; personal, home, vehicle, educational, and mortgage loans; debit and credit cards; prepaid instruments, including gift, forex travel, and re-loadable cards, as well as cards for senior citizens; life, non-life, and health insurance products; demat, trading, and mutual fund services, as well as sovereign gold bond schemes; digital products; locker facilities; and government schemes. It also provides loans for micro, small, and medium enterprises, as well as commercial loans; payment collection and transaction banking services; FCNR, NRE, and NRO deposits; jewel loans and loans against deposits; bancassurance services; treasury and remittance services; and Internet and mobile banking services, as well as a range of products for the agricultural sector. As of March 31, 2020, the company operated 779 branches and 1,659 automated teller machines. The Karur Vysya Bank Limited was founded in 1916 and is based in Karur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Karur",
        "zipcode": "639002",
        "website": "http://www.kvb.co.in",
        "market_cap": "Small Cap"
    },
    "KEYFINSERV.NS": {
        "short_name": "KEYNOTE FINANCIAL",
        "long_name": "Keynote Financial Services Limited",
        "summary": "Keynote Financial Services Limited provides investment banking and brokerage services in India. It offers capital market services, which include IPO/rights issue services, such as valuation reports, conducting the due diligence, assessing the fund requirement, market making, underwriting the issue, and lead managing; and merchant banking and advisory services, such as buybacks, delisting, and tender offers. The company also provides corporate finance services related to project finance, syndication, asset based bank loan, structured finance, restructuring advice, venture capital/private equity, valuation, and financial modeling; and mergers and acquisition advisory services in the areas of acquisitions, merger advisory, sale and divesture, joint ventures and alliances, access strategy, acquisition finance, FCCBs, ADRs, GDRs, and listings on international exchanges. In addition, it offers employee stock ownership plans; private equity services; valuation services; and equity trading, commodity trading, currency trading, and investment advisory services, as well as equity/debt placements and restructuring services. The company was formerly known as Keynote Corporate Services Limited and changed its name to Keynote Financial Services Limited in April 2019. The company was founded in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400028",
        "website": "http://www.keynoteindia.net",
        "market_cap": "Nano Cap"
    },
    "KHANDSE.NS": {
        "short_name": "KHANDWALA SEC LTD",
        "long_name": "Khandwala Securities Limited",
        "summary": "Khandwala Securities Limited provides stock broking, investment banking, investment advisory, portfolio management, and depository participant services in India. It offers investment banking services, including capital raising, mergers and acquisitions advisory, domestic IPOs, FCCBs, private equity placements, corporate finance advisory, follow-on offerings, rights offerings, ADR and GDR offerings, QIP transactions and convertible offerings, and restructuring services. The company also provides institutional equities services, such as institutional equity sales, execution, research; and broking and distribution services comprising non-institutional equity sales, trading, research, and broking and distribution. In addition, it offers investment advisory services, including private and corporate wealth management, planning and asset deployment advice, and asset allocation and distribution of various products; and equity and debt issue management services. The company serves public and private sector corporations, multinational corporations, financial institutions, institutional investors, high net worth individuals, and retail investors, as well as market intermediaries. Khandwala Securities Limited was founded in 1934 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400023",
        "website": "http://www.kslindia.com",
        "market_cap": "Nano Cap"
    },
    "KICL.NS": {
        "short_name": "KALYANI INVESTMENT",
        "long_name": "Kalyani Investment Company Limited",
        "summary": "Kalyani Investment Company Limited, a non-deposit taking core investment company, invests in listed and unlisted companies in India. It invests in companies of various sectors, including forging, steel, power generation, chemical, banking, etc. The company was incorporated in 2009 and is based in Pune, India. Kalyani Investment Company Limited is a subsidiary of Sundaram Trading and Investment Private Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411036",
        "website": "http://www.kalyani-investment.com",
        "market_cap": "Micro Cap"
    },
    "KOTAKBANK.NS": {
        "short_name": "KOTAK MAHINDRA BAN",
        "long_name": "Kotak Mahindra Bank Limited",
        "summary": "Kotak Mahindra Bank Limited, provides banking and financial services to corporate and individual customers in India. It operates through Treasury, BMU, and Corporate Centre; Retail Banking; Corporate/Wholesale Banking; Vehicle Financing; Other Lending Activities; Broking; Advisory and Transactional Services; Asset Management; and Insurance segments. The Treasury, BMU and Corporate Centre segment engages in dealing in debt, equity, money and forex market, derivatives, and investments; and the primary dealership of government securities and balance sheet management unit (BMU) responsible for asset liability management. The Retail Banking segment offers commercial vehicle finance, personal, home, and other loans/services, and agriculture finance services. This segment also provides savings, current, and term deposit accounts; branch banking network and services, including distribution of financial products; and credit cards. The Corporate/Wholesale Banking segment offers wholesale borrowings and lending, and other related services to the corporate sector. Its Vehicle Financing segment provides retail vehicle and wholesale trade finance to auto dealers. The Other Lending Activities segment offers financing against securities, securitization, and other loans/services. Its Broking segment provides brokerage income on market transactions and delayed payments interest; and distributes financial products. The Advisory and Transactional Services segment offers mergers and acquisition advice, and equity/debt issue management services. Its Asset Management segment engages in the management of funds and investments on behalf of clients and funds. The Insurance segment provides life insurance and general insurance products. As of March 31, 2020, it had a network of 1,600 branches and 2,519 ATMs; and branches in GIFT City and DIFC, Dubai. Kotak Mahindra Bank Limited was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.kotak.com",
        "market_cap": "Large Cap"
    },
    "KTKBANK.NS": {
        "short_name": "KARNATAKA BANK",
        "long_name": "The Karnataka Bank Limited",
        "summary": "The Karnataka Bank Limited provides personal and business banking products and services in India. It operates through four segments: Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. The company offers savings and current accounts; fixed, cash certificate, and recurring deposits; and non-resident rupee, ordinary non-resident, foreign currency, and resident foreign currency accounts, as well as NRI priority banking services. It also provides loan products, including vehicle, home, education, personal, MSME, mortgage, women entrepreneur, gold, and other loans, as well as loans against property. In addition, the company offers debit, credit, gift, deposit only, and image cards; life, general, and health insurance products; investment products; remittance and other services; and forex services comprising pre and post-shipment, export collection bills, export LC advising, inward remittance facility, import letter of credit, import bill collection, buyer's credit, and outward remittances. Further, it provides point of sale service for merchant's payment solutions; and KBL e-COLLECT, a fee payment processing platform, which enables the institution to offer parents and students a way to pay their fees through a range of payment options. Additionally, the company offers various loans for agriculture; and other services, such as Internet and mobile banking, mutual funds, demat and online trading services, locker facility, and funds transfer services. As of March 31, 2020, it operated through a network of 848 branches, 1,480 ATMs, and 2,329 service outlets. The company was founded in 1924 and is headquartered in Mangalore, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mangalore",
        "zipcode": "575002",
        "website": "http://karnatakabank.com",
        "market_cap": "Micro Cap"
    },
    "LFIC.NS": {
        "short_name": "LAKSHMI FINANCE &",
        "long_name": "Lakshmi Finance & Industrial Corporation Limited",
        "summary": "Lakshmi Finance & Industrial Corporation Limited, a non-banking finance company, invests in equity shares and mutual funds in India. The company was formerly known as The Andhra Bank Ltd. and changed its name to Lakshmi Finance & Industrial Corporation Limited in April 1980. Lakshmi Finance & Industrial Corporation Limited was incorporated in 1923 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.lakshmifinance.org.in",
        "market_cap": "Nano Cap"
    },
    "LICHSGFIN.NS": {
        "short_name": "LIC HOUSING FINAN",
        "long_name": "LIC Housing Finance Limited",
        "summary": "LIC Housing Finance Limited, a housing finance company, provides loans for purchase, construction, repair, and renovation of houses/buildings in India. It offers deposits; home loans to resident and non-resident Indians, as well as before and after retirement loans to pensioners; construction finance and term loans for builders/developers; and loans for staff quarters and other lines of credit for corporates. The company also provides loans against properties for companies and individuals; loans against securities; loans under rental securitization; and loans to professionals. In addition, it manages, advises, and acts as a trustee to venture capital and alternative investment funds; develops residential projects for senior citizens; and markets life and general insurance products, mutual funds, and credit and LIC cards. The company markets its products through home loan agents, direct sales agents, and customer relation associates. As of March 31, 2020, it operated through a network of 25 back offices, 282 marketing offices, and 1 customer service point, as well as 9 regional offices in India; and representative offices in Dubai and Kuwait. LIC Housing Finance Limited was founded in 1989 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400005",
        "website": "http://www.lichousing.com",
        "market_cap": "Mid Cap"
    },
    "M&MFIN.NS": {
        "short_name": "MAHINDRA &MAH FIN",
        "long_name": "Mahindra & Mahindra Financial Services Limited",
        "summary": "Mahindra & Mahindra Financial Services Limited, a non-banking financial company, provides asset finance in the rural and semi-urban areas in India. The company offers financing for auto and utility vehicles, tractors, cars, commercial vehicles and construction equipment, and preowned and others vehicles to transport operators, farmers, small businesses and self-employed and salaried individuals; personal Loans for weddings, children's education, medical treatment, and working capital for a small or medium-sized enterprise; and project finance, equipment finance, working capital finance, vehicle finance, and bill discounting services to small and medium-sized enterprises. It also provides life, non-life, and reinsurance products; housing finance; equity mutual funds, tax saver mutual funds, monthly income funds, and other investment products; and investments and advisory services. The company was formerly known as Maxi Motors Financial Services Limited and changed its name to Mahindra & Mahindra Financial Services Limited in November 1992. Mahindra & Mahindra Financial Services Limited was founded in 1991 and is headquartered in Mumbai, India. Mahindra & Mahindra Financial Services Limited is a subsidiary of Mahindra & Mahindra Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400018",
        "website": "http://www.mahindrafinance.com",
        "market_cap": "Mid Cap"
    },
    "MAGMA.NS": {
        "short_name": "MAGMA FINCORP LTD",
        "long_name": "Magma Fincorp Limited",
        "summary": "Magma Fincorp Limited, a non-banking financial company, provides asset finance services in India. The company offers loans for cars, SMEs, construction equipment, commercial vehicles, tractors, and used vehicles. It also provides housing finance; and auto leasing services. The company operates a network of 314 branches. Magma Fincorp Limited was incorporated in 1978 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400022",
        "website": "http://www.magma.co.in",
        "market_cap": "Small Cap"
    },
    "MAHABANK.NS": {
        "short_name": "BK OF MAHARASHTRA",
        "long_name": "Bank of Maharashtra",
        "summary": "Bank of Maharashtra provides various banking products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking segments. It accepts savings, current, and term deposits, as well as capital gain account schemes. The company also provides term loans, overdrafts, letters of credit, guarantees, and other products, as well as loans for exporters, agriculturists, corporates, entrepreneurs, professionals, and individuals; housing, skill, educational, vehicle, gold, top up, personal, and consumer loans, as well as micro, small, and medium enterprise loans; schemes for solar water heating and lighting systems, and salary gains; and loans against properties. In addition, it offers mobile-point of sale, ATM, DEMAT, real time gross settlement, national electronic funds transfer, executors and trustee, e-SBTR, e-payment, online shopping/utility payment, online share investment and trading, unified payments interface, internet and mobile banking, payroll, and door step banking services, as well as ASBA services for corporate houses/institutional investors, such as LIC/GIC/mutual fund companies; and credit and debit cards, bancassurance products, mutual funds, and pension schemes. Further, the company provides non-resident ordinary and external, foreign currency non-resident, and resident foreign currency accounts, as well as inward and outward remittance services; and documentary credits and collections, import and export financing, guarantees, travel related forex, non-resident Indians, and risk management services, as well as collects direct taxes. As of March 31, 2020, it operated 1833 branches and 1851 ATMs. Bank of Maharashtra was founded in 1935 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411005",
        "website": "http://www.bankofmaharashtra.in",
        "market_cap": "Mid Cap"
    },
    "MAHAPEXLTD.NS": {
        "short_name": "MAHA RASHTRA APEX",
        "long_name": "Maha Rashtra Apex Corporation Limited",
        "summary": "Maha Rashtra Apex Corporation Limited does not have significant operations. Previously, it was engaged in the hire purchase and leasing business. The company was formerly known as Maharashtra Apex Bank Ltd. Maha Rashtra Apex Corporation Limited was incorporated in 1943 and is based in Manipal, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Manipal",
        "zipcode": "576104",
        "website": "http://www.maharashtraapex.com",
        "market_cap": "Nano Cap"
    },
    "MANAPPURAM.NS": {
        "short_name": "MANAPPURAM FINANCE",
        "long_name": "Manappuram Finance Limited",
        "summary": "Manappuram Finance Limited, a non-banking financial company, provides retail credit products and financial services in India. The company offers loans against the pledge of household and used gold jewelry, as well as short-term personal and business gold loans; microfinance loans and other financial services to low income population; loans for construction, extension, purchase, and improvement of homes; loans for hospitality industry; tour and travel loan; and vehicle loans. It also provides life and nonlife insurance products; IT solutions; and depository, pan card, and foreign exchange and money transfer services. As of March 31, 2020, it operated 3,531 branches in 23 states and 5 union territories. The company was formerly known as Manappuram General Finance and Leasing Limited and changed its name to Manappuram Finance Limited in 2011. Manappuram Finance Limited was founded in 1949 and is headquartered in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680567",
        "website": "http://www.manappuram.com",
        "market_cap": "Small Cap"
    },
    "MASFIN.NS": {
        "short_name": "MAS FINANCIAL SERV",
        "long_name": "MAS Financial Services Limited",
        "summary": "MAS Financial Services Limited, a non-banking finance company, offers retail financing services in India. The company provides micro enterprise, two wheeler, small and medium enterprise, salaried personal, commercial vehicle, used car, tractor, and housing loans; and loans to micro finance institutions and non-banking financial companies. As of March 31, 2020, it operated approximately 3,450 centers through its network of 105 branches in cities of Gujarat, Maharashtra, Rajasthan, Madhya Pradesh, Tamil Nadu, and Karnataka. The company serves low and middle income individuals, as well as micro, small, and medium enterprises. MAS Financial Services Limited was founded in 1995 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380009",
        "website": "http://www.mas.co.in",
        "market_cap": "Small Cap"
    },
    "MASKINVEST.NS": {
        "short_name": "MASK INVESTMENTS L",
        "long_name": "Mask Investments Limited",
        "summary": "Mask Investment Limited engages in the finance and investment activities in India. It invests in quoted and unquoted securities. The company was formerly known as Mask Investment Private Limited and changed its name to Mask Investment limited in March 1996. Mask Investment Limited was incorporated in 1992 and is based in Surat, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Surat",
        "zipcode": "395002",
        "website": "http://www.maskinvestments.com",
        "market_cap": "Nano Cap"
    },
    "MCDHOLDING.NS": {
        "short_name": "MCDOWELL HOLDINGS",
        "long_name": "McDowell Holdings Limited",
        "summary": "McDowell Holdings Limited operates as a non-banking financial company in India. It engages in the provision of long term investments; and consultancy services. The company was formerly known as McDowell India Sprits Limited and changed its name to McDowell Holdings Limited in October 2006. McDowell Holdings Limited was incorporated in 2004 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560001",
        "website": "http://www.mcdowellholdings.co.in",
        "market_cap": "Nano Cap"
    },
    "MCX.NS": {
        "short_name": "MULTI COMMODITY EX",
        "long_name": "Multi Commodity Exchange of India Limited",
        "summary": "Multi Commodity Exchange of India Limited, a commodity derivatives exchange, provides a platform to facilitate online trading of commodity derivatives in India. The company offers iCOMDEX, a real-time commodity futures price indices; and trades in bullion, base metals, energy, and agricultural commodities. It also provides trade clearing and settlement services; guarantees counter party risk; and and data feed services. The company has strategic alliances with various exchanges, such as CME group, Dalian Commodity Exchange, London Metal Exchange, Mozambique Commodities Exchange, Taiwan Futures Exchange, and Zhengzhou Commodity Exchange. Multi Commodity Exchange of India Limited was incorporated in 2002 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Data & Stock Exchanges",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.mcxindia.com",
        "market_cap": "Small Cap"
    },
    "MFSL.NS": {
        "short_name": "MAX FINANCIAL SERV",
        "long_name": "Max Financial Services Limited",
        "summary": "Max Financial Services Limited, through its subsidiary, Max Life Insurance Company Limited, provides life insurance products in India. The company offers a range of participating, non-participating, and linked products covering life insurance, pension, and health benefits, including riders for individual and group segments. Its products are distributed through individual and corporate agents, banks, brokers, and other channels. The company also engages in the treasury investment activities. Max Financial Services Limited has a strategic bancassurance relationship with Yes Bank Limited. The company was formerly known as Max India Limited and changed its name to Max Financial Services Limited in January 2016. Max Financial Services Limited was incorporated in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.maxfinancialservices.com",
        "market_cap": "Mid Cap"
    },
    "MOTILALOFS.NS": {
        "short_name": "MOTILAL OSWAL FINA",
        "long_name": "Motilal Oswal Financial Services Limited",
        "summary": "Motilal Oswal Financial Services Limited provides financial services in India. The company operates through Broking and Other Related Activities, Fund Based Activities, Asset Management and Advisory, Investment Banking Services, and Home Finance segments. It offers broking and distribution services, such as equities, derivatives, commodities, currency, depository services, portfolio management services, mutual funds, primary equity offerings, and insurance products; and asset management services. The company also provides private wealth management services, such as equity, alternate, credit solutions, estate planning, will making, and property advisory services; and home loans. In addition, the company offers institutional broking services, including cash and derivatives; private equity services; and investment banking advisory and transaction solutions, including private placement of equity, mergers and acquisitions advisory, and equity capital markets transactions. It serves high net worth individuals; and mutual funds, foreign institutional investors, financial institutions, and corporate clients. Motilal Oswal Financial Services Limited was founded in 1987 and is headquartered in Mumbai, India. Motilal Oswal Financial Services Limited operates as a subsidiary of Passionate Investment Management Private Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.motilaloswalgroup.com",
        "market_cap": "Small Cap"
    },
    "MUTHOOTCAP.NS": {
        "short_name": "MUTHOOT CAPITAL SE",
        "long_name": "Muthoot Capital Services Limited",
        "summary": "Muthoot Capital Services Limited, a non-banking finance company (NBFC), provides fund and non-fund based financial services. The company offers two wheeler, used car, consumer durable, secured business, term, and loyalty loans; short-term and long-term deposit plans; and subordinated debts, as well as advisory services. It is also involved in buying loan portfolio of other NBFCs/micro finance companies. The company serves retail, corporate, and institutional customers through a network of branches in India. Muthoot Capital Services Limited was founded in 1994 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682035",
        "website": "http://www.muthootcap.com",
        "market_cap": "Micro Cap"
    },
    "MUTHOOTFIN.NS": {
        "short_name": "MUTHOOT FINANCE LT",
        "long_name": "Muthoot Finance Limited",
        "summary": "Muthoot Finance Limited operates as a gold financing company in India. It provides personal and business loans secured by gold jewelry, or gold loans primarily to individuals; micro finance; and loans to landlords. The company also offers gold coins, money transfer, foreign exchange, insurance, ATM, wealth succession, and housing finance services; mutual funds and non-convertible debentures; and wealth management services, including risk evaluation, client evaluation, value analysis, and consultancy. In addition, the company provides Travel Jango that provides international and domestic air ticketing service, Visa services and assistance, tour packages, hotel booking, travel insurance, and bus ticketing services. Further, it generates electric power through wind. As of March 31, 2020, the company operated approximately 4,567 branches in 29 states. Muthoot Finance Limited was founded in 1887 and is headquartered in Kochi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682018",
        "website": "http://www.muthootfinance.com",
        "market_cap": "Mid Cap"
    },
    "NAGREEKCAP.NS": {
        "short_name": "NAGREEKA CAPITAL &",
        "long_name": "Nagreeka Capital & Infrastructure Ltd.",
        "summary": "Nagreeka Capital & Infrastructure Ltd. is a publicly owned investment manager. The firm invests in equity markets, private equity, mutual funds, real estate, and renewable energy. The firm was founded Nagreeka Securities Ltd. and changed its name to Nagreeka Software Technologies Limited in September 2001. Nagreeka Software Technologies Limited further changed its name to Nagreeka Capital & Infrastructure Ltd. in July 2006. Nagreeka Capital & Infrastructure Ltd. was founded in 1953 is based in Mumbai, India with an additional office in Kolkata, India. Nagreeka Capital & Infrastructure Ltd. operates independently of Nagreeka Exports Ltd. as of September 18, 2007.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400004",
        "website": "http://www.nagreeka.com/capital",
        "market_cap": "Nano Cap"
    },
    "NAHARCAP.NS": {
        "short_name": "NAHAR CAPITAL AND",
        "long_name": "Nahar Capital and Financial Services Limited",
        "summary": "Nahar Capital and Financial Services Limited, a non-deposit taking non-banking financial company, engages in investment/financial activities. The company invests in various financial securities, including equity, bonds, debentures, commodity, term deposits, and securities of various kind issued by companies, banks, mutual funds, and other authorities, as well as central, state, municipal, and local bodies. It also provides lending services against liquid securities, such as shares, government bonds, gold, property, and other assets. In addition, the company is involved in the real estate business, including the purchase and sale of residential and/or commercial land with trading perspective; dealing in real estate, the development of land, and the construction of building for commercial and residential purpose; leasing, hiring, or acquiring various real estate assets; and leasing of flats and buildings. Nahar Capital and Financial Services Limited was incorporated in 2006 and is based in Ludhiana, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ludhiana",
        "zipcode": "141003",
        "website": "http://www.owmnahar.com/nahar_cf/about.php",
        "market_cap": "Nano Cap"
    },
    "NBIFIN.NS": {
        "short_name": "N.B.I. INDUSTRIAL",
        "long_name": "N.B.I. Industrial Finance Company Limited",
        "summary": "N.B.I. Industrial Finance Company Limited, a non-banking financial company, invests in shares, securities, and other financial activities. The company was formerly known as The New Bank of India Limited and changed its name to N.B.I. Industrial Finance Company Limited in May 1951. N.B.I. Industrial Finance Company Limited was incorporated in 1936 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700 001",
        "website": "http://www.nbi-india.co.in",
        "market_cap": "Micro Cap"
    },
    "NDGL.NS": {
        "short_name": "NAGA DHUNSERI GROU",
        "long_name": "Naga Dhunseri Group Limited",
        "summary": "Naga Dhunseri Group Limited operates as a non-banking financial company. It invests in shares and securities; and rents commercial vehicles. The company was incorporated in 1918 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700 020",
        "website": "http://www.nagadhunserigroup.com",
        "market_cap": "Nano Cap"
    },
    "NIACL.NS": {
        "short_name": "THE NEW INDIA ASSU",
        "long_name": "The New India Assurance Company Limited",
        "summary": "The New India Assurance Company Limited, together with its subsidiaries, operates as a general insurance company in India and internationally. The company provides marine cargo and hull, motor, health, travel, home and contents, customized business and SME products, other personal, industrial, rural, machinery, aviation, liability, fire and burglary, crop, personal accident, and property insurance products. It also offers reinsurance products. The company was founded in 1919 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.newindia.co.in",
        "market_cap": "Mid Cap"
    },
    "NSIL.NS": {
        "short_name": "NALWA SONS INVEST",
        "long_name": "Nalwa Sons Investments Limited",
        "summary": "Nalwa Sons Investments Limited, a non-banking finance company, engages in the investment and financing activities in India. It operates through two segments, Investment & Finance, and Trading of Goods. The company primarily holds investments in equity shares of steel manufacturing companies of O.P. Jindal Group. It also invests in shares, stocks, or other securities. The company was formerly known as Jindal Strips Limited. Nalwa Sons Investments Limited was incorporated in 1970 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.nalwasons.com",
        "market_cap": "Micro Cap"
    },
    "ONELIFECAP.NS": {
        "short_name": "ONELIFE CAPITAL AD",
        "long_name": "Onelife Capital Advisors Limited",
        "summary": "Onelife Capital Advisors Limited provides strategic advisory services to corporates, HNIs, family offices, etc. in India. The company operates through Advisory Services, Broking Services, and NBFC Business segments. It offers advisory for fund raising through Indian and international markets that ensure capital structures and transaction processing for private placements. The company also advises companies on fund raising during the seed, growth, and expansion phases, as well as acquisition financing and structuring the deal to maximize value for its stakeholders. Its research coverage sectors include castor oil and derivatives, food processing, glass, infrastructure, metals, oil and gas, oral care, packaging, payment gateway, pharma, power, and recycle. In addition, the company engages in commodity broking and other related ancillary services. Further, it provides financing services. The company was founded in 2007 and is based in Thane, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400604",
        "website": "http://www.onelifecapital.in",
        "market_cap": "Nano Cap"
    },
    "PAISALO.NS": {
        "short_name": "PAISALO DIGITAL LT",
        "long_name": "Paisalo Digital Limited",
        "summary": "Paisalo Digital Limited provides business loans, SME and MSME loans, and income generation loans for business/self-employment purpose in India. It offers income generation loans for purchasing seeds, fodder, cattle's, etc.; and Paisalo- Joint Liability Group loans for agriculture and allied sectors. The company was formerly known as S. E. Investments Limited and changed its name to Paisalo Digital Limited in January 2018. Paisalo Digital Limited was founded in 1992 and is headquartered in Agra, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Agra",
        "zipcode": "282002",
        "website": "http://www.paisalo.in",
        "market_cap": "Small Cap"
    },
    "PEL.NS": {
        "short_name": "PIRAMAL ENTERPRISE",
        "long_name": "Piramal Enterprises Limited",
        "summary": "Piramal Enterprises Limited operates in financial services and pharmaceuticals businesses in North America, India, Japan, Europe, and internationally. It operates through Pharmaceuticals Manufacturing and Services, and Financial Services segments. The company provides financing to real estate developers, as well as corporate clients in non-real estate sectors. It also offers housing loans to individual customers and is building a multi-product retail lending platform, as well as engages in investment activities. In addition, the company provides integrated drug discovery, development, and manufacturing services to pharmaceutical companies for drug substance and drug products; inhalation anaesthesia, injectable anaesthesia, pain management, intrathecal spasticity, and other products used in hospitals or other managed care settings; and over-the-counter products in various categories, including skincare, gastrointestinal care, women's intimate range, kid's wellbeing and baby care, pain management, oral, and respiratory healthcare. The company was formerly known as Piramal Healthcare Limited and changed its name to Piramal Enterprises Limited in July 2012. Piramal Enterprises Limited was incorporated in 1947 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400070",
        "website": "http://www.piramal.com",
        "market_cap": "Mid Cap"
    },
    "PFC.NS": {
        "short_name": "POWER FINANCE CORP",
        "long_name": "Power Finance Corporation Limited",
        "summary": "Power Finance Corporation Limited, a non-banking finance company, provides financial products and related advisory, and other services to the power sector in India. The company offers fund based financial policies/products, including guidelines for solar and wind power generation projects, as well as for funding private sector independent transmission projects; debt refinancing and prepayment policy for solar wind projects; takeout financing, asset acquisition, bridge and corporate loan, buyer's line of credit, credit facility for purchase of power through power exchange, energy saving project, and project and short-term loan services; lease financing for the purchase of equipment and wind power projects; financing of fuel supply projects and equipment manufacturers; grants/interest free loans for studies/consultancies; line of credit for import of coal; policy for investment in equity of power projects; guidelines for funding grid connected solar thermal private sector power generation projects; policy for underwriting of debt; refinancing of debt of commissioned projects along with additional corporate loans for new-expansion-acquisition of projects; and financial assistance to distribution franchisee. It also provides non-fund based policies/products comprising guarantees, letter of comfort, and policy for guarantee for credit enhancement. Power Finance Corporation Limited was founded in 1986 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.pfcindia.com",
        "market_cap": "Mid Cap"
    },
    "PFS.NS": {
        "short_name": "PTC INDIA FINANCIA",
        "long_name": "PTC India Financial Services Limited",
        "summary": "PTC India Financial Services Limited provides financing solutions to companies with projects in the power sector and related areas across the entire energy value chain. The company provides debt assistance to projects in the energy value chain, such as generation, transmission, and distribution, as well as in fuel sources and related infrastructure; and invests in equities. It also offers fund based/non-fund based financial assistance in the form of debt or structured debt instruments. The company was founded in 2006 and is based in New Delhi, India. PTC India Financial Services Limited is a subsidiary of PTC India Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110066",
        "website": "http://www.ptcfinancial.com",
        "market_cap": "Micro Cap"
    },
    "PILANIINVS.NS": {
        "short_name": "PILANI INVESTMENT",
        "long_name": "Pilani Investment and Industries Corporation Limited",
        "summary": "Pilani Investment and Industries Corporation Limited, a non-banking financial company, invests in group companies and mutual funds in India. The company was founded in 1948 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.pilaniinvestment.com",
        "market_cap": "Micro Cap"
    },
    "PNB.NS": {
        "short_name": "PUNJAB NATL BANK",
        "long_name": "Punjab National Bank",
        "summary": "Punjab National Bank provides various banking and financial products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations. It offers personal banking products and services, including saving fund accounts, current accounts, fixed deposit, and capital gain account and gold monetization schemes; housing, vehicle, education, personal, and mortgage loans; and cards. The company also provides various micro, small, and medium enterprises schemes; banking products for government customers; agricultural banking services; corporate banking products and services consisting of loans against future lease rentals, working capital financing, and term loans; EXIM finance and cash management services, as well as gold card schemes for exporters; and international banking products and services. In addition, it offers insurance services, such as life, fire, motor vehicle, marine, theft/burglary, fidelity guarantee, personal accident, health, travel, house hold goods, etc.; and depository, mutual fund, merchant banking, and application supported by blocked amount services. Further, the company provides mobile banking, SMS banking, missed call, e-statement, ATM, cash deposit machine, passbook updation machine, and electronic cheque deposit machine services. As of March 31, 2020, it operated a network of 7,041 branches and 9,168 ATMs in India; and 2 branches internationally. The company was founded in 1895 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110075",
        "website": "http://www.pnbindia.in",
        "market_cap": "Mid Cap"
    },
    "PNBGILTS.NS": {
        "short_name": "PNB GILTS",
        "long_name": "PNB Gilts Ltd.",
        "summary": "PNB Gilts Ltd. operates as a primary dealer in government securities in India. The company is involved in underwriting government securities issuances; and trading fixed income instruments, such as government securities, treasury bills, state development loans, corporate bonds, and interest rate swaps; and provision of custodian services to its constituents. It also provides gilts accounts and mutual funds, as well as non-SLR papers, including bonds issued by public sector undertakings and other corporate bodies. In addition, the company trades in short term money market instruments comprising call/notice/term money, repo/reverse repo, inter corporate deposits, commercial papers, and certificates of deposit. It serves provident funds trusts, regional rural banks, co-operative banks, corporates, individuals, etc. The company was incorporated in 1996 and is based in New Delhi, India. PNB Gilts Ltd. is a subsidiary of Punjab National Bank.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.pnbgilts.com",
        "market_cap": "Micro Cap"
    },
    "PNBHOUSING.NS": {
        "short_name": "PNB HOUSING",
        "long_name": "PNB Housing Finance Limited",
        "summary": "PNB Housing Finance Limited operates as a housing finance company in India. The company offers housing loans for the purchase, construction, repair, and renovation of houses/ flats/commercial properties, etc.; loans for commercial spaces; loans against property; loans for purchase of residential plots; loans for purchase, construction, and extension of dwelling units; home loans for nonresident Indians and persons of Indian origin; Unnati home loans; and credit linked subsidy scheme for economical weaker section, and lower and middle income groups. It also provides non home loans, including loans for purchase/construction of commercial properties, residential/commercial immovable property mortgage loans, lease rental discounting loans, and loans for real estate developers. In addition, the company offers fixed deposits. The company was founded in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.pnbhousing.com",
        "market_cap": "Small Cap"
    },
    "PRIMESECU.NS": {
        "short_name": "PRIME SECURITIES",
        "long_name": "Prime Securities Limited",
        "summary": "Prime Securities Limited provides corporate advisory and investment banking services in India. It offers corporate advisory services that include financial advisory for debt and capital structuring; strategic, business, and value enhancement; mergers and acquisitions, and stake sales; and structured debt placement/loan syndications. The company also engages in the debt/equity/capital restructurings/loan re-organization activities; and provision of listed equity services, such as initial public offerings (IPO), qualified institutions placements, and rights issues/buybacks/open offers/preferential allotments, as well as local advisory to overseas offerings/foreign entrants. In addition, it offers unlisted equity services that include pre-IPO placements/PIPEs, private equity, and exits/strategic alliances/JVs. Prime Securities Limited was founded in 1982 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.primesec.com",
        "market_cap": "Nano Cap"
    },
    "PSB.NS": {
        "short_name": "PUNJAB & SIND BANK",
        "long_name": "Punjab & Sind Bank",
        "summary": "Punjab & Sind Bank provides various banking and financial products and services in India. It operates through Treasury Operations, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segment. The company offers deposit products, including saving accounts, current accounts, recurring deposit accounts, and fixed deposits; and loans, such as housing, auto, education, skill, commercial vehicle, personal, doctor, mortgage, business, gold, and other loans, as well as sukhmoney scheme for senior citizens, and SB OD schemes. It also provides non fund based products, such as letter of credit, LC advising/confirming, bank guarantee, letter of comfort for availing the buyers credit, co-acceptance facility, solvency certificate, and credit report products and services, as well as priority sector schemes and debt restructuring services. In addition, the company offers locker facility, government schemes, and life and general insurance; digital banking services, including internet and mobile banking, SMS banking, Aadhaar seeding, point of sale, unified payment interface, real time gross settlement (RTGS), NEFT, ATM/debit cards, and online payment; international banking services comprising NRI schemes, export/import services, forex treasury, and resident facility, as well as products for micro and small enterprises. Punjab & Sind Bank was founded in 1908 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110008",
        "website": "http://www.psbindia.com",
        "market_cap": "Small Cap"
    },
    "RBLBANK.NS": {
        "short_name": "RBL BANK LIMITED",
        "long_name": "RBL Bank Limited",
        "summary": "RBL Bank Limited operates as a scheduled commercial bank in India. It operates through Corporate/Wholesale Banking, Retail Banking, Treasury, and Other Banking Operations segments. The company's deposit products include savings accounts, current accounts, institution accounts, and fixed deposits. It also offers business, home, personal, car, and education loans, as well as loans against property, overdraft against property, loans against gold and deposits, working capital finance, and unsecured and secured small business loans; life, general, and health insurance products; investments services, such as wealth management, e-ASBA, and national pension system; and demat account. In addition, the company provides online tax and bill payment, debit and prepaid cards, online banking, bank by phone, digital and net banking, and merchant payment services. Further, it offers mergers and acquisitions advisory, private equity capital advisory, project and infrastructure finance, real estate financing, cash management, supply chain finance, and trade and remittance services; and financial markets and treasury products, such as capital markets, and forex and bullion. Additionally, the company provides agribusiness, NRI, and signature banking services, as well as safe deposit lockers. As of March 31, 2020, it operated a network of approximately 386 bank branches; 1,245 business correspondent branches; 263 banking outlets; and 596 ATMs in 28 Indian states and Union Territories. The company was formerly known as The Ratnakar Bank Limited and changed its name to RBL Bank Limited in August 2014. RBL Bank Limited was founded in 1943 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.rblbank.com",
        "market_cap": "Small Cap"
    },
    "RECLTD.NS": {
        "short_name": "REC LTD",
        "long_name": "REC Limited",
        "summary": "REC Limited, a public financial institution, provides financing services for power generation, transmission, and distribution projects in India. It primarily offers long-term, medium-term, and short-terms loans. The company also acts as a nodal agency for the implementation of Pradhan Mantri Sahaj Bijli Har Ghar Yojana for universal household electrification, Deen Dayal Upadhyaya Gram Jyoti Yojana, National Electricity Fund, Outage Management System, and 11kv Rural Feeder Management System, as well as acts as the bid process coordinator for selection of transmission service provider through tariff based competitive bidding process for independent inter-state and intra-state transmission projects; and provides consultancy services in transmission and distribution sectors. It serves central/state government power utilities, as well as private sector power utilities. The company was formerly known as Rural Electrification Corporation Limited and changed its name to REC Limited in October 2018. REC Limited was founded in 1969 and is based in New Delhi, India. REC Limited is a subsidiary of Power Finance Corporation Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110003",
        "website": "http://www.recindia.nic.in",
        "market_cap": "Mid Cap"
    },
    "RELCAPITAL.NS": {
        "short_name": "RELIANCE CAPITAL",
        "long_name": "Reliance Capital Limited",
        "summary": "Reliance Capital Limited, a non-banking financial company, primarily engages in lending and investing activities in India. It operates through Finance & Investment, General Insurance, Life Insurance, Commercial Finance, Home Finance, and Others segments. The company offers life, health, and general insurance products; brokerage and distribution services, including equities, commodities and derivatives, wealth management services, portfolio management services, and financial products; and commercial and home finance services, such affordable housing, mortgages, loans against property, SME loans, loans for vehicles, loans for construction equipment, business loans, infrastructure financing, and retail finance. It also provides asset reconstruction, and proprietary investments services, as well as other financial and allied services. The company was formerly known as Reliance Capital & Finance Trust Limited and changed its name to Reliance Capital Limited in January 1995. Reliance Capital Limited was founded in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400055",
        "website": "http://www.reliancecapital.co.in",
        "market_cap": "Micro Cap"
    },
    "RELIGARE.NS": {
        "short_name": "RELIGARE ENTERPRIS",
        "long_name": "Religare Enterprises Limited",
        "summary": "Religare Enterprises Limited operates as an investment company in India and internationally. The company provides broking services in equities, currencies, and commodities; depository participant services; and TIN and PAN facilities, as well as operates as an NSDL-appointed enrolment agency for Aadhaar unique identification number and an AMFI-registered mutual fund distributor. It also offers finance for small and medium enterprises; and housing finance, including home-purchase, home construction, and home improvement loans. In addition, the company provides e-governance and financial advisory services. Further, it offers health insurance services to employees of corporates, and individual customers. Additionally, the company provides critical illness, personal accident, top-up coverage, international travel, and maternity insurance products, as well as group health and personal accident insurance. Religare Enterprises Limited was incorporated in 1984 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.religare.com",
        "market_cap": "Small Cap"
    },
    "REPCOHOME.NS": {
        "short_name": "REPCO HOME FIN LTD",
        "long_name": "Repco Home Finance Limited",
        "summary": "Repco Home Finance Limited operates as a housing finance company in India. It provides housing loans for the construction or purchase of homes; loans for the repairs, renovation, and/or extension/improvement of residential properties; loans for the purchase of plot for construction of a house; loans to non-resident Indians for the construction/purchase of house in India; loans against the mortgage of immovable property; and loans for the purchase and/or construction of non-residential and commercial properties. The company also offers loans for the construction/purchase of integrated house buildings comprising commercial spaces, such as shops/office spaces combined with residential building; home loans to salaried individuals; and loans for construction on land owned by borrower's parents; and loans for the construction and purchase of house by weaker section in rural areas. It operates 153 branches and 24 satellite centers located in Tamil Nadu, Karnataka, Andhra Pradesh, Telangana, Kerala, Maharashtra, Odisha, West Bengal, Gujarat, Madhya Pradesh, Jharkhand, and the Union Territory of Puducherry. The company was founded in 2000 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.repcohome.com",
        "market_cap": "Small Cap"
    },
    "RHFL.NS": {
        "short_name": "RELIANCE HOME FIN",
        "long_name": "Reliance Home Finance Limited",
        "summary": "Reliance Home Finance Limited engages in the housing finance business in India. The company offers a range of loans, such as home loans, affordable housing loans, loans against properties, and construction finance. It also provides property services. The company was incorporated in 2008 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400028",
        "website": "http://www.reliancehomefinance.com",
        "market_cap": "Nano Cap"
    },
    "RPSGVENT.NS": {
        "short_name": "RPSG VENTURES LIMITED",
        "long_name": "RPSG Ventures Limited",
        "summary": "CESC Ventures Limited owns, operates, invests, and promotes business in the fields of information technology, business process outsourcing, real estate, entertainment, and fast moving consumer goods in India. It offers application development and management, setup and operations and maintenance of IT infrastructure, cyber security management, and IT consultancy services; and business process outsourcing in the field of customer interaction management, data and transaction processing, collections management, consulting, and analytics. The company also provides packaged snacks under the TOO YUMM! and Evita brands; and various Ayurvedic formulations under the Dr. Vaidya's brand name, as well as wellness products and supplements for immunity, energy, sexual wellness, weight management, hair and skin care, and others. In addition, it operates shopping malls; and restaurants under the brand name of Waffle Wallah and Bombay Toastee brands. As of March 31, 2020, it operated 24 restaurant outlets. The company was formerly known as RP-SG Business Process Services Limited and changed its name to CESC Ventures Limited. The company was incorporated in 2017 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.rpsgventuresltd.com",
        "market_cap": "Micro Cap"
    },
    "SATIN.NS": {
        "short_name": "SATIN CREDIT CARE",
        "long_name": "Satin Creditcare Network Limited",
        "summary": "Satin Creditcare Network Limited, a non-banking finance company, provides micro finance services in India. The company provides collateral free and microcredit facilities to economically active women in rural, semi-urban, and urban areas; loans to individual businesses and micro, small, and medium enterprises; loans to microfinance institutions and other corporates; financing for solar lamps, bicycles, and consumer durables, as well as development of water connection and sanitation facilities; and housing finance products. It serves clients in 23 states and union territories in India, including Uttar Pradesh, Bihar, Madhya Pradesh, Punjab, Haryana, Rajasthan, Uttarakhand, Maharashtra, West Bengal, Gujarat, Jharkhand, Delhi & NCR, Chhattisgarh, Assam, Odisha, Himachal Pradesh, Tamil Nadu, Karnataka, Chandigarh, Jammu & Kashmir, Meghalaya, Tripura, and Sikkim. The company was formerly known as Satin Leasing & Finance Private Limited and changed its name to Satin Creditcare Network Limited in April 2000. Satin Creditcare Network Limited was founded in 1990 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122016",
        "website": "http://satincreditcare.com",
        "market_cap": "Micro Cap"
    },
    "SBICARD.NS": {
        "short_name": "SBI CARDS & PAYMEN",
        "long_name": "SBI Cards and Payment Services Limited",
        "summary": "SBI Cards and Payment Services Limited, a non-banking financial company, issues credit cards to individual and corporate customers in India. It also acts as corporate insurance agent for selling insurance policies to credit card customers. SBI Cards and Payment Services Limited has a strategic partnership with American Express; and partnership agreement with Paytm. The company was formerly known as SBI Cards and Payment Services Private Limited. The company was founded in 1998 and is headquartered in Gurugram, India. SBI Cards and Payment Services Limited is a subsidiary of State Bank of India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.sbicard.com",
        "market_cap": "Large Cap"
    },
    "SBILIFE.NS": {
        "short_name": "SBI LIFE INSURANCE",
        "long_name": "SBI Life Insurance Company Limited",
        "summary": "SBI Life Insurance Company Limited operates as a private life insurance company in India. Its life insurance business comprises of individual life and group business, including participating, non-participating, pension, group gratuity, group leave encashment, group superannuation, group immediate annuity, unit-linked and variable insurance products, health, and micro insurance. The company also provides accident and disability benefit, level term, and critical illness insurance products. It offers its products through a multi-channel distribution network comprising individual agents, sbi branches, brokers, corporate agents, banca partners, and certified insurance facilitators, as well as common service centre, insurance marketing firm, direct business, and Website and web aggregators. The company was founded in 2000 and is based in Mumbai, India. SBI Life Insurance Company Limited is a subsidiary of State Bank of India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400069",
        "website": "http://www.sbilife.co.in",
        "market_cap": "Large Cap"
    },
    "SBIN.NS": {
        "short_name": "STATE BK OF INDIA",
        "long_name": "State Bank of India",
        "summary": "State Bank of India provides various banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking services, including current accounts, savings accounts, term deposits, and recurring deposits; home, auto, education, gold, and personal loans, as well as loans against property and securities; and wealth management, mobile and Internet banking, demat, ATM, foreign inward remittance, safe deposit locker, public provident fund, money transfer, pension policy, and mobile wallet services, as well as cards and inflation indexed national savings securities cumulative bonds. The company also provides corporate banking services comprising corporate accounts, working capital and project finance, term loans, deferred payment guarantees, corporate loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, and cash management, as well as export and cash, and letters of credit products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and credit cards, life and non-life insurance, mutual funds, merchant banking, trustee business, factoring, security trading, pension fund management, and custody services. It operates 22,141 branches and 58,555 ATMs. The company was founded in 1806 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.sbi.co.in",
        "market_cap": "Large Cap"
    },
    "SBKFF": {
        "short_name": "STATE BANK OF INDIA",
        "long_name": "State Bank of India",
        "summary": "State Bank of India provides various banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking services, including current accounts, savings accounts, term deposits, and recurring deposits; home, auto, education, gold, and personal loans, as well as loans against property and securities; and wealth management, mobile and Internet banking, demat, ATM, foreign inward remittance, safe deposit locker, public provident fund, money transfer, pension policy, and mobile wallet services, as well as cards and inflation indexed national savings securities cumulative bonds. The company also provides corporate banking services comprising corporate accounts, working capital and project finance, term loans, deferred payment guarantees, corporate loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, and cash management, as well as export and cash, and letters of credit products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and credit cards, life and non-life insurance, mutual funds, merchant banking, trustee business, factoring, security trading, pension fund management, and custody services. It operates 22,141 branches and 58,555 ATMs. The company was founded in 1806 and is headquartered in Mumbai, India.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "PNK",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.sbi.co.in",
        "market_cap": "Large Cap"
    },
    "SCAPDVR.NS": {
        "short_name": "STAMPEDE CAPITAL",
        "long_name": "Stampede Capital Limited",
        "summary": "Stampede Capital Limited provides securities and currencies broking and trading services through various stock exchanges in India. The company was formerly known as Brilliant Securities Limited and changed its name to Stampede Capital Ltd. in July 2011. Stampede Capital Ltd. was incorporated in 1995 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.stampedecap.com",
        "market_cap": "Nano Cap"
    },
    "SHAREINDIA.NS": {
        "short_name": "Share Ind. Securities Ltd",
        "long_name": "Share India Securities Limited",
        "summary": "Share India Securities Limited, a financial services company, trades in securities. The company offers broking/depository services, including equity, derivative, commodity, currency, mutual funds, and depository services; loan against securities, loan against commodities, business loans, and personal loans, as well as short, medium, and long term financial loans; and life and general insurances for individual and corporates. It also provides qualified institutional placements; bulk and block trades on exchanges; off-market transactions; arranges private equity; valuation advisory; open offers, buyback, and delisting of securities; and equity mobilization services for infrastructure projects from private equity investors, as well as manages initial public offerings and rights offering. In addition, the company offers a range of financial products and personalized services, including currency and commodity derivative, depository participant, research and analysis, mutual fund advisory and distributorship, and portfolio management services. It serves customers through a network of approximately 587 branches across 14 states in India. The company was formerly known as FMS Securities Limited and changed its name to Share India Securities Limited in 2010. Share India Securities Limited was founded in 1994 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110092",
        "website": "http://www.shareindia.com",
        "market_cap": "Micro Cap"
    },
    "SHRIRAMCIT.NS": {
        "short_name": "SHRIRAM CITY UNION",
        "long_name": "Shriram City Union Finance Limited",
        "summary": "Shriram City Union Finance Limited, a deposit accepting non-banking finance company, engages in the retail finance activities in India. The company offers fixed deposits; and financing for two wheelers and three wheelers, as well as for new and pre-owned passenger and commercial four wheelers. It also provides personal loans; loans against gold; small business loans to self-employed professionals, wholesale and retail dealers, merchants, builders, small and medium scale manufacturing concerns, catering services, tour operators, etc.; home loans; and generator loans. The company was formerly known as Shriram Hire-Purchase Finance Limited and changed its name to Shriram City Union Finance Limited in April 1990. Shriram City Union Finance Limited was founded in 1986 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600001",
        "website": "http://www.shriramcity.in",
        "market_cap": "Small Cap"
    },
    "SID.F": {
        "short_name": "STATE BANK OF IND.GDR S/2",
        "long_name": "State Bank of India",
        "summary": "State Bank of India provides various banking products and services to individuals, commercial enterprises, corporates, public bodies, and institutional customers in India and internationally. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, Insurance Business, and Other Banking Business segments. It offers personal banking services, including current accounts, savings accounts, term deposits, and recurring deposits; home, auto, education, gold, and personal loans, as well as loans against property and securities; and wealth management, mobile and Internet banking, demat, ATM, foreign inward remittance, safe deposit locker, public provident fund, money transfer, pension policy, and mobile wallet services, as well as cards and inflation indexed national savings securities cumulative bonds. The company also provides corporate banking services comprising corporate accounts, working capital and project finance, term loans, deferred payment guarantees, corporate loans, structured finance, dealer and channel financing, equipment leasing, loan syndication, construction equipment loans, financing Indian firms overseas subsidiaries or JVs, and cash management, as well as export and cash, and letters of credit products. In addition, it offers NRI services, including accounts and deposits, remittances, investments, and loans; agricultural banking and micro credit to agriculturists and farmers; supply chain finance, and deposits and transaction banking services for SME customers; and international banking services. Further, the company provides treasury, broking, bill payment, and MICR services; and credit cards, life and non-life insurance, mutual funds, merchant banking, trustee business, factoring, security trading, pension fund management, and custody services. It operates 22,141 branches and 58,555 ATMs. The company was founded in 1806 and is headquartered in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.sbi.co.in",
        "market_cap": "Large Cap"
    },
    "SILINV.NS": {
        "short_name": "SIL INVESTMENTS",
        "long_name": "SIL Investments Limited",
        "summary": "SIL Investments Limited, a non-banking financial company, engages in the commercial finance and investments activities in India. The company invests in shares, securities, and real estate. The company was formerly known as Sutlej Industries Limited and changed its name to SIL Investments Limited in March 2007. SIL Investments Limited was incorporated in 1934 and is based in Bhawanimandi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhawanimandi",
        "zipcode": "326502",
        "website": "http://www.silinvestments.in",
        "market_cap": "Nano Cap"
    },
    "SMCGLOBAL.NS": {
        "short_name": "SMC Global Securities Ltd",
        "long_name": "SMC Global Securities Limited",
        "summary": "SMC Global Securities Limited, together with its subsidiaries, provides various financial services in India and internationally. The company operates through three segments: Trading and Distribution, Advisory, and Financing. The Trading and Distribution segment engages in the brokerage and propriety trading of shares, commodities, currencies, derivatives, and other securities; provision of clearing, depositary, and insurance broking services; portfolio and wealth management; and distribution of third party financial products. The Advisory segment provides mortgage and loan advisory, real estate broking, and investment banking services. The Financing segment offers loans. The company also offers online trading and real estate advisory services. SMC Global Securities Limited was founded in 1990 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110005",
        "website": "http://smcindiaonline.com",
        "market_cap": null
    },
    "SOUTHBANK.NS": {
        "short_name": "SOUTH INDIA BANK",
        "long_name": "The South Indian Bank Limited",
        "summary": "The South Indian Bank Limited provides banking products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. Its personal banking products and services include savings accounts, term deposits, and unclaimed deposits/inoperative accounts; personal, car, home, gold, educational, property, and other loans, as well as one time settlement scheme for micro and small enterprises sector; and mutual funds. The company also offers insurance products, such as life insurance, health insurance, and various credit risk insurance, as well as general insurance products, such as fire, liability, marine, motor, and travel insurance products. In addition, it offers money transfer services; various cards; and value added services consisting of SIB rewards, education fee collection, 3-in-one trading KIT, green pin, SIB feebook, branch banking, FX-retail, NETC FASTag, sovereign gold bonds, credit and debit cards, ATM cum shopping card, mobile and Internet banking, demat, pension system, online trading, SIB collect, PAN service agency, cash management, travel card, tax payment, tax savings investments, direct debit, and safe deposit locker services, as well as distributes capital gain bonds and tax free bonds. Further, the company's NRI banking services comprise NRE and NRO rupee accounts, and foreign currency deposits, as well as personal, home, car, property, SIB dÃ©cor, and education loans; and portfolio investment schemes. Additionally, its business banking services consist of normal and premium accounts, and trader smart current account; working capital, long term, non-fund based, supply chain, and international finance; mortgage and business loans; and merchant acquiring services. As of March 31, 2020, the company had a network of 935 branches and 1,424 ATMs/CRMs. The South Indian Bank Limited was incorporated in 1929 and is headquartered in Thrissur, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thrissur",
        "zipcode": "680001",
        "website": "http://www.southindianbank.com",
        "market_cap": "Micro Cap"
    },
    "SPANDANA.NS": {
        "short_name": "Spandana Sphoorty Fin Ltd",
        "long_name": "Spandana Sphoorty Financial Limited",
        "summary": "Spandana Sphoorty Financial Limited engages in the micro finance business in India. The company offers income generation loans for low-income households; loans against property; and loans for women to expand their existing income generating activities, smoothening household cash flows, and acquiring productive assets. It also provides gold loans for agriculture, business, and short-term liquidity needs; and interim loans. The company serves low-income clients in urban and rural areas. Spandana Sphoorty Financial Limited was founded in 1998 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500032",
        "website": "http://www.spandanaindia.com",
        "market_cap": "Small Cap"
    },
    "SPCENET.NS": {
        "short_name": "SPACENET ENTERPRIS",
        "long_name": "Spacenet Enterprises India Limited",
        "summary": "Spacenet Enterprises India Limited primarily engages in the trading of commodities in India. It offers Tradetech, a commodity trade platform; Fantasytech; Edutech, a technology enabled education platform; AI block chain tech platform for tracking real time supply chain management; and Foodtech, a technology enabled delivery platforms for quick service restaurant. The company was formerly known as Northgate Com Tech Limited and changed its name to Spacenet Enterprises India Limited in November 2015. Spacenet Enterprises India Limited was incorporated in 2010 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.spacenetent.com",
        "market_cap": "Nano Cap"
    },
    "SREINFRA.NS": {
        "short_name": "SREI INFRASTRUCTUR",
        "long_name": "Srei Infrastructure Finance Limited",
        "summary": "Srei Infrastructure Finance Limited provides financial services in India. The company offers asset finance, leasing, and loans for purchase of construction and mining equipment, tippers, IT and allied equipment, medical and allied equipment, farm equipment, and other assets. It also provides project finance services, such as term and syndicate loans, structured finance, financing/leasing, sale and lease back, as well as letter of credit and bank guarantee facilities; and advisory services, including planning, engineering, project structuring, transaction advisory, and project management consultancy for government and private sectors. In addition, the company offers investment banking services, which include initial public offers, delisting, buy-back, open offers, non-convertible debenture/bond placement, private equity, venture capital funding, and debt syndication, as well as insurance broking services. It operates 75 branches in 22 states in India. The company was formerly known as Srei International Finance Limited and changed its name to Srei Infrastructure Finance Limited in August 2004. The company was incorporated in 1985 and is headquartered in Kolkata, India. Srei Infrastructure Finance Limited is a subsidiary of Adisri Commercial Private Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700046",
        "website": "http://www.srei.com",
        "market_cap": "Micro Cap"
    },
    "SRTRANSFIN.NS": {
        "short_name": "SHRIRAM TRANSPORT",
        "long_name": "Shriram Transport Finance Company Limited",
        "summary": "Shriram Transport Finance Company Limited, a non-banking finance company, primarily provides commercial vehicle financing services in India. The company offers commercial vehicle loans for commercial goods vehicles, passenger commercial vehicles, tractors and farm equipment, and construction equipment. It also provides business loans; deposits; working capital loans; life and general insurance products; emergency credit line guarantee schemes; consumer finance; stock broking services; and chit and mutual funds. As of March 31, 2020, the company operated a network of 1,758 branches and 831 rural centers. It primarily serves first time buyers, driver-turned-owners, and small road transport operators. Shriram Transport Finance Company Limited was founded in 1979 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.stfc.in",
        "market_cap": "Mid Cap"
    },
    "STAMPEDE.NS": {
        "short_name": "STAMPEDE CAPITAL",
        "long_name": "Stampede Capital Limited",
        "summary": "Stampede Capital Limited provides securities and currencies broking and trading services through various stock exchanges in India. The company was formerly known as Brilliant Securities Limited and changed its name to Stampede Capital Ltd. in July 2011. Stampede Capital Ltd. was incorporated in 1995 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.stampedecap.com",
        "market_cap": "Nano Cap"
    },
    "STEELCITY.NS": {
        "short_name": "STEEL CITY SECURIT",
        "long_name": "Steel City Securities Limited",
        "summary": "Steel City Securities Limited provides retail stock broking services in southern parts of India. It provides a trading platform of capital market, futures and options, commodities, and currency derivatives; acts as a depository participant; offers margin trading facility for stocks or derivatives traded on National Stock Exchange of India Limited and BSE; and distributes mutual funds, credit cards, corporate fixed deposits, bonds, and IPOs. The company also promotes pension schemes for the retirement benefits of employees and business people; offers insurance agency services; and provides non-banking financial services, such as personal loans, gold loans, and loans against securities. In addition, it offers e-governance products, such as PAN, TAN, e-TDS, AIR, and form 24G, as well as change requests of PAN and TAN. The company was founded in 1995 and is headquartered in Visakhapatnam, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Visakhapatnam",
        "zipcode": "530016",
        "website": "http://www.steelcitynettrade.com",
        "market_cap": "Nano Cap"
    },
    "SUMMITSEC.NS": {
        "short_name": "SUMMIT SECURITIES",
        "long_name": "Summit Securities Limited",
        "summary": "Summit Securities Limited, a non-banking financial company, engages in investment and financial activities. The investments of the firm are typically long term in nature and predominantly in the equity markets. The firm typically invests in companies in real estate sector. Summit Securities Limited was formerly known as RPG Itochu Finance Limited. The company was incorporated on January 30, 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400071",
        "website": "http://www.summitsecurities.net",
        "market_cap": "Micro Cap"
    },
    "SUNDARMFIN.NS": {
        "short_name": "SUNDARAM FINANCE L",
        "long_name": "Sundaram Finance Limited",
        "summary": "Sundaram Finance Limited provides a range of financial services in India. The company accepts fixed, cumulative, and NRI deposits. It also offers finance for new and used cars, new and used commercial vehicles, and new and used construction equipment; diesel finance for commercial vehicle operators and companies; tire and insurance finance; finance for new/used tractors, harvesters, and farm implements; working capital, enterprise business, and machinery term loans, as well as channel finance; housing finance; and leasing services. In addition, the company distributes a range of financial products, such as mutual funds, general insurance, etc.; and provides information technology, and business processing and support services. Further, it offers a suite of investment management services, which include financial planning, asset allocation and execution, portfolio management, tax management, risk management, and estate management; and life insurance products comprising child, pension, whole-life, term, and investment plans. The company operates through a network of 610 branches. Sundaram Finance Limited was founded in 1954 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://www.sundaramfinance.in",
        "market_cap": "Mid Cap"
    },
    "SURYODAY.NS": {
        "short_name": "Suryoday Small Fin Bk Ltd",
        "long_name": "Suryoday Small Finance Bank Limited",
        "summary": "Suryoday Small Finance Bank Limited operates as a small finance bank primarily serving the unserved and underserved with a focus on financial inclusion in India. The company operates through Treasury, Retail Banking, Wholesale Banking, and Other Banking Operations segments. The company accepts savings and current accounts, term and fixed deposits, recurring deposits, and certificates of deposit. It also provides finance for mortgage and commercial vehicles; and loans to micro, small, and medium enterprises, as well as loans to non-banking finance companies. In addition, the company offers home loans, secured business loans against property, joint liability group loans, and emergency credit line guarantee schemes. Further, it provides life, general, and group health insurance, as well as national pension and social security schemes. Additionally, the company offers debit cards and NRI banking services; safe deposit locker facilities and bill and UPI payment services; and internet, phone, tab, and mobile banking services. As of July 31, 2020, it operated 482 banking outlets across 12 states and union territories. The company was formerly known as Suryoday Micro Finance Limited and changed its name to Suryoday Small Finance Bank Limited in January 2017. Suryoday Small Finance Bank Limited was founded in 2008 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400614",
        "website": "http://www.suryodaybank.com",
        "market_cap": "Small Cap"
    },
    "TATAINVEST.NS": {
        "short_name": "TATA INVESTMENT",
        "long_name": "Tata Investment Corporation Limited",
        "summary": "Tata Investment Corporation Limited is a publicly owned investment manager. The firm operates as an investment company in India. Its activities primarily include investing in long-term investments in equity shares, equity-related securities and other securities of companies in a range of industries. The company also distributes mutual funds and other investment related securities. Tata Investment Corporation was founded in 1937. Tata Investment Corporation Limited was formerly known as The Investment Corporation of India Limited. Tata Investment Corporation Limited is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.tatainvestment.com",
        "market_cap": "Small Cap"
    },
    "TCIFINANCE.NS": {
        "short_name": "TCI FINANCE LTD",
        "long_name": "TCI Finance Limited",
        "summary": "TCI Finance Limited operates as a non-banking finance company in India. The company offers loans against securities, commercial vehicle finance, global IP convention, IP valuation, and other financial services, as well as patents, trademark, and copyright services. The company was incorporated in 1973 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500084",
        "website": "http://www.tcifl.in",
        "market_cap": "Nano Cap"
    },
    "TFCILTD.NS": {
        "short_name": "TOURISM FIN CORP",
        "long_name": "Tourism Finance Corporation of India Limited",
        "summary": "Tourism Finance Corporation of India Limited provides financial assistance to tourism-related activities/projects in India. Its financial assistance products comprise rupee loans; subscription to equity/debentures; guarantee of deferred payments; advance against credit card receivables; takeover financing or refinancing; and bridge and corporate loans. The company offers financial assistance for new, expansion, diversification, and renovation/modernization projects in tourism and services sectors, as well as related activities, facilities, and services, such as hotels, resorts, service apartments, restaurant chains, theme/amusement parks, multiplexes and entertainment centers, education and sports, rope-ways/ safari parks, convention halls, and travel and tour operating agencies. It also provides financial assistance for new, expansion, diversification, and renovation/modernization projects in industrial/manufacturing sectors, real-estate sectors, services sectors and related activities, and facilities, including transport, energy, water and sanitation, communication, social and commercial infrastructure, and manufacturing/other sectors. In addition, the company offers various research and consultancy services. Tourism Finance Corporation of India Limited was founded in 1989 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110017",
        "website": "http://www.tfciltd.com",
        "market_cap": "Micro Cap"
    },
    "TFL.NS": {
        "short_name": "TRANSWARRANTY FINA",
        "long_name": "Transwarranty Finance Limited",
        "summary": "Transwarranty Finance Limited, a non-banking finance company, provides financial services to companies and retail clients in India. Its investment banking services comprise mergers and acquisitions, venture capital, private equity, international capital market, joint ventures, corporate advisory, and business re-structuring; and corporate finance services consist of structured finance, rupee/foreign currency loans, external commercial borrowing, working capital facilities from banks, acquisition and stressed assets finance, and debt re-structuring. The company's trade finance services comprise letter of credit and clean bills discounting, inter corporate deposits, unsecured working capital loans, and import and export finance; and project finance services include financial structuring, project report and financial feasibility studies, raising project equity, and raising rupee and foreign currency loans for projects. In addition, it offers retail loans against security of gold; and online personal and consumer loans. Further, the company provides retail stock broking and investment advisory services, depository participation, institutional broking, arbitrage, corporate restructuring, take over and offer for sale services, ESOPs, and certifications services, as well as listing services on National Stock Exchange and Bombay Stock Exchange, and buy back of shares; distributes mutual funds, IPO, and other financial products; manages initial public offers/follow on offers/rights issues and debt issues; places equity shares with QIP/private equity funds and preference shares; valuates companies/enterprises/shares; and online personal and consumer loans. Additionally, it is involved in the retail of commodities broking and insurance business. The company was founded in 1994 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.transwarranty.com",
        "market_cap": "Nano Cap"
    },
    "THEINVEST.NS": {
        "short_name": "THE INVESTMENT TRU",
        "long_name": "The Investment Trust of India Limited",
        "summary": "The Investment Trust of India Limited, together with its subsidiaries, provides corporate finance and broking solutions in India. It operates through Advisory Services and Investment Activities; and Trading Activities segments. The company offers equities, derivatives, commodities, currency, and depository services; distributes investments products, such as portfolio management services, mutual funds, primary equity offerings, and other investment products; and loans against shares, education loans, vehicle finance, gold loans, medical loans, and SME finance. It also provides merchant banking, finance and management advisory, trustee, credit management, real estate, debt market, asset management, corporate, and security and commodity broking services, as well as acts as a debt recovery agent. The company was formerly known as Fortune Financial Services (India) Limited and changed its name to The Investment Trust of India Limited in June 2018. The Investment Trust of India Limited was incorporated in 1991 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.itigroup.co.in",
        "market_cap": "Micro Cap"
    },
    "TIMESGTY.NS": {
        "short_name": "TIMES GUARANTY",
        "long_name": "Times Guaranty Limited",
        "summary": "Times Guaranty Limited, a non-deposit accepting non-banking financial company, provides investment and financial services in India. It also provides retail and corporate lending, merchant banking, and money market related services. The company was formerly known as Times Guaranty Finance Limited and changed its name to Times Guaranty Limited in December 1999. The company was incorporated in 1989 and is based in Mumbai, India. Times Guaranty Limited is a subsidiary of Bennett Coleman and Company Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.timesguarantylimited.com",
        "market_cap": "Nano Cap"
    },
    "UCOBANK.NS": {
        "short_name": "UCO BANK",
        "long_name": "UCO Bank",
        "summary": "UCO Bank operates as a commercial bank in India. It accepts deposit products, such as current accounts, saving accounts, fixed deposits, recurring deposits, accounts in foreign currency, salary accounts, and fee collection accounts. The company also provides home, vehicle, mortgage, education, and personal loans; working capital financing; term loans; infrastructure finance; foreign currency loans; finance to exporters and importers; agriculture credit; and finance to micro and small enterprises. In addition, it offers debit cards and mobile banking services; and international banking services, including NRI banking, remittances, forex and treasury services, resident foreign currency deposits, and correspondent banking services to Indian customers, corporates, NRIs, overseas corporate bodies, foreign companies/individuals, and foreign banks. Further, the company provides government deposit schemes/bonds, pension payments/schemes, and tax collection services; and bancassurance products, mutual funds, and money transfer services. As of March 31, 2020, it operated 42 zones and 3086 domestic branches, as well as 2 overseas branches, including 1 each in Singapore and Hong Kong. The company was formerly known as The United Commercial Bank Ltd. and changed its name to UCO Bank in December 1985. UCO Bank was founded in 1943 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.ucobank.com",
        "market_cap": "Small Cap"
    },
    "UJJIVAN.NS": {
        "short_name": "UJJIVAN FIN SERV",
        "long_name": "Ujjivan Financial Services Limited",
        "summary": "Ujjivan Financial Services Limited provides financial services to economically active poor in India. It offers micro and rural finance products, housing loans; personal loans, vehicle loans, institutional loans, agri loans, and staff loans, as well as secured and unsecured loans to micro and small businesses. The company also provides group and individual insurance products. As of March 31, 2020, it operated 575 branches. The company was formerly known as Ujjivan Financial Services Private Limited and changed its name to Ujjivan Financial Services Limited in November 2015. Ujjivan Financial Services Limited was founded in 2004 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560095",
        "website": "http://www.ujjivan.com",
        "market_cap": "Small Cap"
    },
    "UJJIVANSFB.NS": {
        "short_name": "Ujjivan Small Financ Bank",
        "long_name": "Ujjivan Small Finance Bank Limited",
        "summary": "Ujjivan Small Finance Bank Limited provides various banking products and services in India. The company operates through Treasury, Retail Banking, and Corporate/Wholesale Banking segments. It offers current, savings, salary, and NRI accounts; and fixed, recurring, TASC fixed, and tax saver fixed deposits. The company's loan products include group loans, such as business, family, agriculture and allied, education, business top-up, emergency, and loyalty loans; individual loans comprising individual business, bazar, agriculture, and livestock loans, as well as home improvement and open market livestock loans; housing loans; and loan against properties. Its loan products also consists of micro and small enterprise loans, which include secured enterprise and business loans, overdraft facilities, and business edge term loans; personal loans; financial institutions group loans; and vehicle loans. The company also offers mobile, phone, net, SMS, and missed call banking services; debit cards; and insurance products, such as credit life, endowment, term, POS, ULIP, motor, property, home content, health, and personal accident insurance. As of March 31, 2020, it operated 575 banking outlets and 475 ATMs. The company was incorporated in 2016 and is headquartered in Bengaluru, India. Ujjivan Small Finance Bank Limited is a subsidiary of Ujjivan Financial Services Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560095",
        "website": "http://www.ujjivansfb.in",
        "market_cap": "Small Cap"
    },
    "UNIONBANK.NS": {
        "short_name": "UNION BK OF INDIA",
        "long_name": "Union Bank of India",
        "summary": "Union Bank of India provides various banking products and services. It operates through four segments: Treasury Operation, Retail Banking Operation, Corporate/Wholesale Banking, and Other Banking Operations. The company offers savings and current accounts; term and recurring deposits; and demat and online trading accounts. It also provides retail loans, including home, vehicle, education, and personal loans; loans against property; and loans for pensioners, as well as products and loans for micro, small, and medium enterprises. In addition, the company offers mutual funds, life, non-life, and general insurance products, and tax saving deposits; government saving schemes, tax collection services, pension products, and departmentalized ministries accounts; short term, long term, and other credit for agricultural/SSI/tertiary sectors; and safe deposit locker and cheque collection services. Further, it provides merchant banking services; corporate loans comprising Covid emergency line of credit, trade finance, working capital, lines of credit, project financing, and channel finance; debt structuring/restructuring, loan syndication, structured finance, mergers and acquisition advisory, and private equity services; cash management, ECGC cover, and foreign exchange services, as well as derivatives; export and import finance services; NRI banking services; and treasury and other products, and remittance services. Additionally, the company offers app, Internet, self-service, ATM, and SMS banking services; point of sale terminal and immediate payment services; and combo, debit, credit, gift, prepaid, and payroll cards. As of March 31, 2020, it operated 4,281 branches in India; 3 overseas branches at Sydney, Hong Kong, and Dubai; and 6,895 ATMs and 5,586 micro ATMs. The company was founded in 1919 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.unionbankofindia.co.in",
        "market_cap": "Mid Cap"
    },
    "UZC.F": {
        "short_name": "AXIS BANK LTD. GDR REGS 5",
        "long_name": "Axis Bank Limited",
        "summary": "Axis Bank Limited provides corporate and retail banking products and services in India and internationally. The company's deposit products include savings, salary, and current accounts, as well as fixed, recurring, tax saver fixed, and flexi deposits. It also provides home, personal, holiday, car, business, gold, two wheeler, working capital, and education loans, as well as loans against properties, securities, and fixed deposits; and commercial vehicle and construction equipment loans. In addition, the company offers safe deposit locker, safe custodian, and pension system services; foreign exchange services; investment products; and life, general, home, health, travel, motor, and business guard insurance products. Further, it provides cash management, trade, treasury, capital market, corresponding banking and financial institutions, pension, and bullion services; debit and credit cards; mutual funds, public provident funds, demat accounts, and systematic investment plan; products and services for non-resident Indians; agricultural and rural banking products and services; and burgundy and priority banking products and services. Additionally, the company offers corporate, online, mobile, and phone banking; trade finance; and risk management solutions. Axis Bank Limited operates approximately 4,528 domestic branches with 12,044 ATMs and 5,433 cash recyclers; 11 overseas offices with branches at Singapore, Hong Kong, Dubai, Colombo, Shanghai, and Gift City-IBU; and representative offices at Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.axisbank.com",
        "market_cap": "Large Cap"
    },
    "VHL.NS": {
        "short_name": "VARDHAMAN HOLDINGS",
        "long_name": "Vardhman Holdings Limited",
        "summary": "Vardhman Holdings Limited operates as a non-banking financial company in India. It is primarily engages in lending and investing activities. The company was formerly known as Vardhman Spinning and General Mills Limited and changed its name to Vardhman Holdings Limited in March 2006. Vardhman Holdings Limited was incorporated in 1962 and is based in Ludhiana, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ludhiana",
        "zipcode": "141010",
        "website": "http://www.vardhman.com",
        "market_cap": "Micro Cap"
    },
    "VIJIFIN.NS": {
        "short_name": "VIJI FINANCE LTD",
        "long_name": "Viji Finance Limited",
        "summary": "Viji Finance Limited, a non-banking finance company, provides financial products and services in India. It offers corporate finance, infrastructure/project finance, and personal finance. The company was formerly known as Panjon Finance Limited and changed its name to Viji Finance Limited in September 2012. Viji Finance Limited was incorporated in 1994 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.vijifinance.com",
        "market_cap": "Nano Cap"
    },
    "VLSFINANCE.NS": {
        "short_name": "VLS FIN LTD INDIA",
        "long_name": "VLS Finance Limited",
        "summary": "VLS Finance Limited provides various financial services in India. The company's corporate consulting and advisory services include private placement of equities, debentures, and preference shares and bonds with banks, financial institutions, foreign institutional investors, mutual funds, corporates, and high net worth clients; advising on the structuring of schemes for raising debts in the form of fixed income securities; project reports, evaluations, and appraisals from financial institutions/banks; syndication of term loans, working capital, bridge loans, and short term financing; and advisory services on financial and corporate restructuring, spin-offs, mergers and acquisitions, and takeovers. Its corporate consulting and advisory services also comprise arranging external commercial borrowings and advising on rupee term loan swaps with foreign currency loans; support services, including corporate finance, tax planning, audit and accounting, financial and legal consultancy for corporates; arranging factoring of book debts and credit rating; placement of commercial papers; creation of trusts and procedural aspects of securities creation; syndication of asset funding businesses; and identification and arrangement of tie-ups of domestic and foreign partnerships. In addition, the company offers investment banking services, such as determination of the issue size and pricing; drafting of the offer document and filling it with SEBI for approval; co-ordination with various regulatory authorities and private agencies during the issue; monitoring of the press, investor, and analyst meets; selection of the market timing; and other services. VLS Finance Limited was incorporated in 1986 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110065",
        "website": "http://www.vlsfinance.com",
        "market_cap": "Micro Cap"
    },
    "WEALTH.NS": {
        "short_name": "Wealth Frst Port. Mg. Ltd",
        "long_name": "Wealth First Portfolio Managers Limited",
        "summary": "Wealth First Portfolio Managers Limited provides financial assets investment management solutions to corporate, institutional, retail, and HNI and NRI customers in India. Its products include fixed deposits, government securities, treasury and direct bonds, taxable and tax free bonds, direct equity, mutual funds, PMS and pension products, etc. The company also offers investment strategizing, asset research and allocation, trade-executionÂ\u0096 broking, portfolio review, portfolio accounting, tax and retirement planning, and treasury management services. Wealth First Portfolio Managers Limited was founded in 2002 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.wealth-firstonline.com",
        "market_cap": "Nano Cap"
    },
    "WELINV.NS": {
        "short_name": "WELSPUN INVESTMENT",
        "long_name": "Welspun Investments and Commercials Limited",
        "summary": "Welspun Investments and Commercials Limited invests and deals in shares and securities in India. The company was formerly known as Welspun Investments Limited and changed its name to Welspun Investments and Commercials Limited in March 2010. Welspun Investments and Commercials Limited was incorporated in 2008 and is based in Mumbai, India. Welspun Investments and Commercials Limited is a subsidiary of Welspun Group Master Trust.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.welspuninvestments.com",
        "market_cap": "Nano Cap"
    },
    "WILLAMAGOR.NS": {
        "short_name": "WILLIAMSON MAGOR &",
        "long_name": "Williamson Magor & Co. Limited",
        "summary": "Williamson Magor & Co. Limited operates as a non-banking financial company in India. The company also engages in the investments and lending activities. Further, it provides rent, maintenance, and management consultancy services. The company was founded in 1868 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://wmtea.com",
        "market_cap": "Nano Cap"
    },
    "YAARII.NS": {
        "short_name": "YAARII DIG INTEGR SER LTD",
        "long_name": "Yaarii Digital Integrated Services Limited",
        "summary": "Yaarii Digital Integrated Services Limited, together with its subsidiaries, engages in the provision of management and maintenance, and equipment renting services in India. The company operates through four segments: Management and Maintenance Services; Equipment Hiring Services; LED Lighting; and Financing and Related Activities. It is involved in the construction advisory and other related services; LED lighting products; and real estate project advisory businesses, as well as trades in various sculptures, paintings, art graphics, etc. The company also purchases, sells, deals, constructs, and develops real estate projects and various other related activities. In addition, it provides financial products and services through its Yaarii digital platform and app. The company was formerly known as Indiabulls Integrated Services Limited and changed its name to Yaarii Digital Integrated Services Limited in November 2020. Yaarii Digital Integrated Services Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.yaarii.in",
        "market_cap": "Micro Cap"
    },
    "YESBANK.NS": {
        "short_name": "YES BANK",
        "long_name": "Yes Bank Limited",
        "summary": "Yes Bank Limited provides banking and financial services primarily in India. It operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking Operations segments. The company offers corporate banking services, such as working capital finance, term loans, corporate finance, trade finance and cash management services, debt capital markets, treasury, liquidity management, and other services. It also provides retail banking products, including secured business, home, car, super bike, commercial vehicle, construction equipment, gold, and personal loans, as well as loans against securities; health care and printing equipment finance; and business banking services to micro, small, and medium enterprises. In addition, the company offers financial and advisory services to ministries under the union and state governments, central and state public sector undertakings, boards, and other affiliates; and banking solutions to banks, non-banking finance and housing finance companies, asset finance companies, insurance intermediaries, small finance and payment banks, mutual funds, financial institutions, private equity funds, cooperative and regional rural banks, capital market participants, primary dealers, depositories, AD II license holders, money changers, PPI operators, and payment aggregators. Further, it provides debit and credit cards, current and savings accounts, and mobile banking services; and transaction banking services comprising escrow, trade finance, supply chain finance, foreign exchange, and bullion trading. Additionally, the company offers loan syndication services; investment banking services, including mergers and acquisition advisory, and capital advisory services; and micro-credit, micro saving, micro-insurance, and remittance services. As of March 31, 2020, it operated 1,135 branches; 2 national operating centers; and 1,423 ATMs and bunch note acceptors. The company was incorporated in 2003 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Banks - Regional",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.yesbank.in",
        "market_cap": "Mid Cap"
    }
}