{
  "BAJAJHLDNG.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Bajaj Holdings & Investment Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "BAJAJ HLDG & INVES",
    "state": null,
    "summary": "Bajaj Holdings & Investment Limited operates as an investment company in India. It invests in companies operating in the auto, construction/infra, telecom, material/resources/oil and gas, consumer/education, technology, pharmaceutical/agrochemical/healthcare, financial, and other sectors. The company was founded in 1926 and is headquartered in Pune, India.",
    "website": "http://www.bhil.in",
    "zipcode": "411035"
  },
  "BFINVEST.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "BF Investment Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "BF INVESTMENT LTD",
    "state": null,
    "summary": "BF Investment Limited operates as a non deposit taking core investment company in India. It is involved in the loans and investments business. The company was incorporated in 2009 and is based in Pune, India.",
    "website": "http://www.bfilpune.com",
    "zipcode": "411036"
  },
  "BINDALAGRO.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Oswal Greentech Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "OSWAL GREENTECH LI",
    "state": null,
    "summary": "Oswal Greentech Limited develops and promotes residential and commercial real estate projects in India. The company operates through Real Estate and Investment segments. It is also involved in the trading of real estate assets. In addition, the company invests in equity instruments and other securities. The company was formerly known as Oswal Chemicals & Fertilizers Limited and changed its name to Oswal Greentech Limited in November 2011. Oswal Greentech Limited was incorporated in 1981 and is based in New Delhi, India.",
    "website": "http://www.oswalgreens.com",
    "zipcode": "110001"
  },
  "HDFCAMC.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "HDFC Asset Management Company Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "HDFC ASSET MANAGEM",
    "state": null,
    "summary": "HDFC Asset Management Company Limited is a publically owned investment manager. The firm launches and manages equity, fixed income, and balanced mutual funds for its clients. It manages equity, fixed income, balanced, and real estate portfolios. The firm invests in public equity and fixed income markets. The firm employs fundamental analysis to make its investments. HDFC Asset Management Company Limited was founded on December 10, 1999 and is based in Mumbai, Maharashtra. HDFC Asset Management Company Limited operates as a subsidiary of Housing Development Finance Corporation Limited.",
    "website": "http://www.hdfcfund.com",
    "zipcode": "400020"
  },
  "IDFC.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "IDFC Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "IDFC LIMITED",
    "state": null,
    "summary": "IDFC Limited, together with its subsidiaries, engages in the investment activities in India. The company operates through Financing and Asset Management segments. It is also involved in the portfolio management, mutual fund, and other alternative funds activities; and provides investment banking and brokerage services. The company was formerly known as Infrastructure Development Finance Company Limited and changed its name to IDFC Limited in July 2012. IDFC Limited was founded in 1997 and is based in Mumbai, India.",
    "website": "http://www.idfc.com",
    "zipcode": "400021"
  },
  "IIFLWAM.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "IIFL Wealth Management Limited",
    "market": "in_market",
    "market_cap": "Small Cap",
    "sector": "Financial Services",
    "short_name": "IIFL Wealth Mgmt Ltd",
    "state": null,
    "summary": "IIFL Wealth Management Limited provides wealth and asset management services primarily in India. It offers wealth management services, such as financial product distribution, advisory, equity and debt broking, non-discretionary portfolio management, discretionary portfolio management, corporate advisory services, and managing financial products, as well as investment activities and advisory services. The company also provides lending solutions comprising credit solutions against financial assets, promoter securities, and real estate; IPO, employee stock option plan, and margin trade financing; and structured financing solution. In addition, it offers estate planning services, such as wealth structuring and succession planning solution; and asset management solutions, including mutual funds, alternative investment funds, and portfolio management services. IIFL Wealth Management Limited serves high net worth and ultra-high net worth individuals, affluent families, family offices, and institutional clients. The company was founded in 2008 and is based in Mumbai, India.",
    "website": "http://www.iiflwealth.com",
    "zipcode": "400013"
  },
  "JINDALPHOT.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Jindal Photo Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "JINDAL PHOTO LTD",
    "state": null,
    "summary": "Jindal Photo Limited primarily invests in the shares of companies in India. It also provides management consultancy services. The company was incorporated in 2004 and is headquartered in New Delhi, India.",
    "website": "http://www.jindalphoto.com",
    "zipcode": "110070"
  },
  "JPOLYINVST.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Jindal Poly Investment and Finance Company Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "JINDAL POLY INV &",
    "state": null,
    "summary": "Jindal Poly Investment and Finance Company Limited engages in investment activities in India. The company was incorporated in 2012 and is headquartered in New Delhi, India.",
    "website": "http://www.jpifcl.com",
    "zipcode": "110070"
  },
  "KICL.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Kalyani Investment Company Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "KALYANI INVESTMENT",
    "state": null,
    "summary": "Kalyani Investment Company Limited, a non-deposit taking core investment company, invests in listed and unlisted companies in India. It invests in companies of various sectors, including forging, steel, power generation, chemical, banking, etc. The company was incorporated in 2009 and is based in Pune, India. Kalyani Investment Company Limited is a subsidiary of Sundaram Trading and Investment Private Limited.",
    "website": "http://www.kalyani-investment.com",
    "zipcode": "411036"
  },
  "LFIC.NS": {
    "city": "Hyderabad",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Lakshmi Finance & Industrial Corporation Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "LAKSHMI FINANCE &",
    "state": null,
    "summary": "Lakshmi Finance & Industrial Corporation Limited, a non-banking finance company, invests in equity shares and mutual funds in India. The company was formerly known as The Andhra Bank Ltd. and changed its name to Lakshmi Finance & Industrial Corporation Limited in April 1980. Lakshmi Finance & Industrial Corporation Limited was incorporated in 1923 and is based in Hyderabad, India.",
    "website": "http://www.lakshmifinance.org.in",
    "zipcode": "500016"
  },
  "NSIL.NS": {
    "city": "New Delhi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Nalwa Sons Investments Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "NALWA SONS INVEST",
    "state": null,
    "summary": "Nalwa Sons Investments Limited, a non-banking finance company, engages in the investment and financing activities in India. It operates through two segments, Investment & Finance, and Trading of Goods. The company primarily holds investments in equity shares of steel manufacturing companies of O.P. Jindal Group. It also invests in shares, stocks, or other securities. The company was formerly known as Jindal Strips Limited. Nalwa Sons Investments Limited was incorporated in 1970 and is based in New Delhi, India.",
    "website": "http://www.nalwasons.com",
    "zipcode": "110066"
  },
  "PILANIINVS.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Pilani Investment and Industries Corporation Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "PILANI INVESTMENT",
    "state": null,
    "summary": "Pilani Investment and Industries Corporation Limited, a non-banking financial company, invests in group companies and mutual funds in India. The company was founded in 1948 and is based in Kolkata, India.",
    "website": "http://www.pilaniinvestment.com",
    "zipcode": "700001"
  },
  "RPSGVENT.NS": {
    "city": "Kolkata",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "RPSG Ventures Limited",
    "market": "in_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "RPSG VENTURES LIMITED",
    "state": null,
    "summary": "CESC Ventures Limited owns, operates, invests, and promotes business in the fields of information technology, business process outsourcing, real estate, entertainment, and fast moving consumer goods in India. It offers application development and management, setup and operations and maintenance of IT infrastructure, cyber security management, and IT consultancy services; and business process outsourcing in the field of customer interaction management, data and transaction processing, collections management, consulting, and analytics. The company also provides packaged snacks under the TOO YUMM! and Evita brands; and various Ayurvedic formulations under the Dr. Vaidya's brand name, as well as wellness products and supplements for immunity, energy, sexual wellness, weight management, hair and skin care, and others. In addition, it operates shopping malls; and restaurants under the brand name of Waffle Wallah and Bombay Toastee brands. As of March 31, 2020, it operated 24 restaurant outlets. The company was formerly known as RP-SG Business Process Services Limited and changed its name to CESC Ventures Limited. The company was incorporated in 2017 and is based in Kolkata, India.",
    "website": "http://www.rpsgventuresltd.com",
    "zipcode": "700001"
  },
  "SILINV.NS": {
    "city": "Bhawanimandi",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "SIL Investments Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "SIL INVESTMENTS",
    "state": null,
    "summary": "SIL Investments Limited, a non-banking financial company, engages in the commercial finance and investments activities in India. The company invests in shares, securities, and real estate. The company was formerly known as Sutlej Industries Limited and changed its name to SIL Investments Limited in March 2007. SIL Investments Limited was incorporated in 1934 and is based in Bhawanimandi, India.",
    "website": "http://www.silinvestments.in",
    "zipcode": "326502"
  },
  "TIMESGTY.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Asset Management",
    "long_name": "Times Guaranty Limited",
    "market": "in_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "TIMES GUARANTY",
    "state": null,
    "summary": "Times Guaranty Limited, a non-deposit accepting non-banking financial company, provides investment and financial services in India. It also provides retail and corporate lending, merchant banking, and money market related services. The company was formerly known as Times Guaranty Finance Limited and changed its name to Times Guaranty Limited in December 1999. The company was incorporated in 1989 and is based in Mumbai, India. Times Guaranty Limited is a subsidiary of Bennett Coleman and Company Limited.",
    "website": "http://www.timesguarantylimited.com",
    "zipcode": "400013"
  }
}
