{
    "ALMONDZ.NS": {
        "short_name": "ALMONDZ GLOBAL SEC",
        "long_name": "Almondz Global Securities Limited",
        "summary": "Almondz Global Securities Limited operates as an investment bank in India. The company operates through Debt and Equity Market Operations, Consultancy and Advisory Fees, Wealth Advisory/Broking Activities, Finance Activities, and Healthcare Services segments. It offers corporate finance advisory services, including initial public offerings (IPOs), follow-on public offerings, rights issues, takeovers, delisting, buy backs, and equity valuations; private equity, merger and acquisition, and corporate restructuring services; debt private placement, loan syndication, and debt restructuring services, as well as issues bonds; and infrastructure advisory, joint venture, and project advisory services, as well as merchant banking and underwriting services. The company also provides equity broking services, such as institutional equity, retail equity, equity research, and portfolio management; debt portfolio management services comprising money market operation and debt trading; and wealth management services, which include mutual funds, equity and debt IPOs, derivative strategies, and other financial products. In addition, it offers commodity, real estate, and insurance broking services, as well as healthcare services; grants loans; and establishes, administers, owns, and operates eye care hospitals. The company was founded in 1994 and is headquartered in New Delhi, India. Almondz Global Securities Limited is a subsidiary of Avonmore Capital & Management Services Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.almondzglobal.com",
        "market_cap": "Small Cap"
    },
    "ANGELBRKG.NS": {
        "short_name": "Angel Broking Limited",
        "long_name": "Angel Broking Limited",
        "summary": "Angel Broking Limited provides broking and advisory services, margin funding, loans against shares, and financial products to its clients under the Angel Broking brand in India. The company operates in three segments: broking and Related Services; Finance and Investing Activities; and Health and Allied Fitness Activities. It offers broking services through online and digital platforms, and trading terminals, as well as network of sub-brokers. The company's products include equity, commodities, derivatives, and currency trading. Its services comprise portfolio management, investment advisory, intraday trading, trading account, portfolio health score, initial public offering, and DEMAT account, as well as loans against shares. The company also engages in the investment activities; and operation of fitness centers. Angel Broking Limited was incorporated in 1996 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.angelbroking.com",
        "market_cap": "Large Cap"
    },
    "ATNINTER.NS": {
        "short_name": "ATN INTERNATIONAL",
        "long_name": "ATN International Limited",
        "summary": "ATN International Limited engages in the trading of shares and securities in India. The company was incorporated in 1983 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700072",
        "website": "http://www.atninternational.co.in",
        "market_cap": "Small Cap"
    },
    "AUSOMENT.NS": {
        "short_name": "AUSOM ENTERPRISE",
        "long_name": "Ausom Enterprise Limited",
        "summary": "Ausom Enterprise Limited engages in the trading activities in India. It trades in commodities, bullions, gold jewelry, shares and securities, diamonds, derivatives, and units of mutual funds. The company was formerly known as Core Emballage Limited. Ausom Enterprise Limited was incorporated in 1984 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380006",
        "website": "http://www.ausom.in",
        "market_cap": "Small Cap"
    },
    "BIRLAMONEY.NS": {
        "short_name": "ADITYA BIRLA MONEY",
        "long_name": "Aditya Birla Money Limited",
        "summary": "Aditya Birla Money Limited engages in the securities brokerage and financial product distribution businesses in India. It provides broking, portfolio management, depository, and e-insurance repository services; and invests in debt instruments and mutual funds. The company also offers equity and derivative trading services through NSE and BSE; currency derivatives on MCX-SX; and commodities trading services through MCX and NCDEX. Aditya Birla Money Limited operates through 41 branches and 755 franchised offices. The company was incorporated in 1995 and is based in Chennai, India. Aditya Birla Money Limited is a subsidiary of Aditya Birla Capital Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://stocksandsecurities.adityabirlacapital.com",
        "market_cap": "Mid Cap"
    },
    "BLBLIMITED.NS": {
        "short_name": "BLB",
        "long_name": "BLB Limited",
        "summary": "BLB Limited provides securities brokerage services in India. It trades and invests in shares, securities, and commodities. The company was founded in 1965 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110002",
        "website": "http://www.blblimited.com",
        "market_cap": "Small Cap"
    },
    "BLUECHIP.NS": {
        "short_name": "BLUE CHIP INDIA",
        "long_name": "Blue Chip India Limited",
        "summary": "Blue Chip India Limited engages in the fund based activities in India. It sells equity shares. The company was incorporated in 1993 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700072",
        "website": "http://www.bluechipind.net",
        "market_cap": "Small Cap"
    },
    "CAMS.NS": {
        "short_name": "Computer Age Mngt Ser Ltd",
        "long_name": "Computer Age Management Services Limited",
        "summary": "Computer Age Management Services Pvt. Ltd., a mutual fund transfer agency, provides services for investors, distributors, asset management companies, and demat account holders in India. It offers investor services, such as myCAMS, an application for financial transactions; and SMSBack Service, a suite of services to access account via SMS, as well as direct plans and others. The company also provides common mutual fund transaction system, an integrated solution to access information relating to, and transact on schemes of various mutual funds; and FUNDSNet, a platform that allows channel intermediaries to use Internet and submit requests for transactions and to provide customer statements, including wrap statements. In addition, it offers Distributor Mailback Service that enables distributors to request historical NAVs, account statements, and transactions of their customers on an ad-hoc basis, as well as provides mail back systems to check sales performance by city, find individual distributor performance and ranking, investor queries, and others. Further, the company provides service network that enables same day transaction processing, including submit transactions, service request, make enquiries about balance, valuation, and ask for statement; NIGO transactions; and account information to verify current balance, obtain an account statement, review sales performance of fund or of a distributor, and transact on behalf of investors using eISC, a secure intranet based application. Additionally, it offers NAV and dividend history of various mutual fund schemes; and depository services, such as demat account opening, dematerialization, rematerialization, transaction statement and execution, pledge, and other demat related services for demat account holders. It serves customers through a network of service centers in India. The company was incorporated in 1988 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600002",
        "website": "http://new.camsonline.com",
        "market_cap": "Large Cap"
    },
    "CDSL.NS": {
        "short_name": "CENTRAL DEPOSITORY",
        "long_name": "Central Depository Services (India) Limited",
        "summary": "Central Depository Services (India) Limited provides depository services in India. The company offers various services, such as account opening, dematerialization, processing delivery and receipt instructions, account statement, re-materialization, pledging, nomination, transmission of securities, change in address, bank account details, and SMS services for depository participants. It also provides facilities to issuers to credit securities to a shareholder's or applicants demat accounts; KYC services in respect of investors in capital markets to capital market intermediaries; facilities holding of insurance policies in electronic form to the holders of these policies; and facilitate holding and transacting in electronic negotiable warehouse receipts. In addition, it offers services, such as electronic access to security information, electronic access to security information and execution of secured transaction, e-voting, e-locker, and mobile application. It serves investors through depository participants, issuer companies, capital market intermediaries, insurance companies, and warehouse service providers/warehouses. The company was incorporated in 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.cdslindia.com",
        "market_cap": "Large Cap"
    },
    "CONSOFINVT.NS": {
        "short_name": "CONSOLIDATED FINVE",
        "long_name": "Consolidated Finvest & Holdings Limited",
        "summary": "Consolidated Finvest & Holdings Limited operates as a non-banking financial company in India. The company invests in shares, stocks, bonds, debentures, mutual funds, and inter corporate deposits and loans. It also provides loans. The company was incorporated in 1993 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110070",
        "website": "http://www.consofinvest.com",
        "market_cap": "Mid Cap"
    },
    "DBSTOCKBRO.NS": {
        "short_name": "DB INTL STOCK BROK",
        "long_name": "DB (International) Stock Brokers Limited",
        "summary": "DB (International) Stock Brokers Limited provides stock broking and depository participant services in India. It also offers non-resident Indian services, such as equity and derivative trading, mutual fund and initial public offering investment, and procurement of permanent account number cards and RBI permissions. DB (International) Stock Brokers Limited was founded in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.dbonline.in",
        "market_cap": "Small Cap"
    },
    "DHANI.NS": {
        "short_name": "DHANI SERVICES LIMITED",
        "long_name": "Dhani Services Limited",
        "summary": "Dhani Services Limited provides securities, commodities, and derivatives broking services in India. Its broking services include equity, derivative, commodity, and currency trading, as well as Demat accounts. The company also offers mutual funds and initial public offerings. In addition, it operates as a stock and share broker on the National Stock Exchange of India Limited and the BSE Limited; and commodity broker on the Multi Commodity Exchange of India Limited and the National Commodity and Derivative Exchange Limited. Further, the company is involved in the cross sale of real estate properties; and provision of other ancillary services relating to broking activities, as well as offers consumer and business loans through digitally enabled loan fulfillment solutions. Additionally, it provides asset reconstruction and related services; and site visit assistance and home loans for residential projects, as well as operates online trading platforms. The company was formerly known as Indiabulls Ventures Limited and changed its name to Dhani Services Limited in October 2020. Dhani Services Limited was incorporated in 1995 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122016",
        "website": "http://www.dhani.com",
        "market_cap": "Large Cap"
    },
    "DHUNINV.NS": {
        "short_name": "DHUNSERI INVESTMEN",
        "long_name": "Dhunseri Investments Limited",
        "summary": "Dhunseri Investments Limited formerly known as DI Marketing Limited. Dhunseri Investments Limited was founded on 4th February, 1997 is based in West Bengal, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.dhunseriinvestments.com",
        "market_cap": "Mid Cap"
    },
    "DOLAT.NS": {
        "short_name": "Dolat Investments Ltd",
        "long_name": "Dolat Investments Limited",
        "summary": "Dolat Investments Limited trades in shares, securities, commodities, and other financial products through various trading platforms in India. It also invests in stocks, commodities, and derivatives. The company was incorporated in 1983 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400058",
        "website": "http://www.dolatinvest.com",
        "market_cap": "Large Cap"
    },
    "DVL.NS": {
        "short_name": "DHUNSERI VENTURES",
        "long_name": "Dhunseri Ventures Limited",
        "summary": "Dhunseri Ventures Limited primarily engages in the trading operations of PET resin. The company operates in two segments, Treasury Operations and Trading. It also undertakes treasury operations in shares and securities of other bodies corporate; develops and provides infrastructure facilities in special economic zones for information technology and information technology enabled services; and manufactures and retails confectioneries. In addition, the company manufactures, processes, buys, imports, exports, deals in, and sells various food products for food and beverages industries, as well as its related businesses. Further, it manufactures polyester films. It operates in Italy, India, and internationally. The company was formerly known as Dhunseri Petrochem Limited and changed its name to Dhunseri Ventures Limited in December 2018. The company was incorporated in 1916 and is based in Kolkata, India. Dhunseri Ventures Limited is a subsidiary of Dhunseri Investments Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700020",
        "website": "http://www.aspetindia.com",
        "market_cap": "Mid Cap"
    },
    "EBIXFOREX.NS": {
        "short_name": "EBIXCASH WRLD MONEY IND",
        "long_name": "Ebixcash World Money India Limited",
        "summary": "Ebixcash World Money India Limited provides money changing and transfer services in India. It primarily offers foreign exchange and outward and inward remittance services, prepaid and gift cards, and travel insurance services for its corporate and retail clients. The company was formerly known as Weizmann Forex Limited and changed its name to Ebixcash World Money India Limited in January 2020. The company was founded in 1985 and is based in Mumbai, India. Ebixcash World Money India Limited operates as a subsidiary of EbixCash World Money Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.indiaforexonline.com",
        "market_cap": "Mid Cap"
    },
    "EDELWEISS.NS": {
        "short_name": "EDELWEISS FIN SERV",
        "long_name": "Edelweiss Financial Services Limited",
        "summary": "Edelweiss Financial Services Limited provides financial products and services to individuals and institutions in India. It offers retail credit products, such as home loans, SME and business loans, loans against shares, and agricultural and rural finance; corporate credit products, including structured collateralized credit and wholesale mortgage; and distressed credit. The company also provides personal and private wealth management services; asset management products and services comprising mutual funds, alternate asset advisory, multi strategy funds, and distressed assets resolution; and capital markets services that include investment banking, institutional equities, forex and rates, asset, and financial product distribution services. In addition, it offers life and general insurance products. The company was formerly known as Edelweiss Capital Limited and changed its name to Edelweiss Financial Services Limited in August 2011. Edelweiss Financial Services Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.edelweissfin.com",
        "market_cap": "Large Cap"
    },
    "EMKAY.NS": {
        "short_name": "EMKAY GLOBAL FIN",
        "long_name": "Emkay Global Financial Services Limited",
        "summary": "Emkay Global Financial Services Limited, through its subsidiaries, provides stock broking, institutional equities, investment banking, portfolio management, and wealth management services in India. The company offers equity broking, asset management, currency and commodity advisory and broking, trading and investment education, investment management, alternative investment fund, lending, depository participant, wealth and investment advisory, and retail broking services. It also provides investment solutions, such as portfolio creation, investment planning, portfolio monitoring, transactional support, MIS and information support, and advisory services; and estate and succession planning, mutual fund advisory, cash and derivatives brokerage, and equity-based research advisory services, as well as distributes third party financial products. In addition, the company offers equity research, equity capital market, merchant banking, debt advisory, private equity placement, qualified institutional placement, rights issue, and corporate advisory services. It serves institutional investors, mutual funds, hedge funds, banks, insurance companies, private equity firms, corporate houses, small and medium sized enterprises, and high net worth individuals. The company was formerly known as Emkay Share and Stock Brokers Limited and changed its name to Emkay Global Financial Services Limited in June 2008. Emkay Global Financial Services Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400028",
        "website": "http://www.emkayglobal.com",
        "market_cap": "Small Cap"
    },
    "GEOJITFSL.NS": {
        "short_name": "GEOJIT FINANCIAL S",
        "long_name": "Geojit Financial Services Limited",
        "summary": "Geojit Financial Services Limited, an investment services company, provides broking and financial services in India, Oman, Kuwait, the United Arab Emirates, and Saudi Arabia. The company operates through Financial Services and Software Services segments. The Financial Services segment offers brokerage, depository, financial products distribution, portfolio management, and other related services. The Software services segment develops and maintains software. It also provides a range of value-added products and services, such as equities, derivatives, mutual funds, life and general insurance, financial planning, and fixed deposits. The company was formerly known as Geojit BNP Paribas Financial Services Limited and changed its name to Geojit Financial Services Limited in February 2017. Geojit Financial Services Limited was founded in 1987 and is based in Kochi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kochi",
        "zipcode": "682024",
        "website": "http://www.geojit.com",
        "market_cap": "Large Cap"
    },
    "HBSL.NS": {
        "short_name": "HB STOCKHOLDINGS",
        "long_name": "HB Stockholdings Limited",
        "summary": "HB Stockholdings Limited, a non-banking financial company, engages in the investment and finance activities in India. It is involved in the investment, purchase, and sale of securities. The company was formerly known as HB Portfolio Leasing Limited and changed its name to HB Stockholdings Limited in February 1997. HB Stockholdings Limited was incorporated in 1985 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122001",
        "website": "http://www.hbstockholdings.com",
        "market_cap": "Small Cap"
    },
    "IEX.NS": {
        "short_name": "INDIAN ENERGY EXCH",
        "long_name": "Indian Energy Exchange Limited",
        "summary": "Indian Energy Exchange Limited operates a power trading platform. The company enables price discovery and risk management for participants of the electricity market, including industries eligible for open access. Its products include Day-Ahead-Market, a physical electricity trading market for deliveries for any/some/all 15 minute time blocks in 24 hours of next day starting from midnight; Term-Ahead-Market that provides a range of products allowing participants to buy/sell electricity on intra-day, day-ahead contingency, and daily and weekly contracts; Real-Time Market, an auction session every half an hour with power to be delivered after 4 time blocks or an hour after gate closure of the auction; Renewable Energy Certificates to ease the purchase of renewable energy by the state utilities and obligated entities; and Energy Saving Certificates. The company was incorporated in 2007 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.iexindia.com",
        "market_cap": "Large Cap"
    },
    "IIFLSEC.NS": {
        "short_name": "IIFL SECURITIES",
        "long_name": "IIFL Securities Limited",
        "summary": "IIFL Securities Limited provides capital market services in primary and secondary market in India, the United States, and the United Kingdom. The company offers retail broking products and services comprising equity, commodities and currency broking, and equity research; advisory services, including financial planning, equity portfolio, access to alternate investments, and retirement and estate planning; broking services; research and corporate services; investment banking services, consisting of initial public offerings, qualified investment, right and preferential issues, and follow-on public offer, as well as corporate advisory, including M&A, share buybacks, tender offers, and delisitings; and advisory services for private equity placements, and mergers and acquisitions. It also distributes third party financial products, such as mutual funds, insurance, PMS, AIF, fixed deposits, loans, and pension products. It serves retail and mass affluent investors, domestic and foreign institutional investors, sovereign wealth funds, banks, and private equity funds and corporates. The company was formerly known as India Infoline Limited and changed its name to IIFL Securities Limited in February 2018. IIFL Securities Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400069",
        "website": "http://www.indiainfoline.com",
        "market_cap": "Large Cap"
    },
    "INDBANK.NS": {
        "short_name": "INDBANK MERCH BANK",
        "long_name": "Indbank Merchant Banking Services Limited",
        "summary": "Indbank Merchant Banking Services Limited provides merchant banking, stock broking, depository participant, and allied services in India. It also distributes mutual funds. The company was incorporated in 1989 and is based in Chennai, India. Indbank Merchant Banking Services Limited is a subsidiary of Indian Bank.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600035",
        "website": "http://www.indbankonline.com",
        "market_cap": "Small Cap"
    },
    "INDOTHAI.NS": {
        "short_name": "INDO THAI SECURITI",
        "long_name": "Indo Thai Securities Ltd.",
        "summary": "Indo Thai Securities Ltd. engages in stock and share brokers, depository participants, and other related ancillary businesses in India. The company trades in equities and derivatives, commodities derivatives, and currency derivatives; and provides online future trading through a network of 11 branches, authorized persons, etc. It also offers depository services; initial public offerings; life, health, motor/vehicle, fire, marine, travel, and indemnity insurance products; and mutual funds. In addition, it provides portfolio management services, non-convertible debentures, bonds, fixed deposits, and wealth management, as well as co-working spaces. Further, the company is involved in the real estate and consultancy business, as well as operates trading platform, and mobile and desktop applications under the Winstock name. It serves corporate clients, high net worth individuals, and retail investors. Indo Thai Securities Ltd. was founded in 1995 and is headquartered in Indore, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452010",
        "website": "http://www.indothai.co.in",
        "market_cap": "Small Cap"
    },
    "INVENTURE.NS": {
        "short_name": "INVENTURE GROWTH &",
        "long_name": "Inventure Growth & Securities Limited",
        "summary": "Inventure Growth & Securities Limited, together with its subsidiaries, provides various financial products and services in India. The company offers shares and other securities broking, financial product distribution, institutional broking, and mutual fund investment services. It also provides consumer and business loans, loans against properties and securities, inter corporate deposits, salaried personal loans, and gold loans, as well as financial institutions group lending services; commodities broking and hedging services, and arbitrage products; and life and general insurance broking services, as well as risk management solutions. In addition, the company offers issue management, leasing and hire purchase, loan syndication, mergers and acquisitions, treasury and portfolio management, project advisory, structured debt placement, mergers and acquisitions, capital markets, private equity, stressed assets resolution, etc.; and manages funds. Further, it engages in the real estate business. It serves institutional clients, HNIs, and retail investors through 224 business locations, including branches, franchisees, and sub-brokers. Inventure Growth & Securities Limited was founded in 1995 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400 093",
        "website": "http://www.inventuregrowth.com",
        "market_cap": "Mid Cap"
    },
    "ISEC.NS": {
        "short_name": "ICICI SEC. LTD",
        "long_name": "ICICI Securities Limited",
        "summary": "ICICI Securities Limited provides institutional and retail broking, merchant banking, and advisory services to corporates, financial institutions, high net-worth individuals, and retail investors in India. The company operates through three segments: Investment & Trading, Broking & Commission, and Advisory Services. It operates ICICIdirect.com, an online broking platform to invest in equity, derivatives, currency futures, and margin trading funding; and distributes financial products and services, such as mutual funds, fixed deposits, loans, tax services, pension products, rental discounting, asset financing, overdraft, and life and general insurance products. The company also provides private wealth management services, such as investment solutions, protection, mortgages and loans, tax advisory, estate planning, and real estate services, as well as alternative investment, raising equity capital, debt syndication, and monetizing assets services; and operates approximately 172 ICICIdirect branches in 70 cities. In addition, it offers equity capital market products and services, including initial public offerings, qualified institutional placements, issues rights, follow-on offerings, issues preferential, block deal, algo trading, corporate access, investor meets, and equity research; and corporate finance services comprising equity capital market, debt advisory, mergers and acquisitions, advisory, private equity, structured products, restructuring, equity-debt issue management services, and other related activities. The company was formerly known as ICICI Securities and Finance Company Limited and changed its name to ICICI Securities Limited in April 2003. The company was incorporated in 1995 and is headquartered in Mumbai, India. ICICI Securities Limited is a subsidiary of ICICI Bank Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.icicisecurities.com",
        "market_cap": "Large Cap"
    },
    "JMFINANCIL.NS": {
        "short_name": "JM FINANCIAL",
        "long_name": "JM Financial Limited",
        "summary": "JM Financial Limited provides a range of financial products and services to corporations, financial institutions, high net-worth individuals, and retail investors in India. It operates through four segments: Investment Banking, Wealth Management and Securities Business; Mortgage Lending; Distressed Credit; and Asset Management. The Investment Banking, Wealth Management and Securities Business segment manages capital markets transactions, as well as advises on mergers and acquisitions, and private equity syndication. This segment also provides investment advisory and distribution services, which include equity brokerage, wealth management, and capital market lending for wealth management and broking clients, as well as distributes financial products; and administers and manages private equity and real estate funds. The Mortgage Lending segment provides finance against commercial and residential real estate to a range of corporates and non-corporate clients, as well as includes housing finance business, and lending to education institutions. The Distressed Credit segment provides securitization and reconstruction of financial assets. The Asset Management segment manages mutual fund assets through various schemes by offering a range of investment options to institutional and corporate clients, as well as high net worth individuals. JM Financial Limited was founded in 1973 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.jmfl.com",
        "market_cap": "Large Cap"
    },
    "KEYFINSERV.NS": {
        "short_name": "KEYNOTE FINANCIAL",
        "long_name": "Keynote Financial Services Limited",
        "summary": "Keynote Financial Services Limited provides investment banking and brokerage services in India. It offers capital market services, which include IPO/rights issue services, such as valuation reports, conducting the due diligence, assessing the fund requirement, market making, underwriting the issue, and lead managing; and merchant banking and advisory services, such as buybacks, delisting, and tender offers. The company also provides corporate finance services related to project finance, syndication, asset based bank loan, structured finance, restructuring advice, venture capital/private equity, valuation, and financial modeling; and mergers and acquisition advisory services in the areas of acquisitions, merger advisory, sale and divesture, joint ventures and alliances, access strategy, acquisition finance, FCCBs, ADRs, GDRs, and listings on international exchanges. In addition, it offers employee stock ownership plans; private equity services; valuation services; and equity trading, commodity trading, currency trading, and investment advisory services, as well as equity/debt placements and restructuring services. The company was formerly known as Keynote Corporate Services Limited and changed its name to Keynote Financial Services Limited in April 2019. The company was founded in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400028",
        "website": "http://www.keynoteindia.net",
        "market_cap": "Small Cap"
    },
    "KHANDSE.NS": {
        "short_name": "KHANDWALA SEC LTD",
        "long_name": "Khandwala Securities Limited",
        "summary": "Khandwala Securities Limited provides stock broking, investment banking, investment advisory, portfolio management, and depository participant services in India. It offers investment banking services, including capital raising, mergers and acquisitions advisory, domestic IPOs, FCCBs, private equity placements, corporate finance advisory, follow-on offerings, rights offerings, ADR and GDR offerings, QIP transactions and convertible offerings, and restructuring services. The company also provides institutional equities services, such as institutional equity sales, execution, research; and broking and distribution services comprising non-institutional equity sales, trading, research, and broking and distribution. In addition, it offers investment advisory services, including private and corporate wealth management, planning and asset deployment advice, and asset allocation and distribution of various products; and equity and debt issue management services. The company serves public and private sector corporations, multinational corporations, financial institutions, institutional investors, high net worth individuals, and retail investors, as well as market intermediaries. Khandwala Securities Limited was founded in 1934 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400023",
        "website": "http://www.kslindia.com",
        "market_cap": "Small Cap"
    },
    "MASKINVEST.NS": {
        "short_name": "MASK INVESTMENTS L",
        "long_name": "Mask Investments Limited",
        "summary": "Mask Investment Limited engages in the finance and investment activities in India. It invests in quoted and unquoted securities. The company was formerly known as Mask Investment Private Limited and changed its name to Mask Investment limited in March 1996. Mask Investment Limited was incorporated in 1992 and is based in Surat, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Surat",
        "zipcode": "395002",
        "website": "http://www.maskinvestments.com",
        "market_cap": "Small Cap"
    },
    "MCDHOLDING.NS": {
        "short_name": "MCDOWELL HOLDINGS",
        "long_name": "McDowell Holdings Limited",
        "summary": "McDowell Holdings Limited operates as a non-banking financial company in India. It engages in the provision of long term investments; and consultancy services. The company was formerly known as McDowell India Sprits Limited and changed its name to McDowell Holdings Limited in October 2006. McDowell Holdings Limited was incorporated in 2004 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560001",
        "website": "http://www.mcdowellholdings.co.in",
        "market_cap": "Small Cap"
    },
    "MOTILALOFS.NS": {
        "short_name": "MOTILAL OSWAL FINA",
        "long_name": "Motilal Oswal Financial Services Limited",
        "summary": "Motilal Oswal Financial Services Limited provides financial services in India. The company operates through Broking and Other Related Activities, Fund Based Activities, Asset Management and Advisory, Investment Banking Services, and Home Finance segments. It offers broking and distribution services, such as equities, derivatives, commodities, currency, depository services, portfolio management services, mutual funds, primary equity offerings, and insurance products; and asset management services. The company also provides private wealth management services, such as equity, alternate, credit solutions, estate planning, will making, and property advisory services; and home loans. In addition, the company offers institutional broking services, including cash and derivatives; private equity services; and investment banking advisory and transaction solutions, including private placement of equity, mergers and acquisitions advisory, and equity capital markets transactions. It serves high net worth individuals; and mutual funds, foreign institutional investors, financial institutions, and corporate clients. Motilal Oswal Financial Services Limited was founded in 1987 and is headquartered in Mumbai, India. Motilal Oswal Financial Services Limited operates as a subsidiary of Passionate Investment Management Private Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.motilaloswalgroup.com",
        "market_cap": "Large Cap"
    },
    "NAGREEKCAP.NS": {
        "short_name": "NAGREEKA CAPITAL &",
        "long_name": "Nagreeka Capital & Infrastructure Ltd.",
        "summary": "Nagreeka Capital & Infrastructure Ltd. is a publicly owned investment manager. The firm invests in equity markets, private equity, mutual funds, real estate, and renewable energy. The firm was founded Nagreeka Securities Ltd. and changed its name to Nagreeka Software Technologies Limited in September 2001. Nagreeka Software Technologies Limited further changed its name to Nagreeka Capital & Infrastructure Ltd. in July 2006. Nagreeka Capital & Infrastructure Ltd. was founded in 1953 is based in Mumbai, India with an additional office in Kolkata, India. Nagreeka Capital & Infrastructure Ltd. operates independently of Nagreeka Exports Ltd. as of September 18, 2007.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400004",
        "website": "http://www.nagreeka.com/capital",
        "market_cap": "Small Cap"
    },
    "NAHARCAP.NS": {
        "short_name": "NAHAR CAPITAL AND",
        "long_name": "Nahar Capital and Financial Services Limited",
        "summary": "Nahar Capital and Financial Services Limited, a non-deposit taking non-banking financial company, engages in investment/financial activities. The company invests in various financial securities, including equity, bonds, debentures, commodity, term deposits, and securities of various kind issued by companies, banks, mutual funds, and other authorities, as well as central, state, municipal, and local bodies. It also provides lending services against liquid securities, such as shares, government bonds, gold, property, and other assets. In addition, the company is involved in the real estate business, including the purchase and sale of residential and/or commercial land with trading perspective; dealing in real estate, the development of land, and the construction of building for commercial and residential purpose; leasing, hiring, or acquiring various real estate assets; and leasing of flats and buildings. Nahar Capital and Financial Services Limited was incorporated in 2006 and is based in Ludhiana, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ludhiana",
        "zipcode": "141003",
        "website": "http://www.owmnahar.com/nahar_cf/about.php",
        "market_cap": "Mid Cap"
    },
    "NBIFIN.NS": {
        "short_name": "N.B.I. INDUSTRIAL",
        "long_name": "N.B.I. Industrial Finance Company Limited",
        "summary": "N.B.I. Industrial Finance Company Limited, a non-banking financial company, invests in shares, securities, and other financial activities. The company was formerly known as The New Bank of India Limited and changed its name to N.B.I. Industrial Finance Company Limited in May 1951. N.B.I. Industrial Finance Company Limited was incorporated in 1936 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700 001",
        "website": "http://www.nbi-india.co.in",
        "market_cap": "Mid Cap"
    },
    "NDGL.NS": {
        "short_name": "NAGA DHUNSERI GROU",
        "long_name": "Naga Dhunseri Group Limited",
        "summary": "Naga Dhunseri Group Limited operates as a non-banking financial company. It invests in shares and securities; and rents commercial vehicles. The company was incorporated in 1918 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700 020",
        "website": "http://www.nagadhunserigroup.com",
        "market_cap": "Small Cap"
    },
    "ONELIFECAP.NS": {
        "short_name": "ONELIFE CAPITAL AD",
        "long_name": "Onelife Capital Advisors Limited",
        "summary": "Onelife Capital Advisors Limited provides strategic advisory services to corporates, HNIs, family offices, etc. in India. The company operates through Advisory Services, Broking Services, and NBFC Business segments. It offers advisory for fund raising through Indian and international markets that ensure capital structures and transaction processing for private placements. The company also advises companies on fund raising during the seed, growth, and expansion phases, as well as acquisition financing and structuring the deal to maximize value for its stakeholders. Its research coverage sectors include castor oil and derivatives, food processing, glass, infrastructure, metals, oil and gas, oral care, packaging, payment gateway, pharma, power, and recycle. In addition, the company engages in commodity broking and other related ancillary services. Further, it provides financing services. The company was founded in 2007 and is based in Thane, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400604",
        "website": "http://www.onelifecapital.in",
        "market_cap": "Small Cap"
    },
    "PNBGILTS.NS": {
        "short_name": "PNB GILTS",
        "long_name": "PNB Gilts Ltd.",
        "summary": "PNB Gilts Ltd. operates as a primary dealer in government securities in India. The company is involved in underwriting government securities issuances; and trading fixed income instruments, such as government securities, treasury bills, state development loans, corporate bonds, and interest rate swaps; and provision of custodian services to its constituents. It also provides gilts accounts and mutual funds, as well as non-SLR papers, including bonds issued by public sector undertakings and other corporate bodies. In addition, the company trades in short term money market instruments comprising call/notice/term money, repo/reverse repo, inter corporate deposits, commercial papers, and certificates of deposit. It serves provident funds trusts, regional rural banks, co-operative banks, corporates, individuals, etc. The company was incorporated in 1996 and is based in New Delhi, India. PNB Gilts Ltd. is a subsidiary of Punjab National Bank.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.pnbgilts.com",
        "market_cap": "Large Cap"
    },
    "PRIMESECU.NS": {
        "short_name": "PRIME SECURITIES",
        "long_name": "Prime Securities Limited",
        "summary": "Prime Securities Limited provides corporate advisory and investment banking services in India. It offers corporate advisory services that include financial advisory for debt and capital structuring; strategic, business, and value enhancement; mergers and acquisitions, and stake sales; and structured debt placement/loan syndications. The company also engages in the debt/equity/capital restructurings/loan re-organization activities; and provision of listed equity services, such as initial public offerings (IPO), qualified institutions placements, and rights issues/buybacks/open offers/preferential allotments, as well as local advisory to overseas offerings/foreign entrants. In addition, it offers unlisted equity services that include pre-IPO placements/PIPEs, private equity, and exits/strategic alliances/JVs. Prime Securities Limited was founded in 1982 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.primesec.com",
        "market_cap": "Small Cap"
    },
    "RELIGARE.NS": {
        "short_name": "RELIGARE ENTERPRIS",
        "long_name": "Religare Enterprises Limited",
        "summary": "Religare Enterprises Limited operates as an investment company in India and internationally. The company provides broking services in equities, currencies, and commodities; depository participant services; and TIN and PAN facilities, as well as operates as an NSDL-appointed enrolment agency for Aadhaar unique identification number and an AMFI-registered mutual fund distributor. It also offers finance for small and medium enterprises; and housing finance, including home-purchase, home construction, and home improvement loans. In addition, the company provides e-governance and financial advisory services. Further, it offers health insurance services to employees of corporates, and individual customers. Additionally, the company provides critical illness, personal accident, top-up coverage, international travel, and maternity insurance products, as well as group health and personal accident insurance. Religare Enterprises Limited was incorporated in 1984 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.religare.com",
        "market_cap": "Large Cap"
    },
    "SCAPDVR.NS": {
        "short_name": "STAMPEDE CAPITAL",
        "long_name": "Stampede Capital Limited",
        "summary": "Stampede Capital Limited provides securities and currencies broking and trading services through various stock exchanges in India. The company was formerly known as Brilliant Securities Limited and changed its name to Stampede Capital Ltd. in July 2011. Stampede Capital Ltd. was incorporated in 1995 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.stampedecap.com",
        "market_cap": "Small Cap"
    },
    "SHAREINDIA.NS": {
        "short_name": "Share Ind. Securities Ltd",
        "long_name": "Share India Securities Limited",
        "summary": "Share India Securities Limited, a financial services company, trades in securities. The company offers broking/depository services, including equity, derivative, commodity, currency, mutual funds, and depository services; loan against securities, loan against commodities, business loans, and personal loans, as well as short, medium, and long term financial loans; and life and general insurances for individual and corporates. It also provides qualified institutional placements; bulk and block trades on exchanges; off-market transactions; arranges private equity; valuation advisory; open offers, buyback, and delisting of securities; and equity mobilization services for infrastructure projects from private equity investors, as well as manages initial public offerings and rights offering. In addition, the company offers a range of financial products and personalized services, including currency and commodity derivative, depository participant, research and analysis, mutual fund advisory and distributorship, and portfolio management services. It serves customers through a network of approximately 587 branches across 14 states in India. The company was formerly known as FMS Securities Limited and changed its name to Share India Securities Limited in 2010. Share India Securities Limited was founded in 1994 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110092",
        "website": "http://www.shareindia.com",
        "market_cap": "Large Cap"
    },
    "SMCGLOBAL.NS": {
        "short_name": "SMC Global Securities Ltd",
        "long_name": "SMC Global Securities Limited",
        "summary": "SMC Global Securities Limited, together with its subsidiaries, provides various financial services in India and internationally. The company operates through three segments: Trading and Distribution, Advisory, and Financing. The Trading and Distribution segment engages in the brokerage and propriety trading of shares, commodities, currencies, derivatives, and other securities; provision of clearing, depositary, and insurance broking services; portfolio and wealth management; and distribution of third party financial products. The Advisory segment provides mortgage and loan advisory, real estate broking, and investment banking services. The Financing segment offers loans. The company also offers online trading and real estate advisory services. SMC Global Securities Limited was founded in 1990 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110005",
        "website": "http://smcindiaonline.com",
        "market_cap": null
    },
    "SPCENET.NS": {
        "short_name": "SPACENET ENTERPRIS",
        "long_name": "Spacenet Enterprises India Limited",
        "summary": "Spacenet Enterprises India Limited primarily engages in the trading of commodities in India. It offers Tradetech, a commodity trade platform; Fantasytech; Edutech, a technology enabled education platform; AI block chain tech platform for tracking real time supply chain management; and Foodtech, a technology enabled delivery platforms for quick service restaurant. The company was formerly known as Northgate Com Tech Limited and changed its name to Spacenet Enterprises India Limited in November 2015. Spacenet Enterprises India Limited was incorporated in 2010 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.spacenetent.com",
        "market_cap": "Small Cap"
    },
    "STAMPEDE.NS": {
        "short_name": "STAMPEDE CAPITAL",
        "long_name": "Stampede Capital Limited",
        "summary": "Stampede Capital Limited provides securities and currencies broking and trading services through various stock exchanges in India. The company was formerly known as Brilliant Securities Limited and changed its name to Stampede Capital Ltd. in July 2011. Stampede Capital Ltd. was incorporated in 1995 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500016",
        "website": "http://www.stampedecap.com",
        "market_cap": "Small Cap"
    },
    "STEELCITY.NS": {
        "short_name": "STEEL CITY SECURIT",
        "long_name": "Steel City Securities Limited",
        "summary": "Steel City Securities Limited provides retail stock broking services in southern parts of India. It provides a trading platform of capital market, futures and options, commodities, and currency derivatives; acts as a depository participant; offers margin trading facility for stocks or derivatives traded on National Stock Exchange of India Limited and BSE; and distributes mutual funds, credit cards, corporate fixed deposits, bonds, and IPOs. The company also promotes pension schemes for the retirement benefits of employees and business people; offers insurance agency services; and provides non-banking financial services, such as personal loans, gold loans, and loans against securities. In addition, it offers e-governance products, such as PAN, TAN, e-TDS, AIR, and form 24G, as well as change requests of PAN and TAN. The company was founded in 1995 and is headquartered in Visakhapatnam, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Visakhapatnam",
        "zipcode": "530016",
        "website": "http://www.steelcitynettrade.com",
        "market_cap": "Small Cap"
    },
    "SUMMITSEC.NS": {
        "short_name": "SUMMIT SECURITIES",
        "long_name": "Summit Securities Limited",
        "summary": "Summit Securities Limited, a non-banking financial company, engages in investment and financial activities. The investments of the firm are typically long term in nature and predominantly in the equity markets. The firm typically invests in companies in real estate sector. Summit Securities Limited was formerly known as RPG Itochu Finance Limited. The company was incorporated on January 30, 1997 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400071",
        "website": "http://www.summitsecurities.net",
        "market_cap": "Mid Cap"
    },
    "TATAINVEST.NS": {
        "short_name": "TATA INVESTMENT",
        "long_name": "Tata Investment Corporation Limited",
        "summary": "Tata Investment Corporation Limited is a publicly owned investment manager. The firm operates as an investment company in India. Its activities primarily include investing in long-term investments in equity shares, equity-related securities and other securities of companies in a range of industries. The company also distributes mutual funds and other investment related securities. Tata Investment Corporation was founded in 1937. Tata Investment Corporation Limited was formerly known as The Investment Corporation of India Limited. Tata Investment Corporation Limited is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.tatainvestment.com",
        "market_cap": "Large Cap"
    },
    "THEINVEST.NS": {
        "short_name": "THE INVESTMENT TRU",
        "long_name": "The Investment Trust of India Limited",
        "summary": "The Investment Trust of India Limited, together with its subsidiaries, provides corporate finance and broking solutions in India. It operates through Advisory Services and Investment Activities; and Trading Activities segments. The company offers equities, derivatives, commodities, currency, and depository services; distributes investments products, such as portfolio management services, mutual funds, primary equity offerings, and other investment products; and loans against shares, education loans, vehicle finance, gold loans, medical loans, and SME finance. It also provides merchant banking, finance and management advisory, trustee, credit management, real estate, debt market, asset management, corporate, and security and commodity broking services, as well as acts as a debt recovery agent. The company was formerly known as Fortune Financial Services (India) Limited and changed its name to The Investment Trust of India Limited in June 2018. The Investment Trust of India Limited was incorporated in 1991 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.itigroup.co.in",
        "market_cap": "Mid Cap"
    },
    "VLSFINANCE.NS": {
        "short_name": "VLS FIN LTD INDIA",
        "long_name": "VLS Finance Limited",
        "summary": "VLS Finance Limited provides various financial services in India. The company's corporate consulting and advisory services include private placement of equities, debentures, and preference shares and bonds with banks, financial institutions, foreign institutional investors, mutual funds, corporates, and high net worth clients; advising on the structuring of schemes for raising debts in the form of fixed income securities; project reports, evaluations, and appraisals from financial institutions/banks; syndication of term loans, working capital, bridge loans, and short term financing; and advisory services on financial and corporate restructuring, spin-offs, mergers and acquisitions, and takeovers. Its corporate consulting and advisory services also comprise arranging external commercial borrowings and advising on rupee term loan swaps with foreign currency loans; support services, including corporate finance, tax planning, audit and accounting, financial and legal consultancy for corporates; arranging factoring of book debts and credit rating; placement of commercial papers; creation of trusts and procedural aspects of securities creation; syndication of asset funding businesses; and identification and arrangement of tie-ups of domestic and foreign partnerships. In addition, the company offers investment banking services, such as determination of the issue size and pricing; drafting of the offer document and filling it with SEBI for approval; co-ordination with various regulatory authorities and private agencies during the issue; monitoring of the press, investor, and analyst meets; selection of the market timing; and other services. VLS Finance Limited was incorporated in 1986 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110065",
        "website": "http://www.vlsfinance.com",
        "market_cap": "Mid Cap"
    },
    "WEALTH.NS": {
        "short_name": "Wealth Frst Port. Mg. Ltd",
        "long_name": "Wealth First Portfolio Managers Limited",
        "summary": "Wealth First Portfolio Managers Limited provides financial assets investment management solutions to corporate, institutional, retail, and HNI and NRI customers in India. Its products include fixed deposits, government securities, treasury and direct bonds, taxable and tax free bonds, direct equity, mutual funds, PMS and pension products, etc. The company also offers investment strategizing, asset research and allocation, trade-executionÂ\u0096 broking, portfolio review, portfolio accounting, tax and retirement planning, and treasury management services. Wealth First Portfolio Managers Limited was founded in 2002 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://www.wealth-firstonline.com",
        "market_cap": "Small Cap"
    },
    "WELINV.NS": {
        "short_name": "WELSPUN INVESTMENT",
        "long_name": "Welspun Investments and Commercials Limited",
        "summary": "Welspun Investments and Commercials Limited invests and deals in shares and securities in India. The company was formerly known as Welspun Investments Limited and changed its name to Welspun Investments and Commercials Limited in March 2010. Welspun Investments and Commercials Limited was incorporated in 2008 and is based in Mumbai, India. Welspun Investments and Commercials Limited is a subsidiary of Welspun Group Master Trust.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.welspuninvestments.com",
        "market_cap": "Small Cap"
    }
}