{"CARERATING.NS": {"short_name": "CARE RATINGS LTD", "long_name": "CARE Ratings Limited", "summary": "CARE Ratings Limited, a credit rating agency, provides various rating and grading services in India, Mauritius, and Nepal. The company offers corporate rating services, such as corporate debt, bank loan, issuer, corporate governance, and recovery rating; financial sector rating services, which cover banks, credit quality, capital protection oriented schemes, insurance, NBFCs, securitization, and housing finance companies; and public finance rating services that cover ratings of state government entities and urban local bodies, as well as project finance, infrastructure sector, MLD valuation, and small and medium enterprises. It also provides grading services for educational institutes, IPOs, industrial training institutes, construction companies, shipyard companies, maritime training institutes, renewable energy service companies and system integrators, micro finance institutions, and energy service companies, as well as provides equity research and grading services, and real estate project star and REIT rating services. CARE Ratings Limited operates 10 branches in India. The company was formerly known as Credit Analysis and Research Limited and changed its name to CARE Ratings Limited in June 2017. CARE Ratings Limited was founded in 1993 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CRISIL.NS": {"short_name": "CRISIL LTD", "long_name": "CRISIL Limited", "summary": "CRISIL Limited, an analytical company, together with its subsidiaries, provides ratings, data, research, and analytics and solutions in India, the United States, the United Kingdom, Argentina, Poland, China, Hong Kong, Singapore, and the United Arab Emirates. It operates through three segments: Ratings, Research, and Advisory. The Ratings services segment include credit ratings for corporates, banks, bank loans, and small and medium enterprises; credit analysis services; grading services; and analytical services. The Research segment provides research and analytical services, industry reports, customized research assignments, subscription to data services, independent equity research, initial public offering grading, and training services. The Advisory segment offers advisory services; and risk management tools, analytics, and solutions to financial institutions, banks, and corporates. The company was formerly known as The Credit Rating Information Services of India Limited and changed its name to CRISIL Limited in December 2003. CRISIL Limited was founded in 1987 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "ICRA.NS": {"short_name": "ICRA LTD", "long_name": "ICRA Limited", "summary": "ICRA Limited operates as an independent and professional investment information, and credit rating agency in India and internationally. The company operates through Rating, Research and Other Services; Consulting Services; and Outsourced and Information Services segments. It offers credit, bank loan, structured finance, issuer, project finance, mutual fund, and fund management quality rating services. The company also provides grading services banking and finance, insurance, and hydro-electricity sector; industry research services in the areas of business and profitability outlook, industry analysis, competitive landscape, impact of regulatory environment, benchmarking of companies, industry credit profile, company profile on listed players, etc.; and consulting services and solutions. In addition, it offers financial information products and services, as well as KPO services. The company was formerly known as Investment Information and Credit Rating Agency of India Limited. ICRA Limited was founded in 1991 and is headquartered in Gurugram, India.", "currency": "INR", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Gurugram"}, "MCX.NS": {"short_name": "MULTI COMMODITY EX", "long_name": "Multi Commodity Exchange of India Limited", "summary": "Multi Commodity Exchange of India Limited, a commodity derivatives exchange, provides a platform to facilitate online trading of commodity derivatives in India. The company offers iCOMDEX, a real-time commodity futures price indices; and trades in bullion, base metals, energy, and agricultural commodities. It also provides trade clearing and settlement services; guarantees counter party risk; and and data feed services. The company has strategic alliances with various exchanges, such as CME group, Dalian Commodity Exchange, London Metal Exchange, Mozambique Commodities Exchange, Taiwan Futures Exchange, and Zhengzhou Commodity Exchange. Multi Commodity Exchange of India Limited was incorporated in 2002 and is based in Mumbai, India.", "currency": "INR", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}}