{
    "ABCAPITAL.NS": {
        "short_name": "ADITYA BIRLA CAPIT",
        "long_name": "Aditya Birla Capital Limited",
        "summary": "Aditya Birla Capital Limited, through its subsidiaries, provides various financial products and services in India and internationally. It offers life insurance products, such as protection, wealth with protection, children's future, health, retirement, and savings with protection insurance; health; wellness; motor, damage, natural calamities, personal accident cover, and third party legal liability; and travel insurance products. The company also provides financing solutions, such as home loans, loans against property, and personal loans; lines of credit, business loans, working capital demand loans, and supply chain financing solutions for small and medium enterprises; and loans against shares, mutual funds, and life insurance policy, as well as ESOP and IPO financing, and promoter and margin trade funding services. In addition, it offers investment services, such as mutual funds, pension funds, stocks and securities, real estate investment, wealth management, and portfolio management services. Further, the company provides financial and IT enabled services; private equity investment, and advisory and management services; stock broking and depository services; and risk advisory, fund management, asset management, and trustee services, as well as other business support and value added services. Additionally, it offers advising solutions, such as MoneyForLife Planner, an online tool that offers personalized financial planning solution; and ABC of Money, which provides money solutions. The company was formerly known as Aditya Birla Financial Services Limited and changed its name to Aditya Birla Capital Limited in June 2017. The company was incorporated in 2007 and is based in Mumbai, India. Aditya Birla Capital Limited is a subsidiary of Grasim Industries Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400013",
        "website": "http://www.adityabirlacapital.com",
        "market_cap": "Large Cap"
    },
    "CENTRUM.NS": {
        "short_name": "CENTRUM CAPITAL",
        "long_name": "Centrum Capital Limited",
        "summary": "Centrum Capital Limited, together with its subsidiaries, provides various financial services for institutions and individuals in India. It operates through Institutional Business, Wealth Management & Distribution, Housing Finance Business, and SME / Micro Credit Lending Business segments. The company offers investment banking services, including equity initial public offerings (IPO), follow-on public offerings and rights issues, pre-IPO placements, qualified institutional placements, American depository receipts, global depository receipts, convertible issuances, buybacks and delisting, open offers and takeovers, and valuation advisory services, as well as alternative investment markets; and mergers and acquisitions, private equity, and structured finance advisory services. It also provides services in the areas of working capital, term loans/corporate loans, project finance, and external commercial borrowings/foreign currency loans; and housing finance, SME and MSME finance, and micro finance. In addition, the company offers private debt, public equity, venture capital, and real estate advisory services; money changing, portfolio management, retail broking, and defense and infrastructure advisory services, as well as trades in bonds. Further, it offers wealth management, stock broking, and insurance services. Centrum Capital Limited was incorporated in 1977 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400098",
        "website": "http://www.centrum.co.in",
        "market_cap": "Large Cap"
    },
    "CREST.NS": {
        "short_name": "CREST VENTURES",
        "long_name": "Crest Ventures Limited",
        "summary": "Crest Ventures Limited operates as a non-banking finance company in India. It operates through three segments: Real Estate, Financial Services, and Investment and Credit. The company develops various real estate projects, such as residential and commercial projects, malls, hotel, and townships. It also provides financial services, including asset management; mutual fund distribution services; and investment management services to family offices and high net worth individuals, as well as deals in wholesale debt markets, foreign exchange markets, interest rate swaps, and currency options. In addition, the company offers destination and event management services, such as tours; meetings, incentives, conferencing, and exhibitions; events; and online services. The company was formerly known as Sharyans Resources Limited and changed its name to Crest Ventures Limited in September 2014. Crest Ventures Limited was incorporated in 1982 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.crest.co.in",
        "market_cap": "Mid Cap"
    },
    "IVC.NS": {
        "short_name": "IL & FS INVESTMENT",
        "long_name": "IL&FS Investment Managers Limited",
        "summary": "IL&FS Investment Managers Limited is the private equity, venture capital, and real estate investment arm of Infrastructure Leasing & Financial Services Limited. The firm specializes in seed capital, late venture, growth capital, expansions, middle market, restructuring, stressed assets, recapitalizations, buyouts investments, and real estate investments in high-growth real estate assets including office, residential, retail, integrated townships, special economic zones, hospitality, and mixed-use properties. It also makes debt investments as well as investment banking led private equity transactions focused on opportunities arising from stressed assets. The firm seeks to invest in energy, materials, logistics, agricultural services, auto components, textiles, healthcare, power, waste management, toll roads and cable infrastructure, biotechnology, niche manufacturing, retail, media, consumer services, consumer brands, pharmaceuticals, manufacturing, airport services, highways and rail tracks, marine ports and services, infrastructure and related services, telecom, city gas distribution, shipyards, life sciences, real estate, waste water treatment, information technology, and information technology enabled services companies. It seeks to invest in Middle East, Asian markets with a focus on India, Tamil Nadu, and Delhi; and China. It seeks to invest between $15 million and $100 million in companies with market capitalization of $50 million and $150 million. The firm prefers to make seed capital funding in infrastructure projects in the range of $2 million and $10 million. In the real estate sector, it seeks to invest between $20 million and $50 million. The firm seeks to hold its investments for a period between three years and five years. It seeks to make private equity investments in post revenue companies. The firm prefers to take a seat on the board of directors of its portfolio companies. IL&FS Investment Managers Limited was founded in 1989 and is based in Mumbai, India with additional offices in Bengaluru, India and Mauritius.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.iimlindia.com",
        "market_cap": "Small Cap"
    },
    "RELCAPITAL.NS": {
        "short_name": "RELIANCE CAPITAL",
        "long_name": "Reliance Capital Limited",
        "summary": "Reliance Capital Limited, a non-banking financial company, primarily engages in lending and investing activities in India. It operates through Finance & Investment, General Insurance, Life Insurance, Commercial Finance, Home Finance, and Others segments. The company offers life, health, and general insurance products; brokerage and distribution services, including equities, commodities and derivatives, wealth management services, portfolio management services, and financial products; and commercial and home finance services, such affordable housing, mortgages, loans against property, SME loans, loans for vehicles, loans for construction equipment, business loans, infrastructure financing, and retail finance. It also provides asset reconstruction, and proprietary investments services, as well as other financial and allied services. The company was formerly known as Reliance Capital & Finance Trust Limited and changed its name to Reliance Capital Limited in January 1995. Reliance Capital Limited was founded in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400055",
        "website": "http://www.reliancecapital.co.in",
        "market_cap": "Mid Cap"
    }
}