{
  "BAJAJFINSV.NS": {
    "city": "Pune",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Insurance - Diversified",
    "long_name": "Bajaj Finserv Ltd.",
    "market": "in_market",
    "market_cap": "Large Cap",
    "sector": "Financial Services",
    "short_name": "BAJAJ FINSERV LTD",
    "state": null,
    "summary": "Bajaj Finserv Ltd. (Bajaj Finserv', BFS' or the Company') is the holding company for the various financial services businesses under the Bajaj group. It serves millions of customers by providing solutions for asset acquisition through financing, asset protection through general insurance, family and income protection in the form of life and health insurance and retirement and savings solutions.",
    "website": "http://www.bajajfinserv.in/corporate-bajaj-finserv",
    "zipcode": "411014"
  },
  "ICICIGI.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Insurance - Diversified",
    "long_name": "ICICI Lombard General Insurance Company Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "ICICI LOMBARD GEN",
    "state": null,
    "summary": "ICICI Lombard General Insurance Company Limited provides various general insurance products and services in India. The company offers motor, car, two wheeler, health, health booster, personal accident, international travel, home, marine, workmen compensation, NRI, business, third party, crop, rural, and cyber insurance products; and provides reinsurance services. The company was incorporated in 2000 and is based in Mumbai, India. ICICI Lombard General Insurance Company Limited is a subsidiary of ICICI Bank Limited.",
    "website": "http://www.icicilombard.com",
    "zipcode": "400025"
  },
  "NIACL.NS": {
    "city": "Mumbai",
    "country": "India",
    "currency": "INR",
    "exchange": "NSI",
    "industry": "Insurance - Diversified",
    "long_name": "The New India Assurance Company Limited",
    "market": "in_market",
    "market_cap": "Mid Cap",
    "sector": "Financial Services",
    "short_name": "THE NEW INDIA ASSU",
    "state": null,
    "summary": "The New India Assurance Company Limited, together with its subsidiaries, operates as a general insurance company in India and internationally. The company provides marine cargo and hull, motor, health, travel, home and contents, customized business and SME products, other personal, industrial, rural, machinery, aviation, liability, fire and burglary, crop, personal accident, and property insurance products. It also offers reinsurance products. The company was founded in 1919 and is headquartered in Mumbai, India.",
    "website": "http://www.newindia.co.in",
    "zipcode": "400001"
  }
}
