{
    "BAJAJFINSV.NS": {
        "short_name": "BAJAJ FINSERV LTD",
        "long_name": "Bajaj Finserv Limited",
        "summary": "Bajaj Finserv Ltd. (Â\u0091Bajaj Finserv', Â\u0091BFS' or Â\u0091the Company') is the holding company for the various financial services businesses under the Bajaj group. It serves millions of customers by providing solutions for asset acquisition through financing, asset protection through general insurance, family and income protection in the form of life and health insurance and retirement and savings solutions.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "ICICIGI.NS": {
        "short_name": "ICICI LOMBARD GEN",
        "long_name": "ICICI Lombard General Insurance Company Limited",
        "summary": "ICICI Lombard General Insurance Company Limited provides various general insurance products in India. The company offers insurance products, such as travel, motor, crop/weather, cattle, health, fire, personal accident, marine, engineering, liability, and home and cyber insurance products, as well as provides reinsurance services. It serves customers through body corporates, as well as small, micro, and medium enterprises; state and central governments, and rural customers; and agents, brokers, bancassurance, telesales, direct alliances, motor insurance service providers, and online platforms. The company was incorporated in 2000 and is based in Mumbai, India. ICICI Lombard General Insurance Company Limited is a subsidiary of ICICI Bank Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "NIACL.NS": {
        "short_name": "THE NEW INDIA ASSU",
        "long_name": "The New India Assurance Company Limited",
        "summary": "The New India Assurance Company Limited, together with its subsidiaries, operates as a general insurance company in India and internationally. The company provides marine cargo and hull, motor, health, travel, home and contents, customized business and SME products, other personal, industrial, rural, machinery, aviation, liability, fire and burglary, crop, personal accident, and property insurance products. It also offers reinsurance products. The company was founded in 1919 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    }
}