{
    "HDFCLIFE.NS": {
        "short_name": "HDFC LIFE INSURANC",
        "long_name": "HDFC Life Insurance Company Limited",
        "summary": "HDFC Life Insurance Company Limited provides individual and group insurance solutions in India. The company offers various insurance plans and policies, such as protection, health, children's, savings and investment, women's, retirement, rural and social, unit linked insurance, NRI, and group insurance plans. It operates through a network of 421 branches. The company was formerly known as HDFC Standard Life Insurance Company Limited changed its name to HDFC Life Insurance Company Limited in January 2019. The company was founded in 2000 and is based in Mumbai, India. HDFC Life Insurance Company Limited operates as a subsidiary of Housing Development Finance Corporation Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400011",
        "website": "http://www.hdfclife.com",
        "market_cap": "Large Cap"
    },
    "ICICIPRULI.NS": {
        "short_name": "ICICI PRUDENTIAL L",
        "long_name": "ICICI Prudential Life Insurance Company Limited",
        "summary": "ICICI Prudential Life Insurance Company Limited provides life insurance, pension, and health insurance products to individuals and groups in India. It offers participating, non-participating non-linked, and non-participating linked. The company also provides term life, health, savings, and retirement insurance products; and pension fund management services. It distributes its products through individual and corporate agents, banks, and brokers, as well as through its own sales force and website. The company was founded in 2000 and is based in Mumbai, India. ICICI Prudential Life Insurance Company Limited is a subsidiary of ICICI Bank Limited.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400025",
        "website": "http://www.iciciprulife.com",
        "market_cap": "Large Cap"
    },
    "MFSL.NS": {
        "short_name": "MAX FINANCIAL SERV",
        "long_name": "Max Financial Services Limited",
        "summary": "Max Financial Services Limited, through its subsidiary, Max Life Insurance Company Limited, provides life insurance products in India. The company offers a range of participating, non-participating, and linked products covering life insurance, pension, and health benefits, including riders for individual and group segments. Its products are distributed through individual and corporate agents, banks, brokers, and other channels. The company also engages in the treasury investment activities. Max Financial Services Limited has a strategic bancassurance relationship with Yes Bank Limited. The company was formerly known as Max India Limited and changed its name to Max Financial Services Limited in January 2016. Max Financial Services Limited was incorporated in 1988 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.maxfinancialservices.com",
        "market_cap": "Mid Cap"
    },
    "SBILIFE.NS": {
        "short_name": "SBI LIFE INSURANCE",
        "long_name": "SBI Life Insurance Company Limited",
        "summary": "SBI Life Insurance Company Limited operates as a private life insurance company in India. Its life insurance business comprises of individual life and group business, including participating, non-participating, pension, group gratuity, group leave encashment, group superannuation, group immediate annuity, unit-linked and variable insurance products, health, and micro insurance. The company also provides accident and disability benefit, level term, and critical illness insurance products. It offers its products through a multi-channel distribution network comprising individual agents, sbi branches, brokers, corporate agents, banca partners, and certified insurance facilitators, as well as common service centre, insurance marketing firm, direct business, and Website and web aggregators. The company was founded in 2000 and is based in Mumbai, India. SBI Life Insurance Company Limited is a subsidiary of State Bank of India.",
        "currency": "INR",
        "sector": "Financial Services",
        "industry": "Insurance - Life",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400069",
        "website": "http://www.sbilife.co.in",
        "market_cap": "Large Cap"
    }
}