{
    "0ZQ.F": {
        "short_name": "KAZATOMPROM  GDR REGS 1/1",
        "long_name": "joint stock company \"National atomic company \"Kazatomprom\"",
        "summary": "joint stock company 'National atomic company 'Kazatomprom' produces and sells uranium and uranium products. It also manufactures and sells beryllium and tantalum products; provides communication and security services; mines rare-earth metals; and produces semiconductor materials. In addition, the company offers research, project, development, and engineering consulting services; explores for, extracts, and processes molybdenum-copper ores; produces and sells metallurgical and polycrystalline silicon; recycles silicon production waste; and produces solar quality silicon, and silicon and photovoltaic slices, and photovoltaic modules. Further, it provides drilling services; monitors radiation level and environment conditions; and offers procurement and transportation services. The company operates in the Republic of Kazakhstan and internationally. joint stock company 'National atomic company 'Kazatomprom' was founded in 1997 and is based in Nur-Sultan, Kazakhstan.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Uranium",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Kazakhstan",
        "city": "Nur-Sultan"
    },
    "CSSV": {
        "short_name": "CASPIAN SERVICES INC",
        "long_name": "Caspian Services, Inc.",
        "summary": "Caspian Services, Inc. provides various oilfield services for the oil and gas industry in the Republic of Kazakhstan and the Caspian Sea region. The company operates in three segments: Vessel Operations, Geophysical Services, and Marine Base Services. The Vessel Operations segment charters a fleet of shallow draft offshore support vessels to oil and natural gas exploration companies. This segment's vessel fleet includes supply vessels, survey/utility vessels, anchor handling multicats and support vessel tugs, cable laying barges, accommodation vessels, and crewboats. The Geophysical Services segment offers onshore geophysical services to independent oil and gas exploration and development companies operating in Kazakhstan. This segment provides geophysical seismic surveys, such as 2D and 3D seismic surveys. The Marine Base Services segment operates a marine base located at the Port of Bautino on the North Caspian Sea. This segment offers various facilities and services comprising long and short terms vessel moorings, wharf front crane pad for vessel loading/offloading, boat yard with vessel lifting facilities, long-term berths, water storage facilities and vessel bunkering, oily and waste water collection and removing facilities, weighbridge facilities, electrical power supply and distribution systems, and open lay-down storage area. The company was formerly known as EMPS Corporation and changed its name to Caspian Services, Inc. in July 2005. Caspian Services, Inc. was founded in 1998 and is based in Almaty, Kazakhstan.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "Almaty"
    },
    "RTSO": {
        "short_name": "RTS OIL HOLDINGS INC",
        "long_name": "RTS Oil Holdings, Inc.",
        "summary": "RTS Oil LLP distributes oil and gas products. The company also owns and operates approximately 20 petrol stations for retail sales, and 6 crude oil and fuel storage tank farms located throughout Kazakhstan for the wholesale distribution of petroleum products. RTS Oil LLP is based in Kazakhstan. RTS Oil Holdings, Inc. was formerly known as RTS Oil LLP. As a result of the acquisition of RTS Oil LLP  by Geo Point Technologies, Inc., RTS Oil LLP's name was changed.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Kazakhstan",
        "city": "None"
    }
}