{
    "1565.TWO": {
        "short_name": "ST SHINE OPTICAL",
        "long_name": "St.Shine Optical Co.,Ltd.",
        "summary": "St.Shine Optical Co.,Ltd. designs, manufactures, markets, and supplies contact lens in Taiwan and internationally. It offers daily spherical, frequent replacement spherical, aberration control, toric frequent replacement, color, and silicone hydrogel soft contact lens, as well as lathe-cut, cast-molding, and RGP lenses. The company offers its products for myopic and hyperopic patients for the correction of astigmatism. The company was formerly known as First Optical Co., Ltd. and changed its name to St.Shine Optical Co.,Ltd. in 1986. St.Shine Optical Co.,Ltd. was founded in 1981 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22146",
        "website": "http://www.stshine.com.tw",
        "market_cap": "Small Cap"
    },
    "1707.TW": {
        "short_name": "GRAPE KING BIO LTD",
        "long_name": "Grape King Bio Ltd",
        "summary": "Grape King Bio Ltd produces and sells pharmaceutical preparations, patent medicines, liquid tonics, drinks, and healthy foods in Taiwan, China, and internationally. It operates through Multi-Level Marketing, Distributors, and Original Equipment Manufacturer (OEM) segments. The company offers mushroom mycelium products, such as ganoderma lucidum, agaricus blazei, antrodia cinnamomea, cordyceps sinensis, and coriolus versicolor; probiotics, including enterococcus, bifidobacterium, lactobacillus, pediococcus, streptococcus, saccharomyces, and clostridium; and enzymes. It also provides OEM, original design manufacturing, formulation design, research and development, and raw material supply services. The company was founded in 1969 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "324",
        "website": "http://www.grapeking.com.tw",
        "market_cap": "Small Cap"
    },
    "1731.TW": {
        "short_name": "MAYWUFA CO",
        "long_name": "Maywufa Company Ltd.",
        "summary": "Maywufa Company Ltd. manufactures and sells hair and skin care products under the Maywufa brand in Taiwan. It offers hair color creams; health care products and food supplements; and mother and baby skin care products under the mustela brand. The company also provides pharmaceuticals and medical devices, such as PG2 Lyophilized injection for treatment of cancer-related fatigue; AmCad-UT Detection device, an ultrasound CAD for thyroid cancer detection; and Bio-Three tablets for the treatment of mild diarrhea, abdominal pain, and constipation. In addition, it sells and distributes pharmaceutical products; and operates and manages pharmacy chain under the Pharmacy Franchise name. Maywufa Company Ltd. was founded in 1976 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.maywufa.com.tw",
        "market_cap": "Micro Cap"
    },
    "1733.TW": {
        "short_name": "APEX BIOTECHNOLOGY CORP",
        "long_name": "Apex Biotechnology Corp.",
        "summary": "Apex Biotechnology Corp. engages in the research, development, manufacture, and sale of home care medical devices by using biosensor technology worldwide. The company offers blood glucose, uric acid, hemoglobin, cholesterol, lactate, HbA1C, and ketone monitoring systems, as well as coagulation and multifunctional self-testing, and hemoglobin screening systems. It also provides pesticide residues check systems; and care management and tele-health services. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30078",
        "website": "http://www.apexbio.com",
        "market_cap": "Micro Cap"
    },
    "1734.TW": {
        "short_name": "SINPHAR PHARMACEUTICAL CO LTD",
        "long_name": "Sinphar Pharmaceutical Co.,Ltd.",
        "summary": "Sinphar Pharmaceutical Co.,Ltd., together with its subsidiaries, researches, develops, manufactures, and sells therapeutic drugs, health care foods, and medical beauty products in Taiwan and internationally. It produces anti-cancer pharmaceuticals, such as injections, solid reagents, and hormone reagents; and tablets, soft gel capsules and powder and canned special nutrient products. The company also provides shampoo, body wash, tonic water, lotions, moisturizers, sunscreen lotions, and serums; and pharmaceutical packaging products, such as eye drop bottles, dry canisters, tablet bottles, and various medical grade plastic containers. In addition, it offers plant extracts and functional foods; and OEM services, such as product design, manufacturing, etc. to manufacturers. Sinphar Pharmaceutical Co.,Ltd. was founded in 1977 and is headquartered in Yilan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yilan City",
        "zipcode": "269",
        "website": "http://www.sinphar.com.tw",
        "market_cap": "Micro Cap"
    },
    "1752.TWO": {
        "short_name": "NANG KUANG PHARMACEUTICAL CO",
        "long_name": "Nang Kuang Pharmaceutical Co., Ltd.",
        "summary": "Nang Kuang Pharmaceutical Co., Ltd. operates as a pharmaceutical company primarily in Taiwan. The company provides parenterals, aseptic parenterals, lyophilized injections, pre-filled syringes, and pre-mixed IV infusion bags, as well as tablets, capsules, topical products, and oral suspensions. It offers various products in the areas of cardiovascular system, gastrointestinal system, nervous system, alimentary and metabolism, blood, antineoplastic and immunomodulatory, musculo-skeletal system, respiratory system, dermatological, genito-urinary and sex hormone, systemic hormone, systemic antibacterial, and cosmetics, as well as hospital solution. Nang Kuang Pharmaceutical Co., Ltd. was founded in 1963 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71243",
        "website": "http://www.nangkuang.com.tw",
        "market_cap": "Micro Cap"
    },
    "1760.TW": {
        "short_name": "PANION & BF BIOTECH INC",
        "long_name": "Panion & Bf Biotech Inc.",
        "summary": "Panion & Bf Biotech Inc., a biotechnology pharmaceutical company, manufactures and sells various pharmaceutical products in Taiwan. The company offers products in the areas of medical beauty, kidney, respiratory tract, gastrointestinal tract, and diagnosis. It also provides oral drugs and topical preparations; hand and mechanical disinfection, body lotion, and skin disinfection products; and pet health products, including surgical and skin prescriptions. Panion & Bf Biotech Inc. was founded in 1976 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.pbf.com.tw",
        "market_cap": "Small Cap"
    },
    "1762.TW": {
        "short_name": "CHUNGHWA CHEMICAL SYNTHESIS BIO",
        "long_name": "Chunghwa Chemical Synthesis & Biotech Co., Ltd.",
        "summary": "Chunghwa Chemical Synthesis & Biotech Co. Ltd. engages in the research, development, manufacture, and wholesale of active pharmaceutical ingredients (APIs) in Taiwan and the United States. It offers API products, which include immunosuppressant, pain management, oncology, cardiovascular, and other products, as well as peptide drugs. The company also develops bulk pharmaceutical products, such as anti-anxiety agents, antidiabetics, laxatives, antifungals, antihistamines, antiseptics, antiulcerants, cardiovascular drugs, skeletal, muscle relaxants, hypolipaemics, antineoplastic, antihyperlipedemias, and immunosuppressant products, as well as provides research and development, and contract manufacturing services to new drug developers and generic drug companies. In addition, it is developing renal dialysis and gastrointestinal drugs. The company was formerly known as China Chemical Synthesis Industry Co., Ltd. Chunghwa Chemical Synthesis & Biotech Co. Ltd. was founded in 1964 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23850",
        "website": "http://www.ccsb.com.tw",
        "market_cap": "Micro Cap"
    },
    "1783.TW": {
        "short_name": "MAXIGEN BIOTECH INC",
        "long_name": "Maxigen Biotech Inc.",
        "summary": "Maxigen Biotech Inc. engages in the development, manufacture, and marketing of biomedical and skincare products in Taiwan and internationally. The company offers Formagraft, a bone graft substitute; Formasetin, a bone void filler; and intra-articular injections under the ArtiAid, ArtiAid Plus, and ArtiBest names for use in orthopedic area. It also provides Foramic, a bone substitute granule; MaxiBone, a calcium phosphate ceramic; and GingivAid, a collagen dental grafts for use in orthopedic and dental areas. In addition, the company offers FormaAid, a collagen membrane; and E-TECH DENTISTAR II sterilizer and disinfectant for use in dental area, as well as HealiAid, a collagen wound dressing product for use in dental and wound dressing area. Further, it provides ophthalmic viscoelastic device under the ViscAid, PreviscAid, and BiVisc names; and Formaderm, a dermal filler injection for use in plastic surgery. Additionally, the company offers skincare products, including face, neck, body, limbs, and other masks; and make up remover, cleansing, exfoliating, toner, essence, men's care, sunscreen, body care, hand/foot care, and special care products. Maxigen Biotech Inc. was founded in 1998 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.mbi.com.tw",
        "market_cap": "Micro Cap"
    },
    "1784.TWO": {
        "short_name": "BIONET CORP",
        "long_name": "BIONET Corp.",
        "summary": "BIONET Corp. provides cord blood banking services in Taiwan and internationally. The company offers stem cell banking services, including stem cell storage, mesenchymal stem cell storage, dental stem cell storage, adipose stem cell, and PBSC + immune cells; and genetic testing services. It also provides stem anti-aging, rose stem rejuvenation, ultimate protection and repair, and ANIKINE series products. BIONET Corp. was founded in 1999 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11494",
        "website": "http://www.bionetcorp.com",
        "market_cap": "Micro Cap"
    },
    "1786.TW": {
        "short_name": "SCIVISION BIOTECH INC",
        "long_name": "SciVision Biotech Inc.",
        "summary": "SciVision Biotech Inc. manufactures and sells hyaluronic acid products in Taiwan. It offers synovial fluid supplements, facial dermal implants, absorbable adhesion barriers, and intravesical instillation products. The company was founded in 2001 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "806011",
        "website": "http://www.scivision.com.tw",
        "market_cap": "Micro Cap"
    },
    "1789.TW": {
        "short_name": "SCINOPHARM TAIWAN LTD",
        "long_name": "ScinoPharm Taiwan, Ltd.",
        "summary": "ScinoPharm Taiwan, Ltd., together with its subsidiaries, researches and develops, produces, and sells CGMP active pharmaceutical ingredients (API) to pharmaceutical companies in Taiwan, the United States, Europe, India, rest of Asia, and internationally. The company offers custom synthesis services for biochemistry molecules, such as peptides and nucleic acids; generic API manufacturing services; and outsourcing services. It also provides CRAM services, such as chemistry skill, analytical and regulatory, chemical process development, clinical drug substance, and consulting services for the development and manufacturing of clinical, small-scale, and commercial-stage APIs and intermediates. In addition, the company develops peptide synthesis technologies. Further, it develops and manufactures western medicines and other chemical materials, albumin medicines, oligonucleotide medicines, injections, and new small molecule drugs, as well as provides biological technology services and technical services. The company has a strategic alliance with Baxter International Inc. to develop, manufacture, and commercialize of antiemetic drug in chemotherapy for cancer. ScinoPharm Taiwan, Ltd. was founded in 1997 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74144",
        "website": "http://www.scinopharm.com",
        "market_cap": "Small Cap"
    },
    "1795.TW": {
        "short_name": "LOTUS PHARMACEUTICAL CO",
        "long_name": "Lotus Pharmaceutical Co., Ltd.",
        "summary": "Lotus Pharmaceutical Co., Ltd. researches, develops, manufactures, and sells medicines in Taiwan, Korea, the United States, and internationally. Its product portfolio focuses on generics in the fields of oncology, cardiology, nephrology, and central nervous system disease. The company also sells and markets a portfolio of over-the-counter medicines. In addition, it engages in wholesale of cosmetics; retail of clinical machines; biotech technological services; and related consulting services. Lotus Pharmaceutical Co., Ltd. was founded in 1966 and is headquartered in Taipei City, Taiwan. Lotus Pharmaceutical Co., Ltd. is a subsidiary of Alvogen Emerging Markets Holdings Limited.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.lotuspharm.com.tw",
        "market_cap": "Small Cap"
    },
    "1796.TWO": {
        "short_name": "GENEFERM BIOTECHNOLOGY CO LTD",
        "long_name": "GeneFerm Biotechnology Co., Ltd.",
        "summary": "GeneFerm Biotechnology Co., Ltd. develops, manufactures, markets, and sells fermented products in Taiwan and internationally. The company offers a range of raw materials, such as fermented microbial, fungi, and fruits and vegetables products; probiotics; and herbal extracts and animal derived peptides and powders. It also provides ODM, as well as fermentation toll manufacturing services to companies for the development and manufacture of dietary supplements, functional foods, health food products, and various applications. The company was founded in 1999 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11503",
        "website": "http://www.geneferm.com",
        "market_cap": "Nano Cap"
    },
    "1799.TWO": {
        "short_name": "EASYWELL BIOMEDICAL INC",
        "long_name": "Easywell Biomedicals, Inc.",
        "summary": "Easywell Biomedicals, Inc., a biopharmaceutical and medical device company, develops and commercializes medical devices, drug substances, and pharmaceutical dosage forms in Taiwan and internationally. The company offers pharmaceutical products, which include high-barrier generics for the treatment of anti-cough, anti-urinary incontinence, breast cancer in PMS women, anti-depression, prevention of pneumocystis pneumonia, epilepsy, chronic angina, and inflammatory lesions of rosacea; and 505(b)(2) drugs for the treatment of Parkinson's, urinary, and pneumonia diseases. It also provides medical devices, including digital clinical, infrared ear, and non-contact forehead infrared thermometers. The company was formerly known as Actherm Inc. and changed its name to Easywell Biomedicals, Inc. in July 2015. Easywell Biomedicals, Inc. was incorporated in 1998 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30076",
        "website": "http://www.easywellbio.com",
        "market_cap": "Micro Cap"
    },
    "3054.TW": {
        "short_name": "LIWANLI INNOVATION CO LTD",
        "long_name": "LIWANLI Innovation Co., Ltd.",
        "summary": "LIWANLI Innovation Co., Ltd. operates in the biomedical science industry. The company provides products in the areas of nutrition and healthcare. It offers Vigoway and powder collection products for male, female, elderly, and children audience. The company was formerly known as Carry Technology International Co., Ltd. and changed its name to LIWANLI Innovation Co., Ltd. in 2015. LIWANLI Innovation Co., Ltd. was founded in 1991 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.liwanli.com.tw",
        "market_cap": "Micro Cap"
    },
    "3164.TW": {
        "short_name": "GENMONT BIOTECH INC",
        "long_name": "GenMont Biotech Incorporation",
        "summary": "GenMont Biotech Incorporation engages in the research, development, production, and sale of functional probiotic products in Taiwan. It also provides probiotics with special functions; and original formula design and manufacturing, and equipment manufacturing services on health care food, as well as cooperates in the research, production, and clinical trial of various products. The company was founded in 2000 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "741",
        "website": "http://en.genmont.com.tw",
        "market_cap": "Micro Cap"
    },
    "3176.TWO": {
        "short_name": "MEDIGEN BIOTECHNOLOGY CORPORATI",
        "long_name": "Medigen Biotechnology Corp.",
        "summary": "Medigen Biotechnology Corp. focuses on the development of therapies for liver diseases and cancers in Taiwan. It offers cell therapies, such as MAGICELL-NK, which are natural killer cells; and MAGICELL-GDT, which are T cells. The company develops PI-88 (MUPAFOSTAT), which has completed Phase II clinical trial for use as an adjuvant therapy for HCC after curative surgery; and Phase III trial for the adjuvant treatment of patients with hepatitis virus related hepatocellular carcinoma after surgical resection. It also provides OBP-301 that is in a Phase I clinical trials for the treatment of esophageal cancer, and Phase II clinical trials for the treatment of esophageal and gastric cancer. In addition, the company develops human native mAbs for therapeutic applications related to infectious diseases; and molecular diagnostics, vaccine, and generic drugs. Medigen Biotechnology Corp. was founded in 1999 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.medigen.com.tw",
        "market_cap": "Micro Cap"
    },
    "3205.TWO": {
        "short_name": "SAGITTARIUS LIFE SCIENCE CORP",
        "long_name": "Sagittarius Life Science Corp",
        "summary": "Sagittarius Life Science Corporation operates as a biotechnology research company. It engages in the development of Chinese herbal medicine technology platform for the treatment of various diseases. The company was founded in 1987 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.naturalbiokey.com",
        "market_cap": "Nano Cap"
    },
    "3373.TWO": {
        "short_name": "RADIANT INNOVATION INC",
        "long_name": "Radiant Innovation Inc.",
        "summary": "Radiant Innovation Inc. designs and develops infrared technology products. It offers medical infrared thermometers, industrial use infrared thermometers, and CO2 monitors. The company also provides infrared ear and forehead thermometers, multi-function thermometers, disposable probe covers, and TMS products. Radiant Innovation Inc. was founded in 2000 and is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "300",
        "website": "http://www.radiantek.com.tw",
        "market_cap": "Micro Cap"
    },
    "3705.TW": {
        "short_name": "YUNGSHIN GLOBAL HOLDING CORPORA",
        "long_name": "YungShin Global Holding Corporation",
        "summary": "YungShin Global Holding Corporation, through its subsidiaries, produces and sells pharmaceutical products. The company offers medicines and feed additives for swine, ruminants, poultry, pets, and aquatics; APIs, API intermediates, and specialty chemicals, as well as CRO and CMO services; herbal products; health foods; and beauty care products. It also operates EYES testing laboratories for food safety testing; and offers western medicines, agricultural products, chemical intermediates, and over-the-counter medicines. In addition, the company imports and exports pharmaceuticals, APIs, bio-products, and functional food materials; exports medicine-manufacturing machines and components, and medicine/food ingredients, as well as related materials, such as ampoules and vials; imports tablet-analysis equipment; and operates a nursing home for senior care. It operates in Taiwan, China, the United States, Japan, Malaysia, Hong Kong, Singapore, Thailand, Indonesia, Cambodia, and South Africa. The company was founded in 1952 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10541",
        "website": "http://www.yungshingroup.com",
        "market_cap": "Small Cap"
    },
    "4102.TWO": {
        "short_name": "YUNG ZIP CHEMICAL IND CO LTD",
        "long_name": "Yung Zip Chemical Ind. Co., Ltd.",
        "summary": "Yung Zip Chemical Ind. Co., Ltd., a bulk drug manufacturing company, supplies active pharmaceutical ingredients (APIs), API intermediates, and specialty chemicals worldwide. It offers antihypertensive, antiviral, iron chelator, anti-inflammatory, analgesic, antipyretic, anti-fungal, schizophrenia, genital herpes outbreak, hypnotic, and sedative products. The company also offers excipients, such as sodium starch glycolate; and custom research and manufacturing services. The company was founded in 1978 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - General",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "43767",
        "website": "http://www.yungzip.com",
        "market_cap": "Nano Cap"
    },
    "4104.TW": {
        "short_name": "EXCELSIOR MEDICAL CO LTD",
        "long_name": "Excelsior Medical Co., Ltd.",
        "summary": "Excelsior Medical Co., Ltd. distributes medical related systems in Taiwan, China, Japan, Korea, Malaysia, and the Philippines. The company offers equipment for hemodialysis, regular drug used in the medical institution, surgical equipment, and medical assistant electronics; and cosmetic equipment. It also provides medical administration services for single department. The company was founded in 1988 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.excelsiormedical.com.tw",
        "market_cap": "Micro Cap"
    },
    "4105.TWO": {
        "short_name": "TTY BIOPHARM COMPANY LIMITED",
        "long_name": "TTY Biopharm Company Limited",
        "summary": "TTY Biopharm Company Limited, a pharmaceutical company, develops and markets branded generics in Taiwan and internationally. It offers oncology drugs, such as Lipo-Dox, Lonsurf, UFUR, TS-1, Pexeda, Gemmis, Oxalip, Irino, Epicin, Tynen, Anazo, Folina, Folina inj, Thado, Andason, Ivic, Asadin, Leavdo, Painkyl, Megest, Episil, Otril, and Zobonic for anti-cancer therapies. The company also provides anti-infection drugs, including Brosym, Colimycin, Cubicin, Lipo-AB, Metacin, Cepiro, and FlucelvaxQuad. In addition, it offers healthcare related drugs, such as Algitab, Alginos, Bio-Cal Plus, and Sulfin for gastrointestinal, bone, and metabolic healthcare. The company also holds a license to develop and commercialize Remimazolam, an ultra-short-acting intravenous benzodiazepine sedative/anesthetic. The company was founded in 1960 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://eng.tty.com.tw",
        "market_cap": "Small Cap"
    },
    "4107.TWO": {
        "short_name": "BIOTEQUE CORP",
        "long_name": "Bioteque Corporation",
        "summary": "Bioteque Corporation manufactures and sells medical devices in Asia, South America, North America, and internationally. The company provides medical disposables for use in hemodialysis access, endovascular treatment, and other fields. It also offers dialysis products, including hemodialysis bloodlines, A.V.F. needles, and hemodialysis catheters; interventional radiology products, such as pigtail drainage catheter sets, introducer sets, connecting tubes, drainage bags, and radiopaque dilators; urology products comprising ureteral stent sets and urine collection bags; and IV administration products, such as PVC IV infusion bags, PVC bags, and twist-off ports. In addition, the company provides respiratory care products, such as closed suction catheters, and endotracheal tubes; vascular access products comprising angiographic catheters, PTA balloon dilatation catheters, sheath introducers, guidewires, high pressure connecting tubes, PTCA balloon dilatation catheter-rapid exchange products, manifolds, and Y connectors; and medical components, including dialyzer connectors and caps, recirculating connectors with cap, rotating luer lock connectors, pump and T connectors, injection sites, female luers, and luer lock and chamber caps. Bioteque Corporation was founded in 1991 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.bioteq.com.tw/en-global/",
        "market_cap": "Micro Cap"
    },
    "4108.TW": {
        "short_name": "PHYTOHEALTH CORP.",
        "long_name": "PhytoHealth Corporation",
        "summary": "PhytoHealth Corporation researches and develops, manufactures, and sells pharmaceutical drugs, cosmetics, Class B drugs, and dietary supplements in Asia. Its products include PG2 Lyophilized injection for the treatment of cancer related fatigue; EnerCharge, which is used in enhancing physical strength, maintaining good spirits, and enhancing health maintenance activities; NatoCleanse capsules, which helps to reduce the risk of cardiovascular diseases; ReyeasCleanse health food capsules; and EnerCharge, an energy drink. The company also offers precision medical equipment and instruments; and computer-aided diagnosis development and authorization services. PhytoHealth Corporation was founded in 1998 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.phytohealth.com.tw",
        "market_cap": "Micro Cap"
    },
    "4114.TWO": {
        "short_name": "SYNMOSA BIOPHARMA CORP",
        "long_name": "Synmosa Biopharma Corporation",
        "summary": "Synmosa Biopharma Corporation, a specialty pharmaceutical company, researches and develops, manufactures, markets, and distributes pharmaceutical and healthcare products under the Synmosa brand in Taiwan. It offers its products in various therapeutic areas, including cardiovascular, respiratory, urology, sex hormone, and oncology. The company provides its products in various forms, such as effervescent tablets, granules, nasal sprays, metered dosed inhalers, and other forms. It also offers contract manufacturing services. The company also exports its products to South Africa, China, Hong Kong, Thailand, Singapore, Malaysia, Vietnam, Myanmar, Cambodia, Peru, Costa Rica, and Nicaragua. Synmosa Biopharma Corporation was incorporated in 1980 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.synmosa.com.tw",
        "market_cap": "Micro Cap"
    },
    "4116.TWO": {
        "short_name": "BENQ MEDICAL TECHNOLOGY CORPORA",
        "long_name": "BenQ Medical Technology Corporation",
        "summary": "BenQ Medical Technology Corporation provides medical equipment, consumables, and solutions for various medical institutions and professionals worldwide. It offers operating tables, surgical lights, ultrasound systems, medical and protective masks, medical display monitors, and IQOR integrated systems. The company was formerly known as Trident Medical Corp. and changed its name to BenQ Medical Technology Corporation in June 2011. BenQ Medical Technology Corporation was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.benqmedicaltech.com",
        "market_cap": "Micro Cap"
    },
    "4117.TWO": {
        "short_name": "GBC",
        "long_name": "General Biologicals Corporation",
        "summary": "General Biologicals Corporation engages in manufacturing and selling in-vitro diagnostic devices and pharmaceuticals in Taiwan and internationally. It offers real-time PCR products, including IVD kits and genesis products for breast cancer; ELISA Products comprising KIWI products; RIA products for gastrin, hepatitis, and thyroid, as well as vitamin products; rapid tests consisting of blood glucose monitoring systems, and cardiac and tumor markers, as well as products related to drug abuse, fertility hormones, and infectious diseases; lab ware products; and raw materials that comprise antibodies and antigens. The company also provides protein drugs for oral candidiasis; and point of care products for liver fibrosis and breast cancer indications. In addition, it offers products for use in clinics and laboratories for preventives and cancer diagnosis, including skin and oral care, breast cancer and liver related, and advanced cancer diagnosis products, as well as healthcare and education services. General Biologicals Corporation was founded in 1984 and is headquartered in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30076",
        "website": "http://www.gbc.com.tw",
        "market_cap": "Micro Cap"
    },
    "4119.TW": {
        "short_name": "SCI PHARMTECH INC",
        "long_name": "SCI Pharmtech, Inc.",
        "summary": "SCI Pharmtech, Inc. develops, produces, and sells active pharmaceutical ingredients, intermediates, and custom products worldwide. Its active pharmaceutical ingredients include Articaine HCl, Atomoxetine HCl, Bisoprolol Fumarate, Brinzolamide, Clindamycin Palmitate HCl, Divalproex Sodium, Duloxetine HCl, Hydroxychloroquine sulfate, Loxoprofen Sodium, Methylphenidate HCl, Pentobarbital Sodium, Probucol, Propafenone HCl, Sodium Valproate, Thiopental, Valproic Acid, Adenine, Cannabidiol, and Dexmethylphenidate HCl. The company's intermediate products comprise Azetidin-3-ol hydrogenchloride, Diethyl Isobutyl Malonate, Diethyl dipropylmalonate, Diethyl ethyl(1-methylbutyl)malonate, Pyrogallolaldehyde, Benzhydrylamine, 1-Benzhydrylazetidin-3-ol, 1-(2-Hydroxyphenyl)-3-phenylpropan-1-one, N-Methyl-4-piperidinol, Ritalinic acid, d-Ritalinic acid HCl, (1R, 2S)-1 Phenyl-2-(pyrrolldin-1-yl)propan-1-ol HCl, and (1R, 2S)-1 Phenyl-2-(pyrrolldin-1-yl)propan-1-ol. Its intermediate products also consists of (S)-3-(methylmino)-1-(2-thi-enyl)propan-1-ol, (R)-3-(Methylamino)-1-phenylpropanol, (1S,4R)-1-methyl-4-(prop-1-en-2-yl)cyclohex-2-enol, Menthadienol, 5-pentylbenzene-1,3-diol Olivetol, Methyl 2,4-dihydroxy-6-pentylbenzoate, and Ethyl 2,4-dihydroxy-6-pentylbenzoate Ethyl Olivetolate. The company also provides custom manufacturing services. SCI Pharmtech, Inc. was founded in 1987 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33856",
        "website": "http://www.sci-pharmtech.com.tw",
        "market_cap": "Micro Cap"
    },
    "4121.TWO": {
        "short_name": "ROSSMAX INTERNATIONAL",
        "long_name": "Rossmax International Ltd.",
        "summary": "Rossmax International Ltd. develops and supplies healthcare products and solutions in Taiwan. The company offers activity monitor, a device for monitoring and tracking fitness-related metrics, such as distance walked or run, counting steps, and calories burned; body fat monitors that are used to measure body fat, body mass index, lean mass, muscle mass, and water ratio along with body weight; blood pressure monitors; sphygmomanometer, a device that measures blood pressure; stethoscope, an acoustic medical device for auscultation, or listening to the internal sounds; handheld pulse oximeter monitors to measure the amount of oxygen carried in the body; non-contact telephoto thermometers; and blood glucose monitoring system, a medical device for determining the approximate concentration of glucose in the blood. It also provides nebulizer, a drug delivery device used to administer medication; suction unit, a machine used to remove mucus and other bodily fluids; aero spacer, a device used to increase the ease of administering aerosolized medication; peak flow meter, a device used to monitor a person's ability to breathe out air; heating pad for therapy; and anti-decubitus mattresses. In addition, the company operates rossmax healthstyle app, which offers distributors the possibility to manage their store locations, product promotions, and local events; and health station for pharmacies, doctors, and public places. It provides healthcare products in the fields of cardiovascular, diabetes, respiratory, fever, and wound healing diseases. The company also exports its products. Rossmax International Ltd. was incorporated in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.rossmax.com",
        "market_cap": "Micro Cap"
    },
    "4126.TWO": {
        "short_name": "PACIFIC HOSPITAL SUPPLY CO",
        "long_name": "Pacific Hospital Supply Co., Ltd",
        "summary": "Pacific Hospital Supply Co., Ltd., together with its subsidiaries, manufactures, processes, and sells medical disposable products and equipment in Taiwan. The company's disposable medical devices include tubings, bags, bottles, closed wound drainage systems, surgical suction instruments, respiratory therapy products, and other products. It also provides medical gas systems, such as medical gas outlets, secondary equipment, accessories, and pipeline equipment, as well as pipeline system design and maintenance services. Pacific Hospital Supply Co., Ltd. offers its products for health care industry clients. The company also exports its products to approximately 80 countries and regions. Pacific Hospital Supply Co., Ltd. was founded in 1977 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.pahsco.com.tw",
        "market_cap": "Micro Cap"
    },
    "4127.TWO": {
        "short_name": "TIEN LIANG BIOTECH CO LTD",
        "long_name": "Tien Liang BioTech Co., Ltd.",
        "summary": "Tien Liang BioTech Co., Ltd. produces and sells pharmaceutical products in Taiwan and internationally. The company pills for cough, lumbar bone soreness cloth, and stool and gastric problems, as well as liver, bladder, bone pain. It also provides hair removal and skin cream; pain coagulation gel and spray; alcohol, cranberry, and deep-sea oil capsules; pumpkin seed oil; soaps; and liqueur amine-based acid. Tien Liang BioTech Co., Ltd. was founded in 1960 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.tlb.com.tw",
        "market_cap": "Nano Cap"
    },
    "4128.TWO": {
        "short_name": "MICROBIO CO LTD",
        "long_name": "Microbio Co., Ltd.",
        "summary": "Microbio Co., Ltd. develops and sells various therapeutics in Taiwan. It offers nutritional supplements, skin care products, and organic agricultural products. The company also provides MS-20 for ameliorating fatigue and appetite loss associated with cancer chemotherapy; and Herbiron, which reveals symptoms of iron deficiency anemia and menstrual discomfort. Its pre-clinical stage products include SNS01, SNA02, and SNA-03 to treat various types of cancers, as well as SNA-07 for cancer immune therapy; and SNP-630 to treat non-alcoholic steatohepatitis. The company's Phase I clinical trial products consist of OB-318, an anti-cancer drug; MB-110 for the treatment of hepatitis C; SNP-810, an acetaminophen; FB317 to treat moderate-to-severe allergic asthma and chronic idiopathic urticaria; and FB704A for the treatment of rheumatoid arthritis, cancer, and cytokine storms. In addition, it offers FB825, which is in Phase II clinical trial for the treatment of atopic dermatitis, allergic asthma, hyper IgE syndrome, and food allergy. Additionally, the company's Phase III clinical trial products comprise ON101 to treat diabetic foot ulcer; and MB-6 that acts as an adjuvant for metastatic colorectal cancer. Further, the company's discovery stage pipeline includes FB121 for AIDS; SNA01 to treat PD-1 related cancer; SNA02 for cancer immune therapy; and SNS01 for recurrent metastatic non-small cell lung cancer. Microbio Co., Ltd. was founded in 2000 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.microbio.com.tw",
        "market_cap": "Small Cap"
    },
    "4129.TWO": {
        "short_name": "UNITED ORTHOPEDIC CORPORATION",
        "long_name": "United Orthopedic Corporation",
        "summary": "United Orthopedic Corporation engages in the research, development, manufacture, and sale of orthopedic implants and orthopedic surgical instruments. It offers orthopedic surgical equipment and its manufacturing equipment; and special metal and plastics materials, as well as education, service, and support for surgeons and hospital. The company's products portfolio includes artificial hip joints, including partial hip joints, joints for large trochanteric fracture, Moore hip prosthesis, and customized artificial hip joints for individual tumor patients; artificial knee joint, such as artificial knee replacement joint, revision knee replacement system, restricted artificial knee joints, and customized artificial knee joints for individual tumor patients; and spine products consisting of vertebral fixation devices. It Corporation also provides injury and other orthopedic products comprise orthopedic internal fixation, bone plates, bone nails, bone pins, and bone screws; and OEM products, such as orthopedic internal fixation. In addition, the imports and exports its products. It serves in Taiwan, Asia, the United States, Europe, Africa, and Australia. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan. United Orthopedic Corporation is a subsidiary of Chi-Yi Investment Co. Ltd.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23452",
        "website": "http://www.uoc.com.tw",
        "market_cap": "Micro Cap"
    },
    "4129A.TWO": {
        "short_name": "UNITED ORTHOPEDIC CORPORATION",
        "long_name": "United Orthopedic Corporation",
        "summary": "United Orthopedic Corporation engages in the research, development, manufacture, and sale of orthopedic implants and orthopedic surgical instruments. It offers orthopedic surgical equipment and its manufacturing equipment; and special metal and plastics materials, as well as education, service, and support for surgeons and hospital. The company's products portfolio includes artificial hip joints, including partial hip joints, joints for large trochanteric fracture, Moore hip prosthesis, and customized artificial hip joints for individual tumor patients; artificial knee joint, such as artificial knee replacement joint, revision knee replacement system, restricted artificial knee joints, and customized artificial knee joints for individual tumor patients; and spine products consisting of vertebral fixation devices. It Corporation also provides injury and other orthopedic products comprise orthopedic internal fixation, bone plates, bone nails, bone pins, and bone screws; and OEM products, such as orthopedic internal fixation. In addition, the imports and exports its products. It serves in Taiwan, Asia, the United States, Europe, Africa, and Australia. The company was founded in 1993 and is headquartered in New Taipei City, Taiwan. United Orthopedic Corporation is a subsidiary of Chi-Yi Investment Co. Ltd.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23452",
        "website": "http://www.uoc.com.tw",
        "market_cap": null
    },
    "4130.TWO": {
        "short_name": "GENOVATE BIOTECHNOLOGY CO. LTD.",
        "long_name": "Genovate Biotechnology Co., Ltd.",
        "summary": "Genovate Biotechnology Co., Ltd. operates as a specialty pharmaceutical company in Taiwan. It offers central nervous system drugs, cardiovascular system drugs, musculoskeletal system drugs, immune preparation drugs, anti-infective agents, anticancer drugs, anti-viral drugs, respiratory drugs, genitourinary system drugs, and gastrointestinal drugs. The company was founded in 1995 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30351",
        "website": "http://www.genovate-bio.com",
        "market_cap": "Micro Cap"
    },
    "4131.TWO": {
        "short_name": "DR.CHIP BIOTECHNOLOGY INC",
        "long_name": "DR.Chip Biotechnology Incorporation",
        "summary": "DR. Chip Biotechnology Incorporation designs, manufactures, and sells biochips and other related products. The company's products include food safety examination systems, human diagnosis arrays systems, agriculture examination systems, food examination arrays systems, and laboratory instruments, as well as DNA kits. It also offers laboratory planning, design, and other services. The company was founded in 1998 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "411",
        "website": "http://www.bio-drchip.com.tw",
        "market_cap": "Nano Cap"
    },
    "4133.TW": {
        "short_name": "ABNOVA (TAIWAN) CORPORATION",
        "long_name": "Abnova (Taiwan) Corporation",
        "summary": "Abnova (Taiwan) Corporation manufactures and sells various recombinant proteins and antibodies. It offers DNA and RNA, proteins/peptides, SARS-CoV/CoV-2,beads/dyes, lysates/slides, antibody pairs/kits, antibody and tissue arrays, in situ hybridization products, circulating rare cells, systems and automations, GMP and analyte specific reagents, and in vitro diagnostics. The company also provides MaxPab, monoclonal, polyclonal, recombinant, conjugate, secondary/tag, and IHC/pathology antibodies. In addition, the company's integrated solutions and services include gene synthesis and cytogenetics; peptide, protein expression, and conjugations; antibody production; and assay development services. Abnova (Taiwan) Corporation is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.abnova.com",
        "market_cap": "Micro Cap"
    },
    "4142.TW": {
        "short_name": "ADIMMUNE CORPORATION",
        "long_name": "Adimmune Corporation",
        "summary": "Adimmune Corporation manufactures and sells human vaccines in Taiwan. It offers AdimFlu-S, an influenza vaccine; tetanus toxoid alum precipitated products used for prevention of tetanus after injury; Japanese encephalitis vaccines; Trivalent and Tetravalent influenza vaccines; Influenza A (H1N1) virus monovalent vaccines; and Tuberculin, as well as contract manufacturing services. The company was formerly known as Kuo Kwang Serum and Vaccine Manufacture Co., Ltd. and changed its name to Adimmune Corporation in 2001. Adimmune Corporation was founded in 1965 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "409",
        "website": "http://www.adimmune.com.tw",
        "market_cap": "Small Cap"
    },
    "4147.TWO": {
        "short_name": "TAIMED BIOLOGICS INC.",
        "long_name": "TaiMed Biologics Inc.",
        "summary": "TaiMed Biologics Inc., a biotechnology company, develops health-care products. The company develops and markets TMB-355, a humanized monoclonal antibody intravenous infusion for the treatment of HIV-1 infection. It is also developing TMB-355, a humanized monoclonal antibody intramuscular injection, which is in Phase II clinical trial for treating HIV-1; TMB-355, humanized monoclonal antibody intravenous push that is in Phase II clinical trial for the treatment of HIV-1 infection; TMB-365, an anti-CD4 recombinant humanized monoclonal antibody, which is in Phase I clinical trial for treating HIV infections; TMB-Bispecific, a bispecific neutralizing antibody that is in Phase I clinical trial to treat HIV infections; and TMB-ADC, an antibodyÂ\u0096drug conjugate for treating HIV infection, as well as VRC07-523LS, a neutralizing HIV-1 antibody. The company was founded in 2007 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.taimedbiologics.com",
        "market_cap": "Small Cap"
    },
    "4150.TWO": {
        "short_name": "UNICON",
        "long_name": "Unicon Optical Co., Ltd.",
        "summary": "Unicon Optical Co., Ltd. manufactures and sells contact lenses primarily for ODM/OEM market in Taiwan. The company offers disposable contact, coating design color, aspheric, and silicone lenses. It also exports its products to Japan, China, Germany, the Netherlands, Italy, Poland, Russia, Canada, India, South Africa, and Singapore. The company was founded in 1992 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu",
        "zipcode": "30075",
        "website": "http://www.unicon.com.tw",
        "market_cap": "Nano Cap"
    },
    "4152.TWO": {
        "short_name": "TAIWAN LIPOSOME COMPANY LTD",
        "long_name": "Taiwan Liposome Company, Ltd.",
        "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). The BioSeizer lipid formulation technology is designed to enable local sustained release and fast onset of APIs at the site of disease or injury with enhanced pharmacokinetic (PK) control by customization of lipid layers; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III clinical trial for the treatment of knee osteoarthritis pain. The company's product candidates also comprise TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that has completed Phase II clinical trial to treat post-surgical pain; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma; and TLC19 that is in Phase I clinical trial to treat COVID-19.Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.tlcbio.com",
        "market_cap": "Micro Cap"
    },
    "4157.TWO": {
        "short_name": "TAIGEN BIOPHARMACEUTICALS HLDGS",
        "long_name": "TaiGen Biopharmaceuticals Holdings Limited",
        "summary": "TaiGen Biopharmaceuticals Holdings Limited, a pharmaceutical company, develops novel therapeutics for infectious diseases and other indications worldwide. The company develops Taigexyn (Nemonoxacin), a non-fluorinated quinolone antibiotic for the treatment of bacterial infections. It is also developing Taigexyn for treating community-acquired pneumonia and diabetic foot infection; Burixafor, a stem cell mobilizer for stem cell transplantation and chemosenzitization; TG-1000, an influenza antiviral drug for treating influenza A, B; and Furaprevir, a hepatitis C virus protease inhibitor for the treatment of chronic hepatitis C. The company was founded in 2001 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11470",
        "website": "http://www.taigenbiotech.com.tw",
        "market_cap": "Small Cap"
    },
    "4160.TWO": {
        "short_name": "GENETICS GENERATION ADVANCEMENT",
        "long_name": "Genetics Generation Advancement Corp.",
        "summary": "Genetics Generation Advancement Corp. provides genetic testing and informatics services in Taiwan, Asia, Europe, and the Americas. The company offers pre-implantation stage, prenatal stage, newborn medical examination, health management, reproductive medicine, obstetrics and gynecology, neonatology and pediatrics, allergy/immunology/rheumatology, gastroenterology and hepatology, oncology, cardiology, and medical research testing services, as well as counseling services for clinicians and patients to identify genetic risks, genetic testing options, interpret the implications of the test results, and help patients make informed healthcare decisions. It also provides bioinformatics and computational life sciences, materials sciences, laboratory informatics, and enterprise quality management system services. The company was formerly known as Genesis Genetics Asia Corp. and changed its name to Genetics Generation Advancement Corp. in February 2016. Genetics Generation Advancement Corp. was founded in 2008 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.gga.asia",
        "market_cap": "Nano Cap"
    },
    "4161.TWO": {
        "short_name": "BIOPTIK TECH INC",
        "long_name": "Bioptik Technology Incorporation",
        "summary": "Bioptik Technology Incorporation researches, develops, produces, and sells medical devices and reagents in Taiwan and internationally. The company offers EasyMate blood glucose monitoring systems; blood glucose/cholesterol/uric acid monitoring systems and its strips; and hyaluronic acid skin care products. It also provides skin care products and dietary supplements, as well as biodiesel products. The company was founded in 1999 and is headquartered in Zhunan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhunan",
        "zipcode": "35057",
        "website": "http://www.bioptik.com.tw",
        "market_cap": "Nano Cap"
    },
    "4162.TWO": {
        "short_name": "PHARMAENGINE INC",
        "long_name": "PharmaEngine, Inc.",
        "summary": "PharmaEngine, Inc., a biopharmaceutical company, engages in the development of drugs and therapeutic drugs for treating cancer diseases in Taiwan and Europe. It is developing ONIVYDE for patients with gemcitabine-treated metastatic pancreatic cancer; PEP06, which is in Phase I stage for the treatment of cancer; and PEP07, an oral small molecule drug, which is in preclinical development stage to regulate DNA damage response. The company was founded in 2003 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.pharmaengine.com",
        "market_cap": "Small Cap"
    },
    "4167.TWO": {
        "short_name": "SAVIOR LIFETEC CORPORATION",
        "long_name": "Savior Lifetec Corporation",
        "summary": "Savior Lifetec Corporation, a specialty injectable company, produces and supplies sterile APIs and finished dosage formulations. The company offers imipenem and cilastatin sodium, an antibacterial agent for intravenous infusion; and meropenem, a beta-lactamase resistant carbapenem antibiotic for parenteral administration. It also provides ertapenem, a form of carbapenem for use on gram-negative and gram-positive anaerobes and aerobic. The company's pipeline products include SLC-006 for prostate cancer endometriosis uterine leiomyoma; and sterile paliperidone palmitate API for the treatment of schizophrenia. Savior Lifetec Corporation was founded in 2004 and is headquartered in Miaoli County, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "35053",
        "website": "http://www.saviorlifetec.com.tw/en/",
        "market_cap": "Small Cap"
    },
    "4168.TWO": {
        "short_name": "GLYCONEX INCORPORATION",
        "long_name": "GlycoNex Incorporation",
        "summary": "GlycoNex Incorporation develops cancer drugs using glycosphingolipid antigen and human monoclonal antibody technologies in Taiwan. Its technology platform enables glycosphingolipid antigen production and identification; monoclonal antibody production; cancer drug screening; stable cell line production for monoclonal antibody; and pharmacology/pharmacokinetics assessment. The company offers GNX102, a humanized antibody for cancer-specific glycan prevalent on several types of cancer cells, such as gastric, colon, and pancreatic cancer, as well as develops bi-specific antibody generate armed T-cells targeting glycan antigens on cancer cells. GlycoNex Incorporation was founded in 2001 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.glyconex.com.tw",
        "market_cap": "Micro Cap"
    },
    "4171.TWO": {
        "short_name": "GENEREACH BIOTECHNOLOGY CORP",
        "long_name": "GeneReach Biotechnology Corp.",
        "summary": "GeneReach Biotechnology Corp. develops, manufactures, and markets products for applied nucleic acid detection technology primarily in Taiwan. The company offers pathogen detection platforms, including equipment and reagents; and animal use medicines, biotechnology services, medical materials and equipment, and precision instruments. Its products are used in aquaculture, agriculture, food, companion animal, livestock, and human health industries. The company also provides polymerase chain reaction training programs, molecular diagnostic technical solutions, laboratory installation services, OEM/ODM contract manufacturing services, and research collaboration services. GeneReach Biotechnology Corp. was founded in 2004 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.genereach.com",
        "market_cap": "Micro Cap"
    },
    "4172.TWO": {
        "short_name": "InnoPharmax",
        "long_name": "InnoPharmax Inc.",
        "summary": "InnoPharmax Inc., a specialty pharmaceutical company, develops and commercializes products for the treatment of infectious diseases, immunology, oncology, and other specialties in Taiwan. The company offers anti-infection agents, including Bestnem, an imipenem and cilastatin sodium solution that is used intravenous in the treatment of various infections caused by susceptible organisms, such as lower respiratory tract, skin and skin structure, intra-abdominal, gynecologic, or bone and joint infections; and various complicated or uncomplicated urinary tract infections, septicemia, or endocarditis caused by susceptible organisms. It also provides gadopentetate dimeglumine, a contrast medium for magnetic resonance imaging (MRI) of the body after intravenous administration; and gadodiamide, a contrast medium for cranial and spinal MRI, as well as for general MRI of the body after intravenous administration. In addition, the company offers oncology agents comprising Innomustine for the treatment of hodgkin's disease, non-hodgkin's lymphoma, and plasmocytoma, as well as chronic lymphocytic leukemia and breast cancer; and immunological agents that include Cyclosporine A, an immuno-suppresant with a low aqueous solubility used for the inhibition of graft rejection in organ transplant recipients, as well as inpheno tablets. Further, it is developing oncology, cardiovascular, CNS, urology, and contrast agents, as well as agents for metabolic disorders and drugs for rare diseases. The company was founded in 2005 and is based in Taipei City, Taiwan. InnoPharmax Inc. is a subsidiary of Synmosa Biopharma Corporation.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11492",
        "website": "http://www.innopharmax.com",
        "market_cap": "Nano Cap"
    },
    "4173.TWO": {
        "short_name": "ARICH ENTERPRISE CO. LTD.",
        "long_name": "Arich Enterprise Co., Ltd.",
        "summary": "Arich Enterprise Co., Ltd. provides medical sales and promotion, and logistics services in Taiwan. It promotes prescription drugs and over the counter products in drug stores; and medicines to specific specialties in hospitals, clinics, and drug stores. The company also conducts public seminars, promotional activities, long-term educational program, RTD meetings, in-store displays, anti-counterfeit activities, and medical seminars; and offers channel coverage, inventory control system, order follow-up techniques, and market research analysis. Further, the company offers various supply chain services, including international bond, registration, hospital pricing service, warehouse management, transportation and distribution, account receivable management, information linkage, and drug price submission; logistics services consisting of inventory control, quality control procedure, GMP, and bonded warehouse storage; and value-added services, such as re-labeling, temperature-controlled delivery, handling of returned goods/disposable items, batch-tracking management, customer complaints handling, and delivery systems. The company serves medical centers, area hospitals, district hospitals, and general practitioners, as well as chain stores and hyper markets, drug stores, and wholesalers. Arich Enterprise Co., Ltd. was founded in 1960 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23586",
        "website": "http://www.arich.com.tw",
        "market_cap": "Micro Cap"
    },
    "4174.TWO": {
        "short_name": "OBI PHARMA INC",
        "long_name": "OBI Pharma, Inc.",
        "summary": "OBI Pharma, Inc., a bio-pharma company, develops and licenses therapeutic agents for unmet medical needs against cancer in Taiwan. It offers Adagloxad Simolenin (OBI-822), a breast cancer active immunity anti-cancer drug, which is in Phase III for generating antibody against tumor carbohydrate antigen Globo H; OBI-833, an immunity anti-cancer drug, which completed Phase I clinical trial for treating and tracking lung cancer; OBI-866 SSEA-4, an active immuno-oncology drug; OBI-888, a passive immunotherapy monoclonal antibody, which is under Phase I/II human clinical trial targeting Globo H; OBI-999, an antibody drug conjugate that is in Phase II human clinical trial; OBI-898 SSEA4, a passive immunity monoclonal antibody that is in preclinical stage; OBI-998 SSEA4,an antibody small molecule drug complex, which targets toxic drugs to malignant tumors; OBI-3424, a micromolecule chemotherapy prodrug that is in Phase I clinical trial; and OBI-858, a clostridium botulinum toxin. The company was founded in 2002 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.obipharma.com",
        "market_cap": "Small Cap"
    },
    "4175.TWO": {
        "short_name": "MEDFIRST HEALTHCARE SERVICES IN",
        "long_name": "MedFirst Healthcare Services, Inc.",
        "summary": "MedFirst Healthcare Services, Inc. engages in the sale of medical supplies in Taiwan and China. It offers diabetes care, respiratory care, incontinence care, wound dressing, stoma care, pain care, protective gear, home healthcare, and special nutrition products, as well as medical instruments. The company also offers healthcare products consist of beauty care, makeup, and food products, as well as daily supplies and medical books; biomedical products, including health food and drugs; and management consultancy services. In addition, it operates as a contractor for medical supply sales department of hospitals; and agent for foreign medical supplies brand. Further, the company is involved in the management of hospital shopping malls. It sells products through its retail stores and online. MedFirst Healthcare Services, Inc. was founded in 1990 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33375",
        "website": "http://www.medfirst.com.tw",
        "market_cap": "Micro Cap"
    },
    "4188.TWO": {
        "short_name": "AMCAD BIOMED CORPORATION",
        "long_name": "AmCad BioMed Corporation",
        "summary": "AmCad BioMed Corporation develops computer-assisted detection and diagnosis (CAD) software devices primarily in Taiwan. Its products include AmCAD-UT Detection, a CAD device for ultrasound images of thyroid nodules; and AmCAD-UO, a solution for obstructive sleep apnea detection. The company is also developing AmCAD-CA, a software designed for analyzing digital cytological images; AmCAD-US, a software device for visualizing and quantifying statistical distributions of backscattered signals echoed by tissue compositions in the body from FDA-cleared ultrasound systems; and AmCAD-UV, a software device that is used for quantifying and classifying the ultrasonic color intensity data acquired from FDA-cleared ultrasound systems and displaying the noise-reduced color-coded pulsatile signals. The company was founded in 2008 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://amcad.com.tw",
        "market_cap": "Nano Cap"
    },
    "4191.TWO": {
        "short_name": "PHD",
        "long_name": "Pharmadax Inc.",
        "summary": "Pharmadax Inc. engages in the pharmaceutical research and development business in Taiwan, the Unites States, China, and internationally. It primarily focuses on the development of oral solid controlled-release technology pellets. The company offers Glyburide, Quetiapine Fumarate ER, and Metoprolol Succinate ER tablets, as well as contract development and/or contract manufacturing services for solid orals. It provides its products for a range of therapeutic areas, including schizophrenia, hypertension, diabetes, cold, Parkinson's disease, ADHD, chronic hepatitis, overactive bladder, and muscle relaxant. The company was founded in 2008 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23553",
        "website": "http://www.pharmadax.com",
        "market_cap": "Micro Cap"
    },
    "4192.TWO": {
        "short_name": "SYNCORE BIOTECHNOL",
        "long_name": "SynCore Biotechnology Co.,Ltd",
        "summary": "SynCore Biotechnology Co.,Ltd, a biopharmaceutical company, engages in the research and development, manufacture, and marketing of drugs in the areas of oncology, ophthalmology, dermatology, and infectious diseases in Taiwan and China. The company offers SB03-Veregen, an ointment for the treatment of patients with external genital and perianal warts; and distributes cameras under the epiCam name that is used in recording the progress of ophthalmology diseases. It is also involved in the development of SB01, an injectable anti-cancer new ingredient (NCE) that is in Phase II clinical trial for the treatment of head and neck cancer; SB02, an anti-cancer NCE, which is in Phase I clinical trial for use in the treatment of stomach cancer; SB04 that is in Phase II/III clinical trials for the treatment of patients with dry age-related macular degeneration; and SB05, a composition of cytostatic drug paclitaxel combined with neutral and positive lipids, which is in Phase III clinical trial for the treatment of patients with triple negative breast cancer and pancreatic cancer. The company has partnerships with Medigene AG; MacuCLEAR Inc.; Y-YBAR; Epipole Ltd.; Sinphar Pharmaceutical Co., Ltd.; and The National Health Research Institutes. The company was founded in 2008 and is headquartered in Yilan, Taiwan. SynCore Biotechnology Co.,Ltd is a subsidiary of Sinphar Pharmaceutical Co., Ltd.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yilan City",
        "zipcode": "269",
        "website": "http://www.syncorebio.com",
        "market_cap": "Micro Cap"
    },
    "4194.TWO": {
        "short_name": "HSHC",
        "long_name": "Holy Stone Healthcare Co., Ltd.",
        "summary": "Holy Stone Healthcare Co., Ltd. engages in the development of therapeutics in Taiwan. The company offers RenehaVis, a product designed to relive pain and stiffness of the knee joint; SportVis, a treatment to relive the pain and optimize the recovery of tendon and ligament injuries; TRUD, a treatment that allows mucosal tissue to heal naturally and reduces the symptoms of ulcerative colitis; and GAF, a treatment for anal mucosal lesions. It is also developing IBD98-M, which is in Phase IIa clinical trials for the treatment of inflammatory bowel diseases; and CA102N, which is in Phase I clinical trials for the treatment of colorectal cancer. In addition, it also develops ND108E for the treatment of alzheimer's disease; and CA102L, a novel and small molecule conjugated therapeutic agent to treat lymphoma and multiple myeloma. The company was founded in 2001 and is headquartered in Taipei, Taiwan. Holy Stone Healthcare Co., Ltd. is a subsidiary of Holy Stone Enterprise.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11493",
        "website": "http://www.hshc.com.tw",
        "market_cap": "Micro Cap"
    },
    "4197.TWO": {
        "short_name": "VIS",
        "long_name": "Visgeneer Inc.",
        "summary": "Visgeneer Inc., a biotech company, develops and produces biomedical products in the fields of medical device, cosmetics/skin care, bacterial fermentation, and cancer gene identification. The company offers blood glucose and ketone, and uric acid monitoring systems. It also provides multi-active cream gels, wrinkle reducing eye creams, hydro complete emulsions, revitalizing essences, toning lotions, amino acid cleansing creams, multi-perfection firming gel creams, aqua emulsions, herbal gel lotions, anti- aging creams, brightening serums, revitalizing lotions, masks, UV shield creams, dark spot corrector pearl whitening cream, anti-acne complexes, glucosamine creams, essences, hyaluronic acid and intensive whitening essences, rejuvenating essence creams, and anti-aging time complex capsules under Coresence name. Visgeneer Inc. is based in Hsinchu City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "30094",
        "website": "http://www.visgeneer.com.tw",
        "market_cap": "Nano Cap"
    },
    "4726.TWO": {
        "short_name": "MYCENAX BIOTECH INC.",
        "long_name": "Mycenax Biotech Inc.",
        "summary": "Mycenax Biotech Inc. develops and manufactures biopharmaceutical products from mammalian cells and microbials in Taiwan, European, and the United States markets. The company develops monoclonal antibodies, bi-specific antibodies, fc-fusion proteins, recombinant proteins, peptides, protein conjugates (non-toxin), antibody-cell conjugates, enzymes, antigen-binding fragments (Fab), single-chain variable fragments (ScFv), plasmids, DNA vaccines, and glycoproteins. It also provides process development and scale-up, GMP manufacturing, and analytical services, as well as manufacturing technologies and in-house services. The company was founded in 2001 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": "35053",
        "website": "http://www.mycenax.com.tw",
        "market_cap": "Micro Cap"
    },
    "4728.TWO": {
        "short_name": "SUNMAX BIOTECHNOLOGY CO LTD",
        "long_name": "Sunmax Biotechnology Co., Ltd.",
        "summary": "Sunmax Biotechnology Co., Ltd., a biomedical company, develops, manufactures, and markets medical-grade collagen-based medical devices in Asia. The company offers Porcogen, a sterile purified collagen solution for medical device, tissue engineering, and research purposes; and dermal fillers, such as Sunmax collagen implant I-Plus and Sumax collagen implant I for the correction of facial defects, such as the fill up of wrinkles. It also provides Sunmax collagen dental bone graft, Sunmax collagen dental membrane, and Sunmax dental bone graft granules, which are used in the augmentation or reconstructive treatment of the alveolar ridge. In addition, the company offers Sunmax collagen bone graft matrix that provides a bone void filler that is resorbed and replaced with bone during the healing process; and skincare products comprising Sunmax 6 collagen facial cleanser, Sunmax 7 collagen essence, Sunmax 8 active collagen essence mask, Sunmax 9 collagen refining cream, Sunmax 10 collagen eye renewal cream, Sunmax 11 collagen moisturizing cream, Sunmax 15 Collagen MesoRepair, and Sunmax Collagen Peptide that are used as aftercare of dermal filler treatment. Sunmax Biotechnology Co., Ltd. was founded in 2001 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "744",
        "website": "http://www.sunmaxbiotech.com",
        "market_cap": "Micro Cap"
    },
    "4732.TWO": {
        "short_name": "NBM",
        "long_name": "NatureWise Biotech & Medicals Corporation",
        "summary": "NatureWise Biotech & Medicals Corporation engages in the development of therapeutic drugs in Taiwan. It offers LipoCol Forte, a capsule for hypercholesterolemia and hypertriglyceridemia; PPL products comprise Taiwanese Green Propolis; and NBM-BMX an oral Softgel capsule to treat cancer. The company was founded in 2000 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.naturewise.com.tw",
        "market_cap": "Nano Cap"
    },
    "4735.TWO": {
        "short_name": "AVITA CORPORATION",
        "long_name": "AViTA Corporation",
        "summary": "AViTA Corporation manufactures and sells home healthcare products for clinical and personal use. It offers various OEM/ODM solutions. The company's products include non-contact thermometers, infrared/forehead thermometers, arm and wrist type blood pressure monitors, and electronic lice combs. AViTA Corporation was founded in 1996 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24158",
        "website": "http://www.avita.com.tw",
        "market_cap": "Micro Cap"
    },
    "4736.TWO": {
        "short_name": "TAIDOC TECHNOLOGY CORPORATION",
        "long_name": "TaiDoc Technology Corporation",
        "summary": "TaiDoc Technology Corporation manufactures and markets medical devices worldwide. It offers diagnostics products, including blood glucose and multiple parameters monitoring systems, point of care testing devices, lancet and lancing devices, and vet health care products comprise blood glucose and calcium meters, non-contact forehead thermometers, and blood ketone meters; and medical devices, such as nebulizers, thermometers, blood pressure monitors, vital sign monitors, medical kiosk, pulse oximeters, and weight scale. The company also provides telehealth remote monitoring devices and smartphone applications; and Covid-19 antigen rapid test kits. In addition, it offers services for regulatory professionals, as well as in the areas of clinical suggestions, engineering resources, and manufacturing systems. The company was founded in 1998 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24888",
        "website": "http://www.taidoc.com",
        "market_cap": "Small Cap"
    },
    "4737.TW": {
        "short_name": "BIONIME CORPORATION",
        "long_name": "Bionime Corporation",
        "summary": "Bionime Corporation manufactures and sells medical instruments in Algeria, the United States, Switzerland, China, and internationally. It offers medical testing blood glucose management products for self-monitor and hospital/clinic use, as well as accessories, such as test strips and lancing devices. The company was founded in 2003 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40242",
        "website": "http://www.bionime.com",
        "market_cap": "Micro Cap"
    },
    "4743.TWO": {
        "short_name": "ONENESS BIOTECH CO LTD",
        "long_name": "Oneness Biotech Co., Ltd.",
        "summary": "Oneness Biotech Co., Ltd. operates as a biopharmaceutical company in Taiwan. The company develops ON101, which is in Phase III clinical trials for treating chronic diabetic foot ulcers; and OB318, an anti- liver cancer drug that completed Phase I clinical trials. It is also developing SNS01, SNA02, and SNA03 that are in pre-clinical stage for the treatment of cancer; FB704A that is in Phase I clinical trial for the treatment of rheumatoid arthritis, cancer, and cytokine storms; and FB825, which is in Phase II clinical trial for treating allergic diseases and asthma. The company was founded in 2008 and is based in Taipei City, Taiwan. Oneness Biotech Co., Ltd. operates as a subsidiary of Microbio Co., Ltd.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.onenessbio.com.tw",
        "market_cap": "Mid Cap"
    },
    "4746.TW": {
        "short_name": "FORMOSA LABORATORIES INC",
        "long_name": "Formosa Laboratories, Inc.",
        "summary": "Formosa Laboratories, Inc. produces and sells active pharmaceutical ingredients (APIs) worldwide. The company offers APIs in the areas of anticancers, anti-inflammatory and analgesic agents, MRI enhancing agents, polymeric drugs, CNS agents, immunomodulators, respiratory agents, steroids, vitamin D derivatives, and antibiotics. It also provides contract development and manufacturing services; solutions for manufacturing antibody-drug conjugates; and injectable manufacturing services. The company was founded in 1995 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33842",
        "website": "http://www.formosalab.com",
        "market_cap": "Small Cap"
    },
    "4911.TWO": {
        "short_name": "G&E HERBAL BIOTECHNOLOGY CO. LT",
        "long_name": "G&E Herbal Biotechnology Co., Ltd.",
        "summary": "G&E Herbal Biotechnology Co., Ltd., a biotechnology company, focuses on the development and commercialization of novel botanical extraction technology and products in Taiwan. It offers hepato protective agent capsules for the treatment of chronic liver inflammation, cirrhosis, hepatitis, and other liver diseases; botanical anti-aging cosmetic products; and SR-100 skin repair gel. The company also provides botanical healthcare products, such as Astragali Radix for physical strength; Goji for eyes; and Prosta capsule for regulating physiological functions and boosting metabolism, as well as offers adult products. In addition, it is developing Solarise injection for the treatment of gynecological, head, and neck cancer; Apocin capsule for the treatment of lung/breast cancer; and SR-T100 Gel. Further, the company manufactures technology development for various dietary supplements, as well as provides technical advisory services to other biotechnology organizations. G&E Herbal Biotechnology Co., Ltd. was founded in 2002 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "70955",
        "website": "http://www.geherbs.com.tw",
        "market_cap": "Micro Cap"
    },
    "546.SI": {
        "short_name": "$ Medtecs Intl",
        "long_name": "Medtecs International Corporation Limited",
        "summary": "Medtecs International Corporation Limited, an integrated healthcare products and services provider, manufactures and distributes medical consumables for healthcare distributors, pharmaceutical companies, and hospital groups worldwide. It operates through Manufacturing, Hospital Services, and Distribution segments. The Manufacturing segment produces and sub-contracts a range of medical consumables, including patients' apparels, disposable surgical masks, boot covers and surgical gowns, underpads, adult diapers, crochet blankets, bed linens, and medical bandages. The Hospital Services segment provides laundry and leasing services, including hospital linen rental and laundry, management of hospital laundry facilities, hospital automation, and other non-core hospital functions for hospitals in Taiwan and the Philippines. The Distribution segment markets Medtecs-branded medical consumables to hospitals, pharmacies, and other end users in the Asia Pacific. This segment also supplies other branded medical supplies and equipment comprising wheel chairs, syringes, nebulizers, and blood pressure monitors. Medtecs International Corporation Limited also manufactures, leases, trades in, and sells woven and knitted fabrics, and other made-up articles of textile products; trades in hospital textiles and garments, pillow cases, bed sheets, gowns, and other apparel products; and provides garters and other garment products. It also engages in the subleasing activities; and manufacture and supply personal protective equipment. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.medtecs.com",
        "market_cap": "Small Cap"
    },
    "6446.TWO": {
        "short_name": "PHARMAESSENTIA CORP",
        "long_name": "PharmaEssentia Corporation",
        "summary": "PharmaEssentia Corporation engages in the research, development, production, and sale of therapeutic products for the treatment of human diseases. Its products include ropeginterferon alfa-2b that is used for the treatment of polycythemia vera, essential thrombocythemia, and hepatitis B and C; and Anti-PD-1 antibody for the treatment of cancer. The company also licensed to develop Oraxol for the treatment of breast, advanced gastric, and esophageal cancer; KX01 for the treatment of psoriasis and actinic keratosis. It also focuses on the drug research and development programs in the areas of hematology, infectious disease, oncology, and dermatology. The company has a research collaboration agreement with Axis Therapeutics Limite for the development of T Cell Receptor-T therapy based on the T cell receptor affinity enhancing specific T cell therapy technology platform. PharmaEssentia Corporation was founded in 2003 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.pharmaessentia.com",
        "market_cap": "Small Cap"
    },
    "6461.TWO": {
        "short_name": "INTECH BIOPHARM LTD",
        "long_name": "Intech Biopharm Corporation",
        "summary": "Intech Biopharm Corporation focuses on developing and manufacturing generic drugs to treat respiratory diseases. It owns iLEF (inhaled low ethanol formulation), a metered dose inhaler platform to treat asthma and chronic pulmonary obstructive disease; and dry powder inhaler. The company offers its products under the SYN006, SYN010, SYN007, Synflutide, Duasma, Synvent, and SYN011 names. Intech Biopharm Corporation is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.intechbiopharm.com",
        "market_cap": "Micro Cap"
    },
    "6472.TWO": {
        "short_name": "BORA PHARMACEUTICALS CO LTD",
        "long_name": "Bora Pharmaceuticals Co., LTD.",
        "summary": "Bora Pharmaceuticals Co., LTD. engages in the research, development, production, marketing, sale, and distribution of pharmaceutical products worldwide. It manufactures and sells generic, brand, and over-the-counter (OTC) drugs. The company is involved in contract development and manufacturing; consumer healthcare and OTC; and prescription drugs businesses. It also provides clinical and commercial manufacturing services, including solvent manufacturing; solid and liquid dosage forms; extrusion spheronization; immediate and extended release; core, sugar-coated, and film-coated tablets; fixed-dose combination products; and granules, and liquids sachet/stick pack filling. In addition, the company offers pharmaceutical development services, such as liquid and solid dosage forms, and immediate and modified release, analytical method development and validation; packaging and serialization services, which include bottle and blister packaging, and sachets; and raw materials and finished products testing, and analytical techniques services, as well as method verification, validation, and transfer. Further, it provides OTC medicines, foods and vitamins supplements; and skincare products. Additionally, the company also offers market analysis, drug and regulatory related services, price development, GDP warehousing, distribution, packaging, marketing planning, and sales services. The company's sales and distribution network comprises medical centers, hospitals, clinics, pharmacies, drug stores, CVS, and specialty channels. Bora Pharmaceuticals Co., LTD. was founded in 2007 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.bora-corp.com",
        "market_cap": "Small Cap"
    },
    "6491.TW": {
        "short_name": "PEGAVISION CORPORATION",
        "long_name": "Pegavision Corporation",
        "summary": "Pegavision Corporation manufactures and sells various soft contact lenses and medical optic devices under the Pegavision brand in Taiwan. The company was incorporated in 2009 and is based in Taoyuan City, Taiwan. Pegavision Corporation is a subsidiary of Pegatron Corp.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "333",
        "website": "http://www.pegavision.com",
        "market_cap": "Small Cap"
    },
    "6492.TWO": {
        "short_name": "SENHWA BIOSCIENCES INC",
        "long_name": "Senhwa Biosciences, Inc.",
        "summary": "Senhwa Biosciences, Inc., a clinical-stage biopharmaceutical company, identifies and develops therapies for the treatment of cancer. The company is developing CX-4945 that is in phase I/II clinical trial in combination with gemcitabine plus cisplatin for the treatment of patients with cholangiocarcinoma; CX-5461 AU, a phase I, open-label, dose escalation, safety, pharmacokinetic, and pharmacodynamics study of intravenously administered CX-5461 in patients with advanced hematologic malignancies; and CX-5461 CA, which is in phase I clinical trial in patients with solid tumors and breast cancer. It is also developing CX-4945-07, which is in phase I clinical trial, multi-center, open-label, treatment duration increment, expansion, safety, and pharmacodynamic study of CX-4945 administered orally twice daily to patients with advanced basal cell carcinoma; and CX-4945 PBTC-053, a pediatric brain tumor consortium that is in phase I/II clinical trial and surgical study of CX-4945 in patients with recurrent SHH medulloblastoma. The company was founded in 2012 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23143",
        "website": "http://www.senhwabio.com",
        "market_cap": "Small Cap"
    },
    "6493.TWO": {
        "short_name": "TTBIO",
        "long_name": "Ttbio Corp.",
        "summary": "Ttbio Corp. manufactures and sells medical instruments under the TTBIO brand name in Taiwan and internationally. The company offers high and low speed hand piece products, dental spare parts, service rotors, maintenance units, and electric hand piece systems. It also provides precision machined parts and components to various industries, including medical, automotive, aerospace, computer components, security, maintenance parts, and custom machining. The company was founded in 2012 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40755",
        "website": "http://www.ttbio.com",
        "market_cap": "Nano Cap"
    },
    "6496.TWO": {
        "short_name": "EXCELSIOR BIOPHARMA INC",
        "long_name": "Excelsior Biopharma Inc.",
        "summary": "Excelsior Biopharma Inc. develops pharmaceutical products in Taiwan. The company offers prescription drugs, over-the-counter drugs, medical devices, healthcare food products, medical supplies, and skin products. It provides its products for the therapeutic areas, such as pediatrics, gastroenterology, neurology, cardiology, dermatology, medical toxicology, dentistry, obstetrics and gynecology, anesthesiology, orthopedics, neonatology, oncology, pulmonary medicine, nephology, and others, etc. The company also offers test kits under the Actim name to detect inflected C-reactive protein, influenza virus, colorectal cancer, acute pancreatitis, preterm birth, and early water-breaking. In addition, it provides oral care products, including oral cleansing toothpaste, mouthwash and gel; and health food and cosmetic products. Excelsior Biopharma Inc. also exports its products. The company was formerly known as Excelsior Enterprise Co., Ltd. Excelsior Biopharma Inc. was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.excelsiorgroup.com.tw",
        "market_cap": "Nano Cap"
    },
    "6499.TWO": {
        "short_name": "MEDEON BIODESIGN INC",
        "long_name": "Medeon Biodesign, Inc.",
        "summary": "Medeon Biodesign, Inc. develops and markets medical device solutions in Taiwan. It focuses on developing devices for minimally invasive surgeries, such as Duett, a vascular graft system; ClickClean, a solution to view throughout laparoscopic surgeries; AbClose to prevent port site herniation caused by improper closure; Mercury to widen the narrowed prostatic urethra tissue creating an open urethral lumen for normal urinary flow; PUMA, a solution to treat orthopedic extremity injuries; and Cross-Seal, a large-bore closure device. The company was founded in 2012 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11170",
        "website": "http://www.medeonbio.com",
        "market_cap": "Micro Cap"
    },
    "6527.TWO": {
        "short_name": "CRYSTALVUE MEDICAL CO LTD",
        "long_name": "Crystalvue Medical Corporation",
        "summary": "Crystalvue Medical Corporation designs, manufactures, and sells medical devices. Its products include OCT devices, fundus cameras, chin rest devices, digital microscope cameras, tonometers, nucleic acid extraction system, polymerase chain reaction system, gastrointestinal endoscopic disposable devices, etc. The company offers automated retina cameras; FundusVue, a diagnosis instrument for ophthalmologists to inspect and record the patients' retina; and TonoVue, a diagnosis instrument to measure IOP of the patient. Crystalvue Medical Corporation was founded in 2009 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33072",
        "website": "http://www.crystalvue.com.tw",
        "market_cap": "Nano Cap"
    },
    "6535.TWO": {
        "short_name": "LUMOSA THERAPEUTICS CO LTD",
        "long_name": "Lumosa Therapeutics Co., Ltd.",
        "summary": "Lumosa Therapeutics Co., Ltd. researches and develops drugs for the neurological and inflammatory diseases in Taiwan. The company offers LT - 1001, an analgesic injection that has completed Phase II/III clinical trials for severe pain relief after surgery. It is also developing LT3001, which is in Phase II clinical trial for the treatment of acute ischemic stroke; LT5001 that is in Phase II clinical trial for uremic pruritus; and LT2003, which is in pre-clinical stage for the treatment of oncology. The company was incorporated in 2000 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.lumosa.com.tw",
        "market_cap": "Micro Cap"
    },
    "6547.TWO": {
        "short_name": "MEDIGEN VACCINE BIOLOGICS CORPO",
        "long_name": "Medigen Vaccine Biologics Corporation",
        "summary": "Medigen Vaccine Biologics Corporation, a biopharmaceutical company, develops and produces vaccines and biologics for unmet medical needs in Taiwan and internationally. The company is developing A 71 to fight against EV71, a member of genus enterovirus; H5N1 and H7N9 mockup vaccines for pandemic influenza; and dengue vaccines. It is also developing biosimilar Palivizumab to prevent respiratory syncytial virus. The company has a collaboration with Dynavax Technologies Corporation to develop a vaccine candidate to protect against COVID-19; and a partnership with BlueWillow Biologics, Inc. to develop intranasal vaccine for SARS-CoV-2. Medigen Vaccine Biologics Corporation was founded in 2012 and is based in Taipei, Taiwan. Medigen Vaccine Biologics Corporation operates as a subsidiary of Medigen Biotechnology Corp.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.medigenvac.com",
        "market_cap": "Small Cap"
    },
    "6549.TWO": {
        "short_name": "TaiwanJ",
        "long_name": "TaiwanJ Pharmaceuticals Co., Ltd.",
        "summary": "TaiwanJ Pharmaceuticals Co., Ltd., a specialty pharmaceutical company, develops and commercializes small molecules for chronic organ inflammation of metabolic, autoimmune, and infectious etiologies in Taiwan. The company also develops JKB-122 and JKB-121; and novel chemical entities for therapy to address chronic liver diseases and allergy/asthma. Its products target diseases that include liver inflammation/liver fibrosis, non-alcoholic steatohepatitis, non-alcoholic fatty liver disease, autoimmune diseases, asthma, and atopic dermatitis. The company was incorporated in 2011 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30261",
        "website": "http://www.taiwanj.com",
        "market_cap": "Nano Cap"
    },
    "6564.TWO": {
        "short_name": "ENIM",
        "long_name": "Enimmune corporation",
        "summary": "Enimmune corporation operates as a biopharmaceutical Research and development, and marketing company in Taiwan. Its products include Tuberculin PPD RT23 SSI, an approved drug for tuberculin test to determine whether the patient is infected with tuberculosis. The company is also involved in the development of vaccines to prevent various infectious diseases, such as enterovirus, pneumonia, norovirus, dengue fever virus, Middle East respiratory syndrome coronavirus, etc. Enimmune corporation was founded in 2014 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": null,
        "website": "http://www.enimmune.com.tw",
        "market_cap": "Micro Cap"
    },
    "6566.TWO": {
        "short_name": "CYB",
        "long_name": "Chuang Yi Biotech co., ltd.",
        "summary": "Chuang Yi Biotech Co., ltd. engages in the research, development, and marketing of medicines and health foods in Taiwan. The company offers products in the areas of gastrointestinal, metabolism, and regular health care, as well as allergy reducing products. Chuang Yi Biotech Co., ltd. Swas founded in 2011 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.cybiotech.com.tw",
        "market_cap": "Nano Cap"
    },
    "6569.TWO": {
        "short_name": "ONYX HEALTHCARE INC",
        "long_name": "Onyx Healthcare Inc.",
        "summary": "Onyx Healthcare Inc., a professional medical IT company, provides medical PC solutions for the hospital/clinical IT market worldwide. It offers mobile cart computers, ubiquitous power solutions, remote management software, mobile medical tablets, surgical workstations, operating room solutions, fanless slim PPCs, medical AIO solutions, bedside infotainment, medical display solutions, MedPC box PCs, and medical slim mini-ITX MBs. The company also offers digital operation rooms, AI and robots, power management solutions, smart ward solutions, nurse stations, telecare and telemedicine, remote system management, and emergency medical services. In addition, it provides OEM/ODM services, such as planning, designing, validation, integration, production, after-sale, software, and design capability. The company was founded in 2010 and is headquartered in New Taipei City, Taiwan. Onyx Healthcare Inc. is a subsidiary of ASUS Group.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "231",
        "website": "http://www.onyx-healthcare.com",
        "market_cap": "Micro Cap"
    },
    "6572.TWO": {
        "short_name": "PlexBio",
        "long_name": "PlexBio Co., Ltd.",
        "summary": "PlexBio Co., Ltd. designs, develops, and manufactures multiplexing platforms and assays to enable genetic research and clinical cancer diagnostics. It offers IntelliPlex SARS-CoV-2/Flu Kit, an in vitro diagnostic device; IntelliPlex SARS-CoV-2 Detection Kit, an automated solution for testing during the coronavirus disease; IntelliPlex Lung Cancer Panel-cfDNA, a molecular assay for mutations; IntelliPlex Lung Cancer Panel Â\u0096 cfRNA, which detects various variants of the ALK, ROS1, RET, NTRK1, and MET genes using cell-free RNA derived from plasma of patients with NSCLC; IntelliPlex Lung Cancer Panel, which detects various DNA mutations; IntelliPlex BRAF V600 Mutation Kit, a single well solution for mutations; IntelliPlex EGFR Mutation Kit, a molecular assay for somatic mutations; IntelliPlex KRAS Mutation Plus Kit, a solution for clinically actionable mutations; IntelliPlex NRAS Mutation Kit, a single well mutation kit; IntelliPlex PIK3CA Mutation Kit, a PCR mutation kit; IntelliPlex ALK Rearrangement Kit, a single well solution for actionable ALK gene rearrangements; IntelliPlex RET/NTRK1 Rearrangement Kit, a single well RET and NTRK1 gene rearrangement kit; IntelliPlex ROS1 Rearrangement Kit, a molecular assay for clinical actionable gene rearrangements; IntelliPlex Food Testing Kit for Dairy, a single well solution for bacteria; and pCode Coupling Buffer Set, a solution for coupling process. The company also offers IntelliPlex 1000 pCode Processor, a hybridization, washing, incubation, and labeling solution; PlexBio 100 Fluorescent Analyzer, an optical imaging system; DigiPlex Thermocycler, an instrument for PCR amplification; pCode MicroDisc, a solution for multiplexing applications; PlexBio Magnetic Stand, a solution for paramagnetic pCode precipitation; pCode Coupling Buffer Set, a solution to-use buffers; and DeXipher software for data analysis and interpretation. PlexBio Co., Ltd. was founded in 2009 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11491",
        "website": "http://www.plexbio.com",
        "market_cap": "Micro Cap"
    },
    "6575.TWO": {
        "short_name": "SyneuRx",
        "long_name": "SyneuRx International (Taiwan) Corp.",
        "summary": "SyneuRx International (Taiwan) Corp. develops drugs for the treatment of unmet medical needs in central nervous system disorders in Taiwan. Its pipeline under clinical development includes SND11, which is in Phase IIb/III clinical trial for the treatment of adolescent schizophrenia; SND12 that is in Phase IIb/III clinical trial for therapy on refractory schizophrenia; and SND13, which is in Phase IIb/III clinical trial for the treatment of adult schizophrenia. The company is also developing SND14, which is in Phase IIb/III clinical trial to treat early dementia; SND51 that is in Phase II clinical trial for dementia and psychosis symptoms; SNG12, which is in Phase III clinical trial for the treatment of depression and suicidality; SNA1 that is in Phase II clinical trial to treat refractory depression; and SNB01, which is in Phase II clinical trial for the treatment of COVID-19. SyneuRx International (Taiwan) Corp. was founded in 2013 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.syneurx.com",
        "market_cap": "Micro Cap"
    },
    "6576.TWO": {
        "short_name": "FORESEE PHARMACEUTICALS CO LTD",
        "long_name": "Foresee Pharmaceuticals Co., Ltd.",
        "summary": "Foresee Pharmaceuticals Co., Ltd., clinical-stage pharmaceutical company, engages in the development and commercialization of drugs in Taiwan and Europe. The company's stabilized injectable formulation pipeline includes FP-001, which completed Phase III clinical study for the treatment of advanced stage prostate cancer; FP-004 that is in preclinical stage to treat opioids use disorder; FP-011 and FP-014, a long-acting sustained release dosage form for the treatment of breast cancer/prostate cancer; FP-015, for the treatment of neurological diseases; and FP-002 for the treatment of acromegaly, as well as FP-008 for the treatment of diabetic retinopathy. Its new chemical entity pipeline products consists of FP-020 to treat alport syndrome; FP-025, a selective matrix metalloproteinase-12 inhibitor, which is in Phase II clinical trial for the treatment of asthama, chronic obstructive pulmonary diseases, and emphysema or sarcoidosis; and FP-045, a small molecule mitochondrial aldehyde dehydrogenase 2 that completed Phase I clinical study for the treatment of peripheral arterial disease, fanconi anemia, and cardiorenal metabolic diseases. The company's strategic partners include Pierre Fabre Medicament Production and ScinoPharm. Foresee Pharmaceuticals Co., Ltd. was founded in 2013 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.foreseepharma.com",
        "market_cap": "Small Cap"
    },
    "6580.TWO": {
        "short_name": "TaiRx",
        "long_name": "TaiRx, Inc.",
        "summary": "TaiRx, Inc., a pharmaceutical company, focuses on the development and commercialization of therapeutics for the treatment of cancer and other diseases. The company's products under development include CVM-1118, an oral anti-cancer drug that is Phase II clinical trial; and Rexis, an add-on injection therapy that is in Phase III clinical trials to treat patients with sepsis. Its pre-clinical products comprise TRX-711 that is used to treat secondary hyperparathyroidism; TRX-920, an oral delivery formulation; and TRX-105, a molecule developed for treating and alleviating symptoms of various colitis. The company also offers Zelnite, a drug that helps in patient's blood Se level and immune system; and focuses on development of the nodal diagnostic devices and anti-body drugs. TaiRx, Inc. was founded in 2011 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11502",
        "website": "http://www.trx.com.tw",
        "market_cap": "Micro Cap"
    },
    "6589.TWO": {
        "short_name": "EIRGENIX INC",
        "long_name": "EirGenix Inc.",
        "summary": "EirGenix Inc. operates as a contract development and manufacturing company Taiwan and internationally. Its services include cell line development and cell bank manufacturing, process development, analytical sciences and quality control, cGMP manufacturing, and antibody drug conjugate. The company was founded in 2012 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22180",
        "website": "http://www.eirgenix.com",
        "market_cap": "Small Cap"
    },
    "6612.TWO": {
        "short_name": "ICARES MEDICUS INC",
        "long_name": "ICARES Medicus, Inc.",
        "summary": "ICARES Medicus, Inc. engages in the research and development, manufacture, and sale of ophthalmic medical materials. The company provides nanomedical lubricious coatings and various surface treatments for implantable or interventional medical devices; intraocular lenses for the treatment of cataracts, myopia, hyperopia, presbyopia, or astigmatism; and nanomedical devices. It has operations in the United States, England, Japan, Taiwan, Spain, Hungary, China, and internationally. The company was founded in 2011 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": null,
        "website": "http://www.icaresmedicus.com",
        "market_cap": "Micro Cap"
    },
    "6615.TWO": {
        "short_name": "SOFIVA GENOMICS CO LTD",
        "long_name": "Sofiva Genomics Co.,Ltd.",
        "summary": "Sofiva Genomics Co.,Ltd. provides genetic testing services in Taiwan and internationally. The company offers prenatal services, including thalassemia carrier screening; tests for microdeletion syndromes and single-gene abnormalities; detection of common chromosome abnormalities, selected microdeletions syndromes, and selected skeletal dysplasia genetic mutations; multiple genetic diseases detection; folate metabolism genetic screening; and spinal muscular atrophy carrier screening. It also provides cancer services, such as cancer scans; real-time monitoring of tumor dynamics; hereditary cancer related genetic tests; and hereditary women's cancer tests for breast, colon, ovarian, and endometrial cancer, as well as human papillomavirus screening. In addition, the company offers rare diseases genetic testing services; and preimplantation genetic diagnosis and NGS-based preimplantation genetic screening services. Further, it provides new-born genetic testing services comprising baby scans; hereditary sensorineural hearing loss screening; congenital central hypoventilation syndrome screening; congenital cytomegalovirus infection screening test; and atopic dermatitis genetic screening. Additionally, the company offers biochemical and chromosome testing, as well as advisory and support services. It serves expectant parents, patients with genetic disorders, and their families. Sofiva Genomics Co.,Ltd. was founded in 2012 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10043",
        "website": "http://www.sofivagenomics.com.tw",
        "market_cap": "Nano Cap"
    },
    "6617.TWO": {
        "short_name": "Gongwin",
        "long_name": "Gongwin Biopharm Holdings Co., Ltd.",
        "summary": "Gongwin Biopharm Holdings Co., Ltd., a clinical-stage biopharmaceutical company, develops anticancer drugs. It is developing PTS302, which has completed Phase III clinical trials for the treatment of lung cancer; PTS100, which is in Phase II clinical trials for the treatment of liver cancer; PTS-02 for the treatment of adenoid cystic carcinoma; and PTS500 for the treatment of malignant pleural effusion. The company was founded in 2014 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10491",
        "website": "http://www.gongwinbiopharm.com",
        "market_cap": "Small Cap"
    },
    "6620.TWO": {
        "short_name": "Handa Pharma",
        "long_name": "Handa Pharmaceuticals, Inc.",
        "summary": "Handa Pharmaceuticals, Inc., a specialty pharmaceutical company, focuses on the development of drugs for various diseases in the United States and China. It is developing various general delivery systems, including matrix system, reservoir system, matrix plus reservoir system, osmotic pump system, and colon delivery system. The company also develops modified release dosage forms, such as orally disintegrating tablets, modified release orally disintegrating tablets, modified release suspension systems, and ophthalmic modified release systems. In addition, it develops 505(b)2 and generic drugs. The company is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74147",
        "website": "http://www.handapharma.com.tw",
        "market_cap": "Micro Cap"
    },
    "6621.TWO": {
        "short_name": "UniPharma",
        "long_name": "UniPharma Co., Ltd.",
        "summary": "UniPharma Co., Ltd. engages in the brand drug development activities. The company offers adhesion reduction, neurology, cardiovascular, and anesthesia solutions; and antidotes, as well as medical devices and in vitro-diagnostic products. It also develops bio-markers for the diagnosis of neurological disease; and operates a laboratory for neurological bio-markers. The company was founded in 1998 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.uni-pharma.com",
        "market_cap": "Nano Cap"
    },
    "6633.TWO": {
        "short_name": "Somnics",
        "long_name": "Somnics, Inc.",
        "summary": "Somnics, Inc., a medical device company, focuses on developing technologies for the treatment of obstructive sleep apnea (OSA). The company offers iNAP One and iNAP Lite sleep therapy systems, which utilize oral negative pressure technology to treat OSA, a sleep-related breathing disorder. Somnics, Inc. was founded in 2011 and is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30261",
        "website": "http://www.somnics.com",
        "market_cap": "Nano Cap"
    },
    "6634.TWO": {
        "short_name": "SINEW",
        "long_name": "Sinew Pharma Inc.",
        "summary": "Sinew Pharma Inc., a biopharmaceutical company, focuses on the development and sale of drugs for the treatment of hepatotoxicity-free acetaminophen and fatty liver diseases. The company's products include SNP-610 drug, which is in Phase II clinical trial for treating patients with non-alcoholic steatohepatitis in Taiwan; and SNP-630, a pre-clinical drug for treating patients with non-alcoholic steatohepatitis. It is also developing SNP-810 for use in analgesic and antipyretic indications; and SNP-830 and SNP-840, which are used as hepatotoxicity-free analgesic medicines in the United States. The company was founded in 2014 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.sinewpharma.com",
        "market_cap": "Micro Cap"
    },
    "6649.TWO": {
        "short_name": "TAIWAN BIOMATERIAL CO LTD",
        "long_name": "Taiwan Biomaterial Co., Ltd.",
        "summary": "Taiwan Biomaterial Co., Ltd. develops and sells medical devices in Taiwan. The company provides Foamagen, an absorbable biomaterial for dura reconstruction after surgeries; stroke interventional treatment devices; and devices for the treatment of early degenerative arthritis, and tissue repair and regeneration. Taiwan Biomaterial Co., Ltd. is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "302",
        "website": "http://www.twbm.com.tw",
        "market_cap": "Nano Cap"
    },
    "6652.TWO": {
        "short_name": "Eusol Bio",
        "long_name": "EUSOL Biotech Co., Ltd.",
        "summary": "Eusol Biotech Co.,Ltd. focuses on developing drugs for unmet medical needs. Its pipeline includes ES135, a recombinant human acidic fibroblast growth factor (rhFGF1) for repairing neuron function; and SM-1, a 3-in-1 capsule containing 3 commercial drugs with sedative effect. The company was founded in 2005 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10546",
        "website": "http://www.eusol-biotech.com",
        "market_cap": "Micro Cap"
    },
    "6657.TWO": {
        "short_name": "ENERGENESIS",
        "long_name": "Energenesis Biomedical CO.,LTD.",
        "summary": "Energenesis Biomedical CO.,LTD. operates in the biomedicine industry in Taiwan. It provides ENERGI-F703, which is Phase II clinical trial for use in treatment of diabetic foot ulcers; ENERGI-F701, a topical tonic for the treatment of alopecia that is in Phase II clinical trial; ENERGI-F711, a burn cream; ENERGI-F702 to treat metabolic diseases; ENERGI-F704 for the treatment of inflammatory bowel disease; ENERGI-F708 for asthma treatment; ENERGI-F705 for Parkinson's disease control; ENERGI-F707 for the treatment of mitochondria deficiency; ENERGI-F706 to treat cachexia; ENERGI-F709, a vaccine adjuvant; and ENERGI-F710 for blood phosphate control. The company also offers scientific products, which include western blot, antibody production, protein purification, and proteome experiment reagents, as well as buffer solutions for scientific researchers. Energenesis Biomedical CO.,LTD. was founded in 2012 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11492",
        "website": "http://www.energenesis-biomedical.com",
        "market_cap": "Micro Cap"
    },
    "6661.TWO": {
        "short_name": "WELGENE BIOTECH CO LTD",
        "long_name": "Welgene Biotech Co.,Ltd.",
        "summary": "Welgene Biotech Co.,Ltd. provides clinical testing services. The company offers research services, including sequencing, microarray, quantitative PCR verification, nucleic acid extraction/QC, LCM single cell experiment, and bioinformatics analysis services; and clinical application services, such as array-based genomic hybridization and non-invasive prenatal tests. It also provides reagents, consumable supplies, and instruments, as well as software services. The company was founded in 2003 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.welgene.com.tw",
        "market_cap": "Nano Cap"
    },
    "6662.TWO": {
        "short_name": "BIOLASCO TAIWAN CO LTD",
        "long_name": "BioLASCO Taiwan Co., Ltd.",
        "summary": "BioLASCO Taiwan Co., Ltd. provides bio-materials and surgical services in Taiwan and internationally. The company is also involved in the design of animal facility; and provision of contract management and training services. It breeds and produces SPF laboratory rats and mice, including outbreed stocks, inbreed strains, and immune deficient models, as well as offers special animal model services. The company also provides endotoxin detection, animal heath diagnostic, and serological kits, as well as biological indicators. In addition, it offers equipment, including IVC systems and ventilated houses; professional and automated animal watering systems; transponders; portable chlorine dioxide gas generators; mouse and rat tail cuff blood pressure systems, analgesia equipment, and animal behavioral equipment; metabolism and behavior systems, and trackers; cabinet X-ray systems; automatic cleaning equipment; workstations; isolation chambers; and foggers. The company is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.biolasco.com.tw",
        "market_cap": "Nano Cap"
    },
    "6665.TWO": {
        "short_name": "HEALTHCONN",
        "long_name": "Healthconn Corp.",
        "summary": "Healthconn Corp. provides customized disease prevention and health management services. It offers personalized health services; health promotion services, such as nutrition, exercise, stress, and sleep management services; and health management services. The company also provides environmental food safety and clinical microbiological testing, infectious molecular biological detection, senior consultation, cancer genetic testing products, and pension planning services. Healthconn Corp. was founded in 2009 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Healthcare Plans",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://www.healthconn.com",
        "market_cap": "Micro Cap"
    },
    "6677.TWO": {
        "short_name": "Anxo",
        "long_name": "Anxo Pharmaceutical Co., Ltd.",
        "summary": "Anxo Pharmaceutical Co., Ltd., a specialty pharmaceutical company, develops, manufactures, and sells pharmaceutical products for medical professionals and patients in Taiwan and internationally. It offers prescription and over the counter drugs in various therapeutic areas, such as cardiovascular, metabolism, CNS, diabetic, gastroenterology, respiratory, anti-infection, dermatology, nephrology, urology, orthopedics, etc. The company was founded in 2003 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10489",
        "website": "http://www.anxo.com.tw",
        "market_cap": "Nano Cap"
    },
    "6709.TWO": {
        "short_name": "Advagene",
        "long_name": "Advagene Biopharma Co., Ltd.",
        "summary": "Advagene Biopharma Co., Ltd. engages in the research and development of vaccine technology and related products in Taiwan. Its products in development include nasal spray influenza vaccine, allergy vaccines, other vaccines, etc. The company was founded in 1995 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.advagene.com.tw",
        "market_cap": "Micro Cap"
    },
    "6730.TWO": {
        "short_name": "LAGIS",
        "long_name": "Lagis Enterprise Co., Ltd.",
        "summary": "Lagis Enterprise Co., Ltd., a medical device development company, develops and markets medical devices for the laparoscopic and endoscopic surgical markets worldwide. Its products include trocars, single port surgery devices, and wound protectors; endo devices, such as hand instruments and advanced bipolar devices; specimen retrieval products; suction irrigation systems and irrigation pumps; training systems; and related accessories. The company was founded in 2004 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "43767",
        "website": "http://www.lagis.com.tw",
        "market_cap": "Nano Cap"
    },
    "6733.TWO": {
        "short_name": "BIOGEND THERAPEUTICS CO LTD",
        "long_name": "BioGend Therapeutics Co., Ltd.",
        "summary": "BioGend Therapeutics Co., Ltd. develops regenerative bio-orthopaedic medicines. It is developing BiG-001 and BiG-006, an osteo-inductive bone graft substitute; and BiG-009, an autologous chondrocyte repair system. The company is also involved in developing bio-orthopaedic devices and treatment methods to fulfill unmet clinical needs. BioGend Therapeutics Co., Ltd. was founded in 2016 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "115",
        "website": "http://www.biogend.com.tw",
        "market_cap": "Micro Cap"
    },
    "6734.TWO": {
        "short_name": "iXensor",
        "long_name": "iXensor Co., Ltd.",
        "summary": "iXensor Co., Ltd. develops, produces, and sells hardware and software systems for in-vitro diagnostic medical devices. The company's PixoTest technology uses the lighting and image sensing module of the smartphone to detect the color change reaction on the biochemical test strip. It offers PixoTest Blood Glucose Monitoring System and PixoTest POCT System for chronic diseases management; Eveline Smart Fertility System for women's health management; and systems for infectious disease management, as well as PixoHealth App, which measures, records, and uploads test readings to the cloud. The company was founded in 2012 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11492",
        "website": "http://www.ixensor.com",
        "market_cap": "Nano Cap"
    },
    "6747.TWO": {
        "short_name": "BRIGHTEN OPTIX CORPORATION",
        "long_name": "Brighten Optix Corporation",
        "summary": "Brighten Optix Corporation researches and develops, manufactures, and sells specialty contact lenses in Taiwan and the Asia Pacific region. The company offers its products under the Ortho-K myopia management lens, HiClear gas permeable (GP) lens, Briomoist lens care systems, SynergEyes hybrid lens, and Large Diameter GP lens. It also provides OEM/ODM collaboration services. The company is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "11167",
        "website": "http://www.brightenoptix.com.tw",
        "market_cap": "Micro Cap"
    },
    "6767.TWO": {
        "short_name": "WILTROM CO LTD",
        "long_name": "Wiltrom Co., Ltd.",
        "summary": "Wiltrom Co., Ltd. researches, develops, and produces a range of implantable medical devices. Its products include spinal fixation systems, interbody fusion systems, bone graft substitutes, vertebral body augmentation systems, and vertebroplasty bone cement. The company is based in Zhubei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Zhubei",
        "zipcode": "30261",
        "website": "http://www.wiltrom.com.tw",
        "market_cap": "Nano Cap"
    },
    "6794.TWO": {
        "short_name": "UnicoCell",
        "long_name": "UnicoCell Biomed Co., Ltd.",
        "summary": "UnicoCell Biomed Co., Ltd., a biomedical company, researches and develops stem cell therapeutic products, cell therapy technology, and regenerative medicine applications in Taiwan. It develops CT21-ELIXCYTE, which is in Phase 2 clinical trials for the treatment of knee osteoarthritis; and CT31-ELIXCYTE for the treatment of renal failure. The company offers Perfectin, a stem cell secretion and can be used as a raw material for skin care products; and UnicoVial, a cell storage container. UnicoCell Biomed Co., Ltd. was founded in 2018 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.unicocell.com",
        "market_cap": "Micro Cap"
    },
    "6796.TWO": {
        "short_name": "MiiS",
        "long_name": "Medimaging Integrated Solution Inc.",
        "summary": "Medimaging Integrated Solution Inc. provides digital and portable diagnostic solutions. It designs and manufactures digital hand-held diagnostic scopes, as well as auxiliary tools. The company was founded in 2010 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu",
        "zipcode": "30077",
        "website": "http://www.miis.com.tw",
        "market_cap": "Micro Cap"
    },
    "6814.TWO": {
        "short_name": "LUKAS",
        "long_name": "Lukas Biomedical Inc.",
        "summary": "Lukas Biomedical Inc. engages in the research and the development of immunotherapy for cancer treatment. It is also involved in the rental of medical equipment. The company was founded in 2014 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lukas-bio.com.tw",
        "market_cap": "Micro Cap"
    },
    "6817.TWO": {
        "short_name": "WINSTON",
        "long_name": "Winston Medical Supply Co.,Ltd",
        "summary": "Winston Medical Supply Co.,Ltd. engages in the development, manufacture, and distribution of pharmaceuticals, nutrition supplements, and cosmeceutical products. It offers sterile ophthalmic preparations comprising gels, suspensions, solutions, and emulsions; hormone preparations, which primarily cover birth control and oral suspension for cancer related cachexia; external use preparations comprising ointments; and other oral preparations, which are in oral dosage forms, such as powders, troches, tables, film coated tablets, chewables, and capsules for the treatment of colds, gastrointestinal issues, or other indications. The company was founded in 1974 and is based in Tainan City, Taiwan. As of January 2014, Winston Medical Supply Co., Ltd. operates as a subsidiary of Medigen Biotechnology Corp.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "71072",
        "website": "http://www.winston.com.tw",
        "market_cap": "Micro Cap"
    },
    "6ZD.F": {
        "short_name": "ONENESS B.GDR REGS/5 TA10",
        "long_name": "Oneness Biotech Co., Ltd.",
        "summary": "Oneness Biotech Co., Ltd. operates as a biopharmaceutical company in Taiwan. The company develops ON101, which is in Phase III clinical trials for treating chronic diabetic foot ulcers; and OB318, an anti- liver cancer drug that completed Phase I clinical trials. It is also developing SNS01, SNA02, and SNA03 that are in pre-clinical stage for the treatment of cancer; FB704A that is in Phase I clinical trial for the treatment of rheumatoid arthritis, cancer, and cytokine storms; and FB825, which is in Phase II clinical trial for treating allergic diseases and asthma. The company was founded in 2008 and is based in Taipei City, Taiwan. Oneness Biotech Co., Ltd. operates as a subsidiary of Microbio Co., Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.onenessbio.com.tw",
        "market_cap": "Mid Cap"
    },
    "7561.TWO": {
        "short_name": "Bioray Biotech",
        "long_name": "Bioray Biotech Co., Ltd",
        "summary": "BioRay Biotech Co., Ltd. engages in the development and manufacture of biological agents. Its biological agents include functional probiotics, medicinal fungi, and immune cell preparations. The company was founded in 1994 is based in Pingtung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Pingtung",
        "zipcode": "90846",
        "website": "http://www.bio-ray.com.tw",
        "market_cap": "Nano Cap"
    },
    "7595.TWO": {
        "short_name": "Pharmigene",
        "long_name": "Pharmigene, Inc.",
        "summary": "PharmiGene, Inc. develops, manufactures, and sells diagnostic tests worldwide. It primarily develops DNA genetic tests. The company was founded in 2005 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.pharmigene.com",
        "market_cap": "Nano Cap"
    },
    "7TLA.F": {
        "short_name": "TAIWAN LIPOSOME SP.ADR/2",
        "long_name": "Taiwan Liposome Company, Ltd.",
        "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). The BioSeizer lipid formulation technology is designed to enable local sustained release and fast onset of APIs at the site of disease or injury with enhanced pharmacokinetic (PK) control by customization of lipid layers; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III clinical trial for the treatment of knee osteoarthritis pain. The company's product candidates also comprise TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that has completed Phase II clinical trial to treat post-surgical pain; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma; and TLC19 that is in Phase I clinical trial to treat COVID-19.Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.tlcbio.com",
        "market_cap": "Micro Cap"
    },
    "8279.TWO": {
        "short_name": "SYNGEN BIOTECH CO LTD",
        "long_name": "Syngen Biotech Co., Ltd.",
        "summary": "Syngen Biotech Co., Ltd. operates as a biotech company in Taiwan. The company manufactures and sells active pharmaceutical ingredients, including Mupirocin, an antibiotic against gram-positive bacteria that is used for the topical treatment of superficial infections, such as impetigo and infections, as well as to control infected eczema, wounds, and burns; and nutraceutical ingredients comprising probiotics, medicinal fungi, and entomogenous fungi. It also offers biology fermentation, biology agriculture and aquaculture, and functional food products. The company was founded in 1999 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "73055",
        "website": "http://www.syngen.com.tw",
        "market_cap": "Micro Cap"
    },
    "8403.TWO": {
        "short_name": "SHAREHOPE MEDICINE CO LTD",
        "long_name": "ShareHope Medicine Co., Ltd.",
        "summary": "ShareHope Medicine Co., Ltd. provides integrated medical services in Taiwan. It engages in the health management and operation activities; human resource dispatch of professional medical staff; provision of medical, pharmaceutical, and health devices, as well as long-distance health care services; and rental of medical devices. The company was founded in 2003 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Distribution",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "330",
        "website": "http://www.share-hope.com",
        "market_cap": "Micro Cap"
    },
    "8409.TWO": {
        "short_name": "EBM TECHNOLOGIES INCORPORATED",
        "long_name": "EBM Technologies Incorporated",
        "summary": "EBM Technologies Incorporated develops and markets software and integrity solutions to the health sector in Taiwan and internationally. The company offers Enterprise PACS (picture archiving and communication systems), including SoliPACS that unites various products of the radiology, mammography, and dental fields; SoliPACS Gateway, a DICOM gateway; SoliPACS Server, an interface between HIS and RIS patient data and PACS; SoliPACS Web Viewer, which enables radiologists and physicians to view DICOM-compliant images, compare them to examination results, utilize image enhancement tools, and select images for review; SoliPACS Report that offers a tool for generating customized reports; and Advanced Server Archive, a PACS storage system. It also provides MobiPACS applications, which allow clinicians to retrieve, view, and compare various medical images; MobiPACS Server to store, process, and retrieve image files for mobile devices; MobiPACS App, an in mobile medical image viewing app; MobiPACS Web Viewer for viewing images from Internet-enabled end devices; and MobiPACS Share, a cloud-based platform. In addition, the company offers MobiPACS Multi that supports doctors to connect various iPads/iPad Pros for image display; Vital-Sign On-the-Go, a patient monitoring solution; Rad@, which enables doctors and radiologists to view medical-grade images and diagnose; and Digital Pathology scanner. Further, it provides Telemed, which interlinks medical facilities; Electronic Medical Record, a digital version of the paper-based individual medical record for patients' medical history; Personal Health Record that offers electronic access to the individual's medical history; and eHealth solutions for retrieving and reviewing patient images, sign data, and ECG waveforms, as well as technical and after sales services. EBM Technologies Incorporated was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Health Information Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.ebmtech.com",
        "market_cap": "Nano Cap"
    },
    "8432.TWO": {
        "short_name": "TSH BIOPHARM CORPORATION LIMITE",
        "long_name": "TSH Biopharm Corporation Limited",
        "summary": "TSH Biopharm Corporation Limited develops and markets medicines for chronic diseases in Taiwan. It offers products for cardiovascular, central nervous, gastrointestinal, and others, as well as liquid-biopsy diagnosis. The company is headquartered in Taipei city, Taiwan. TSH Biopharm Corporation Limited is a subsidiary of TTY Biopharm Company Limited.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.tshbiopharm.com",
        "market_cap": "Micro Cap"
    },
    "9103.TW": {
        "short_name": "MEDTECS INTERNATIONAL CORP",
        "long_name": "Medtecs International Corporation Limited",
        "summary": "Medtecs International Corporation Limited, an integrated healthcare products and services provider, manufactures and distributes medical consumables for healthcare distributors, pharmaceutical companies, and hospital groups worldwide. It operates through Manufacturing, Hospital Services, and Distribution segments. The Manufacturing segment produces and sub-contracts a range of medical consumables, including patients' apparels, disposable surgical masks, boot covers and surgical gowns, underpads, adult diapers, crochet blankets, bed linens, and medical bandages. The Hospital Services segment provides laundry and leasing services, including hospital linen rental and laundry, management of hospital laundry facilities, hospital automation, and other non-core hospital functions for hospitals in Taiwan and the Philippines. The Distribution segment markets Medtecs-branded medical consumables to hospitals, pharmacies, and other end users in the Asia Pacific. This segment also supplies other branded medical supplies and equipment comprising wheel chairs, syringes, nebulizers, and blood pressure monitors. Medtecs International Corporation Limited also manufactures, leases, trades in, and sells woven and knitted fabrics, and other made-up articles of textile products; trades in hospital textiles and garments, pillow cases, bed sheets, gowns, and other apparel products; and provides garters and other garment products. It also engages in the subleasing activities; and manufacture and supply personal protective equipment. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.medtecs.com",
        "market_cap": "Small Cap"
    },
    "TLC": {
        "short_name": "Taiwan Liposome Company, Ltd.",
        "long_name": "Taiwan Liposome Company, Ltd.",
        "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). The BioSeizer lipid formulation technology is designed to enable local sustained release and fast onset of APIs at the site of disease or injury with enhanced pharmacokinetic (PK) control by customization of lipid layers; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III clinical trial for the treatment of knee osteoarthritis pain. The company's product candidates also comprise TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that has completed Phase II clinical trial to treat post-surgical pain; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma; and TLC19 that is in Phase I clinical trial to treat COVID-19.Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11503",
        "website": "http://www.tlcbio.com",
        "market_cap": "Micro Cap"
    }
}