{
  "1733.TW": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "Apex Biotechnology Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "APEX BIOTECHNOLOGY CORP",
    "state": null,
    "summary": "Apex Biotechnology Corp. engages in the research, development, manufacture, and sale of home care medical devices by using biosensor technology worldwide. The company offers blood glucose, uric acid, hemoglobin, cholesterol, lactate, HbA1C, and ketone monitoring systems, as well as coagulation and multifunctional self-testing, and hemoglobin screening systems. It also provides pesticide residues check systems; and care management and tele-health services. The company was founded in 1997 and is headquartered in Hsinchu City, Taiwan.",
    "website": "http://www.apexbio.com",
    "zipcode": "30078"
  },
  "1734.TW": {
    "city": "Yilan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "Sinphar Pharmaceutical Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SINPHAR PHARMACEUTICAL CO LTD",
    "state": null,
    "summary": "Sinphar Pharmaceutical Co.,Ltd., together with its subsidiaries, researches, develops, manufactures, and sells therapeutic drugs, health care foods, and medical beauty products in Taiwan and internationally. It produces anti-cancer pharmaceuticals, such as injections, solid reagents, and hormone reagents; and tablets, soft gel capsules and powder and canned special nutrient products. The company also provides shampoo, body wash, tonic water, lotions, moisturizers, sunscreen lotions, and serums; and pharmaceutical packaging products, such as eye drop bottles, dry canisters, tablet bottles, and various medical grade plastic containers. In addition, it offers plant extracts and functional foods; and OEM services, such as product design, manufacturing, etc. to manufacturers. Sinphar Pharmaceutical Co.,Ltd. was founded in 1977 and is headquartered in Yilan City, Taiwan.",
    "website": "http://www.sinphar.com.tw",
    "zipcode": "269"
  },
  "1760.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "Panion & Bf Biotech Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "PANION & BF BIOTECH INC",
    "state": null,
    "summary": "Panion & Bf Biotech Inc., a biotechnology pharmaceutical company, manufactures and sells various pharmaceutical products in Taiwan. The company offers products in the areas of medical beauty, kidney, respiratory tract, gastrointestinal tract, and diagnosis. It also provides oral drugs and topical preparations; hand and mechanical disinfection, body lotion, and skin disinfection products; and pet health products, including surgical and skin prescriptions. Panion & Bf Biotech Inc. was founded in 1976 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.pbf.com.tw",
    "zipcode": "11503"
  },
  "1762.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "Chunghwa Chemical Synthesis & Biotech Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "CHUNGHWA CHEMICAL SYNTHESIS BIO",
    "state": null,
    "summary": "Chunghwa Chemical Synthesis & Biotech Co. Ltd. engages in the research, development, manufacture, and wholesale of active pharmaceutical ingredients (APIs) in Taiwan and the United States. It offers API products, which include immunosuppressant, pain management, oncology, cardiovascular, and other products, as well as peptide drugs. The company also develops bulk pharmaceutical products, such as anti-anxiety agents, antidiabetics, laxatives, antifungals, antihistamines, antiseptics, antiulcerants, cardiovascular drugs, skeletal, muscle relaxants, hypolipaemics, antineoplastic, antihyperlipedemias, and immunosuppressant products, as well as provides research and development, and contract manufacturing services to new drug developers and generic drug companies. In addition, it is developing renal dialysis and gastrointestinal drugs. The company was formerly known as China Chemical Synthesis Industry Co., Ltd. Chunghwa Chemical Synthesis & Biotech Co. Ltd. was founded in 1964 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.ccsb.com.tw",
    "zipcode": "23850"
  },
  "3164.TW": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "GenMont Biotech Incorporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "GENMONT BIOTECH INC",
    "state": null,
    "summary": "GenMont Biotech Incorporation engages in the research, development, production, and sale of functional probiotic products in Taiwan. It also provides probiotics with special functions; and original formula design and manufacturing, and equipment manufacturing services on health care food, as well as cooperates in the research, production, and clinical trial of various products. The company was founded in 2000 and is headquartered in Tainan City, Taiwan.",
    "website": "http://en.genmont.com.tw",
    "zipcode": "741"
  },
  "3176.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Medigen Biotechnology Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "MEDIGEN BIOTECHNOLOGY CORPORATI",
    "state": null,
    "summary": "Medigen Biotechnology Corp. focuses on the development of therapies for liver diseases and cancers in Taiwan. It offers cell therapies, such as MAGICELL-NK, which are natural killer cells; and MAGICELL-GDT, which are T cells. The company develops PI-88 (MUPAFOSTAT), which has completed Phase II clinical trial for use as an adjuvant therapy for HCC after curative surgery; and Phase III trial for the adjuvant treatment of patients with hepatitis virus related hepatocellular carcinoma after surgical resection. It also provides OBP-301 that is in a Phase I clinical trials for the treatment of esophageal cancer, and Phase II clinical trials for the treatment of esophageal and gastric cancer. In addition, the company develops human native mAbs for therapeutic applications related to infectious diseases; and molecular diagnostics, vaccine, and generic drugs. Medigen Biotechnology Corp. was founded in 1999 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.medigen.com.tw",
    "zipcode": "11503"
  },
  "3205.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Sagittarius Life Science Corp",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "SAGITTARIUS LIFE SCIENCE CORP",
    "state": null,
    "summary": "Sagittarius Life Science Corporation operates as a biotechnology research company. It engages in the development of Chinese herbal medicine technology platform for the treatment of various diseases. The company was founded in 1987 and is based in Taipei, Taiwan.",
    "website": "http://www.naturalbiokey.com",
    "zipcode": "115"
  },
  "4128.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Microbio Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MICROBIO CO LTD",
    "state": null,
    "summary": "Microbio Co., Ltd. develops and sells various therapeutics in Taiwan. It offers nutritional supplements, skin care products, and organic agricultural products. The company also provides MS-20 for ameliorating fatigue and appetite loss associated with cancer chemotherapy; and Herbiron, which reveals symptoms of iron deficiency anemia and menstrual discomfort. Its pre-clinical stage products include SNS01, SNA02, and SNA-03 to treat various types of cancers, as well as SNA-07 for cancer immune therapy; and SNP-630 to treat non-alcoholic steatohepatitis. The company's Phase I clinical trial products consist of OB-318, an anti-cancer drug; MB-110 for the treatment of hepatitis C; SNP-810, an acetaminophen; FB317 to treat moderate-to-severe allergic asthma and chronic idiopathic urticaria; and FB704A for the treatment of rheumatoid arthritis, cancer, and cytokine storms. In addition, it offers FB825, which is in Phase II clinical trial for the treatment of atopic dermatitis, allergic asthma, hyper IgE syndrome, and food allergy. Additionally, the company's Phase III clinical trial products comprise ON101 to treat diabetic foot ulcer; and MB-6 that acts as an adjuvant for metastatic colorectal cancer. Further, the company's discovery stage pipeline includes FB121 for AIDS; SNA01 to treat PD-1 related cancer; SNA02 for cancer immune therapy; and SNS01 for recurrent metastatic non-small cell lung cancer. Microbio Co., Ltd. was founded in 2000 and is based in Taipei, Taiwan.",
    "website": "http://www.microbio.com.tw",
    "zipcode": "115"
  },
  "4130.TWO": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Genovate Biotechnology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "GENOVATE BIOTECHNOLOGY CO. LTD.",
    "state": null,
    "summary": "Genovate Biotechnology Co., Ltd. operates as a specialty pharmaceutical company in Taiwan. It offers central nervous system drugs, cardiovascular system drugs, musculoskeletal system drugs, immune preparation drugs, anti-infective agents, anticancer drugs, anti-viral drugs, respiratory drugs, genitourinary system drugs, and gastrointestinal drugs. The company was founded in 1995 and is based in Hsinchu, Taiwan.",
    "website": "http://www.genovate-bio.com",
    "zipcode": "30351"
  },
  "4131.TWO": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "DR.Chip Biotechnology Incorporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "DR.CHIP BIOTECHNOLOGY INC",
    "state": null,
    "summary": "DR. Chip Biotechnology Incorporation designs, manufactures, and sells biochips and other related products. The company's products include food safety examination systems, human diagnosis arrays systems, agriculture examination systems, food examination arrays systems, and laboratory instruments, as well as DNA kits. It also offers laboratory planning, design, and other services. The company was founded in 1998 and is based in Taichung, Taiwan.",
    "website": "http://www.bio-drchip.com.tw",
    "zipcode": "411"
  },
  "4133.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "Abnova (Taiwan) Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ABNOVA (TAIWAN) CORPORATION",
    "state": null,
    "summary": "Abnova (Taiwan) Corporation manufactures and sells various recombinant proteins and antibodies. It offers DNA and RNA, proteins/peptides, SARS-CoV/CoV-2,beads/dyes, lysates/slides, antibody pairs/kits, antibody and tissue arrays, in situ hybridization products, circulating rare cells, systems and automations, GMP and analyte specific reagents, and in vitro diagnostics. The company also provides MaxPab, monoclonal, polyclonal, recombinant, conjugate, secondary/tag, and IHC/pathology antibodies. In addition, the company's integrated solutions and services include gene synthesis and cytogenetics; peptide, protein expression, and conjugations; antibody production; and assay development services. Abnova (Taiwan) Corporation is headquartered in Taipei, Taiwan.",
    "website": "http://www.abnova.com",
    "zipcode": "114"
  },
  "4142.TW": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Biotechnology",
    "long_name": "Adimmune Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "ADIMMUNE CORPORATION",
    "state": null,
    "summary": "Adimmune Corporation manufactures and sells human vaccines in Taiwan. It offers AdimFlu-S, an influenza vaccine; tetanus toxoid alum precipitated products used for prevention of tetanus after injury; Japanese encephalitis vaccines; Trivalent and Tetravalent influenza vaccines; Influenza A (H1N1) virus monovalent vaccines; and Tuberculin, as well as contract manufacturing services. The company was formerly known as Kuo Kwang Serum and Vaccine Manufacture Co., Ltd. and changed its name to Adimmune Corporation in 2001. Adimmune Corporation was founded in 1965 and is based in Taichung City, Taiwan.",
    "website": "http://www.adimmune.com.tw",
    "zipcode": "409"
  },
  "4147.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "TaiMed Biologics Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "TAIMED BIOLOGICS INC.",
    "state": null,
    "summary": "TaiMed Biologics Inc., a biotechnology company, develops health-care products. The company develops and markets TMB-355, a humanized monoclonal antibody intravenous infusion for the treatment of HIV-1 infection. It is also developing TMB-355, a humanized monoclonal antibody intramuscular injection, which is in Phase II clinical trial for treating HIV-1; TMB-355, humanized monoclonal antibody intravenous push that is in Phase II clinical trial for the treatment of HIV-1 infection; TMB-365, an anti-CD4 recombinant humanized monoclonal antibody, which is in Phase I clinical trial for treating HIV infections; TMB-Bispecific, a bispecific neutralizing antibody that is in Phase I clinical trial to treat HIV infections; and TMB-ADC, an antibodydrug conjugate for treating HIV infection, as well as VRC07-523LS, a neutralizing HIV-1 antibody. The company was founded in 2007 and is based in Taipei City, Taiwan.",
    "website": "http://www.taimedbiologics.com",
    "zipcode": "11492"
  },
  "4152.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Taiwan Liposome Company, Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TAIWAN LIPOSOME COMPANY LTD",
    "state": null,
    "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). The BioSeizer lipid formulation technology is designed to enable local sustained release and fast onset of APIs at the site of disease or injury with enhanced pharmacokinetic (PK) control by customization of lipid layers; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III clinical trial for the treatment of knee osteoarthritis pain. The company's product candidates also comprise TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that has completed Phase II clinical trial to treat post-surgical pain; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma; and TLC19 that is in Phase I clinical trial to treat COVID-19.Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.tlcbio.com",
    "zipcode": "11503"
  },
  "4157.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "TaiGen Biopharmaceuticals Holdings Limited",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "TAIGEN BIOPHARMACEUTICALS HLDGS",
    "state": null,
    "summary": "TaiGen Biopharmaceuticals Holdings Limited, a pharmaceutical company, develops novel therapeutics for infectious diseases and other indications worldwide. The company develops Taigexyn (Nemonoxacin), a non-fluorinated quinolone antibiotic for the treatment of bacterial infections. It is also developing Taigexyn for treating community-acquired pneumonia and diabetic foot infection; Burixafor, a stem cell mobilizer for stem cell transplantation and chemosenzitization; TG-1000, an influenza antiviral drug for treating influenza A, B; and Furaprevir, a hepatitis C virus protease inhibitor for the treatment of chronic hepatitis C. The company was founded in 2001 and is based in Taipei City, Taiwan.",
    "website": "http://www.taigenbiotech.com.tw",
    "zipcode": "11470"
  },
  "4162.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "PharmaEngine, Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "PHARMAENGINE INC",
    "state": null,
    "summary": "PharmaEngine, Inc., a biopharmaceutical company, engages in the development of drugs and therapeutic drugs for treating cancer diseases in Taiwan and Europe. It is developing ONIVYDE for patients with gemcitabine-treated metastatic pancreatic cancer; PEP06, which is in Phase I stage for the treatment of cancer; and PEP07, an oral small molecule drug, which is in preclinical development stage to regulate DNA damage response. The company was founded in 2003 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.pharmaengine.com",
    "zipcode": "104"
  },
  "4167.TWO": {
    "city": "Miaoli",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Savior Lifetec Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SAVIOR LIFETEC CORPORATION",
    "state": null,
    "summary": "Savior Lifetec Corporation, a specialty injectable company, produces and supplies sterile APIs and finished dosage formulations. The company offers imipenem and cilastatin sodium, an antibacterial agent for intravenous infusion; and meropenem, a beta-lactamase resistant carbapenem antibiotic for parenteral administration. It also provides ertapenem, a form of carbapenem for use on gram-negative and gram-positive anaerobes and aerobic. The company's pipeline products include SLC-006 for prostate cancer endometriosis uterine leiomyoma; and sterile paliperidone palmitate API for the treatment of schizophrenia. Savior Lifetec Corporation was founded in 2004 and is headquartered in Miaoli County, Taiwan.",
    "website": "http://www.saviorlifetec.com.tw/en/",
    "zipcode": "35053"
  },
  "4168.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "GlycoNex Incorporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "GLYCONEX INCORPORATION",
    "state": null,
    "summary": "GlycoNex Incorporation develops cancer drugs using glycosphingolipid antigen and human monoclonal antibody technologies in Taiwan. Its technology platform enables glycosphingolipid antigen production and identification; monoclonal antibody production; cancer drug screening; stable cell line production for monoclonal antibody; and pharmacology/pharmacokinetics assessment. The company offers GNX102, a humanized antibody for cancer-specific glycan prevalent on several types of cancer cells, such as gastric, colon, and pancreatic cancer, as well as develops bi-specific antibody generate armed T-cells targeting glycan antigens on cancer cells. GlycoNex Incorporation was founded in 2001 and is based in New Taipei City, Taiwan.",
    "website": "http://www.glyconex.com.tw",
    "zipcode": "221"
  },
  "4171.TWO": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "GeneReach Biotechnology Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "GENEREACH BIOTECHNOLOGY CORP",
    "state": null,
    "summary": "GeneReach Biotechnology Corp. develops, manufactures, and markets products for applied nucleic acid detection technology primarily in Taiwan. The company offers pathogen detection platforms, including equipment and reagents; and animal use medicines, biotechnology services, medical materials and equipment, and precision instruments. Its products are used in aquaculture, agriculture, food, companion animal, livestock, and human health industries. The company also provides polymerase chain reaction training programs, molecular diagnostic technical solutions, laboratory installation services, OEM/ODM contract manufacturing services, and research collaboration services. GeneReach Biotechnology Corp. was founded in 2004 and is headquartered in Taichung, Taiwan.",
    "website": "http://www.genereach.com",
    "zipcode": "407"
  },
  "4174.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "OBI Pharma, Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "OBI PHARMA INC",
    "state": null,
    "summary": "OBI Pharma, Inc., a bio-pharma company, develops and licenses therapeutic agents for unmet medical needs against cancer in Taiwan. It offers Adagloxad Simolenin (OBI-822), a breast cancer active immunity anti-cancer drug, which is in Phase III for generating antibody against tumor carbohydrate antigen Globo H; OBI-833, an immunity anti-cancer drug, which completed Phase I clinical trial for treating and tracking lung cancer; OBI-866 SSEA-4, an active immuno-oncology drug; OBI-888, a passive immunotherapy monoclonal antibody, which is under Phase I/II human clinical trial targeting Globo H; OBI-999, an antibody drug conjugate that is in Phase II human clinical trial; OBI-898 SSEA4, a passive immunity monoclonal antibody that is in preclinical stage; OBI-998 SSEA4,an antibody small molecule drug complex, which targets toxic drugs to malignant tumors; OBI-3424, a micromolecule chemotherapy prodrug that is in Phase I clinical trial; and OBI-858, a clostridium botulinum toxin. The company was founded in 2002 and is based in Taipei City, Taiwan.",
    "website": "http://www.obipharma.com",
    "zipcode": "115"
  },
  "4192.TWO": {
    "city": "Yilan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "SynCore Biotechnology Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SYNCORE BIOTECHNOL",
    "state": null,
    "summary": "SynCore Biotechnology Co.,Ltd, a biopharmaceutical company, engages in the research and development, manufacture, and marketing of drugs in the areas of oncology, ophthalmology, dermatology, and infectious diseases in Taiwan and China. The company offers SB03-Veregen, an ointment for the treatment of patients with external genital and perianal warts; and distributes cameras under the epiCam name that is used in recording the progress of ophthalmology diseases. It is also involved in the development of SB01, an injectable anti-cancer new ingredient (NCE) that is in Phase II clinical trial for the treatment of head and neck cancer; SB02, an anti-cancer NCE, which is in Phase I clinical trial for use in the treatment of stomach cancer; SB04 that is in Phase II/III clinical trials for the treatment of patients with dry age-related macular degeneration; and SB05, a composition of cytostatic drug paclitaxel combined with neutral and positive lipids, which is in Phase III clinical trial for the treatment of patients with triple negative breast cancer and pancreatic cancer. The company has partnerships with Medigene AG; MacuCLEAR Inc.; Y-YBAR; Epipole Ltd.; Sinphar Pharmaceutical Co., Ltd.; and The National Health Research Institutes. The company was founded in 2008 and is headquartered in Yilan, Taiwan. SynCore Biotechnology Co.,Ltd is a subsidiary of Sinphar Pharmaceutical Co., Ltd.",
    "website": "http://www.syncorebio.com",
    "zipcode": "269"
  },
  "4194.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Holy Stone Healthcare Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "HSHC",
    "state": null,
    "summary": "Holy Stone Healthcare Co., Ltd. engages in the development of therapeutics in Taiwan. The company offers RenehaVis, a product designed to relive pain and stiffness of the knee joint; SportVis, a treatment to relive the pain and optimize the recovery of tendon and ligament injuries; TRUD, a treatment that allows mucosal tissue to heal naturally and reduces the symptoms of ulcerative colitis; and GAF, a treatment for anal mucosal lesions. It is also developing IBD98-M, which is in Phase IIa clinical trials for the treatment of inflammatory bowel diseases; and CA102N, which is in Phase I clinical trials for the treatment of colorectal cancer. In addition, it also develops ND108E for the treatment of alzheimer's disease; and CA102L, a novel and small molecule conjugated therapeutic agent to treat lymphoma and multiple myeloma. The company was founded in 2001 and is headquartered in Taipei, Taiwan. Holy Stone Healthcare Co., Ltd. is a subsidiary of Holy Stone Enterprise.",
    "website": "http://www.hshc.com.tw",
    "zipcode": "11493"
  },
  "4197.TWO": {
    "city": "Hsinchu City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Visgeneer Inc.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "VIS",
    "state": null,
    "summary": "Visgeneer Inc., a biotech company, develops and produces biomedical products in the fields of medical device, cosmetics/skin care, bacterial fermentation, and cancer gene identification. The company offers blood glucose and ketone, and uric acid monitoring systems. It also provides multi-active cream gels, wrinkle reducing eye creams, hydro complete emulsions, revitalizing essences, toning lotions, amino acid cleansing creams, multi-perfection firming gel creams, aqua emulsions, herbal gel lotions, anti- aging creams, brightening serums, revitalizing lotions, masks, UV shield creams, dark spot corrector pearl whitening cream, anti-acne complexes, glucosamine creams, essences, hyaluronic acid and intensive whitening essences, rejuvenating essence creams, and anti-aging time complex capsules under Coresence name. Visgeneer Inc. is based in Hsinchu City, Taiwan.",
    "website": "http://www.visgeneer.com.tw",
    "zipcode": "30094"
  },
  "4726.TWO": {
    "city": "Miaoli",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Mycenax Biotech Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "MYCENAX BIOTECH INC.",
    "state": null,
    "summary": "Mycenax Biotech Inc. develops and manufactures biopharmaceutical products from mammalian cells and microbials in Taiwan, European, and the United States markets. The company develops monoclonal antibodies, bi-specific antibodies, fc-fusion proteins, recombinant proteins, peptides, protein conjugates (non-toxin), antibody-cell conjugates, enzymes, antigen-binding fragments (Fab), single-chain variable fragments (ScFv), plasmids, DNA vaccines, and glycoproteins. It also provides process development and scale-up, GMP manufacturing, and analytical services, as well as manufacturing technologies and in-house services. The company was founded in 2001 and is headquartered in Miaoli, Taiwan.",
    "website": "http://www.mycenax.com.tw",
    "zipcode": "35053"
  },
  "4728.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Sunmax Biotechnology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SUNMAX BIOTECHNOLOGY CO LTD",
    "state": null,
    "summary": "Sunmax Biotechnology Co., Ltd., a biomedical company, develops, manufactures, and markets medical-grade collagen-based medical devices in Asia. The company offers Porcogen, a sterile purified collagen solution for medical device, tissue engineering, and research purposes; and dermal fillers, such as Sunmax collagen implant I-Plus and Sumax collagen implant I for the correction of facial defects, such as the fill up of wrinkles. It also provides Sunmax collagen dental bone graft, Sunmax collagen dental membrane, and Sunmax dental bone graft granules, which are used in the augmentation or reconstructive treatment of the alveolar ridge. In addition, the company offers Sunmax collagen bone graft matrix that provides a bone void filler that is resorbed and replaced with bone during the healing process; and skincare products comprising Sunmax 6 collagen facial cleanser, Sunmax 7 collagen essence, Sunmax 8 active collagen essence mask, Sunmax 9 collagen refining cream, Sunmax 10 collagen eye renewal cream, Sunmax 11 collagen moisturizing cream, Sunmax 15 Collagen MesoRepair, and Sunmax Collagen Peptide that are used as aftercare of dermal filler treatment. Sunmax Biotechnology Co., Ltd. was founded in 2001 and is based in Tainan City, Taiwan.",
    "website": "http://www.sunmaxbiotech.com",
    "zipcode": "744"
  },
  "4732.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "NatureWise Biotech & Medicals Corporation",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "NBM",
    "state": null,
    "summary": "NatureWise Biotech & Medicals Corporation engages in the development of therapeutic drugs in Taiwan. It offers LipoCol Forte, a capsule for hypercholesterolemia and hypertriglyceridemia; PPL products comprise Taiwanese Green Propolis; and NBM-BMX an oral Softgel capsule to treat cancer. The company was founded in 2000 and is based in Taipei City, Taiwan.",
    "website": "http://www.naturewise.com.tw",
    "zipcode": "105"
  },
  "4743.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Oneness Biotech Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "ONENESS BIOTECH CO LTD",
    "state": null,
    "summary": "Oneness Biotech Co., Ltd. operates as a biopharmaceutical company in Taiwan. The company develops ON101, which is in Phase III clinical trials for treating chronic diabetic foot ulcers; and OB318, an anti- liver cancer drug that completed Phase I clinical trials. It is also developing SNS01, SNA02, and SNA03 that are in pre-clinical stage for the treatment of cancer; FB704A that is in Phase I clinical trial for the treatment of rheumatoid arthritis, cancer, and cytokine storms; and FB825, which is in Phase II clinical trial for treating allergic diseases and asthma. The company was founded in 2008 and is based in Taipei City, Taiwan. Oneness Biotech Co., Ltd. operates as a subsidiary of Microbio Co., Ltd.",
    "website": "http://www.onenessbio.com.tw",
    "zipcode": "106"
  },
  "4911.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "G&E Herbal Biotechnology Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "G&E HERBAL BIOTECHNOLOGY CO. LT",
    "state": null,
    "summary": "G&E Herbal Biotechnology Co., Ltd., a biotechnology company, focuses on the development and commercialization of novel botanical extraction technology and products in Taiwan. It offers hepato protective agent capsules for the treatment of chronic liver inflammation, cirrhosis, hepatitis, and other liver diseases; botanical anti-aging cosmetic products; and SR-100 skin repair gel. The company also provides botanical healthcare products, such as Astragali Radix for physical strength; Goji for eyes; and Prosta capsule for regulating physiological functions and boosting metabolism, as well as offers adult products. In addition, it is developing Solarise injection for the treatment of gynecological, head, and neck cancer; Apocin capsule for the treatment of lung/breast cancer; and SR-T100 Gel. Further, the company manufactures technology development for various dietary supplements, as well as provides technical advisory services to other biotechnology organizations. G&E Herbal Biotechnology Co., Ltd. was founded in 2002 and is based in Tainan City, Taiwan.",
    "website": "http://www.geherbs.com.tw",
    "zipcode": "70955"
  },
  "6446.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "PharmaEssentia Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "PHARMAESSENTIA CORP",
    "state": null,
    "summary": "PharmaEssentia Corporation engages in the research, development, production, and sale of therapeutic products for the treatment of human diseases. Its products include ropeginterferon alfa-2b that is used for the treatment of polycythemia vera, essential thrombocythemia, and hepatitis B and C; and Anti-PD-1 antibody for the treatment of cancer. The company also licensed to develop Oraxol for the treatment of breast, advanced gastric, and esophageal cancer; KX01 for the treatment of psoriasis and actinic keratosis. It also focuses on the drug research and development programs in the areas of hematology, infectious disease, oncology, and dermatology. The company has a research collaboration agreement with Axis Therapeutics Limite for the development of T Cell Receptor-T therapy based on the T cell receptor affinity enhancing specific T cell therapy technology platform. PharmaEssentia Corporation was founded in 2003 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.pharmaessentia.com",
    "zipcode": "115"
  },
  "6461.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Intech Biopharm Corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "INTECH BIOPHARM LTD",
    "state": null,
    "summary": "Intech Biopharm Corporation focuses on developing and manufacturing generic drugs to treat respiratory diseases. It owns iLEF (inhaled low ethanol formulation), a metered dose inhaler platform to treat asthma and chronic pulmonary obstructive disease; and dry powder inhaler. The company offers its products under the SYN006, SYN010, SYN007, Synflutide, Duasma, Synvent, and SYN011 names. Intech Biopharm Corporation is headquartered in Taipei, Taiwan.",
    "website": "http://www.intechbiopharm.com",
    "zipcode": "114"
  },
  "6492.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Senhwa Biosciences, Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "SENHWA BIOSCIENCES INC",
    "state": null,
    "summary": "Senhwa Biosciences, Inc., a clinical-stage biopharmaceutical company, identifies and develops therapies for the treatment of cancer. The company is developing CX-4945 that is in phase I/II clinical trial in combination with gemcitabine plus cisplatin for the treatment of patients with cholangiocarcinoma; CX-5461 AU, a phase I, open-label, dose escalation, safety, pharmacokinetic, and pharmacodynamics study of intravenously administered CX-5461 in patients with advanced hematologic malignancies; and CX-5461 CA, which is in phase I clinical trial in patients with solid tumors and breast cancer. It is also developing CX-4945-07, which is in phase I clinical trial, multi-center, open-label, treatment duration increment, expansion, safety, and pharmacodynamic study of CX-4945 administered orally twice daily to patients with advanced basal cell carcinoma; and CX-4945 PBTC-053, a pediatric brain tumor consortium that is in phase I/II clinical trial and surgical study of CX-4945 in patients with recurrent SHH medulloblastoma. The company was founded in 2012 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.senhwabio.com",
    "zipcode": "23143"
  },
  "6535.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Lumosa Therapeutics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "LUMOSA THERAPEUTICS CO LTD",
    "state": null,
    "summary": "Lumosa Therapeutics Co., Ltd. researches and develops drugs for the neurological and inflammatory diseases in Taiwan. The company offers LT - 1001, an analgesic injection that has completed Phase II/III clinical trials for severe pain relief after surgery. It is also developing LT3001, which is in Phase II clinical trial for the treatment of acute ischemic stroke; LT5001 that is in Phase II clinical trial for uremic pruritus; and LT2003, which is in pre-clinical stage for the treatment of oncology. The company was incorporated in 2000 and is based in Taipei City, Taiwan.",
    "website": "http://www.lumosa.com.tw",
    "zipcode": "11503"
  },
  "6547.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Medigen Vaccine Biologics Corporation",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "MEDIGEN VACCINE BIOLOGICS CORPO",
    "state": null,
    "summary": "Medigen Vaccine Biologics Corporation, a biopharmaceutical company, develops and produces vaccines and biologics for unmet medical needs in Taiwan and internationally. The company is developing A 71 to fight against EV71, a member of genus enterovirus; H5N1 and H7N9 mockup vaccines for pandemic influenza; and dengue vaccines. It is also developing biosimilar Palivizumab to prevent respiratory syncytial virus. The company has a collaboration with Dynavax Technologies Corporation to develop a vaccine candidate to protect against COVID-19; and a partnership with BlueWillow Biologics, Inc. to develop intranasal vaccine for SARS-CoV-2. Medigen Vaccine Biologics Corporation was founded in 2012 and is based in Taipei, Taiwan. Medigen Vaccine Biologics Corporation operates as a subsidiary of Medigen Biotechnology Corp.",
    "website": "http://www.medigenvac.com",
    "zipcode": "114"
  },
  "6549.TWO": {
    "city": "Zhubei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "TaiwanJ Pharmaceuticals Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "TaiwanJ",
    "state": null,
    "summary": "TaiwanJ Pharmaceuticals Co., Ltd., a specialty pharmaceutical company, develops and commercializes small molecules for chronic organ inflammation of metabolic, autoimmune, and infectious etiologies in Taiwan. The company also develops JKB-122 and JKB-121; and novel chemical entities for therapy to address chronic liver diseases and allergy/asthma. Its products target diseases that include liver inflammation/liver fibrosis, non-alcoholic steatohepatitis, non-alcoholic fatty liver disease, autoimmune diseases, asthma, and atopic dermatitis. The company was incorporated in 2011 and is based in Zhubei, Taiwan.",
    "website": "http://www.taiwanj.com",
    "zipcode": "30261"
  },
  "6564.TWO": {
    "city": "Taichung City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Enimmune corporation",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ENIM",
    "state": null,
    "summary": "Enimmune corporation operates as a biopharmaceutical Research and development, and marketing company in Taiwan. Its products include Tuberculin PPD RT23 SSI, an approved drug for tuberculin test to determine whether the patient is infected with tuberculosis. The company is also involved in the development of vaccines to prevent various infectious diseases, such as enterovirus, pneumonia, norovirus, dengue fever virus, Middle East respiratory syndrome coronavirus, etc. Enimmune corporation was founded in 2014 and is based in Taichung City, Taiwan.",
    "website": "http://www.enimmune.com.tw",
    "zipcode": null
  },
  "6566.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Chuang Yi Biotech co., ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "CYB",
    "state": null,
    "summary": "Chuang Yi Biotech Co., ltd. engages in the research, development, and marketing of medicines and health foods in Taiwan. The company offers products in the areas of gastrointestinal, metabolism, and regular health care, as well as allergy reducing products. Chuang Yi Biotech Co., ltd. Swas founded in 2011 and is based in Taipei City, Taiwan.",
    "website": "http://www.cybiotech.com.tw",
    "zipcode": "115"
  },
  "6575.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "SyneuRx International (Taiwan) Corp.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SyneuRx",
    "state": null,
    "summary": "SyneuRx International (Taiwan) Corp. develops drugs for the treatment of unmet medical needs in central nervous system disorders in Taiwan. Its pipeline under clinical development includes SND11, which is in Phase IIb/III clinical trial for the treatment of adolescent schizophrenia; SND12 that is in Phase IIb/III clinical trial for therapy on refractory schizophrenia; and SND13, which is in Phase IIb/III clinical trial for the treatment of adult schizophrenia. The company is also developing SND14, which is in Phase IIb/III clinical trial to treat early dementia; SND51 that is in Phase II clinical trial for dementia and psychosis symptoms; SNG12, which is in Phase III clinical trial for the treatment of depression and suicidality; SNA1 that is in Phase II clinical trial to treat refractory depression; and SNB01, which is in Phase II clinical trial for the treatment of COVID-19. SyneuRx International (Taiwan) Corp. was founded in 2013 and is based in New Taipei City, Taiwan.",
    "website": "http://www.syneurx.com",
    "zipcode": "221"
  },
  "6580.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "TaiRx, Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TaiRx",
    "state": null,
    "summary": "TaiRx, Inc., a pharmaceutical company, focuses on the development and commercialization of therapeutics for the treatment of cancer and other diseases. The company's products under development include CVM-1118, an oral anti-cancer drug that is Phase II clinical trial; and Rexis, an add-on injection therapy that is in Phase III clinical trials to treat patients with sepsis. Its pre-clinical products comprise TRX-711 that is used to treat secondary hyperparathyroidism; TRX-920, an oral delivery formulation; and TRX-105, a molecule developed for treating and alleviating symptoms of various colitis. The company also offers Zelnite, a drug that helps in patient's blood Se level and immune system; and focuses on development of the nodal diagnostic devices and anti-body drugs. TaiRx, Inc. was founded in 2011 and is based in Taipei City, Taiwan.",
    "website": "http://www.trx.com.tw",
    "zipcode": "11502"
  },
  "6589.TWO": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "EirGenix Inc.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "EIRGENIX INC",
    "state": null,
    "summary": "EirGenix Inc. operates as a contract development and manufacturing company Taiwan and internationally. Its services include cell line development and cell bank manufacturing, process development, analytical sciences and quality control, cGMP manufacturing, and antibody drug conjugate. The company was founded in 2012 and is based in New Taipei City, Taiwan.",
    "website": "http://www.eirgenix.com",
    "zipcode": "22180"
  },
  "6617.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Gongwin Biopharm Holdings Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "Gongwin",
    "state": null,
    "summary": "Gongwin Biopharm Holdings Co., Ltd., a clinical-stage biopharmaceutical company, develops anticancer drugs. It is developing PTS302, which has completed Phase III clinical trials for the treatment of lung cancer; PTS100, which is in Phase II clinical trials for the treatment of liver cancer; PTS-02 for the treatment of adenoid cystic carcinoma; and PTS500 for the treatment of malignant pleural effusion. The company was founded in 2014 and is based in Taipei, Taiwan.",
    "website": "http://www.gongwinbiopharm.com",
    "zipcode": "10491"
  },
  "6634.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Sinew Pharma Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SINEW",
    "state": null,
    "summary": "Sinew Pharma Inc., a biopharmaceutical company, focuses on the development and sale of drugs for the treatment of hepatotoxicity-free acetaminophen and fatty liver diseases. The company's products include SNP-610 drug, which is in Phase II clinical trial for treating patients with non-alcoholic steatohepatitis in Taiwan; and SNP-630, a pre-clinical drug for treating patients with non-alcoholic steatohepatitis. It is also developing SNP-810 for use in analgesic and antipyretic indications; and SNP-830 and SNP-840, which are used as hepatotoxicity-free analgesic medicines in the United States. The company was founded in 2014 and is based in Taipei City, Taiwan.",
    "website": "http://www.sinewpharma.com",
    "zipcode": "115"
  },
  "6652.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "EUSOL Biotech Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Eusol Bio",
    "state": null,
    "summary": "Eusol Biotech Co.,Ltd. focuses on developing drugs for unmet medical needs. Its pipeline includes ES135, a recombinant human acidic fibroblast growth factor (rhFGF1) for repairing neuron function; and SM-1, a 3-in-1 capsule containing 3 commercial drugs with sedative effect. The company was founded in 2005 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.eusol-biotech.com",
    "zipcode": "10546"
  },
  "6657.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Energenesis Biomedical CO.,LTD.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ENERGENESIS",
    "state": null,
    "summary": "Energenesis Biomedical CO.,LTD. operates in the biomedicine industry in Taiwan. It provides ENERGI-F703, which is Phase II clinical trial for use in treatment of diabetic foot ulcers; ENERGI-F701, a topical tonic for the treatment of alopecia that is in Phase II clinical trial; ENERGI-F711, a burn cream; ENERGI-F702 to treat metabolic diseases; ENERGI-F704 for the treatment of inflammatory bowel disease; ENERGI-F708 for asthma treatment; ENERGI-F705 for Parkinson's disease control; ENERGI-F707 for the treatment of mitochondria deficiency; ENERGI-F706 to treat cachexia; ENERGI-F709, a vaccine adjuvant; and ENERGI-F710 for blood phosphate control. The company also offers scientific products, which include western blot, antibody production, protein purification, and proteome experiment reagents, as well as buffer solutions for scientific researchers. Energenesis Biomedical CO.,LTD. was founded in 2012 and is based in Taipei City, Taiwan.",
    "website": "http://www.energenesis-biomedical.com",
    "zipcode": "11492"
  },
  "6662.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "BioLASCO Taiwan Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "BIOLASCO TAIWAN CO LTD",
    "state": null,
    "summary": "BioLASCO Taiwan Co., Ltd. provides bio-materials and surgical services in Taiwan and internationally. The company is also involved in the design of animal facility; and provision of contract management and training services. It breeds and produces SPF laboratory rats and mice, including outbreed stocks, inbreed strains, and immune deficient models, as well as offers special animal model services. The company also provides endotoxin detection, animal heath diagnostic, and serological kits, as well as biological indicators. In addition, it offers equipment, including IVC systems and ventilated houses; professional and automated animal watering systems; transponders; portable chlorine dioxide gas generators; mouse and rat tail cuff blood pressure systems, analgesia equipment, and animal behavioral equipment; metabolism and behavior systems, and trackers; cabinet X-ray systems; automatic cleaning equipment; workstations; isolation chambers; and foggers. The company is based in Taipei City, Taiwan.",
    "website": "http://www.biolasco.com.tw",
    "zipcode": "115"
  },
  "6709.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Advagene Biopharma Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Advagene",
    "state": null,
    "summary": "Advagene Biopharma Co., Ltd. engages in the research and development of vaccine technology and related products in Taiwan. Its products in development include nasal spray influenza vaccine, allergy vaccines, other vaccines, etc. The company was founded in 1995 and is based in Taipei, Taiwan.",
    "website": "http://www.advagene.com.tw",
    "zipcode": "114"
  },
  "6733.TWO": {
    "city": "Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "BioGend Therapeutics Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "BIOGEND THERAPEUTICS CO LTD",
    "state": null,
    "summary": "BioGend Therapeutics Co., Ltd. develops regenerative bio-orthopaedic medicines. It is developing BiG-001 and BiG-006, an osteo-inductive bone graft substitute; and BiG-009, an autologous chondrocyte repair system. The company is also involved in developing bio-orthopaedic devices and treatment methods to fulfill unmet clinical needs. BioGend Therapeutics Co., Ltd. was founded in 2016 and is based in Taipei City, Taiwan.",
    "website": "http://www.biogend.com.tw",
    "zipcode": "115"
  },
  "6794.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "UnicoCell Biomed Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "UnicoCell",
    "state": null,
    "summary": "UnicoCell Biomed Co., Ltd., a biomedical company, researches and develops stem cell therapeutic products, cell therapy technology, and regenerative medicine applications in Taiwan. It develops CT21-ELIXCYTE, which is in Phase 2 clinical trials for the treatment of knee osteoarthritis; and CT31-ELIXCYTE for the treatment of renal failure. The company offers Perfectin, a stem cell secretion and can be used as a raw material for skin care products; and UnicoVial, a cell storage container. UnicoCell Biomed Co., Ltd. was founded in 2018 and is based in Taipei, Taiwan.",
    "website": "http://www.unicocell.com",
    "zipcode": "11494"
  },
  "6814.TWO": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Lukas Biomedical Inc.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "LUKAS",
    "state": null,
    "summary": "Lukas Biomedical Inc. engages in the research and the development of immunotherapy for cancer treatment. It is also involved in the rental of medical equipment. The company was founded in 2014 and is headquartered in Taipei City, Taiwan.",
    "website": "http://www.lukas-bio.com.tw",
    "zipcode": null
  },
  "6ZD.F": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Oneness Biotech Co., Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Healthcare",
    "short_name": "ONENESS B.GDR REGS/5 TA10",
    "state": null,
    "summary": "Oneness Biotech Co., Ltd. operates as a biopharmaceutical company in Taiwan. The company develops ON101, which is in Phase III clinical trials for treating chronic diabetic foot ulcers; and OB318, an anti- liver cancer drug that completed Phase I clinical trials. It is also developing SNS01, SNA02, and SNA03 that are in pre-clinical stage for the treatment of cancer; FB704A that is in Phase I clinical trial for the treatment of rheumatoid arthritis, cancer, and cytokine storms; and FB825, which is in Phase II clinical trial for treating allergic diseases and asthma. The company was founded in 2008 and is based in Taipei City, Taiwan. Oneness Biotech Co., Ltd. operates as a subsidiary of Microbio Co., Ltd.",
    "website": "http://www.onenessbio.com.tw",
    "zipcode": "106"
  },
  "7TLA.F": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Taiwan Liposome Company, Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "TAIWAN LIPOSOME SP.ADR/2",
    "state": null,
    "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). The BioSeizer lipid formulation technology is designed to enable local sustained release and fast onset of APIs at the site of disease or injury with enhanced pharmacokinetic (PK) control by customization of lipid layers; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III clinical trial for the treatment of knee osteoarthritis pain. The company's product candidates also comprise TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that has completed Phase II clinical trial to treat post-surgical pain; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma; and TLC19 that is in Phase I clinical trial to treat COVID-19.Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.tlcbio.com",
    "zipcode": "11503"
  },
  "8279.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Biotechnology",
    "long_name": "Syngen Biotech Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "SYNGEN BIOTECH CO LTD",
    "state": null,
    "summary": "Syngen Biotech Co., Ltd. operates as a biotech company in Taiwan. The company manufactures and sells active pharmaceutical ingredients, including Mupirocin, an antibiotic against gram-positive bacteria that is used for the topical treatment of superficial infections, such as impetigo and infections, as well as to control infected eczema, wounds, and burns; and nutraceutical ingredients comprising probiotics, medicinal fungi, and entomogenous fungi. It also offers biology fermentation, biology agriculture and aquaculture, and functional food products. The company was founded in 1999 and is based in Tainan City, Taiwan.",
    "website": "http://www.syngen.com.tw",
    "zipcode": "73055"
  },
  "TLC": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "Taiwan Liposome Company, Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Taiwan Liposome Company, Ltd.",
    "state": null,
    "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). The BioSeizer lipid formulation technology is designed to enable local sustained release and fast onset of APIs at the site of disease or injury with enhanced pharmacokinetic (PK) control by customization of lipid layers; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III clinical trial for the treatment of knee osteoarthritis pain. The company's product candidates also comprise TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that has completed Phase II clinical trial to treat post-surgical pain; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma; and TLC19 that is in Phase I clinical trial to treat COVID-19.Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.tlcbio.com",
    "zipcode": "11503"
  }
}
