{
    "1734.TW": {
        "short_name": "SINPHAR PHARMACEUTICAL CO LTD",
        "long_name": "Sinphar Pharmaceutical Co.,Ltd.",
        "summary": "Sinphar Pharmaceutical Co.,Ltd., together with its subsidiaries, researches, develops, manufactures, and sells therapeutic drugs, health care foods, and medical beauty products in Taiwan and internationally. It produces anti-cancer pharmaceuticals, such as injections, solid reagents, and hormone reagents; and tablets, soft gel capsules and powder and canned special nutrient products. The company also provides shampoo, body wash, tonic water, lotions, moisturizers, sunscreen lotions, and serums; and pharmaceutical packaging products, such as eye drop bottles, dry canisters, tablet bottles, and various medical grade plastic containers. In addition, it offers plant extracts and functional foods; and OEM services, such as product design, manufacturing, etc. to manufacturers. Sinphar Pharmaceutical Co.,Ltd. was founded in 1977 and is headquartered in Yilan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Yilan City"
    },
    "1760.TW": {
        "short_name": "PANION & BF BIOTECH INC",
        "long_name": "Panion & Bf Biotech Inc.",
        "summary": "Panion & Bf Biotech Inc., a biotechnology pharmaceutical company, manufactures and sells various pharmaceutical products in Taiwan. The company offers products in the areas of medical beauty, kidney, respiratory tract, gastrointestinal tract, diagnosis, and delayed aging. It also provides oral drugs and external preparations; hand and mechanical disinfection, body lotion, and skin disinfection products; and pet health products, including surgical and skin prescriptions. Panion & Bf Biotech Inc. was founded in 1976 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "3164.TW": {
        "short_name": "GENMONT BIOTECH INC",
        "long_name": "GenMont Biotech Incorporation",
        "summary": "GenMont Biotech Incorporation engages in the research, development, and production of functional probiotics in Taiwan. The company offers functional probiotic raw materials and finished products. It also provides probiotics with special functions; and original formula design and manufacturing, and equipment manufacturing services on health care food, as well as cooperates in the research, production, and clinical trial of various products. GenMont Biotech Incorporation was founded in 2000 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "4133.TW": {
        "short_name": "ABNOVA (TAIWAN) CORPORATION",
        "long_name": "Abnova (Taiwan) Corporation",
        "summary": "Abnova (Taiwan) Corporation manufactures and sells various recombinant proteins and antibodies. It offers DNA and RNA, proteins/peptides, beads/dyes, lysates/slides, antibody pairs/kits, antibody and tissue arrays, in situ hydridization products, circulating rare cells, systems and automations, GMP and analyte specific reagents, and in vitro diagnostics. The company also provides MaxPab, monoclonal, polyclonal, recombinant, conjugate, secondary/tag, and IHC/pathology antibodies. In addition, the company's integrated solutions and services include gene synthesis and cytogenetics; peptide, protein expression, and conjugations; antibody production; and assay development services. Abnova (Taiwan) Corporation is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4142.TW": {
        "short_name": "ADIMMUNE CORPORATION",
        "long_name": "Adimmune Corporation",
        "summary": "Adimmune Corporation manufactures and sells human vaccines in Taiwan. It offers AdimFlu-S, an influenza vaccine; tetanus toxoid alum precipitated products used for prevention of tetanus after injury; Japanese encephalitis vaccines; Trivalent and Tetravalent influenza vaccines; Influenza A (H1N1) virus monovalent vaccines; and Tuberculin, as well as contract manufacturing services. The company was formerly known as Kuo Kwang Serum and Vaccine Manufacture Co., Ltd. and changed its name to Adimmune Corporation in 2001. Adimmune Corporation was founded in 1965 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "6ZD.F": {
        "short_name": "ONENESS B.GDR REGS/5 TA10",
        "long_name": "Oneness Biotech Co., Ltd.",
        "summary": "Oneness Biotech Co., Ltd. operates as a biopharmaceutical company in Taiwan. The company develops ON101, which is in Phase III clinical trials for treating chronic diabetic foot ulcers; and OB318, an anti- liver cancer drug that completed Phase I clinical trials. It is also developing SNS01, SNA02, and SNA03 that are in pre-clinical stage for the treatment of cancer; FB704A that is in Phase I clinical trial for the treatment of rheumatoid arthritis, cancer, and cytokine storms; and FB825, which is in Phase II clinical trial for treating allergic diseases and asthma. The company was founded in 2008 and is based in Taipei City, Taiwan. Oneness Biotech Co., Ltd. operates as a subsidiary of Microbio Co., Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "7TLA.F": {
        "short_name": "TAIWAN LIPOSOME SP.ADR/2",
        "long_name": "Taiwan Liposome Company, Ltd.",
        "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). Its BioSeizer lipid formulation technology enables pharmacokinetic (PK) control and local sustained release of APIs at the site of disease or injury; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. The company provides various product candidates that target various areas of unmet medical need in pain management, ophthalmology, and oncology. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III trial for knee osteoarthritis pain. The company's product candidates also comprises TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that is in Phase II clinical trial for post-surgical pain management; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; and TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma. Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "TLC": {
        "short_name": "Taiwan Liposome Company, Ltd.",
        "long_name": "Taiwan Liposome Company, Ltd.",
        "summary": "Taiwan Liposome Company, Ltd., a clinical-stage specialty pharmaceutical company, engages in the development and commercialization of nanomedicines that combine its proprietary lipid-assembled drug delivery platform with approved active pharmaceutical ingredients (APIs). Its BioSeizer lipid formulation technology enables pharmacokinetic (PK) control and local sustained release of APIs at the site of disease or injury; and NanoX active drug loading technology enables the potential for reduced dosing frequency and enhanced distribution of liposome-encapsulated APIs to the desired site. The company provides various product candidates that target various areas of unmet medical need in pain management, ophthalmology, and oncology. Its lead product candidate is TLC599, an intraarticular injectable BioSeizer formulation of the API steroid dexamethasone sodium phosphate (DSP), which is in Phase III trial for knee osteoarthritis pain. The company's product candidates also comprises TLC590, a non-opioid BioSeizer formulation of the API ropivacaine that is in Phase II clinical trial for post-surgical pain management; TLC399, a multilamellar and multivesicular BioSeizer formulation of DSP, which is in Phase II clinical trial for ophthalmology indications; and TLC178, an API that is in Phase I/II dose escalation trial to treat rhabdomyosarcoma. Taiwan Liposome Company, Ltd. was founded in 1997 and is headquartered in Taipei, Taiwan.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Biotechnology",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}