{
    "1783.TW": {
        "short_name": "MAXIGEN BIOTECH INC",
        "long_name": "Maxigen Biotech Inc.",
        "summary": "Maxigen Biotech Inc. engages in the development, manufacture, and marketing of biomedical and skincare products in Taiwan and internationally. The company offers Formagraft, a bone graft substitute; Formasetin, a bone void filler; and intra-articular injections under the ArtiAid, ArtiAid Plus, and ArtiBest names for use in orthopedic area. It also provides Foramic, a bone substitute granule; MaxiBone, a calcium phosphate ceramic; and GingivAid, a collagen dental grafts for use in orthopedic and dental areas. In addition, the company offers FormaAid, a collagen membrane; and E-TECH DENTISTAR II sterilizer and disinfectant for use in dental area, as well as HealiAid, a collagen wound dressing product for use in dental and wound dressing area. Further, it provides ophthalmic viscoelastic device under the ViscAid, PreviscAid, and BiVisc names; and Formaderm, a dermal filler injection for use in plastic surgery. Additionally, the company offers skincare products, including face, neck, body, limbs, and other masks; and make up remover, cleansing, exfoliating, toner, essence, men's care, sunscreen, body care, hand/foot care, and special care products. Maxigen Biotech Inc. was founded in 1998 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "1786.TW": {
        "short_name": "SCIVISION BIOTECH INC",
        "long_name": "SciVision Biotech Inc.",
        "summary": "SciVision Biotech Inc. manufactures and sells hyaluronic acid products in Taiwan. The company offers medical devices, including absorbable adhesion barriers, dermal implants, synovial fluid supplements, and intravesical instillations. SciVision Biotech Inc. was founded in 2001 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Kaohsiung"
    },
    "4737.TW": {
        "short_name": "BIONIME CORPORATION",
        "long_name": "Bionime Corporation",
        "summary": "Bionime Corporation manufactures and sells medical instruments in Algeria, the United States, Switzerland, China, and internationally. It offers medical testing blood glucose management products for self-monitor and hospital/clinic use, as well as accessories, such as test strips and lancing devices. The company was founded in 2003 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "546.SI": {
        "short_name": "$ Medtecs Intl",
        "long_name": "Medtecs International Corporation Limited",
        "summary": "Medtecs International Corporation Limited, an integrated healthcare products and services provider, manufactures and distributes medical consumables for healthcare distributors, pharmaceutical companies, and hospital groups worldwide. It operates through Manufacturing, Hospital Services, and Distribution segments. The Manufacturing segment produces and sub-contracts a range of medical consumables, including patients' apparels, disposable surgical masks, boot covers and surgical gowns, underpads, adult diapers, crochet blankets, bed linens, and medical bandages. The Hospital Services segment provides laundry and leasing services, including hospital linen rental and laundry, management of hospital laundry facilities, hospital automation, and other non-core hospital functions for hospitals in Taiwan and the Philippines. The Distribution segment markets Medtecs-branded medical consumables to hospitals, pharmacies, and other end users in the Asia Pacific. This segment also supplies other branded medical supplies and equipment comprising wheel chairs, syringes, nebulizers, and blood pressure monitors. Medtecs International Corporation Limited also manufactures, leases, trades in, and sells woven and knitted fabrics, and other made-up articles of textile products; trades in hospital textiles and garments, pillow cases, bed sheets, gowns, and other apparel products; and provides garters and other garment products. It also engages in the subleasing activities; and manufacture and supply personal protective equipment. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "SGD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "6491.TW": {
        "short_name": "PEGAVISION CORPORATION",
        "long_name": "Pegavision Corporation",
        "summary": "Pegavision Corporation manufactures and sells various soft contact lenses, medical optic devices, and precision instruments under the Pegavision brand in Taiwan. It also operates as an OEM for customers internationally. The company was founded in 2009 and is headquartered in Taoyuan City, Taiwan. Pegavision Corporation is a subsidiary of Kinsus Interconnect Technology Corp.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "9103.TW": {
        "short_name": "MEDTECS INTERNATIONAL CORP",
        "long_name": "Medtecs International Corporation Limited",
        "summary": "Medtecs International Corporation Limited, an integrated healthcare products and services provider, manufactures and distributes medical consumables for healthcare distributors, pharmaceutical companies, and hospital groups worldwide. It operates through Manufacturing, Hospital Services, and Distribution segments. The Manufacturing segment produces and sub-contracts a range of medical consumables, including patients' apparels, disposable surgical masks, boot covers and surgical gowns, underpads, adult diapers, crochet blankets, bed linens, and medical bandages. The Hospital Services segment provides laundry and leasing services, including hospital linen rental and laundry, management of hospital laundry facilities, hospital automation, and other non-core hospital functions for hospitals in Taiwan and the Philippines. The Distribution segment markets Medtecs-branded medical consumables to hospitals, pharmacies, and other end users in the Asia Pacific. This segment also supplies other branded medical supplies and equipment comprising wheel chairs, syringes, nebulizers, and blood pressure monitors. Medtecs International Corporation Limited also manufactures, leases, trades in, and sells woven and knitted fabrics, and other made-up articles of textile products; trades in hospital textiles and garments, pillow cases, bed sheets, gowns, and other apparel products; and provides garters and other garment products. It also engages in the subleasing activities; and manufacture and supply personal protective equipment. The company was founded in 1989 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Medical Instruments & Supplies",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    }
}