{
    "4173.TWO": {
        "short_name": "ARICH ENTERPRISE CO. LTD.",
        "long_name": "Arich Enterprise Co., Ltd.",
        "summary": "Arich Enterprise Co., Ltd. provides medical sales and promotion, and logistics services in Taiwan. It promotes prescription drugs and over the counter products in drug stores; and medicines to specific specialties in hospitals, clinics, and drug stores. The company also conducts public seminars, promotional activities, long-term educational program, RTD meetings, in-store displays, anti-counterfeit activities, and medical seminars; and offers channel coverage, inventory control system, order follow-up techniques, and market research analysis. Further, the company offers various supply chain services, including international bond, registration, hospital pricing service, warehouse management, transportation and distribution, account receivable management, information linkage, and drug price submission; logistics services consisting of inventory control, quality control procedure, GMP, and bonded warehouse storage; and value-added services, such as re-labeling, temperature-controlled delivery, handling of returned goods/disposable items, batch-tracking management, customer complaints handling, and delivery systems. The company serves medical centers, area hospitals, district hospitals, and general practitioners, as well as chain stores and hyper markets, drug stores, and wholesalers. Arich Enterprise Co., Ltd. was founded in 1960 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23586",
        "website": "http://www.arich.com.tw",
        "market_cap": "Mid Cap"
    },
    "4175.TWO": {
        "short_name": "MEDFIRST HEALTHCARE SERVICES IN",
        "long_name": "MedFirst Healthcare Services, Inc.",
        "summary": "MedFirst Healthcare Services, Inc. engages in the sale of medical supplies in Taiwan and China. It offers diabetes care, respiratory care, incontinence care, wound dressing, stoma care, pain care, protective gear, home healthcare, and special nutrition products, as well as medical instruments. The company also offers healthcare products consist of beauty care, makeup, and food products, as well as daily supplies and medical books; biomedical products, including health food and drugs; and management consultancy services. In addition, it operates as a contractor for medical supply sales department of hospitals; and agent for foreign medical supplies brand. Further, the company is involved in the management of hospital shopping malls. It sells products through its retail stores and online. MedFirst Healthcare Services, Inc. was founded in 1990 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Healthcare",
        "industry": "Pharmaceutical Retailers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33375",
        "website": "http://www.medfirst.com.tw",
        "market_cap": "Mid Cap"
    }
}