{
    "P8C.SG": {
        "short_name": "PLAISIO COMPUTERS S.A. Namens-A",
        "long_name": "Plaisio Computers S.A.",
        "summary": "Plaisio Computers S.A., together with its subsidiaries, assembles and trades in PCs, telecommunication and office equipment, and domestic appliances in Greece and Bulgaria. It offers desktops, operating systems, laptops, tablets and accessories, peripherals, and data saving devices, as well as services of installation, demonstration, upgrade and repair of PC, etc.; televisions, home cinemas, projectors, TV accessories, and others; cameras and relative accessories, consoles, drones, etc.; and mobile phones, smartphones, accessories, wearables, land phones, fax, etc. The company also provides stationery products, such as calendars, accounting forms, organization of office and storage goods, school bags, design materials and drawing papers, and others; and printing products, which include printers, scanners, photocopiers, multi-machines, consumables, printing papers, etc. In addition, it offers office and visitor chairs, as well as drawing, office, locker, library, and filing and decoration equipment; and classic toys, board games, creative and educational toys, stem, robots, etc. Further, the company provides cookers, ovens, fridges and freezers, dishwashers, coffee machines, cookware, and kitchenware; ironing and laundry products; heaters, air-conditioners, dehumidifier, and fans; and men's and women's grooming products. It serves individuals, as well as B2B customers, including freelancers, small and medium companies, big companies, and the public sector. The company sells its products through a network of stores, department for B2B customers, catalogues, and an Internet-e-store. Plaisio Computers S.A. was founded in 1969 and is headquartered in Magoula, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Magoula"
    }
}