{
    "INTET.AT": {
        "short_name": "INTERTECH S.A. INTER TECH",
        "long_name": "Intertech S.A. Inter. Technologies",
        "summary": "Intertech S.A. Inter. Technologies distributes technology products in Greece. It operates as a distributor of various brands, such as Panasonic, iLuv, Ricoh, Gestetner, and Satellite. The company was founded in 1988 and is based in Elliniko, Greece. Intertech S.A. Inter. Technologies was formerly a subsidiary of Demco Group.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Elliniko",
        "zipcode": "16777",
        "website": "http://www.intertech.gr",
        "market_cap": 4571912
    },
    "LEBEK.AT": {
        "short_name": "N. Levederis (C)",
        "long_name": "N. Leventeris S.A.",
        "summary": "N. Leventeris S.A. manufactures and sells wires and wire ropes in Greece. The company offers steel wires, steel wire ropes, combination ropes, fiber and mooring ropes, wire rope slings, chains, anchors, fiber slings, crosby products, and agricultural wire ropes, as well as accessories comprising hooks, turnbuckles, shackles, and wire rope thimbles. It also provides mooring, synthetic, and natural fiber ropes. N. Leventeris S.A. was founded in 1948 and is headquartered in Piraeus, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18545",
        "website": "http://www.leventeris.gr",
        "market_cap": 4515854
    },
    "LEBEP.AT": {
        "short_name": "N. Levederis (P)",
        "long_name": "N. Leventeris S.A.",
        "summary": "N. Leventeris S.A. manufactures and sells wires and wire ropes in Greece. The company offers steel wires, steel wire ropes, combination ropes, fiber and mooring ropes, wire rope slings, chains, anchors, fiber slings, crosby products, and agricultural wire ropes, as well as accessories comprising hooks, turnbuckles, shackles, and wire rope thimbles. It also provides mooring, synthetic, and natural fiber ropes. N. Leventeris S.A. was founded in 1948 and is headquartered in Piraeus, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Piraeus",
        "zipcode": "18545",
        "website": "http://www.leventeris.gr",
        "market_cap": 1486940
    },
    "OPTRON.AT": {
        "short_name": "OPTRONICS TECHNOLOGIES S.A",
        "long_name": "Optronics Technologies S.A.",
        "summary": "Optronics Technologies S.A. provides services in the fiber optics, optoelectronics, and laser applications markets in Greece. It provides fiber-net products, such as fiber optic cables, patch panels, patchcord-pigtails, adaptors-connectors, racks, cable raceways parts, joint closures, and WDMs-splitters; and FTTH products, including cables, cabinets, distribution boxes, outlets, and splitter panels. The company also offers cabling products consisting of copper cables, outlets-faceplates, patch panels, and jacks-patchcords; network products, such as converters and switches, as well as industrial, fiber optic, CDWM-DWDM, and live fiber monitoring products; and surveillance products, including analog and IP cameras, and DVRs-NVRs. In addition, it provides tools and instruments comprising strippers, cleavers, polishers, fault locators, and blowing machines; splicers; measuring instruments consisting of OTDRs, mini OTDRs, power meter-light sources, and cable testers; labelling solutions that include handheld and desktop printers, and label types and materials; video over fiber products that comprise converters, transmitters, receivers, and amplifiers; and scientific instruments comprising lasers, optics, laser safety, spectrometers, laser meters, and microscopes. Further, the company offers network studies and design, FTTH design, turn-key telecom network, fiber optic network installation, IT integration and control networks, technical support and maintenance, projects and installations, and communication services development services. It serves telecommunication and fiber optic cable manufacturers, PTTs, alternative carriers, universities, institutes, OEM manufacturers, contractors, private companies, and other optoelectronics users. The company was founded in 1990 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Diversified Electronics",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "183 46",
        "website": "http://www.optronics.gr",
        "market_cap": 7867059
    }
}