{
    "AKRIT.AT": {
        "short_name": "AKRITAS S.A. (CR)",
        "long_name": "Akritas S.A.",
        "summary": "Akritas S.A. produces and sells artificial timber products in Greece and internationally. The company provides triple-layered chipboards under the AKRIPAN name, as well as waterproof chipboards under the HYDROPAN name; melamine sheets under the AKRITAS name; and doors, worktops-kitchen tops, and surfaces under the POLYTHETA name. It also offers EVROPANEL, a wood board material used for various constructions, such as shop fitting interior design and trade fair furnishings, interior doors, tables, shelves, home and offices interior design, and partition walls constructions, as well as for sound isolation and thermal applications; and pine and spruce woodworking panels. The company sells its products through distribution centers. Akritas S.A. was founded in 1977 and is headquartered in Alexandroupoli, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Alexandroupoli"
    },
    "IKTIN.AT": {
        "short_name": "IKTINOS HELLAS S.A. (CR)",
        "long_name": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company",
        "summary": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company quarries, cuts, and processes marbles in Greece, the Euro Area, and internationally. The company operates through Marble, Wind Energy, and Real Estate segments. It imports and trades in marbles, granites, and rare decorative stones; and operates as a dealer for artificial rocks and fine mosaics made of natural rocks. The company also offers natural stones, including natural Greek marbles, natural imported marbles, granites, and onyx; synthetic materials, such as quarellas; and other decorative materials comprising travertino, sandstone, psammite, limestone, slate, graphite, glass stone, and gemstone. In addition, it engages in the aeolian energy and real estate businesses. Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company was founded in 1974 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "MATHIO.AT": {
        "short_name": "MATHIOS REFRACTORY S.A.",
        "long_name": "Mathios Refractories S.A.",
        "summary": "Mathios Refractories S.A. engages in the production and sale of refractory materials and building products in Greece and internationally. The company offers stones, bricks, and pavers; building materials, including glass blocks, firebricks, mortars and additives, and flooring and thermal insulation products; heating solutions, such as eco fireplaces, eco stoves, heat backs, and bioethanole fireplaces; and landscaping products comprising mat grass, mat green, vermiculite, forest whisper, and garden steps. It also offers research and development, engineering, procurement, installation, and other support services. The company provides its products under the brand names of IDEAL, MAT, MAT PLUS, MAT CAST, MAT MICRON and MAT NANO, MAT SF, and MAT RAM. It serves cement, steel, ceramic, aluminum, glass power plant, refinery, wood, food, lime, and fertilizer industries. The company was founded in 1890 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    }
}