{
    "BYTE.AT": {
        "short_name": "BYTE COMPUTER S.A. (CR)",
        "long_name": "Byte Computer S.A.",
        "summary": "Byte Computer S.A. provides integrated IT and communication solutions in Greece and internationally. It offers system integration, software development, and technology unification services. The company also provides virtualization solutions; security solutions for corporate firewalls and end-users, as well as threat and penetration management solutions, which identify security gaps based on network behavior and traffic; cloud computing solutions; storage and data solutions; email and messaging, and collaborative solutions; document and workflow management solutions; business process management solutions, which integrate with existing ERP or CRM systems; and mobile device management solutions. It also provides network and communication infrastructure, such as routers, switches, and IP telephony equipment, as well as cabling assessment services, and communication and collaboration solutions; server systems; and business continuity solutions. In addition, the company offers software products comprising SAP Business One for managing various business processes; business solutions; custom development; and custom and enterprise solutions. Further, it provides infrastructure assessment and installation services; IT outsourcing services; maintenance services; service desk and support services; and professional services. Byte Computer S.A. was founded in 1983 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "117 41",
        "website": "http://www.byte.gr",
        "market_cap": "Nano Cap"
    },
    "CPI.AT": {
        "short_name": "CPI S.A. (CR)",
        "long_name": "CPI Computer Peripherals International",
        "summary": "CPI Computer Peripherals International provides IT products and services in Greece. The company offers printers for business applications; barcode/RF-ID printers and scanners, and hand-held portables; scanners and digitization products; surveillance and security products; projectors and specialized products for the education sector; POS terminals and peripherals for tourism, and food and retail businesses; and interactive systems. It also provides CPI product technical support, digitization and document management, and print management services, as well as install, move, add, and change services for computer equipment; technical support services for third-party manufacturers; and custom, consultation, and infrastructure services. The company was founded in 1990 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "177 78",
        "website": "http://www.cpi.gr",
        "market_cap": "Nano Cap"
    },
    "NRST.MI": {
        "short_name": "NEUROSOFT",
        "long_name": "Neurosoft Software Production S.A.",
        "summary": "Neurosoft Software Production S.A., a software production and ICT company, design, develops, customizes, and maintains integrated software systems in the areas of Fintech and analytics, systems engineering, and cyber security operations in Greece and internationally. The company offers Consensus For Invoice Reconciliation Management (ConFIRM), a platform that targets to alleviate all issues that accounting office's face in the process of invoice reconciliation; Proxima+, an E2E factoring and supply chain finance platform, which manages firms' receivables finance business; Angel, a cyber-security solution for maritime that addresses the cyber threat; and Illicium, a cyber-deception platform. It also provides Neutrify, a security operations center, monitors and analyzes activity on networks, servers, endpoints, databases, applications, websites, and other systems and looks for anomalous activity, as well as offers advanced forensic analysis, and malware reverse engineering to analyze incidents; RedyOps, which assists in evaluating the security of organization and helps to defend from attacks combining targets such as people, technology, and physical security; and Enterprise Link, a business connectivity service. Neurosoft Software Production S.A. was founded in 1994 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "141 22",
        "website": "http://www.neurosoft.gr",
        "market_cap": "Nano Cap"
    },
    "PERF.AT": {
        "short_name": "PERFORMANCE TECHNOLOGIES A.E",
        "long_name": "Performance Technologies S.A.",
        "summary": "Performance Technologies S.A. provides IT Solutions in Greece. The company focus on data center technologies, including servers, storage, networking, and virtualization; hybrid cloud, automation and DevOps; security and information governance; big data and analytics; IT service management/ enterprise service management; service and digital user experience monitoring; and mobility and Internet of Things (IoT). It offers hybrid IT solutions, which include infrastructure, virtualization, data protection, application platforms, DC automation, and cloud solutions; network, mobility and IoT solutions comprising campus networking, DC networks, locations, mobile workplace, and mobile application testing; security and information governance, such as data discovery and classification, encryption and masking, identity and access management, application security, and general data protection regulation; and enterprise service management and DevOps solutions including IT and enterprise service management, business process management, unified operations management, digital experience management, asset management, DevOps and test automation, and process automation. It also offers big data and analytics solutions; and Red Hat and Veritas educational services. Performance Technologies S.A. was founded in 1993 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "104 35",
        "website": "http://www.performance.gr",
        "market_cap": "Nano Cap"
    },
    "QUEST.AT": {
        "short_name": "QUEST HOLDING S.A.",
        "long_name": "Quest Holdings S.A.",
        "summary": "Quest Holdings S.A., together with its subsidiaries, engages distribution of information technology and telecommunications products. The company operates in five segments: Information Technology; Information Technology Services; Courier Services; Production of Electric Power from Renewable Sources; and Financial Transactions. It distributes Apple products, and related software and peripherals; operates an online store, you.gr, which provides technology products, consumer electronics, small/large domestic appliances, daily care products, and household and baby care products; and operates Apple products retail store. The company also engages in design, application, and support of integrated systems and technology solutions; and production of electric power from renewable sources. In addition, it provides electronic transactions management solutions; mobility and Internet of Things; cloud; and courier and postal services. The company offers its products and services in Greece, Romania, Cyprus, Belgium, Italy, and Luxembourg. Quest Holdings S.A. was founded in 1981 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "176 76",
        "website": "http://www.quest.gr",
        "market_cap": "Micro Cap"
    }
}