{
    "FP6N.SG": {
        "short_name": "Frigoglass S.A. Namens-Aktien E",
        "long_name": "Frigoglass S.A.I.C.",
        "summary": "Frigoglass S.A.I.C., together with its subsidiaries, engages in the manufacturing, trading, and distribution of commercial refrigeration units and packaging materials for the beverage industry. The company operates through Ice Cold Merchandise Operations and Glass Operations segments. It also offers glass bottles and containers, primarily for soft drinks, beer, and spirits industries, as well as in the cosmetics and pharmaceutical industries; and produces plastic crates and metal crowns. In addition, the company provides integrated, standard and post warranty, repair call management, rebranding and refurbishment, one-to-one placement, spare parts management, preventive maintenance, and technical training services. It operates in east Europe, west Europe, Africa, the Middle East, Asia, Oceania, and the United States. The company was founded in 1996 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Athens"
    },
    "PAIR.AT": {
        "short_name": "E. PAIRIS S.A (CR)",
        "long_name": "E. Pairis S.A.",
        "summary": "E. Pairis S.A. produces and sells plastic products made of polyethylene, polypropylene, and terepthalic polyethylene in Greece. The company was founded in 1954 and is based in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Packaging & Containers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Aspropyrgos"
    },
    "PLAT.AT": {
        "short_name": "THRACE PLASTICS HOLD. & COM SA",
        "long_name": "Thrace Plastics Holding and Commercial S.A.",
        "summary": "Thrace Plastics Holding and Commercial S.A. produces and distributes polypropylene products in Greece and internationally. The company provides various technical fabrics, such as woven and non-woven geotextiles, geogrids, geocomposites, geosynthetic clay liners, drainage geonets, geobags, silt fences, erosion corrosion mats, and mini rolls; stadium seats, ridge fabrics, roofing membranes, housewraps, concrete fibers, scaffolding, road safety nets, and vapor control layers for use in construction; and ground covers, root barriers, weather protection and crop covers, foliage removal fabrics, heavy duty protection fabrics, mulching, nets, cages/screens/shades, ropes, and twines for agri/horticulture/aquaculture. It also offers fabrics for landscape gardening; trampoline fabrics and pool covers for sport and leisure use; gowns and drapes, instrument tray wraps, medical wipes, ostomy, and mattress protection fabrics for medical and hygiene use; air and liquid filtration fabrics; and covering-separation, pocket spring, and table cloth fabrics, as well as fabrics for aquashield and bedding reinforcements. In addition, the company provides fabrics for automotive flooring and seating, and car covers; packaging fabrics; advanced fabrics/composites; floor coverings; and industrial fabrics for use in tarpaulin, lamination-reinforcing substrates, passenger transport, defense, industrial workwear, and absorbents, as well as FIBC fabrics and components. Further, it offers ARNO webbings/straps/ropes; industrial yarns and fibers; and FIBC/filling solutions, bags/FFS films, pallet coverings/packaging films, container liners/cargo protection, injections/buckets/pails/containers, thermoforming cups, EPS containers and trays, ropes and twines, crates, bags in boxes, and garbage bags. The company was founded in 1977 and is based in Alimos, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Packaging & Containers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Alimos"
    },
    "PPAK.AT": {
        "short_name": "PAPERPACK S.A. (CR)",
        "long_name": "Paperpack A.B.E.E.",
        "summary": "Paperpack A.B.E.E. operates in the carton packaging industry in Greece and internationally. The company offers packaging solutions to pharmaceutical, personal care, food, tobacco, beverage and spirits, pop, and other industries. It also exports its products. The company was formerly known as TSOUKARIDIS J. CARTON PACKAGING INDUSTRY and changed its name to Paperpack A.B.E.E. in February 1999. Paperpack A.B.E.E. was founded in 1891 and is based in Kifissia, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Packaging & Containers",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Kifissia"
    }
}