{
    "ASCO.AT": {
        "short_name": "A.S. COMPANY S.A. (CR)",
        "long_name": "As Commercial Industrial Company of Computers and Toys S.A.",
        "summary": "As Commercial Industrial Company of Computers and Toys S.A. manufactures, imports, and trades in toys for various ages in Greece and internationally. It offers approximately 1,500 game codes. The company also sells its products online. In addition, it is involved in the wholesale trade of toys and computers; and import of kids clothing. The company was founded in 1990 and is headquartered in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Recreational Goods, Other",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Thessaloniki",
        "zipcode": "570 13",
        "website": "http://www.ascompany.gr",
        "market_cap": "Nano Cap"
    },
    "BELA.AT": {
        "short_name": "JUMBO S.A. (CR)",
        "long_name": "Jumbo S.A.",
        "summary": "Jumbo S.A. engages in the retail of toys, baby products, gift articles, household products, stationery, seasonal and decoration items, books, and related products. As of December 31, 2020, the company operated 80 stores, including 52 stores in Greece, 5 stores in Cyprus, 9 stores in Bulgaria, and 14 stores in Romania. It also operates e-jumbo, an online store. In addition, the company is involved in the wholesale of toys and related products to third parties. Jumbo S.A. was incorporated in 1986 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Recreational Goods, Other",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "183 46",
        "website": "http://www.e-jumbo.gr",
        "market_cap": "Mid Cap"
    },
    "KYRI.AT": {
        "short_name": "KIRIAKOULIS SHIPPING S.A.",
        "long_name": "Kiriacoulis Mediterranean Cruises Shipping SA",
        "summary": "Kiriacoulis Mediterranean Cruises Shipping SA, together with its subsidiaries, engages in the professional sea tourism, tourist ports management, and real estate businesses. It offers yacht chartering services, flotillas, bareboat chartering services, crew chartering services, etc. The company also sells new and second hand yachts, including sailboats, monohulls, catamarans, and motorboats, as well as provides parking spaces. It operates through a fleet of approximately 270 owned and managed yachts in Greece, Italy, Croatia, France, Malta, Spain, the Caribbean, and internationally. The company was founded in 1980 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Recreational Goods, Other",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "174 55",
        "website": "http://www.kiriacoulis.com",
        "market_cap": "Nano Cap"
    }
}