{
    "2FH.SG": {
        "short_name": "Fourlis Holdings S.A. Namens-Ak",
        "long_name": "Fourlis Holdings S.A.",
        "summary": "Fourlis Holdings S.A., together with its subsidiaries, engages in the retail trading activities in Greece, Romania, Cyprus, Bulgaria, Turkey, and internationally. It is involved in the retail trade of home furniture and household goods through IKEA stores; and sporting goods through INTERSPORT and TAF stores. As of December 31, 2019, the company operated 16 TAF stores, including 13 in Greece and three in Turkey. It also operates 7 IKEA stores, including 5 stores in Greece, 1 in Cyprus, and 1 in Bulgaria; 6 pick-up and order points in Greece and 3 pick-up and order points in Bulgaria; and 3 e-commerce stores in Greece, Cyprus, and Bulgaria. In addition, the company operates 119 INTERSPORT stores, including 50 stores in Greece, 31 in Romania, 24 in Turkey, 9 in Bulgaria, and 6 in Cyprus, as well as e-commerce stores in Greece, Romania, and Cyprus. Further, it has franchised sporting goods stores under the THE ATHLETE'S FOOT name in Greece and Turkey; and provides catering services in Greece, Cyprus, and Bulgaria, as well as warehousing services. The company was formerly known as Fourlis Bros S.A. and changed its name to Fourlis Holding S.A. in March 2000. Fourlis Holding S.A. was founded in 1950 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Greece",
        "city": "Marousi"
    },
    "JUMSY": {
        "short_name": "JUMBO SA",
        "long_name": "Jumbo S.A.",
        "summary": "Jumbo S.A. engages in the retail of toys, baby products, gift articles, household products, stationery, seasonal and decoration items, books, and related products. As of December 31, 2020, the company operated 80 stores, including 52 stores in Greece, 5 stores in Cyprus, 9 stores in Bulgaria, and 14 stores in Romania. It also operates e-jumbo, an online store. In addition, the company is involved in the wholesale of toys and related products to third parties. Jumbo S.A. was incorporated in 1986 and is headquartered in Athens, Greece.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Greece",
        "city": "Athens"
    }
}