{
  "DUR.AT": {
    "city": "Patras",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Textile - Apparel Clothing",
    "long_name": "Duros S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Goods",
    "short_name": "DUROS S.A. (CR)",
    "state": null,
    "summary": "Duros S.A. operates as a menswear company in Greece. It offers shirts, polo shirts, knitwear and cardigans, T-shirts, trousers, jackets, suits, blazers, and shoes. The company operates 30 retail shops all over Greece under the DUR label, as well as exports to the Middle East, Lebanon, Albania, Cyprus, the Czech Republic, and Bulgaria. It also sells its products online. The company was founded in 1960 and is based in Patras, Greece.",
    "website": "http://www.dur.gr",
    "zipcode": "26331"
  },
  "ELBE.AT": {
    "city": "Kavala",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "Textile - Apparel Clothing",
    "long_name": "Elve S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Goods",
    "short_name": "ELVE S.A. (CR)",
    "state": null,
    "summary": "Elve S.A. manufactures and sells ready-made garments in France and internationally. The company offers corporate clothing for business premises, such as museums, banks, casinos, hotels, and organizations; T-shirts, hoodies, and polos for customer service sectors, including gas stations and telecommunication stores; labor clothing, such as sleeves, work pants, waterproof clothes, overalls, safety shoes, reflective clothing, gloves, hats, and accessories; and safety suits and personal protective clothing, including bulletproof vests, and clothing bags, as well as isothermal and flammable clothes for police, military, and armed forces. It also invests in and owns 5 solar energy parks with a total capacity of 5.3 MW. The company was founded in 1971 and is headquartered in Kavala, Greece.",
    "website": "http://www.elvesa.gr",
    "zipcode": "64007"
  }
}
