{
    "4090.SR": {
        "short_name": "Taiba Investments Co.",
        "long_name": "Taiba Investments Co.",
        "summary": "Taiba Investments Co. invests in, owns, buys, sells, leases, operates, maintains, and manages real estate properties in Saudi Arabia. The company also invests in, owns, operates, maintains, and manages hotels, hospitals, and recreational and tourist facilities; and operates, maintains, and manages cities, and public and private facilities. In addition, the company is involved in architectural, civil, mechanical, and electrical contracting; and agricultural, industrial, and mining activities. Further, it is involved in the provision of credit and mortgage services. The company was formerly known as Taiba Holding Co. and changed its name to Taiba Investments Co. in May 2019. Taiba Investments Co. was founded in 1988 and is headquartered in Medina, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Medina",
        "zipcode": "41472",
        "website": "http://www.taiba.com.sa",
        "market_cap": "Small Cap"
    },
    "4150.SR": {
        "short_name": "Arriyadh Development Co.",
        "long_name": "Arriyadh Development Co.",
        "summary": "Arriyadh Development Co. builds, manages, rents, and sells facilities, commercial and residential buildings, prefabricated buildings, government buildings, service buildings, public parks, and tourism and residential compounds in Saudi Arabia. It also engages in the management, rental, and sale of construction projects, commercial and industrial exhibitions, and renovations of residential and non-residential buildings. The company was founded in 1993 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11462",
        "website": "http://www.ardco.com.sa",
        "market_cap": "Small Cap"
    },
    "4220.SR": {
        "short_name": "Emaar The Economic City",
        "long_name": "Emaar The Economic City",
        "summary": "Emaar The Economic City operates as a real estate development and management company in Saudi Arabia. The company primarily develops the King Abdullah Economic City. It also develops infrastructures; promotes, markets, and sells land within development areas; transfers/leases land; develops buildings/housing units; and constructs on behalf of other parties. In addition, the company develops, invests in, markets, sells/leases, operates, and maintains properties; and provides higher education services. Emaar The Economic City was founded in 2006 and is headquartered in King Abdullah Economic City, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "King Abdullah Economic City",
        "zipcode": "23965",
        "website": "http://www.kaec.net",
        "market_cap": "Mid Cap"
    },
    "4250.SR": {
        "short_name": "Jabal Omar Development Co.",
        "long_name": "Jabal Omar Development Company",
        "summary": "Jabal Omar Development Company operates as a real estate development company in Saudi Arabia. The company operates through Operating Hotels, Commercial Centers, and Properties for Development and Sale segments. It engages in the investment, development, management, and sale of plots in the Jabal Omar project located in Makkah. It is also involved in the construction, maintenance, management, demolishing, surveying, furnishing hotels, commercial facilities, and staff residences, as well as operation of hotels. In addition, the company engages in importing and exporting hotel equipment and furniture. Jabal Omar Development Company operates hotels, including the Marriott, a five-star hotel with 426 rooms and suites; the Hilton Suites, a five-star hotel with 484 suites; the Hyatt Regency, a five-star hotel with 657 rooms and suites; and the Conrad, a five-star hotel with 438 rooms and suites; and Jabal Omar DoubleTree by Hilton with 676 rooms and suites. It also develops residential projects; and a commercial center. Further, the company provides logistic services. Jabal Omar Development Company was founded in 2006 and is based in Mecca, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Mecca",
        "zipcode": null,
        "website": "http://www.jabalomar.com.sa",
        "market_cap": "Mid Cap"
    },
    "4300.SR": {
        "short_name": "Dar Alarkan Real Estate Develop",
        "long_name": "Dar Al Arkan Real Estate Development Company",
        "summary": "Dar Al Arkan Real Estate Development Company, together with its subsidiaries, primarily engages in the development, sale, and lease of real estate projects in the Kingdom of Saudi Arabia. The company operates in two segments, Development Properties and Asset Management. It is involved in the acquisition, development, construction, management, operation, and maintenance of residential and commercial buildings, and public facilities. The company also engages in the purchase and sale, acquisition, and leasing of real estate investments; and purchase of land and general contracting activities. Dar Al Arkan Real Estate Development Company was founded in 1994 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "12622",
        "website": "http://www.daralarkan.com",
        "market_cap": "Mid Cap"
    },
    "4310.SR": {
        "short_name": "Knowledge Economic City",
        "long_name": "Knowledge Economic City Company",
        "summary": "Knowledge Economic City develops properties and other land in the economic cities of Saudi Arabia. It undertakes projects, including infrastructure, telecommunications and Internet networks, water and electricity networks, water treatment plants, and other works related to the development of the economic cities. The company also engages in the creation, operation, and management of educational projects; and development of software, scientific research centers, universities, colleges, institutes, and academies. In addition, its activities include marketing and selling real estate properties; buildings and land for development or for ownership of others; and managing housing services, tourist projects, resorts, hotels and furnished apartments, and other activities. The company was founded in 2010 and is based in Medina, the Kingdom of Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Medina",
        "zipcode": "41561",
        "website": "http://www.madinahkec.com",
        "market_cap": "Mid Cap"
    },
    "4320.SR": {
        "short_name": "Alandalus property Co.",
        "long_name": "Alandalus Property Company",
        "summary": "Alandalus Property Company engages in the commercial real estate investment and development activities in the Kingdom of Saudi Arabia. It constructs, owns, and manages centers, and commercial and residential complexes. The company is also involved in the general contracting of residential and commercial buildings, educational, recreational, health institutions, roads, dams, water and sewage project, electrical, and mechanical works. In addition, it engages in the leasing, maintenance, and operation of real estate properties, buildings, and commercial complexes, as well as ownership, development, and investment of lands and real estate properties. Alandalus Property Company was founded in 2006 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11342",
        "website": "http://www.alandalus.com.sa",
        "market_cap": "Small Cap"
    },
    "4321.SR": {
        "short_name": "Arabian Centres Co.",
        "long_name": "Arabian Centres Company",
        "summary": "Arabian Centres Company develops, owns, and operates contemporary lifestyle centers in the Kingdom of Saudi Arabia. It operates a portfolio of 21 lifestyle centers in 11 cities, which comprise approximately 4,300 retail stores. The company also builds, leases, and sells buildings; and engages in the construction of commercial buildings, including demolition, repair, excavation, and maintenance works. In addition, it is involved in the maintenance and operation of commercial centers, tourist resorts, hotels, and restaurants; and managing and operating temporary and permanent exhibitions, compounds, and hospitals. The company was founded in 2002 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11333",
        "website": "http://www.arabiancentres.com",
        "market_cap": "Mid Cap"
    },
    "4330.SR": {
        "short_name": "Riyad REIT Fund",
        "long_name": "Riyad REIT Fund",
        "summary": "Riyad REIT specializes in real estate investing.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "13241",
        "website": "http://www.riyadcapital.com/en/asset-management/public-funds/reits/riyad-reit",
        "market_cap": "Small Cap"
    },
    "4336.SR": {
        "short_name": "Mulkia Gulf Real Estate REIT",
        "long_name": "Mulkia Gulf Real Estate REIT",
        "summary": "Mulkia Gulf Real Estate REIT is a Shariah compliant real estate investment trust externally managed by Mulkia Investment Company. It invests in real estate markets of Saudi Arabia. The firm primarily invests in income generating real estates, which are under four specific real estate assets in major cities within Saudi Arabia. Mulkia Gulf Real Estate REIT Fund is based in Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11573",
        "website": "http://www.mulkia.com.sa/mulkia-gulf-real-estates-reit-fund/",
        "market_cap": "Small Cap"
    },
    "4344.SR": {
        "short_name": "SEDCO Capital REIT Fund",
        "long_name": "SEDCO Capital REIT Fund",
        "summary": "SEDCO Capital REIT is a Shariah-compliant real estate investment traded fund externally managed by SEDCO Capital. it invests in single-tenant and multiple-tenant properties across Saudi Arabia. SEDCO Capital REIT is based in Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Jeddah",
        "zipcode": "21491",
        "website": "http://www.sedcocapital.com/reit",
        "market_cap": "Small Cap"
    },
    "9511.SR": {
        "short_name": "Sumou Real Estate Co.",
        "long_name": "Sumou Real Estate Company",
        "summary": "Sumou Real Estate Company engages in the development, management, maintenance, sale, and rental of residential and non-residential properties in Saudi Arabia. It also engages in the general building contracts, including construction, repair and renovation, and demolition for residential compounds, commercial centers, educational and entertainment, health and sports facilities, and hotels and restaurants; the provision of real estate project management services; and investment in real estate and project development. The company was founded in 2007 and is based in Al Khobar, Saudi Arabia. Sumou Real Estate Company is a subsidiary of Sumou Holding Company.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Al Khobar",
        "zipcode": "31952",
        "website": "http://www.sumou.com.sa",
        "market_cap": null
    }
}