{
    "4250.SR": {
        "short_name": "Jabal Omar Development Co.",
        "long_name": "Jabal Omar Development Company",
        "summary": "Jabal Omar Development Company operates as a real estate development company in Saudi Arabia. The company operates through Operating Hotels, Commercial Centers, and Properties for Development and Sale segments. It engages in the investment, development, management, and sale of plots in the Jabal Omar project located in Makkah. It is also involved in the construction, maintenance, management, demolishing, surveying, furnishing hotels, commercial facilities, and staff residences, as well as operation of hotels. In addition, the company engages in importing and exporting hotel equipment and furniture. Jabal Omar Development Company operates hotels, including the Marriott, a five-star hotel with 426 rooms and suites; the Hilton Suites, a five-star hotel with 484 suites; the Hyatt Regency, a five-star hotel with 657 rooms and suites; and the Conrad, a five-star hotel with 438 rooms and suites; and Jabal Omar DoubleTree by Hilton with 676 rooms and suites. It also develops residential projects; and a commercial center. Further, the company provides logistic services. Jabal Omar Development Company was founded in 2006 and is based in Mecca, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Mecca",
        "zipcode": null,
        "website": "http://www.jabalomar.com.sa",
        "full_time_employees": null
    },
    "4321.SR": {
        "short_name": "Arabian Centres Co.",
        "long_name": "Arabian Centres Company",
        "summary": "Arabian Centres Company develops, owns, and operates contemporary lifestyle centers in the Kingdom of Saudi Arabia. It operates a portfolio of 21 lifestyle centers in 11 cities, which comprise approximately 4,300 retail stores. The company also builds, leases, and sells buildings; and engages in the construction of commercial buildings, including demolition, repair, excavation, and maintenance works. In addition, it is involved in the maintenance and operation of commercial centers, tourist resorts, hotels, and restaurants; and managing and operating temporary and permanent exhibitions, compounds, and hospitals. The company was founded in 2002 and is based in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11333",
        "website": "http://www.arabiancentres.com",
        "full_time_employees": null
    }
}