{
    "4090.SR": {
        "short_name": "Taiba Investments Co.",
        "long_name": "Taiba Investments Co.",
        "summary": "Taiba Investments Co. invests in, owns, buys, sells, leases, operates, maintains, and manages real estate properties in Saudi Arabia. The company also invests in, owns, operates, maintains, and manages hotels, hospitals, and recreational and tourist facilities; and operates, maintains, and manages cities, and public and private facilities. In addition, the company is involved in architectural, civil, mechanical, and electrical contracting; and agricultural, industrial, and mining activities. Further, it is involved in the provision of credit and mortgage services. The company was formerly known as Taiba Holding Co. and changed its name to Taiba Investments Co. in May 2019. Taiba Investments Co. was founded in 1988 and is headquartered in Medina, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Medina",
        "zipcode": "41472",
        "website": "http://www.taiba.com.sa",
        "full_time_employees": null
    },
    "4150.SR": {
        "short_name": "Arriyadh Development Co.",
        "long_name": "Arriyadh Development Co.",
        "summary": "Arriyadh Development Co. builds, manages, rents, and sells facilities, commercial and residential buildings, prefabricated buildings, government buildings, service buildings, public parks, and tourism and residential compounds in Saudi Arabia. It also engages in the management, rental, and sale of construction projects, commercial and industrial exhibitions, and renovations of residential and non-residential buildings. The company was founded in 1993 and is headquartered in Riyadh, Saudi Arabia.",
        "currency": "SAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "SAU",
        "market": "sr_market",
        "country": "Saudi Arabia",
        "state": null,
        "city": "Riyadh",
        "zipcode": "11462",
        "website": "http://www.ardco.com.sa",
        "full_time_employees": null
    }
}