{
    "0Q0C.L": {
        "short_name": "TOSHIBA CORP TOSHIBA ORD SHS",
        "long_name": "Toshiba Corporation",
        "summary": "Toshiba Corporation, together with its subsidiaries, provides electronic devices and storage solutions worldwide. It operates through seven segments: Energy Systems & Solutions, Infrastructure Systems & Solutions, Building Solutions, Retail & Printing Solutions, Electronic Devices & Storage Solutions, Digital Solutions, and Others. The company provides energy systems and solutions, including nuclear, thermal, and renewable energy power generation systems; transmission and distribution, hydrogen energy, and heavy-ion therapy systems; and energy digital services. It also offers infrastructure systems and solutions, such as water supply and wastewater treatment, traffic control, defense and electronic, railway transportation, substation, broadcasting and network, security and automation, and motor/drive systems; and building solutions comprising elevators, escalators, building facilities, electrical construction materials, lighting equipment, airport ground lighting systems, stage and studio lighting systems, automotive light sources, industrial light sources and modules, air conditioners, multi systems for buildings, heat source systems, heat pump hot water supply systems, ventilating fans, ventilating systems, and cold-chain equipment. In addition, the company provides retail and printing solutions, including POS systems, multifunction peripherals, automatic identification systems, and inkjet heads; electronic devices and storage solutions, such as semiconductors, analog integrated circuits (ICs), microcontrollers, automotive digital ICs, hard disk drives, semiconductor manufacturing equipment, thermal print heads, and ceramics; and digital solutions comprising AI/analytics, ICT infrastructure, IoT solutions, security solutions, and managed services. Further, it offers rechargeable lithium-ion batteries, modules, and packs; and computers and tablets, visual products, and home appliances. Toshiba Corporation was founded in 1875 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8001",
        "website": "http://www.toshiba.co.jp",
        "full_time_employees": 125648
    },
    "0Q18.L": {
        "short_name": "CATERPILLAR INC CATERPILLAR ORD",
        "long_name": "Caterpillar Inc.",
        "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Farm & Construction Machinery",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "IL",
        "city": "Deerfield",
        "zipcode": "60015",
        "website": "http://www.caterpillar.com",
        "full_time_employees": 97300
    },
    "AAAK.AT": {
        "short_name": "Tria Alfa (CR)",
        "long_name": "Wool Industry Tria Alfa S.A.",
        "summary": "Wool Industry Tria Alfa S.A. engages in the wholesale of fabrics. It offers disposable medical-hospital type mask and polo blouses. The company was founded in 1927 is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "14234",
        "website": "http://triaalfa.webnode.gr",
        "full_time_employees": 7
    },
    "AAAP.AT": {
        "short_name": "Tria Alfa (PR)",
        "long_name": "Wool Industry Tria Alfa S.A.",
        "summary": "Wool Industry Tria Alfa S.A. engages in the wholesale of fabrics. It offers disposable medical-hospital type mask and polo blouses. The company was founded in 1927 is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "14234",
        "website": "http://triaalfa.webnode.gr",
        "full_time_employees": 7
    },
    "ABBN.MX": {
        "short_name": "ABB LTD",
        "long_name": "ABB Ltd",
        "summary": "ABB Ltd manufactures and sells electrification, industrial automation, and robotics and motion products for customers in utilities, industry and transport, and infrastructure worldwide. Its Electrification segment provides electric vehicle charging infrastructure, renewable power solutions, modular substation packages, distribution automation products, switchboard and panel boards, switchgears, UPS solutions, circuit breakers, measuring and sensing devices, control products, wiring accessories, enclosures and cabling systems, and intelligent home and building solutions for integrating and automating lighting, heating, ventilation, security, and data communication networks. The company's Robotics & Discrete Automation segments provides industrial robots, software, robotic solutions and systems, field services, spare parts, and digital services. This segment also offers solutions based on its programmable logic controllers, industrial PCs, servo motion, transport systems, and machine vision. Its Industrial Automation segment develops and sells industry-specific, integrated automation, and electrification systems and solutions, as well as digital solutions, lifecycle services, and artificial intelligence applications for the process and hybrid industries. This segment also offers process and discrete control technologies, advanced process control software and manufacturing execution systems, sensing, measurement, analytical instrumentation, electric ship propulsion systems, and large turbochargers, as well as remote monitoring, preventive maintenance, asset performance management, and cybersecurity services. The company's Motion segment manufactures and sells drives, motors, generators, traction converters, and mechanical power transmission products. ABB Ltd has a strategic collaboration with IBM. ABB Ltd was founded in 1883 and is headquartered in Zurich, Switzerland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "state": null,
        "city": "Zurich",
        "zipcode": "8050",
        "website": "http://www.global.abb/group/",
        "full_time_employees": 105330
    },
    "ACA.MX": {
        "short_name": "ARCOSA INC",
        "long_name": "Arcosa, Inc.",
        "summary": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structures, and Transportation Products. The Construction Products segment offers natural and lightweight aggregates; specialty materials, including lightweight aggregates and plaster; trench shields and shoring products for residential and non-residential construction, agriculture, specialty building products, and underground construction markets, as well as for infrastructure, including road, bridge, and other public products markets. The Engineered Structures segment provides utility structures, wind towers, traffic and lighting structures, telecommunication structures, storage and distribution tanks for electricity transmission and distribution, wind power generation, highway road construction, and wireless communication markets, as well as for gas and liquids storage and transportation for residential, commercial, agriculture, and industrial markets. The Transportation Products segment offers inland barges; fiberglass barge covers, winches, and other components; axles and couplers for railcars and locomotives; industrial and military castings, and forged products for transportation products serving various markets, including agriculture/food, refined, chemicals, upstream oil, and railcar manufacturers and maintenance operations industries. Arcosa, Inc. was incorporated in 2018 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.arcosa.com",
        "full_time_employees": 6410
    },
    "ACOFN.MX": {
        "short_name": "ATLAS COPCO AB",
        "long_name": "Atlas Copco AB",
        "summary": "Atlas Copco AB, together with its subsidiaries, provides productivity solutions. The company operates through Compressor Technique, Vacuum Technique, Industrial Technique, and Power Technique segments. It offers piston compressors, oil-free tooth and scroll compressors, rotary screw compressors, oil-free blowers, oil-free centrifugal compressors, gas and process compressors, air and gas treatment equipment, and medical air solutions primarily for use in the manufacturing and process industries. The company also provides oil-sealed rotary vane, dry, and liquid ring vacuum pumps; and turbomolecular and cryogenic pumps, as well as abatement and integrated systems for the semiconductor and scientific, chemical process, food packaging, and paper handling industries. In addition, it offers pneumatic, hydraulic, and electric assembly tools, as well as control systems and associated software for safety-critical tightening; self-pierce rivets, adhesives, and flow drill fasteners for the motor vehicle industry; self-pierce riveting tools, dispensing equipment for adhesives and sealants, and flow drill fastening equipment; and material removal tools, drills, and other pneumatic products. Further, the company provides portable compressors, boosters, generators, lighting towers, pumps, and construction and demolition tools for civil engineering, construction, and demolition applications, as well as specialty rental services. It operates in North America, South America, Europe, Africa, the Middle East, Asia, and Oceania. The company was founded in 1873 and is headquartered in Nacka, Sweden.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Sweden",
        "state": null,
        "city": "Nacka",
        "zipcode": null,
        "website": "http://www.atlascopcogroup.com/en",
        "full_time_employees": 40482
    },
    "AIRN.MX": {
        "short_name": "AIRBUS SE",
        "long_name": "Airbus SE",
        "summary": "Airbus SE designs, manufactures, and distributes aerospace products and solutions in the Netherlands and internationally. The company operates through three segments: Airbus, Airbus Helicopters, and Airbus Defence and Space. The company's Airbus segment develops, manufactures, markets, and sells commercial jet aircraft of approximately 100 seats; and regional turboprop aircraft and aircraft components, as well as provides aircraft conversion and related services. Its Airbus Helicopters segment develops, manufactures, markets, and sells civil and military helicopters; and provides helicopter related services. The company's Airbus Defence and Space segment designs, develops, delivers, and supports military aircraft, such as combat, mission, transport, and tanker aircraft; and provides unmanned aerial systems and their associated services. It also offers civil and defense space systems for telecommunications, earth observations, navigation, science, and orbital systems; missile systems; and missile and space launcher systems, as well as services around data processing from platforms, secure communication, and cyber security. The company was formerly known as Airbus Group SE and changed its name to Airbus SE in April 2017. Airbus SE was incorporated in 1998 and is headquartered in Leiden, the Netherlands.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Netherlands",
        "state": null,
        "city": "Leiden",
        "zipcode": "2333 CS",
        "website": "http://www.airbus.com",
        "full_time_employees": 127814
    },
    "AKRIT.AT": {
        "short_name": "AKRITAS S.A. (CR)",
        "long_name": "Akritas S.A.",
        "summary": "Akritas S.A. produces, processes, and sells wood products in Greece. The company offers particleboard under the AKRIPAN name for wood veneer, melamine, laminate, and PVC coating applications; chipboards under the AKRITAS name; and doors, worktops-kitchen tops, and surfaces under the POLYTHETA name. It also provides Evropanel, a lightweight material for use in shopfitting and trade fair furnishing, interior doors, tabletops, shelves, furniture and interior design, room dividers, and sound and thermal isolation applications. The company was founded in 1977 and is headquartered in Alexandroupoli, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Alexandroupoli",
        "zipcode": "681 00",
        "website": "http://www.akritas.gr",
        "full_time_employees": 182
    },
    "ALONV.PA": {
        "short_name": "ALSTOM NV21",
        "long_name": "Alstom SA",
        "summary": "Alstom SA develops and markets systems, equipment, and services for the transport sector in Europe, the Americas, Asia and Pacific, the Middle-East, and Africa. The company offers metros, tramways, tram-trains and LRVs, suburban trains, regional and intercity trains, high-speed trains, and locomotives, and electric buses; and signaling products, such as urban, mainline, and freight and mining signaling. It also provides tram, metro, and main line systems; and tracklaying and track solutions, catenary free and ground feeding solutions, electrification solutions, and electromechanical equipment. In addition, the company provides maintenance, modernization, parts and repair, and support services. Further, it offers various components, including bogies, motors and generators, propulsion systems, switchgears, auxiliary converters, traction transformers, components propulsion, and dampers; and asset optimization, connectivity, digital passenger, and security and city mobility solutions. Alstom SA has a strategic cooperation agreement with Cylus to provide cybersecurity solutions for the rail market. The company was incorporated in 1992 and is headquartered in Saint-Ouen, France.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "St Ouen",
        "zipcode": "93400",
        "website": "http://www.alstom.com",
        "full_time_employees": 38900
    },
    "AME.MX": {
        "short_name": "AMETEK INC",
        "long_name": "AMETEK, Inc.",
        "summary": "AMETEK, Inc. manufactures and sells electronic instruments and electromechanical devices worldwide. It operates in two segments, Electronic Instruments (EIG) and Electromechanical (EMG). The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the oil and gas, petrochemical, pharmaceutical, semiconductor, automation, and food and beverage industries; and instruments to the laboratory equipment, ultra-precision manufacturing, medical, and test and measurement markets. This segment also provides power quality monitoring and metering devices, uninterruptible power supplies, programmable power equipment, electromagnetic compatibility test equipment, sensors for gas turbines, dashboard instruments for heavy trucks and other vehicles, and instrumentation and controls for the food and beverage industries; and aircraft and engine sensors, monitoring systems, power supplies, fuel and fluid measurement systems, and data acquisition units for the aerospace industry. Its EMG segment offers engineered electrical connectors and electronics packaging for protecting sensitive electronic devices; precision motion control products for data storage, medical devices, business equipment, automation and other applications; high-purity powdered metals, strip and foil, specialty clad metals, and metal matrix composites; motor-blower systems and heat exchangers for use in thermal management, military, commercial aircraft, and military ground vehicles; and motors for use in commercial appliances, fitness equipment, food and beverage machines, hydraulic pumps, and industrial blowers. This segment also operates a network of aviation maintenance, repair, and overhaul facilities. In addition, the company offers clinical and education communication solutions for healthcare facilities and educational institutions. AMETEK, Inc. was incorporated in 1930 and is headquartered in Berwyn, Pennsylvania.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "PA",
        "city": "Berwyn",
        "zipcode": "19312-1177",
        "website": "http://www.ametek.com",
        "full_time_employees": 16500
    },
    "AVAX.AT": {
        "short_name": "AVAX S.A.  (CR)",
        "long_name": "Avax S.A.",
        "summary": "Avax S.A., together with its subsidiaries, operates as a construction company in Greece and internationally. It operates through four segments: Construction, Concessions, Energy, and Other Activities. The company constructs civil engineering projects, including airports, banks, buildings, education facilities, garages, hospitals, hotels, Olympic sports facilities, special projects, sports facilities, and other civil engineering projects. It also constructs energy and industrial projects, such as environmental plants; natural gas and petrochemical projects; and power plant projects; and infrastructure projects, such as bridges, harbors, railroads, roads, and other infrastructure projects. In addition, the company is involved in activities focusing on the residential development-urban and country/holiday homes and investing in commercial real estate; and vehicle technical inspection, and facility management services. The company was formerly known as J&P-AVAX S.A. and changed its name to Avax S.A. in April 2019. Avax S.A. was founded in 1986 and is headquartered in Marousi, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Marousi",
        "zipcode": "151 25",
        "website": "http://www.avax.gr",
        "full_time_employees": 2186
    },
    "BABBN.MX": {
        "short_name": "BABCOCK INTERNATIONAL GROUP",
        "long_name": "Babcock International Group PLC",
        "summary": "Babcock International Group PLC, together with its subsidiaries, provides engineering services for marine, land, aviation, and nuclear sectors in the United Kingdom and internationally. The company's Marine segment offers life support services for naval ships, and infrastructure. Its Nuclear segment provides submarines and complex engineering services in support of various decommissioning programs and projects, training and operation support, new build program management, and design and installation. The company's Land segment offers large-scale critical vehicle fleet management, and equipment support and training services for military engineers. Its Aviation segment provides critical engineering services to defense and civil customers, including pilot training, equipment support, and airbase management, as well as operates aviation fleets that provide delivering emergency and offshore services. Babcock International Group PLC was founded in 1891 and is headquartered in London, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "London",
        "zipcode": "W1U 1QX",
        "website": "http://www.babcockinternational.com",
        "full_time_employees": 32819
    },
    "BBDBN.MX": {
        "short_name": "BOMBARDIER INC",
        "long_name": "Bombardier Inc.",
        "summary": "Bombardier Inc., together with its subsidiaries, manufactures and sells transportation equipment worldwide. The company designs, manufactures, and markets business jets; designs and manufactures a portfolio of commercial aircraft in the 50- to 100-seat categories, including the CRJ550, CRJ700, CRJ900, and CRJ1000 regional jets; designs, develops, and manufactures aircraft structural components, such as engine nacelles, fuselages, and wings; and provides aftermarket component repair, overhaul, and other engineering services. Bombardier Inc. was incorporated in 1902 and is headquartered in Montreal, Canada.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Canada",
        "state": "QC",
        "city": "Montreal",
        "zipcode": "H3B 1Y8",
        "website": "http://www.bombardier.com",
        "full_time_employees": 45550
    },
    "BIOKA.AT": {
        "short_name": "BIOKARPET S.A. (CR)",
        "long_name": "Biokarpet S.A.",
        "summary": "Biokarpet S.A. engages in the metallurgy, textile, and information technology sectors in Greece, rest of European union, and internationally. The company produces and trades in handmade and machine-made carpets, moquettes, blankets, flokati rugs, and other products for flooring and home decoration. It also offers upholstery fabrics, curtains, throws, straw mats, decorative species, and furniture; linen and wall coverings for bed and bath; wall to wall carpets and carpet tiles; indoor and outdoor wooden floors; and linens and wallpapers, as well as carpet cleaning and storage services. In addition, it designs, produces, and trades in aluminum-extruded products for construction and industrial uses; aluminum frames, shop windows, blowers, glass panes, interior partitions, etc.; and modulated aluminum and steel sheets. Further, the company designs and develops tailor-made integral information systems for enterprises and organizations. Additionally, it produces and distributes electricity through renewable sources. The company operates stores in Greece, Romania, Bulgaria, Cyprus, Poland, and Albania, as well as offers its products online. It also exports its products. Biokarpet S.A. was founded in 1950 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "41110",
        "website": "http://www.biokarpet.gr",
        "full_time_employees": 593
    },
    "BIOSK.AT": {
        "short_name": "UNIBIOS HOLDING S.A",
        "long_name": "Unibios Holdings S.A.",
        "summary": "Unibios Holdings S.A., through its subsidiaries, develops and installs water treatment and recycling systems in Europe, Africa, and the Middle East. It also offers heating and air conditioning equipment, as well as installs and rents facade scaffoldings. The company was formerly known as Biossol SA and changed its name to Unibios Holdings S.A. in July 2008. Unibios Holdings S.A. was founded in 1940 and is based in Ano Liosia, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Ano Liosia",
        "zipcode": "133 41",
        "website": "http://www.unibios.gr",
        "full_time_employees": null
    },
    "BIOT.AT": {
        "short_name": "BIOTER S.A.(CR)",
        "long_name": "Bioter S.A.",
        "summary": "Bioter S.A. operates as a technical construction company in Greece and internationally. It is involved in the execution of various projects, such as roads, ports, industrial-energy, electromechanical-communications, airports, war industries factories, etc., as well as private projects, such as offices, banks, car stations, etc. The company was founded in 1961 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "11634",
        "website": "http://www.bioter.gr",
        "full_time_employees": 4
    },
    "CAFEN.MX": {
        "short_name": "CONSTRUCCIONES Y AUXILIAR DE FE",
        "long_name": "Construcciones y Auxiliar de Ferrocarriles, S.A.",
        "summary": "Construcciones y Auxiliar de Ferrocarriles, S.A. designs, manufactures, and sells rolling stock and rail components worldwide. It offers rolling stock products for high speed trains, regional trains, commuter trains, metros, LRV's and tram-trains, trams and light metros, and locomotives. The company also provides equipment and components, such as wheel sets, wheels, axles, gear units, and couplers, as well as after-sales services, including technological advice and inspection guidelines; and traction systems and converters, energy storage systems, and control and communication systems. In addition, it designs, manufactures, supplies, and maintains railway signaling systems. Further, the company is involved in the provision of maintenance, and refurbishment and upgrading services; management of spare parts and workshop equipment; and technical support and consultancy. Additionally, it develops turnkey solutions that cover a range of activities, such as viability studies, civil works, electrification and signaling, maintenance, and the operation of the system. The company was formerly known as CompaÃ±Ã­a Auxiliar de Ferrocarriles S.A. and changed its name to Construcciones y Auxiliar de Ferrocarriles, S.A. in 1971. Construcciones y Auxiliar de Ferrocarriles, S.A. was incorporated in 1917 and is based in Beasain, Spain.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Beasain",
        "zipcode": "20200",
        "website": "http://www.caf.net",
        "full_time_employees": 13057
    },
    "CHMR": {
        "short_name": "CHIMERA ENERGY CORP",
        "long_name": "Chimera Energy Corporation",
        "summary": "Chimera Energy Corporation, a development stage company, supplies equipment and components that are used in the exploration and production of oil and gas in the United States. It markets and sells polycrystalline diamond compact cutters for use in coal mining, geological exploration, and oil and gas drilling. The company was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": null,
        "full_time_employees": null
    },
    "CNOVAPETRO.NS": {
        "short_name": "CIL NOVA PETROCHEM",
        "long_name": "CIL Nova Petrochemicals Limited",
        "summary": "CIL Nova Petrochemicals Limited manufactures and sells yarns in India. The company offers partially oriented, micro-filament, draw twisted, texturized, and fully drawn yarns. It exports its products to Turkey, Spain, Italy, Germany, Peru, Tanzania, Brazil, Israel, France, Portugal, and the Middle East. The company was incorporated in 2003 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380015",
        "website": "http://cnpcl.com",
        "full_time_employees": 386
    },
    "CRHN.MX": {
        "short_name": "CRH",
        "long_name": "CRH plc",
        "summary": "CRH plc, through its subsidiaries, manufactures and distributes building materials. It operates in three segments: Americas Materials, Europe Materials, and Building Products. The company manufactures and supplies cement, lime, aggregates, precast, ready mixed concrete, and asphalt products; concrete masonry and hardscape products comprising pavers, kerbs, retaining walls, and related patio products; and glass and glazing products, including architectural glass, custom-engineered curtain and window walls, architectural windows, storefront systems, doors, skylights, and architectural hardware. It also offers precast concrete and polymer-based products, such as underground vaults, drainage pipes and structures, utility enclosures, and modular precast structures to the water, energy, communication, transportation, and building structures markets; and construction accessories, such as anchoring, fixing, and connection solutions, as well as lifting systems, formwork accessories, and other accessories used in construction applications. In addition, the company offers network access products, which include composite access chambers, covers, passive safety systems, retention sockets, sealants, and meter boxes; and paving and construction services. Further, it provides building and civil engineering contracting, contract surfacing, operates logistics and owned railway infrastructure; sells and distributes cement; and supplies access chambers and ducting products. It serves governments, contractors, homebuilders, homeowners, and sub-contractors. The company operates primarily in the Republic of Ireland, the United Kingdom, the rest of Europe, the United States, and internationally. CRH plc was founded in 1936 and is headquartered in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "16",
        "website": "http://www.crh.com",
        "full_time_employees": 77100
    },
    "DGN.MX": {
        "short_name": "VINCI",
        "long_name": "VINCI SA",
        "summary": "VINCI SA engages in the concessions and contracting businesses worldwide. The company designs, finances, builds, and operates infrastructure and facilities comprising motorway, bridge and tunnel, airport, rail, and stadium facilities. It operates a motorway concession with a network of 4,443 kilometers in France; and 45 airports worldwide. The company also designs, finances, builds, and operates transport infrastructure and public amenities, such as motorways, bridges, tunnels, and urban roads with a network of 3,800 kilometers under public-private partnership arrangements; and provides industry, infrastructure, facilities management, and information and communication technology services. In addition, the company builds and maintains roads, motorways, railways, and urban infrastructure projects; produces materials, such as asphalt mixes; and operates quarries for aggregates, as well as designs and constructs residential and commercial property, civil engineering infrastructure, specialized civil engineering, water and pipeline infrastructure, c other projects. Further, it develops residential properties, business properties, and managed residences, as well as provides property services. VINCI SA was founded in 1899 and is headquartered in Rueil-Malmaison, France.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "state": null,
        "city": "Rueil-Malmaison",
        "zipcode": "92851",
        "website": "http://www.vinci.com",
        "full_time_employees": 219400
    },
    "DOMIK.AT": {
        "short_name": "DOMIKI KRITIS S.A. (CR)",
        "long_name": "Domiki Kritis S.A.",
        "summary": "Domiki Kritis S.A. primarily engages in the construction of heavy infrastructure projects for public and private sectors in Greece. The company undertakes infrastructure projects, including road, port, building, residential, industrial, energy, electromechanical, hydraulic, sewerage, water supply, solid and waste management, renewable energy, and greening projects. It also engages in the real estate development activities, and production of electricity from renewable energy sources. The company was founded in 1985 and is based in Heraklion, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Heraklion",
        "zipcode": "712 02",
        "website": "http://www.domik.gr",
        "full_time_employees": 23
    },
    "DOPPLER.AT": {
        "short_name": "DOPPLER S.A. (CR)",
        "long_name": "Doppler S.A.",
        "summary": "Doppler S.A. designs, sells, installs, maintains, and services lifts and lift components worldwide. It offers elevators, such as elevator cabins; passenger lifts; panoramic lifts; cargo and car lifts; elevators for high rise buildings, hospitals, and transport and public buildings; home lifts; dumbwaiters; and platform lifts, as well as accessories, including side walls, handrails, floors, and false ceilings. The company also provides escalators and moving walks for use in airports, super markets, shopping centers, metro stations; parking systems for use in shopping centers, public buildings, and residences; inclined lifts; robotic parking systems; customized products for cruise ships, cargo ships, ferries, luxurious yachts, and offshore rigs; and spare parts. Doppler S.A. was founded in 2000 and is headquartered in Polykastro, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Polykastro",
        "zipcode": "61200",
        "website": "http://www.doppler.gr",
        "full_time_employees": 176
    },
    "EKTER.AT": {
        "short_name": "EKTER S.A. (CR)",
        "long_name": "Ekter SA",
        "summary": "Ekter SA operates as a construction company. It undertakes various construction projects, including infrastructure projects, hospitals, airport terminals, museums, buildings and renovations, hotels, medical and hotel equipment, ICU buildings, and other projects. The company was founded in 1959 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "105 57",
        "website": "http://www.ekter.gr",
        "full_time_employees": 28
    },
    "EPIL.AT": {
        "short_name": "Selected Texttile Ind. Assoc.",
        "long_name": "Selected Textiles S.A.",
        "summary": "Selected Textiles S.A. engages in the ginning of seed cotton; and production, dyeing, and treatment of yarns in Greece. It offers ecrou, dyed, single, twisted, combed, carded, and gazed mercerized yarns; and seeding and filature cotton by-products. The company also exports its products. Selected Textiles S.A. was founded in 1970 and is headquartered in Acharnes, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Acharnes",
        "zipcode": "13671",
        "website": "http://www.stiafilco.com",
        "full_time_employees": 198
    },
    "ERJN.MX": {
        "short_name": "EMBRAER SA",
        "long_name": "Embraer S.A.",
        "summary": "Embraer S.A. designs, develops, manufactures, and sells aircrafts and systems in Brazil, North America, Latin America, the Asia Pacific, Brazil, Europe, and internationally. It operates through Defense and Security; Executive Jets; Service & Support; and Other segments. The Defense and Security segment engages in the research, development, production, modification, and support for military defense and security aircraft, as well as offers a range of products and integrated solutions that include radars, special space systems (satellites), and information and communications systems, such as command, control, communications, computer, intelligence, surveillance, and reconnaissance systems. The Executive Jets segment develops, produces, and sells executive jets. It also leases Legacy 600 and Legacy 650 executive jets in the super midsize and large categories; Legacy 450 and Legacy 500 executive jets in the midlight and midsize categories; Phenom family executive jets in the entry jet and light jet categories; Lineage 1000, an ultra-large executive jet; and Praetor 500 and Praetor 600, disruptive executive jets in the midsize and super midsize categories. The Service & Support segment offers after-service solutions, support, and maintenance, repair, and overhaul services for commercial, executive, and defense aircraft; provides aircraft components and engines; and supplies steel and composite aviation structures to various aircraft manufacturers. The Other segment is involved in the supply of fuel systems, structural parts, and mechanical and hydraulic systems; and production of agricultural crop-spraying aircraft. The company was formerly known as Embraer-Empresa Brasileira de AeronÃ¡utica S.A. and changed its name to Embraer S.A. in November 2010. Embraer S.A. was founded in 1969 and is headquartered in SÃ£o Paulo, Brazil.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Brazil",
        "state": "SP",
        "city": "SÃ£o Paulo",
        "zipcode": "05425-070",
        "website": "http://www.embraer.com",
        "full_time_employees": 15658
    },
    "ETN1N.MX": {
        "short_name": "EATON CORPORATION PLC",
        "long_name": "Eaton Corporation plc",
        "summary": "Eaton Corporation plc operates as a power management company. Its Electrical Americas and Electrical Global segment provides electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality products, wiring devices, circuit protection products, utility power distribution products, power reliability equipment, and services in North and South America, as well as hazardous duty electrical, emergency lighting, fire detection, explosion-proof instrumentation, and structural support systems internationally. The company's Hydraulics segment provides pumps, motors, and hydraulic power units; valves, cylinders, and electronic controls; industrial and hydraulic hoses, fittings, assemblies, thermoplastic hose and tubing products, couplings, connectors, and assembly equipment; and industrial drums and disc brakes. Its Aerospace segment offers pumps, motors, hydraulic power units, hoses and fittings, and electro-hydraulic pumps; valves, cylinders, electronic controls, electromechanical actuators, sensors, aircraft flap and slat systems, and nose wheel steering systems; thermoplastic tubing products, fittings, adapters, couplings, and sealing and ducting products; fuel pumps, sensors, valves, and adapters and regulators; and wiring connectors and cables, as well as hydraulic and bag filters, strainers and cartridges, and golf grips. The company's Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, cylinder heads, locking and limited slip differentials, transmission controls, and fuel vapor components for the vehicle industry. Its eMobility segment provides voltage inverters, converters, fuses, onboard chargers, circuit protection units, vehicle controls, power distribution systems, fuel tank isolation valves, and commercial vehicle hybrid systems. The company was founded in 1916 and is based in Dublin, Ireland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Ireland",
        "state": null,
        "city": "Dublin",
        "zipcode": "4",
        "website": "http://www.eaton.com",
        "full_time_employees": 91987
    },
    "FANUN.MX": {
        "short_name": "FANUC CORPORATION",
        "long_name": "Fanuc Corporation",
        "summary": "Fanuc Corporation provides factory automation products in Japan, the United States, Europe, Asia, and internationally. The company offers CNC series products, servo motors, lasers, robots, compact machining centers, electric injection molding machines, wire-cut electric discharge machines, and ultra-precision machines. It also provides FANUC Intelligent Edge Link and Drive system, an open platform for the manufacturing industry. The company was incorporated in 1950 and is headquartered in Yamanashi, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Yamanashi",
        "zipcode": "401-0597",
        "website": "http://www.fanuc.co.jp",
        "full_time_employees": null
    },
    "FCCN.MX": {
        "short_name": "FOMENTO DE CONSTRUCCIONES Y CON",
        "long_name": "Fomento de Construcciones y Contratas, S.A.",
        "summary": "Fomento de Construcciones y Contratas, S.A., together with its subsidiaries, engages in the environmental services, water management, and infrastructure development businesses in Europe and internationally. The company offers services related to urban sanitation, industrial waste treatment and waste recycling, street cleansing, conservation of green areas, maintenance of sewerage networks, recovery of contaminated soils, and facility management. It also provides end-to-end water management services relating to the integrated water cycle, such as collection, purification and distribution of water for human consumption; sewage collection, filtration and purification; design, construction, and operation and maintenance of water infrastructure for municipal, industrial, agricultural services, etc. In addition, the company undertakes infrastructure works and building construction, such as motorways, roads, tunnels, bridges, hydraulic works, ports, airports, housing estates, housing, non-residential building, lighting, industrial climate control installations, environmental restoration, etc. Further, it is involved in the operation of quarries and mineral deposits; production of cement, limestone, plaster, and prefabricated by-products; and production of concrete. The company was founded in 1900 and is headquartered in Madrid, Spain. Fomento de Construcciones y Contratas, S.A. is a subsidiary of Control Empresarial de Capitales, S.A. de C.V.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Waste Management",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28050",
        "website": "http://www.fcc.es/es/",
        "full_time_employees": 59746
    },
    "FDRN.MX": {
        "short_name": "FLUIDRA SA",
        "long_name": "Fluidra, S.A.",
        "summary": "Fluidra, S.A., together with its subsidiaries, manufactures and markets accessories and machineries for swimming pools, irrigation, and water treatment and purification fir private and public customers worldwide. The company designs, manufactures, and distributes various components required for the construction, refurbishment, improvement, and maintenance of residential and commercial pools. It also markets fluid handling products; manufactures, produces, and distributes plastic material by injection system, plastic parts for armature; provides financial advisory services in the acquisition of shares; and manufacture and distribution of automatic pool covers. Fluidra, S.A. sells its products primarily under the Jandy, AstralPool, Polaris, Cepex, Zodiac, CTX Professional, and Gre brand names in approximately 45 countries. The company was formerly known as Aquaria de Inv. Corp., S.L. and changed its name to Fluidra, S.A. in September 2007. Fluidra, S.A. was founded in 1969 and is based in Sabadell, Spain.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Sabadell",
        "zipcode": "08208",
        "website": "http://www.fluidra.com",
        "full_time_employees": 5436
    },
    "FERN.MX": {
        "short_name": "FERROVIAL SA",
        "long_name": "Ferrovial, S.A.",
        "summary": "Ferrovial, S.A., together with its subsidiaries, operates as an infrastructure and mobility operator in the United States, Poland, Spain, the United Kingdom, Canada, and internationally. The company engages in the design and construction of various public and private works; and development, finance, and operation of toll roads. Its construction activities include highways, tunnels, railways, bridges and viaducts, airports, intelligent toll systems, energy restoration, aqueducts, water treatment plants, port infrastructures, desalination plants, digesters, thermal drying plants, chimneys and silos, oil facilities, and other construction, as well as operation and maintenance services of urban and industrial waste water treatment plants, and water treatment and desalination plants. The company also develops, manufactures, and markets asphalt and bitumen products; develops, finances, and operates airports; provides integrated solutions for the development and management of electrical transmission networks; and sells real estate properties, including flats, retail units, and garages. In addition, it provides construction management services; mobility services, including ZITY, an electric carsharing service application; and Wondo, which offers mobility in cities through Moovit application. The company was founded in 1952 and is based in Madrid, Spain.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28002",
        "website": "http://www.ferrovial.com",
        "full_time_employees": 66382
    },
    "FIER.AT": {
        "short_name": "FIERATEX S.A. (CR)",
        "long_name": "Fieratex S.A.",
        "summary": "Fieratex S.A. operates as a textile company in Greece and internationally. The company provides light wear, inkjet or rotaty printed, water-resilient, and technical fabrics, as well as fabrics for women's wear. It also offers garments. Fieratex S.A. was founded in 1988 and is based in Kilkis, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Kilkis",
        "zipcode": "611 00",
        "website": "http://www.fieratex.gr",
        "full_time_employees": 189
    },
    "FRIGO.AT": {
        "short_name": "FRIGOGLASS S.A. (CR)",
        "long_name": "Frigoglass S.A.I.C.",
        "summary": "Frigoglass S.A.I.C., together with its subsidiaries, manufactures, trades in, and distributes commercial refrigeration units and packaging materials for the beverage industry. The company operates through Ice Cold Merchandise Operations and Glass Operations segments. It also offers glass containers and bottles, plastic crates, metal crowns, and other containers primarily for soft drinks, beer, food, spirits, cosmetics, and pharmaceutical industries. In addition, the company provides integrated, standard and post warranty, repair call management, rebranding and refurbishment, one-to-one placement, spare parts management, preventive maintenance, and technical training services. It operates in east Europe, west Europe, Africa, the Middle East, and Asia. The company was founded in 1996 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "145 64",
        "website": "http://www.frigoglass.com",
        "full_time_employees": 3098
    },
    "GEKTERNA.AT": {
        "short_name": "GEK TERNA S.A",
        "long_name": "GEK TERNA Holdings, Real Estate, Construction S.A.",
        "summary": "GEK TERNA Holdings, Real Estate, Construction S.A., together with its subsidiaries, engages in the construction, energy, real estate, industrial, and concession businesses in Greece, the Balkans, the Middle East, Eastern Europe, the United States, and internationally. The company is involved in the construction of motorways, buildings, ports, and large energy projects; the financing, management, and commercial exploitation of concession projects, such as operation of car parking. It also constructs and operates wind farms, hydroelectric projects, pumping storage projects, hybrid stations, and photovoltaics, as well as the undertaking of integrated projects for waste management, biofuels, and other materials with an installed capacity of 1,363.7 MW; and trades in electric energy and natural gas. In addition, the company engages in the acquisition, development, and exploitation of real estate properties, including business centers, logistic centers, industrial parks, entertainment parks, residential properties, commercial properties, hotels, etc.; production of quarry products; and exploitation of magnesite products. Further, it operates Borovets Euphoria Club Hotel & Spa in Bulgaria; and owns two thermal power plants with a total installed capacity of 147 MW and 435 MW in Viotia, Greece. The company was formerly known as Ermis Real Estate Constructions Enterprises S.A. and changed its name to GEK TERNA Holdings, Real Estate, Construction S.A. in 2008. The company was founded in 1960 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "115 26",
        "website": "http://www.gekterna.com",
        "full_time_employees": 3859
    },
    "GPRC": {
        "short_name": "GUANWEI RECYCLING CORP",
        "long_name": "Biochar Now, Inc.",
        "summary": "Guanwei Recycling Corp. manufactures and distributes low density polyethylene (LDPE) and other recycled plastics products primarily in the People's Republic of China and internationally. It imports and recycles LDPE plastic scrap material into granular plastic for use in the manufacture of various consumer products. The company's LDPE products are used in the manufacture of chemical and functional fibers, as well as a raw material in the manufacture of shoe soles, insulation materials, fire-proofing and water-proofing materials, and foam. It also sells its products to customers in a range of industries, including shoe manufacturing, architecture and engineering products, industrial equipment and supplies, and chemical and petrochemical manufacturing. Guanwei Recycling Corp. was founded in 2005 and is based in Fuqing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Fuqing",
        "zipcode": "350301",
        "website": null,
        "full_time_employees": 540
    },
    "GTNIND.NS": {
        "short_name": "GTN INDUSTRIES LTD",
        "long_name": "GTN Industries Limited",
        "summary": "GTN Industries Limited manufactures and sells cotton yarn in India. The company offers medium, fine, and superfine combed yarn. It also exports its cotton yarn to Europe and Asian countries. The company was incorporated in 1962 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.gtnindustries.com",
        "full_time_employees": 884
    },
    "HONV.PA": {
        "short_name": "THALES NV21",
        "long_name": "Thales S.A.",
        "summary": "Thales S.A. provides various solutions for civilian and military customers in the aeronautics, space, defense, security, and ground transportation markets worldwide. It operates through Aerospace, Transport, Defence & Security, and Digital Identity & Security segments. The company offers communications, command, and control systems; mission services and support; protection and mission/combat systems; surveillance, detection, and intelligence systems; training and simulation solutions for air, land, naval, and joint forces; and digital identity and security solutions. It also provides air traffic management solutions; flight decks and avionics equipment and functions; in-flight entertainment and connectivity systems and services; electrical systems; aerospace training solutions; navigation solutions; support and services for avionics equipment; and vision systems. In addition, the company designs, operates, and delivers satellite-based systems for telecommunications, navigation, earth observation, environmental management, exploration, and science and orbital infrastructures; signaling, communications and supervision, and fare collection management systems and related services; cybersecurity and railway digitalization systems; and main line rail, and urban and intermodal mobility solutions. Further, it provides solutions for various markets and applications, including radiology, radio frequency, microwave sources, training and simulation solutions, lasers, and microelectronics solutions for science, industry, space, defense, automotive, railways, and energy conversion platforms. The company was formerly known as Thomson-CSF and changed its name to Thales S.A. in 2000. Thales S.A. was founded in 1893 and is based in Courbevoie, France.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Courbevoie",
        "zipcode": "92400",
        "website": "http://www.thalesgroup.com/en",
        "full_time_employees": 75735
    },
    "I7N.DE": {
        "short_name": "ITN NANOVATION",
        "long_name": "ItN Nanovation AG",
        "summary": "ItN Nanovation AG, a nanotechnology company, develops and sells water filtration systems for industrial customers in Germany and internationally. The company offers membrane sheet and modules, multichannel pressurized ceramics, membrane towers, and membrane racks. Its products are used in various applications, including drinking water, membrane, oil and gas fields, reclaimed water, high temperature municipal and industrial waste water, food and beverage, textile and dyeing wastewater, iron and steel, pharmaceutical wastewater, arsenic removal, and radium removal. The company was founded in 2000 and is based in SaarbrÃ¼cken, Germany.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "GER",
        "market": "de_market",
        "country": "Germany",
        "state": null,
        "city": "SaarbrÃ¼cken",
        "zipcode": "66123",
        "website": "http://www.itn-nanovation.com",
        "full_time_employees": 16
    },
    "IKTIN.AT": {
        "short_name": "IKTINOS HELLAS S.A. (CR)",
        "long_name": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company",
        "summary": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company quarries, cuts, and processes marbles in Greece, the Euro Area, and internationally. The company operates through Marble, Wind Energy, and Real Estate segments. It imports and trades in marbles, granites, and rare decorative stones; and operates as a dealer for artificial rocks and fine mosaics made of natural rocks. The company also offers natural stones, including natural Greek marbles, natural imported marbles, granites, and onyx; synthetic materials, such as quarellas; and other decorative materials comprising travertino, sandstone, psammite, limestone, slate, graphite, glass stone, and gemstone. In addition, it engages in the aeolian energy and real estate businesses. Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company was founded in 1974 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "144 52",
        "website": "http://www.iktinos.gr",
        "full_time_employees": 429
    },
    "INKAT.AT": {
        "short_name": "INTRACOM CONSTRUCTIONS S.A(CR)",
        "long_name": "Intracom Constructions Societe Anonyme Technical and Steel Constructions",
        "summary": "Intracom Constructions Societe Anonyme Technical and Steel Constructions engages in the construction business in Europe and internationally. The company operates through Constructions and Steel Structures segments. It offers infrastructure projects, such as airport, road, rail road, water engineering, and marine projects; and buildings that include offices, professional infrastructures, shopping centers, educational and cultural buildings, hospitals, health centers, sports venues, and stadiums. The company also provides develops real estate properties, such as villas and boutique hotels; and undertakes industrial facilities for industrial projects and logistics buildings. In addition, it operates motorways, broadband, integrated passenger information systems, waste management, and parking services through public private partnership, and built transfer and operate agreements; and undertakes telecommunication projects, including broadband networks, mobile telephony base stations and networks, wireless transmission systems, and specialized projects, as well as maintenance services. Further, the company provides solid and waste management projects that include waste management, soil remediation and regeneration, water refinery, and waste water treatment. Additionally, it undertakes projects of wind farms, photovoltaic parks, and natural gases. The company was founded in 1987 and is headquartered in Paiania, Greece. Intracom Constructions Societe Anonyme Technical and Steel Constructions is a subsidiary of Intracom Holdings S.A.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Paiania",
        "zipcode": "190 02",
        "website": "http://www.intrakat.gr",
        "full_time_employees": 302
    },
    "INS": {
        "short_name": "Intelligent Systems Corporation",
        "long_name": "Intelligent Systems Corporation",
        "summary": "Intelligent Systems Corporation, through its subsidiary, CoreCard Software, Inc., provides technology solutions and processing services to the financial technology and services market in the United States and European Union. The company designs, develops, and markets a suite of software solutions to program managers, accounts receivable businesses, financial institutions, retailers, and processors to manage their credit and debit cards, prepaid cards, private label cards, fleet cards, loyalty programs, and accounts receivable and loan transactions. Its software solutions allow companies to offer various types of debit and credit cards, as well as installment and revolving loans; set up and maintain account data; record advances and payments; assess fees, interests, and other charges; resolve disputes and chargebacks; manage collections of accounts receivable; generate reports; and settle transactions with financial institutions and network associations. Intelligent Systems Corporation was founded in 1973 and is headquartered in Norcross, Georgia.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Norcross",
        "zipcode": "30093",
        "website": "http://www.intelsys.com",
        "full_time_employees": 570
    },
    "IXEH": {
        "short_name": "IX ENERGY HOLDINGS INC",
        "long_name": "IX Energy Holdings, Inc.",
        "summary": "IX Energy Holdings, Inc. engages in the development of solar power and other renewable energy solutions systems for government agencies, municipalities and commercial customers. IX Energy Holdings, Inc. was formerly known as Yoo, Inc. The company was founded in 2006 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": null,
        "full_time_employees": 3
    },
    "KLM.AT": {
        "short_name": "K.L.M. S.A. (CR)",
        "long_name": "I.Kloukinas-I.Lappas S.A.",
        "summary": "I.Kloukinas-I.Lappas S.A. engages in the commerce and construction businesses in Greece. The company constructs complex and specialized technical projects, including showrooms and exhibition areas, industrial units and warehouses, office buildings, bank branches and buildings, department stores and super markets, food services courts, public buildings, hospital buildings, and residential developments, as well as undertakes redevelopment of listed buildings, etc. It also undertakes and constructs projects in the public sector. In addition, the company operates shops under the Mothercare brand in Athens, Thessaloniki, Crete, Patra, Larissa, Rhodes, Kavala, Xanthi, Kilkis, Veria, Kozani, Karditsa, Edessa, Lamia, and Bucharest. Further, it undertakes woodworking projects; and engages in the research, construction, operation, and management of hydroelectric projects. The company serves customers in the banking sector, retail trade sector, hospitals, and other companies. I.Kloukinas-I.Lappas S.A. was founded in 1986 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "115 21",
        "website": "http://www.klmate.gr",
        "full_time_employees": 325
    },
    "LANAC.AT": {
        "short_name": "LANAKAM S.A. (CR)",
        "long_name": "Lanakam S.A.",
        "summary": "Lanakam S.A. distributes apparel and accessories in Greece and Cyprus. The company primarily distributes DOLCE & GABBANA, Coccinelle, Guess, Danielle Alessandrini, LIU JO, Gold Case, Frankie Morello, and other branded apparel. It also operates Coccinelle mono-brand shop in Athens; and distributes outdoor heating and cooling products. The company was founded in 1941 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "115 27",
        "website": "http://www.lanakam.gr",
        "full_time_employees": 21
    },
    "MARELN.MX": {
        "short_name": "MAREL HF",
        "long_name": "Marel hf.",
        "summary": "Marel hf. develops, manufactures, sells, and distributes processing equipment, systems, software, and services for poultry, meat, and fish industries. The company's Poultry Processing segment offers integrated systems, software, and services for processing broilers, turkeys, and ducks. Its Meat Processing segment provides services in the processes of slaughtering, cut-up, deboning and trimming, and case ready food service for pork, beef, veal, and sheep. The company's Fish Processing segment offers equipment and systems for farmed and wild salmon and whitefish processing. The company also provides lifecycle support, customer support center, training, process consultancy, planned maintenance, inspection visit, preventative maintenance package, calibration, consumable package, repair and exchange program, and parts package services, as well as upgrade kits. It sells in Europe, the Middle East, Africa, the Americas, Asia, and Oceania. The company was founded in 1977 and is based in GarÃ°abÃ¦r, Iceland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Iceland",
        "state": null,
        "city": "GarÃ°abÃ¦r",
        "zipcode": "210",
        "website": "http://marel.com",
        "full_time_employees": 6800
    },
    "MATHIO.AT": {
        "short_name": "MATHIOS REFRACTORY S.A.",
        "long_name": "Mathios Refractories S.A.",
        "summary": "Mathios Refractories S.A. engages in the production and sale of refractory materials and building products in Greece and internationally. The company offers stones, bricks, and pavers; building materials, including glass blocks, firebricks, mortars and additives, and flooring and thermal insulation products; heating solutions, such as eco fireplaces, eco stoves, heat backs, and bioethanole fireplaces; and landscaping products comprising mat grass, mat green, vermiculite, forest whisper, and garden steps. It also offers research and development, engineering, procurement, installation, and other support services. The company provides its products under the brand names of IDEAL, MAT, MAT PLUS, MAT CAST, MAT MICRON and MAT NANO, MAT SF, and MAT RAM. It serves cement, steel, ceramic, aluminum, glass power plant, refinery, wood, food, lime, and fertilizer industries. The company was founded in 1890 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "18233",
        "website": "http://www.mathios.com",
        "full_time_employees": 211
    },
    "MIN.AT": {
        "short_name": "MINERVA KNITWEAR S.A. (CB)",
        "long_name": "J. & B. Ladenis Bros S.A. - Minerva - Knitwear Manufacturing Company",
        "summary": "J. & B. Ladenis Bros S.A. - Minerva - Knitwear Manufacturing Company manufactures and trades underwear, sleepwear, and other products in Greece and internationally. The company offers men's, women's, and children's sleep body-suits-pyjamas for summer and winter; home-wear clothes for winter; beachwear and swimwear for the summer; and blouses, T-shirts, teenage, and unisex products. It also provides women's body-suits, brassieres, and lingerie, as well as men socks. The company distributes its products under the trademarks of MINERVA FORWARD, MINERVA UNDERWORLD, MINERVA FIMELLE, MINERVAKIA, MINERVA BOXER, MINERVA SPORTIES, MINERVA CLASSIC, MINERVA TEEN, MINERVA PYJAMAS, MINERVA SEAMLESS, MINERVA LADY LINE, MINERVA GOSSIP, MINERVA GOSSIP ON THE BEACH, and MINERVA MEN GEAR. In addition, it operates stores. The company was founded in 1942 and is based in Thessaloniki, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Thessaloniki",
        "zipcode": "564 29",
        "website": "http://www.minerva.gr",
        "full_time_employees": 372
    },
    "MISUN.MX": {
        "short_name": "MISUMI GROUP INC",
        "long_name": "MISUMI Group Inc.",
        "summary": "MISUMI Group Inc. engages in the factory automation and die components businesses worldwide. The company operates through three segments: FA Business, Die Components Business, and VONA Business. It offers mechanical components, including shafts, timing pulleys, linear bushings, flat belt conveyors, set collars, locating pins, gears, and couplings; and locator devices and measurement equipment, such as automatic stage units, actuators, optical measurement devices, and optical waveguide alignment products. The company also provides metal press/plastic mold components comprising punches, button dies, ejector pins, and sprue bushings. In addition, it distributes sensors and switches, pipefittings, screws, bolts, nuts, washers, castors, couplings, transformers, connectors, cables, transformers, end mills, hexagonal wrenches, milling chips, calipers, carts, work gloves, parts cleaners, and laboratory equipment and supplies. MISUMI Group Inc. was founded in 1963 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Machine Tools & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8583",
        "website": "http://www.misumi.co.jp",
        "full_time_employees": null
    },
    "MOYZK.AT": {
        "short_name": "EL. D. Mouzakis S.A. (CR)",
        "long_name": "EL. D. Mouzakis S.A.",
        "summary": "EL. D. Mouzakis S.A. engages in the production and sale of textile products in Greece and other Eurozone countries. It offers spinning products, such as stitching, embroidery, and knitting threads in various shapes and colors; and cotton products for sewing and knitting under the D.M.C. brand name. The company was founded in 1968 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "12242",
        "website": "http://www.mouzakis.gr",
        "full_time_employees": 94
    },
    "MPITR.AT": {
        "short_name": "BITROS HOLDING S.A. (CR)",
        "long_name": "Bitros Holding S.A.",
        "summary": "Bitros Holding S.A. operates in the metallurgy, real-estate development, and energy sectors. The company offers various services related to metal industry, such as cut-to-length line, slitting line, hollow sections and pipes line, shotblasting and painting line, flame cutting line NC, and saw cutting of long products. It also provides concrete reinforcing steel in bars and coils, antiseismic reinforcement products, cage for pile reinforcement, wire mess, wires for the tying of the re-bars, plain reinforcing bars, plastic spacers, and insulation materials. In addition, the company constructs buildings, luxury apartments, residential complexes, summer residences, hospitals, educational centers, school buildings, supermarkets, and olympic projects. Further, it produces electricity from photovoltaic systems. Bitros Holdings S.A. was founded in 1945 and is headquartered in Aspropyrgos, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Metal Fabrication",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Aspropyrgos",
        "zipcode": "19300",
        "website": "http://www.bitros.gr",
        "full_time_employees": 75
    },
    "NABCON.MX": {
        "short_name": "NABTESCO CORP",
        "long_name": "Nabtesco Corporation",
        "summary": "Nabtesco Corporation manufactures and sells equipment in the industrial, daily life, and environmental fields in Japan and internationally. It operates through Component Solutions, Transport Solutions, Accessibility Solutions, and Manufacturing Solutions segments. The company offers precision reduction gears for industrial robots' joints; hydraulic equipment, such as traveling unit for crawlers, control valve for mini excavators, and swing unit for hydraulic excavators; railroad vehicle equipment, such as railroad vehicle brake systems, door operating units, test equipment, brake shoes, seat turning equipment, and snow removal devices; and aircraft equipment comprising flight control actuation systems and high voltage electric power distribution units. It also provides air dryers and wedge brake chambers for commercial vehicles, and hydraulic clutch master cylinders for passenger vehicles; engine remote control systems for vessels; automatic doors and platform doors for buildings; automatic filters/sealers for retort pouch foods; and intelligent prosthetic knee joints, electric wheelchairs, stair lift with a wheelchair, and rollator with a speed control system, as well as new energy equipment comprising yaw and pitch drives, and solar tracking equipment. Nabtesco Corporation was founded in 2003 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0093",
        "website": "http://www.nabtesco.com",
        "full_time_employees": 7717
    },
    "NAYP.AT": {
        "short_name": "NAFPAKTOS TEXTILE IND.",
        "long_name": "Nafpaktos Textile Industry S.A.",
        "summary": "Nafpaktos Textile Industry S.A. engages in the cotton ginning and production of cotton yarns in Greece. It also has a photovoltaic park of 1.3 MWp, which generates electricity and sells it to the network. In addition, the company's primary sectors consisting textile, agricultural products, and renewable energy sources. Further, it exports its products to Italy, Germany, Austria, Spain, Bulgaria, Turkey, and Indonesia. The company was formerly known as Nafpaktos Textile Industry George Polychronos S.A. and changed its name to Nafpaktos Textile Industry S.A. in July 2002. Nafpaktos Textile Industry S.A. was founded in 1964 and is headquartered in Pefki, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Pefki",
        "zipcode": "151 21",
        "website": "http://www.nafpaktos-yarns.gr",
        "full_time_employees": null
    },
    "NIDECN.MX": {
        "short_name": "NIDEC CORPORATION",
        "long_name": "Nidec Corporation",
        "summary": "Nidec Corporation, together with its subsidiaries, designs, develops, produces, and sells motors, electronics and optical components, and other related products in Japan and internationally. The company offers medium- and large-size motors, small-size and precision motors, motor-related products, units and modules, automotive components, mechanical equipment, inspection and measuring equipment, electronic devices, sensors, and other products. Its products are used for applications in robotics, IoT products, automotive, home appliances, information technology, office automation, mobile devices and optical components, medical and health care products, housing equipment, commercial and professional products, and processing/inspection equipment. Nidec Corporation was founded in 1973 and is headquartered in Kyoto, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8205",
        "website": "http://www.nidec.com",
        "full_time_employees": null
    },
    "OHLN.MX": {
        "short_name": "OBRASCON HUARTE LAIN SA",
        "long_name": "Obrascón Huarte Lain, S.A.",
        "summary": "ObrascÃ³n Huarte Lain, S.A. engages in the construction and concessions development businesses in the United States, Canada, Mexico, Chile, Peru, Colombia, Spain, Central and Eastern Europe, and internationally. It operates through Construction, Industrial, and Services segments. The Construction segment provides civil engineering works and building construction services for public and private-sector customers. The Industrial segment designs, constructs, maintains, and operates industrial plants and systems, including oil and gas, energy, solids engineering, and fire safety systems. The Services segment offers properties and infrastructure maintenance services for housing and office properties. It also develops and operates mixed use hotel-related real estate projects. The company was formerly known as Sociedad General de Obras y Construcciones ObrascÃ³n, S.A. ObrascÃ³n Huarte Lain, S.A. was incorporated in 1911 and is headquartered in Madrid, Spain.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28046",
        "website": "http://www.ohl.es",
        "full_time_employees": 16558
    },
    "OLYMP.AT": {
        "short_name": "TECHNICAL OLYMPICS S.A.",
        "long_name": "Technical Olympic S.A.",
        "summary": "Technical Olympic S.A. engages in the construction, marina management, and other businesses in Greece and internationally. Technical Olympic S.A. was founded in 1965 and is headquartered in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "174 56",
        "website": "http://www.techol.gr",
        "full_time_employees": 36
    },
    "PRD.AT": {
        "short_name": "PROODEFTIKH TECHN CO S.A. (CR)",
        "long_name": "Proodeftiki S.A.",
        "summary": "Proodeftiki S.A. operates as a civil engineering and general construction company. It constructs bridges, dams, roads, buildings, tunnels, harbors, motorways, airports, and sports facilities, as well as irrigation network, hydraulic, and wastewater treatment projects. The company also engages in the real estate development business. It has operations in Greece, Romania, and Bulgaria. The company was founded in 1960 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "114 73",
        "website": "http://www.proodeftiki.gr",
        "full_time_employees": 4
    },
    "RTX.BA": {
        "short_name": "RAYTHEON TECHNOLOG",
        "long_name": "Raytheon Technologies Corporation",
        "summary": "Raytheon Technologies Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers worldwide. It operates through four segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for aircraft manufacturers and airlines, as well as regional, business, and general aviation; and for defense and commercial space operations. This segment also designs, produces, and supports cabin interior, communications and aviation systems, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; airborne intelligence, surveillance and reconnaissance systems, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon Intelligence & Space segment develops and provides integrated sensor and communication systems for missions, training, and cyber and software solutions to intelligence, defense, federal, and commercial customers. The Raytheon Missiles & Defense segment designs, develops, produces, and sustains integrated air and missile defense systems; defensive and combat solutions; land- and sea-based radars; command, control, communications, and intelligence solutions; and naval and undersea sensor solutions for the U.S. and foreign government customers. The company is headquartered in Waltham, Massachusetts.",
        "currency": "ARS",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02451",
        "website": "http://www.rtx.com",
        "full_time_employees": 181000
    },
    "SGON.MX": {
        "short_name": "COMPAGNIE DE ST-GOBAIN",
        "long_name": "Compagnie de Saint-Gobain S.A.",
        "summary": "Compagnie de Saint-Gobain S.A. designs, manufactures, and distributes materials and solutions for wellbeing worldwide. It operates in five segments: High Performance Solutions; Northern Europe; Southern Europe Â\u0096 Middle East (ME) & Africa; Americas; and Asia-Pacific. The company offers glass for building, industrial mortars, exterior products, and pipes; insulation, plasterboards, and interior glass products; and coated glass and high performance materials. It also distributes heavy building materials; plumbing, heating, and sanitary ware products; timbers and panels; interior solutions; roofing products; civil engineering products; ceramic tiles; and site equipment and tools. The company was founded in 1665 and is headquartered in Courbevoie, France.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "General Building Materials",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "state": null,
        "city": "Courbevoie",
        "zipcode": "92400",
        "website": "http://www.saint-gobain.com",
        "full_time_employees": 167552
    },
    "SIEN.MX": {
        "short_name": "SIEMENS AG",
        "long_name": "Siemens Aktiengesellschaft",
        "summary": "Siemens Aktiengesellschaft, a technology company, focuses in the areas of automation and digitalization in Europe, Commonwealth of Independent States, Africa, the Middle East, the Americas, Asia, and Australia. Its Digital Industries segment offers automation systems and software for factories, numerical control systems, motors, drives and inverters, and integrated automation systems for machine tools and production machines; process control systems, machine-to-machine communication products, sensors and radio frequency identification systems; production and product lifecycle management software; mechatronic systems simulation and testing software; and cloud-based industrial Internet of Things operating system. The company's Smart Infrastructure segment supplies and connects energy systems and building technologies to enhance efficiency and sustainability; and supports customers to address technology shifts. Its Mobility segment provides passenger and freight transportation, such as rail vehicles, rail automation and electrification systems, road traffic technology, digital solutions, and related services; and mobility system services. The company's Siemens Healthineers segment offers medical technology and software solutions; and clinical consulting and training services. Its Siemens Financial Services segment provides leasing solutions and equipment; and debt and equity investment products. The company was founded in 1847 and is headquartered in Munich, Germany.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Germany",
        "state": null,
        "city": "Munich",
        "zipcode": "80333",
        "website": "http://www.siemens.com",
        "full_time_employees": 283000
    },
    "SMCN.MX": {
        "short_name": "SMC CORP",
        "long_name": "SMC Corporation",
        "summary": "SMC Corporation manufactures, processes, and sells automatic control equipment, sintered filters, and various types of filtration equipment worldwide. The company offers directional control valves, air cylinders, rotary actuators/air grippers, electric actuators/cylinders, vacuum equipment, air preparation equipment, modular F.R.L./pressure control equipment, lubrication equipment, fittings and tubings, flow control equipment, speed controllers, silencers/exhaust cleaners/blow guns/pressure gauges, switches/sensors/controllers, and static neutralization equipment. It also provides process valves, chemical liquid valves/fittings and needle valves/tubings, process pumps, temperature control equipment, process gas equipment, high vacuum equipment, industrial filters/sintered metal elements, pneumatic instrumentation equipment, and hydraulic equipment. The company was formerly known as Shoketsu Kinzoku Kogyo Co., Ltd. and changed its name to SMC Corporation in April 1986. SMC Corporation was founded in 1959 and is headquartered in Tokyo, Japan.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.smcworld.com",
        "full_time_employees": 20704
    },
    "SUN.MX": {
        "short_name": "SCHNEIDER ELECTRIC SE",
        "long_name": "Schneider Electric S.E.",
        "summary": "Schneider Electric S.E. provides energy and automation digital solutions worldwide. The company operates in two segments, Energy Management and Industrial Automation. It offers busway and cable management products, circuit breakers and switches, contactors and protection relays, electrical protection and control products, fuse and safety switches, motor starters and protection components, power monitoring and control products, power quality and power factor correction products, pushbuttons, switches, pilot lights and joysticks, software products, surge protection and power conditioning products, and switchboards and enclosures. The company also provides access control, building management, fire and security, network infrastructure and connectivity, power monitoring and control, power quality and power factor correction, sensor, valve and valve actuator, variable speed drive and soft starter, and video management system products. In addition, it offers feeder automation and grid automation and SCADA software products, medium voltage switchgears and transformers, outdoor equipment, power monitoring and control products, protection relays, substation automation products, and switchgear components. Further, the company provides data center software, IT power distribution products, prefabricated data center modules, racks and accessories, security and environmental monitoring products, surge protection and power conditioning products, and uninterruptible power supply (UPS) products. Additionally, it offers electrical protection and control products, home automation and security products, installation materials and systems, light switches and electrical sockets, network infrastructure and connectivity products, and UPS. It also provides industrial automation and control products; energy access products, such as collective solutions and home systems; and solar and energy storage products. The company was founded in 1836 and is headquartered in Rueil-Malmaison, France.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "state": null,
        "city": "Rueil-Malmaison",
        "zipcode": "92500",
        "website": "http://www.se.com/ww/en",
        "full_time_employees": 135000
    },
    "THTI": {
        "short_name": "THT HEAT TRANSFER TECHNOLOGY IN",
        "long_name": "THT Heat Transfer Technology, Inc.",
        "summary": "THT Heat Transfer Technology, Inc., through its subsidiaries, manufactures and trades in plate heat exchangers and various related products in China and internationally. The company offers heat exchanger units, air-cooled heat exchangers, shell-and-tube heat exchangers, welded plate heat exchangers, and plate-and-shell heat exchangers. Its products are used for various applications in iron, steel, and aluminum manufacturing; chemical manufacturing; electric and nuclear power generation; central building air-conditioning; pharmaceutical production; thermal power plants and residential heating systems; high-pressure liquids; refining, chemical, fertilizer production, and metallurgy equipment; and food and beverage, heat and power, petrochemical, and shipbuilding industry. The company markets its products through its sales force. THT Heat Transfer Technology, Inc. is headquartered in Siping, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Siping",
        "zipcode": "136000",
        "website": "http://www.tht.cn",
        "full_time_employees": 616
    },
    "TPAC": {
        "short_name": "TRANS-PACIFIC AEROSPACE CO INC",
        "long_name": "Trans-Pacific Aerospace Company, Inc.",
        "summary": "Trans-Pacific Aerospace Company, Inc. designs, manufactures, and sells aerospace component parts for commercial and military aircrafts, space vehicles, power plants, and surface and undersea vessels in the United States. It primarily offers self-lubricating spherical bearings, which are integral to the operation of commercial aircrafts and help with various flight-critical tasks, including aircraft flight controls and landing gear. The company was formerly known as Pinnacle Energy Corp. and changed its name to Trans-Pacific Aerospace Company, Inc. in March 2010. Trans-Pacific Aerospace Company, Inc. was founded in 2007 and is based in San Marino, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Marino",
        "zipcode": "91108",
        "website": "http://tpacbearings.com",
        "full_time_employees": 6
    },
    "UMIN.MX": {
        "short_name": "UMICORE",
        "long_name": "Umicore SA",
        "summary": "Umicore SA operates as a materials technology and recycling company worldwide. The company operates through Catalysis, Energy & Surface Technologies, and Recycling segments. The Catalysis segment produces automotive catalysts for gasoline, and diesel light and heavy-duty diesel applications; stationary catalysis for industrial emissions control; and precious metals-based compounds and catalysts for use in the pharmaceutical and fine chemicals industries, as well as fuel cell applications. The Energy & Surface Technologies segment offers cobalt and specialty materials, rechargeable battery materials, electroplating products, and electro-optic materials. The Recycling segment treats waste streams containing precious and other specialty metals from a range of industrial residues and end-of-life materials. This segment also produces precious metals-based materials for glass production, electric, and electronic applications. The company was formerly known as Union MiniÃ¨re du Haut Katanga and changed its name to Umicore SA in 2001. Umicore SA was founded in 1805 and is headquartered in Brussels, Belgium.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Belgium",
        "state": null,
        "city": "Brussels",
        "zipcode": "1000",
        "website": "http://www.umicore.com",
        "full_time_employees": 10576
    },
    "USAE": {
        "short_name": "US AEROSPACE INC",
        "long_name": "U.S. Aerospace, Inc.",
        "summary": "U.S. Aerospace, Inc. produces and supplies aircraft assemblies, structural components, and engineered and precision machined details. It also supplies structural aircraft parts for military aircraft. The companies offers its products for the United States Department of Defense, United States Air Force, and other aircraft manufacturers, aerospace companies, and defense contractors. U.S. Aerospace, Inc. was formerly known as New Century Companies, Inc. and changed its name to U.S. Aerospace, Inc. in April 2010. The company was founded in 1980 and is based in Rancho Cucamonga, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Cucamonga",
        "zipcode": "91730",
        "website": null,
        "full_time_employees": 30
    },
    "VACNN.MX": {
        "short_name": "VAT GROUP AG",
        "long_name": "VAT Group AG",
        "summary": "VAT Group AG, together with its subsidiaries, develops, manufactures, and supplies vacuum valves in Switzerland, rest of Europe, the United States, Japan, Korea, Singapore, China, rest of Asia, and internationally. The company operates through three segments: Valves, Global Service, and Industry. The Valves segment offers vacuum valves for the semiconductor, displays, photovoltaics, and vacuum coating industries, as well as for the industrial and research sectors. The Global Service segment provides spare parts, repairs, and upgrades, as well as support services. The Industry segment produces edge-welded bellows for use in vacuum feedthrough, semiconductor, implantable pump, sealing, and motor vehicle fuel injection system applications; and offers machined parts, mechanical components, and assemblies. VAT Group AG was founded in 1965 is headquartered in Sennwald, Switzerland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Switzerland",
        "state": null,
        "city": "Sennwald",
        "zipcode": "9469",
        "website": "http://www.vatvalve.com",
        "full_time_employees": 2041
    },
    "VALMTN.MX": {
        "short_name": "VALMET OYJ",
        "long_name": "Valmet Oyj",
        "summary": "Valmet Oyj, together with its subsidiaries, develops and supplies process technologies, automation, and services for the pulp, paper, and energy industries. The company offers solutions and services for the pulping industry, including chemical pulping, wood handling, cooking and fiber line, pulp drying, chemical recovery, air emission control, other value-adding processes, dissolving pulping, mechanical pulping, recycled fiber, and automation for pulp. It also provides technologies, automation products, and services for board and paper production, such as recycled fiber, stock preparation, board and paper machines, services for board and paper, and automation for board and paper; and technologies, automation products, and services for tissue production. In addition, the company offers energy solutions, BFB and CFB boilers, gasifiers, power and heating plants, air emission control, industrial internet solutions, and services and automation for energy. Further, it provides solutions to paper converting, mining and chemical, food and biotechnology, and pharmaceuticals industries, as well as commercial laundries; and automation for liquefied natural gas and biogas infrastructure, wastewater, oil and gas, and marine industries. Valmet Oyj is headquartered in Espoo, Finland.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Finland",
        "state": null,
        "city": "Espoo",
        "zipcode": "02150",
        "website": "http://www.valmet.com",
        "full_time_employees": 14026
    },
    "VARNH.AT": {
        "short_name": "VARVARESSOS S.A. (CR)",
        "long_name": "Varvaressos S.A. European Spinning Mills",
        "summary": "Varvaressos S.A. European Spinning Mills engages in the production and sale of yarns. It offers cotton, blended, melange coloured, dyed, S twist, plied, core-spun, and crÃªpe yarns, as well as yarns on dye tubes. Its products are used in apparel/fashion/underwear; and home, technical, and medical textiles. The company was formerly known as Varvaressos S.A. Naoussa Spinning Mill and changed its name to Varvaressos S.A. European Spinning Mills in January 2003. Varvaressos S.A. European Spinning Mills was founded in 1908 and is based in Naousa, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Textile Industrial",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Naousa",
        "zipcode": "592 00",
        "website": "http://www.varvaressos.gr",
        "full_time_employees": 208
    },
    "VWSA.DE": {
        "short_name": "VESTAS WIND ADR 1/3/DK 1",
        "long_name": "Vestas Wind Systems A/S",
        "summary": "Vestas Wind Systems A/S designs, manufactures, installs, and services wind turbines worldwide. The company operates in two segments, Power Solutions and Service. The Power Solutions segment sells wind power plants, wind turbines, development sites, etc. The Service segment engages in the sale of service contracts, spare parts, and related activities. Vestas Wind Systems A/S was founded in 1898 and is headquartered in Aarhus, Denmark.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "GER",
        "market": "de_market",
        "country": "Denmark",
        "state": null,
        "city": "Aarhus",
        "zipcode": "8200",
        "website": "http://www.vestas.com",
        "full_time_employees": 29378
    },
    "WEIRN.MX": {
        "short_name": "WEIR GROUP",
        "long_name": "The Weir Group PLC",
        "summary": "The Weir Group PLC produces and sells highly engineered original equipment. It operates in two segments, Minerals and ESCO. The Minerals segment offers slurry handling equipment and associated aftermarket support services for abrasive high-wear applications used in the mining and oil sands markets. The ESCO segment provides ground engaging tools for surface mining and infrastructure. The company offers its products under the Accumin, Aspir, Cavex, Delta Industrial, Enduron, Floway, GEHO, Gemex, Hydrau-Flo, Isodry, Isogate, Lewis, Linatex, Multiflo, Synertrex, Trio, Vulco, FusionCast, and Warman brands. It operates in the United Kingdom, the United States, Canada, the Asia Pacific, Australia, South America, the Middle East, Europe, and FSU. The Weir Group PLC was founded in 1871 and is headquartered in Glasgow, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "state": null,
        "city": "Glasgow",
        "zipcode": "G2 1RW",
        "website": "http://www.global.weir",
        "full_time_employees": 13070
    },
    "WSML": {
        "short_name": "WILLIAMSVILLE SEARS MANAGEMENT ",
        "long_name": "Williamsville Sears Management, Inc.",
        "summary": "Williamsville Sears Management, Inc. does not have significant operations. The company was formerly engaged in the design, manufacture, and distribution of oral health and teeth whitening products. The company was founded in 2008 and is based in New York, New York. As of March 9, 2018, Williamsville Sears Management, Inc. is a subsidiary of Palewater Global Management Inc.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10111",
        "website": null,
        "full_time_employees": null
    },
    "XYLEK.AT": {
        "short_name": "INTERWOOD-XYLEMPORIA ATENE(CR)",
        "long_name": "Interwood-Xylemporia A.T.E.N.E.",
        "summary": "Interwood-Xylemporia A.T.E.N.E. engages in the manufacturing and trading of wood products in Greece. It offers soft timber and outdoor profiles; soft wood products, including spruce timber, pine timber, and soft American timber; melamines; hard wood products; panels comprising blockboards, HDF smaltines, MDF, OSB, veneer, veneer coated surfaces, and chipboards; gluelam and bilam beams; and flooring products, such as outdoor decks, laminate floors, pre-polished floors, soft wood floors, and indoor parquets. The company was formerly known as Xylemporia A.T.E.N.E. and changed its name to Interwood-Xylemporia A.T.E.N.E. in September 2009. The company was founded in 1983 and is headquartered in Eleusis, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Lumber, Wood Production",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Eleusis",
        "zipcode": "192 00",
        "website": "http://www.interwood.gr",
        "full_time_employees": 142
    },
    "XYLEP.AT": {
        "short_name": "INTERWOOD-XYLEMPORIA ATENE(PR)",
        "long_name": "Interwood-Xylemporia A.T.E.N.E.",
        "summary": "Interwood-Xylemporia A.T.E.N.E. engages in the manufacturing and trading of wood products in Greece. It offers soft timber and outdoor profiles; soft wood products, including spruce timber, pine timber, and soft American timber; melamines; hard wood products; panels comprising blockboards, HDF smaltines, MDF, OSB, veneer, veneer coated surfaces, and chipboards; gluelam and bilam beams; and flooring products, such as outdoor decks, laminate floors, pre-polished floors, soft wood floors, and indoor parquets. The company was formerly known as Xylemporia A.T.E.N.E. and changed its name to Interwood-Xylemporia A.T.E.N.E. in September 2009. The company was founded in 1983 and is headquartered in Eleusis, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Lumber, Wood Production",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Eleusis",
        "zipcode": "192 00",
        "website": "http://www.interwood.gr",
        "full_time_employees": 142
    }
}