{
  "AIRN.MX": {
    "city": "Leiden",
    "country": "Netherlands",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Aerospace Defense - Major Diversified",
    "long_name": "Airbus SE",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrial Goods",
    "short_name": "AIRBUS SE",
    "state": null,
    "summary": "Airbus SE designs, manufactures, and distributes aerospace products and solutions in the Netherlands and internationally. The company operates through three segments: Airbus, Airbus Helicopters, and Airbus Defence and Space. The company's Airbus segment develops, manufactures, markets, and sells commercial jet aircraft of approximately 100 seats; and regional turboprop aircraft and aircraft components, as well as provides aircraft conversion and related services. Its Airbus Helicopters segment develops, manufactures, markets, and sells civil and military helicopters; and provides helicopter related services. The company's Airbus Defence and Space segment designs, develops, delivers, and supports military aircraft, such as combat, mission, transport, and tanker aircraft; and provides unmanned aerial systems and their associated services. It also offers civil and defense space systems for telecommunications, earth observations, navigation, science, and orbital systems; missile systems; and missile and space launcher systems, as well as services around data processing from platforms, secure communication, and cyber security. The company was formerly known as Airbus Group SE and changed its name to Airbus SE in April 2017. Airbus SE was incorporated in 1998 and is headquartered in Leiden, the Netherlands.",
    "website": "http://www.airbus.com",
    "zipcode": "2333 CS"
  },
  "BBDBN.MX": {
    "city": "Montreal",
    "country": "Canada",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Aerospace Defense - Major Diversified",
    "long_name": "Bombardier Inc.",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Industrial Goods",
    "short_name": "BOMBARDIER INC",
    "state": "QC",
    "summary": "Bombardier Inc., together with its subsidiaries, manufactures and sells transportation equipment worldwide. The company designs, manufactures, and markets business jets; designs and manufactures a portfolio of commercial aircraft in the 50- to 100-seat categories, including the CRJ550, CRJ700, CRJ900, and CRJ1000 regional jets; designs, develops, and manufactures aircraft structural components, such as engine nacelles, fuselages, and wings; and provides aftermarket component repair, overhaul, and other engineering services. Bombardier Inc. was incorporated in 1902 and is headquartered in Montreal, Canada.",
    "website": "http://www.bombardier.com",
    "zipcode": "H3B 1Y8"
  },
  "ERJN.MX": {
    "city": "São Paulo",
    "country": "Brazil",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Aerospace Defense - Major Diversified",
    "long_name": "Embraer S.A.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Industrial Goods",
    "short_name": "EMBRAER SA",
    "state": "SP",
    "summary": "Embraer S.A. designs, develops, manufactures, and sells aircrafts and systems in Brazil, North America, Latin America, the Asia Pacific, Brazil, Europe, and internationally. It operates through Defense and Security; Executive Jets; Service & Support; and Other segments. The Defense and Security segment engages in the research, development, production, modification, and support for military defense and security aircraft, as well as offers a range of products and integrated solutions that include radars, special space systems (satellites), and information and communications systems, such as command, control, communications, computer, intelligence, surveillance, and reconnaissance systems. The Executive Jets segment develops, produces, and sells executive jets. It also leases Legacy 600 and Legacy 650 executive jets in the super midsize and large categories; Legacy 450 and Legacy 500 executive jets in the midlight and midsize categories; Phenom family executive jets in the entry jet and light jet categories; Lineage 1000, an ultra-large executive jet; and Praetor 500 and Praetor 600, disruptive executive jets in the midsize and super midsize categories. The Service & Support segment offers after-service solutions, support, and maintenance, repair, and overhaul services for commercial, executive, and defense aircraft; provides aircraft components and engines; and supplies steel and composite aviation structures to various aircraft manufacturers. The Other segment is involved in the supply of fuel systems, structural parts, and mechanical and hydraulic systems; and production of agricultural crop-spraying aircraft. The company was formerly known as Embraer-Empresa Brasileira de Aeronáutica S.A. and changed its name to Embraer S.A. in November 2010. Embraer S.A. was founded in 1969 and is headquartered in São Paulo, Brazil.",
    "website": "http://www.embraer.com",
    "zipcode": "05425-070"
  },
  "HONV.PA": {
    "city": "Courbevoie",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Aerospace Defense - Major Diversified",
    "long_name": "Thales S.A.",
    "market": "fr_market",
    "market_cap": null,
    "sector": "Industrial Goods",
    "short_name": "THALES NV21",
    "state": null,
    "summary": "Thales S.A. provides various solutions for civilian and military customers in the aeronautics, space, defense, security, and ground transportation markets worldwide. It operates through Aerospace, Transport, Defence & Security, and Digital Identity & Security segments. The company offers communications, command, and control systems; mission services and support; protection and mission/combat systems; surveillance, detection, and intelligence systems; training and simulation solutions for air, land, naval, and joint forces; and digital identity and security solutions. It also provides air traffic management solutions; flight decks and avionics equipment and functions; in-flight entertainment and connectivity systems and services; electrical systems; aerospace training solutions; navigation solutions; support and services for avionics equipment; and vision systems. In addition, the company designs, operates, and delivers satellite-based systems for telecommunications, navigation, earth observation, environmental management, exploration, and science and orbital infrastructures; signaling, communications and supervision, and fare collection management systems and related services; cybersecurity and railway digitalization systems; and main line rail, and urban and intermodal mobility solutions. Further, it provides solutions for various markets and applications, including radiology, radio frequency, microwave sources, training and simulation solutions, lasers, and microelectronics solutions for science, industry, space, defense, automotive, railways, and energy conversion platforms. The company was formerly known as Thomson-CSF and changed its name to Thales S.A. in 2000. Thales S.A. was founded in 1893 and is based in Courbevoie, France.",
    "website": "http://www.thalesgroup.com/en",
    "zipcode": "92400"
  },
  "RTX.BA": {
    "city": "Waltham",
    "country": "United States",
    "currency": "ARS",
    "exchange": "BUE",
    "industry": "Aerospace Defense - Major Diversified",
    "long_name": "Raytheon Technologies Corporation",
    "market": "ar_market",
    "market_cap": null,
    "sector": "Industrial Goods",
    "short_name": "RAYTHEON TECHNOLOG",
    "state": "MA",
    "summary": "Raytheon Technologies Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers worldwide. It operates through four segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for aircraft manufacturers and airlines, as well as regional, business, and general aviation; and for defense and commercial space operations. This segment also designs, produces, and supports cabin interior, communications and aviation systems, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; airborne intelligence, surveillance and reconnaissance systems, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon Intelligence & Space segment develops and provides integrated sensor and communication systems for missions, training, and cyber and software solutions to intelligence, defense, federal, and commercial customers. The Raytheon Missiles & Defense segment designs, develops, produces, and sustains integrated air and missile defense systems; defensive and combat solutions; land- and sea-based radars; command, control, communications, and intelligence solutions; and naval and undersea sensor solutions for the U.S. and foreign government customers. The company is headquartered in Waltham, Massachusetts.",
    "website": "http://www.rtx.com",
    "zipcode": "02451"
  }
}
