{
    "TPAC": {
        "short_name": "TRANS-PACIFIC AEROSPACE CO INC",
        "long_name": "Trans-Pacific Aerospace Company, Inc.",
        "summary": "Trans-Pacific Aerospace Company, Inc. designs, manufactures, and sells aerospace component parts for commercial and military aircrafts, space vehicles, power plants, and surface and undersea vessels in the United States. It primarily offers self-lubricating spherical bearings, which are integral to the operation of commercial aircrafts and help with various flight-critical tasks, including aircraft flight controls and landing gear. The company was formerly known as Pinnacle Energy Corp. and changed its name to Trans-Pacific Aerospace Company, Inc. in March 2010. Trans-Pacific Aerospace Company, Inc. was founded in 2007 and is based in San Marino, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Marino",
        "zipcode": "91108",
        "website": "http://tpacbearings.com",
        "market_cap": "Nano Cap"
    },
    "USAE": {
        "short_name": "US AEROSPACE INC",
        "long_name": "U.S. Aerospace, Inc.",
        "summary": "U.S. Aerospace, Inc. produces and supplies aircraft assemblies, structural components, and engineered and precision machined details. It also supplies structural aircraft parts for military aircraft. The companies offers its products for the United States Department of Defense, United States Air Force, and other aircraft manufacturers, aerospace companies, and defense contractors. U.S. Aerospace, Inc. was formerly known as New Century Companies, Inc. and changed its name to U.S. Aerospace, Inc. in April 2010. The company was founded in 1980 and is based in Rancho Cucamonga, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Cucamonga",
        "zipcode": "91730",
        "website": null,
        "market_cap": "Nano Cap"
    }
}