{
  "AKRIT.AT": {
    "city": "Alexandroupoli",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Building Materials",
    "long_name": "Akritas S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "AKRITAS S.A. (CR)",
    "state": null,
    "summary": "Akritas S.A. produces, processes, and sells wood products in Greece. The company offers particleboard under the AKRIPAN name for wood veneer, melamine, laminate, and PVC coating applications; chipboards under the AKRITAS name; and doors, worktops-kitchen tops, and surfaces under the POLYTHETA name. It also provides Evropanel, a lightweight material for use in shopfitting and trade fair furnishing, interior doors, tabletops, shelves, furniture and interior design, room dividers, and sound and thermal isolation applications. The company was founded in 1977 and is headquartered in Alexandroupoli, Greece.",
    "website": "http://www.akritas.gr",
    "zipcode": "681 00"
  },
  "CRHN.MX": {
    "city": "Dublin",
    "country": "Ireland",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "General Building Materials",
    "long_name": "CRH plc",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrial Goods",
    "short_name": "CRH",
    "state": null,
    "summary": "CRH plc, through its subsidiaries, manufactures and distributes building materials. It operates in three segments: Americas Materials, Europe Materials, and Building Products. The company manufactures and supplies cement, lime, aggregates, precast, ready mixed concrete, and asphalt products; concrete masonry and hardscape products comprising pavers, kerbs, retaining walls, and related patio products; and glass and glazing products, including architectural glass, custom-engineered curtain and window walls, architectural windows, storefront systems, doors, skylights, and architectural hardware. It also offers precast concrete and polymer-based products, such as underground vaults, drainage pipes and structures, utility enclosures, and modular precast structures to the water, energy, communication, transportation, and building structures markets; and construction accessories, such as anchoring, fixing, and connection solutions, as well as lifting systems, formwork accessories, and other accessories used in construction applications. In addition, the company offers network access products, which include composite access chambers, covers, passive safety systems, retention sockets, sealants, and meter boxes; and paving and construction services. Further, it provides building and civil engineering contracting, contract surfacing, operates logistics and owned railway infrastructure; sells and distributes cement; and supplies access chambers and ducting products. It serves governments, contractors, homebuilders, homeowners, and sub-contractors. The company operates primarily in the Republic of Ireland, the United Kingdom, the rest of Europe, the United States, and internationally. CRH plc was founded in 1936 and is headquartered in Dublin, Ireland.",
    "website": "http://www.crh.com",
    "zipcode": "16"
  },
  "IKTIN.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Building Materials",
    "long_name": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "IKTINOS HELLAS S.A. (CR)",
    "state": null,
    "summary": "Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company quarries, cuts, and processes marbles in Greece, the Euro Area, and internationally. The company operates through Marble, Wind Energy, and Real Estate segments. It imports and trades in marbles, granites, and rare decorative stones; and operates as a dealer for artificial rocks and fine mosaics made of natural rocks. The company also offers natural stones, including natural Greek marbles, natural imported marbles, granites, and onyx; synthetic materials, such as quarellas; and other decorative materials comprising travertino, sandstone, psammite, limestone, slate, graphite, glass stone, and gemstone. In addition, it engages in the aeolian energy and real estate businesses. Iktinos Hellas S.A. Greek Marble Industry Technical and Touristic Company was founded in 1974 and is headquartered in Athens, Greece.",
    "website": "http://www.iktinos.gr",
    "zipcode": "144 52"
  },
  "MATHIO.AT": {
    "city": "Athens",
    "country": "Greece",
    "currency": "EUR",
    "exchange": "ATH",
    "industry": "General Building Materials",
    "long_name": "Mathios Refractories S.A.",
    "market": "gr_market",
    "market_cap": "Nano Cap",
    "sector": "Industrial Goods",
    "short_name": "MATHIOS REFRACTORY S.A.",
    "state": null,
    "summary": "Mathios Refractories S.A. engages in the production and sale of refractory materials and building products in Greece and internationally. The company offers stones, bricks, and pavers; building materials, including glass blocks, firebricks, mortars and additives, and flooring and thermal insulation products; heating solutions, such as eco fireplaces, eco stoves, heat backs, and bioethanole fireplaces; and landscaping products comprising mat grass, mat green, vermiculite, forest whisper, and garden steps. It also offers research and development, engineering, procurement, installation, and other support services. The company provides its products under the brand names of IDEAL, MAT, MAT PLUS, MAT CAST, MAT MICRON and MAT NANO, MAT SF, and MAT RAM. It serves cement, steel, ceramic, aluminum, glass power plant, refinery, wood, food, lime, and fertilizer industries. The company was founded in 1890 and is based in Athens, Greece.",
    "website": "http://www.mathios.com",
    "zipcode": "18233"
  },
  "SGON.MX": {
    "city": "Courbevoie",
    "country": "France",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "General Building Materials",
    "long_name": "Compagnie de Saint-Gobain S.A.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Industrial Goods",
    "short_name": "COMPAGNIE DE ST-GOBAIN",
    "state": null,
    "summary": "Compagnie de Saint-Gobain S.A. designs, manufactures, and distributes materials and solutions for wellbeing worldwide. It operates in five segments: High Performance Solutions; Northern Europe; Southern Europe  Middle East (ME) & Africa; Americas; and Asia-Pacific. The company offers glass for building, industrial mortars, exterior products, and pipes; insulation, plasterboards, and interior glass products; and coated glass and high performance materials. It also distributes heavy building materials; plumbing, heating, and sanitary ware products; timbers and panels; interior solutions; roofing products; civil engineering products; ceramic tiles; and site equipment and tools. The company was founded in 1665 and is headquartered in Courbevoie, France.",
    "website": "http://www.saint-gobain.com",
    "zipcode": "92400"
  }
}
