{
    "ACA.MX": {
        "short_name": "ARCOSA INC",
        "long_name": "Arcosa, Inc.",
        "summary": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structures, and Transportation Products. The Construction Products segment offers natural and lightweight aggregates; specialty materials, including lightweight aggregates and plaster; trench shields and shoring products for residential and non-residential construction, agriculture, specialty building products, and underground construction markets, as well as for infrastructure, including road, bridge, and other public products markets. The Engineered Structures segment provides utility structures, wind towers, traffic and lighting structures, telecommunication structures, storage and distribution tanks for electricity transmission and distribution, wind power generation, highway road construction, and wireless communication markets, as well as for gas and liquids storage and transportation for residential, commercial, agriculture, and industrial markets. The Transportation Products segment offers inland barges; fiberglass barge covers, winches, and other components; axles and couplers for railcars and locomotives; industrial and military castings, and forged products for transportation products serving various markets, including agriculture/food, refined, chemicals, upstream oil, and railcar manufacturers and maintenance operations industries. Arcosa, Inc. was incorporated in 2018 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.arcosa.com",
        "market_cap": "Mid Cap"
    },
    "DOMIK.AT": {
        "short_name": "DOMIKI KRITIS S.A. (CR)",
        "long_name": "Domiki Kritis S.A.",
        "summary": "Domiki Kritis S.A. primarily engages in the construction of heavy infrastructure projects for public and private sectors in Greece. The company undertakes infrastructure projects, including road, port, building, residential, industrial, energy, electromechanical, hydraulic, sewerage, water supply, solid and waste management, renewable energy, and greening projects. It also engages in the real estate development activities, and production of electricity from renewable energy sources. The company was founded in 1985 and is based in Heraklion, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Heraklion",
        "zipcode": "712 02",
        "website": "http://www.domik.gr",
        "market_cap": "Small Cap"
    },
    "FERN.MX": {
        "short_name": "FERROVIAL SA",
        "long_name": "Ferrovial, S.A.",
        "summary": "Ferrovial, S.A., together with its subsidiaries, operates as an infrastructure and mobility operator in the United States, Poland, Spain, the United Kingdom, Canada, and internationally. The company engages in the design and construction of various public and private works; and development, finance, and operation of toll roads. Its construction activities include highways, tunnels, railways, bridges and viaducts, airports, intelligent toll systems, energy restoration, aqueducts, water treatment plants, port infrastructures, desalination plants, digesters, thermal drying plants, chimneys and silos, oil facilities, and other construction, as well as operation and maintenance services of urban and industrial waste water treatment plants, and water treatment and desalination plants. The company also develops, manufactures, and markets asphalt and bitumen products; develops, finances, and operates airports; provides integrated solutions for the development and management of electrical transmission networks; and sells real estate properties, including flats, retail units, and garages. In addition, it provides construction management services; mobility services, including ZITY, an electric carsharing service application; and Wondo, which offers mobility in cities through Moovit application. The company was founded in 1952 and is based in Madrid, Spain.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "Spain",
        "state": null,
        "city": "Madrid",
        "zipcode": "28002",
        "website": "http://www.ferrovial.com",
        "market_cap": "Large Cap"
    },
    "INKAT.AT": {
        "short_name": "INTRACOM CONSTRUCTIONS S.A(CR)",
        "long_name": "Intracom Constructions Societe Anonyme Technical and Steel Constructions",
        "summary": "Intracom Constructions Societe Anonyme Technical and Steel Constructions engages in the construction business in Europe and internationally. The company operates through Constructions and Steel Structures segments. It offers infrastructure projects, such as airport, road, rail road, water engineering, and marine projects; and buildings that include offices, professional infrastructures, shopping centers, educational and cultural buildings, hospitals, health centers, sports venues, and stadiums. The company also provides develops real estate properties, such as villas and boutique hotels; and undertakes industrial facilities for industrial projects and logistics buildings. In addition, it operates motorways, broadband, integrated passenger information systems, waste management, and parking services through public private partnership, and built transfer and operate agreements; and undertakes telecommunication projects, including broadband networks, mobile telephony base stations and networks, wireless transmission systems, and specialized projects, as well as maintenance services. Further, the company provides solid and waste management projects that include waste management, soil remediation and regeneration, water refinery, and waste water treatment. Additionally, it undertakes projects of wind farms, photovoltaic parks, and natural gases. The company was founded in 1987 and is headquartered in Paiania, Greece. Intracom Constructions Societe Anonyme Technical and Steel Constructions is a subsidiary of Intracom Holdings S.A.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Paiania",
        "zipcode": "190 02",
        "website": "http://www.intrakat.gr",
        "market_cap": "Small Cap"
    }
}