{
    "BIOSK.AT": {
        "short_name": "UNIBIOS HOLDING S.A",
        "long_name": "Unibios Holdings S.A.",
        "summary": "Unibios Holdings S.A., through its subsidiaries, develops and installs water treatment and recycling systems in Europe, Africa, and the Middle East. It also offers heating and air conditioning equipment, as well as installs and rents facade scaffoldings. The company was formerly known as Biossol SA and changed its name to Unibios Holdings S.A. in July 2008. Unibios Holdings S.A. was founded in 1940 and is based in Ano Liosia, Greece.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Ano Liosia"
    },
    "NVIC": {
        "short_name": "N-VIRO INTERNATIONAL CORP",
        "long_name": "N-Viro International Corporation",
        "summary": "N-Viro International Corporation markets its N-Viro Fuel technology that produces a renewable alternative fuel product out of certain bio-organic wastes. N-Viro Fuel is a patented biomass alternative energy fuel process that produces a product that has physical and chemical characteristics similar to certain coals and is created from municipal biosolids, collectable animal manure, pulp and paper sludge, and other organic wastes. The company owns and licenses the N-Viro Process, a patented technology to treat and recycle wastewater sludges and other bio-organic wastes, utilizing certain alkaline by-products produced by the cement, lime, and other industries, as well as electric utilities. Its N-Viro Process stabilizes and pasteurizes sludge; reduces odors to acceptable levels; neutralizes or immobilizes various constituents; and generates N-Viro Soil, a product that has a granular appearance similar to soil and is used in various agricultural applications. In addition, the company is involved in the distribution and resale of alkaline admixtures. N-Viro International Corporation was founded in 1979 and is based in Toledo, Ohio.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Toledo"
    }
}