{
    "BKGN.MX": {
        "short_name": "BERKELEY GROUP HLDGS",
        "long_name": "The Berkeley Group Holdings plc",
        "summary": "The Berkeley Group Holdings plc, together with its subsidiaries, engages in the residential-led and mixed-use property development activities in the United Kingdom. It operates under the Berkeley, St Edward, St George, St James, St Joseph, St William, Berkeley First, Berkeley Commercial, Berkeley Partnership, and Berkeley Modular brand names. The company was founded in 1976 and is headquartered in Cobham, the United Kingdom.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United Kingdom",
        "city": "Cobham"
    },
    "DHI.MX": {
        "short_name": "DR HORTON INC",
        "long_name": "D.R. Horton, Inc.",
        "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, Midwest, Southeast, South Central, Southwest, and West regions in the United States. It engages in the acquisition and development of land; and construction and sale of homes in 29 states and 88 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company constructs and owns multi-family rental properties; owns residential real estate, including ranch land and improvements; and owns and operates oil and gas assets. The company primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is based in Arlington, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Arlington"
    },
    "MLHCF.PA": {
        "short_name": "HOME CONCEPT",
        "long_name": "Home Concept Société anonyme",
        "summary": null,
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Fontenay-sous-Bois"
    },
    "WSML": {
        "short_name": "WILLIAMSVILLE SEARS MANAGEMENT ",
        "long_name": "Williamsville Sears Management, Inc.",
        "summary": "Williamsville Sears Management, Inc. does not have significant operations. The company was formerly engaged in the design, manufacture, and distribution of oral health and teeth whitening products. The company was founded in 2008 and is based in New York, New York. As of March 9, 2018, Williamsville Sears Management, Inc. is a subsidiary of Palewater Global Management Inc.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    }
}