{"AOF.L": {"short_name": "AFRICA OPPORTUNITY FUND LIMITED", "long_name": "Africa Opportunity Fund Limited", "summary": "Africa Opportunity Fund Limited is close ended balanced mutual fund launched and managed by Africa Opportunity Partners Limited. The fund invests in equity and fixed income markets of Africa. It seeks to invest in stocks of companies operating across diversified sectors. The fund invests in equity, debt, and other interests in both listed and unlisted assets. Africa Opportunity Fund Limited was formed on July 26, 2007 and is domiciled in Cayman Islands.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Cayman Islands", "city": "George Town"}, "MAFL.L": {"short_name": "MINERAL & FINANCIAL INVESTMENTS", "long_name": "Mineral & Financial Investments Limited", "summary": "Mineral & Financial Investments Limited, an investment company, invests in natural resources, minerals, metals, and oil and gas projects in the Cayman Islands. Mineral & Financial Investments Limited is based in George Town, the Cayman Islands.", "currency": "GBp", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Cayman Islands", "city": "George Town"}, "PAX": {"short_name": "Patria Investments Limited", "long_name": "Patria Investments Limited", "summary": "Patria Investments Limited operates as a private market investment firm focused on investing in Latin America. It offers asset management services to investors focusing on private equity funds, infrastructure development funds, co-investments funds, constructivist equity funds, and real estate and credit funds. The company was founded in 1994 and is headquartered in Grand Cayman, the Cayman Islands.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NMS", "market": "us_market", "country": "Cayman Islands", "city": "Grand Cayman"}}