{
    "GLRE": {
        "short_name": "Greenlight Reinsurance, Ltd.",
        "long_name": "Greenlight Capital Re, Ltd.",
        "summary": "Greenlight Capital Re, Ltd., through its subsidiaries, operates as a property and casualty reinsurance company worldwide. The company offers various property reinsurance products and services, including automobile physical damage; personal lines, such as homeowners' insurance; and commercial lines. It also provides casualty reinsurance products and services comprising general liability, motor liability, professional liability, and worker's compensation; and accident and health, transactional liability, mortgage insurance, surety, trade credit, marine, aviation, crop, energy, cyber, political, and terrorism products. The company markets its products through reinsurance brokers. Greenlight Capital Re, Ltd. was incorporated in 2004 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.greenlightre.com",
        "full_time_employees": 35
    },
    "OXBR": {
        "short_name": "Oxbridge Re Holdings Limited",
        "long_name": "Oxbridge Re Holdings Limited",
        "summary": "Oxbridge Re Holdings Limited, together with its subsidiaries, provides specialty property and casualty reinsurance solutions. It underwrites reinsurance contracts primarily for property and casualty insurance companies in the Gulf Coast region of the United States. The company distributes its products and solutions through reinsurance brokers. Oxbridge Re Holdings Limited was incorporated in 2013 and is headquartered in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Insurance - Reinsurance",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9006",
        "website": "http://www.oxbridgere.com",
        "full_time_employees": 3
    }
}