{
    "000561.SZ": {
        "short_name": "SHAANXI FENGHUOP",
        "long_name": "Shaanxi Fenghuo Electronics Co., Ltd.",
        "summary": "Shaanxi Fenghuo Electronics Co., Ltd. engages in the development and production of military communications equipment and electroacoustic products in China. Its products include tactical wireless communication, search and rescue and positioning, audio integrated management, electroacoustic and noise control, and Internet of things communication systems; satellite communication navigation equipment; communication navigation antennas; semiconductor lighting; and photovoltaic silicon and electromechanical products. The company was founded in 1956 and is based in Baoji, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Baoji",
        "zipcode": "721006",
        "website": "http://www.fenghuo.cn",
        "market_cap": "Small Cap"
    },
    "002103.SZ": {
        "short_name": "GUANGBO GROUP STOC",
        "long_name": "Guangbo Group Stock Co., Ltd.",
        "summary": "Guangbo Group Stock Co., Ltd., through its subsidiaries, engages in the development, production, import, and sale of office stationery, printing paper products, and plastic products in China. It offers products, such as books, photo albums, color printing and packaging products, office supplies, and gifts, as well as logistic services. The company also exports its products to Europe, America, Southeast Asia, and other countries and regions. Guangbo Group Stock Co., Ltd. was founded in 1992 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315155",
        "website": "http://www.guangbo.net",
        "market_cap": "Small Cap"
    },
    "002177.SZ": {
        "short_name": "GZ KINGTELLER TECH",
        "long_name": "Guangzhou Kingteller Technology Co.,Ltd.",
        "summary": "Guangzhou Kingteller Technology Co.,Ltd. provides financial self-service devices and integrated solutions for the retail banking industry worldwide. The company offers a range of lobby and TTW cash dispensers, and cash recycler systems; VTM systems; pan financial equipment; media dispensers; and banknote sorters, as well as ATM spare parts card readers, printers, belts, touch screens, and EPP keypads. It also provides software solutions, including KT CAMERA, a video monitoring system; and KT VIEW, a real-time monitoring, as well as financial self-service terminals. In addition, the company offers support services, such as remote support through email, MSN, SMS, SKYPE, and hot-line support services; on-site support services comprising software installation, network integration, and hardware troubleshooting services; technical training services; and spare parts, as well as local partner's support services consisting of ATM installation, daily maintenance, and upgradation services. Guangzhou Kingteller Technology Co.,Ltd. was founded in 2001 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.kingteller.com.cn",
        "market_cap": "Small Cap"
    },
    "002197.SZ": {
        "short_name": "SHENZHEN ZHENGTONG",
        "long_name": "SZZT Electronics CO.,LTD",
        "summary": "SZZT Electronics CO.,LTD provides financial payment information security products primarily in Asia, America, Europe, and the Middle East. The company offers point of sale, kiosk, encrypted pin pad, component, and tax products, as well as financial security payment solutions. It serves the banking, traffic, retail, medical care, tourism, and O2O industries. SZZT Electronics CO.,LTD was founded in 1993 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518132",
        "website": "http://www.szzt.com.cn",
        "market_cap": "Small Cap"
    },
    "002301.SZ": {
        "short_name": "SHENZHEN COMIX GRO",
        "long_name": "Shenzhen Comix Group Co., Ltd.",
        "summary": "Shenzhen Comix Group Co., Ltd. manufactures and sells office supplies in China and internationally. The company offers filing products comprising view and ring binders; LAF products; display books; clip boards; suspension files; button and zipper bags; report, expanding, refill, box, and pressure files; file cases; indexes and dividers; and name card and card holders. It also provides desktop stationeries consisting of staplers, punches, staple removers, file boxes and trays, transparent drawers, file cabinets, book stands, pen stands, magnetic clip boxes, binder clips, colored clips and bands sets, paper clips and staples, clips and pins, scissors, utility knifes, replacement blades, key boxes, and steel scudding knifes. In addition, the company offers student stationery products, such as pencil sharpeners, scissors, erasers, rulers, stapler sets, and little polo bear series; paper products, including notebooks, easy sticks, copy papers, and note papers; and writing instruments comprising gel-ink and ball pens, pencils, permanent markers, whiteboard markers, highlighters, and refills. Further, it provides pocket, desktop, and office calculators; office equipment consisting of shredders, binding machines, laminators, laminating films, time recorders, lubrication sachets, and equipment accessories; and conference and presentation products, such as board series, white boards accessories, projection screens, laser pointers, and projector table series. The company was formerly known as Shenzhen Comix Stationery Co., Ltd. and changed its name to Shenzhen Comix Group Co., Ltd. in September 2014. Shenzhen Comix Group Co., Ltd. was founded in 1991 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.comix.com.cn",
        "market_cap": "Small Cap"
    },
    "002376.SZ": {
        "short_name": "SHANDONG NEW BEIYA",
        "long_name": "Shandong New Beiyang Information Technology Co., Ltd.",
        "summary": "Shandong New Beiyang Information Technology Co., Ltd. engages in the research and development, production, sale, and service of thermal printing, identification, and smart system integration products in China. Its products include teller cash recyclers, automatic sorting systems, smart vending lockers, smart food pickup lockers, smart micro market products, embedded scanners, cash deposit modules, bank note sorters, parcel lockers, embedded scanners and printers, industrial and desktop label printers, label and receipt mobile printers, thermal receipt printers, kiosk impact and label printers, scale printers, kiosk thermal printers, impact receipt printers, and scale printers. The company also manufactures and installs parcel lockers in residential communities, office buildings, campuses, and retail centers, as well as offers hardware and software solutions, including installation, operation, and maintenance services. It serves logistics, finance, and other industries. The company also exports its products to various countries and regions in Europe, North America, and the Asia-Pacific. Shandong New Beiyang Information Technology Co., Ltd. was founded in 1988 and is based in Weihai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weihai",
        "zipcode": "264203",
        "website": "http://www.snbc.cn",
        "market_cap": "Small Cap"
    },
    "002520.SZ": {
        "short_name": "ZHEJIANG RIFA PREC",
        "long_name": "Zhejiang RIFA Precision Machinery Co., Ltd.",
        "summary": "Zhejiang RIFA Precision Machinery Co., Ltd. manufactures and sells CNC machine tools in China the United States, France, Poland, Japan, and internationally. The company offers CNC vertical and horizontal machining centers, CNC vertical and horizontal lathes, CNC gantry machining centers, floor type boring machines, and specialized grinding machines. It serves boiler, mining, and wind industries. The company was founded in 1998 and is based in Xinchang, China. ZheJiang RIFA Precision Machinery Co., Ltd. is a subsidiary of Zhejiang Rifa Holding Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinchang",
        "zipcode": "312500",
        "website": "http://www.rifapm.com",
        "market_cap": "Small Cap"
    },
    "300130.SZ": {
        "short_name": "XGD INC",
        "long_name": "XGD Inc.",
        "summary": "XGD Inc., together with its subsidiaries, researches, develops, manufactures, sells, and leases POS terminals and provides in China and internationally. The company designs and develops financial POS terminal hardware and software; and provides e-commerce, Internet payment software development, and technical services for UnionPay business, commercial banks, and third-party service organizations. In addition, the company offers financial services; and is involved in Internet of Things business, which provides services to terminal merchants and other customers. The company was formerly known as Nexgo Inc. and changed its name to XGD Inc. in October 2018. XGD Inc. was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.nexgo.com.cn",
        "market_cap": "Small Cap"
    },
    "300202.SZ": {
        "short_name": "JULONG CO LTD",
        "long_name": "Julong Co., Ltd.",
        "summary": "Julong Co., Ltd. offers currency security operating and digital management solutions. It provides banknote sorting machines; multifunctional cash processing systems; self-service devices, such as automatic teller, cash recycling, and teller cash recycling machines; and automated strapping and bundling machines, and banknote shrink wrapping machines. The company also provides banking business training services, and maintenance and technical services. It serves commercial banks and other financial institutions worldwide. The company was formerly known as Liaoning Julong Financial Equipment Corp. and changed its name to Julong Co., Ltd. in October 2014. Julong Co., Ltd. was founded in 2004 and is headquartered in Anshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Anshan",
        "zipcode": null,
        "website": "http://www.julong.cc",
        "market_cap": "Small Cap"
    },
    "300205.SZ": {
        "short_name": "WUHAN TIANYU INFOR",
        "long_name": "Wuhan Tianyu Information Industry Co., Ltd.",
        "summary": "Wuhan Tianyu Information Industry Co., Ltd. provides data security products and smart cards worldwide. The company provides card products, including financial IC cards, financial social security cards, resident health cards, intelligent communication cards, intelligent traffic cards, eSE mode cards, networking cards, etc. It also offers terminal products, such as mPOS and smart POS products, mobile credit card equipment, tax control disks, smart wearable devices, etc. The company was founded in 1993 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": null,
        "website": "http://www.whty.com.cn",
        "market_cap": "Small Cap"
    },
    "300479.SZ": {
        "short_name": "SHANDONG SYNTHESIS",
        "long_name": "Synthesis Electronic Technology Co., Ltd.",
        "summary": "Synthesis Electronic Technology Co., Ltd. develops, produces, sells, and services smart ID authentication terminals and industrial application software in China. The company offers ID authentication devices/terminals, in-counter clearance settlement/over-the-counter settlement/paperless office terminals, mobile integrated pad and multi-functional matched terminals, bank-hospital self-service devices, clinic-room payment terminals, conglomerate payment modules and e-scales, face-ID matching authentication devices/terminals, and industrial service robots. It also provides counter real name authentication, ID authentication over internet, telecommunication real name system and paperless service, digital community, livelihood e-station, quick payment, and computer vision services, as well as intelligent upgrading of self-service equipment and knowledge management systems. The company was formerly known as Shandong Synthesis Electronic Technology Co., Ltd. and changed its name to Synthesis Electronic Technology Co., Ltd. in January 2016. Synthesis Electronic Technology Co., Ltd. is based in Jinan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinan",
        "zipcode": "250101",
        "website": "http://www.sdses.com",
        "market_cap": "Small Cap"
    },
    "300551.SZ": {
        "short_name": "SHANGHAI GUAO ELEC",
        "long_name": "Shanghai Guao Electronic Technology Co., Ltd.",
        "summary": "Shanghai Guao Electronic Technology Co., Ltd. engages in the research and development, manufacture, marketing, and servicing of financial equipment. It offers banknote (coin) sorter, banknote sort assembly line, banknote discriminator, banknote sorting and binding machine, banknote binder, multi-currency banknote detector, banknote sorting and dispensing machine, full-auto banknote strapping machine, ATM, CRS, smart business terminal, bill teller system, receipt collecting system, etc., as well as currency identification instruments and counterfeit currency discriminators under the Gooao brand name. The company offers its products through sales network in China, Europe, America, Africa, Asia, and Oceania. Shanghai Guao Electronic Technology Co., Ltd. was founded in 1996 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200333",
        "website": "http://en.gooao.cn",
        "market_cap": "Small Cap"
    },
    "300689.SZ": {
        "short_name": "SHENZHEN CHENGTIAN",
        "long_name": "Shenzhen Chengtian Weiye Technology Co., Ltd.",
        "summary": "Shenzhen Chengtian Weiye Technology Co., Ltd. researches, develops, manufactures, sells, and services smart cards in China and internationally. It offers telecommunication cards, financial IC cards, ID cards, etc. The company serves mobile communications, financial payments, and public utilities markets. Shenzhen Chengtian Weiye Technology Co., Ltd. was founded in 2006 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.ctwy.cn",
        "market_cap": "Small Cap"
    },
    "300729.SZ": {
        "short_name": "LOCTEK ERGONOMIC T",
        "long_name": "Loctek Ergonomic Technology Corp.",
        "summary": "Loctek Ergonomic Technology Corp. manufactures and sells ergonomic products in China and internationally. The company offers height adjustable standing desks, collaborative media wall products, desktop workstations, monitor mounts, exercise bikes, accessories, and TV mount solutions; and smart office lift tables, computer lifting platforms, ergonomic and multi-screen computer stands, children's study tables, anti-static sitting health cars, and TV mobile adjustment frames. Its products are used in IT Internet, financial securities, government agencies, education, and training industries. The company was founded in 1998 and is headquartered in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.loctek.com",
        "market_cap": "Small Cap"
    },
    "300743.SZ": {
        "short_name": "HANGZHOU TODAYTEC",
        "long_name": "Hangzhou Todaytec Digital Co., Ltd",
        "summary": "Hangzhou Todaytec Digital Co., Ltd manufactures and sells thermal transfer ribbons in China and internationally. The company offers wax ribbons, wax/resin ribbons, resin ribbons, fax ribbons, hot stamping foils, tattoo stencil papers, and jumbo rolls. Its products are used in inventory label, medical wrist strap, wash care, blood bank, medicare, logistice, engine, jewelry, tag, chemical barrel, ticket/bill, super market, nameplate, outdoor tag, and ID card copy applications. The company was founded in 2002 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.todaytec.com.cn",
        "market_cap": "Micro Cap"
    },
    "600800.SS": {
        "short_name": "TIAN JIN BOHAI CHEMICAL CO LTD",
        "long_name": "Tian Jin Bohai Chemical Co.,Ltd.",
        "summary": "Tian Jin Bohai Chemical Co.,Ltd., together with its subsidiaries, operates as a card manufacturer in China. The company is involved in relative implement and application system, securities printing, and packing production activities. It offers bank, telecom, social, integrate circuit (IC), contact IC, and contactless IC cards. The company also provides SMT; financial equipment; IC card bus toll collectors; IC card taximeters; online type writing information and charging money machines; contactless hand holding POS toll collectors; offline information writing and money charging machines; parking lot IC blocking equipment and toll collectors; IC card toll collectors of park tickets; smart IC card toll collectors of small amount; key machines for infrared data gathering; data reclaiming multiplexers; smart ticket boxes; and machines with roll memory. In addition, it offers electronic tax controlling and money collecting machines; outside hanging mode Chinese tax controlling machines; financial tax control gathering machines; and city all-purpose card systems, system solutions, and social security management systems. The company's cards are used in finance, insurance, medicine, transportation, and communication industries. It also exports its cards to approximately 40 countries and regions, including Japan, Hong Kong, Sri Lanka, Indian, Pakistan, Vietnam, Singapore, Malaysia, Indonesia, Turkey, the United Arab Emirates, Lebanon, Israel, Russia, Finland, the Netherlands, Ireland, Switzerland, Bulgaria, the United States, Canada, Mexico, Uruguay, Australia, New Zealand, Nigeria, Panama, South Africa, Iran, Ukraine, Armenia, and Denmark. The company was formerly known as Tianjin Global Magnetic Card Co., Ltd. and changed its name to Tian Jin Bohai Chemical Co.,Ltd. in February 2021. Tian Jin Bohai Chemical Co.,Ltd. is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300202",
        "website": "http://www.gmcc.com.cn",
        "market_cap": "Small Cap"
    },
    "603106.SS": {
        "short_name": "CASHWAY FINTECH CO LTD",
        "long_name": "Cashway Fintech Co.,Ltd.",
        "summary": "Cashway Fintech Co.,Ltd. provides financial electronic products and solutions worldwide. The company engages in the research and development, manufacture, marketing, operation, and monitoring of banking self-service equipment. It offers ATM, CRS, kiosk, and self-service machines; ATMC, ATMP, and ATMV software solutions; and equipment maintenance and outsource services. The company was founded in 2004 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300308",
        "website": "http://www.cashwaytech.com",
        "market_cap": "Small Cap"
    },
    "603187.SS": {
        "short_name": "QINGDAO HIRON COMMERCIAL COLD C",
        "long_name": "Qingdao Hiron Commercial Cold Chain Co., Ltd.",
        "summary": "Qingdao Hiron Commercial Cold Chain Co., Ltd. engages in the research and development, production, sale, and service of commercial cold chain equipment. Its products include commercial freezing display cabinets, commercial refrigerating display cabinets, supermarket display cabinets, commercial intelligent display cabinets, other cold chain equipment, as well as optional accessories. The company also provides customized solutions and professional services for customers to store products. It supplies products for cold drinks, cold food, beer, beverage, dairy, supermarket chain, convenience store, and other industries. The company was founded in 2006 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266400",
        "website": "http://www.chinahiron.com",
        "market_cap": "Small Cap"
    },
    "603899.SS": {
        "short_name": "SHANGHAI MG STATIONERY INC",
        "long_name": "Shanghai M&G Stationery Inc.",
        "summary": "Shanghai M&G Stationery Inc. engages in the research, development, manufacture, and supply of stationary products in China and internationally. It offers painting, handcraft, and puzzle products. The company also provides markers, washable graffiti and oil painting sticks, and magic series and washable thin watercolor pens; MGR colored pencils, solid water colors, artist grade oil sticks, wrong books, multifunctional stationary boxes, multicolor press ballpoint pens, cute correction tapes, hot erasable gel pens, and neutral color pens; ultra-fine spine gel pens, loose- leaf books, high- density gel pens, full needle gel pens, quick-drying pigment gel pens, and hollow sheath gel pens for students, young white-collar workers, and stationery enthusiasts; and office supplies, office equipment, IT digital products, office furniture, personal protective equipment, labor insurance supplies, food and beverages, business gifts, etc., as well as little brush and 30 degree reverse gel pens, calculators, buffer gel pens, chenguang you grips, steel rulers, meeting record books, and sketch papers for study and work solutions. It also operates retail stores; an online platform of M&G Technologies. Shanghai M&G Stationery Inc. sells its products under the M&G brand. The company was founded in 1997 and is based in Shanghai, China. Shanghai M&G Stationery Inc. is a subsidiary of M&G Holdings (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201406",
        "website": "http://www.mg-pen.com",
        "market_cap": "Large Cap"
    },
    "CZ4.SI": {
        "short_name": "Dutech",
        "long_name": "Dutech Holdings Limited",
        "summary": "Dutech Holdings Limited, an investment holding company, manufactures and sells high security products in the People's Republic of China, North and South America, Europe, the Asia Pacific, and Africa. It operates through two segments, High Security and Business Solutions segments. The company designs and manufactures automated teller machine safes, banking safes, cash handling systems, fire-resistant commercial safes, safes for storage of weapons, and other security products. It is also involved in designing, engineering, manufacturing, and assembling electro-mechanical equipment, ticketing and vending machines, gaming and lottery, parking machines, and modules; and precision engineering parts, semi-conductor instruments, and other modules products. In addition, the company engages in the sale and after sales service of security products and intelligent terminals, machinery parts, and auto parts; general wholesale of semi-conductor instruments and parts, and precision machining parts; property investment business; warehousing and logistics; online sales platform; and provision of management services. Further, it engages in the research and development, sale, and service of parking, smart terminals, and electronics. The company was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.dutechholdings.com",
        "market_cap": "Micro Cap"
    }
}