{
    "000009.SZ": {
        "short_name": "CHINA BAOAN GROUP",
        "long_name": "China Baoan Group Co., Ltd.",
        "summary": "China Baoan Group Co., Ltd., an investment holding company, engages in the research, development, manufacture, and sale of cathode and anode materials for lithium battery manufacturers worldwide. It also researches on drive systems for new energy vehicles sand automotive assembly plants; manufactures and sells precision metal parts that are used in hard disk drives, hydraulic equipment, and auto parts, as well as parts for other purposes; researches and develops new graphite materials; and develops and manufactures military drilling simulators. In addition, the company offers power-charging connectors for new-energy vehicles; AC/DC power charging connector products for electric vehicles; and ear-nose-throat and respiratory system products. Further, it plants lian tree; researches and development, manufactures, and sells neem products; develops and manages real estate projects; and invests in venture capital, financial, and industrial investment projects. Additionally, the company engages in the wholesale and retail of pharmaceutical products; operation of a chain of hospitals; and provision of hemorrhoid products. The company was founded in 1983 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518020",
        "website": "http://www.chinabaoan.com",
        "full_time_employees": 13345
    },
    "000046.SZ": {
        "short_name": "OCEANWIDE HOLDINGS",
        "long_name": "Oceanwide Holdings Co., Ltd.",
        "summary": "Oceanwide Holdings Co., Ltd. invests in, develops, constructs, manages, and sells real estate properties in China and internationally. The company provides financial services in the areas of securities, trust, insurance, futures, asset management, and Internet finance, as well as in real estate. The company was formerly known as Fan Hai Construction Group Company Limited and changed its name to Oceanwide Holdings Co., Ltd. in April 2014. Oceanwide Holdings Co., Ltd. was founded in 1989 and is based in Beijing, China. Oceanwide Holdings Co., Ltd. is a subsidiary of China Oceanwide Holdings Group Company Limited.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100005",
        "website": "http://www.fhkg.com",
        "full_time_employees": null
    },
    "000551.SZ": {
        "short_name": "CREATE TECH & SCIE",
        "long_name": "Create Technology & Science Co.,Ltd.",
        "summary": "Create Technology & Science Co.,Ltd., an investment holding company, primarily researches, develops, produces, and sells high voltage insulators, and clean environmental protection equipment and engineering products in China and internationally. It offers purification equipment, power transmission and transformation high voltage porcelain insulators, precision bearings, surveying and mapping instruments, and abrasives. The company was founded in 1993 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215021",
        "website": "http://www.000551.cn",
        "full_time_employees": 2658
    },
    "000571.SZ": {
        "short_name": "SUNDIRO HOLDING CO",
        "long_name": "Sundiro Holding Co., Ltd.",
        "summary": "Sundiro Holding Co., Ltd. operates in the coal industry in China. The company is involved in coal mining; and manufacturing and sale of raw and lump coal products, as well as long flame coal for power generation, boiler, chemical, and civil uses. It also produces and sells motorcycles and export vehicles, as well as regular models, scooters, cub-type models, and electric bicycles. In addition, the company offers standard, basic, and advanced electric vehicles; coal chemical products; and proprietary, international freight forwarder, and cold-chain logistic services, as well as contract logistics services, including designing, packaging, VMI, transportation, and distribution services in various areas, such as vehicle parts, industrial cabinets, and electromechanical and electrical appliances. Further, it manufactures aircraft parts and yachts; and engages in the real estate project planning, investment, operating consultancy, and agency business, as well as provides tourism services. The company was founded in 1988 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201103",
        "website": "http://www.sundiro.com",
        "full_time_employees": null
    },
    "000576.SZ": {
        "short_name": "GUANGDONG GANHUA S",
        "long_name": "Guangdong Ganhua Science and Industry Co., Ltd.",
        "summary": "Guangdong Ganhua Science and Industry Co., Ltd., together with its subsidiaries, primarily engages in the trading of sugar in China. It is involved in the research and development, production, and sale of yeast products. The company offers yeast powder, yeast extract, edible yeast, saccharification enzymes, amylase, bio-pharmaceuticals, and yeast nutritional food products; and paper products. Its products are used in food, health care products, cosmetics, feed, chemicals, and other fields. The company was formerly known as Jiangmen Sugarcane Chemical Factory (Group) Co.,Ltd and changed its name to Guangdong Ganhua Science and Industry Co., Ltd. in November 2020. Guangdong Ganhua Science and Industry Co., Ltd. was founded in 1992 and is based in Jiangmen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jiangmen",
        "zipcode": null,
        "website": "http://www.gdganhua.com",
        "full_time_employees": 278
    },
    "000620.SZ": {
        "short_name": "MACROLINK CULTURAL",
        "long_name": "Macrolink Culturaltainment Development Co., Ltd.",
        "summary": "Macrolink Culturaltainment Development Co., Ltd. develops real estate properties in China, South Korea, Malaysia, Australia and Canada. The company develops residences, business, office buildings, hotels, and urban complexes. It is also involved in the cultural tourism, finance, real estate, commerce, hospitality, construction, property, entertainment, architectural design, landscaping, and other industries. The company was formerly known as Macrolink Real Estate Co., Ltd. and changed its name to Macrolink Culturaltainment Development Co., Ltd. in August 2016. Macrolink Culturaltainment Development Co., Ltd. was founded in 1993 and is based in Beijing, China. Macrolink Culturaltainment Development Co., Ltd. is a subsidiary of Macrolink Holding Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.xhlbdc.com",
        "full_time_employees": null
    },
    "000652.SZ": {
        "short_name": "TIANJIN TEDA CO. L",
        "long_name": "Tianjin Teda Co., Ltd.",
        "summary": "Tianjin TEDA Co., Ltd. engages in the ecological and environmental protection, regional development, energy trade, and equity investment businesses in China. It is involved in the development and utilization of renewable energy, such as municipal solid waste incineration power generation, sanitary landfill, and biomass power generation; and the provision of services for the treatment of domestic waste, as well as utilization of waste heat from incineration of waste to generate electricity. The company also engages in the land consolidation, construction, and development of residential, commercial complex, and security housing and other projects. In addition, it trades in refined oil; petrochemical products, such as gasoline, diesel, fuel oil, aromatic hydrocarbons, naphtha, and lubricants; and non-ferrous metals, including aluminum ingots, zinc ingots, electrolysis commodities, and copper, as well as manages the storage and services of non-ferrous metals and petroleum and petrochemical products. Further, the company is involved in equity investments. Tianjin Teda Co., Ltd. is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300457",
        "website": "http://www.tedastock.com",
        "full_time_employees": 1564
    },
    "000677.SZ": {
        "short_name": "CHTC HELON CO LTD",
        "long_name": "CHTC Helon Co., Ltd.",
        "summary": "CHTC Helon Co., Ltd. produces and sells viscose fiber products in China, Southeast Asia, Europe, the Middle East, South America, and internationally. The company offers phase change viscose fibers; Chinese health regenerated cellulose fibers; no dyed fibers; new modal fibers under the Newdal name; Ace Ventura Lun, a protein fiber wool; purcell hemp fiber under the Jutecell name; and An Fu tournament fiber under the Anti-fcell name. It also provides TCF, hollow, alginate, and health fibers. The company was formerly known as Shandong Helon Co., Ltd and changed its name to CHTC Helon Co., Ltd. in September 2013. The company is based in Weifang, China. CHTC Helon Co., Ltd. is a subsidiary of Hengtian Fiber Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Weifang",
        "zipcode": "261100",
        "website": "http://www.helon.cn",
        "full_time_employees": 931
    },
    "000691.SZ": {
        "short_name": "HAINAN YATAI INDUS",
        "long_name": "Hainan Yatai Industrial Development Co., Ltd.",
        "summary": "Hainan Yatai Industrial Development Co., Ltd. develops and sells real estate properties. It markets its houses in Yongdeng County, Lanzhou City through online sales channels. The company was formerly known as Hainan United Oils & Technologies Development Co., Ltd. and changed its name to Hainan Yatai Industrial Development Co., Ltd. in February 2010. The company was founded in 1996 and is based in Lanzhou, China. As of March 31, 2009, Hainan Yatai Industrial Development Co., Ltd. operates as a subsidiary of Lanzhou Yatai Industry and Trade Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lanzhou",
        "zipcode": "730000",
        "website": "http://www.ytsy000691.com",
        "full_time_employees": null
    },
    "000720.SZ": {
        "short_name": "SHANDONG XINNENG T",
        "long_name": "Shandong Xinneng Taishan Power Generation Co.,Ltd.",
        "summary": "Shandong Xinneng Taishan Power Generation Co.,Ltd. engages in the generation of electricity in China. The company is based in Tai'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tai'an",
        "zipcode": "271000",
        "website": "http://www.sz000720.com",
        "full_time_employees": 884
    },
    "000860.SZ": {
        "short_name": "BEIJING SHUNXIN AG",
        "long_name": "Beijing Shunxin Agriculture Co.,Ltd",
        "summary": "Beijing Shunxin Agriculture Co.,Ltd primarily engages in the brewing and sale of liquor products under the Niulan Mountain and Ningcheng brands. It is also involved in breeding pigs and hogs under the Xiaodian brand; slaughtering and processing meat products; and real estate development. In addition, it offers fresh and cooked food products under the Pengcheng brand. Beijing Shunxin Agriculture Co.,Ltd was founded in 1998 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101300",
        "website": "http://www.000860.com",
        "full_time_employees": 4842
    },
    "000881.SZ": {
        "short_name": "CGN NUCLEAR TECHNO",
        "long_name": "CGN Nuclear Technology Development Co., Ltd.",
        "summary": "CGN Nuclear Technology Development Co., Ltd. engages in the research, development, manufacture, and sale of modified cable polymer materials, engineering plastic products, and electron accelerators in China. Its products are used in nuclear power, new energy, rail transit, aerospace, automobile, construction, optical communication, and electronics industries, as well as offshore equipment. The company also exports its products. In addition, it offers irradiation processing services; and engages in ocean shipping, property, project contracting, pelagic fishery, and international trading businesses. The company was formerly known as China Dalian International Cooperation (Group) Holdings Ltd. and changed its name to CGN Nuclear Technology Development Co., Ltd. in February 2017. CGN Nuclear Technology Development Co., Ltd. was founded in 1993 and is based in Shenzhen, China. CGN Nuclear Technology Development Co., Ltd. operates as a subsidiary of CGN (Beijing) Nuclear Technology Application Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518000",
        "website": "http://www.cgnnt.com.cn",
        "full_time_employees": null
    },
    "000906.SZ": {
        "short_name": "ZHESHANG DEVELOPME",
        "long_name": "Zheshang Development Group Co.,Ltd",
        "summary": "Zheshang Development Group Co., Ltd. engages in the commodity, financial leasing, online retailing, car sale and after service, logistics service, and energy technology businesses in China and internationally. It trades in screw-thread steel products, wire stocks, round steel products, hot rolled strips and coils, cold rolled products, I-beams, angle and groove bars, and steel feed and iron ore products; and provides value-added services, including wholesale and retail distribution, custom processing, warehouse delivery, financial services, e-commerce, etc., as well as upstream and downstream supply chain services. The company also offers finance leasing, commercial factoring, and industrial bond and supply chain financing services; and industry management software products and services, customized development services for information management software products, software-as-a-service, and information technology management consulting services. In addition, it provides supply chain integrated service, CRM, power sales management, financial leasing, car free carrier, unified enterprise mobile interconnected, enterprise integration, centralized purchasing management, logistics warehouse management, and cross-border e-commerce platforms, as well as commercial platform for commodities and data analysis platform for steel trade industry. Further, the company sells and services cars and commercial vehicles of various brands through its 4S shops; and operates a used car dealer shop. Additionally, it is involved in the sale of electricity and taxi business. The company operates approximately 20 standard 4S shops. The company was formerly known as Zhejiang Materials Development Co., Ltd. and changed its name to Zheshang Development Group Co., Ltd. in January 2017. Zheshang Development Group Co., Ltd. was founded in 1999 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310014",
        "website": "http://www.zmd.com.cn",
        "full_time_employees": null
    },
    "002102.SZ": {
        "short_name": "GUANFU HOLDINGS CO",
        "long_name": "Guanfu Holding Co., Ltd.",
        "summary": "Guanfu Holding Co., Ltd. provides plastic raw material procurement services through e-commerce platform in China. The company also engages in the research and development, production, and sale of pharmaceutical raw materials and animal nutrition. In addition, the company is involved in the real estate leasing and gold mining activities. It serves 80,000 users. The company was formerly known as Fujian Guanfu Modern Household Wares Co., Ltd. and changed its name to Guanfu Holding Co., Ltd. in August 2016. Guanfu Holding Co., Ltd. was founded in 1989 and is based in Quanzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Quanzhou",
        "zipcode": "362500",
        "website": "http://www.guanfu.com",
        "full_time_employees": 949
    },
    "0656.HK": {
        "short_name": "FOSUN INTL",
        "long_name": "Fosun International Limited",
        "summary": "Fosun International Limited operates in health, happiness, wealth, and intelligent manufacturing sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Asset Management, and Intelligent Manufacturing. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Asset Management segment engages in the asset management and market investments activities. The Intelligent Manufacturing segment operates and invests in the intelligent manufacturing business; and produces iron, steel, and ore. It is also involved in the capital investment and management, property development, retail, reinsurance, and beer production and distribution businesses; manufacture and sale of iron and steel products; mining and ore processing activities; and provision of banking and financial, and medical consultation services, as well as digital solutions. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.fosun.com",
        "full_time_employees": 76000
    },
    "300099.SZ": {
        "short_name": "UROICA PRECISION I",
        "long_name": "Uroica Precision Information Engineering Co.,Ltd",
        "summary": "Uroica Precision Information Engineering Co., Ltd. researches and develops, produces, and sells critical equipment for mine safety monitoring and production in China and internationally. Its products include ceremony roof monitors, mechatronic products, polymer grouting materials, and geophysical drilling technology output products. The company was formerly known as Uroica Mining Safety Engineering Co.,Ltd and changed its name to Uroica Precision Information Engineering Co., Ltd. in March 2017. Uroica Precision Information Engineering Co., Ltd. is based in Tai'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tai'an",
        "zipcode": "271000",
        "website": "http://www.uroica.com.cn",
        "full_time_employees": null
    },
    "600207.SS": {
        "short_name": "HENAN ANCAI HI-TECH CO",
        "long_name": "Henan Ancai Hi-Tech Co.,Ltd",
        "summary": "Henan Ancai Hi-Tech Co.,Ltd primarily produces and sells glass products in China. It offers solar photovoltaic ultra-white rolled, float, TCO, and energy-saving glasses; liquefied and compressed natural gas; and other products. The company is based in Anyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Anyang",
        "zipcode": null,
        "website": "http://www.acht.com.cn",
        "full_time_employees": 2158
    },
    "600250.SS": {
        "short_name": "NANJING TEXTILES IMPORT & EXPOR",
        "long_name": "Nanjing Textiles Import & Export Corp., Ltd.",
        "summary": "Nanjing Textiles Import & Export Corp., Ltd. engages in the import and export of textiles and garments in China and internationally. It also produces pharmaceuticals; develops and produces discharge lamps comprising HPSL, metal halide lamps, and high pressure mercury lamps; and operates an exhibition center. In addition, the company develops real estate properties; and produces slipcovers, mattress covers, curtains, back cushions, and beddings. Nanjing Textiles Import & Export Corp., Ltd. was founded in 1978 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.nantex.com.cn",
        "full_time_employees": 559
    },
    "600321.SS": {
        "short_name": "RIGHTWAY HOLDINGS CO LTD",
        "long_name": "Rightway Holdings Co.,ltd.",
        "summary": "Rightway Holdings Co.,ltd. manufactures and sells fiberboards in China and internationally. It operates through Financial Investment, Trade Logistics, Sheet Wood, Development and Construction, and Hotel Operations segments. The company also engages in equity investment, and mergers and acquisitions activities; trading grains, chemicals, and board woods; import and export agency business; international freight forwarding business; and manufacturing sheet metal products. In addition, it is involved in general contracting, curtain wall engineering, municipal public works, highway subgrade engineering, highway pavement engineering, steel structure engineering, construction decoration, and decoration engineering activities. Further, it operates a hotel that comprises of 388 rooms. The company was founded in 1982 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": null,
        "website": "http://www.rightwayholdings.com",
        "full_time_employees": 554
    },
    "600500.SS": {
        "short_name": "SINOCHEM INTERNATIONAL CO",
        "long_name": "Sinochem International Corporation",
        "summary": "Sinochem International Corporation engages in the intermediates and new materials, agrochemicals, polymer additives, and natural rubber businesses worldwide. It offers new materials, including waterborne acrylic emulsions, waterborne polyurethane dispersions, solventborne solution polyurethanes, cross linkers, cyclic rubbers, epoxy resins, organosilicones, chain extenders, sterilization fungicides, and fire retardants; and herbicides, fungicides, insecticides, and plant growth regulators. The company also provides rubber chemicals, such as antioxidant PPD, intermediate RT bases, insoluble sulfur, high-purity TMQ, and accelerators; and natural rubber. In addition, it engages in the chemical trade and distribution businesses, such as automotive materials, polycarbonate, polystyrene, dyed pigment, ABS resin, polyurethane, forest grease, iron ore, and coke. The company was founded in 1998 and is based in Shanghai, the People's Republic of China. Sinochem International Corporation is a subsidiary of Sinochem Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200125",
        "website": "http://www.sinochemintl.com",
        "full_time_employees": 26979
    },
    "600624.SS": {
        "short_name": "SHANGHAI FUDAN FORWARD SCIENCE ",
        "long_name": "Shanghai Fudan Forward S&T Co., Ltd",
        "summary": "Shanghai Fudan Forward S&T Co., Ltd operates in software development, bio-medicine, real estate, and other businesses. It develops and exports software to Japan; and researches, develops, produces, and sells Chinese medicines, chemical medicines, and genetic engineering drugs, as well as geriatric medicines, cardio-cerebral vascular drugs, anti-tumor drugs, and other products. It is also involved in the development of high-tech parks; and development, production, and sale of uninterruptible power supply and VRLA battery products, as well as professional agent of car audio brand. In addition, the company provides investment consulting, market research, venture capital investment, private equity investment consulting, and marketing solutions. Shanghai Fudan Forward S&T Co., Ltd was founded in 1984 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200433",
        "website": "http://www.forwardgroup.com",
        "full_time_employees": 1508
    },
    "600701.SS": {
        "short_name": "HARBIN GONG DA HIGH-TECH ENTERP",
        "long_name": "Harbin Gong Da High-Tech Enterprise Development Co.,Ltd.",
        "summary": "Harbin Gong Da High-Tech Enterprise Development Co., Ltd engages in the industrial manufacturing business primarily in Northeast and North China. It is involved in the processing of agricultural products and dairy products, as well as provides commerce and information services. The company's products include soybean deep processing and milk products. It also provides leasing, catering, and other services. The company is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150006",
        "website": null,
        "full_time_employees": 690
    },
    "600704.SS": {
        "short_name": "WUCHAN ZHONGDA GROUP CO.LTD",
        "long_name": "Wuchan Zhongda Group Co.,Ltd.",
        "summary": "Wuchan Zhongda Group Co.,Ltd., together with its subsidiaries, provides bulk commodity supply chain services in China and internationally. Its principal products include steel-based metal materials, coal-based energy products, and chemical products. The company also offers building materials, mechanical and electrical equipment, light industrial products, raw materials, textiles, timber products, and fertilizers. In addition, it provides industrial investment, investment management, asset management, real estate, futures brokerage, and market management services; and information consulting services. Further, the company engages in the sale, maintenance, and lease of automobiles. Wuchan Zhongda Group Co.,Ltd. was founded in 1992 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310006",
        "website": null,
        "full_time_employees": 18549
    },
    "600777.SS": {
        "short_name": "SHANDONG XINCHAO ENERGY CORPORA",
        "long_name": "Shandong Xinchao Energy Corporation Limited",
        "summary": "Shandong Xinchao Energy Corporation Limited engages in the exploration, production, and sale of oil and natural gas. The company was formerly known as Yantai Xinchao Industry Co., Ltd. and changed its name to Shandong Xinchao Energy Corporation Limited in June 2016. Shandong Xinchao Energy Corporation Limited was founded in 1985 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": null,
        "website": "http://www.xinchaoshiye.com",
        "full_time_employees": 238
    },
    "600805.SS": {
        "short_name": "JIANGSU YUEDA INVESTMENT CO",
        "long_name": "Jiangsu Yueda Investment Co., Ltd.",
        "summary": "Jiangsu Yueda Investment Co., Ltd., together with its subsidiaries, engages in automobile, textile, tractor, biodiesel, tollway, power energy, financial insurance investment, and new material businesses in China and internationally. The company manufactures cars; provides home, clothing, and industrial textiles; develops, produces, and sells tractors, and agricultural machinery and accessories; and provides artificial graphite thermal film, graphene and its composite products, thermal grease, conductive inks, etc. It also researches, develops, and sells new energy, new materials, green biomass, and oil-related products; operates tollways and power plants; and engages in coal mining activities. Jiangsu Yueda Investment Co., Ltd. is based in Yancheng, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yancheng",
        "zipcode": null,
        "website": "http://www.yuedainvest.com",
        "full_time_employees": 4320
    },
    "600851.SS": {
        "short_name": "SHANGHAI HAIXIN GROUP",
        "long_name": "Shanghai Haixin Group Co., Ltd.",
        "summary": "Shanghai Haixin Group Co., Ltd. engages in the medicine, textile and clothing, and finance businesses. It is also involved in the industrial park business. The company was founded in 1986 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201619",
        "website": "http://www.haixin.com.cn",
        "full_time_employees": 1121
    },
    "600881.SS": {
        "short_name": "JILIN YATAI GROUP",
        "long_name": "Jilin Yatai (Group) Co., Ltd.",
        "summary": "Jilin Yatai (Group) Co., Ltd. operates in building materials, real estate, pharmaceutical, finance, coal, and trade and business industries in China. The company mines for limestone and gravel aggregates; and processes, produces, and sells clinker, cement, premixed concrete, and other building materials. It also produces pharmaceutical health products and medicines, and medical equipment; and provides primary land consolidation, housing development, building construction, decoration, environmental engineering, property management, and heating services. In addition, the company offers financial investment services; provides banking services through 392 branches in Jilin province; and operates shopping malls, department stores, and hotels. Further, it engages in exploitation, production, and sale of coal. Jilin Yatai (Group) Co., Ltd. was founded in 1986 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.yatai.com",
        "full_time_employees": 18866
    },
    "8227.HK": {
        "short_name": "HAITIAN ANTENNA",
        "long_name": "Xi'an Haitian Antenna Technologies Co., Ltd.",
        "summary": "Xi'an Haitian Antenna Technologies Co., Ltd., together with its subsidiaries, researches and develops, manufactures, installs, and sells mobile communication antennas and related products in the People's Republic of China and other Asian countries. The company offers underwater and underground surveillance, imaging, mechanical equipment, and other related products; complicated environment warning and surveillance equipment; and agricultural and forestry used unmanned aerial vehicles, as well as consultancy services. It also trades in construction related products; and poultry and agricultural products. The company was formerly known as Xi'an Haitiantian Holdings Co., Ltd. and changed its name to Xi'an Haitian Antenna Technologies Co., Ltd. in August 2019. Xi'an Haitian Antenna Technologies Co., Ltd. was founded in 1999 and is headquartered in Xi'an, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": null,
        "website": "http://www.xaht.com",
        "full_time_employees": 82
    },
    "900917.SS": {
        "short_name": "SHANGHAI HAIXIN GROUP",
        "long_name": "Shanghai Haixin Group Co., Ltd.",
        "summary": "Shanghai Haixin Group Co., Ltd. engages in the medicine, textile and clothing, and finance businesses. It is also involved in the industrial park business. The company was founded in 1986 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201619",
        "website": "http://www.haixin.com.cn",
        "full_time_employees": 1121
    },
    "CBGH": {
        "short_name": "CHINA YIBAI UNITED GUARANTE INT",
        "long_name": "China YiBai United Guarantee International Holding, Inc.",
        "summary": "China YiBai United Guarantee International Holding, Inc., a development stage company, provides financial services to small and medium enterprises in China. It provides equity pledge guarantee, and energy-saving and emission-reduction related financial projects. The company also provides financial consultancy services in the areas of accounting, mergers and acquisitions, business planning, and domestic and international financing. In addition, its services cover investment banking, fund management, and security services. China YiBai United Guarantee International Holding, Inc. is based in Dalian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116023",
        "website": null,
        "full_time_employees": 35
    },
    "FNI.F": {
        "short_name": "FOSUN INTL LTD",
        "long_name": "Fosun International Limited",
        "summary": "Fosun International Limited operates in health, happiness, wealth, and intelligent manufacturing sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Asset Management, and Intelligent Manufacturing. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Asset Management segment engages in the asset management and market investments activities. The Intelligent Manufacturing segment operates and invests in the intelligent manufacturing business; and produces iron, steel, and ore. It is also involved in the capital investment and management, property development, retail, reinsurance, and beer production and distribution businesses; manufacture and sale of iron and steel products; mining and ore processing activities; and provision of banking and financial, and medical consultation services, as well as digital solutions. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.fosun.com",
        "full_time_employees": 76000
    },
    "FNI1.F": {
        "short_name": "FOSUN INTL LTD UNSP.ADR25",
        "long_name": "Fosun International Limited",
        "summary": "Fosun International Limited operates in health, happiness, wealth, and intelligent manufacturing sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Asset Management, and Intelligent Manufacturing. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Asset Management segment engages in the asset management and market investments activities. The Intelligent Manufacturing segment operates and invests in the intelligent manufacturing business; and produces iron, steel, and ore. It is also involved in the capital investment and management, property development, retail, reinsurance, and beer production and distribution businesses; manufacture and sale of iron and steel products; mining and ore processing activities; and provision of banking and financial, and medical consultation services, as well as digital solutions. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.fosun.com",
        "full_time_employees": 76000
    },
    "FOSUF": {
        "short_name": "FOSUN INTERNATIONAL",
        "long_name": "Fosun International Limited",
        "summary": "Fosun International Limited operates in health, happiness, wealth, and intelligent manufacturing sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Asset Management, and Intelligent Manufacturing. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Asset Management segment engages in the asset management and market investments activities. The Intelligent Manufacturing segment operates and invests in the intelligent manufacturing business; and produces iron, steel, and ore. It is also involved in the capital investment and management, property development, retail, reinsurance, and beer production and distribution businesses; manufacture and sale of iron and steel products; mining and ore processing activities; and provision of banking and financial, and medical consultation services, as well as digital solutions. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.fosun.com",
        "full_time_employees": 76000
    },
    "FOSUY": {
        "short_name": "FOSUN INTERNATIONAL",
        "long_name": "Fosun International Limited",
        "summary": "Fosun International Limited operates in health, happiness, wealth, and intelligent manufacturing sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Asset Management, and Intelligent Manufacturing. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Asset Management segment engages in the asset management and market investments activities. The Intelligent Manufacturing segment operates and invests in the intelligent manufacturing business; and produces iron, steel, and ore. It is also involved in the capital investment and management, property development, retail, reinsurance, and beer production and distribution businesses; manufacture and sale of iron and steel products; mining and ore processing activities; and provision of banking and financial, and medical consultation services, as well as digital solutions. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200010",
        "website": "http://www.fosun.com",
        "full_time_employees": 76000
    },
    "GLBD": {
        "short_name": "GLOBAL SEED CORP",
        "long_name": "Global Seed Corporation",
        "summary": "Global Seed Corporation provides coffee and healthy beverage products under the Ka Su Le brand name in China. The company engages in the wholesale, retail, and online sale of coffee and beverage items comprising capsules of coffee and non-coffee drinks through its Brand Stores; coffee brewing machines for domestic and commercial use; and various health supplements and skin care products. As of October 8, 2020, it operated seven stores in Guangdong Province, Jilin Province, and Chongqing City. Global Seed Corporation is headquartered in Dongguan, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523845",
        "website": null,
        "full_time_employees": 45
    }
}