{"000009.SZ": {"short_name": "CHINA BAOAN GROUP", "long_name": "China Baoan Group Co., Ltd.", "summary": "China Baoan Group Co., Ltd., an investment holding company, engages in the research, development, manufacture, and sale of cathode and anode materials for lithium battery manufacturers worldwide. It also researches on drive systems for new energy vehicles sand automotive assembly plants; manufactures and sells precision metal parts that are used in hard disk drives, hydraulic equipment, and auto parts, as well as parts for other purposes; researches and develops new graphite materials; and develops and manufactures military drilling simulators. In addition, the company offers power-charging connectors for new-energy vehicles; AC/DC power charging connector products for electric vehicles; and ear-nose-throat and respiratory system products. Further, it plants lian tree; researches and development, manufactures, and sells neem products; develops and manages real estate projects; and invests in venture capital, financial, and industrial investment projects. Additionally, the company engages in the wholesale and retail of pharmaceutical products; operation of a chain of hospitals; and provision of hemorrhoid products. The company was founded in 1983 and is based in Shenzhen, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shenzhen"}, "000571.SZ": {"short_name": "SUNDIRO HOLDING CO", "long_name": "Sundiro Holding Co., Ltd.", "summary": "Sundiro Holding Co., Ltd. operates in the coal industry in China. The company is involved in coal mining; and manufacturing and sale of raw and lump coal products, as well as long flame coal for power generation, boiler, chemical, and civil uses. It also produces and sells motorcycles and export vehicles, as well as regular models, scooters, cub-type models, and electric bicycles. In addition, the company offers standard, basic, and advanced electric vehicles; coal chemical products; and proprietary, international freight forwarder, and cold-chain logistic services, as well as contract logistics services, including designing, packaging, VMI, transportation, and distribution services in various areas, such as vehicle parts, industrial cabinets, and electromechanical and electrical appliances. Further, it manufactures aircraft parts and yachts; and engages in the real estate project planning, investment, operating consultancy, and agency business, as well as provides tourism services. The company was founded in 1988 and is headquartered in Shanghai, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Shanghai"}, "000576.SZ": {"short_name": "GUANGDONG GANHUA S", "long_name": "Guangdong Ganhua Science and Industry Co., Ltd.", "summary": "Guangdong Ganhua Science and Industry Co., Ltd., together with its subsidiaries, primarily engages in the trading of sugar in China. It is involved in the research and development, production, and sale of yeast products. The company offers yeast powder, yeast extract, edible yeast, saccharification enzymes, amylase, bio-pharmaceuticals, and yeast nutritional food products; and paper products. Its products are used in food, health care products, cosmetics, feed, chemicals, and other fields. The company was formerly known as Jiangmen Sugarcane Chemical Factory (Group) Co.,Ltd and changed its name to Guangdong Ganhua Science and Industry Co., Ltd. in November 2020. Guangdong Ganhua Science and Industry Co., Ltd. was founded in 1992 and is based in Jiangmen, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Jiangmen"}, "000652.SZ": {"short_name": "TIANJIN TEDA CO. L", "long_name": "Tianjin Teda Co., Ltd.", "summary": "Tianjin TEDA Co., Ltd. engages in the ecological and environmental protection, regional development, energy trade, and equity investment businesses in China. It is involved in the development and utilization of renewable energy, such as municipal solid waste incineration power generation, sanitary landfill, and biomass power generation; and the provision of services for the treatment of domestic waste, as well as utilization of waste heat from incineration of waste to generate electricity. The company also engages in the land consolidation, construction, and development of residential, commercial complex, and security housing and other projects. In addition, it trades in refined oil; petrochemical products, such as gasoline, diesel, fuel oil, aromatic hydrocarbons, naphtha, and lubricants; and non-ferrous metals, including aluminum ingots, zinc ingots, electrolysis commodities, and copper, as well as manages the storage and services of non-ferrous metals and petroleum and petrochemical products. Further, the company is involved in equity investments. Tianjin Teda Co., Ltd. is based in Tianjin, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Tianjin"}, "000677.SZ": {"short_name": "CHTC HELON CO LTD", "long_name": "CHTC Helon Co., Ltd.", "summary": "CHTC Helon Co., Ltd. produces and sells viscose fiber products in China, Southeast Asia, Europe, the Middle East, South America, and internationally. The company offers phase change viscose fibers; Chinese health regenerated cellulose fibers; no dyed fibers; new modal fibers under the Newdal name; Ace Ventura Lun, a protein fiber wool; purcell hemp fiber under the Jutecell name; and An Fu tournament fiber under the Anti-fcell name. It also provides TCF, hollow, alginate, and health fibers. The company was formerly known as Shandong Helon Co., Ltd and changed its name to CHTC Helon Co., Ltd. in September 2013. The company is based in Weifang, China. CHTC Helon Co., Ltd. is a subsidiary of Hengtian Fiber Group Co., Ltd.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Weifang"}, "000691.SZ": {"short_name": "HAINAN YATAI INDUS", "long_name": "Hainan Yatai Industrial Development Co., Ltd.", "summary": "Hainan Yatai Industrial Development Co., Ltd. develops and sells real estate properties. It markets its houses in Yongdeng County, Lanzhou City through online sales channels. The company was formerly known as Hainan United Oils & Technologies Development Co., Ltd. and changed its name to Hainan Yatai Industrial Development Co., Ltd. in February 2010. The company was founded in 1996 and is based in Lanzhou, China. As of March 31, 2009, Hainan Yatai Industrial Development Co., Ltd. operates as a subsidiary of Lanzhou Yatai Industry and Trade Group Co., Ltd.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Lanzhou"}, "000720.SZ": {"short_name": "SHANDONG XINNENG T", "long_name": "Shandong Xinneng Taishan Power Generation Co.,Ltd.", "summary": "Shandong Xinneng Taishan Power Generation Co.,Ltd. engages in the generation of electricity in China. The company is based in Tai'an, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Tai'an"}, "000860.SZ": {"short_name": "BEIJING SHUNXIN AG", "long_name": "Beijing Shunxin Agriculture Co.,Ltd", "summary": "Beijing Shunxin Agriculture Co.,Ltd primarily engages in the brewing and sale of liquor products under the Niulan Mountain and Ningcheng brands. It is also involved in breeding pigs and hogs under the Xiaodian brand; slaughtering and processing meat products; and real estate development. In addition, it offers fresh and cooked food products under the Pengcheng brand. Beijing Shunxin Agriculture Co.,Ltd was founded in 1998 and is based in Beijing, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Beijing"}, "002102.SZ": {"short_name": "GUANFU HOLDINGS CO", "long_name": "Guanfu Holding Co., Ltd.", "summary": "Guanfu Holding Co., Ltd. provides plastic raw material procurement services through e-commerce platform in China. The company also engages in the research and development, production, and sale of pharmaceutical raw materials and animal nutrition. In addition, the company is involved in the real estate leasing and gold mining activities. It serves 80,000 users. The company was formerly known as Fujian Guanfu Modern Household Wares Co., Ltd. and changed its name to Guanfu Holding Co., Ltd. in August 2016. Guanfu Holding Co., Ltd. was founded in 1989 and is based in Quanzhou, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Quanzhou"}, "0656.HK": {"short_name": "FOSUN INTL", "long_name": "Fosun International Limited", "summary": "Fosun International Limited operates in health, happiness, and wealth sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Finance, and Investment. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Finance segment operates and invests in the banking and other financial businesses. The Investment segment invests in primary market and secondary markets, asset management companies, and other companies. The company is also engages in the property development, retail, reinsurance, beer production and distribution businesses; manufacture and sale of iron and steel products; and oil and gas exploration, and mining and ore processing activities. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "HKG", "market": "hk_market", "country": "China", "city": "Shanghai"}, "300099.SZ": {"short_name": "UROICA PRECISION I", "long_name": "Uroica Precision Information Engineering Co.,Ltd", "summary": "Uroica Precision Information Engineering Co., Ltd. researches and develops, produces, and sells critical equipment for mine safety monitoring and production in China and internationally. Its products include ceremony roof monitors, mechatronic products, polymer grouting materials, and geophysical drilling technology output products. The company was formerly known as Uroica Mining Safety Engineering Co.,Ltd and changed its name to Uroica Precision Information Engineering Co., Ltd. in March 2017. Uroica Precision Information Engineering Co., Ltd. is based in Tai'an, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHZ", "market": "cn_market", "country": "China", "city": "Tai'an"}, "600082.SS": {"short_name": "TIANJIN HI-TECH DEVELOPMENT CO.", "long_name": "Tianjin Hi-Tech Development Co.,Ltd.", "summary": "Tianjin Hi-Tech Development Co.,Ltd. invests in and promotes real estate projects in China. Its activities include development and construction of Tianjin high-tech zone, high-tech industry investment, incubation services, trade, etc. The company was founded in 2001 and is headquartered in Tianjin, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Tianjin"}, "600207.SS": {"short_name": "HENAN ANCAI HI-TECH CO", "long_name": "Henan Ancai Hi-Tech Co.,Ltd", "summary": "Henan Ancai Hi-Tech Co.,Ltd primarily produces and sells glass products in China. It offers solar photovoltaic ultra-white rolled, float, TCO, and energy-saving glasses; liquefied and compressed natural gas; and other products. The company is based in Anyang, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Anyang"}, "600250.SS": {"short_name": "NANJING TEXTILES IMPORT & EXPOR", "long_name": "Nanjing Textiles Import & Export Corp., Ltd.", "summary": "Nanjing Textiles Import & Export Corp., Ltd. engages in the import and export of textiles and garments in China and internationally. It also produces pharmaceuticals; develops and produces discharge lamps comprising HPSL, metal halide lamps, and high pressure mercury lamps; and operates an exhibition center. In addition, the company develops real estate properties; and produces slipcovers, mattress covers, curtains, back cushions, and beddings. Nanjing Textiles Import & Export Corp., Ltd. was founded in 1978 and is based in Nanjing, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Nanjing"}, "600321.SS": {"short_name": "RIGHTWAY HOLDINGS CO LTD", "long_name": "Rightway Holdings Co.,ltd.", "summary": "Rightway Holdings Co.,ltd. manufactures and sells fiberboards in China and internationally. It operates through Financial Investment, Trade Logistics, Sheet Wood, Development and Construction, and Hotel Operations segments. The company also engages in equity investment, and mergers and acquisitions activities; trading grains, chemicals, and board woods; import and export agency business; international freight forwarding business; and manufacturing sheet metal products. In addition, it is involved in general contracting, curtain wall engineering, municipal public works, highway subgrade engineering, highway pavement engineering, steel structure engineering, construction decoration, and decoration engineering activities. Further, it operates a hotel that comprises of 388 rooms. The company was founded in 1982 and is based in Chengdu, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Chengdu"}, "600500.SS": {"short_name": "SINOCHEM INTERNATIONAL CO", "long_name": "Sinochem International Corporation", "summary": "Sinochem International Corporation engages in the intermediates and new materials, agrochemicals, polymer additives, and natural rubber businesses worldwide. It offers new materials, including waterborne acrylic emulsions, waterborne polyurethane dispersions, solventborne solution polyurethanes, cross linkers, cyclic rubbers, epoxy resins, organosilicones, chain extenders, sterilization fungicides, and fire retardants; and herbicides, fungicides, insecticides, and plant growth regulators. The company also provides rubber chemicals, such as antioxidant PPD, intermediate RT bases, insoluble sulfur, high-purity TMQ, and accelerators; and natural rubber. In addition, it engages in the chemical trade and distribution businesses, such as automotive materials, polycarbonate, polystyrene, dyed pigment, ABS resin, polyurethane, forest grease, iron ore, and coke. The company was founded in 1998 and is based in Shanghai, the People's Republic of China. Sinochem International Corporation is a subsidiary of Sinochem Corporation.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "600624.SS": {"short_name": "SHANGHAI FUDAN FORWARD SCIENCE ", "long_name": "Shanghai Fudan Forward S&T Co., Ltd", "summary": "Shanghai Fudan Forward S&T Co., Ltd operates in software development, bio-medicine, real estate, and other businesses. It develops and exports software to Japan; and researches, develops, produces, and sells Chinese medicines, chemical medicines, and genetic engineering drugs, as well as geriatric medicines, cardio-cerebral vascular drugs, anti-tumor drugs, and other products. It is also involved in the development of high-tech parks; and development, production, and sale of uninterruptible power supply and VRLA battery products, as well as professional agent of car audio brand. In addition, the company provides investment consulting, market research, venture capital investment, private equity investment consulting, and marketing solutions. Shanghai Fudan Forward S&T Co., Ltd was founded in 1984 and is based in Shanghai, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "600704.SS": {"short_name": "WUCHAN ZHONGDA GROUP CO.LTD", "long_name": "Wuchan Zhongda Group Co.,Ltd.", "summary": "Wuchan Zhongda Group Co.,Ltd., together with its subsidiaries, provides bulk commodity supply chain services in China and internationally. Its principal products include steel-based metal materials, coal-based energy products, and chemical products. The company also offers building materials, mechanical and electrical equipment, light industrial products, raw materials, textiles, timber products, and fertilizers. In addition, it provides industrial investment, investment management, asset management, real estate, futures brokerage, and market management services; and information consulting services. Further, the company engages in the sale, maintenance, and lease of automobiles. Wuchan Zhongda Group Co.,Ltd. was founded in 1992 and is based in Hangzhou, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Hangzhou"}, "600777.SS": {"short_name": "SHANDONG XINCHAO ENERGY CORPORA", "long_name": "Shandong Xinchao Energy Corporation Limited", "summary": "Shandong Xinchao Energy Corporation Limited engages in the exploration, production, and sale of oil and natural gas. The company was formerly known as Yantai Xinchao Industry Co., Ltd. and changed its name to Shandong Xinchao Energy Corporation Limited in June 2016. Shandong Xinchao Energy Corporation Limited was founded in 1985 and is based in Yantai, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Yantai"}, "600805.SS": {"short_name": "JIANGSU YUEDA INVESTMENT CO", "long_name": "Jiangsu Yueda Investment Co., Ltd.", "summary": "Jiangsu Yueda Investment Co., Ltd., together with its subsidiaries, engages in automobile, textile, tractor, biodiesel, tollway, power energy, financial insurance investment, and new material businesses in China and internationally. The company manufactures cars; provides home, clothing, and industrial textiles; develops, produces, and sells tractors, and agricultural machinery and accessories; and provides artificial graphite thermal film, graphene and its composite products, thermal grease, conductive inks, etc. It also researches, develops, and sells new energy, new materials, green biomass, and oil-related products; operates tollways and power plants; and engages in coal mining activities. Jiangsu Yueda Investment Co., Ltd. is based in Yancheng, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Yancheng"}, "600851.SS": {"short_name": "SHANGHAI HAIXIN GROUP", "long_name": "Shanghai Haixin Group Co., Ltd.", "summary": "Shanghai Haixin Group Co., Ltd. engages in the medicine, textile and clothing, and finance businesses. It is also involved in the industrial park business. The company was founded in 1986 and is headquartered in Shanghai, the People's Republic of China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "600881.SS": {"short_name": "JILIN YATAI GROUP", "long_name": "Jilin Yatai (Group) Co., Ltd.", "summary": "Jilin Yatai (Group) Co., Ltd. operates in building materials, real estate, pharmaceutical, finance, coal, and trade and business industries in China. The company mines for limestone and gravel aggregates; and processes, produces, and sells clinker, cement, premixed concrete, and other building materials. It also produces pharmaceutical health products and medicines, and medical equipment; and provides primary land consolidation, housing development, building construction, decoration, environmental engineering, property management, and heating services. In addition, the company offers financial investment services; provides banking services through 392 branches in Jilin province; and operates shopping malls, department stores, and hotels. Further, it engages in exploitation, production, and sale of coal. Jilin Yatai (Group) Co., Ltd. was founded in 1986 and is based in Changchun, China.", "currency": "CNY", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Changchun"}, "900917.SS": {"short_name": "SHANGHAI HAIXIN GROUP", "long_name": "Shanghai Haixin Group Co., Ltd.", "summary": "Shanghai Haixin Group Co., Ltd. engages in the medicine, textile and clothing, and finance businesses. It is also involved in the industrial park business. The company was founded in 1986 and is headquartered in Shanghai, the People's Republic of China.", "currency": "USD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "SHH", "market": "cn_market", "country": "China", "city": "Shanghai"}, "CPF.F": {"short_name": "CITIC LTD.", "long_name": "CITIC Limited", "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.", "currency": "EUR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Beijing"}, "CTPCF": {"short_name": "CITIC LIMITED", "long_name": "CITIC Limited", "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.", "currency": "USD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}, "CTPCY": {"short_name": "CITIC LIMITED", "long_name": "CITIC Limited", "summary": "CITIC Limited operates in the financial services, resources and energy, manufacturing, engineering contracting, and real estate businesses in China and internationally. The company offers banking products and services; investment banking, brokerage, securities trading and lending, and asset management services; financial, wealth management, and trust services; and life, health, and accident insurance, as well as reinsurance products. It also engages in the exploration, development, and production of oil; coal mining; import and export of commodities; aluminum smelting; bauxite mining; alumina refining; manganese mining and processing; development of iron ore mine; production of copper and ferroniobium; and operation of coal-fired power stations. In addition, the company manufactures special steel, bars, plates, steel tubes, forged steel, wires, and casting billets. Further, it provides engineering contracting services for infrastructure, housing, municipal, and industrial facilities, as well as agriculture, energy, and resources sectors; and engineering services in the areas of urban development and ecological preservation projects. Additionally, the company engages in the urban renewal and development projects, including residential properties; ownership and operation of a portfolio of commercial and industrial properties; provision of telecommunication services; investment and management of ports and port terminals; distribution of motor vehicles and related services, food and FMCG products, and healthcare and electrical products; and provision of logistics, commercial aviation, and publication services. The company was formerly known as CITIC Pacific Limited and changed its name to CITIC Limited in August 2014. The company was founded in 1987 and is headquartered in Beijing, China. CITIC Limited is a subsidiary of CITIC Group Corporation.", "currency": "USD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}, "FNI.F": {"short_name": "FOSUN INTL LTD", "long_name": "Fosun International Limited", "summary": "Fosun International Limited operates in health, happiness, and wealth sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Finance, and Investment. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Finance segment operates and invests in the banking and other financial businesses. The Investment segment invests in primary market and secondary markets, asset management companies, and other companies. The company is also engages in the property development, retail, reinsurance, beer production and distribution businesses; manufacture and sale of iron and steel products; and oil and gas exploration, and mining and ore processing activities. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.", "currency": "EUR", "sector": "Industrials", "industry": "Conglomerates", "exchange": "FRA", "market": "dr_market", "country": "China", "city": "Shanghai"}, "FOSUF": {"short_name": "FOSUN INTERNATIONAL", "long_name": "Fosun International Limited", "summary": "Fosun International Limited operates in health, happiness, and wealth sectors in Mainland China, Portugal, and internationally. It operates in five segments: Health, Happiness, Insurance, Finance, and Investment. The Health segment engages in the research, development, manufacture, sale, and trading of pharmaceutical, biopharmaceutical, and health products; and provision of medical and health management services. The Happiness segment operates and invests in tourism and leisure, fashion consumer, and lifestyle industries. The Insurance segment operates in the insurance markets, including life, medical, illness, disability income, health care, and accident insurance. The Finance segment operates and invests in the banking and other financial businesses. The Investment segment invests in primary market and secondary markets, asset management companies, and other companies. The company is also engages in the property development, retail, reinsurance, beer production and distribution businesses; manufacture and sale of iron and steel products; and oil and gas exploration, and mining and ore processing activities. The company was founded in 1992 and is based in Shanghai, China. Fosun International Limited is a subsidiary of Fosun Holdings Limited.", "currency": "USD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Shanghai"}, "GLBD": {"short_name": "GLOBAL SEED CORP", "long_name": "Global Seed Corporation", "summary": "Global Seed Corporation provides coffee and healthy beverage products under the Ka Su Le brand name in China. The company engages in the wholesale, retail, and online sale of coffee and beverage items comprising capsules of coffee and non-coffee drinks through its Brand Stores; coffee brewing machines for domestic and commercial use; and various health supplements and skin care products. As of October 8, 2020, it operated seven stores in Guangdong Province, Jilin Province, and Chongqing City. Global Seed Corporation is headquartered in Dongguan, China.", "currency": "USD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Dongguan"}, "SOUG": {"short_name": "SOU 300 GROUP HLDG CO", "long_name": "Sou 300 Group Holding Company", "summary": "Sou 300 Group Holding Company is based in Beijing, China.", "currency": "USD", "sector": "Industrials", "industry": "Conglomerates", "exchange": "PNK", "market": "us_market", "country": "China", "city": "Beijing"}}