{
    "002967.SZ": {
        "short_name": "GUANGZHOU GRG METR",
        "long_name": "Guang Zhou GRG Metrology & Test Co., Ltd.",
        "summary": "Guang Zhou GRG Metrology & Test Co., Ltd. operates as a third-party metrology and testing company. Its services include metrology and calibration; electromagnetic compatibility testing; chemical analysis; reliability and environmental testing; environmental monitoring; and food detection. The company serves petrochemical, communication, aviation, automotive, electric power, medicine, electrical and electronic devices, shipping, and rail transit industries. It was formerly known as Guangzhou Guangdian Metrology Testing Technology Co., Ltd. and changed its name to Guang Zhou GRG Metrology & Test Co., Ltd. in November 2011. The company was founded in 1964 and is based in Guangzhou City, China. Guang Zhou GRG Metrology & Test Co., Ltd. operates as a subsidiary of Guangzhou Radio Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou City",
        "zipcode": "510656",
        "website": "http://www.grgtest.com",
        "market_cap": 22273931264
    },
    "300012.SZ": {
        "short_name": "CENTRE TESTING GRO",
        "long_name": "Centre Testing International Group Co. Ltd.",
        "summary": "Centre Testing International Group Co. Ltd. provides testing, calibration, inspection, certification, and technical services in China and internationally. It operates through four segments: Life Science, Trade Guarantee, Consumer Goods, and Industrial Test. The company's services include hazardous substances testing, safety detection, EMC testing, environment safety testing, electronics reliability and failure analysis, material reliability and failure analysis, and metal and nonmetallic materials analysis; textile, footwear, and leather testing; toy testing; and automobile materials and component testing services. It also provides food, pharmaceuticals, cosmetics, feed, and food contact materials testing, inspection, and compliance; audit, measurement calibration, and dimension inspection; semiconductor testing; maritime hazardous materials management; freight assessment; certification and training; and application software development and testing services. The company serves various industries, including electrical and electronic products, building materials and engineering, maritime, metrology and calibration and geometry measurement, food and drug, vehicle, inspection and analysis for metal materials and parts, and CTI hardline and toy products, as well as textile, footwear, and leather products. Centre Testing International Group Co. Ltd. was founded in 2003 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.cti-cert.com",
        "market_cap": 53644554240
    },
    "603060.SS": {
        "short_name": "CHINA BUILDING MATERIAL TEST & ",
        "long_name": "China Building Material Test & Certification Group Co., Ltd.",
        "summary": "China Building Material Test & Certification Group Co., Ltd. provides third-party test and certification services in the fields of building materials and construction engineering in China. The company offers inspection, certification, security, and instrument development services, as well as extended services. It serves building material production and circulation enterprises, construction engineering owners and contractors, solar photovoltaic production and application enterprises, carbon emission permits trade organizations, and government authorities, as well as consumers. The company is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100024",
        "website": "http://www.ctc.ac.cn",
        "market_cap": 9641632768
    },
    "AYAG": {
        "short_name": "AMAYA GLOBAL HLDGS CORP",
        "long_name": "AMAYA Global Holdings Corp.",
        "summary": "AMAYA Global Holdings Corp., through its subsidiaries, engages in planting, preserving, packaging, and marketing navel oranges for distribution and sale in the People's Republic of China. The company has planted 1,077,098 orange trees in orchards with approximately 5,152 acres of land in Ganzhou, Jiangxi Province. It sells its products to wholesale, retail, and institutional customers through distributors under the General Red brand. The company was formerly known as General Agriculture Corporation and changed its name to AMAYA Global Holdings Corp. in February 2020. AMAYA Global Holdings Corp. is headquartered in Beijing, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100007",
        "website": "http://www.gelt-cn.com",
        "market_cap": 51185528
    },
    "RGLG": {
        "short_name": "UHF LOGISTICS GROUP INC",
        "long_name": "UHF Logistics Group, Inc.",
        "summary": "UHF Logistics Group, Inc., through its subsidiary, Shenzhen Rui Pu Da Electronic Technology Company Ltd, engages in the development, production, and sale of radio frequency identification (RFID) solutions in the People's Republic of China. The company offers RFID ultrahigh frequency (UHF) hardware, including UHF readers, antennas, and tags. Its RFID products are used in various applications, such as personal and property safety and security management; e-ticketing management; tracking in animal breeding; pharmaceutical product fraud prevention; and warehouse/inventory control. The company was formerly known as Regal Group Inc. and changed its name to UHF Logistics Group, Inc. on January 6, 2011. UHF Logistics Group, Inc. was founded in 2005 and is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518052",
        "website": null,
        "market_cap": 50335
    },
    "SDH": {
        "short_name": "Global Internet of People, Inc.",
        "long_name": "Global Internet of People, Inc.",
        "summary": "Global Internet of People, Inc., a consulting company, provides enterprise services to small and medium-sized enterprises in the People's Republic of China. It operates a peer-to-peer knowledge sharing and enterprise service platform, where knowledge is shared, and services are requested and provided. The company offers its services online; through its Shidonghui App mobile application; and offline through directly operated local offices and 51 local centers operated by its members. The company was founded in 2014 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.sdh365.com",
        "market_cap": 68208000
    },
    "ULNV": {
        "short_name": "PORTER HOLDING INTERNATIONAL IN",
        "long_name": "Porter Holding International, Inc.",
        "summary": "Porter Holding International, Inc. focuses on developing and operating online to offline business platforms. It is developing PT37.com, 17yugo.com, Port City, and payment platforms. The company also provides Internet payment, mobile payment, POS machine receipt, electronic technology development, and Internet marketing services. In addition, it offers investment and corporate management consulting, and training services to its clients. The company was founded in 1994 and is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518004",
        "website": "http://portercity.cn",
        "market_cap": 660542976
    }
}