{
    "000010.SZ": {
        "short_name": "SHENZHEN ECOBEAUTY",
        "long_name": "Shenzhen Ecobeauty Co., Ltd.",
        "summary": "Shenzhen Ecobeauty Co., Ltd. distributes natural gas machines and natural gas in China. It is involved in the storage, transportation and distribution, sale, maintenance, and management of natural gas and liquefied gas; and the manufacture and installation of machines, equipment, and related components. The company was formerly known as Beijing Shenhuaxin Co., Ltd. and changed its name to Shenzhen Ecobeauty Co., Ltd. in May 2016. Shenzhen Ecobeauty Co., Ltd. is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.eco-beauty.cn",
        "market_cap": 3222030080
    },
    "000065.SZ": {
        "short_name": "NORINCO INTL CO",
        "long_name": "Norinco International Cooperation Ltd.",
        "summary": "Norinco International Cooperation Ltd. operates as an engineering contractor in Asia, Africa, Europe, and internationally. It is involved in the construction of various projects, such as railways, roads and bridges, civil construction, municipal facilities, petroleum, power plants, industrial manufacturing, and environmental protection. The company also develops real estate properties, such as residential and commercial projects; and provides architectural decoration services. In addition, it offers services in the field of power engineering, mining facilities, heavy-duty vehicles and equipment, integrated logistics services, solar lighting, etc. Further, it researches, develops, and manufactures packaging containers. The company was founded in 2001 and is based in Beijing, China. Norinco International Cooperation Ltd. is a subsidiary of China North Industries Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100040",
        "website": "http://www.norinco-intl.com",
        "market_cap": 5902371840
    },
    "000090.SZ": {
        "short_name": "SHN TAGEN GROUP",
        "long_name": "Shenzhen Tagen Group Co., Ltd.",
        "summary": "Shenzhen Tagen Group Co., Ltd. primarily engages in the urban construction, comprehensive development, and urban service businesses in China. The company offers construction services in the fields of municipal engineering, construction engineering, rail transit engineering, road maintenance, etc. It also develops real estate projects, including mid-to-high-end residences, affordable housing, office buildings, hotels, urban complexes, industrial parks, etc. In addition, the company undertakes daily maintenance projects of roads, bridges, tunnels, and traffic safety facilities; provides property management and shed reform services. Further, it operates sewage treatment plants and pipe projects; designs and constructs general contracting projects; undertakes space development and utilization projects; builds smart city; and provides engineering services, as well as acts as a construction agent. The company was formerly known as Shenzhen Tonge (Group) Co., Ltd. Shenzhen Tagen Group Co., Ltd. was founded in 1963 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518034",
        "website": "http://www.tagen.cn",
        "market_cap": 10744162304
    },
    "000546.SZ": {
        "short_name": "JINYUAN EP CO LTD",
        "long_name": "Jinyuan EP Co., Ltd.",
        "summary": "Jinyuan EP Co., Ltd. engages in the cement, concrete, and environmental businesses. It offers cement and ready-mixed concrete; and cement kiln co-disposal of hazardous solid waste, as well as rare metals recycling services. The company was formerly known as Jinyuan Cement Co., Ltd. Jinyuan EP Co., Ltd. was founded in 1992 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "130061",
        "website": "http://www.jysn.com",
        "market_cap": 5002507776
    },
    "000755.SZ": {
        "short_name": "SHANXI ROAD & BRID",
        "long_name": "Shanxi Road & Bridge Co.,Ltd.",
        "summary": "Shanxi Road & Bridge Co.,Ltd. manufactures and sells organic chemical products primarily in the People's Republic of China. Its products include VAE and white emulsions; re-dispersible emulsion powders; sodium diacetate; gamma butyrolactone; poly tetra methylene glycol; tetrahydrofuran; 1,4-butanediol; polyvinyl alcohol; and binder, benzene, coke, and maleic anhydride products. The company serves textile, building and construction, wood process, pharmaceutical, food, tannery, paint coats, and agriculture industries. It also exports its products to approximately 100 countries worldwide. The company was formerly known as Shanxi Sanwei Group Co.,Ltd. Shanxi Road & Bridge Co.,Ltd. was founded in 1970 and is headquartered in Linfen, the People's Republic of China. Shanxi Road & Bridge Co.,Ltd. is a subsidiary of Yangquan Coal Industry (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Linfen",
        "zipcode": "041603",
        "website": "http://www.sxsanwei.com",
        "market_cap": 1694046592
    },
    "000928.SZ": {
        "short_name": "SINOSTEEL ENGINEER",
        "long_name": "Sinosteel Engineering & Technology Co., Ltd.",
        "summary": "Sinosteel Engineering & Technology Co., Ltd., through its subsidiary, Sinosteel Equipment & Engineering Co., Ltd., focuses on the industrial engineering and service, municipal engineering and investment, energy saving and environment protection, and high-tech businesses. The company is involved in the development, processing, and utilization of ferrous, nonferrous, and nonmetallic mining resources; and construction and operation of coal-fired, gas-fired, hydropower, wind power solar power, waste incineration, biomass, power grid projects. It also produces clean energy, and reduces environmental pollution in coal chemical industry; and offers metallurgical equipment and spare parts, as well as undertakes projects for steel producers. In addition, the company is involved in the public infrastructure and environmental protection facility projects, including road, bridge, municipal sewage, and solid waste treatment; urban rail transit; and carbon trading and management activities. Further, it engages in the 3D printing, integrating manufacturing, equipment research and development, and technical, as well as metal parts restore and remanufacturing, and industrial intelligent system activities. The company was formerly known as Sinosteel Jilin Carbon Co., Ltd. and changed its name to Sinosteel Engineering & Technology Co., Ltd. in September 2014. The company was founded in 1952 and is based in Beijing, China. Sinosteel Engineering & Technology Co., Ltd. operates as a subsidiary of Sinosteel Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://mecc.sinosteel.com",
        "market_cap": 12453499904
    },
    "002047.SZ": {
        "short_name": "SHENZHEN BAUING CO",
        "long_name": "Shenzhen Bauing Construction Holding Group Co., Ltd.",
        "summary": "Shenzhen Bauing Construction Holding Group Co., Ltd. engages in the construction and integrated building decoration engineering businesses in China. The company undertakes decoration engineering, curtain wall and steel structure engineering, integrated intelligent engineering, fire protection engineering in building design, mechanical and electrical installation engineering, security technology engineering, metal window and door installation, exhibition engineering, and medical equipment engineering works. It serves real estate clients, government agencies, large-scale enterprises, multinational corporations, upscale hotels, and other clients. The company was founded in 2001 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szby.cn",
        "market_cap": 4265334016
    },
    "002051.SZ": {
        "short_name": "CHINA CAMC ENGINEE",
        "long_name": "China CAMC Engineering Co., Ltd.",
        "summary": "China CAMC Engineering Co., Ltd. engages in engineering, procurement, and construction projects business in Asia, Africa, the United States, and Eastern Europe. It undertakes industrial, agricultural, water engineering, power, communications, petrochemical, mining, and other projects, as well as invests in various projects. The company is also involved in trading agricultural products and materials, steel products, pulps, chemicals, machinery and equipment, etc. China CAMC Engineering Co., Ltd. was founded in 2001 and is based in Beijing, China. China CAMC Engineering Co., Ltd. is a subsidiary of China National Machinery Industry Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100080",
        "website": "http://www.camce.com.cn",
        "market_cap": 8006042624
    },
    "002060.SZ": {
        "short_name": "GUANGDONG NO.2 HYD",
        "long_name": "Guangdong No.2 Hydropower Engineering Company, Ltd.",
        "summary": "Guangdong No.2 Hydropower Engineering Company, Ltd. engages in infrastructure construction businesses in China. It also invests in and constructs hydropower, wind power, and photovoltaic power stations. The company is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511300",
        "website": "http://www.gdsdej.com",
        "market_cap": 4304090624
    },
    "002062.SZ": {
        "short_name": "HONGRUN CONSTRUCT",
        "long_name": "Hongrun Construction Group Co., Ltd.",
        "summary": "Hongrun Construction Group Co., Ltd. engages in construction business primarily in China. It engages in rail, road, and bridge, as well as housing construction activities. The company is also involved in real estate development, infrastructure investment and construction, and solar energy businesses. In addition, it invests in building materials. Hongrun Construction Group Co., Ltd. was founded in 1994 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.chinahongrun.com",
        "market_cap": 4928174592
    },
    "002081.SZ": {
        "short_name": "SUZHOU GOLD MANTIS",
        "long_name": "Suzhou Gold Mantis Construction Decoration Co., Ltd.",
        "summary": "Suzhou Gold Mantis Construction Decoration Co., Ltd., engages in the design and construction of interior decoration, curtain walls, furniture, FF and E, and landscape in China. The company is involved in the design and construction of curtain walls, as well as landscape for parks, commercial plaza, commercial pedestrian street, public buildings, residential communities, factory premises, etc. It also provides research, development, engineering design, processing and manufacturing, construction and installation, and consultancy services for curtain walls; and designs and constructs intelligent building systems. In addition, the company is involved in the creation of an integral space environment and special effect for hotels, museums, clubhouses, and office spaces, etc.; provision of decoration and interior design services; and system integration activities. Suzhou Gold Mantis Construction Decoration Co., Ltd. was founded in 1993 and is headquartered in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215004",
        "website": "http://www.goldmantis.com",
        "market_cap": 21520547840
    },
    "002116.SZ": {
        "short_name": "CHINA HAISUM ENGIN",
        "long_name": "China Haisum Engineering Co., Ltd.",
        "summary": "China Haisum Engineering Co., Ltd. provides general contracting and project management services. It provides engineering design services in various fields comprising civil building, pulp and paper making, beverage/brew, food/dairy/sugar, tobacco/cigarette, grain, oil, fruit, vegetable/meat processing/frozen and fresh, cosmetics/essence and perfume, plastic product/sensitive material, chemical and chemical fiber/daily-use chemical/biological/pharmaceutical, household electrical appliance, packaging/printing, electron product and electrical equipment, new building material, machinery manufacture/domestic machinery, and automobile parts and accessories/metal processing fields, as well as to store and logistics/hypermarkets, research and development centers, public utilities, and other projects. The company also offers engineering project consultation services in various fields, such as pulp and paper making, food industry, household electrical appliances, household chemical industry, biology fermentation, oleochemicals, automobile components, thermal power engineering, civil buildings, and environment protection engineering. In addition, it provides engineering supervision services for civil and industrial buildings, as well as public utilities. China Haisum Engineering Co., Ltd. operates in Asia, Europe, Africa, the Americas, Oceania, etc. The company was founded in 1953 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200031",
        "website": "http://www.haisum.com",
        "market_cap": 2710412032
    },
    "002135.SZ": {
        "short_name": "ZHEJIANG S/EAST SP",
        "long_name": "Zhejiang Southeast Space Frame Co., Ltd.",
        "summary": "Zhejiang Southeast Space Frame Co., Ltd. designs, manufactures, and installs steel structures worldwide. It provides long-span space truss structures and spaces; mesh net shell structures; multi-layer, high-rise, and super high-rise heavy steel structure; light steel structures; metal roof systems; and steel structure residential products. The company was formerly known as Zhejiang Southeast Space Frame Group Co., Ltd. Zhejiang Southeast Space Frame Co., Ltd. was founded in 1984 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "311209",
        "website": "http://www.dongnanwangjia.com",
        "market_cap": 6889103872
    },
    "002178.SZ": {
        "short_name": "S/H YANHUA SMART G",
        "long_name": "Shanghai Yanhua Smartech Group Co., Ltd.",
        "summary": "Shanghai Yanhua Smartech Group Co., Ltd. engages in construction and operation of smart cities. The company is involved in smart city construction, consulting, energy saving, smart medical, tourism, public security, and hotel activities. Shanghai Yanhua Smartech Group Co., Ltd. was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200060",
        "website": "http://www.chinaforwards.com",
        "market_cap": 3019528704
    },
    "002307.SZ": {
        "short_name": "XINJIANG BEIXIN RO",
        "long_name": "Xinjiang Beixin Road & Bridge Group Co., Ltd",
        "summary": "Xinjiang Beixin Road & Bridge Group Co., Ltd. engages in the construction of roads and bridges in China and internationally. The company was founded in 2001 and is based in Urumqi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Urumqi",
        "zipcode": "830011",
        "website": "http://www.xjbxlq.com",
        "market_cap": 4946355200
    },
    "002310.SZ": {
        "short_name": "BEIJING ORIENT LAN",
        "long_name": "Beijing Orient Landscape & Environment Co., Ltd.",
        "summary": "Beijing Orient Landscape & Environment Co., Ltd. engages in the water system management, solid waste and hazardous waste treatment, and tourism businesses. It is involved in the management of contaminated water bodies, riverway basins, sponge city, and township sewage treatment, etc.; and resources regeneration, waste treatment, resource utilization, and harmless treatment of industrial hazardous wastes, etc. The company was formerly known as Beijing Orient Landscape Co., Ltd. and changed its name to Beijing Orient Landscape & Environment Co., Ltd. in January 2015. Beijing Orient Landscape & Environment Co., Ltd. was founded in 2001 and is based in Beijing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.orientscape.com",
        "market_cap": 9989911552
    },
    "002325.SZ": {
        "short_name": "SHENZHEN HONGTAO G",
        "long_name": "Shenzhen Hongtao Group Co., Ltd.",
        "summary": "Shenzhen Hongtao Group Co., Ltd. engages in building decoration industry in China. The company offers decorative design and construction in the areas of architectural decoration, decoration design, building curtain wall, urban and road lighting, building intelligence, mechanical and electrical equipment installation, and fire protection facilities. It is also involved in the research and development, production, and sale of decorative materials. The company was formerly known as Shenzhen Hongtao Decoration Co., Ltd. and changed its name to Shenzhen Hongtao Group Co., Ltd. in March 2019. Shenzhen Hongtao Group Co., Ltd. was founded in 1985 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518073",
        "website": "http://www.szhongtao.cn",
        "market_cap": 2955383296
    },
    "002482.SZ": {
        "short_name": "SHENZHEN GRANDLAN",
        "long_name": "Shenzhen Grandland Group Co., Ltd.",
        "summary": "Shenzhen Grandland Group Co., Ltd. engages in the architectural design, decoration, and construction activities in China. It provides decoration services to public buildings and residences, hotels, commercial complexes, stadiums, office buildings, rail transit, etc. The company was formerly known as Shenzhen Grandland Decoration Group Co., Ltd. and changed its name to Shenzhen Grandland Group Co., Ltd. in June 2016. Shenzhen Grandland Group Co., Ltd. was founded in 1995 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szgt.com",
        "market_cap": 4104537600
    },
    "002542.SZ": {
        "short_name": "CHINA ZHONGHUA GEO",
        "long_name": "China Zhonghua Geotechnical Engineering Group Co., Ltd.",
        "summary": "China Zhonghua Geotechnical Engineering Group Co., Ltd. engages in the engineering, general aviation, cultural tourism, and investment businesses in China. The company provides geotechnical engineering services, including engineering survey, design consultation, construction, monitoring and inspection, engineering supervision, and related services; and underground engineering services for foundation pit support, underground diaphragm walls, shield tunnels, and construction machinery manufacturing, as well as undertakes municipal engineering projects, such as roads, bridges, and underground pipe networks. It also offers engineering consulting, planning and design, project investment and management, construction, operation, maintenance, and other related services for airports and general aviation airports. In addition, the company engages in the planning, design, investment, development, and construction of cultural tourism towns, theme parks, general aviation towns, and related projects. Further, it invests in cultural media, electronic chip technology, Internet finance, big data, and other industries. China Zhonghua Geotechnical Engineering Group Co., Ltd. was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "102600",
        "website": "http://www.cge.com.cn",
        "market_cap": 5398684160
    },
    "002586.SZ": {
        "short_name": "ZHEJIANG RECLAIM C",
        "long_name": "Zhejiang Reclaim Construction Group Co., Ltd.",
        "summary": "Zhejiang Reclaim Construction Group Co., Ltd. engages in the seawall construction business in China. It undertakes water conservancy, hydro power project construction, port and waterway engineering, housing construction, municipal general construction, and blasting and dismantling professional contract services. The company is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.weihaigufen.com.cn/en",
        "market_cap": 3032183296
    },
    "002620.SZ": {
        "short_name": "SHENZHEN RUIHE CON",
        "long_name": "Shenzhen Ruihe Construction Decoration Co., Ltd.",
        "summary": "Shenzhen Ruihe Construction Decoration Co., Ltd. operates as a construction and decoration company in China. The company is involved in the design and construction of architectural decorations and curtain walls, as well as solar photovoltaic power generation and construction installation activities; and provision of electromechanical engineering, fire protection, landscape, and intelligent technology services. It undertakes public infrastructure, hotel and club, finance and securities, business entertainment, transportation facilities, business office, and exhibit and theater projects. The company was formerly known as Shenzhen Ruihe Decoration Engineering Co., Ltd. Shenzhen Ruihe Construction Decoration Co., Ltd. was founded in 1992 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518001",
        "website": "http://www.sz-ruihe.com",
        "market_cap": 2107086464
    },
    "002663.SZ": {
        "short_name": "PUBANG LANDSCAPE A",
        "long_name": "Pubang Landscape Architecture Co., Ltd",
        "summary": "Pubang Landscape Architecture Co., Ltd engages in the landscape planning and design, seedling plantation, landscape architectural, garden conservation, and environmental protection businesses primarily in China. The company was founded in 1995 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.pblandscape.com",
        "market_cap": 3286478848
    },
    "002717.SZ": {
        "short_name": "LINGNAN ECO&CULTUR",
        "long_name": "LingNan Eco&Culture-Tourism Co.,Ltd.",
        "summary": "LingNan Eco&Culture-Tourism Co.,Ltd. engages in the ecological environment and garden construction, culture and tourism, and investment and operation activities in China. The company is involved in the landscape planning and design, ecological environment and garden construction, seedling cultivation and conservation, and research activities. It also engages in the cultural tourism and financial investment businesses. The company was formerly known as LingNan Landscape Co., Ltd. and changed its name to LingNan Eco&Culture-Tourism Co.,Ltd. in February 2018. LingNan Eco&Culture-Tourism Co.,Ltd. was founded in 1998 and is headquartered in Dongguan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523125",
        "website": "http://www.lingnan.cn",
        "market_cap": 4861488640
    },
    "002755.SZ": {
        "short_name": "BEIJING AOSAIKANG",
        "long_name": "Beijing Aosaikang Pharmaceutical Co., Ltd.",
        "summary": "Beijing Aosaikang Pharmaceutical Co., Ltd. researches, develops, manufactures, markets, and sells pharmaceuticals, fine chemicals, and health-care products in China. It offers proton pump inhibitor injections and oncology medicines, as well as APIs. The company provides its products in digestive, oncology, antibiotic, cardiovascular, and other areas. Beijing Aosaikang Pharmaceutical Co., Ltd. was founded in 2003 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211112",
        "website": "http://www.ask-pharm.com",
        "market_cap": 12558004224
    },
    "002775.SZ": {
        "short_name": "SHENZHEN WENKE LAN",
        "long_name": "Shenzhen Wenke Landscape Co., Ltd.",
        "summary": "Shenzhen Wenke Landscape Co., Ltd. engages in planning and designing landscape architectures in China. It operates through Design and R&D, Landscape and Engineering, Eco-Environment, PPP Investment, and Cultural Tourism divisions. The company is involved in the research and development of ecological technology and sponge city; and tourism planning and design. It also engages in the garden landscape projects, municipal public works, and landscape architecture projects; and water environment management, human settlements remediation, and soil pollution remediation activities. In addition, the company invests and finances PPP projects; and invests, constructs, and operates Flower Expo parks. The company was founded in 1996 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.wkyy.com",
        "market_cap": 2276685568
    },
    "002781.SZ": {
        "short_name": "SHENZHEN QIXIN GRO",
        "long_name": "Shenzhen Qixin Group Co., Ltd.",
        "summary": "Shenzhen Qixin Group Co., Ltd. provides architectural decoration design and construction services in China and internationally. It undertakes building decoration, building curtain wall, construction mechanical and electrical installation, fire facilities engineering, and electronics and intelligent engineering work projects. The company was formerly known as Shenzhen Qixin Construction Group Co.,Ltd and changed its name to Shenzhen Qixin Group Co., Ltd. in July 2019. The company was founded in 1995 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518038",
        "website": "http://www.qxzs.com",
        "market_cap": 1608750080
    },
    "002789.SZ": {
        "short_name": "SHENZHEN JIANYI DE",
        "long_name": "Shenzhen Jianyi Decoration Group Co., Ltd.",
        "summary": "Shenzhen Jianyi Decoration Group Co., Ltd., a professional design agency, engages in the architectural design planning, interior design, and decorative engineering design activities. The company was founded in 1994 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.jyzs.com.cn",
        "market_cap": 1552950016
    },
    "002822.SZ": {
        "short_name": "SHENZHEN ZHONGZHUA",
        "long_name": "Shenzhen Zhongzhuang Construction Group Co.,Ltd",
        "summary": "Shenzhen Zhongzhuang Construction Group Co.,Ltd, together with its subsidiaries, provides decoration services in China. It offers architectural decoration services for office spaces, hotels, public venues, rail transit projects, residential projects, commercial centers, and other projects. The company also engages in the landscaping business; construction of municipal housing projects; and provision of consulting design, installation and debugging, and operation training system solutions for grid-connected photovoltaic power plants, and hybrid and independent photovoltaic power plants. In addition, it engages in managing properties, such as offices, residential properties, shopping malls, hotels, apartments, and factories. Shenzhen Zhongzhuang Construction Group Co.,Ltd was founded in 1994 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.zhongzhuang.com",
        "market_cap": 4141100032
    },
    "002830.SZ": {
        "short_name": "SHENZHEN MINGDIAOA",
        "long_name": "Shenzhen Mingdiao Decoration Co., Ltd.",
        "summary": "Shenzhen Mingdiao Decoration Co., Ltd. provides professional and integrated decoration services for large and medium-sized apartment and luxury residential customers in China. The company offers design, engineering construction, material purchase, furniture customization, soft furnishing, and after-sales services. Shenzhen Mingdiao Decoration Co., Ltd. was founded in 1999 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.mingdiao.com.cn",
        "market_cap": 1318732672
    },
    "002856.SZ": {
        "short_name": "SHENZHEN MAGIC DES",
        "long_name": "Shenzhen Magic Design & Decoration Engineering Co., Ltd.",
        "summary": "Shenzhen Magic Design & Decoration Engineering Co., Ltd. operates in the architectural decoration industry in China. It operates as a contractor for electronic engineering, building intelligent engineering construction, engineering design, laboratory system, fire-fighting device, mechatronics, building curtain wall, building decoration, and landscaping works. The company was founded in 1984 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.szmeizhi.com",
        "market_cap": 1633227776
    },
    "002883.SZ": {
        "short_name": "JIANGSU ZHONGSHE G",
        "long_name": "Jiangsu Zhongshe Group Co., Ltd.",
        "summary": "Jiangsu Zhongshe Group Co., Ltd. operates as an engineering consulting company in China. It offers planning, design, consultation, supervision, inspection, surveying, testing, project management, bidding, engineering general contracting, and other services in the fields of transportation, municipal administration, construction, and environment. The company was founded in 1986 and is headquartered in Wuxi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214072",
        "website": "http://www.jszs-group.com",
        "market_cap": 1569608960
    },
    "002887.SZ": {
        "short_name": "TIANJIN LVYIN LAND",
        "long_name": "Tianjin LVYIN Landscape and Ecology Construction Co., Ltd",
        "summary": "Tianjin LVYIN Landscape and Ecology Construction Co., Ltd engages in ecological restoration and landscaping construction business in China. The company offers construction services for ecological restoration works, municipal gardens, and real estate landscape projects; landscape engineering service; saline and alkali restoration, soil and water conservation, and water environment management; and landscape design, technology research, and development services. It also engages in the production of seedlings. The company was founded in 1998 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": null,
        "website": "http://www.tjloving.com",
        "market_cap": 3453839872
    },
    "002949.SZ": {
        "short_name": "SHENZHEN CAPOL INT",
        "long_name": "Shenzhen Capol International & Associates Co.,Ltd",
        "summary": "Shenzhen Capol International & Associates Co., Ltd provides architectural design services. It also offers urban planning, engineering cost consulting, industrialization research and design, BIM design and consulting, EPC project general contracting and whole process engineering consulting, agency construction management, construction services, and prefabricated component development and manufacturing services. The company is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": null,
        "website": "http://www.capol.cn",
        "market_cap": 3358010880
    },
    "002989.SZ": {
        "short_name": "SHENZHEN STRONGTEA",
        "long_name": "Shenzhen Strongteam Decoration Engineering Co., Ltd.",
        "summary": "Shenzhen Strongteam Decoration Engineering Co., Ltd. provides building decoration design services. The company was founded in 2000 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518041",
        "website": "http://www.ztjzgf.net",
        "market_cap": 5869777920
    },
    "003001.SZ": {
        "short_name": "ZHONGYAN TECHNOLOG",
        "long_name": "Zhongyan Technology Co., Ltd.",
        "summary": "Zhongyan Technology Co., Ltd. provides technical research and development services in the areas of geotechnical engineering, environmental restoration, urban underground space development, and utilization. The company was founded in 2008 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100041",
        "website": "http://www.zydd.com",
        "market_cap": 2577088768
    },
    "0589.HK": {
        "short_name": "JIANZHONG CONS",
        "long_name": "Jianzhong Construction Development Limited",
        "summary": "Jianzhong Construction Development Limited provides construction services in the People's Republic of China. It offers foundation works, such as bored pile, H-piles, Larssen sheet piles, diaphragm wall, and tunneling works. The company also provides other construction services, including formwork and scaffolding works comprising formwork and falsework design; manufactures scaffolds; offers erection services; constructs sewage treatment infrastructure; undertakes electrical and mechanical engineering works; and sells construction materials and equipment and others. In addition, it engages in the trading and leasing of foundation works machinery, equipment and tools, lifting and high reach machinery and equipment, earth moving machinery, demolition machinery, material handling machinery and equipment, other machinery, equipment, and tools. The company was founded in 2012 and is headquartered in Fuzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350015",
        "website": "http://www.fjjzkj.com",
        "market_cap": 743750016
    },
    "0871.HK": {
        "short_name": "CH DREDG ENV",
        "long_name": "China Dredging Environment Protection Holdings Limited",
        "summary": "China Dredging Environment Protection Holdings Limited, an investment holding company, provides dredging services in the People's Republic of China. The company operates through four segments: Capital and Reclamation Dredging Business (CRD Business), Environmental Protection Dredging and Water Management Business (EPD and Water Management Business), Other Marine Business, and Property Management Business. The CRD Business segment offers capital and reclamation dredging services, as well as related consultation services. The EPD and Water Management Business segment provides dredging or water management services; and construction services for promoting environmental interests and water quality primarily for inland rivers. The Other Marine Business segment offers marine hoisting, installation, salvaging, vessel chartering, and other engineering services. The Property Management Business segment provides shopping mall management and leasing services; and hotel construction services. It also manufactures and sells dredging machines; invests in, develops, and manages properties; and provides lending and venture capital financing business services in the technology sector. The company was formerly known as Xiangyu Dredging Holdings Limited and changed its name to China Dredging Environment Protection Holdings Limited in January 2014. The company is headquartered in Yancheng, the People's Republic of China. China Dredging Environment Protection Holdings Limited is a subsidiary of Wangji Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Yancheng",
        "zipcode": null,
        "website": "http://www.cdep.com.hk",
        "market_cap": 212047072
    },
    "1253.HK": {
        "short_name": "GREENLAND BROAD",
        "long_name": "China Greenland Broad Greenstate Group Company Limited",
        "summary": "China Greenland Broad Greenstate Group Company Limited, an investment holding company, provides landscape design and gardening, project management, and related services in the People's Republic of China. It offers investment and financing, planning and design, project construction, commercial operation, and maintenance services. The company undertakes municipal and city level landscape projects. It primarily serves governments and state-owned enterprises. The company was formerly known as Broad Greenstate International Company Limited and changed its name to China Greenland Broad Greenstate Group Company Limited in November 2016. The company was founded in 2004 and is headquartered in Shanghai, the People's Republic of China. China Greenland Broad Greenstate Group Company Limited is a subsidiary of Broad Landscape International Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.greenland-broadgreenstate.com.cn",
        "market_cap": 952623872
    },
    "1459.HK": {
        "short_name": "JUJIANG CONS",
        "long_name": "Jujiang Construction Group Co., Ltd.",
        "summary": "Jujiang Construction Group Co., Ltd. provides construction contracting services for residential, commercial, industrial, and public works in the Mainland China. It operates through two segments, Construction Contracting and Others. It offers architecture construction contracting services; and designing, surveying, mapping, monitoring, and consulting services in the engineering of municipal management and construction, as well as sells construction materials, building materials, machinery, and metal materials. The company is also involved in the provision of engineering exploration services; installation, disassembly, and rental of construction lifting equipment; installation of architecture wall; and manufacture and sale of civil defense products. In addition, it engages in the building and operating of youth quality education practice base. The company was formerly known as Qitang Commune Construction Agency and changed its name to Zhejiang Jujiang Holdings Group Co., Ltd. in December 2014. Jujiang Construction Group Co., Ltd. was founded in 1965 and is headquartered in Tongxiang, the People's Republic of China. Jujiang Construction Group Co., Ltd. is a subsidiary of Zhejiang Jujiang Holdings Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Tongxiang",
        "zipcode": "314500",
        "website": "http://www.jujiang.cn",
        "market_cap": 448022400
    },
    "1495.HK": {
        "short_name": "JIYI HOLDINGS",
        "long_name": "Jiyi Holdings Limited",
        "summary": "Jiyi Holdings Limited, an investment holding company, sells and distributes building and home improvement materials and furnishings in the People's Republic of China. The company operates in two segments, Sale and Distribution of Merchandise, and Provision of Interior Design and Building Engineering Services. It offers building materials, home improvement materials, and furnishings. The company provides its products to customers through direct sales, tenders, and sales outlets. It has 15 sales outlets. The company was formerly known as Jiyi Household International Holdings Limited and changed its name to Jiyi Holdings Limited in August 2020. The company was founded in 1997 and is headquartered in Meizhou, China. Jiyi Holdings Limited is a subsidiary of Xinling Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Meizhou",
        "zipcode": null,
        "website": "http://www.jiyiholdings.com",
        "market_cap": 497317760
    },
    "1618.HK": {
        "short_name": "MCC",
        "long_name": "Metallurgical Corporation of China Ltd.",
        "summary": "Metallurgical Corporation of China Ltd., together with its subsidiaries, engages in the engineering contracting, property development, equipment manufacture, and resource development businesses in China and internationally. The company's Engineering Contracting segment offers engineering, construction, and other related contracting services for metallurgical and non-metallurgical projects. Its Property Development segment develops and sells residential and commercial properties, and housing properties; and develops land. The company's Equipment Manufacturing segment engages in the development and production of metallurgical equipment, steel structures, and other metal products. Its Resource Development segment is involved in the development, mining, and processing of mineral resources; and the production of nonferrous metals and polysilicon. The company also engages in the mining and smelting of nickel cobalt ore, as well as provision of investigation, design, infrastructure contractor, finance, repair work, trading, finance lease, integrated pipe network technology development, etc. services. Metallurgical Corporation of China Ltd. was founded in 2008 and is based in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100028",
        "website": "http://www.mccchina.com",
        "market_cap": 38753132544
    },
    "1727.HK": {
        "short_name": "HEBEI CONS",
        "long_name": "Hebei Construction Group Corporation Limited",
        "summary": "Hebei Construction Group Corporation Limited engages in the construction contracting of buildings and infrastructure projects in the People's Republic of China. The company operates through two segments, Construction Contracting and Others. It provides construction contracting services for residential, public works, industrial, and commercial construction projects; and municipal and transportation infrastructure, including facilities for water supply and treatment, gas and heating, urban pipelines, landscaping, roads, bridges and airport runways, as well as specialized construction works, including electrical and mechanical installation, steel structure, and decoration projects. The company also engages in the road, railway, port and waterways, water resources and hydropower, and subgrade and pavement construction works; and property development and operations. Hebei Construction Group Corporation Limited was founded in 1952 and is headquartered in Baoding, the People's Republic of China. Hebei Construction Group Corporation Limited is a subsidiary of Zhongru Investment Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Baoding",
        "zipcode": null,
        "website": "http://www.hebjs.com.cn",
        "market_cap": 4650043392
    },
    "1802.HK": {
        "short_name": "WENYE GROUP",
        "long_name": "Wenye Group Holdings Limited",
        "summary": "Wenye Group Holdings Limited, an investment holding company, offers interior and exterior building decoration and design services in the People's Republic of China. The company provides construction and design services of indoor and outdoor building decoration, as well as fitment for office buildings, public facilities, high-end star hotels, traffic hubs, commercial properties, residential properties, and curtain walls. It also manufactures and processes decoration materials; and provides customized interior design and curtain wall design services. The company was founded in 1989 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518048",
        "website": "http://www.szwyzs.com.cn",
        "market_cap": 671219968
    },
    "1855.HK": {
        "short_name": "ZONBONG ENVIRO",
        "long_name": "Zonbong Landscape Environmental Limited",
        "summary": "Zonbong Landscape Environmental Limited provides design, construction, and maintenance services in the People's Republic of China. The company operates through Landscaping, Ecological Restoration, and Others segments. Its projects include landscape designing and construction works; ecological restoration works in cultural tourism projects; and investigation, survey, design, and technical consultancy services for municipal construction projects. The company was founded in 2008 and is headquartered in Changchun, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.zonbong.com",
        "market_cap": 588500032
    },
    "2017.HK": {
        "short_name": "CHANHIGH",
        "long_name": "Chanhigh Holdings Limited",
        "summary": "Chanhigh Holdings Limited, an investment holding company, provides landscape and municipal works construction, and maintenance services in the People's Republic of China. It operates through four segments: Landscape Construction, Municipal Works Construction, Building Works, and Others. The Landscape Construction segment undertakes works of municipal and private landscaping projects, such as planting of trees, modifying the layout of land, foundation works for landscape construction, building and construction of parks, etc. The Municipal Works Construction segment primarily conducts municipal or local government works, such as municipal road construction, water and lighting works, etc. The Building Works segment constructs gas stations, auto repair shops, office buildings and temporary warehouses, etc. The Others segment provides maintenance and heritage restoration services, as well as undertakes renovation works and acts as an agent in the trading of construction materials. Chanhigh Holdings Limited was founded in 2001 and is headquartered in Ningbo, China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.chanhigh.com.hk",
        "market_cap": 284510944
    },
    "2163.HK": {
        "short_name": "BROAD HOMES",
        "long_name": "Changsha Broad Homes Industrial Group Co., Ltd.",
        "summary": "Changsha Broad Homes Industrial Group Co., Ltd. engages in the prefabricated concrete (PC) buildings and services business in the People's Republic of China. It operates through two segments, PC Unit Manufacturing and PC Equipment Manufacturing. The PC Unit Manufacturing segment designs, manufactures, and sells PC units. The PC Equipment Manufacturing segment manufactures and sells PC equipment and related services. The company also offers technological promotion; and engineering design and consultation services, as well as research, develops, manufactures, and sells intelligent technology. In addition, it manufactures and sells bathroom; intelligent equipment; and cement product and other construction materials. The company was founded in 1988 and is headquartered in Changsha, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.bhome.com.cn",
        "market_cap": 8289863168
    },
    "2236.HK": {
        "short_name": "WISON ENGRG",
        "long_name": "Wison Engineering Services Co. Ltd.",
        "summary": "Wison Engineering Services Co. Ltd., an investment holding company, provides chemical engineering, procurement, and construction management services in Mainland China, the United States, the Middle East, and internationally. It provides a range of integrated services, including feasibility studies; consulting; proprietary technologies; design, engineering, and raw materials and equipment procurement; construction management; and maintenance and after-sale technical support services. The company is also involved in the import, export, and sale of equipment and parts. It offers its services for petrochemical, coal-to-chemical, oil refining, and other sectors. The company was founded in 1997 and is headquartered in Shanghai, the People's Republic of China. Wison Engineering Services Co. Ltd. is a subsidiary of Wison Engineering Investment Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.wison-engineering.com",
        "market_cap": 1548032512
    },
    "2355.HK": {
        "short_name": "BAOYE GROUP",
        "long_name": "Baoye Group Company Limited",
        "summary": "Baoye Group Company Limited, together with its subsidiaries, provides construction services in the People's Republic of China. It operates through three segments: Construction, Property Development, and Building Materials. The Construction segment constructs government and public buildings, and urban facilities and infrastructure, as well as commercial, residential, and industrial buildings. This segment also engages in the installation of electrical and electronic products, fireproof facilities, and curtain walls. The Property Development segment develops and sells properties. The Building Materials segment offers curtain walls, ready-mixed concrete, construction materials, furnishings and interior decorations, wooden products and fireproof materials, PC assembly boards, and other products. It also provides decoration and replenishment, architectural and interior design, and other services; manufactures and installs steel frameworks; produces and sells machinery and fittings, and concrete prefabricated parts; sells steel, wood fireproof doors, and other wooden products; and constructs highways, bridges, and other municipal infrastructure. Baoye Group Company Limited was founded in 1974 and is headquartered in Shaoxing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312030",
        "website": "http://www.baoyegroup.com",
        "market_cap": 2588254464
    },
    "2386.HK": {
        "short_name": "SINOPEC SEG",
        "long_name": "SINOPEC Engineering (Group) Co., Ltd.",
        "summary": "SINOPEC Engineering (Group) Co., Ltd., together with its subsidiaries, provides engineering, procurement, and construction (EPC) contracting services. It operates through four segments: Engineering, Consulting and Licensing; EPC Contracting; Construction; and Equipment manufacturing. The Engineering, Consulting and Licensing segment offers design, consulting, research and development, feasibility studies, and compliance certification services. The EPC Contracting segment provides integrated engineering, procurement, construction, maintenance, and project management services. The Construction segment offers infrastructure for oil refining and chemical industries, oil and gas storage, pipelines transportation, construction, renovation, expansion, repair and maintenance services, and large equipment lifting, as well as transportation services in construction projects. The Equipment manufacturing segment designs, develops, manufactures, and sells equipment and spare parts for oil refining and chemical facilities. It also provides technical, and equipment selling and leasing services, as well as medicine, pesticide, and chemical research services. The company serves various industries, such as petrol refining, chemical engineering, aromatics, coal chemicals, inorganic chemicals, pharmaceutical chemicals, clean energy, storage and transportation facilities, environmental protection, energy saving, and other services. It has operations in the People's Republic of China, Kuwait, Oman, Saudi Arabia, and internationally. The company is headquartered in Beijing, China. SINOPEC Engineering (Group) Co., Ltd. is a subsidiary of China Petrochemical Corporation.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100101",
        "website": "http://www.segroup.cn",
        "market_cap": 22937040896
    },
    "300197.SZ": {
        "short_name": "CECEP TECHAND ECOL",
        "long_name": "CECEP Techand Ecology and Environment Co., Ltd.",
        "summary": "CECEP Techand Ecology and Environment Co., Ltd. engages in the eco-environment protection, ecological landscaping, and ecological ecotourism businesses in China. The company offers water ecological restoration, contaminated soil remediation, mining restoration, slope restoration, environmental protection, and energy conservation, as well as resource recycling services; and municipal landscape, commercial landscape, and stereoscopic greening landscape. It is also involved in the integration, reconstruction, development, and operation of ecological tourism resources. CECEP Techand Ecology and Environment Co., Ltd. was formerly known as Shenzhen TechandEcology&Environment Co.,Ltd. and changed its name to CECEP Techand Ecology and Environment Co., Ltd. in April 2021. The company was founded in 2001 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.sztechand.com",
        "market_cap": 8807354368
    },
    "300284.SZ": {
        "short_name": "JSTI GROUP",
        "long_name": "JSTI Group",
        "summary": "JSTI Group provides engineering consultancy services in China and internationally. The company's services include project investment analysis, planning and design, environmental consulting, testing, project management, socio-economic development consulting, and other services. It serves highways, municipal utilities, water transport, railways, urban rail transport, environment, aviation, water conservancy, construction, electricity, etc. The company was formerly known as Jiangsu Transportation Research Institute Co., Ltd. and changed its name to JSTI Group in March 2015. JSTI Group was founded in 1978 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.jsti.com",
        "market_cap": 5634155008
    },
    "300492.SZ": {
        "short_name": "HUATU CENDES CO",
        "long_name": "Huatu Cendes Co., Ltd.",
        "summary": "Huatu Cendes Co., Ltd., an architectural design company, provides professional, designing, consulting, and engineering services to state-owned enterprises, multinational corporations, private companies, and institutions in China. The company was formerly known as Cendes Co., Ltd. and changed its name to Huatu Cendes Co., Ltd. in January 2020. Huatu Cendes Co., Ltd. was founded in 1999 and is based in Xi'an, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiâ\u0080\u0099an",
        "zipcode": "710065",
        "website": "http://www.cendes-arch.com",
        "market_cap": 7750533120
    },
    "300495.SZ": {
        "short_name": "MISHO ECOLOGY & LA",
        "long_name": "Misho Ecology & Landscape Co.,Ltd.",
        "summary": "Misho Ecology & Landscape Co.,Ltd. engages in the ecological restoration and environmental construction business in China. The company is involved in the ecological restoration and landscape, and eco-tourism activities, as well as resources recycling and agricultural product development. It also repairs and reconstructs ecological environment. The company was formerly known as Jiangsu Misho Ecology Landscape Co., Ltd. and changed its name to Misho Ecology & Landscape Co.,Ltd. in April 2016. The company was founded in 2001 and is headquartered in Wuxi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": null,
        "website": "http://www.misho.com.cn",
        "market_cap": 2366719232
    },
    "300517.SZ": {
        "short_name": "HAIBO HEAVY ENGINE",
        "long_name": "Haibo Heavy Engineering Science and Technology Co., Ltd.",
        "summary": "Haibo Heavy Engineering Science and Technology Co., Ltd. engages in construction and installation of steel bridge structures in China. The company was founded in 1994 and is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430207",
        "website": "http://www.haiod.com",
        "market_cap": 1262568576
    },
    "300536.SZ": {
        "short_name": "WUHAN NUSUN LANDSC",
        "long_name": "Wuhan Nusun Landscape Co., Ltd.",
        "summary": "Wuhan Nusun Landscape Co., Ltd. engages in landscape services in China. The company provides landscape construction, landscape architecture design, municipal public works construction, garden construction, and building decoration engineering contracts. Wuhan Nusun Landscape Co., Ltd. is headquartered in Wuhan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": null,
        "website": "http://www.nusunlandscape.com",
        "market_cap": 4062038784
    },
    "300564.SZ": {
        "short_name": "ZHUBO DESIGN CO LT",
        "long_name": "Zhubo Design Co., Ltd.",
        "summary": "Zhubo Design Co., Ltd. provides integrated design services in China. The company offers architectural design, urban planning, and landscape design services, as well as undertakes municipal works, including road, bridge, and water supply engineering works. It undertakes commercial, residential, landscape, health care, green building, cultural and sports building, factory housing, HOPSCA, hospitality and luxury resort, and interior design projects. The company was founded in 1996 and is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518040",
        "website": "http://www.zhubo.com",
        "market_cap": 2180999936
    },
    "300597.SZ": {
        "short_name": "JILIN JLU COMMUNIC",
        "long_name": "Jilin Jlu Communication Design Institute Co., Ltd",
        "summary": "Jilin Jlu Communication Design Institute Co., Ltd provides survey, design, and consulting services for communication engineering projects in China, Iran, Malaysia, and internationally. The company undertakes planning, feasibility study, evaluation, program design, project proposal, technical specification, optimization and technical consultation, and technology research and development in the field of communication. It serves clients in the communications, electricity, water conservancy, transportation, public security, banking, and other industries. The company was formerly known as Changchun Telecommunications Engineering Design Institute Co., Ltd. and changed its name to Jilin Jlu Communication Design Institute Co., Ltd in May 2010. Jilin Jlu Communication Design Institute Co., Ltd was founded in 1985 and is based in Changchun, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changchun",
        "zipcode": null,
        "website": "http://www.jlucdi.com",
        "market_cap": 2292000000
    },
    "300621.SZ": {
        "short_name": "SHENZHEN WEIYE DEC",
        "long_name": "ShenZhen WeiYe Decoration Group Co.,LTD",
        "summary": "ShenZhen WeiYe Decoration Group Co.,LTD engages in the field of domestic architecture decoration in China. The company undertakes building decoration works; curtain wall for building; the electrical and mechanical design consultant and intelligence service; steel structure engineering comprising industrial and civil construction, municipal engineering, and factory building with steel structure and other projects; and industrial park construction. ShenZhen WeiYe Decoration Group Co.,LTD was founded in 1994 and is based in Jingzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingzhou",
        "zipcode": "518034",
        "website": "http://www.szweiye.com",
        "market_cap": 1862110080
    },
    "300635.SZ": {
        "short_name": "SINODAAN CO LTD",
        "long_name": "SinoDaan Co., Ltd.",
        "summary": "SinoDaan Co., Ltd. provides engineering consulting services in China. The company was formerly known as Guangdong Daan Project Management Co., Ltd. and changed its name to SinoDaan Co., Ltd. in April 2018. SinoDaan Co., Ltd. was founded in 1998 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": null,
        "website": "http://www.gddaan.com",
        "market_cap": 2500145408
    },
    "300649.SZ": {
        "short_name": "HANGZHOU LANDSCAPE",
        "long_name": "Hangzhou Landscape Architecture Design Institute Co., Ltd.",
        "summary": "Hangzhou Landscape Architecture Design Institute Co., Ltd. provides landscape design services in China. The company was formerly known as Hangzhou Garden Design Institute and changed its name to Hangzhou Landscape Architecture Design Institute Co., Ltd. in 2002. Hangzhou Landscape Architecture Design Institute Co., Ltd. was founded in 1952 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310007",
        "website": "http://www.hzyly.com",
        "market_cap": 1806080000
    },
    "300712.SZ": {
        "short_name": "FUJIAN YONGFU POWE",
        "long_name": "Fujian Yongfu Power Engineering Co.,Ltd.",
        "summary": "Fujian Yongfu Power Engineering Co., Ltd. provides survey and design, planning and consulting, and general contracting business in the field of power generation in China and internationally. The company's services include power planning consulting, survey and design, EPC general contract, power energy investment, smart energy, and intelligent operation and maintenance services. The company was founded in 1994 and is based in Fuzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Fuzhou",
        "zipcode": "350108",
        "website": "http://www.fjyfdl.com",
        "market_cap": 8498793472
    },
    "300732.SZ": {
        "short_name": "HENAN PROVINCIAL C",
        "long_name": "Henan Provincial Communications Planning & Design Institute Co., Ltd.",
        "summary": "Henan Provincial Communications Planning & Design Institute Co., Ltd. undertakes highway and municipal engineering projects in the Asia-Pacific, Africa, and Latin America. It constructs road and bridge, building, tunnel and underground, traffic and logistics, marine traffic, and international engineering projects, as well as offers comprehensive traffic planning, project supervision, inspection and reinforce, project survey and mapping, and digital image services. The company was founded in 1964 and is based in Zhengzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhengzhou",
        "zipcode": "450052",
        "website": "http://www.hnrbi.com",
        "market_cap": 2909681152
    },
    "300746.SZ": {
        "short_name": "HANJIA DESIGN GROU",
        "long_name": "Hanjia Design Group Co., Ltd.",
        "summary": "Hanjia Design Group Co., Ltd. engages in architecture and engineering activities in China. The company is involved in planning, architecture, landscape architecture, interior decoration and engineering of municipal administration, intelligence, curtain walls, and geotechnical engineering, as well as construction drawing review, energy saving assessment, and transportation assessment. Hanjia Design Group Co., Ltd. was founded in 2007 and is headquartered in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310005",
        "website": "http://www.cnhanjia.com",
        "market_cap": 2309299712
    },
    "300778.SZ": {
        "short_name": "SHENZHEN NEW LAND",
        "long_name": "Shenzhen New Land Tool Planning & Architectural Design Co., Ltd.",
        "summary": "Shenzhen New Land Tool Planning & Architectural Design Co., Ltd. engages in urban construction activities in China. Its services include urban planning, architectural design, municipal design, transportation planning, low-carbon urban construction planning, landscape architecture design, land preparation and comprehensive development consulting services. The company was founded in 1993 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518172",
        "website": "http://www.nlt.com.cn",
        "market_cap": 1924999936
    },
    "300826.SZ": {
        "short_name": "NANJING RESEARCH I",
        "long_name": "NanJing Research Institute of Surveying, Mapping & Geotechnical Investigation, Co.Ltd",
        "summary": "NanJing Research Institute of Surveying, Mapping & Geotechnical Investigation, Co.Ltd provides surveying and mapping services in China. The company is involved in various activities, including surveying and mapping geographic information, survey and geotechnical design, three-dimensional urban planning and design, smart city system integration, urban and rural planning, municipal construction, and environmental protection. It also provides topography, pipeline, and urban construction facility survey, as well as geological exploration design and precision measurement services; and offers smart drainage and garden systems, underground space systems, and subway operation monitoring solutions. The company is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.njcky.com",
        "market_cap": 1567200000
    },
    "4VC0.F": {
        "short_name": "CN DRED.ENVIR.TRO.H.HD,20",
        "long_name": "China Dredging Environment Protection Holdings Limited",
        "summary": "China Dredging Environment Protection Holdings Limited, an investment holding company, provides dredging services in the People's Republic of China. The company operates through four segments: Capital and Reclamation Dredging Business (CRD Business), Environmental Protection Dredging and Water Management Business (EPD and Water Management Business), Other Marine Business, and Property Management Business. The CRD Business segment offers capital and reclamation dredging services, as well as related consultation services. The EPD and Water Management Business segment provides dredging or water management services; and construction services for promoting environmental interests and water quality primarily for inland rivers. The Other Marine Business segment offers marine hoisting, installation, salvaging, vessel chartering, and other engineering services. The Property Management Business segment provides shopping mall management and leasing services; and hotel construction services. It also manufactures and sells dredging machines; invests in, develops, and manages properties; and provides lending and venture capital financing business services in the technology sector. The company was formerly known as Xiangyu Dredging Holdings Limited and changed its name to China Dredging Environment Protection Holdings Limited in January 2014. The company is headquartered in Yancheng, the People's Republic of China. China Dredging Environment Protection Holdings Limited is a subsidiary of Wangji Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Yancheng",
        "zipcode": null,
        "website": "http://www.cdep.com.hk",
        "market_cap": 24091898
    },
    "600039.SS": {
        "short_name": "SICHUAN ROAD & BRIDGE",
        "long_name": "Sichuan Road & Bridge Co., Ltd.",
        "summary": "Sichuan Road & Bridge Co., Ltd. invests in, designs, invests, constructs, and operates transportation infrastructure in China. It also engages in the clean energy activities through hydro and wind power plants; and gold resources, real estate development, and finance and securities businesses. The company was founded in 1999 and is based in Chengdu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chengdu",
        "zipcode": "610041",
        "website": "http://www.scrbc.com.cn",
        "market_cap": 31293083648
    },
    "600068.SS": {
        "short_name": "CHINA GEZHOUBA GROUP CO. LTD.",
        "long_name": "China Gezhouba Group Company Limited",
        "summary": "China Gezhouba Group Company Limited engages in infrastructure construction business in China. The company plans, designs, constructs, operates, and builds hydro, thermal, nuclear, and wind power plants; and railways, highways, bridges, tunnels, airports, ports, and wharfs; and municipal, housing, agricultural, water conservancy, and other projects. It also provides services for river regulation, flood control, water logging control, irrigation, water supply, and water resources protection, etc.; generator units, and electrical and auxiliary equipment installation services; and services for various kinds of infrastructure constructions in municipal facilities, including water distribution projects, sewage treatment, flood control, etc. In addition, the company is involved in power-related planning, study, consulting, assessment, surveying, design, and industrial standards drawing; manufactures environmental products; and provides services for waste treatment, land pollution control and reclamation, and enhance water environment and eco-environment. Further, it undertakes urban, residential property, commercial real estate, and housing development projects; manufactures EHV smoothing reactors, barge derricks, gantry cranes, super gates, and vertical platform for installation and adjustment of a drum-type strainer, ships, etc.; and finance infrastructure projects. Additionally, the company provides slag treatment, and coordinated waste treatment services for cement kilns, as well as building materials; services for civil explosive industry, including scientific research, production, and sales and blasting; imports and exports equipment and materials; and invests in various infrastructure projects. The company is based in Wuhan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430033",
        "website": "http://www.cggc.cn",
        "market_cap": 33660942336
    },
    "600193.SS": {
        "short_name": "SHANGHAI PROSOLAR RESOURCES DEV",
        "long_name": "Shanghai Prosolar Resources Development Co., Ltd",
        "summary": "Shanghai Prosolar Resources Development Co., Ltd engages in the exploitation of iron ore and the distribution of iron powder products in Shanghai and Hunan provinces, China. It also develops and sells real estate properties, primarily villas. The company is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201315",
        "website": null,
        "market_cap": 3777312256
    },
    "600209.SS": {
        "short_name": "LAWTON DEVELOPMENT CO",
        "long_name": "Lawton Development Co., Ltd.",
        "summary": "Lawton Development Co., Ltd engages in the decoration engineering business in China. It decorates high-end hotels, including decoration engineering design and construction and garden landscape engineering, as well as provides interior and exterior decoration services. The company also operates Golden Coast Lawton Hotel consisting of 351 guest rooms. Lawton Development Co., Ltd is based in Haikou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570208",
        "website": "http://www.lawtonfz.com.cn",
        "market_cap": 2010670336
    },
    "600248.SS": {
        "short_name": "SHAANXI CONSTRUCTION ENGINEERIN",
        "long_name": "Shaanxi Construction Engineering Group Co.,ltd.",
        "summary": "Shaanxi Construction Engineering Group Co.,ltd., through its subsidiaries, engages in general engineering construction business in China and internationally. It undertakes the general contracting of municipal public, petrochemical, highway, decoration, ancient building landscaping, urban rail transit, and other projects. The company is also involved in the production and installation of steel structures; production and distribution of commercial mixed concrete; research and development, and production of boilers; provision of logistics and distribution services; and development and construction of real estate properties. In addition, it engages in product sales, medical, healthcare, education, tourism, hotel management, and other businesses. The company was founded in 1986 and is based in Xi'an, China. Shaanxi Construction Engineering Group Co.,ltd. operates as a subsidiary of Top International Engineering Corporation.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xi'an",
        "zipcode": "710003",
        "website": "http://www.shxi-jz.com",
        "market_cap": 17293447168
    },
    "600284.SS": {
        "short_name": "SHANGHAI PUDONG CONSTRUCTION CO",
        "long_name": "Shanghai Pudong Construction Co.,Ltd.",
        "summary": "Shanghai Pudong Construction Co.,Ltd. engages in the construction of infrastructure projects in China. The company constructs roads and bridges. It also manufactures and distributes asphalt products; and provides financial services, as well as operates in the environment protection industry. The company was formerly known as Shanghai Pudong Road & Bridge Construction Co., Ltd. and changed its name to Shanghai Pudong Construction Co.,Ltd. in March 2021. Shanghai Pudong Construction Co.,Ltd. was founded in 1998 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200120",
        "website": "http://www.pdjs.com.cn",
        "market_cap": 6491012608
    },
    "600326.SS": {
        "short_name": "TIBET TIANLU CO. LTD.",
        "long_name": "Tibet Tianlu Co., Ltd.",
        "summary": "Tibet Tianlu Co., Ltd. engages in infrastructure construction business in China. The company undertakes road pavement and bridge, highway, municipal public work, building, and railway construction projects. Tibet Tianlu Co., Ltd. was founded in 1999 and is based in Lhasa, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lhasa",
        "zipcode": "850000",
        "website": "http://www.xztianlu.com",
        "market_cap": 6347069952
    },
    "600496.SS": {
        "short_name": "CHANGJIANG & JINGGONG STEEL BLD",
        "long_name": "Changjiang & Jinggong Steel Building (Group) Co., Ltd",
        "summary": "Changjiang & Jinggong Steel Building (Group) Co., Ltd. engages in the design, construction, and installation of steel structures in China and internationally. The company offers light and high-rise steel structures, metal building systems, steel decking, and cladding products. It also provides new building materials. The company was founded in 1999 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201199",
        "website": "http://www.600496.com",
        "market_cap": 8252766720
    },
    "600502.SS": {
        "short_name": "ANHUI CONSTRUCTION ENGINEERING ",
        "long_name": "Anhui Construction Engineering Group Co., Ltd.",
        "summary": "Anhui Construction Engineering Group Co., Ltd. undertakes various construction projects in China. The company operates as a general contractor of water conservancy and hydropower projects, houses, highways, buildings, earth and stone, road pavements, municipal public works, highway subgrades, and architectural decoration projects. It also undertakes renovation, port and waterway engineering construction, and landscaping engineering and professional contracting works; and provides large and medium-sized hydraulic metal structure production and installation services. In addition, the company develops and sells real estate properties; and constructs and operates hydropower plants. The company was formerly known as Anhui Water Resources Development Co., Ltd. Anhui Construction Engineering Group Co., Ltd. is based in Handan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Bengbu",
        "zipcode": null,
        "website": "http://www.aceg.com.cn",
        "market_cap": 6798581760
    },
    "600512.SS": {
        "short_name": "TENGDA CONSTRUCTION GROUP CO.",
        "long_name": "Tengda Construction Group Co., Ltd.",
        "summary": "Tengda Construction Group Co., Ltd. engages in the construction business in China. It constructs urban roads, bridges, track crossings, sewage treatment, highways, housing construction, and other projects, as well as is involved in the real estate development and investment businesses. The company was formerly known as Huangyan Municipal Engineering Co., Ltd. Tengda Construction Group Co., Ltd. was founded in 1972 and is based in Taizhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Taizhou",
        "zipcode": "318050",
        "website": "http://www.tengdajs.com",
        "market_cap": 4956589568
    },
    "600629.SS": {
        "short_name": "EAST CHINA CONSTRUCTION GROUP C",
        "long_name": "Arcplus Group PLC",
        "summary": "Arcplus Group PLC, together with its subsidiaries, provides architecture design and engineering consulting solutions for urban development in China. The company offers architecture/design services, including urban planning, architecture/engineering, interior design, landscape architecture, geotechnical design, municipal and public works design, historic/cultural heritage building preservation, water conservancy design/engineering, and specialty design services. It also provides construction consulting services, such as technical consulting, project management, construction supervision, quantity survey, tendering agency, BIM consulting, geotechnical investigation, engineering survey, testing and inspection, and building quality testing services. In addition, the company offers project contracting services for general, special, and other contracts; and other services comprising technology, information, and investment. Further, it provides architectural design, municipal engineering, landscape design, architectural acoustic design, EPC services, etc. The company was formerly known as East China Construction Group Co., Ltd. Arcplus Group PLC was founded in 1952 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200041",
        "website": "http://www.arcplus.com.cn",
        "market_cap": 3880980480
    },
    "600769.SS": {
        "short_name": "WUHAN XIANGLONG POWER INDUSTRY",
        "long_name": "Wuhan Xianglong Power Industry Co.Ltd",
        "summary": "Wuhan Xianglong Power Industry Co.Ltd engages in the water supply and construction businesses in China. The company was founded in 1993 and is based in Wuhan, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430078",
        "website": "http://www.whghjt.com/news/25.html",
        "market_cap": 1942380800
    },
    "600820.SS": {
        "short_name": "SHANGHAI TUNNEL ENGINEERING",
        "long_name": "Shanghai Tunnel Engineering Co., Ltd.",
        "summary": "Shanghai Tunnel Engineering Co., Ltd. engages in the consulting, planning, investment, construction, operation, maintenance, and upgradation of urban infrastructure in China and internationally. Its construction portfolio includes tunnel, rail transit, road and bridge, architecture and real estate, power, water treatment, and underground space development projects. The company also provides slurry shield and other shield machines; and precast concrete, renewable concrete, and bituminous materials. Shanghai Tunnel Engineering Co., Ltd. was founded in 1965 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200137",
        "website": "http://www.stec.net",
        "market_cap": 16600849408
    },
    "600846.SS": {
        "short_name": "SHANGHAI TONGJI SCIENCE & TECH ",
        "long_name": "Shanghai Tongji Science & Technology Industrial Co.,Ltd",
        "summary": "Shanghai Tongji Science & Technology Industrial Co.,Ltd engages in the urban construction and operation management business in China. The company constructs and operates science and technology parks. It also provides engineering consulting, environmental engineering technology, construction project management, and real estate development services. The company was founded in 1993 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200092",
        "website": "http://www.tjkjsy.com.cn",
        "market_cap": 5291734016
    },
    "600853.SS": {
        "short_name": "LONGJIAN ROAD & BRIDGE CO.  LTD",
        "long_name": "Longjian Road&Bridge Co.,Ltd",
        "summary": "Longjian Road&Bridge Co.,Ltd engages in the construction of roads and bridges in China and internationally. It is also involved in road, bridge, municipal, tunnel, and metro engineering; the operation of e-commerce platform for green and organic food; resources business; and investment and trading, as well as the provision of engineering design and financial services. The company was formerly known as Beiman Special Steel Co., Ltd. and changed its name to Longjian Road&Bridge Co.,Ltd in May 2002. Longjian Road&Bridge Co.,Ltd was founded in 1953 and is based in Harbin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150009",
        "website": "http://www.longjianlq.com",
        "market_cap": 2562494976
    },
    "600939.SS": {
        "short_name": "CHONGQING CONSTRUCTION ENGINEER",
        "long_name": "Chongqing Construction Engineering Group Corporation Limited",
        "summary": "Chongqing Construction Engineering Group Corporation Limited engages in construction activities in China. The company engages in the construction of buildings, roads, bridges, tunnels, and steel and electromechanical structures; and undertakes rail transit, design, and other businesses. It is also involved in manufacturing construction machinery; providing logistics and distribution, construction finance, and construction project investment management services; and franchising business. The company was formerly known as Chongqing Jiangong Group Co., Ltd. and changed its name to Chongqing Construction Engineering Group Corporation Limited in September 2010. The company was founded in 1998 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "401122",
        "website": "http://www.ccegc.cn",
        "market_cap": 6568598528
    },
    "600970.SS": {
        "short_name": "SINOMA INTERNATIONAL ENGINEERIN",
        "long_name": "Sinoma International Engineering Co.Ltd",
        "summary": "Sinoma International Engineering Co.Ltd engages in the engineering, equipment manufacture and supply, and other businesses in China and internationally. The company offers general contracting services, including engineering design, technology and equipment research and development, equipment manufacture and supply, civil construction, equipment installation and plant commissioning, and operation and maintenance services for the cement industry, as well as engineering construction and consultancy services. It also provides a range of equipment for cement production, such as rotary kilns, tube mills, pre-heaters, grate coolers, crushers, ball mills, de-ducting machines, separators, elevators, stackers, reclaimers, etc.; and environmental and photovoltaic engineering services. Sinoma International Engineering Co.Ltd was founded in 2001 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100102",
        "website": "http://www.sinoma.com.cn",
        "market_cap": 18071560192
    },
    "601226.SS": {
        "short_name": "HUADIAN HEAVY INDUSTRIES CO LTD",
        "long_name": "Huadian Heavy Industries Co., Ltd.",
        "summary": "Huadian Heavy Industries Co., Ltd., an engineering company, engages in power, coal, petrochemical, mining, metallurgy, port, water conservancy, building material, urban construction, and other activities in China and internationally. The company designs, manufactures, supplies, constructs, installs, and commissions material handling systems, including stackers, unloaders, tubular belt conveyors, long distance curve belt conveyors, and large belt conveyors. It also engages in the open-pit mine semi-continuous mining equipment, dumpers, belt conveyors, and other green mining equipment. In addition, the company researches, designs, manufactures, installs, and commissions air-cooling systems; sells heavy duty gas turbine and combined cycle products, and heating systems; designs and manufactures steel structures; and provides bulk storage and general engineering contracting services. Further, it is involved in the construction of the wind turbine foundation, booster station, and wind tower foundation; installation of the transition section, offshore wind towers, and structure and equipment components; submarine cable laying; and operation and maintenance of offshore wind farms. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.hhi.com.cn",
        "market_cap": 4469850112
    },
    "601512.SS": {
        "short_name": "CHINA-SINGAPORE SUZHOU INDUSTRI",
        "long_name": "China-Singapore Suzhou Industrial Park Development Group Co., Ltd.",
        "summary": "China-Singapore Suzhou Industrial Park Development Group Co., Ltd. engages in the construction, development, and operation of real estate properties. It develops industrial parks and residential properties; leases commercial properties; rents apartments; and provides property management services. The company was founded in 1994 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215123",
        "website": "http://www.cssd.com.cn",
        "market_cap": 15648410624
    },
    "601611.SS": {
        "short_name": "CHINA NUCLEAR ENGINEERING CO LT",
        "long_name": "China Nuclear Engineering Corporation Limited",
        "summary": "China Nuclear Engineering Corporation Limited engages in the nuclear power, and industrial and civil engineering businesses in China. It is involved in the construction of nuclear power plants and nuclear reactors; and industrial and civil engineering construction services in the areas of urban and municipal engineering, communications and transportation, energy, and petrochemicals. The company was incorporated in 1999 and is based in Beijing, China. China Nuclear Engineering Corporation Limited is a subsidiary of China Nuclear Engineering Group Co. Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100037",
        "website": "http://ltd.cnecc.com",
        "market_cap": 19024271360
    },
    "601789.SS": {
        "short_name": "NINGBO CONSTRUCTION CO LTD",
        "long_name": "Ningbo Construction Co., Ltd.",
        "summary": "Ningbo Construction Co., Ltd. engages in construction business in China. It is involved in the construction of houses, curtain walls, and fire engineering works; steel structure engineering, pipeline installation engineering, municipal engineering, and electric power engineering works; door and window engineering design and construction; and building decoration activities. The company also undertakes various general contracting works, such as building construction and decoration, municipal engineering, housing construction, municipal public works construction, mechanical and electrical engineering construction, petrochemical engineering construction, and highway engineering construction works. In addition, it provides engineering survey, architectural design, rail transit, mechanical and electrical equipment installation, steel structure, and municipal public works supervision services. Further, the company produces and sells concrete, prestressed pipe piles, and ordinary ring subway shields. Ningbo Construction Co., Ltd. was founded in 1951 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315040",
        "website": "http://www.jiangong.com.cn",
        "market_cap": 3679836416
    },
    "601886.SS": {
        "short_name": "JANGHO GROUP CO LTD",
        "long_name": "Jangho Group Co., Ltd.",
        "summary": "Jangho Group Co., Ltd. manufactures and sells curtain wall products in worldwide. The company provides various services, including interior decoration, ophthalmology treatment, third-party testing, and community hospitals. It also offers its products and services under the Jangho, Sundart, Gang Yuan, Zeming, Steve Leung Designers, and Vision brands. The company was founded in 1999 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101300",
        "website": "http://www.jangho.com",
        "market_cap": 8355321856
    },
    "603030.SS": {
        "short_name": "SHANGHAI TRENDZONE CONSTRUCTION",
        "long_name": "Shanghai Trendzone Construction Decoration Group Co.,Ltd.",
        "summary": "Shanghai Trendzone Construction Decoration Group Co.,Ltd. provides full housing decoration services in China. It offers custom hardcover, luxury decoration, hotel renovation services, as well as commercial, office, and club decoration services. The company also provides public building design and construction, home improvement design and construction, supporting furniture production, and soft assembly decoration. Shanghai Trendzone Construction Decoration Group Co.,Ltd. was founded in 1998 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.trendzone.com.cn",
        "market_cap": 2400055552
    },
    "603316.SS": {
        "short_name": "CHENGBANG ECO ENVIRONMENT CO LT",
        "long_name": "Chengbang Eco-Environment Co.,Ltd.",
        "summary": "Chengbang Eco-Environment Co.,Ltd. primarily operates in the construction industry in China. The company provides integrated solutions in the areas of consulting planning, planning and design, investment and construction, and maintenance and operation management. The company provides urban and rural, tourism, and cultural creative planning services; landscape architectural and construction engineering services; landscaping services; services in the areas of water pollution control, soil remediation, and geological disaster management; and tourism and its information consultancy services. It also undertakes municipal public, lighting, water conservancy, and cultural relics protection works, as well as housing construction, municipal utility, and ancient building projects; and operates thematic scenic spots and characteristic towns. The company was formerly known as Zhejiang Chengbang Landscape Co.,Ltd. The company was founded in 1996 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": null,
        "website": "http://www.cbgfcn.com",
        "market_cap": 1536796800
    },
    "603359.SS": {
        "short_name": "DONGZHU ECOLOGICAL ENVIRONMENT ",
        "long_name": "Dongzhu Ecological Environment Protection Co.,Ltd",
        "summary": "Dongzhu Ecological Environment Protection Co.,Ltd engages in the garden construction, and landscape planning and design businesses in China. The company is also involved in the ecological wetland; garden and municipal engineering construction; and green maintenance activities. In addition, it produces and sells seedlings. The company was founded in 2001 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214101",
        "website": "http://www.dongzhugufen.com",
        "market_cap": 5353152000
    },
    "603458.SS": {
        "short_name": "GUIZHOU TRANSPORTATION PLANNING",
        "long_name": "Guizhou Transportation Planning Survey&Design Academe Co.,Ltd.",
        "summary": "Guizhou Transportation Planning Survey&Design Academe Co.,Ltd. engages in the engineering consulting and contracting business in China and internationally. It offers consulting, test and inspection, supervision, construction, and general contracting services for roads, bridges, tunnels, ports, and waterways, as well as geotechnical, electromechanical, municipal, and construction projects. The company was founded in 1958 and is based in Guiyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guiyang",
        "zipcode": null,
        "website": "http://www.gzjtsjy.com",
        "market_cap": 3846107392
    },
    "603637.SS": {
        "short_name": "ZHENHAI PETROCHEMICAL ENGINEERI",
        "long_name": "Zhenhai Petrochemical Engineering CO., LTD",
        "summary": "Zhenhai Petrochemical Engineering CO., LTD engages in general contracting, engineering design, project management, supervision, engineering consulting, project price review, and project bidding agency businesses. The company offers petrochemical engineering construction, engineering project application report, feasibility study, designs large and complex projects, engineering consulting, design, procurement, construction management, engineering general contracting, project management contracting, and training and driving services for the petrochemical industry. It also engages in wholesale, retail, and self-agency business of petrochemical products, machinery and equipment, electronic products, and metal materials, as well as the import and export of various types of goods and technology. The company was founded in 1994 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": null,
        "website": "http://www.izpec.com",
        "market_cap": 1710788096
    },
    "603698.SS": {
        "short_name": "CHANGZHENG ENGINEERING CO LTD",
        "long_name": "Changzheng Engineering Co.,LTD",
        "summary": "Changzheng Engineering Co.,LTD provides research and development, engineering design, technical, equipment supply, and EPC services for gasification technology and equipment in China. It also provides simulation training, driving, zero inventory, remote, professional maintenance, and security check services; and chemical project construction services. The company was founded in 2007 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "101111",
        "website": "http://www.china-ceco.com",
        "market_cap": 10183810048
    },
    "603717.SS": {
        "short_name": "TIANYU ECO-ENVIRONMENT CO LTD",
        "long_name": "TianYu Eco-Environment Co., Ltd.",
        "summary": "TianYu Eco-Environment Co., Ltd. engages in the water environment management business in China. The company is involved in the improvement of small towns and rural environment, ecological gardens, soil and mine restoration, solid waste treatment, municipal support, and water conservancy construction; and tourism planning and design, project construction and operation, resource reconstruction, destination investment, and cultural and creative product research and development activities. It also engages in the agriculture and forestry; and park development businesses. The company was formerly known as Tianyu Ecology & Landscape Co.,Ltd. and changed its name to TianYu Eco-Environment Co., Ltd. in November 2017. TianYu Eco-Environment Co., Ltd. was founded in 2000 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://www.tysthj.com",
        "market_cap": 3281171712
    },
    "603778.SS": {
        "short_name": "BEIJING QIANJING LANDSCAPE CO L",
        "long_name": "Beijing Qianjing Landscape Co.,Ltd",
        "summary": "Beijing Qianjing Landscape Co.,Ltd engages in the garden engineering construction, garden landscape design, and seedling sales businesses in China. The company is involved in the construction of municipal greening, ecological wetlands, ecological restoration, greenhouse exhibition halls, and real estate landscapes, as well as seedling planting and maintenance businesses. It also engages in the planning and design, eco-tourism, and technology and environmental protection businesses. The company was formerly known as Beijing Qianjing Landscape Engineering Co., Ltd. and changed its name to Beijing Qianjing Landscape Co.,Ltd in June 2011. Beijing Qianjing Landscape Co.,Ltd was founded in 2002 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100093",
        "website": "http://www.qjyl.com",
        "market_cap": 2719285248
    },
    "603815.SS": {
        "short_name": "ANHUI GOURGEN TRAFFIC CONSTRUCT",
        "long_name": "Anhui Gourgen Traffic Construction Co.,Ltd.",
        "summary": "Anhui Gourgen Traffic Construction Co.,Ltd. operates as a highway and municipal infrastructure construction company in China. It undertakes road construction, bridge engineering, tunnel engineering, municipal engineering, and maintenance engineering project works. The company was founded in 1993 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Hefei",
        "zipcode": null,
        "website": "http://www.gourgen.com",
        "market_cap": 4565849600
    },
    "603828.SS": {
        "short_name": "SUZHOU KELIDA BUILDING & DECORA",
        "long_name": "Suzhou Kelida Building& Decoration Co.,Ltd.",
        "summary": "Suzhou Kelida Building& Decoration Co.,Ltd. operates in the construction business in China. The company designs, develops, produces, and sells curtain walls; and wood products, such as wooden doors, wood veneers, and movable furniture, as well as constructs curtain walls. It also provides indoor and outdoor architectural decoration engineering design and environmental engineering design services; and construction engineering management, engineering project management, engineering cost consulting, government procurement, tendering agency, safety evaluation, and training consulting services, as well as sells electronic products, and machinery and equipment. The company also undertakes interior decoration projects for commercial office buildings, government administrative office buildings, and hotels, as well as science, education, culture, and health facilities. In addition, it is involved in the financing activities. Suzhou Kelida Building& Decoration Co.,Ltd. was founded in 2000 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215011",
        "website": "http://www.kldzs.com",
        "market_cap": 2533409280
    },
    "603843.SS": {
        "short_name": "ZHENGPING ROAD AND BRIDGE CONST",
        "long_name": "Zhengping Road & Bridge Construction Co., Ltd.",
        "summary": "Zhengping Road & Bridge Construction Co., Ltd. engages in the investment, construction, manufacturing, operating, and maintenance of infrastructure sector in China. It focuses on the development of transportation construction, water conservancy construction, towns, and electric power. The company also operates roads, traffic safety facilities, and road construction projects, as well as engages in the processing and selling of gravel and asphalt mixture; road greening maintenance; highway engineering construction; equipment leasing; traffic engineering and facility maintenance; bridge overhaul; tunnel reinforcement and maintenance; road pavement maintenance; and other services. In addition, it is involved in designing, engineering feasibility study report preparation, testing, and technical consultation services. The company was founded in 1994 and is based in Xining, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xining",
        "zipcode": "810000",
        "website": "http://www.zhengpingjituan.com",
        "market_cap": 2240015872
    },
    "603887.SS": {
        "short_name": "SHANGHAI CDXJ DIGITAL TECHNOLOG",
        "long_name": "Shanghai CDXJ Digital Technology Co., Ltd.",
        "summary": "Shanghai CDXJ Digital Technology Co., Ltd. provides underground engineering services in China. It offers foundation construction, geotechnical engineering design, and civil construction contracting services. Shanghai CDXJ Digital Technology Co., Ltd. was founded in 1997 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200062",
        "website": "http://www.shcd.cc",
        "market_cap": 5104145920
    },
    "603909.SS": {
        "short_name": "HOLSIN ENGINEERING CONSULTING C",
        "long_name": "Holsin Engineering Consulting Group Co.,Ltd.",
        "summary": "Holsin Engineering Consulting Group Co.,Ltd. operates as a engineering consulting company in Japan. It specializes in engineering supervision, design consulting, testing and inspection, reinforcement, project management, and other technical services. The company was founded in 1995 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": "361009",
        "website": "http://www.holsin.cn",
        "market_cap": 2543711744
    },
    "603955.SS": {
        "short_name": "DAQIAN ECOLOGY & ENVIRONMENT GR",
        "long_name": "Daqian Ecology&Environment Group Co.,Ltd.",
        "summary": "Daqian Ecology&Environment Group Co.,Ltd. provides landscape architecture design services. It offers ecological landscape design and construction, ecological environment, tourism, cultural construction, and environment operation, as well as sculpture art services. The company was formerly known as Daqian Ecology & Landscape Co., Ltd. and changed its name to Daqian Ecology&Environment Group Co.,Ltd. in January 2018. Daqian Ecology&Environment Group Co.,Ltd. was founded in 1988 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": null,
        "website": "http://www.daqianjg.com",
        "market_cap": 1859363968
    },
    "603959.SS": {
        "short_name": "HUNAN BAILI ENGINEERING SCI & T",
        "long_name": "Hunan Baili Engineering Sci&Tech Co.,Ltd",
        "summary": "Hunan Baili Engineering Sci&Tech Co.,Ltd provides engineering consulting and design, procurement, construction, and project management services in China and internationally. The company offers its services primarily for petrochemical and coal chemical industries covering the fields of petroleum refining, chemical raw materials, synthetic fiber, synthetic rubber, synthetic resins, and coal chemicals, as well as oil and gas storage and transportation. Hunan Baili Engineering Sci&Tech Co.,Ltd is based in Yueyang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yueyang",
        "zipcode": null,
        "website": "http://www.blest.com.cn",
        "market_cap": 5506057728
    },
    "6189.HK": {
        "short_name": "ADWAY",
        "long_name": "Guangdong Adway Construction (Group) Holdings Company Limited",
        "summary": "Guangdong Adway Construction (Group) Holdings Company Limited, together with its subsidiaries, provides interior and exterior building decoration and design services in the People's Republic of China. It offers building decoration, electrical and mechanical installation, curtain wall engineering, and fire safety engineering works. The company's projects comprise a range of building and property categories, including commercial buildings, office buildings, industrial buildings, residential buildings, public buildings, and infrastructures and hotels. It is also involved in the production and sales of decoration materials and equipment. The company serves public and private clients, such as state-owned enterprises, government departments and institutions, listed companies, foreign-funded enterprises, property developers, and property management companies. Guangdong Adway Construction (Group) Holdings Company Limited was incorporated in 1996 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518029",
        "website": "http://www.aidewei.cn",
        "market_cap": 202382048
    },
    "BKG.F": {
        "short_name": "BAOYE GRP H  YC 1",
        "long_name": "Baoye Group Company Limited",
        "summary": "Baoye Group Company Limited, together with its subsidiaries, provides construction services in the People's Republic of China. It operates through three segments: Construction, Property Development, and Building Materials. The Construction segment constructs government and public buildings, and urban facilities and infrastructure, as well as commercial, residential, and industrial buildings. This segment also engages in the installation of electrical and electronic products, fireproof facilities, and curtain walls. The Property Development segment develops and sells properties. The Building Materials segment offers curtain walls, ready-mixed concrete, construction materials, furnishings and interior decorations, wooden products and fireproof materials, PC assembly boards, and other products. It also provides decoration and replenishment, architectural and interior design, and other services; manufactures and installs steel frameworks; produces and sells machinery and fittings, and concrete prefabricated parts; sells steel, wood fireproof doors, and other wooden products; and constructs highways, bridges, and other municipal infrastructure. Baoye Group Company Limited was founded in 1974 and is headquartered in Shaoxing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shaoxing",
        "zipcode": "312030",
        "website": "http://www.baoyegroup.com",
        "market_cap": 275228736
    },
    "C3M.F": {
        "short_name": "CN.MACH.ENGI.CORP. H YC 1",
        "long_name": "China Machinery Engineering Corporation",
        "summary": "China Machinery Engineering Corporation, together with its subsidiaries, operates as an engineering contracting and services provider in China, rest of Asia, South America, North America, Africa, and Europe. It operates through three segments: Construction Contracts, Trading Business, and Services Business. The Construction Contracts segment undertakes engineering, procurement, and construction contracts for various infrastructure-related construction, including hydropower, thermal power, and other engineering contracting projects, as well as transportation, telecommunication, water supply and treatment, building and construction, manufacturing and processing plant, and mining and resources exploitation projects. The Trading Business segment imports and exports various machinery, electrical, and instrumental products for domestic and overseas customers, such as mining equipment, ship components, automobile parts, medical instruments, household appliances, electric meters, manufacturing machinery, and construction materials. The Services Business segment provides export-import agency, design consulting, tendering agency, logistics, and other services. It is also involved in the provision of trading and security investment, storage and property, property management and rental, construction and construction contracts tendering, transportation agency, construction research and design, and legal consultancy, as well as engineering design, contracting, and supervision services. The company was founded in 1978 and is headquartered in Beijing, the People's Republic of China. China Machinery Engineering Corporation is a subsidiary of China National Machinery Industry Corporation.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100055",
        "website": "http://www.cmec.com",
        "market_cap": 1580241152
    },
    "CCGM": {
        "short_name": "CHINA CGAME INC",
        "long_name": "China CGame, Inc.",
        "summary": "China CGame, Inc. develops Massively Multiplayer Online Role Playing Game (MMORPG) in China. It focuses on self-developed MMORPGs game titles that are based on China's iconic characters and nostalgic epochs. The company owns two self-developed game engines, Turbo and Apocalypse. It intends to sell prepaid game cards to a range of regional distributors in China; and directly sell game points to players through its online sales platform. The company was formerly known as China Architectural Engineering, Inc. and changed its name to China CGame, Inc. in March 2011. China CGame, Inc. was founded in 1992 and is based in Changzhou, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Changzhou",
        "zipcode": "213164",
        "website": null,
        "market_cap": 771533
    },
    "CYY.F": {
        "short_name": "CHINA CMNCTS CONSTR.H YC1",
        "long_name": "China Communications Construction Company Limited",
        "summary": "China Communications Construction Company Limited, together with its subsidiaries, engages in the infrastructure construction, design, and dredging businesses. The company is involved in the construction of various infrastructure projects, including port, waterway, land reclamation, river basin, road and bridge, railway, urban rail transit, municipal infrastructure, and construction and environmental protection projects; and provision of infrastructure design services, such as consulting and planning, feasibility study, survey and design, engineering consultancy, engineering measurement and technical research, project management, project supervision, general project contracting, compilation of industry standards and codes, etc. It also provides dredging services primarily comprising infrastructure dredging, maintenance dredging, environmental dredging, reclamation, and watershed management, as well as supports projects related to dredging and land reclamation. In addition, the company engages in the manufacture of road construction machinery; trading of motor vehicle spare parts and machinery; maintenance and design of port machinery; trading of construction materials and equipment; and fund management and financial leasing services. It has operations in Mainland China, Australia, Hong Kong, Africa, the Middle East, and South East Asia. The company was founded in 2006 and is based in Beijing, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100088",
        "website": "http://ccccltd.cn",
        "market_cap": 11706891264
    },
    "WNO.F": {
        "short_name": "WISON ENGINEER.SVCS HD-10",
        "long_name": "Wison Engineering Services Co. Ltd.",
        "summary": "Wison Engineering Services Co. Ltd., an investment holding company, provides chemical engineering, procurement, and construction management services in Mainland China, the United States, the Middle East, and internationally. It provides a range of integrated services, including feasibility studies; consulting; proprietary technologies; design, engineering, and raw materials and equipment procurement; construction management; and maintenance and after-sale technical support services. The company is also involved in the import, export, and sale of equipment and parts. It offers its services for petrochemical, coal-to-chemical, oil refining, and other sectors. The company was founded in 1997 and is headquartered in Shanghai, the People's Republic of China. Wison Engineering Services Co. Ltd. is a subsidiary of Wison Engineering Investment Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201210",
        "website": "http://www.wison-engineering.com",
        "market_cap": 150068816
    },
    "Y06.SI": {
        "short_name": "Green Build",
        "long_name": "Green Build Technology Limited",
        "summary": "Green Build Technology Limited, an investment holding company, engages in the urban infrastructure construction activities in the People's Republic of China. It operates through Insulation, Underground Utility Tunnel, Project Management, Materials Trading, and Others segments. The company constructs and operates external insulation projects; and underground utility tunnel for utility lines, such as electricity, gas supply pipes, and water supply pipes; and communications lines comprising fiber optics, television, and telephone cables. It also trades in construction materials and green technology materials; offers architectural design and construction services for government projects; and promotes and provides energy conservation services, as well as installs green technology and architecture. In addition, Green Build Technology Limited is involved in conservation and investment in construction business; and construction, operation, and management of projects. The company was formerly known as Youyue International Limited and changed its name to Green Build Technology Limited in October 2014. Green Build Technology Limited was founded in 2004 and is based in Harbin, the People's Republic of China.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "state": null,
        "city": "Harbin",
        "zipcode": "150000",
        "website": "http://www.webgbt.com",
        "market_cap": 5180238
    }
}