{
    "000151.SZ": {
        "short_name": "CHINA NAT COMP PLA",
        "long_name": "China National Complete Plant Import & Export Corporation Limited",
        "summary": "China National Complete Plant Import & Export Corporation Limited operates as a general trading company in Asia, Africa, and Latin America. The company exports equipment for various industries, such as transportation and infrastructure. It exports products related to machinery, agricultural products, textiles, light industrial products, educational supplies, chemical products, building materials, electronic machinery, solar energy systems, etc. The company is also involved in the contracting of foreign projects. China National Complete Plant Import & Export Corporation Limited was founded in 1959 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.complant-ltd.com",
        "market_cap": 2234649088
    },
    "000903.SZ": {
        "short_name": "KUNMING YUNNEI POW",
        "long_name": "Kunming Yunnei Power Co.,Ltd.",
        "summary": "Kunming Yunnei Power Co.,Ltd. develops, manufactures, and sells diesel, nature gas, and duel fuel engines in China. The company offers nanometer ceramic thermal insulation films for automobiles and buildings; float glass products; and deep processing products, as well as various oils, such as heavy duty gear and diesel engine oil, and antifreezing solutions. It also provides remanufactured engines, generator sets, casting parts, and agricultural machineries, including rotary and hay loaders; and frame and compartment assemblies for mini, light, and medium-sized trucks. In addition, the company offers buses with gas and hybrid fuel power. Its diesel engines have applications in forklift trucks, harvesters, loaders, tractors, generator sets, stationary power equipment, etc. The company exports its products to Europe, South America, Africa, and Southeast Asia. Kunming Yunnei Power Co.,Ltd. was founded in 1999 and is based in Kunming, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunming",
        "zipcode": "650200",
        "website": "http://www.yunneidongli.com",
        "market_cap": 7449624064
    },
    "2098.HK": {
        "short_name": "ZALL SMARTCOM",
        "long_name": "Zall Smart Commerce Group Ltd.",
        "summary": "Zall Smart Commerce Group Ltd., an investment holding company, engages in the supply chain management and trading activities in the People's Republic of China, Singapore, and internationally. It operates through two segments, Property Development and Related Services; and Supply Chain Management and Trading. The company develops, sells, and operates properties. Its properties comprise retail units, residential apartments, warehousing and logistic units, e-commerce malls, and wholesale shopping malls. In addition, the company trades in agricultural products, chemical materials, plastic raw materials, consumer goods, black and non-ferrous metals, etc., as well as provides financial services, and trading related supply chain finance services. Further, it engages in supply chain management and trading business; and provision of e-commerce services, as well as warehousing and logistics services for the online and offline customers. The company was formerly known as Zall Group Ltd. and changed its name to Zall Smart Commerce Group Ltd. in June 2018. The company was founded in 1996 and is headquartered in Wuhan, the People's Republic of China. Zall Smart Commerce Group Ltd. is a subsidiary of Zall Development Investment Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430000",
        "website": "http://www.zallcn.com",
        "market_cap": 6834023936
    },
    "600051.SS": {
        "short_name": "NINGBO UNITED GROUP CO LTD",
        "long_name": "Ningbo United Group Co.,Ltd.",
        "summary": "Ningbo United Group Co.,Ltd., together with its subsidiaries, engages in the thermoelectricity, real estate, and trade businesses in China. It is involved in the development and construction of Ningbo Economic and Technological Development Zone comprising six functional areas, including industry, commerce, storage, public construction, living, and foreign villas. The company also operates Qijiashan Hotel, a four-star tourist hotel; and generates and supplies thermal power and heat. In addition, it is involved in the development of real estate properties and residential projects; tourism culture development business; import and export of various products; and provision of investment management services. The company was formerly known as Ningbo Economic and Technical Development Zone United Development Corporation Limited and changed its name to Ningbo United Group Co.,Ltd. in June 1996. Ningbo United Group Co.,Ltd. was founded in 1988 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315803",
        "website": "http://www.nug.com.cn",
        "market_cap": 2113984000
    },
    "600058.SS": {
        "short_name": "MINMETALS DEVELOPMENT CO LTD",
        "long_name": "Minmetals Development Co., Ltd.",
        "summary": "Minmetals Development Co., Ltd. operates as a steel distribution service provider in China and internationally. It offers iron ore, coal, coke, pig iron, steel billets, scrap steel, waste ships, refractory materials, barite, fluorspar, talc, silicon carbide, and metallurgical industry raw materials; and ferrochrome, silicomanganese, ferromanganese, electrolytic manganese, ferrosilicon, molybdenum iron, molybdenum oxide, nickel iron, tungsten iron, ferrovanadium, ferrotitanium, boron iron, iron alloys, and alloy raw materials, such as chrome ore and manganese ore. The company also provides rebars, high wires, coiled screws, hot rolled coils, strips, plates, cold rolled coils, galvanized sheets, color coated sheets and various industrial materials, steel and stainless steel, special steel, steel pipes, cast pipe castings, auto parts, hardware and electrical equipment, complete sets of equipment, etc. It addition, it is involved in the provision of logistics, transportation, freight forwarding, ship generation, warehousing, and processing and distribution, as well as insurance and supply chain finance services; tendering business; industrial investment business; and operation of an e-commerce platform to sell its products. Further, the company engages in the short, medium, and long-term time charter operations and escrow business, as well as offers shipping for dry bulk and groceries, containers shipping services, and engineering logistics projects; and consulting services, such as transportation design, market forecasting, and analysis. The company is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100044",
        "website": "http://www.minlist.com.cn",
        "market_cap": 8929010688
    },
    "600287.SS": {
        "short_name": "JIANGSU SAINTY CORP",
        "long_name": "Jiangsu Sainty Corp., Ltd.",
        "summary": "Jiangsu Sainty Corp., Ltd. primarily engages in the import and export of textiles and garments in the People's Republic of China and internationally. The company offers woven garments, including wind resistant coats and jackets under the J. Crew, Ralph Lauren, Levis, Marina Yachting, 18CRR81, and other brands; casual and fashion apparel; lifestyle apparel, such as suits, outwear, bottoms, shirts, dress, T-shirts, sweaters, etc.; and casual and formal ladies' and men's' wear. It also imports, purchases, and sells chemical products, MCC products, metal materials, etc.; fashion clothes, special tooling products, casual clothes, shirts, children's clothes, and uniforms; clothing products, clothing accessories, electronic machine products, plastic particles, wood products, etc.; and pharmaceutical chemicals, textiles, and daily necessities, as well as operates flagship stores on various e-commerce platforms, as well as its own platform under the ESAINTY name. In addition, the company imports and exports garments, auto parts, chemical products, light industrial products, and electronic hardware and building materials; and manufactures, exports, and imports various suits and casual wear under the Jiangsu Famous brand. Further, it offers beer under the Budweiser & Heineken brands; rice wine under the Wuliangye, 1573, and Yanghe Blue Classic brands; table wine under the Changyu & Great Wall brands; and French wine under the Chemin Des Papes, as well as Rical imported wine. Additionally, it produces and exports female clothes and business suits; and wind resistant coats and jackets, as well as stores various liquid chemical products, such as phenol, 1,4Â\u0096butanediol, ethylene glycol, diethylene glycol, styrene, toluene, xylene, methanol, and o-xylene. The company was founded in 1979 and is based in Nanjing, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "210012",
        "website": "http://www.saintycorp.com",
        "market_cap": 2371564032
    },
    "600735.SS": {
        "short_name": "SHANDONG HIKING INTERNATIONAL C",
        "long_name": "Shandong Hiking International Co.,Ltd",
        "summary": "Shandong Hiking International Co.,Ltd engages in the international trading business. The company offers hair products, textiles, clothing, diamonds, knitwear, and aquatic products. It also invests in container manufacturing, financial trust, nonferrous metals, hotel, bad debt assets acquisition and disposition, and other businesses. The company was founded in 2002 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266101",
        "website": "http://www.hikinginternational.com",
        "market_cap": 2391309056
    },
    "601890.SS": {
        "short_name": "ASIAN STAR ANCHOR CHAIN CO LTD ",
        "long_name": "Asian Star Anchor Chain Co., Ltd. Jiangsu",
        "summary": "Asian Star Anchor Chain Co., Ltd. Jiangsu, together with its subsidiaries, manufactures and sells anchor chains, offshore mooring chains, and related accessories in the People's Republic of China. The company provides marine anchor chains and offshore mooring chains, which include stud and studless links; accessories, including kenter shackles, joining shackles, anchor swivel shackles, end shackles, swivels, and other fittings; and other products, such as chafe chains, buoy chains, and anchors. The company also exports its products worldwide. Asian Star Anchor Chain Co., Ltd. was founded in 1981 and is headquartered in Jingjiang, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingjiang",
        "zipcode": "214533",
        "website": "http://www.anchor-chain.com",
        "market_cap": 6082596352
    },
    "BOE.F": {
        "short_name": "BOER POWER HLDGS  HD -,10",
        "long_name": "Boer Power Holdings Limited",
        "summary": "Boer Power Holdings Limited, an investment holding company, designs, manufactures, and sells electrical distribution equipment; and provision of electrical distribution systems solution services in the People's Republic of China. It operates through two segments, IEM Solutions, and Components and Spare Parts Business. The IEM solutions segment sells electrical distribution systems; engineering, procurement, and construction projects; and electricity. The Components and Spare Parts Business segment offers components and spare parts for application of electrical distribution equipment. It also offers photovoltaic products, capacitors, and components and spare parts. Further, the company engages in the trading of electrical distribution equipment, and components and spare parts, as well as in the development and sale of software. It offers its products and services to medical, data center, real estate, energy, industrial park, and other sectors. The company was founded in 1985 and is headquartered in Wuxi, the People's Republic of China. Boer Power Holdings Limited is a subsidiary of King Able Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuxi",
        "zipcode": "214187",
        "website": "http://www.boerpower.com",
        "market_cap": 38208768
    },
    "VALV": {
        "short_name": "SHENGKAI INNOVATIONS INC",
        "long_name": "Shengkai Innovations, Inc.",
        "summary": "Shengkai Innovations, Inc., together with its subsidiaries, designs, manufactures, and distributes ceramic valves for industrial use in the People's Republic of China. The company provides ceramic valves in various categories, including gate, ball, back, adjustable, cut-off, and special valves. It also offers various services related to industrial ceramic valves consisting of manufacture, installation, and maintenance of general industrial ceramic valves, as well as the design and manufacture of a range of non-standard ceramic valves. The company sells its products through direct sales personnel and agents to electric power, petrochemical, chemical, aluminum, and metallurgy industries. Shengkai Innovations, Inc. also exports its products to Europe, North America, the Middle East, and the Asia-Pacific region. The company is headquartered in Tianjin, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300308",
        "website": null,
        "market_cap": 2588450
    },
    "ZL3A.F": {
        "short_name": "ZALL SMART C.GR.HD-,00334",
        "long_name": "Zall Smart Commerce Group Ltd.",
        "summary": "Zall Smart Commerce Group Ltd., an investment holding company, engages in the supply chain management and trading activities in the People's Republic of China, Singapore, and internationally. It operates through two segments, Property Development and Related Services; and Supply Chain Management and Trading. The company develops, sells, and operates properties. Its properties comprise retail units, residential apartments, warehousing and logistic units, e-commerce malls, and wholesale shopping malls. In addition, the company trades in agricultural products, chemical materials, plastic raw materials, consumer goods, black and non-ferrous metals, etc., as well as provides financial services, and trading related supply chain finance services. Further, it engages in supply chain management and trading business; and provision of e-commerce services, as well as warehousing and logistics services for the online and offline customers. The company was formerly known as Zall Group Ltd. and changed its name to Zall Smart Commerce Group Ltd. in June 2018. The company was founded in 1996 and is headquartered in Wuhan, the People's Republic of China. Zall Smart Commerce Group Ltd. is a subsidiary of Zall Development Investment Company Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Industrial Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Wuhan",
        "zipcode": "430000",
        "website": "http://www.zallcn.com",
        "market_cap": 737027200
    }
}