{
    "000507.SZ": {
        "short_name": "ZHUHAI PORT HOLDIN",
        "long_name": "Zhuhai Port Co.,Ltd.",
        "summary": "Zhuhai Port Co.,Ltd. engages in port logistics, energy, and infrastructure construction businesses in China. It invests in and operates port terminals, as well as engages in the provision of ship transportation and other businesses. The company also provides traditional freight, warehousing, bonded VMI, trade logistics, supply chain finance, and other logistics value-added services, as well as shipping, freight forwarding, tally, tugboat, customs declaration, and other port and shipping support services. In addition, it invests in, operates, and services clean energy sources, such as coal-fired power generation, wind power generation, and natural gas power generation projects; and constructs, operates, and maintains city pipeline gas. Further, the company develops port city projects, as well as provides property management and other services. Additionally, it provides financing leasing, supply chain finance, insurance brokerage, and industrial development funds for shipping, cargo owners, and other enterprises. The company was formerly known as Fuhua Group Co., Ltd. and changed its name to Zhuhai Port Co.,Ltd. in September 2010. Zhuhai Port Co.,Ltd. was founded in 1986 and is based in Zhuhai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Zhuhai",
        "zipcode": "519015",
        "website": "http://www.0507.com.cn",
        "full_time_employees": 2883
    },
    "000582.SZ": {
        "short_name": "BEIBU GULF PORT CO",
        "long_name": "Beibu Gulf Port Co., Ltd.",
        "summary": "Beibu Gulf Port Co., Ltd. engages in the operation and management of Guangxi Beibu Gulf Port in China. The company offers port handling, storage, and shipping port services, as well as engages in other business. Its cargo goods categories include container, coal, ore, grain, metallic ore, and others. The company was formerly known as Beibuwan port Co., ltd. Beibu Gulf Port Co., Ltd. was founded in 1989 and is based in Beihai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beihai",
        "zipcode": "536000",
        "website": "http://www.bbwport.cn",
        "full_time_employees": 7509
    },
    "000905.SZ": {
        "short_name": "XIAMEN PORT DEV",
        "long_name": "Xiamen Port Development Co., Ltd.",
        "summary": "Xiamen Port Development Co., Ltd., together with its subsidiaries, provides bulk cargo terminal loading and unloading, and integrated logistics services in China. The company also offers shipping agency, bulk cargo handling, L/E consolidation, tally notarization, warehousing, transportation, sea-rail transportation, and land port services, as well as trades in building materials, chemical raw materials and products, mineral products, machinery and equipment, hardware and electronics, textiles, clothing and daily necessities, agricultural and livestock products, stationery, sporting goods and equipment, arts and crafts, etc. In addition, it is involved in the tugboat business; production and sale of concrete and additives; and trading of commodity activities. The company was formerly known as Xiamen Road and Bridge Corporation and changed its name to Xiamen Port Development Co., Ltd. in November 2004. The company was founded in 1999 and is based in Xiamen, China. Xiamen Port Development Co., Ltd. is a subsidiary of Xiamen International Port Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.xmgw.com.cn",
        "full_time_employees": null
    },
    "002320.SZ": {
        "short_name": "HAINAN STRAIT SHIP",
        "long_name": "Hainan Strait Shipping Co.,Ltd.",
        "summary": "Hainan Strait Shipping Co.,Ltd. engages in the sea passenger transportation business in China. The company was founded in 2002 and is based in Haikou, China. Hainan Strait Shipping Co.,Ltd. is a subsidiary of Hainan Port and Waterway Holding Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Haikou",
        "zipcode": "570311",
        "website": "http://www.hnss.net.cn",
        "full_time_employees": 1077
    },
    "002930.SZ": {
        "short_name": "GUANGDONG GREAT RI",
        "long_name": "Guangdong Great River Smarter Logistics Co., Ltd.",
        "summary": "Guangdong Great River Smarter Logistics Co., Ltd., a logistics company, provides warehousing and other related services for petrochemical product manufacturers, traders, and end users in China and internationally. Its services include loading and unloading, warehousing, transfer, and logistics chain management. The company was founded in 2012 and is based in Dongguan City, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523000",
        "website": "http://www.grsl.cc",
        "full_time_employees": 1043
    },
    "2880.HK": {
        "short_name": "LIAONING PORT",
        "long_name": "Liaoning Port Co.,Ltd.",
        "summary": "Liaoning Port Co., Ltd., together with its subsidiaries, provides port and logistics services in Mainland China. The company offers oil/liquefied chemicals terminal and related logistics, and trading services for loading and discharging, storage, and transshipment of oil products and liquefied chemicals; and port management services. It also provides container terminal and related logistics services for loading and discharging, storage, and transshipment of containers; and various container logistics services, as well as leases terminals and sells properties. In addition, the company offers bulk and general cargo terminal and related logistics services for loading and discharging general cargo and ore, as well as trades in steel. Further, it provides bulk grains terminal, and related logistics and trading services for loading and discharging of grains and trades in unprocessed grains; passenger, roll-on and roll-off terminal, and related logistics services; and port value-added and related ancillary services, including tallying, tugging, transportation, power supply, information technology, and construction. Additionally, the company offers automobile terminal, and related logistics and trading services for loading and discharging automobile. Liaoning Port Co., Ltd. was formerly known as Dalian Port (PDA) Company Limited and changed its name to Liaoning Port Co., Ltd. in January 2021. Liaoning Port Co., Ltd. was founded in 2005 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116001",
        "website": "http://www.liaoganggf.cn",
        "full_time_employees": 6152
    },
    "3369.HK": {
        "short_name": "QHD PORT",
        "long_name": "Qinhuangdao Port Co., Ltd.",
        "summary": "Qinhuangdao Port Co., Ltd. operates ports in Mainland China. The Company provides highly integrated port services, including stevedoring, stacking, warehousing, transportation, and logistics services; and handles various types of cargoes primarily comprising coal, metal ores, oil and liquefied chemicals, containers, general cargoes, and other goods. It also provides ancillary port services, such as tugging, tallying, trans-shipping, and shipping agency. In addition, the company offers value-added services consisting of towing, tallying, and coal blending, as well as tariff-free warehouse and export supervisory warehouse services; and loading and unloading, port investment, and international trade services, as well as sells accessories. It operates 23 coal berths, 7 oil and liquefied chemical berths, 17 general cargo berths, and 3 container berths in Qinhuangdao Port; 4 ore berths and two general bulk berths in Caofeidian Port; and 2 general bulk berths, 2 general cargo berths, 4 multi-purpose berths, and two ore berths in Huanghua port. The company was founded in 1898 and is headquartered in Qinhuangdao, China. Qinhuangdao Port Co., Ltd. is a subsidiary of Hebei Port Group Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Qinhuangdao",
        "zipcode": "066002",
        "website": "http://www.portqhd.com",
        "full_time_employees": 11235
    },
    "600017.SS": {
        "short_name": "RIZHAO PORT CO LTD",
        "long_name": "Rizhao Port Co., Ltd.",
        "summary": "Rizhao Port Co., Ltd. provides cargo handling and storage services in China. It is involved in the handling and storage of ore, coal, cement, nickel ore, aluminum, vanadium, steel, coke, grain, wood chips, and other bulk cargoes, as well as crude oil, liquid chemicals, and containers. The company is based in Rizhao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Rizhao",
        "zipcode": "276826",
        "website": "http://www.rzport.com",
        "full_time_employees": 5581
    },
    "600190.SS": {
        "short_name": "JINZHOU PORT CO. LTD.",
        "long_name": "Jinzhou Port Co., Ltd.",
        "summary": "Jinzhou Port Co., Ltd. operates the Jinzhou Port in Liaoning province, China. Its port has 27 berths, including a 300,000-ton oil berth, 100,000-ton bulk cargo berths, and 100,000-ton container specific berths. The company handles oil, grain, building materials, metal ore, steel, coal, and containers. It offers port management, port loading and unloading, water transportation auxiliary industry, road transportation; grain acquisition; grain wholesale; metal materials, mineral powder, coal sales; wholesale oil products; material storage; domestic ship agents, cargo agents; and international trade and re-export trade services. Jinzhou Port Co., Ltd. is based in Jinzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinzhou",
        "zipcode": "121007",
        "website": "http://www.jinzhouport.com",
        "full_time_employees": 1578
    },
    "600279.SS": {
        "short_name": "CHONGQING GANGJIU",
        "long_name": "Chongqing Gangjiu Co.,Ltd",
        "summary": "Chongqing Gangjiu Co.,Ltd provides cargo handling services primarily in China. The company offers logistics consulting, logistics planning, ship generation, freight forwarding, port loading and unloading, land and water transfer, inland river passenger and cargo transportation, container transit transportation, warehousing, distribution and other integrated logistics, and shipment services. It also provides passenger and cargo transport, inland freight, goods handling, materials, goods storage, container, and other services. In addition, the company offers commodity storage, ship repair, and charge d'affaires transport and transit services, In addition, the company engages in the sales of automobiles, electrical machinery and equipment, chemical raw materials and products, building materials, rubber products, wood and products, and arts and crafts; operations of department stores; import and export of goods; and manufacture of general machinery and ship parts. Chongqing Gangjiu Co.,Ltd is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Chongqing",
        "zipcode": "400023",
        "website": "http://www.cqgj.com.cn",
        "full_time_employees": 2553
    },
    "600428.SS": {
        "short_name": "COSCO SHIPPING SPECIALIZED CARR",
        "long_name": "COSCO SHIPPING Specialized Carriers Co.,Ltd.",
        "summary": "COSCO SHIPPING Specialized Carriers Co., Ltd. operates as a shipping company. It operates and manages approximately 100 vessels, including multi-purpose and heavy lift vessels, semi-submersible vessels, pure car carriers, logs carriers, and asphalt carriers. The company also transports cargoes, such as RIGs, engineering vessels, port machinery, locomotives, windmills, bridge cranes, equipment, etc. In addition, it provides liner shipping services on various trade routes, including the Far East-Southeast Asia/India, Far East-Mediterranean Sea/Europe, Far East-Persian Gulf/Red Sea, Far East-Africa, Far East-America, and Far East-Australia. The company was formerly known as Guangzhou Ocean Shipping Co., Ltd. COSCO SHIPPING Specialized Carriers Co., Ltd. was founded in 1961 and is based in Guangzhou, China. COSCO SHIPPING Specialized Carriers Co., Ltd. is a subsidiary of China Ocean Shipping Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "510623",
        "website": "http://spe.coscoshipping.com",
        "full_time_employees": 3906
    },
    "600794.SS": {
        "short_name": "ZHANGJIAGANG FREETRADE SCIENCE&",
        "long_name": "Zhangjiagang Freetrade Science & Technology Group Co., Ltd.",
        "summary": "Zhangjiagang Freetrade Science & Technology Group Co., Ltd., through its subsidiaries, operates in port terminal business in China. It is involved in the chemical warehousing, and trading and logistics business. The company was formerly known as Zhangjiagang Freetrade Science and Technology Co., Ltd. and changed its name to Zhangjiagang Freetrade Science & Technology Group Co., Ltd. in June 2017. Zhangjiagang Freetrade Science & Technology Group Co., Ltd. was founded in 1993 and is based in Suzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Suzhou",
        "zipcode": "215634",
        "website": "http://www.zftc.net",
        "full_time_employees": 487
    },
    "601000.SS": {
        "short_name": "TANGSHAN PORT GROUP CO LTD",
        "long_name": "TangShan Port Group Co.,Ltd",
        "summary": "TangShan Port Group Co.,Ltd invests, constructs, and operates Jingtang port in China. It provides loading, unloading, and stockpiling of bulk cargo, such as ore, coking coal, coal, steel, machinery and equipment, and fine steel products; port loading, unloading, and warehousing services for industrialized chemicals and oil products, sea-land transit transportation, and warehousing companies; and land anchoring, ship escorting, ship detachment, ship emergency rescue, sea pick-up personnel, and other services, as well as assists in and out of the ship to leave the dock. The company is also involved in the equipment maintenance, mechanical processing and manufacturing, ship repair, ship pollutant reception, and technical consulting activities; provision of services for ships, including ship food, materials, fresh water, ship fuel, marine lubricants, marine materials recycling, taxi services, etc.; import and export of bulk products; and port construction and container sale activities. In addition, it offers railway freight transportation services; trade liner services; foreign trade route development and other services; and operates trade ship agency, trade cargo agency, and housing information agency. Further, the company engages in residential and office building property management, sanitary cleaning, house leasing, boiler air conditioning management, canteen, and apartment management activities; and coal business. The company was formerly known as Jingtang Port Co., Ltd. and changed its name to TangShan Port Group Co.,Ltd in March 2008. TangShan Port Group Co.,Ltd was founded in 2002 and is based in Tangshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tangshan",
        "zipcode": "063611",
        "website": "http://www.jtport.com.cn",
        "full_time_employees": 3853
    },
    "601008.SS": {
        "short_name": "JIANGSU LIANYUNGANG PORT CO. LT",
        "long_name": "Jiangsu Lianyungang Port Co., Ltd.",
        "summary": "Jiangsu Lianyungang Port Co., Ltd. engages in the port operations in China. It is involved in the containers, iron ore, grain, liquid chemicals, and bulk cargo handling activities; passenger, cargo liner, and multimodal transportation activities; commercial pledge financing activities; and coke futures delivery and other activities. The company also imports alumina and aluminum ingots, and non-ferrous ores; and exports plywood, coke, and automobiles for use in the construction machinery, as well as provides logistics services. It owns and controls 30 deep hydration berths. Jiangsu Lianyungang Port Co., Ltd. was founded in 2001 and is based in Lianyungang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Lianyungang",
        "zipcode": "222042",
        "website": "http://www.jlpcl.com",
        "full_time_employees": 3198
    },
    "601018.SS": {
        "short_name": "NINGBO ZHOUSHAN PORT CO LTD",
        "long_name": "Ningbo Zhoushan Port Company Limited",
        "summary": "Ningbo Zhoushan Port Company Limited engages in the port operation. Its terminal functions include container terminal facilities; iron ore transit transportation system; crude oil terminal; liquid chemical raw material collection base; coal transit and storage base; and cruise terminal services. The company also offers port services, such as pilotage, tugboat parking and berthing, freight forwarding, and cargo handling, including container ship tally, container loading and unpacking, cargo measurement, and cargo damage and verification services. In addition, it provides sea-rail transport logistics, booking and customs declaration, inspection, supervision, and other services; and consolidation, distribution, storage, and warehousing services, as well as issues bills of lading. The company was formerly known as Ningbo Port Co., Ltd. and changed its name of Ningbo Zhoushan Port Company Limited in August 2016. The company was founded in 2008 and is based in Ningbo, China. Ningbo Zhoushan Port Company Limited is a subsidiary of Ningbo Zhoushan Port Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315040",
        "website": "http://www.nbport.com.cn",
        "full_time_employees": 17790
    },
    "601298.SS": {
        "short_name": "QINGDAO PORT INTERNATIONAL CO L",
        "long_name": "Qingdao Port International Co., Ltd.",
        "summary": "Qingdao Port International Co., Ltd. operates the Port of Qingdao. It operates in six segments: Container Handling and Ancillary Services; Metal Ores, Coal and Other Cargo Handling and Ancillary Services; Liquid Bulk Handling and Ancillary Services; Logistics and Port Value-Added Services; Port Ancillary Services; and Financial Services. The company is involved in the loading and discharging of containers, metal ores, coal, grains, and break bulk and liquid bulk cargos, as well as other general cargo, including iron and steel, vehicles, machinery and equipment, fertilizer, chemicals, timber, pulp, and frozen goods. It also provides storage services; and port management, container freight station, cargo logistics, agency, towing, tallying, facilities construction, trucking, agency and clearance, bonded area, dry port, and trade facilitation services. In addition, the company manufactures port related equipment; and supplies electricity power, fuel, and other products. Further, it offers tallying, tugging, and barging; container-related services consisting of container vanning and de-vanning; processing services comprising sifting, washing, and blending of metal ore and coal; and sorting and re-packing of other general cargo. Additionally, the company provides financial products and services comprising deposit taking, guarantee, insurance agency, and investment and financial management services, as well as corporate loans; and shipping repair and agency, engineering and construction, cargo and trade agency, engineering design, technology, property management, media, lightering, oil pipeline transportation, check and inspection, and environmental technology services. It also engages in LNG operations. As of December 31, 2020, it operated 90 berths at the Port of Qingdao. The company was incorporated in 2013 and is headquartered in Qingdao, the People's Republic of China. Qingdao Port International Co., Ltd. is a subsidiary of Qingdao Port (Group) Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266011",
        "website": "http://www.qingdao-port.com",
        "full_time_employees": 8981
    },
    "601326.SS": {
        "short_name": "QINHUANGDAO PORT CO LTD",
        "long_name": "Qinhuangdao Port Co., Ltd.",
        "summary": "Qinhuangdao Port Co., Ltd. operates ports in Mainland China. The Company provides highly integrated port services, including stevedoring, stacking, warehousing, transportation, and logistics services; and handles various types of cargoes primarily comprising coal, metal ores, oil and liquefied chemicals, containers, general cargoes, and other goods. It also provides ancillary port services, such as tugging, tallying, trans-shipping, and shipping agency. In addition, the company offers value-added services consisting of towing, tallying, and coal blending, as well as tariff-free warehouse and export supervisory warehouse services; and loading and unloading, port investment, and international trade services, as well as sells accessories. It operates 23 coal berths, 7 oil and liquefied chemical berths, 17 general cargo berths, and 3 container berths in Qinhuangdao Port; 4 ore berths and two general bulk berths in Caofeidian Port; and 2 general bulk berths, 2 general cargo berths, 4 multi-purpose berths, and two ore berths in Huanghua port. The company was founded in 1898 and is headquartered in Qinhuangdao, China. Qinhuangdao Port Co., Ltd. is a subsidiary of Hebei Port Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Qinhuangdao",
        "zipcode": "066002",
        "website": "http://www.portqhd.com",
        "full_time_employees": 11235
    },
    "601880.SS": {
        "short_name": "LIAONING PORT CO LTD",
        "long_name": "Liaoning Port Co.,Ltd.",
        "summary": "Liaoning Port Co., Ltd., together with its subsidiaries, provides port and logistics services in Mainland China. The company offers oil/liquefied chemicals terminal and related logistics, and trading services for loading and discharging, storage, and transshipment of oil products and liquefied chemicals; and port management services. It also provides container terminal and related logistics services for loading and discharging, storage, and transshipment of containers; and various container logistics services, as well as leases terminals and sells properties. In addition, the company offers bulk and general cargo terminal and related logistics services for loading and discharging general cargo and ore, as well as trades in steel. Further, it provides bulk grains terminal, and related logistics and trading services for loading and discharging of grains and trades in unprocessed grains; passenger, roll-on and roll-off terminal, and related logistics services; and port value-added and related ancillary services, including tallying, tugging, transportation, power supply, information technology, and construction. Additionally, the company offers automobile terminal, and related logistics and trading services for loading and discharging automobile. Liaoning Port Co., Ltd. was formerly known as Dalian Port (PDA) Company Limited and changed its name to Liaoning Port Co., Ltd. in January 2021. Liaoning Port Co., Ltd. was founded in 2005 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116001",
        "website": "http://www.liaoganggf.cn",
        "full_time_employees": 6152
    },
    "601919.SS": {
        "short_name": "COSCO SHIPPING HOLDINGS",
        "long_name": "COSCO SHIPPING Holdings Co., Ltd.",
        "summary": "COSCO SHIPPING Holdings Co., Ltd., an investment holding company, engages in the container shipping, container terminals, and other businesses in the United States, Europe, the Asia Pacific, Mainland China, and internationally. The company operates through Container Shipping Business, Container Terminal Business, and Corporate and Other Operations segments. It offers container transportation, container stack, cargo storage, freight forwarding and transportation, logistics, vessel chartering, marine, document, vessel management and manning, shipping lines, vessel owning, and other international sea transportation services, as well as operates shipping and liner agencies. The company also provides technology services and solutions; and designs and manufactures computer software. As of December 31, 2020, it operated a fleet of 536 container vessels with a total shipping capacity of 3,073,684 TEUs. The company was formerly known as China COSCO Holdings Company Limited and changed its name to COSCO SHIPPING Holdings Co., Ltd. in November 2016. COSCO SHIPPING Holdings Co., Ltd. was incorporated in 2005 and is based in Shanghai, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://hold.coscoshipping.com",
        "full_time_employees": 29379
    },
    "603117.SS": {
        "short_name": "JIANGSU WANLIN MODERN LOGISTICS",
        "long_name": "Jiangsu Wanlin Modern Logistics Co., Ltd.",
        "summary": "Jiangsu Wanlin Modern Logistics Co., Ltd. provides wood logistics and wood import agency services in China and internationally. The company offers wood agency procurement logistics services; shipping agency, customs clearance, inspection declaration, agency charter booking, insurance, freight forwarding services, etc.; port loading and unloading stockpiling logistics services; and warehousing and logistics services. It also provides wood processing and logistics services; professional logistic information services; and wood drying, material fumigation, and recycled process waste reuse services. The company was founded in 2011 and is based in Jingjiang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jingjiang",
        "zipcode": "214500",
        "website": "http://www.china-wanlin.com",
        "full_time_employees": 598
    },
    "603167.SS": {
        "short_name": "BOHAI FERRY CO LTD",
        "long_name": "Bohai Ferry Group Co., Ltd.",
        "summary": "Bohai Ferry Group Co., Ltd. engages in water transportation business in China. It is also involved in the ticketing, cruise travel, ship leasing, freight transportation, and finance lease businesses. The company was formerly known as Shandong Bohai Ferry Co., Ltd. Bohai Ferry Group Co., Ltd. was founded in 1998 and is headquartered in Yantai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": null,
        "website": "http://www.bohailundu.cn",
        "full_time_employees": null
    },
    "6117.HK": {
        "short_name": "RIZHAO PORT JR",
        "long_name": "Rizhao Port Jurong Co., Ltd.",
        "summary": "Rizhao Port Jurong Co., Ltd. engages in the port operations in Rizhao, the People's Republic of China. It provides port-related services, including stevedoring, berth leasing, port management, storage, and logistics agency services, as well as primarily handles soybeans, woodchips, dried tapioca, and other cargo types, including maize and wheat. The company was founded in 1986 and is headquartered in Rizhao, the Peoples Republic of China. Rizhao Port Jurong Co., Ltd. is a subsidiary of Rizhao Port Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Rizhao",
        "zipcode": null,
        "website": "http://www.rzportjurong.com",
        "full_time_employees": 329
    },
    "6198.HK": {
        "short_name": "QINGDAO PORT",
        "long_name": "Qingdao Port International Co., Ltd.",
        "summary": "Qingdao Port International Co., Ltd. operates the Port of Qingdao. It operates in six segments: Container Handling and Ancillary Services; Metal Ores, Coal and Other Cargo Handling and Ancillary Services; Liquid Bulk Handling and Ancillary Services; Logistics and Port Value-Added Services; Port Ancillary Services; and Financial Services. The company is involved in the loading and discharging of containers, metal ores, coal, grains, and break bulk and liquid bulk cargos, as well as other general cargo, including iron and steel, vehicles, machinery and equipment, fertilizer, chemicals, timber, pulp, and frozen goods. It also provides storage services; and port management, container freight station, cargo logistics, agency, towing, tallying, facilities construction, trucking, agency and clearance, bonded area, dry port, and trade facilitation services. In addition, the company manufactures port related equipment; and supplies electricity power, fuel, and other products. Further, it offers tallying, tugging, and barging; container-related services consisting of container vanning and de-vanning; processing services comprising sifting, washing, and blending of metal ore and coal; and sorting and re-packing of other general cargo. Additionally, the company provides financial products and services comprising deposit taking, guarantee, insurance agency, and investment and financial management services, as well as corporate loans; and shipping repair and agency, engineering and construction, cargo and trade agency, engineering design, technology, property management, media, lightering, oil pipeline transportation, check and inspection, and environmental technology services. It also engages in LNG operations. As of December 31, 2020, it operated 90 berths at the Port of Qingdao. The company was incorporated in 2013 and is headquartered in Qingdao, the People's Republic of China. Qingdao Port International Co., Ltd. is a subsidiary of Qingdao Port (Group) Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Qingdao",
        "zipcode": "266011",
        "website": "http://www.qingdao-port.com",
        "full_time_employees": 8981
    },
    "900952.SS": {
        "short_name": "JINZHOU PORT CO. LTD.",
        "long_name": "Jinzhou Port Co., Ltd.",
        "summary": "Jinzhou Port Co., Ltd. operates the Jinzhou Port in Liaoning province, China. Its port has 27 berths, including a 300,000-ton oil berth, 100,000-ton bulk cargo berths, and 100,000-ton container specific berths. The company handles oil, grain, building materials, metal ore, steel, coal, and containers. It offers port management, port loading and unloading, water transportation auxiliary industry, road transportation; grain acquisition; grain wholesale; metal materials, mineral powder, coal sales; wholesale oil products; material storage; domestic ship agents, cargo agents; and international trade and re-export trade services. Jinzhou Port Co., Ltd. is based in Jinzhou, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Jinzhou",
        "zipcode": "121007",
        "website": "http://www.jinzhouport.com",
        "full_time_employees": 1578
    },
    "C6G.F": {
        "short_name": "COSCO SHIP.HLDG.CO.H YC 1",
        "long_name": "COSCO SHIPPING Holdings Co., Ltd.",
        "summary": "COSCO SHIPPING Holdings Co., Ltd., an investment holding company, engages in the container shipping, container terminals, and other businesses in the United States, Europe, the Asia Pacific, Mainland China, and internationally. The company operates through Container Shipping Business, Container Terminal Business, and Corporate and Other Operations segments. It offers container transportation, container stack, cargo storage, freight forwarding and transportation, logistics, vessel chartering, marine, document, vessel management and manning, shipping lines, vessel owning, and other international sea transportation services, as well as operates shipping and liner agencies. The company also provides technology services and solutions; and designs and manufactures computer software. As of December 31, 2020, it operated a fleet of 536 container vessels with a total shipping capacity of 3,073,684 TEUs. The company was formerly known as China COSCO Holdings Company Limited and changed its name to COSCO SHIPPING Holdings Co., Ltd. in November 2016. COSCO SHIPPING Holdings Co., Ltd. was incorporated in 2005 and is based in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://hold.coscoshipping.com",
        "full_time_employees": 29379
    },
    "CICOF": {
        "short_name": "COSCO SHIPPING HOLDINGS",
        "long_name": "COSCO SHIPPING Holdings Co., Ltd.",
        "summary": "COSCO SHIPPING Holdings Co., Ltd., an investment holding company, engages in the container shipping, container terminals, and other businesses in the United States, Europe, the Asia Pacific, Mainland China, and internationally. The company operates through Container Shipping Business, Container Terminal Business, and Corporate and Other Operations segments. It offers container transportation, container stack, cargo storage, freight forwarding and transportation, logistics, vessel chartering, marine, document, vessel management and manning, shipping lines, vessel owning, and other international sea transportation services, as well as operates shipping and liner agencies. The company also provides technology services and solutions; and designs and manufactures computer software. As of December 31, 2020, it operated a fleet of 536 container vessels with a total shipping capacity of 3,073,684 TEUs. The company was formerly known as China COSCO Holdings Company Limited and changed its name to COSCO SHIPPING Holdings Co., Ltd. in November 2016. COSCO SHIPPING Holdings Co., Ltd. was incorporated in 2005 and is based in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://hold.coscoshipping.com",
        "full_time_employees": 29379
    },
    "CICOY": {
        "short_name": "COSCO SHIPPING HOLDINGS",
        "long_name": "COSCO SHIPPING Holdings Co., Ltd.",
        "summary": "COSCO SHIPPING Holdings Co., Ltd., an investment holding company, engages in the container shipping, container terminals, and other businesses in the United States, Europe, the Asia Pacific, Mainland China, and internationally. The company operates through Container Shipping Business, Container Terminal Business, and Corporate and Other Operations segments. It offers container transportation, container stack, cargo storage, freight forwarding and transportation, logistics, vessel chartering, marine, document, vessel management and manning, shipping lines, vessel owning, and other international sea transportation services, as well as operates shipping and liner agencies. The company also provides technology services and solutions; and designs and manufactures computer software. As of December 31, 2020, it operated a fleet of 536 container vessels with a total shipping capacity of 3,073,684 TEUs. The company was formerly known as China COSCO Holdings Company Limited and changed its name to COSCO SHIPPING Holdings Co., Ltd. in November 2016. COSCO SHIPPING Holdings Co., Ltd. was incorporated in 2005 and is based in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://hold.coscoshipping.com",
        "full_time_employees": 29379
    },
    "CSDXF": {
        "short_name": "COSCO SHIPPING ENGY TPT CO LTD",
        "long_name": "COSCO SHIPPING Energy Transportation Co., Ltd.",
        "summary": "COSCO SHIPPING Energy Transportation Co., Ltd., an investment holding company, engages in the shipment of oil, liquefied natural gas (LNG), and chemicals along the coast of the People's Republic of China and internationally. It operates in Oil Shipment, LNG, and Others segments. The company also engages in the chartering of vessels; shipment of liquefied petroleum gas; and provision of shipping agency services. As of December 31, 2020, it owned 160 oil tankers with a total capacity of 23.72 million deadweight tons (DWT), including 150 self-owned oil tankers with a capacity of 20.97 million DWT, 10 chartered-in oil tankers with a capacity of 2.75 million DWT, and 7 oil tankers with a capacity of 1.315 million DWT; and 41 jointly-invested LNG vessels, which includes 38 LNG vessels in operation with an aggregate capacity of 6,420,000 cubic meters and 3 LNG vessels under construction with an aggregate capacity of 522,000 cubic meters. The company was formerly known as China Shipping Development Company Limited and changed its name to COSCO SHIPPING Energy Transportation Co., Ltd. in October 2016. COSCO SHIPPING Energy Transportation Co., Ltd. was founded in 1994 and is based in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://energy.coscoshipping.com",
        "full_time_employees": 7398
    },
    "D7P.F": {
        "short_name": "LIAONING PORT  H  YC 1",
        "long_name": "Liaoning Port Co.,Ltd.",
        "summary": "Liaoning Port Co., Ltd., together with its subsidiaries, provides port and logistics services in Mainland China. The company offers oil/liquefied chemicals terminal and related logistics, and trading services for loading and discharging, storage, and transshipment of oil products and liquefied chemicals; and port management services. It also provides container terminal and related logistics services for loading and discharging, storage, and transshipment of containers; and various container logistics services, as well as leases terminals and sells properties. In addition, the company offers bulk and general cargo terminal and related logistics services for loading and discharging general cargo and ore, as well as trades in steel. Further, it provides bulk grains terminal, and related logistics and trading services for loading and discharging of grains and trades in unprocessed grains; passenger, roll-on and roll-off terminal, and related logistics services; and port value-added and related ancillary services, including tallying, tugging, transportation, power supply, information technology, and construction. Additionally, the company offers automobile terminal, and related logistics and trading services for loading and discharging automobile. Liaoning Port Co., Ltd. was formerly known as Dalian Port (PDA) Company Limited and changed its name to Liaoning Port Co., Ltd. in January 2021. Liaoning Port Co., Ltd. was founded in 2005 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116001",
        "website": "http://www.liaoganggf.cn",
        "full_time_employees": 6152
    },
    "DLPTF": {
        "short_name": "LIAONING PORT CO LTD",
        "long_name": "Liaoning Port Co.,Ltd.",
        "summary": "Liaoning Port Co., Ltd., together with its subsidiaries, provides port and logistics services in Mainland China. The company offers oil/liquefied chemicals terminal and related logistics, and trading services for loading and discharging, storage, and transshipment of oil products and liquefied chemicals; and port management services. It also provides container terminal and related logistics services for loading and discharging, storage, and transshipment of containers; and various container logistics services, as well as leases terminals and sells properties. In addition, the company offers bulk and general cargo terminal and related logistics services for loading and discharging general cargo and ore, as well as trades in steel. Further, it provides bulk grains terminal, and related logistics and trading services for loading and discharging of grains and trades in unprocessed grains; passenger, roll-on and roll-off terminal, and related logistics services; and port value-added and related ancillary services, including tallying, tugging, transportation, power supply, information technology, and construction. Additionally, the company offers automobile terminal, and related logistics and trading services for loading and discharging automobile. Liaoning Port Co., Ltd. was formerly known as Dalian Port (PDA) Company Limited and changed its name to Liaoning Port Co., Ltd. in January 2021. Liaoning Port Co., Ltd. was founded in 2005 and is headquartered in Dalian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Dalian",
        "zipcode": "116001",
        "website": "http://www.liaoganggf.cn",
        "full_time_employees": 6152
    },
    "EZ5.F": {
        "short_name": "COSCO SHIPPING DEV.H YC 1",
        "long_name": "COSCO SHIPPING Development Co., Ltd.",
        "summary": "COSCO SHIPPING Development Co., Ltd., together with its subsidiaries, provides vessel chartering and container leasing services. The company manufactures and sells containers; and offers operating leasing, equity or debt investment, insurance brokerage, and cargo and liner agency services, as well as financial leasing services in the areas of medical services, education, new energy, and construction and industrial equipment. It also offers container management, management, property investment, trading, and commercial factoring services. As of December 31, 2020, the company had a container fleet of 77 vessels with a total capacity of 500,587 TEU; 5 bulk cargo vessels of 466,900 DWT each; 2 wood pulp carriers with a total capacity of 123,900 DWT; approximately 90 LNG vessels, heavy crane vessels, and oil tankers; and an inventory of containers of approximately 3.78 million TEU. It operates in Hong Kong, Mainland China, rest of Asia, the United States, Europe, and internationally. The company was formerly known as China Shipping Container Lines Company Limited and changed its name to COSCO SHIPPING Development Co., Ltd. in December 2016. COSCO SHIPPING Development Co., Ltd. was founded in 1997 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": null,
        "website": "http://development.coscoshipping.com",
        "full_time_employees": 7964
    },
    "HIFH.F": {
        "short_name": "COSCO SHIP.ENER.TRAN.CO.H",
        "long_name": "COSCO SHIPPING Energy Transportation Co., Ltd.",
        "summary": "COSCO SHIPPING Energy Transportation Co., Ltd., an investment holding company, engages in the shipment of oil, liquefied natural gas (LNG), and chemicals along the coast of the People's Republic of China and internationally. It operates in Oil Shipment, LNG, and Others segments. The company also engages in the chartering of vessels; shipment of liquefied petroleum gas; and provision of shipping agency services. As of December 31, 2020, it owned 160 oil tankers with a total capacity of 23.72 million deadweight tons (DWT), including 150 self-owned oil tankers with a capacity of 20.97 million DWT, 10 chartered-in oil tankers with a capacity of 2.75 million DWT, and 7 oil tankers with a capacity of 1.315 million DWT; and 41 jointly-invested LNG vessels, which includes 38 LNG vessels in operation with an aggregate capacity of 6,420,000 cubic meters and 3 LNG vessels under construction with an aggregate capacity of 522,000 cubic meters. The company was formerly known as China Shipping Development Company Limited and changed its name to COSCO SHIPPING Energy Transportation Co., Ltd. in October 2016. COSCO SHIPPING Energy Transportation Co., Ltd. was founded in 1994 and is based in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200080",
        "website": "http://energy.coscoshipping.com",
        "full_time_employees": 7398
    },
    "QHD.F": {
        "short_name": "QINHUANGDAO PORT  H YC 1",
        "long_name": "Qinhuangdao Port Co., Ltd.",
        "summary": "Qinhuangdao Port Co., Ltd. operates ports in Mainland China. The Company provides highly integrated port services, including stevedoring, stacking, warehousing, transportation, and logistics services; and handles various types of cargoes primarily comprising coal, metal ores, oil and liquefied chemicals, containers, general cargoes, and other goods. It also provides ancillary port services, such as tugging, tallying, trans-shipping, and shipping agency. In addition, the company offers value-added services consisting of towing, tallying, and coal blending, as well as tariff-free warehouse and export supervisory warehouse services; and loading and unloading, port investment, and international trade services, as well as sells accessories. It operates 23 coal berths, 7 oil and liquefied chemical berths, 17 general cargo berths, and 3 container berths in Qinhuangdao Port; 4 ore berths and two general bulk berths in Caofeidian Port; and 2 general bulk berths, 2 general cargo berths, 4 multi-purpose berths, and two ore berths in Huanghua port. The company was founded in 1898 and is headquartered in Qinhuangdao, China. Qinhuangdao Port Co., Ltd. is a subsidiary of Hebei Port Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Qinhuangdao",
        "zipcode": "066002",
        "website": "http://www.portqhd.com",
        "full_time_employees": 11235
    },
    "XRG.F": {
        "short_name": "XIAMEN INTL PORT H  YC 1",
        "long_name": "Xiamen International Port Co., Ltd",
        "summary": "Xiamen International Port Co., Ltd operates port terminals primarily in Xiamen, the People's Republic of China. It operates through Container Loading and Unloading and Storage Business; Bulk/General Cargo Loading and Unloading Business; Comprehensive Port Logistic Services; Manufacturing and Selling of Building Materials; and Merchandise Trading Business segments. It engages in the container, bulk, and general cargo loading, unloading, and storage businesses, as well as provides port comprehensive logistics services comprising port-related logistics, tugboat berthing and unberthing, shipping agency, and tallying services; manufactures, processes, and sells building materials; and trades in merchandise, including steel and chemical raw materials. It also offers container deposit, land transport, logistics management, national and international freight agency services; operates and manages equipment at the transformer substation; repairs, maintains, cleans, and renovates containers; commodity export agency and sales services; and stacking and storage management, container packing and unpacking, and storage and container cargo inspection services. It is involved in the construction of roads; and long term investment and development business. It offers agency services for import and export of products, technology, international and domestic agency services, and international air transportation; and keeping, warehousing and labour services. It provides freight forwarding, warehousing, port supporting, packing and processing, logistics and distribution, customs declaration, and logistics information consulting services; and engages in the wholesale of pre-packaged food. It owns and operates 35 berths for containers, and bulk and general cargo of international and domestic trade. The company was founded in 1998 and is based in Xiamen, the People's Republic of China. Xiamen International Port Co., Ltd is a subsidiary of Xiamen Port Holding Group Co., Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "state": null,
        "city": "Xiamen",
        "zipcode": null,
        "website": "http://www.xipc.com.cn",
        "full_time_employees": 7082
    }
}