{
  "000415.SZ": {
    "city": "Xinjiang",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHZ",
    "industry": "Rental & Leasing Services",
    "long_name": "Bohai Leasing Co., Ltd.",
    "market": "cn_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "BOHAI LEASING CO",
    "state": null,
    "summary": "Bohai Leasing Co., Ltd., together with its subsidiaries, operates as a leasing company in the People's Republic of China. The company offers leasing services for aircraft, containers, infrastructure and real estate, high-end equipment, ships and maritime equipment, and new energy vehicles. It also provides insurance, securities, and Internet financing services. The company was formerly known as Bohai Capital Holding Co., Ltd. and changed its name to Bohai Leasing Co., Ltd. in November 2018. Bohai Leasing Co., Ltd. Was founded in 1993 and is based in Beijing, China.",
    "website": "http://www.bohaiholding.com",
    "zipcode": "100125"
  },
  "603300.SS": {
    "city": "Hangzhou",
    "country": "China",
    "currency": "CNY",
    "exchange": "SHH",
    "industry": "Rental & Leasing Services",
    "long_name": "Zhejiang Huatie Emergency Equipment Science & Technology Co.,Ltd.",
    "market": "cn_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "ZHEJIANG HUATIE EMERGENCY EQUIP",
    "state": null,
    "summary": "Zhejiang Huatie Emergency Equipment Science & Technology Co.,Ltd. engages in the rental of construction equipment in China. The company leases various steel support, bailey, bowl buckle, steel, and other security support equipment; professional construction safety support equipment for urban rail construction, civil construction, etc.; and multi-functional scaffoldings and steel pipes, fasteners, and wheeled scaffolding. It also provides stress monitoring systems for construction safety; and optimization design, maintenance, and other business services. In addition, the company offers deep foundation pit support stress testing equipment, as well as development of building support technology, building construction safety maintenance services, and deep foundation pit support stress testing equipment design, installation, and repair services. Its products are used in the construction of buildings, viaducts, overpasses, highways, railways, bridges, power plants, and other projects. The company was formerly known as Zhejiang Huatie Construction Safety Science and Technology Co., Ltd. and changed its name to Zhejiang Huatie Emergency Equipment Science & Technology Co.,Ltd. in September 2019. Zhejiang Huatie Emergency Equipment Science & Technology Co.,Ltd. was founded in 2008 and is headquartered in Hangzhou, China.",
    "website": "http://www.zjhuatie.cn",
    "zipcode": "310019"
  }
}
