{
    "002150.SZ": {
        "short_name": "JIANGSU TONGRUN EQ",
        "long_name": "Jiangsu Tongrun Equipment Technology Co.,Ltd",
        "summary": "Jiangsu Tongrun Equipment Technology Co.,Ltd produces and sells metal tool cabinets in China. It offers precision sheet metal parts, photo-voltaic inverters, electrical control cabinets, high and low voltage circuit breakers, agricultural products, etc. The company also provides HV/LV complete-set switchgears and HV/LV electrics. It also exports its products to approximately 140 countries. The company was formerly known as Jiangsu Torin Office Furniture Co., Ltd. Jiangsu Tongrun Equipment Technology Co.,Ltd was founded in 2002 and is based in Changshu, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changshu",
        "zipcode": null,
        "website": "http://www.tongrunindustries.com",
        "market_cap": "Small Cap"
    },
    "002282.SZ": {
        "short_name": "BOSUN CO LTD",
        "long_name": "Bosun Co., Ltd.",
        "summary": "Bosun Co., Ltd. researches, manufactures, and sells diamond, power, and TCT tools under the BOSUN brand name in China and internationally. The company's diamond tools comprise diamond blades, diamond cup wheels, diamond core bits, and polishing pads; and power tools include core drill machines, table and floor saws, and floor grinders. It also offers TCT tools, such as solid wood, man-made board, non-ferrous, and steel cutting saw blades, as well as general purpose woodworking products; and RTS and LBT products, laminated board cutting saw blades, and other products. The company was formerly known as Bosun Tools Co., Ltd. and changed its name to Bosun Co., Ltd. in June 2019. Bosun Co., Ltd. was founded in 1994 and is based in Shijiazhuang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shijiazhuang",
        "zipcode": null,
        "website": "http://www.bosuntools.com",
        "market_cap": "Small Cap"
    },
    "002322.SZ": {
        "short_name": "NINGBO LIGONG ENVI",
        "long_name": "Ningbo Ligong Environment And Energy Technology Co.,Ltd",
        "summary": "Ningbo Ligong Environment And Energy Technology Co., Ltd researches, develops, sales, and services online monitoring equipment in the People's Republic of China. Its products and solutions include smart grid online monitoring, which cover substation monitoring, transmission class, scheduling class, power quality class, and others; environmental monitoring; environmental protection and power information; and environmental governance comprising heavy metal treatment, soil repair, wastewater treatment, and atmospheric desulfurization and denitrification. The company was formerly known as Ningbo Ligong Online Monitoring Technology Co., Ltd. and changed its name to Ningbo Ligong Environment And Energy Technology Co., Ltd in April 2016. Ningbo Ligong Environment And Energy Technology Co., Ltd is based in Ningbo, the People's Republic of China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315806",
        "website": "http://www.lgom.com.cn",
        "market_cap": "Small Cap"
    },
    "002337.SZ": {
        "short_name": "TIANJIN SAIXIANG",
        "long_name": "Tianjin Saixiang Technology Co.,Ltd",
        "summary": "Tianjin Saixiang Technology Co.,Ltd engages in the development and production of radial tire production equipment in China. The company also offers transportation jigs; machining systems for robot industry, including surface polishing, casting machining, welding, painting, rubber coating, assembling and transportation, etc.; and logistics system, automobile manufacturing equipment, and automobile exhibition equipment. It also exports its products to France, the United States, Germany, Japan, England, Italy, and India. Tianjin Saixiang Technology Co.,Ltd was founded in 1989 and is based in Tianjin, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Tianjin",
        "zipcode": "300384",
        "website": "http://www.chinarpm.com",
        "market_cap": "Micro Cap"
    },
    "002722.SZ": {
        "short_name": "GERON CO LTD",
        "long_name": "Geron Co.,Ltd",
        "summary": "Geron Co.,Ltd researches, develops, manufactures, and sells textile carding equipment in China. The company was founded in 2004 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nantong",
        "zipcode": "226009",
        "website": "http://www.geron-china.com",
        "market_cap": "Small Cap"
    },
    "002779.SZ": {
        "short_name": "ZHEJIANG ZHONGJIAN",
        "long_name": "Zhejiang Zhongjian Technology Co.,Ltd",
        "summary": "Zhejiang Zhongjian Technology Co.,Ltd manufactures and sells outdoor power garden machinery primarily in China. Its products include petrol chain saws, grass trimmers and brush cutters, lawn tractors, petrol hedge trimmers, blowers, generators, and Li-ion series products. The company was formerly known as Yongkang Zhongjian Tools Manufacture Co., Ltd. and changed its name to Zhejiang Zhongjian Technology Co., Ltd in December 2010. The company was founded in 1997 and is based in Yongkang, China. Zhejiang Zhongjian Technology Co.,Ltd is a subsidiary of Zhongjian Electromechanical Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yongkang",
        "zipcode": "321300",
        "website": "http://www.topsunpower.cc",
        "market_cap": "Micro Cap"
    },
    "002791.SZ": {
        "short_name": "GUANGDONG KINLONG",
        "long_name": "Guangdong KinLong Hardware Products Co.,Ltd.",
        "summary": "Guangdong KinLong Hardware Products Co.,Ltd. engages in the research, development, manufacture, and marketing of fittings for architectural hardware in China. The company offers anchor channel and tunnel, arm bracket, hanging bracket, and anti-seismic supporting systems; galfan tension cables, high-strength tension rods, and alloy casting products; window operating systems; and door controls, mechanical locks, smart locks, hotel locks, bathroom fittings, and post railing systems. It also provides point-fixed glass wall fittings, and anchor and stone cladding bolt products; and U-PVC groove door and window accessories, aluminum and home decoration doors, window hardware products, and sealing system products. In addition, the company offers safety shoes, belts, and helmets; protective gloves, respirators, and masks; jackets; reflective vests; work packages; masking film, foam, paper, wrapping film, PE, and masking tapes; explosion-proof, street, buried, underwater, working spot, and solar lights; fence tubes; spotlights; explosion-proof floodlights; electric sweeper cars; and driving and hand push type washing machines. Further, it provides forklifts and aerial platform products; and aluminum work platform products, as well as telescopic standing, telescopic, aluminum folding, aluminum folding extension, aluminum extension, riveting extension, aluminum warehouse platform, and aluminum hinge and single ladders. Additionally, the company offers consulting services to the architectural industry. It also exports its products to approximately 100 countries. The company was founded in 2003 and is based in Dongguan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Dongguan",
        "zipcode": "523722",
        "website": "http://www.kinlong.com",
        "market_cap": "Mid Cap"
    },
    "002823.SZ": {
        "short_name": "SHENZHEN KAIZHONG",
        "long_name": "Shenzhen Kaizhong Precision Technology Co., Ltd.",
        "summary": "Shenzhen Kaizhong Precision Technology Co., Ltd. engages in the research and development, production, and sale of various commutators, slip rings, and connectors in China and internationally. The company offers elastic parts, automotive lightweight parts, precise tools, intelligent equipment, and multi-layer insulated wires, as well as busbars. Its products are used in various applications, including automotive, household appliances, power tools, office automation, aviation and aerospace, intelligent home furnishings, and medical instruments. The company is headquartered in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518125",
        "website": "http://www.kaizhong.com",
        "market_cap": "Small Cap"
    },
    "002843.SZ": {
        "short_name": "BICHAMP CUTTING TE",
        "long_name": "Bichamp Cutting Technology (Hunan) Co., Ltd.",
        "summary": "Bichamp Cutting Technology (Hunan) Co., Ltd. manufactures and sells bandsaw blades in China. Its products are used in alloy steel, bearing steel, die steel, stainless steel, abrasive tool steel, titanium alloys, aerospace alloys, and non-ferrous applications. The company was founded in 2003 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Changsha",
        "zipcode": null,
        "website": "http://www.bichamp.com",
        "market_cap": "Micro Cap"
    },
    "1651.HK": {
        "short_name": "TSUGAMI CHINA",
        "long_name": "Precision Tsugami (China) Corporation Limited",
        "summary": "Precision Tsugami (China) Corporation Limited, an investment holding company, manufactures and sells computer numerical control (CNC) high precision machine tools primarily in Mainland China and Taiwan. It offers precision turret machines, precision automatic lathes, precision machine centers, precision grinding machines, precision thread and form rolling machines, and other components under the TSUGAMI brand name. The company also provides commercial consultation services. Its products are used in various industries, such as automobile parts and components, mobile phones and communication facilities, automation, medical instruments, and construction machinery. The company also exports its products to Japan, South Korea, Europe, the United States, and other countries. The company was founded in 2003 and is based in Pinghu, China. Precision Tsugami (China) Corporation Limited is a subsidiary of Tsugami Corporation.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "state": null,
        "city": "Pinghu",
        "zipcode": "314200",
        "website": "http://www.tsugami.com.cn",
        "market_cap": "Small Cap"
    },
    "200706.SZ": {
        "short_name": "WAFANGDIAN BEARING",
        "long_name": "Wafangdian Bearing Company Limited",
        "summary": "Wafangdian Bearing Company Limited manufactures and sells bearing, bearing spare parts, engineering equipment, automobile spare parts and relating products in the People's Republic of China. The company also provides bearing repair, maintenance, and technology services; rents mechanical equipment and estate; and inspects bearings, mechanical equipment, measuring instruments and meters. In addition, it produces and sells machine electrical equipment and spherical roller bearing. The company was founded in 1997 and is based in Wafangdian, the People's Republic of China. Wafangdian Bearing Company Limited is a subsidiary of Wafangdian Bearing Group Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Wafangdian",
        "zipcode": "116300",
        "website": "http://www.zwz-200706.com",
        "market_cap": "Micro Cap"
    },
    "300011.SZ": {
        "short_name": "BEIJING DINGHAN",
        "long_name": "Beijing Dinghan Technology Group Co., Ltd.",
        "summary": "Beijing Dinghan Technology Group Co., Ltd. engages in the research and development, production, sale, and service of power supply systems of rail transit equipment in China. Its ground electrical equipment includes ground power supply solution, platform door system solution, and braking energy management solution; intelligent station solutions; and rolling stock electrical equipment, such as rolling stock special cable solution, rolling stock air conditioner system solution, CRH3 auxiliary power supply system for EMU, and DC600V power supply system solution for passenger train. The company also offers HD video detection system for freight train loading state and rolling stock detection system solution; and after-sales and operation maintenance services. The company was formerly known as Beijing Dinghan Technology Co., Ltd. Beijing Dinghan Technology Group Co., Ltd. was founded in 2002 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100070",
        "website": "http://www.dinghantech.com",
        "market_cap": "Small Cap"
    },
    "300193.SZ": {
        "short_name": "SHENZHEN JASIC TEC",
        "long_name": "Shenzhen Jasic Technology Co.,Ltd.",
        "summary": "Shenzhen Jasic Technology Co.,Ltd. engages in the research and development, production, sale, and service of inverter welding machines, engine driven welders, and welder equipment in China and internationally. It provides MMA, TIG, MIG, CUT, and SAW inverter welders. The company offers its products under the JASIC brand. Its products are used in various industries, including shipbuilding, boiler, petroleum, chemical railway, construction, electricity, steel structure, metallurgy, vehicles manufacturing, etc. The company was founded in 2005 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518118",
        "website": "http://www.jasictech.com",
        "market_cap": "Small Cap"
    },
    "300475.SZ": {
        "short_name": "ANHUI JULONG TRANS",
        "long_name": "Anhui Julong Transmission Technology Co., Ltd.",
        "summary": "Anhui Julong Transmission Technology Co., Ltd. engages in the research, development, production, and sale of gear clutches for washing machines. It offers dual-drive, double-wheel, 16 kg large-capacity, and direct-drive motor deceleration clutches, as well as other series products; and finishing shafts. Anhui Julong Transmission Technology Co., Ltd. was founded in 1998 and is based in Ningguo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningguo",
        "zipcode": "242300",
        "website": "http://www.ahjlcd.com",
        "market_cap": "Small Cap"
    },
    "300549.SZ": {
        "short_name": "JOUDER PRECISION I",
        "long_name": "Jouder Precision Industry (Kunshan) Co., Ltd.",
        "summary": "Jouder Precision Industry (Kunshan) Co., Ltd. manufactures and sells precision die and mold components in China. The company offers precision components, including standard components for press, guide components, CAM units, NAAMS standard components, VDI standard components, nitrogen gas springs, coil springs, and other products, as well as marking units, urethanes, and other solutions for high-strength and thick sheets, and special materials. It also provides fixtures and gauges for automated assembly lines, bearing production, automobile safety parts production, and aerospace parts production; and table dies and medical equipment parts. The company was founded in 2000 and is based in Kunshan, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Kunshan",
        "zipcode": null,
        "website": "http://www.jouder.com",
        "market_cap": "Small Cap"
    },
    "300554.SZ": {
        "short_name": "NANJING SANCHAO AD",
        "long_name": "Nanjing Sanchao Advanced Materials Co., Ltd.",
        "summary": "Nanjing Sanchao Advanced Materials Co., Ltd. develops and manufactures diamond and CBN tools for semiconductor and photovoltaic industries. It offers electroplated diamond wire saws, precision tools, cutting fluids, and diamond and CBN grinding wheels. The company provides its products for cutting, grinding, and polishing of silicon, sapphire, quartz, neodymium iron, boron, ferrite materials, ceramics, glass, hard alloy, and hard brittle materials. In addition, it offers ultra-fine and precision silicon slicing diamond wires, as well as professional technical services. Nanjing Sanchao Advanced Materials Co., Ltd. was founded in 1999 and is based in Nanjing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Nanjing",
        "zipcode": "211124",
        "website": "http://www.diasc.com.cn",
        "market_cap": "Micro Cap"
    },
    "300611.SZ": {
        "short_name": "ZHEJIANG MEILI HIG",
        "long_name": "Zhejiang Meili High Technology Co., Ltd.",
        "summary": "Zhejiang Meili High Technology Co., Ltd. provides automotive products in China. It offers suspension system springs, seat and interior springs, gearbox spring and spring assembly products, valve springs, stabilizer bars, hot coil series springs, precision springs, composite plate springs, tail door and clutch springs, fine stamping parts, and elastic stamping parts. The company provides precision injection mold and engineering plastic parts. Zhejiang Meili High Technology Co., Ltd. was founded in 1990 and is headquartered in Xinchang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinchang",
        "zipcode": "312500",
        "website": "http://www.china-springs.com",
        "market_cap": "Micro Cap"
    },
    "300879.SZ": {
        "short_name": "NINGBO DAYE GARDEN",
        "long_name": "Ningbo Daye Garden Machinery Co.,Ltd.",
        "summary": "Ningbo Daye Garden Machinery Co.,Ltd. manufactures and sells garden power tools and garden watering products in China and internationally. It offers cordless garden tools, petrol lawnmowers, electric lawnmowers, electric grass trimmers, blower vacs, cultivators, snow throwers trimmers and brush cutters, and robotic mowers. The company was founded in 2006 and is based in Yuyao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yuyao",
        "zipcode": "315403",
        "website": "http://www.dayepower.com",
        "market_cap": "Small Cap"
    },
    "4560.TW": {
        "short_name": "STRONG H MACHINERY TECHNOLOGY (",
        "long_name": "Strong H Machinery Technology (Cayman) Incorporation",
        "summary": "Strong H Machinery Technology (Cayman) Incorporation, together with its subsidiaries, manufactures and sells sewing machine spare parts in China and Taiwan. It provides edges, needle plates, feed dogs, presser foots, needle clamps, and knives for embroidery sewing machines, as well as straight knife round knifes, gauge sets, and needle plate assemblies. The company offers its products under the STRONG H brand. Strong H Machinery Technology (Cayman) Incorporation was founded in 1994 and is based in Laizhou, China.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "China",
        "state": null,
        "city": "Laizhou",
        "zipcode": null,
        "website": "http://en.strongh.cn",
        "market_cap": "Micro Cap"
    },
    "600366.SS": {
        "short_name": "NINGBO YUNSHENG(GROUP)CO",
        "long_name": "Ningbo Yunsheng  Co., Ltd.",
        "summary": "Ningbo Yunsheng Co., Ltd. engages in the research and development, manufacture, and sale of rare earth permanent magnet materials in China. It provides sintered NdFeB and bonded NdFeB magnets; servo motors; and magnetic components, including rare earth permanent magnet radiation rings, flat rotor assemblies, laminated steel assemblies, permanent magnet rotor assemblies, and high-speed precision rotor assemblies. The company's products are used in electronic information, industrial equipment, automotive, medical, and other fields. It also exports its products to Europe, the United States, and Southeast Asian countries. Ningbo Yunsheng Co., Ltd. was founded in 1995 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315040",
        "website": "http://www.yunsheng.com",
        "market_cap": "Small Cap"
    },
    "603617.SS": {
        "short_name": "JUNHE PUMPS HOLDING CO LTD",
        "long_name": "Junhe Pumps Holding Co., Ltd",
        "summary": "Junhe Pumps Holding Co., Ltd. engages in the research and development, manufacture, and sale of household water pumps in China, Europe, North America, Australia, and internationally. It offers submersible, garden, deep well, fountain, and pool pumps, as well as accessories. Junhe Pumps Holding Co., Ltd. was founded in 2003 and is based in Ningbo, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Ningbo",
        "zipcode": "315171",
        "website": "http://www.junhepumps.com",
        "market_cap": "Small Cap"
    },
    "603667.SS": {
        "short_name": "ZHEJIANG XCC GROUP CO LTD",
        "long_name": "Zhejiang XCC Group Co.,Ltd",
        "summary": "Zhejiang XCC Group Co.,Ltd produces and sells bearings in the United States, Japan, Korea, Brazil, and internationally. The company offers deep groove ball, double row angular contact ball, automotive generator, automobile tension, automobile clutch release, water pump, automobile steering and hub, automotive air conditioning electromagnetic clutch, high precision machine tool, chemical fiber equipment, tapered roller, and inch-deep groove ball bearings, as well as bearings for air compressors. It also provides thin, hub, middle and large size, middle and small, and cold rolling bearing rings; salt and oil quenching heat treatment, and precision high and general speed forging parts; and precision steel tubes, such as bearing steel tubes, and special tubes of air generator for airbags. The company also deals in auto parts and technical equipment. Zhejiang XCC Group Co.,Ltd is based in Xinchang, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Xinchang",
        "zipcode": "312500",
        "website": "http://www.xcc-zxz.com",
        "market_cap": "Small Cap"
    },
    "688028.SS": {
        "short_name": "BEIJING WORLDIA DIAMOND TOOLS C",
        "long_name": "Beijing Worldia Diamond Tools Co.,Ltd.",
        "summary": "Beijing Worldia Diamond Tools Co.,Ltd. engages in the research and development, production, and sale of high precision diamond cutting tools in China. The company offers PCD tools, CBN tools, milling cutters, special tools, CVD diamond tools, and diamond scribing wheels. Its products are used in automotive, electronic, new energy, and other industries. The company sells its products directly, as well as through a network of distributors and dealers. Beijing Worldia Diamond Tools Co.,Ltd. also exports its products. The company was formerly known as Beijing Supower Science and Technology Development Co., Ltd and changed its name to Beijing Worldia Diamond Tools Co.,Ltd. in 2015. Beijing Worldia Diamond Tools Co.,Ltd. was founded in 2000 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": "100015",
        "website": "http://www.worldiatools.com",
        "market_cap": "Small Cap"
    }
}