{
    "600611.SS": {
        "short_name": "DAZHONG TRANSPORTATION GROUP",
        "long_name": "Dazhong Transportation (Group) Co., Ltd.",
        "summary": "Dazhong Transportation (Group) Co., Ltd. engages in the passenger transport business in China. It provides taxi and cars rental services; mobile Internet services for travel; taxi pricing devices; various vehicle intelligent dispatching platform; GPS/GPRS vehicle equipment; and call center system, as well as is involved in the research, development, production, sales, and service of traffic information application. The company also offers inter-provincial passenger cars and chartered flights; advertisement services; financial loans; and auction services for real estate, motor vehicles, equity, materials and equipment, art, and other services. In addition, it engages in the real estate and hotel businesses; provides travel and logistics services; operates motor vehicle driving training and conference centers; and trades in used cars, as well as involved in the market management; and repair and maintenance services. The company was formerly known as Shanghai Dazhong Taxi Co., Ltd. and changed its name to Dazhong Transportation (Group) Co., Ltd. in August 1988. The company was founded in 1988 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.96822.com",
        "market_cap": "Small Cap"
    },
    "600662.SS": {
        "short_name": "SHANGHAI QIANGSHENG HOLDING CO.",
        "long_name": "Shanghai Qiangsheng Holding Co., Ltd.",
        "summary": "Shanghai Qiangsheng Holding Co., Ltd. operates taxis in China. The company operates a fleet of approximately 13,000 taxis in Shanghai. It is also involved in the rental of cars; sale of new and used cars; and the provision of car decoration and repair, and vehicle advertising services. In addition, the company engages in tourism activities; and develops commercial properties. The company was founded in 1919 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200041",
        "website": "http://www.62580000.com.cn",
        "market_cap": "Small Cap"
    },
    "603056.SS": {
        "short_name": "DEPPON LOGISTICS CO LTD",
        "long_name": "DEPPON LOGISTICS Co., LTD.",
        "summary": "DEPPON LOGISTICS Co., LTD. operates as a logistics company in China, Korea, Japan, Thailand, Singapore, Malaysia, Vietnam, and internationally. It offers less-than-truckload transportation, full truck load transportation, delivery, and warehousing management services, as well as supply chain management and cross-border services. The company was founded in 1996 and is headquartered in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "201702",
        "website": "http://www.deppon.com/newwebsite",
        "market_cap": "Small Cap"
    },
    "603223.SS": {
        "short_name": "HENGTONG LOGISTIC CO LTD",
        "long_name": "Hengtong Logistics Co., Ltd.",
        "summary": "Hengtong Logistics Co., Ltd. engages in the logistics business in China. The company is involved in the LNG and LPG logistics transportation and sales, gas station construction and operation, gasification peaking station construction and operation, gas pipeline investment operation, distributed energy development and operation, and gas industry personnel technical training businesses. It also engages in road transportation, port warehousing, shipping agency, large equipment hoisting, car rental, vehicle sales and maintenance, driving skills training, qualification training business, and agricultural machinery sales and service. In addition, the company focuses on smart logistics research and development and big data application. The company was formerly known as Longkou Hengtong Transportation Co., Ltd. and changed its name to Hengtong Logistics Co., Ltd. in December 2011. Hengtong Logistics Co., Ltd. was founded in 2007 and is based in Yantai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Yantai",
        "zipcode": "265700",
        "website": "http://www.hengtonggf.com",
        "market_cap": "Small Cap"
    },
    "603569.SS": {
        "short_name": "BEIJING CHANGJIU LOGISTICS CO",
        "long_name": "Beijing Changjiu Logistics Co.,Ltd",
        "summary": "Beijing Changjiu Logistics Co.,Ltd provides supply chain logistics solutions for the automotive industry in China. The company offers specialized professional logistics planning, transportation, warehousing, distribution, and other related services. Its services include to passenger car, commercial vehicle, used car, parts, after-sale, and international logistics. The company offers its services to OEMs and distributors. Beijing Changjiu Logistics Co.,Ltd was founded in 2003 and is headquartered in Beijing, China. Beijing Changjiu Logistics Co.,Ltd is a subsidiary of Jilin Changjiu Industry Group Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Beijing",
        "zipcode": null,
        "website": "http://www.changjiulogistics.com.cn",
        "market_cap": "Small Cap"
    },
    "603813.SS": {
        "short_name": "GUANGDONG GENSHO LOGISTICS CO L",
        "long_name": "GuangDong GenSho Logistics Co.,LTD",
        "summary": "GuangDong GenSho Logistics Co.,LTD engages in the integrated logistics of auto parts supply chain in China. It offers warehousing management, loading and unloading transportation, and distribution and shipping services. The company was founded in 2005 and is based in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Guangzhou",
        "zipcode": "511340",
        "website": "http://www.gsl.cc",
        "market_cap": "Micro Cap"
    },
    "900903.SS": {
        "short_name": "DAZHONG TRANSPORTATION GROUP",
        "long_name": "Dazhong Transportation (Group) Co., Ltd.",
        "summary": "Dazhong Transportation (Group) Co., Ltd. engages in the passenger transport business in China. It provides taxi and cars rental services; mobile Internet services for travel; taxi pricing devices; various vehicle intelligent dispatching platform; GPS/GPRS vehicle equipment; and call center system, as well as is involved in the research, development, production, sales, and service of traffic information application. The company also offers inter-provincial passenger cars and chartered flights; advertisement services; financial loans; and auction services for real estate, motor vehicles, equity, materials and equipment, art, and other services. In addition, it engages in the real estate and hotel businesses; provides travel and logistics services; operates motor vehicle driving training and conference centers; and trades in used cars, as well as involved in the market management; and repair and maintenance services. The company was formerly known as Shanghai Dazhong Taxi Co., Ltd. and changed its name to Dazhong Transportation (Group) Co., Ltd. in August 1988. The company was founded in 1988 and is based in Shanghai, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "state": null,
        "city": "Shanghai",
        "zipcode": "200235",
        "website": "http://www.96822.com",
        "market_cap": "Mid Cap"
    },
    "BEST": {
        "short_name": "BEST Inc.",
        "long_name": "BEST Inc.",
        "summary": "BEST Inc. operates as a smart supply chain service provider in the People's Republic of China. Its proprietary technology platform BEST Cloud enables its ecosystem participants to operate their businesses through various SaaS-based applications. The company applies its technologies to a range of applications, such as network and route optimization, swap bodies, sorting line automation, smart warehouses, and store management. It offers integrated services and solutions across the supply chain, including warehouse management, order fulfillment, express delivery, freight, and other services for multinational and corporate customers, as well as small and medium enterprises. The company also provides express delivery services; and door-to-door integrated cross-border supply chain services to and from China, including international express, less-than-truckload, fulfillment, and freight forwarding through its network, and transportation and warehouse partners. In addition, it operates real-time bidding platform to source truckload capacity from independent transportation service providers and agents; and offers online merchandise sourcing and store management services for convenience stores, as well as B2C services, such as parcel pick-up and drop-off, and bill payment services. Further, BEST Inc. provides various value-added services, including customized financial services, including fleet and equipment leases; and centralized sourcing of products and services, such as bulk procurement of trucks and accessories. The company was founded in 2007 and is headquartered in Hangzhou, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Hangzhou",
        "zipcode": "310013",
        "website": "http://www.best-inc.com",
        "market_cap": "Small Cap"
    },
    "YGMZ": {
        "short_name": "MingZhu Logistics Holdings Limi",
        "long_name": "MingZhu Logistics Holdings Limited",
        "summary": "MingZhu Logistics Holdings Limited provides trucking and delivery services using its truckload fleet and subcontractors in the People's Republic of China. The company serves sizeable logistics companies, freight forwarders, and warehouse operators. As of March 5, 2021, it operated a truckload fleet with 114 tractors and 76 trailers. MingZhu Logistics Holdings Limited was founded was founded in 2002 and is based in Shenzhen, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Trucking",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "state": null,
        "city": "Shenzhen",
        "zipcode": "518081",
        "website": "http://www.szygmz.com",
        "market_cap": "Micro Cap"
    }
}