{
    "000035.SZ": {
        "short_name": "CHINA TIANYING INC",
        "long_name": "China Tianying Inc.",
        "summary": "China Tianying Inc. engages in urban environmental service and energy businesses in China and internationally. The company offers urban environmental services, such as waste sorting and collection, smart transportation, urban environment management, sanitation, renewable resource recovery, and waste disposal services. It also undertakes various projects, including waste separation and treatment projects, such as waste-to-energy power plants, circular economy industrial parks, construction and demolition waste treatment projects, food waste treatment projects, and landfill gas recovery and power generation projects; and smart city projects. The company was formerly known as China Kejian Co., Ltd. and changed its name to China Tianying Inc. in June 2014. China Tianying Inc. was founded in 1984 and is based in Nantong, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nantong"
    },
    "002034.SZ": {
        "short_name": "WANGNENG ENVIRONME",
        "long_name": "Wangneng Environment Co., Ltd.",
        "summary": "Wangneng Environment Co., Ltd. provides solid waste solutions in China. It invests in, constructs, and operates waste incineration power generation plant, solid waste, kitchen waste and sludge treatment, and other environmental industry projects. The company was formerly known as Zhejiang Mizuda printing&dyeing group co.,Ltd and changed its name to Wangneng Environment Co., Ltd. in January 2018. Wangneng Environment Co., Ltd. was founded in 1993 and is headquartered in Huzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Huzhou"
    },
    "002973.SZ": {
        "short_name": "QIAOYIN CITY MANAG",
        "long_name": "Qiaoyin City Management Co.,Ltd.",
        "summary": "Qiaoyin City Management Co.,Ltd. engages in the environmental protection business in China. Its activities include integrated sanitation management, waste classification, sanitation infrastructure investment and construction, biomass treatment, leachate sludge disposal, soil remediation, public facilities and environmental management, black and smelly water body restoration, municipal road and pipeline maintenance, and other services. The company was formerly known as QiaoYin Environmental Tech.Co.,Ltd. and changed its name to Qiaoyin City Management Co.,Ltd. in December 2020. The company was founded in 2001 and is headquartered in Guangzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "003027.SZ": {
        "short_name": "TONGXING ENVIRONME",
        "long_name": "Tongxing Environmental Protection Technology Co.,Ltd",
        "summary": "Tongxing Environmental Protection Technology Co.,Ltd provides environmental protection project general contracting services in China. It offers environmental protection equipment and materials for dust removal, desulfurization, and denitrification; salt extraction products; desulfurization waste liquid extraction salt; and low temperature denitration catalyst, as well as related ancillary services. The company was founded in 2006 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hefei"
    },
    "1065.HK": {
        "short_name": "TIANJIN CAPITAL",
        "long_name": "Tianjin Capital Environmental Protection Group Company Limited",
        "summary": "Tianjin Capital Environmental Protection Group Company Limited, together with its subsidiaries, engages in the sewage treatment and construction of the sewage treatment plants in the People's Republic of China. The company operates through Processing of Sewage Water; Recycled Water; Pipeline Connection; Heating and Cooling Service; Sales of Tap Water; Sale of Environmental Protection Equipment; and All Other segments. It also provides toll collection and engineering consulting services; environment governance, technical consulting services, etc.; technical consulting for water recycling business; and energy saving and research, consulting and transfer, and property management services, as well as invests in construction projects. The company was founded in 1993 and is based in Tianjin, the People's Republic of China. Tianjin Capital Environmental Protection Group Company Limited is a subsidiary of Tianjin Municipal Investment Company Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Tianjin"
    },
    "1330.HK": {
        "short_name": "DYNAGREEN ENV",
        "long_name": "Dynagreen Environmental Protection Group Co., Ltd.",
        "summary": "Dynagreen Environmental Protection Group Co., Ltd., together with its subsidiaries, engages in the investment, technical consulting, construction, operation, and maintenance of municipal waste-to-energy plants in the People's Republic of China. The company engages in the waste treatment and power generation activities. It is also involved in the technological research in environmental protection industries, including waste-incineration, as well as design, development, and systematic integration of relevant equipment; and management of waste treatment projects and operations, as well as the provision of technological services and associated technological consultation. The company was founded in 2012 and is headquartered in Shenzhen, the People's Republic of China. Dynagreen Environmental Protection Group Co., Ltd. is a subsidiary of Beijing State-owned Assets Management Co., Ltd.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1845.HK": {
        "short_name": "WG ENV TECH",
        "long_name": "Weigang Environmental Technology Holding Group Limited",
        "summary": "Weigang Environmental Technology Holding Group Limited engages in the research, design, integration, and commissioning of solid waste treatment systems primarily for hazardous waste incineration projects in China. It also provides solid waste treatment, such as thermal desorption of oil sludge, pyrolysis treatment of solid waste, and cement plant parallel kiln co-treatment. The company was formerly known as WeiGang Environmental Protection Holdings Limited and changed its name to Weigang Environmental Technology Holding Group Limited in May 2017. Weigang Environmental Technology Holding Group Limited was founded in 1998 and is based in Guangzhou, China. Weigang Environmental Technology Holding Group Limited is a subsidiary of WeiGang Technology Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "300187.SZ": {
        "short_name": "YONKER ENVIRONMENT",
        "long_name": "Yonker Environmental Protection Co.,Ltd.",
        "summary": "Yonker Environmental Protection Co.,Ltd. operates in the environmental protection industry in China. The company engages in the contaminated sites repair activities; provision of technical advisory services; supply of soil heavy metal repair materials; heavy metal contaminated site soil remediation; and soil remediation works for organic contaminated sites. It is also involved in the organic compounds contaminated soil repair engineering, and groundwater remediation engineering design and engineering contracting activities. The company was founded in 1998 and is based in Changsha, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changsha"
    },
    "300190.SZ": {
        "short_name": "WELLE ENVIRONMENTA",
        "long_name": "WELLE Environmental Group Co.,Ltd",
        "summary": "Welle Environmental Group Co., Ltd. provides urban environmental governance, agricultural and rural environmental management, and industrial energy conservation and environmental protection plants in China. It offers urban environmental governance solutions, including landfill leachate treatment, kitchen waste disposal, river repair, and waste incineration services; agricultural and rural environmental solutions, such as agricultural organic waste treatment and rural sewage treatment services; and industrial energy saving and environmental protection solutions comprising industrial flue gas treatment, VOC oil and gas recovery, and industrial treatment services. The company was formerly known as Jiangsu WELLE Environmental Co.,Ltd and changed its name to Welle Environmental Group Co., Ltd. in March 2019. Welle Environmental Group Co., Ltd. was founded in 2003 and is based in Changzhou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Changzhou"
    },
    "300385.SZ": {
        "short_name": "WUXI XUELANG ENVIR",
        "long_name": "Wuxi Xuelang Environmental Technology Co., Ltd.",
        "summary": "Wuxi Xuelang Environmental Technology Co., Ltd. researches and develops, manufactures, and sells industrial hazardous waste and sludge incineration disposal, flue gas purification treatment, and ash conveying processing systems in China and internationally. It supplies flue gas purification treatment systems primarily for use in waste incineration power plants; and ash conveying processing systems to steel enterprises. The company was founded in 2001 and is based in Wuxi, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Wuxi"
    },
    "300388.SZ": {
        "short_name": "CECEP GUOZHEN ENVI",
        "long_name": "Cecep Guozhen Environmental Protection Technology Co.,ltd.",
        "summary": "Cecep Guozhen Environmental Protection Technology Co.,ltd. primarily engages in the municipal and industrial wastewater treatment business in China. The company is also involved in the design of wastewater treatment, industrial wastewater, on-site wastewater treatment system, sludge dewatering, and incineration projects, as well as integration and installation of equipment. In addition, it engages in the manufacture and sale of membrane manufacturing equipment; investment and financing services; and pipe network businesses. The company was founded in 2007 and is based in Hefei, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hefei"
    },
    "300422.SZ": {
        "short_name": "GUANGXI BOSSCO ENV",
        "long_name": "Guangxi Bossco Environmental Protection Technology Co.,Ltd.",
        "summary": "Guangxi Bossco Environmental Protection Technology Co.,Ltd. provides environmental services primarily in China. The company offers industrial environmental services, such as waste gas treatment; and water pollution management solutions and services, as well as supplies clean production technology and equipment. It also provides urban and rural environmental services, including urban black odor water treatment services; water supply and drainage integration projects; and sewage treatment system equipment. In addition, the company offers ecological restoration services comprising water and farmland restoration, oily sludge treatment, and mine and industrial site repairing services; and solid waste disposal and new energy development services, including domestic waste treatment, sludge disposal, hazardous waste disposal, and industrial waste disposal services. Further, it provides environmental impact assessment, inspection and testing, and design consulting services; and smart sanitation services. The company also exports its technologies and products to eastern Europe, the ASEAN, Russia, and South America. Guangxi Bossco Environmental Protection Technology Co.,Ltd. was founded in 1999 and is headquartered in Nanning, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Nanning"
    },
    "300779.SZ": {
        "short_name": "QINGDAO HUICHENG E",
        "long_name": "Qingdao Huicheng Environmental Technology Co., Ltd.",
        "summary": "Qingdao Huicheng Environmental Technology Co., Ltd. produces and supplies FCC catalyst and additives in China. It offers various formulations of FCC catalyst under the Essence, Enhance, Excel, Endure, Evoke, Agile, Attain, Extend, and Erudite names; and Y and NaX zeolite, specialty alumina, and aluminosilicates for various applications. The company also provides FCC additives, such as HCSP, a ZSM-5 additive; HCSO, a ZSM-5 additive focused on gasoline octane improvement; HIPA, a ZSM-5 additive with enhanced gasoline cracking; HCBA, a butylene selective ZSM-5 additive; VTRAC, a metal and vanadium trap; STRAC, a Sox reduction additive; and BUA, a bottoms upgrading additive. In addition, it offers technical services, including catalyst formulation, routine analytic and on-site visit, and pilot plant services. The company was founded in 2006 and is based in Qingdao, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Qingdao"
    },
    "300899.SZ": {
        "short_name": "KEYSINO SEPARATION",
        "long_name": "Keysino Separation Technology Inc.",
        "summary": "Keysino Separation Technology Inc. engages in the consulting, design, manufacture, installation, commissioning, and maintenance of membrane separation equipment for various industrial fluid users. The company offers high-concentration brine recycling, industrial waste alkali recycling, industrial waste acid recycling, microcrystalline filtration, high COD wastewater treatment, CIP cleaning solution recycling, dyeing and printing wastewater treatment and recycling, pulping and papermaking waste liquid resource utilization, inorganic membrane, organic ultra/nano filtration, electrically-driven membrane, and ion exchange systems. Its filtration equipment is used in petrochemical, steel metallurgy, textile printing and dyeing, food fermentation, bio-pharmaceutical, and pulp and paper industries. Keysino Separation Technology Inc. was founded in 2015 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "601330.SS": {
        "short_name": "DYNAGREEN ENVIRONMENTAL PROTECT",
        "long_name": "Dynagreen Environmental Protection Group Co., Ltd.",
        "summary": "Dynagreen Environmental Protection Group Co., Ltd., together with its subsidiaries, engages in the investment, technical consulting, construction, operation, and maintenance of municipal waste-to-energy plants in the People's Republic of China. The company engages in the waste treatment and power generation activities. It is also involved in the technological research in environmental protection industries, including waste-incineration, as well as design, development, and systematic integration of relevant equipment; and management of waste treatment projects and operations, as well as the provision of technological services and associated technological consultation. The company was founded in 2012 and is headquartered in Shenzhen, the People's Republic of China. Dynagreen Environmental Protection Group Co., Ltd. is a subsidiary of Beijing State-owned Assets Management Co., Ltd.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "601827.SS": {
        "short_name": "CHONGQING SANFENG ENVIRONMENT G",
        "long_name": "Chongqing Sanfeng Environment Group Corp., Ltd.",
        "summary": "Chongqing Sanfeng Environment Group Corp., Ltd. provides services in the waste to energy industry in China and internationally. Its services include project investment, construction, operation, and equipment supply. The company also engages in leachate treatment, and waste collection and transfer business. Chongqing Sanfeng Environment Group Corp., Ltd. was founded in 1998 and is based in Chongqing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Chongqing"
    },
    "603568.SS": {
        "short_name": "ZHEJIANG WEIMING ENVIRONMENT PR",
        "long_name": "Zhejiang Weiming Environment Protection Co., Ltd.",
        "summary": "Zhejiang Weiming Environment Protection Co., Ltd. provides solid waste disposal services. It focuses on solid waste-related technological development, project investment, project construction, and operational management services, as well as manufactures and sells equipment. The company also invests in, constructs, and manages 20 waste incineration and power generation projects. In addition, it offers household waste, agricultural and forestry waste, sewage leachate, sludge drying, and kitchen waste collection and treatment services. The company is headquartered in Wenzhou, China. Zhejiang Weiming Environment Protection Co., Ltd. is a subsidiary of Wei Ming Group.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Wenzhou"
    },
    "603588.SS": {
        "short_name": "BEIJING GEOENVIRON ENG AND TECH",
        "long_name": "Beijing GeoEnviron Engineering & Technology, Inc.",
        "summary": "Beijing GeoEnviron Engineering & Technology, Inc. engages in environmental technology research; and provision of solutions for pollution control systems in China. It offers urbanization environmental services, such as urban garbage collection, storage, and transfer to the final disposal; and disposal systems for urban water-supply, municipal sewage, medical waste, and hazardous wastes. The company also provides industrial environmental services comprising safety treatment and resource utilization of various industrial solid wastes and industrial waste water for industrial enterprises and industrial parks. In addition, it offers remediation of industrial sites, mine remediation and river control, underground water remediation, landfill remediation, and farmland remediation solutions. The company was formerly known as Liner Engineering Department of Institute of High Energy Physics Academy of Sciences. Beijing GeoEnviron Engineering & Technology, Inc. was founded in 1992 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "603603.SS": {
        "short_name": "POTEN ENVIRONMENT GROUP CO LTD",
        "long_name": "Poten Environment Group Co., Ltd.",
        "summary": "Poten Environment Group Co., Ltd. provides various environmental services in China and internationally. The company offers iRiver smart water environment management system for online monitoring of water quality and hydrological conditions; and invests in implements, operates, and manages water service projects, which include water supply, sewage treatment, and reuse of reclaimed water. It is also involved in the integrated management of water services; and regulation of foul rivers, water source protection, building of sponge city, urban river system planning, and water ecological town businesses. In addition, the company operates industrial and energy water systems to provide water supply, water desalting, water recycling, sewage treatment, water reusing, and zero discharging services for coal-chemical engineering, petrochemical engineering, fine chemical engineering, thermoelectricity, textile and papermaking, food and beverage, bio-pharmaceuticals, and electronic mechanics industries. Further, it engages in the ecological and soil restoration activity. Poten Environment Group Co., Ltd. was founded in 1995 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "603797.SS": {
        "short_name": "GUANGDONG LIANTAI ENVIRONMENTAL",
        "long_name": "Guangdong Liantai Environmental Protection Co.,Ltd.",
        "summary": "Guangdong Liantai Environmental Protection Co.,Ltd. provides environmental products and services in China. The company focuses on the investment and operation of sewage treatment, water purification, sewage pipe network, water body remediation and auxiliary facilities, and wastewater treatment projects. It also designs, constructs, and operates environmental improvement projects. The company was founded in 2005 and is based in Shantou, China.",
        "currency": "CNY",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Shantou"
    },
    "BIU2.F": {
        "short_name": "CN EVERBRIGHT WATER HD 1",
        "long_name": "China Everbright Water Limited",
        "summary": "China Everbright Water Limited, an investment holding company, provides water environmental management services in Mainland China and Germany. It offers municipal waste water treatment, industrial waste water treatment, water supply, reusable water, sludge harmless treatment, sponge city construction and operation, river-basin ecological restoration, waste water source heat pump, leachate treatment, and engineering construction, as well as researches and develops water environment technologies. The company also provides project investment, planning and design, and operations management services; investment and investment management, business development and management, and pipeline network construction and maintenance services; and survey, mapping, design, and consultancy services for municipal projects. As of December 31, 2019, it invested in and operated water treatment projects with a designed daily waste water treatment capacity of approximately 6.2 m3. The company is based in Shenzhen, the People's Republic of China. China Everbright Water Limited is a subsidiary of China Everbright Water Holdings Limited.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "BOTRF": {
        "short_name": "CHINA EVERBRIGHT WATER LIMITED",
        "long_name": "China Everbright Water Limited",
        "summary": "China Everbright Water Limited, an investment holding company, provides water environmental management services in Mainland China and Germany. It offers municipal waste water treatment, industrial waste water treatment, water supply, reusable water, sludge harmless treatment, sponge city construction and operation, river-basin ecological restoration, waste water source heat pump, leachate treatment, and engineering construction, as well as researches and develops water environment technologies. The company also provides project investment, planning and design, and operations management services; investment and investment management, business development and management, and pipeline network construction and maintenance services; and survey, mapping, design, and consultancy services for municipal projects. As of December 31, 2019, it invested in and operated water treatment projects with a designed daily waste water treatment capacity of approximately 6.2 m3. The company is based in Shenzhen, the People's Republic of China. China Everbright Water Limited is a subsidiary of China Everbright Water Holdings Limited.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "CCNC": {
        "short_name": "Code Chain New Continent Limite",
        "long_name": "Code Chain New Continent Limited",
        "summary": "Code Chain New Continent Limited, together with its subsidiaries, engages in the research, development, and sale of solid waste recycling systems for the mining and industrial sectors in the People's Republic of China. It operates through three segments: Solid Waste Recycling Systems Business, Coal and Coke Wholesale Business, and Coating Materials Business. The company also produces and sells water-borne epoxy anti-rust paints, epoxy zinc rich primers, solvent-free epoxy bituminous anticorrosive paints, permeable epoxy polysiloxane anticorrosive and waterproof materials, and cold spraying zinc for surface anti-corrosion, waterproof, and decoration of concrete and steel components in ships, bridges, water conservancy and hydropower projects, wind power generation, mining machinery manufacturing, petroleum, petrochemical and metallurgy, port construction, light industry, locomotive and vehicle, and other fields. It also engages in the wholesale of coal; and sale of coke, steels, construction materials, mechanical equipment, and steel scrap. The company was formerly known as TMSR Holding Company Limited and changed its name to Code Chain New Continent Limited in May 2020. The company is based in Nantong, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Nantong"
    },
    "CIWT": {
        "short_name": "CHINA INDUSTRIAL WASTE MGMT INC",
        "long_name": "China Industrial Waste Management, Inc.",
        "summary": "China Industrial Waste Management, Inc. provides environmental services and solutions in northeastern China. The company collects, stores, treats, disposes, and recycles industrial solid waste through incineration and/or landfill, physical and/or chemical treatment, material processing, packaging, analysis, and storage. It is also involved in the treatment of municipal sewage, as well as sludge resulting from the processing of sewage that is routed from the sewage treatment facilities located in Dalian and surrounding areas. The company operates a sewage treatment facility and a sludge treatment facility in Dalian, as well as provides environmental pollution remediation services to the Dalian municipal government. In addition, it offers environmental protection, technology consultation, pollution treatment, waste management design processing, waste disposal, waste transportation, and onsite waste management services. The company sells its recycled materials, including cupric sulfate, as well as metals and methane derived from sludge treatment to commodity traders and metallurgical companies. China Industrial Waste Management, Inc. was founded in 1991 and is based in Dalian, China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Dalian"
    },
    "CXEE": {
        "short_name": "CHINA XUEFENG ENVIRONMENTAL ENG",
        "long_name": "China Xuefeng Environmental Engineering, Inc.",
        "summary": "China Xuefeng Environmental Engineering, Inc., through its subsidiaries, provides garbage-processing equipment in the People's Republic of China. Its equipment comprise waste digestion pretreatment system, methane gas power generation system, sorting processing system, bricklaying building system, leachate treatment system, distribution control system, XFET-5 ecological and water-saving toilets and excrement comprehensive processing system, and various material collection systems. The company also leases garbage-processing units; and recycles the garbage and manufacture products, such as ferrous metals, organic fertilizers, wood-plastic trays, and hollow bricks. China Xuefeng Environmental Engineering, Inc. was founded in 2007 and is based in Suqian, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Suqian"
    },
    "DYN.F": {
        "short_name": "DYNAGREEN EN.PR.GR.H YC 1",
        "long_name": "Dynagreen Environmental Protection Group Co., Ltd.",
        "summary": "Dynagreen Environmental Protection Group Co., Ltd., together with its subsidiaries, engages in the investment, technical consulting, construction, operation, and maintenance of municipal waste-to-energy plants in the People's Republic of China. The company engages in the waste treatment and power generation activities. It is also involved in the technological research in environmental protection industries, including waste-incineration, as well as design, development, and systematic integration of relevant equipment; and management of waste treatment projects and operations, as well as the provision of technological services and associated technological consultation. The company was founded in 2012 and is headquartered in Shenzhen, the People's Republic of China. Dynagreen Environmental Protection Group Co., Ltd. is a subsidiary of Beijing State-owned Assets Management Co., Ltd.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "TRITF": {
        "short_name": "TRI-TECH HOLDING INC",
        "long_name": "Tri-Tech Holding Inc.",
        "summary": "Tri-Tech Holding Inc. provides consulting, engineering, procurement, construction, and technical services. Its Water, Wastewater Treatment and Municipal Infrastructure segment procures and constructs build-transfer processing equipment and processing control systems for the municipal water supply and distribution, wastewater treatment, and gray water recycling activities; and offers municipal facilities engineering and operation management services for related infrastructure construction projects. The company's Industrial Pollution Control and Safety segment provides systems for volatile organic compounds abatement, odor control, water and wastewater treatment, water recycling facilities design, engineering, procurement, and construction for oil, gas, petrochemical, and power industries. The company serves government, state-owned entities, and commercial clients. Tri-Tech Holding Inc. was incorporated in 2002 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "U9E.SI": {
        "short_name": "China Everbright",
        "long_name": "China Everbright Water Limited",
        "summary": "China Everbright Water Limited, an investment holding company, provides water environmental management services in Mainland China and Germany. It offers municipal waste water treatment, industrial waste water treatment, water supply, reusable water, sludge harmless treatment, sponge city construction and operation, river-basin ecological restoration, waste water source heat pump, leachate treatment, and engineering construction, as well as researches and develops water environment technologies. The company also provides project investment, planning and design, and operations management services; investment and investment management, business development and management, and pipeline network construction and maintenance services; and survey, mapping, design, and consultancy services for municipal projects. As of December 31, 2019, it invested in and operated water treatment projects with a designed daily waste water treatment capacity of approximately 6.2 m3. The company is based in Shenzhen, the People's Republic of China. China Everbright Water Limited is a subsidiary of China Everbright Water Holdings Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "China",
        "city": "Shenzhen"
    }
}