{
    "6113.HK": {
        "short_name": "UTS MARKETING",
        "long_name": "UTS Marketing Solutions Holdings Limited",
        "summary": "UTS Marketing Solutions Holdings Limited, an investment holding company, provides outbound telemarketing services in Malaysia. It offers telemarketing services of financial products, which include insurance, credit cards, and balance transfers through its contact centers, as well as donation programs for its clients. As of December 31, 2020, the company operated eight contact centers. It also offers outsourced contact center campaigns and setting up, as well as manages contact center facilities; and business development solutions that assist clients in securing or acquiring new business partnerships and expanding the business. The company primarily serves banks, insurance companies, takaful operators, and charitable organizations. UTS Marketing Solutions Holdings Limited was founded in 2007 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50200",
        "website": "http://unitedteleservice.com",
        "full_time_employees": 1421
    },
    "IS3.AX": {
        "short_name": "ISYNERGY FPO",
        "long_name": "I Synergy Group Limited",
        "summary": "I Synergy Group Limited, an investment holding company, provides affiliate marketing network and solutions to advertisers and affiliates in Malaysia and Indonesia. It operates Affiliate Junction, an affiliate marketing platform offers affiliate marketing solutions through a single platform. The company's platform delivers performance-based affiliate marketing solutions that enhance product/brand awareness and drive business leads. It also provides related affiliate management services for the commercial industries; and research, development, maintenance, and commercialization of proprietary affiliate marketing platform and learning management system; and customized software design and development services and solutions. The company was founded in 2008 and is based in Kuala Lumpur, Malaysia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://www.i-synergygroup.com",
        "full_time_employees": null
    }
}