{
    "41T.SI": {
        "short_name": "$ GCCP",
        "long_name": "GCCP Resources Limited",
        "summary": "GCCP Resources Limited, an investment holding company, engages in quarrying, processing, and selling limestone in Malaysia and Indonesia. The company produces and sells crushed calcium carbonate of various particle sizes to clients for the manufacture of precipitated calcium carbonate (PCC). It owns Gridland Quarry and Hyper Act Quarries that are located in Ipoh, in the state of Perak, Malaysia. The company was formerly known as Ultimate Prime Ventures Limited and changed its name to GCCP Resources Limited in July 2014. GCCP Resources Limited was incorporated in 2013 and is based in Petaling Jaya, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Petaling Jaya",
        "zipcode": "47810",
        "website": "http://www.gccpresources.com",
        "market_cap": 22219548
    },
    "ST9.F": {
        "short_name": "STEPPE CEMENT LTD",
        "long_name": "Steppe Cement Ltd.",
        "summary": "Steppe Cement Ltd., an investment holding company, produces and sells cement in Kazakhstan. It also engages in the provision of consultancy services; and transmission and distribution of electricity. Steppe Cement Ltd. is based in Kuala Lumpur, Malaysia.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50450",
        "website": "http://www.steppecement.com",
        "market_cap": 118673352
    },
    "STCM.L": {
        "short_name": "STEPPE CEMENT LTD ORD NPV",
        "long_name": "Steppe Cement Ltd.",
        "summary": "Steppe Cement Ltd., an investment holding company, produces and sells cement in Kazakhstan. The company also engages in the provision of consultancy services; and transmission and distribution of electricity. Steppe Cement Ltd. is based in Kuala Lumpur, Malaysia.",
        "currency": "GBp",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50450",
        "website": "http://www.steppecement.com",
        "market_cap": 105120000
    }
}