{
    "CYW.SI": {
        "short_name": "$ TrickleStar",
        "long_name": "TrickleStar Limited",
        "summary": "TrickleStar Limited designs and supplies energy-saving products to enable consumers reduce energy consumption in their homes and workplaces in the United States and Canada. Its products also protect consumer devices and enables minimize environmental impact by reducing energy wastage from appliances and consumer electronics products. The company's portfolio of products includes advanced powerstrips, load controllers, energy monitors, energy meters, and surge protectors, as well as USB motion sensors, motion sensor powerstrips, light level sensor powerstrips, timer and general services administration powerstrips, power switches, dryer saver, smart thermostat, and electric water heater controller. It also engages in licensing technology business. In addition, the company provides operational support services. It serves electric utilities, implementation contractors, and energy auditors, as well as energy efficiency programs. The company was founded in 2007 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "50480",
        "website": "http://www.tricklestar.com",
        "market_cap": "Small Cap"
    },
    "E28.SI": {
        "short_name": "Frencken",
        "long_name": "Frencken Group Limited",
        "summary": "Frencken Group Limited, an investment holding company, operates as a capital and consumer equipment service provider worldwide. It operates in two segments, Mechatronics and Integrated Manufacturing Services (IMS). The Mechatronics segment designs, develops, and produces precision-engineered systems and machines, electromechanical assemblies, and high precision parts and components for original equipment manufacturers. It offers integrated one-stop outsourcing solutions, such as product design, development, and prototyping; project management and engineering support; strategic purchasing and sourcing; high precision parts and components manufacturing; final test and assembly of modules and complete systems/machines; and product life cycle management. This segment serves medical, semiconductor, analytical, and industrial/factory automation industries. The IMS segment provides integrated contract design and manufacturing services to the automotive, office automation, and consumer and industrial electronics industries. This segment offers a range of outsourcing services, including mechanical and electronic design and engineering support; tooling design and manufacture; plastic injection molded parts and components; printed circuit board assemblies; and final test and assembly of modules and box build products. The company also provides program and supply chain management services; modular and equipment system assembly, integration, testing, and commissioning services; and vacuum coating, thermal treatment, and other related services for plastic components. In addition, it manufactures sheet metal parts and dies; designs, engineers, manufactures, and sells oil filters; manufactures and distributes plastic products and components; designs and trades in micro-mechanical product components for automotive industry; and sells machines, as well as holds properties. Frencken Group Limited was founded in 1995 and is based in George Town, Malaysia.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Georgetown",
        "zipcode": "10200",
        "website": "http://www.frenckengroup.com",
        "market_cap": "Small Cap"
    }
}