{
    "DQWS": {
        "short_name": "DSWISS INC",
        "long_name": "DSwiss, Inc.",
        "summary": "DSwiss, Inc., a biotech-nutraceutical company, supplies health and beauty products in Malaysia, Singapore, Thailand, Indonesia, Hong Kong, and China. Its products include DSwiss coffee for digestive health; DSwiss kiwi, which helps the body's immune system, as well as enhances skin complexion, reduces blood pressure, and prevents heart disease and stroke; DSwiss Triple SC that focuses on stem cells; DSwiss silk mask, a mask for dry, damaged, and sensitive skin; DSwiss coffee slimming scrub, a natural body scrub for removing dirt on the skin layers; DSwiss peppermint slimming gel, a cooling agent; DSwiss new age essence delivers nutrients to moisten, brighten, and revive tired looking skin; and DSwiss enlighten essence (EE) cream, a light and nourishing cream. The company also provides DSwiss BioSpec, a medical eye-wear; Genmune-Pro, a product that helps the human's immunity system through enhancing the digestive health; SkinEra, a skin solution for acne, pimples, atopic dermatitis, dry skin, and allergy rashes; SensiBath gel; SuiSu hand purifiers and sanitizers, and air sanitizers, as well as Yumeka hair shampoo and conditioners; and MasterLiv to help support liver health, MasterHeart to help maintain optimum heart health and smooth blood circulation, and WellG, which provides nutrients needed for the metabolism of sugar and energy production. In addition, it offers DSwiss quantum magnetic analyzer, an equipment that reads and analyzes body energy field to test the health status and suggest recommendations; and AI skin analyzer machine, a facial camera for facial skin image data, as well as turnkey private label manufacturing services. Further, the company provides medical consumables, including surgical gowns and gloves, 3-ply face masks, N95 masks, protective goggles, body infrared thermometers, disposable bedsheets, and stretcher covers; and DNA microarray genotyping services. The company was incorporated in 2015 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://www.dswissbeauty.com",
        "full_time_employees": 6
    }
}