{
  "31M.F": {
    "city": "Kuala Lumpur",
    "country": "Malaysia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "MobilityOne Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MOBILITYONE LTD  LS -,025",
    "state": null,
    "summary": "MobilityOne Limited, an investment holding company, provides e-commerce infrastructure payment solutions and platforms through its proprietary technology solutions in Malaysia. The company operates in two segments, Telecommunication Services and Electronic Commerce Solutions; and Hardware. It offers payment terminals for retailers, which enables bill payments, mobile and e-games top-ups, loan repayments, credit and ATM card payments, cashbacks, and e-wallets payments; mobile payment applications; and payment solution products and services, such as bill and loan collection, e-voucher distribution, local and federal government payment, and other recurring payment services for corporates. The company also provides custom build enterprise payment solutions comprising agent and mobile banking, e-voucher, and POS systems; and messaging platform that enables bulk, secured, two way, and premium SMS. In addition, it offers e-channel products and services, technology man-aged services, and solution sales and consultancy services; and retails various goods, materials, and commodities. Further, the company provides IT systems and solutions; and electronic payment and product fulfillment services, as well as establishes a multi-channel electronic service bureau services. It markets its products under the MoCS and ABOSSE brands. The company serves mobile operators, transportation, financial institutions, hypermarkets, retailers, as well as other service providers requiring payment and transactional technology. MobilityOne Limited is based in Kuala Lumpur, Malaysia.",
    "website": "http://www.mobilityone.com.my",
    "zipcode": "57000"
  },
  "8611.HK": {
    "city": "Subang Jaya",
    "country": "Malaysia",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Information Technology Services",
    "long_name": "Mindtell Technology Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MINDTELL TECH",
    "state": null,
    "summary": "Mindtell Technology Limited, an investment holding company, provides information technology (IT) services in Malaysia and Singapore. It operates through System Integration and Development Services, IT Outsourcing Services, and Maintenance and Consultancy Services segments. It is involved in the design, procurement, installation, and maintenance of customized system applications for corporate customers. The company offers NS3, a square intelligence solution; and CUSTPRO, a customer relationship management system. It primarily serves customers in private and public sectors, including banks and financial institutions, government and statutory bodies, educational institutions, IT service firms, software principals, and other small and medium enterprises. Mindtell Technology Limited was founded in 2006 and is headquartered in Subang Jaya, Malaysia.",
    "website": "http://www.mindtelltech.com",
    "zipcode": "47650"
  },
  "MBO.L": {
    "city": "Kuala Lumpur",
    "country": "Malaysia",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Information Technology Services",
    "long_name": "MobilityOne Limited",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "MOBILITYONE LIMITED ORD 2.5P",
    "state": null,
    "summary": "MobilityOne Limited, an investment holding company, provides e-commerce infrastructure payment solutions and platforms through its proprietary technology solutions in Malaysia. The company operates in two segments, Telecommunication Services and Electronic Commerce Solutions; and Hardware. It offers payment terminals for retailers, which enables bill payments, mobile and e-games top-ups, loan repayments, credit and ATM card payments, cashbacks, and e-wallets payments; mobile payment applications; and payment solution products and services, such as bill and loan collection, e-voucher distribution, local and federal government payment, and other recurring payment services for corporates. The company also provides custom build enterprise payment solutions comprising agent and mobile banking, e-voucher, and POS systems; and messaging platform that enables bulk, secured, two way, and premium SMS. In addition, it offers e-channel products and services, technology man-aged services, and solution sales and consultancy services; and retails various goods, materials, and commodities. Further, the company provides IT systems and solutions; and electronic payment and product fulfillment services, as well as establishes a multi-channel electronic service bureau services. It markets its products under the MoCS and ABOSSE brands. The company serves mobile operators, transportation, financial institutions, hypermarkets, retailers, as well as other service providers requiring payment and transactional technology. MobilityOne Limited is based in Kuala Lumpur, Malaysia.",
    "website": "http://www.mobilityone.com.my",
    "zipcode": "57000"
  },
  "SEAV": {
    "city": "Kuala Lumpur",
    "country": "Malaysia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "SEATech Ventures Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "SEATECH VENTURES CORP",
    "state": null,
    "summary": "SEATech Ventures Corp., an investment holding company, provides business mentoring, nurturing, and incubating services relating to client businesses and corporate development advisory services in Asia. Its advisory services include ICT Start-Up Mentorship Program, which assists tech-based entrepreneurs in solving information and communication technology (ICT) industry pain points caused by technical insufficiencies, inappropriate financial modelling, and weak strategic positioning within a competitive environment. The company primarily serves businesses and entrepreneurs of the ICT and technology-based companies. SEATech Ventures Corp. was incorporated in 2018 and is headquartered in Kuala Lumpur, Malaysia.",
    "website": "http://seatech-ventures.com",
    "zipcode": "59200"
  }
}
