{
  "1891.HK": {
    "city": "Shah Alam",
    "country": "Malaysia",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Metal Fabrication",
    "long_name": "Heng Hup Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "HENG HUP",
    "state": null,
    "summary": "Heng Hup Holdings Limited, an investment holding company, operates as a scrap ferrous metal trader in Malaysia and internationally. It purchases scrap ferrous metals from various sources, and processes and sells them to steel mills. The company trades in scrap ferrous metals, used batteries, waste paper, and other scraps. Its customers for used batteries and waste paper are lead smelting plants and paper mills. The company was founded in 1996 and is headquartered in Shah Alam, Malaysia. Heng Hup Holdings Limited is a subsidiary of 5S Holdings (BVI) Limited.",
    "website": "http://www.henghup.com",
    "zipcode": null
  },
  "NPW.SI": {
    "city": "Port Klang",
    "country": "Malaysia",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Metal Fabrication",
    "long_name": "Malaysia Smelting Corporation Berhad",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "MSC",
    "state": null,
    "summary": "Malaysia Smelting Corporation Berhad, an investment holding company, engages in smelting tin concentrates and tin bearing materials in Malaysia. It operates through three segments: Tin Smelting, Tin Mining, and Others. The company also produces, sells, and delivers refined tin metal and by-products under the MSC brand name; explores and mines tin; and invests in other metal and mineral resources. In addition, it engages in tin warehousing; and properties holding and rental businesses. The company was founded in 1887 and is headquartered in Port Klang, Malaysia. Malaysia Smelting Corporation Berhad is a subsidiary of The Straits Trading Company Limited.",
    "website": "http://www.msmelt.com",
    "zipcode": "42920"
  }
}
