{
    "43E.SI": {
        "short_name": "$ VCPlus",
        "long_name": "VCPlus Limited",
        "summary": "VCPlus Limited, an investment holding company, engages in the exploration, mining, production, and sale of gold properties in Malaysia. It operates through Gold mining, Granite Business, and Corporate & Others segments. The company is also involved in the exploration, mining, quarry extraction, processing, and sale of granite products and dimension stone granites, as well as marble, aggregates, and related products. Its properties include the Lubuk Mandi and Bukit Chetai mines located in Terengganu, Malaysia. In addition, the company undertakes architectural stone and interior fit-out contracts; provides gold and related mineral mining consultancy services; offers business and management consultancy services; and operates as a contractor of natural resources, as well as undertakes general trading activities. The company was formerly known as Anchor Resources Limited and changed its name to VCPlus Limited in April 2021. VCPlus Limited was founded in 2011 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "55200",
        "website": "http://www.angkaalam.com",
        "market_cap": "Micro Cap"
    },
    "NINK": {
        "short_name": "NAMI CORP",
        "long_name": "NAMI Corp.",
        "summary": "NAMI Corp., through its subsidiaries, engages in the acquisition, exploration, discovery, development, mining, and production of mineral resources and properties in Malaysia. The group primarily explores for sea sand, river sand, and granite. It is also involved in the bauxite financing and trading activities. The company was incorporated in 2012 and is based in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "59200",
        "website": "http://www.nink-cs.com",
        "market_cap": "Small Cap"
    }
}