{
    "0802.HK": {
        "short_name": "CHINA E-WALLET",
        "long_name": "China e-Wallet Payment Group Limited",
        "summary": "China e-Wallet Payment Group Limited, an investment holding company, primarily engages in Internet and mobile's application and related accessories business in Hong Kong and other Asian countries. The company operates in two segments, Internet and Mobile's Application and Related Accessories; and Trading of Security & Biometric Products. The Internet and Mobile's Application and Related Accessories segment operates in the mobile payment platform and gaming industry. It provides application development for merchants; online gaming and utilities applications for mobile platform; and mass advertising services. The Trading of Security and Biometric Products segment offers biometrics and RFID products for consumer applications. It sells its products to distributors, system integrators, and security system providers. The company also invests in financial assets; develops hardware and software products; provides consultancy services; and develops Internet and Web software products, and computer systems. The company was formerly known as RCG Holdings Limited and changed its name to China e-Wallet Payment Group Limited in February 2017. China e-Wallet Payment Group Limited was founded in 1999 and is headquartered in Petaling Jaya, Malaysia.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    },
    "5CP.SI": {
        "short_name": "Silverlake Axis",
        "long_name": "Silverlake Axis Ltd",
        "summary": "Silverlake Axis Ltd, an investment holding company, provides software solutions and services to the banking, insurance, retail, government, payment, and logistics industries. Its products include Silverlake Axis integrated banking solutions, Silverlake Axis integrated Islamic banking solutions, Silverlake Axis integrated provident fund systems, Silverlake Axis cards systems, Silverlake digital banking MÃ\u0096BIUS open banking platforms, Silverlake Axis retail merchandising systems, Silverlake Axis enterprise payment platforms, Cyber Village converged Internet and mobile platforms, and Silverlake Symmetri retail banking solutions; IntelliSuite solutions; NowSuite solutions; and digital identity and security software solutions. The company also offers software project customization and implementation services to deliver end-to-end banking, payment, retail, digital identity, and security software solutions; software maintenance support and enhancement services; processing services for credit cards and other credit products on an outsourcing basis; and cloud computing software-as-a service platform for policy origination and claim processing for the insurance industry, as well as sells software and hardware products, including the resale of IBM hardware products and related system software. In addition, it engages in the commercialization of software-as-a-service solutions for the automotive industry; and provision of Internet and mobile, portal, customer loyalty, and e-commerce solutions and services. Silverlake Axis Ltd operates in South East Asia, North East Asia, South Asia, the Middle East, the Americas, Africa, and Europe. The company was founded in 1989 and is headquartered in Petaling Jaya, Malaysia. Silverlake Axis Ltd is a subsidiary of Intelligentsia Holding Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Software—Application",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "city": "Petaling Jaya"
    }
}