{
    "1C3.SI": {
        "short_name": "$ Samurai",
        "long_name": "Samurai 2K Aerosol Limited",
        "summary": "Samurai 2K Aerosol Limited manufactures, distributes, and markets aerosol coatings for the automotive refinishing and refurbishing industry. The company operates through three segments: Paint Â\u0096 Standard; Paint Â\u0096 Premium; and Maintenance and Others. The Paint Â\u0096 Standard segment offers standard color aerosol spray paint products. The Paint Â\u0096 Premium segment provides fluorescent, candy, and metallic color aerosol spray paint; high temperature aerosol spray paint; primer; epoxy; and 2K products, as well as multi-color one aerosol spray paint products. The Maintenance and Others segment offers cosmetic products, such as metal and paint polish; and maintenance products, including engine degreasers, chain oils, and carburetor and gasket cleaners, as well as brake cleaners, spray greases, motorcycle shampoos, tire shining products, and tire inflators. The company sells its products under the Samurai, Kurobushi, Khameleon, Canbrush, Ninjutsu, Geiji, CanArt, and Bushido brand names. It has operations in Malaysia, Indonesia, Thailand, the Philippines, Vietnam, Cambodia, the United Kingdom, the United States, Singapore, and India. Samurai 2K Aerosol Limited was founded in 1997 and is headquartered in Skudai, Malaysia.",
        "currency": "SGD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Malaysia",
        "state": null,
        "city": "Sekudai",
        "zipcode": "81120",
        "website": "http://www.samurai2kaerosol.com",
        "market_cap": 113218624
    },
    "GRPEF": {
        "short_name": "GRAPHENE NANOCHEM PLC",
        "long_name": "Graphene NanoChem plc",
        "summary": "Graphene NanoChem plc, a graphene commercialization company, designs, formulates, manufactures, and markets intermediate and performance chemicals, and advanced nano-materials. It offers oilfield chemicals, such as drilling fluids and lubricants for oil and gas industry; and advance materials, including nanofluids, nanocomposites, and conductive inks. The company was founded in 2006 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "state": null,
        "city": "Kuala Lumpur",
        "zipcode": "60000",
        "website": "http://www.graphenenanochem.com",
        "market_cap": 2582080
    },
    "VIP.AX": {
        "short_name": "VIP GLOVES FPO",
        "long_name": "VIP Gloves Limited",
        "summary": "VIP Gloves Limited, through its subsidiaries, researches, develops, manufactures, and sells nitrile disposable gloves in Malaysia and internationally. Its nitrile disposable gloves are used in medical and healthcare, food and beverages, electronics, and manufacturing industries. The company was formerly known as Voltage IP Limited and changed its name to VIP Gloves Limited in November 2018. VIP Gloves Limited was incorporated in 1992 and is based in Beranang, Malaysia.",
        "currency": "AUD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "state": null,
        "city": "Beranang",
        "zipcode": "43700",
        "website": "http://www.vipglove.com.my",
        "market_cap": 33007002
    }
}