{
    "ALONV.PA": {
        "short_name": "ALSTOM NV21",
        "long_name": "Alstom SA",
        "summary": "Alstom SA develops and markets systems, equipment, and services for the transport sector in Europe, the Americas, Asia and Pacific, the Middle-East, and Africa. The company offers metros, tramways, tram-trains and LRVs, suburban trains, regional and intercity trains, high-speed trains, and locomotives, and electric buses; and signaling products, such as urban, mainline, and freight and mining signaling. It also provides tram, metro, and main line systems; and tracklaying and track solutions, catenary free and ground feeding solutions, electrification solutions, and electromechanical equipment. In addition, the company provides maintenance, modernization, parts and repair, and support services. Further, it offers various components, including bogies, motors and generators, propulsion systems, switchgears, auxiliary converters, traction transformers, components propulsion, and dampers; and asset optimization, connectivity, digital passenger, and security and city mobility solutions. Alstom SA has a strategic cooperation agreement with Cylus to provide cybersecurity solutions for the rail market. The company was incorporated in 1992 and is headquartered in Saint-Ouen, France.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "St Ouen",
        "zipcode": "93400",
        "website": "http://www.alstom.com",
        "full_time_employees": 38900
    },
    "SUN.MX": {
        "short_name": "SCHNEIDER ELECTRIC SE",
        "long_name": "Schneider Electric S.E.",
        "summary": "Schneider Electric S.E. provides energy and automation digital solutions worldwide. The company operates in two segments, Energy Management and Industrial Automation. It offers busway and cable management products, circuit breakers and switches, contactors and protection relays, electrical protection and control products, fuse and safety switches, motor starters and protection components, power monitoring and control products, power quality and power factor correction products, pushbuttons, switches, pilot lights and joysticks, software products, surge protection and power conditioning products, and switchboards and enclosures. The company also provides access control, building management, fire and security, network infrastructure and connectivity, power monitoring and control, power quality and power factor correction, sensor, valve and valve actuator, variable speed drive and soft starter, and video management system products. In addition, it offers feeder automation and grid automation and SCADA software products, medium voltage switchgears and transformers, outdoor equipment, power monitoring and control products, protection relays, substation automation products, and switchgear components. Further, the company provides data center software, IT power distribution products, prefabricated data center modules, racks and accessories, security and environmental monitoring products, surge protection and power conditioning products, and uninterruptible power supply (UPS) products. Additionally, it offers electrical protection and control products, home automation and security products, installation materials and systems, light switches and electrical sockets, network infrastructure and connectivity products, and UPS. It also provides industrial automation and control products; energy access products, such as collective solutions and home systems; and solar and energy storage products. The company was founded in 1836 and is headquartered in Rueil-Malmaison, France.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "France",
        "state": null,
        "city": "Rueil-Malmaison",
        "zipcode": "92500",
        "website": "http://www.se.com/ww/en",
        "full_time_employees": 135000
    }
}