{
    "ALCLA.PA": {
        "short_name": "CLASQUIN",
        "long_name": "Clasquin SA",
        "summary": "CLASQUIN SA operates as an international freight forwarding and overseas logistics company in Franc, the rest of Europe, the Asia-Pacific, the United States, North Africa, the Middle East, and sub-Saharan Africa. It operates through two segments, Air and Sea Freight Forwarding and Related Services, and IT Service Contractor segments. The company offers air freight solutions, including shipment management and emergency transport management, as well as manages the freighting of oversized packages; sea freight solutions, such as full container load shipping management, consolidated shipping management, customized consolidated shipping management, and out-of-gauge cargo management, as well management of non-containerized loads and chartering ships; and rail solutions comprising road transport management, transport chartering for domestic and European shipments, shipment management, and rail transport management. It also provides roll on-roll off, and combined solutions for Northwest Africa; custom solutions and regulatory compliance services; international logistics services, which include analysis and design of customized storage and distribution, warehousing, stock management, order preparation, and value added services; international supply chain consulting services; risk management solutions; and digital solutions for the information management of the transport chain. The company offers its services for general cargo, fashion and luxury, retail, industrial, food and perishable, wine and spirits, cosmetics and perfumes, life sciences and healthcare, international and art shipping, fairs and events, temperature controlled logistics, hazardous and dangerous goods, and project logistics sectors. CLASQUIN SA was founded in 1959 and is headquartered in Lyon, France.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Lyon",
        "zipcode": "69451",
        "website": "http://www.clasquin.com",
        "market_cap": "Small Cap"
    },
    "STF.PA": {
        "short_name": "STEF",
        "long_name": "STEF SA",
        "summary": "STEF SA provides temperature-controlled logistics and transport services for agrifood manufacturers and retailers, and out-of-home foodservices. It transports fresh, frozen, and thermosensitive products, and seafood products. The company also provides maritime passenger and freight transport services between the continent and Corsica, as well as offers co-packing services. It offers its services in France, Italy, Spain, Portugal, Belgium, the Netherlands, and Switzerland. The company was founded in 1920 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Paris",
        "zipcode": "75008",
        "website": "http://www.stef.com",
        "market_cap": "Small Cap"
    },
    "XPO.PA": {
        "short_name": "XPO LOGISTICS",
        "long_name": "XPO Logistics Europe SA",
        "summary": "XPO Logistics Europe SA provides transport, logistics, and supply chain services. The company's services include full truckload, less-than-truckload, heavy haul, and last mile services; ocean and air services; and support services, such as documentation, customs clearance, cargo insurance, and project services. It also provides managed transportation services; and supply chain services comprising contract logistics, as well as value-add services, such as kitting, packaging, personalization, and reverse logistics. The company was formerly known as Norbert Dentressangle S.A. and changed its name to XPO Logistics Europe SA in 2015. The company was incorporated in 1977 and is headquartered in Lyon, France. XPO Logistics Europe SA operates as a subsidiary of XPO Logistics France SAS.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "state": null,
        "city": "Lyon",
        "zipcode": "69006",
        "website": "http://europe.xpo.com",
        "market_cap": "Mid Cap"
    }
}