{
  "MLCLP.PA": {
    "city": "Sainte-Marie",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Internet Retail",
    "long_name": "Colipays, S.A.",
    "market": "fr_market",
    "market_cap": null,
    "sector": "Consumer Cyclical",
    "short_name": "COLIPAYS",
    "state": null,
    "summary": "Colipays, S.A. provides package shipping services in France. It offers shipping services for tropical products comprising flowers, fruits, spices, rums, chocolates, preserves, etc. The company was incorporated in 1991 and is based in Sainte-Marie, France.",
    "website": "http://www.colipays.com",
    "zipcode": "97438"
  },
  "MLVAP.PA": {
    "city": "Lyon",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Internet Retail",
    "long_name": "Kumulus Vape S.A.",
    "market": "fr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "KUMULUS VAPE",
    "state": null,
    "summary": "Kumulus Vape S.A., an e-retailer, sells electronic cigarettes and related products in France. The company offers materials for beginners; equipment, including kits, boxes, and batteries, as well as clearomizers and rebuildables; flavored e-liquids; accessories, such as detached pieces, batteries, chargers, and storage products; and DIY novelties and accessories under approximately 250 brands. Kumulus Vape S.A. was founded in 2012 and is headquartered in Lyon, France.",
    "website": "http://www.kumulusvape.fr",
    "zipcode": "69960"
  },
  "SRP.PA": {
    "city": "Saint-Denis",
    "country": "France",
    "currency": "EUR",
    "exchange": "PAR",
    "industry": "Internet Retail",
    "long_name": "SRP Groupe S.A.",
    "market": "fr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "SHOWROOMPRIVE",
    "state": null,
    "summary": "SRP Groupe S.A. engages in the e-commerce business in France, Belgium, Spain, Italy, Portugal, Poland, the Netherlands, Germany, the United Kingdom, and Morocco. The company offers products in the categories of fashion, beauty and health, home and décor, travel and entertainment, furniture, and others, as well as small electronic and other home appliances through its mobile apps and Websites. It provides its products primarily under the showroomprive and showroomprive.com names, as well as Brandinvites and Crazy Days names. The company was founded in 2006 and is headquartered in Saint-Denis, France.",
    "website": "http://www.showroomprivegroup.com",
    "zipcode": "93210"
  }
}
