{
    "AQR.AX": {
        "short_name": "APNCONREIT STAPLED",
        "long_name": "APN Convenience Retail REIT",
        "summary": "APN Convenience Retail REIT (ASX code: AQR) is a listed Australian real estate investment trust which owns high quality Australian service stations and convenience retail assets. The Fund's portfolio of 79 properties valued at approximately $445 million, is predominantly located on Australia's eastern seaboard and is leased to leading Australian and international convenience retail tenants. The portfolio provides a long lease expiry profile and contracted annual rent increases delivering the Fund a sustainable and strong level of income security. Convenience Retail has a target gearing range of 25 Â\u0096 40% as part of its conservative approach to capital management. APN Convenience Retail REIT is governed by an Independent Board of Directors and is managed by APN Property Group, a specialist real estate investment manager established in 1996.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://apngroup.com.au/fund/apn-convenience-retail-reit/",
        "market_cap": "Small Cap"
    },
    "AVN.AX": {
        "short_name": "AVENTUS STAPLED",
        "long_name": "Aventus Group",
        "summary": "Aventus Group is Australia's largest fully-integrated owner, manager and developer of large format retail centres in Australia with a portfolio of 20 centres valued at $2.2 billion. Aventus Group portfolio spans 536,000m2 in gross leasable area and features a diverse tenant base of 593 quality tenancies, with national tenants representing 87 per cent of the total portfolio. Our team of more than 70 professionals offer expertise in investment management, asset management and corporate services, delivering operational excellence and value at every stage of the investment cycle. Our single-sector focus has allowed Aventus to achieve sustainable income growth since the Fund was listed in October 2015, with consistently high occupancy, positive leasing spreads and low incentives across the portfolio.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.aventusgroup.com.au",
        "market_cap": "Mid Cap"
    },
    "CDP.AX": {
        "short_name": "CARINDALE UNIT",
        "long_name": "Carindale Property Trust",
        "summary": "Westfield Carindale is situated in an affluent quarter of Brisbane's south-eastern suburbs approximately 12 kilometres from the Brisbane CBD. The centre services a trade area population of approximately 690,000 with the nearby Gateway Motorway offering residents to the north and south of the centre convenient access. One of the city's leading retail and lifestyle destinations, Westfield Carindale is home to many of Australia's most well-known retailers including David Jones, Myer, Harris Scarfe, Big W, Target, Coles, Woolworths, ALDI and Apple, as well as a host of premium fashion brands. An Event Cinemas complex and a range of other retailers including approximately 400 specialty stores complete the retail offer while the adjoining Carindale Home & Leisure Centre offers bulky goods retail.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.carindalepropertytrust.com.au",
        "market_cap": "Micro Cap"
    },
    "CNRAF": {
        "short_name": "VICINITY CENTRES",
        "long_name": "Vicinity Centres",
        "summary": "Vicinity Centres (Vicinity or the Group) is one of Australia's leading retail property groups. With a fully integrated asset management platform, and $24 billion in retail assets under management across 63 shopping centres, it is the second largest listed manager of Australian retail property. Vicinity has a Direct Portfolio with interests in 60 shopping centres (including the DFO Brisbane business) and manages 31 assets on behalf of Strategic Partners, 28 of which are co-owned by the Group. Vicinity is listed on the Australian Securities Exchange (ASX) under the code Â\u0091VCX' and has over 28,000 securityholders. Vicinity also has European medium term notes listed on the ASX under the code Â\u0091VCD'.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Chadstone",
        "zipcode": "3148",
        "website": "http://www.vicinity.com.au",
        "market_cap": "Mid Cap"
    },
    "CQR.AX": {
        "short_name": "CHRETAILRT UNIT",
        "long_name": "Charter Hall Retail Real Estate Investment Trust",
        "summary": "Charter Hall Retail REIT is the leading owner and manager of property for convenience retailers. Charter Hall Retail REIT is managed by Charter Hall Group (ASX:CHC). With over 29 years' experience in property investment and funds management, we're one of Australia's leading fully integrated property groups. We use our property expertise to access, deploy, manage and invest equity across our core sectors Â\u0096 office, retail, industrial and social infrastructure. Operating with prudence, Charter Hall Group as Manager of CQR has carefully curated a $40 billion diverse portfolio of over 1100 high quality, long leased properties. Partnership and financial discipline are at the heart of our approach. Acting in the best interest of customers and communities, we combine insight and inventiveness to unlock hidden value. Taking a long term view, our $7.3 billion development pipeline delivers sustainable, technologically enabled projects for our customers.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.charterhall.com.au/investments/funds/charter-hall-retail-reit",
        "market_cap": "Small Cap"
    },
    "HDN.AX": {
        "short_name": "HOMECO DNR UNITS",
        "long_name": "HomeCo Daily Needs REIT",
        "summary": "HomeCo Daily Needs REIT is an Australian Real Estate Investment Trust listed on the ASX with a mandate to invest in convenience-based assets across the target sub-sectors of Neighbourhood Retail, Large Format Retail and Health & Services. HomeCo Daily Needs REIT aims to provide unitholders with consistent and growing distributions. HomeCo Daily Needs REIT(ASX:HDN) operates independently of Home Consortium Limited as of December 31, 2020.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2028",
        "website": "http://www.home-co.com.au",
        "market_cap": "Small Cap"
    },
    "SCG.AX": {
        "short_name": "SCENTRE STAPLED",
        "long_name": "Scentre Group",
        "summary": "Scentre Group (ASX Code: SCG) is the owner and operator of Westfield in Australia and New Zealand with interests in 42 Westfield Living Centres, encompassing approximately 12,000 outlets.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.scentregroup.com",
        "market_cap": "Large Cap"
    },
    "SCP.AX": {
        "short_name": "SHOPCENAUS STAPLED",
        "long_name": "Shopping Centres Australasia Property Group",
        "summary": "SCA Property Group (SCP) includes two internally managed real estate investment trusts owning a portfolio of quality neighbourhood and sub-regional shopping centres located across Australia. The SCA Property Group invests in shopping centres predominantly anchored by non-discretionary retailers, with long term leases to tenants such as Woolworths Limited, Coles Group Limited and companies in the Wesfarmers Limited group. The SCA Property Group is a stapled entity comprising Shopping Centres Australasia Property Management Trust (ARSN 160 612 626) and Shopping Centres Australasia Property Retail Trust (ARSN 160 612 788).",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.scaproperty.com.au",
        "market_cap": "Mid Cap"
    },
    "STGPF": {
        "short_name": "SCENTRE GROUP LIMITED",
        "long_name": "Scentre Group",
        "summary": "Scentre Group (ASX Code: SCG) is the owner and operator of Westfield in Australia and New Zealand with interests in 42 Westfield Living Centres, encompassing approximately 12,000 outlets.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.scentregroup.com",
        "market_cap": "Large Cap"
    },
    "VCX.AX": {
        "short_name": "VICINITY STAPLED",
        "long_name": "Vicinity Centres",
        "summary": "Vicinity Centres (Vicinity or the Group) is one of Australia's leading retail property groups. With a fully integrated asset management platform, and $24 billion in retail assets under management across 63 shopping centres, it is the second largest listed manager of Australian retail property. Vicinity has a Direct Portfolio with interests in 60 shopping centres (including the DFO Brisbane business) and manages 31 assets on behalf of Strategic Partners, 28 of which are co-owned by the Group. Vicinity is listed on the Australian Securities Exchange (ASX) under the code Â\u0091VCX' and has over 28,000 securityholders. Vicinity also has European medium term notes listed on the ASX under the code Â\u0091VCD'.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Retail",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Chadstone",
        "zipcode": "3148",
        "website": "http://www.vicinity.com.au",
        "market_cap": "Mid Cap"
    }
}