{
    "ARF.AX": {
        "short_name": "ARENA REIT STAPLED",
        "long_name": "Arena REIT",
        "summary": "Arena REIT is an ASX300 listed property group that owns, manages and develops social infrastructure properties across Australia. Our current portfolio of social infrastructure properties is leased to a diversified tenant base in the growing early learning and healthcare sectors.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Specialty",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.arena.com.au",
        "market_cap": 1168876288
    },
    "CQE.AX": {
        "short_name": "CHSOCINFRA UNIT",
        "long_name": "Charter Hall Social Infrastructure REIT",
        "summary": "Charter Hall Social Infrastructure REIT is the largest Australian ASX-listed real estate investment trust (A-REIT) that invests in social infrastructure properties. Charter Hall Social Infrastructure REIT is managed by Charter Hall Group (ASX:CHC). With over 29 years' experience in property investment and funds management, we're one of Australia's leading fully integrated property groups. We use our property expertise to access, deploy, manage and invest equity across our core sectors Â\u0096 office, retail, industrial and social infrastructure. Operating with prudence, Charter Hall as manager of CQE, has carefully curated a $40 billion plus diverse portfolio of over 1,100 high quality, long leased properties. Partnership and financial discipline are at the heart of our approach. Acting in the best interest of customers and communities, we combine insight and inventiveness to unlock hidden value. Taking a long term view, our $7.3 billion development pipeline delivers sustainable, technologically enabled projects for our customers. The impacts of what we do are far-reaching. From helping businesses succeed by supporting their evolving workplace needs, to providing investors with superior returns for a better retirement, we're powered by the drive to go further.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Specialty",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.charterhall.com.au/investments/funds/cqe",
        "market_cap": 1274113280
    },
    "HRR-UN.TO": {
        "short_name": "AUSTRALIAN REIT INCOME FUND",
        "long_name": "Australian REIT Income Fund",
        "summary": "Australian REIT Income Fund is an equity mutual fund launched by Harvest Portfolios Group Inc. The fund is managed by Macquarie Private Portfolio Management. It invests in public equity markets of Australia. The fund invests primarily in publically listed Australian real estate investment trusts and companies engaged in real estate industry in Australia. Australian REIT Income Fund is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Real Estate",
        "industry": "REIT - Specialty",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": null,
        "website": null,
        "market_cap": 8139415
    },
    "RFF.AX": {
        "short_name": "RURALFUNDS STAPLED",
        "long_name": "Rural Funds Group",
        "summary": "Rural Funds Group is an agricultural Real Estate Investment Trust (REIT) listed on the ASX under the code RFF. RFF owns a diversified portfolio of Australian agricultural assets which are leased predominantly to corporate agricultural operators. RFF targets distribution growth of 4% per annum by owning and improving farms that are leased to good counterparties.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Specialty",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "ACT",
        "city": "Deakin",
        "zipcode": "2600",
        "website": "http://ruralfunds.com.au/rural-funds-group/",
        "market_cap": 2535442432
    },
    "WPR.AX": {
        "short_name": "WAYPOINTRT STAPLED",
        "long_name": "Waypoint REIT Limited",
        "summary": "Waypoint REIT is Australia's largest listed REIT owning solely service station and convenience retail properties with a high quality portfolio of properties across all Australian States and mainland Territories. Waypoint REIT's objective is to maximize the long-term income and capital returns from its ownership of the portfolio for the benefit of all security holders. Waypoint REIT is a stapled entity in which one share in Waypoint REIT Limited (ABN 35 612 986 517) is stapled to one unit in the Waypoint REIT Trust (ARSN 613 146 464).",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Specialty",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Docklands",
        "zipcode": "3008",
        "website": "http://www.waypointreit.com.au",
        "market_cap": 6217384960
    }
}