{
    "BWP.AX": {
        "short_name": "BWP TRUST ORD UNITS",
        "long_name": "BWP Trust",
        "summary": "Established and listed on the Australian Securities Exchange (Â\u0093ASXÂ\u0094) in 1998 (see prospectus), BWP Trust (Â\u0093BWPÂ\u0094 or Â\u0093the TrustÂ\u0094) is a real estate investment trust investing in and managing commercial properties throughout Australia. The majority of the Trust's properties are large format retailing properties, in particular, Bunnings Warehouses, leased to Bunnings Group Limited (Â\u0093BunningsÂ\u0094). Bunnings is the leading retailer of home improvement and outdoor living products in Australia and New Zealand, and a major supplier to project builders, commercial trades people, and the housing industry. Full details on the Trust's property portfolio can be found in the Our Properties section of this website. The Trust is managed by an external responsible entity, BWP Management Limited (Â\u0093the responsible entityÂ\u0094) which is appointed under the Trust's constitution and operates under an Australian Financial Services Licence. The responsible entity is committed to managing the Trust solely and is paid an annual fee based on the gross assets of the Trust. Both Bunnings and the responsible entity are wholly-owned subsidiaries of Wesfarmers Limited (Â\u0093WesfarmersÂ\u0094), one of Australia's largest listed companies. Wesfarmers also owns approximately 24.75 per cent of the issued units in the Trust.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.bwptrust.com.au",
        "market_cap": 2761184256
    },
    "CIP.AX": {
        "short_name": "CEN I REIT ORD UNIT",
        "long_name": "Centuria Industrial REIT",
        "summary": "CIP is Australia's largest domestic pure play industrial REIT and is included in the S&P/ASX 200 Index. CIP's portfolio of high-quality industrial assets is situated in key metropolitan locations throughout Australia and is underpinned by a quality and diverse tenant base. CIP is overseen by a hands on, active manager and provides investors with income and an opportunity for capital growth from a pure play portfolio of high quality Australian industrial assets. Centuria Property Funds No. 2 Limited (CPF2L), is the Responsible Entity for the ASX-listed Centuria Industrial REIT (CIP). CPF2L, is a wholly owned subsidiary of Centuria Capital Group (CNI). CNI is an ASX-listed specialist investment manager with $10.2 billion in total assets under management and strong offerings across listed real estate investment trusts, unlisted real estate funds and investment bonds.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.centuria.com.au/industrial-reit/home/",
        "market_cap": 2047203840
    },
    "NSR.AX": {
        "short_name": "NSREIT STAPLED",
        "long_name": "National Storage REIT",
        "summary": "National Storage is the largest self-storage provider in Australia and New Zealand, with 194 centres providing tailored storage solutions to over 70,000 residential and commercial customers. NSR is the first independent, internally managed and fully integrated owner and operator of self-storage centres to be listed on the Australian Securities Exchange (ASX).",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Industrial",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.nationalstorage.com.au",
        "market_cap": 6412794880
    }
}