{
    "ANLT.TA": {
        "short_name": "ANALYST INV MGT SV",
        "long_name": "Analyst I.M.S. Investment Management Services Ltd",
        "summary": "Analyst I.M.S. Investment Management Services Ltd is a publicly owned investment manager. The firm provided its services to private clients, private and public corporations and institutional clients. Through its subsidiaries, the firm provides portfolio management, financial services consulting, trust funds with different specializations, fund management, underwriting services, and management and consulting services for its clients. Analyst I.M.S. Investment Management Services Ltd was founded in 1985 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "CPTP.TA": {
        "short_name": "CAPITAL POINT LTD",
        "long_name": "Capital Point Ltd.",
        "summary": "Capital Point Ltd. is a venture capital firm specializing in incubation financing and investments in early stage companies. It primarily seeks to invest in high-tech ventures primarily on medical devices, bio-technology, & environmental technologies. The firm typically seeks to invest in Israel. Capital Point Ltd. was founded in 2000 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "ELDAV.TA": {
        "short_name": "ELDAV INVESTMENTS",
        "long_name": "Eldav Investments Ltd.",
        "summary": "Eldav Investments Ltd. is a private equity firm specializing in buyout, mature, and acquisition of mid to large sized companies. It seeks to invest in industrial, service, finance and commercial companies. The firm invests internationally. It prefers to take majority stake in companies. Eldav Investments Ltd. was founded in 2007 and is based in Tel-Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "EMDV.TA": {
        "short_name": "EMILIA DEV (O.F.G)",
        "long_name": "Emilia Development (O.F.G) Ltd.",
        "summary": "Emilia Development (O.F.G) Ltd. manages a portfolio of investments in the industrial services, distribution, and logistics sectors. The company produces and distributes chemical and raw materials to a range of industries; and markets and distributes liquid flow solutions for industrial piping, housing and construction, valves, fire protection, infrastructure, control and automation, pumps, plumbing, and sanitation products. It also provides logistics solutions, including warehousing and transportation; and produces various consumer personal care and cosmetic products private labels of international chain stores and brands. The company was founded in 1945 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramat Gan"
    },
    "GNRS.TA": {
        "short_name": "GENERATION CAPITAL",
        "long_name": "Generation Capital Ltd",
        "summary": "Generation Capital Ltd was founded in 2018 and is headquartered in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "HAIN.TA": {
        "short_name": "HALMANALDUB INV",
        "long_name": "Halman Aldubi Investment House Ltd",
        "summary": "Halman Aldubi Investment House Ltd is a government pension plan sponsor. The firm provides medium and long term savings and investment products in Israel. The company offers pension funds, provident funds, study funds, individual retirement account, and investment portfolio management services. It serves private, business, and institutional clients. The firm was formerly known as Halman - Aldubi Provident and Pension Funds Ltd. Halman Aldubi Investment House Ltd was founded in 1995 and is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Holon"
    },
    "MISH.TA": {
        "short_name": "MIVTACH SHAMIR HDS",
        "long_name": "Mivtach Shamir Holdings Ltd",
        "summary": "Mivtach Shamir Holdings Ltd is a venture capital and private equity firm specializing in investments in companies that have encountered difficulties, with the aim of leading them to turnaround. It seeks to make investments in technology and communications; real-estate; and industrial companies. The firm is engaged in the rental of real estate and investment in companies in various fields. It also seeks to invest in India and Europe. Mivtach Shamir Holdings Ltd was founded in 1958 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "MRIN.TA": {
        "short_name": "Y.D. MORE INVST",
        "long_name": "Y.D. More Investments Ltd",
        "summary": "Y.D. More Investments Ltd engages in the investment management business in Israel. It manages investment portfolios, mutual funds, provident funds, study funds, alternative investments, and foreign securities. The company was founded in 2006 and is based in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramat Gan"
    },
    "MTDS.TA": {
        "short_name": "MEITAV DASH INV",
        "long_name": "Meitav DASH Investments Ltd",
        "summary": "Meitav DS Investments Ltd is a publicly owned investment manager. The firm provides its services to private, business and institutional clients. It engages in the fund management activities in Israel. The firm manages investment portfolios, mutual funds, and provident funds, as well as pension, education, and other purpose funds. It also manages separate client-focused portfolios. Meitav DS Investments Ltd was formerly known as DS Apex Holdings Ltd. and changed its name in July 2013. Meitav DS Investments Ltd is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Bnei Brak"
    },
    "MYDS.TA": {
        "short_name": "MYDAS REAL ESTATE",
        "long_name": "Mydas Real Estate Investments Ltd",
        "summary": "Mydas Real Estate Investmens Ltd, formerly known as Mydas Investment Fund Ltd., owns and operates retirement homes and hotels. Mydas Investment Fund Ltd. was formerly known as Spancrete (1990) Ltd. Mydas Real Estate Investmens Ltd is based in Soreq Valley, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "SPRG.TA": {
        "short_name": "SPRING VENTURES",
        "long_name": "Spring Ventures Ltd.",
        "summary": "Spring Ventures Ltd. engages in technology related businesses in Israel. The company was formerly known as buy2 networks Ltd. and changed its name to Spring Ventures Ltd. in November 2016. Spring Ventures Ltd. was founded in 1999 and is based in Hod-Hasharon, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Hod-Hasharon"
    },
    "TNPV.TA": {
        "short_name": "TECHNOPLUS VENTURE",
        "long_name": "TechnoPlus Ventures Ltd.",
        "summary": "TechnoPlus Ventures Ltd. is a venture capital and a private equity firm specializing in investments in middle market, mature, later stage companies, turnarounds, and mezzanine financing in small to medium growing companies. The firm primarily invests in technology companies with unique technological capabilities backed with patnet or Know How. It typically invests in companies based in Israel and the United States. The firms prefers to invest between $0.5 million and $2 million in companies with revenue between $5 million and $20 million and positive cash flow. It seeks to hold its investments for one year to three years and exits through an initial public offering or merger and acquisition. It invests using its personal capital. The firm also seeks to co-invest. TechnoPlus Ventures Ltd. was founded in 1997 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "TRNLY": {
        "short_name": "THE TRENDLINES GROUP LTD.",
        "long_name": "The Trendlines Group Ltd.",
        "summary": "The Trendlines Group Ltd. is an innovation commercialization company specializing in incubation and seed/start-up investments. The firm seeks to engage in investing and incubating innovation-based early-stage medical and agricultural technologies. It considers investments in Israel and Singapore. The firm offers business incubation, partner and channel development, market strategies, business plans, research and development and commercialization activities, business development, finance and funding strategies, administrative services and marketing communications services to entrepreneurs. The firm seeks to invest a minimum of $0.06 million in its portfolio companies. The firm prefers to exit its investments through merger and acquisition transactions, listing on public stock exchanges, or other dispositions of holdings. It leverages its own capital with government funding to mitigate risk in creating and developing new businesses. It is involved in all aspects of its portfolio companies from technology development to business building. The Trendlines Group Ltd. was founded in 2007 and is based in M.P. Misgav, Israel with additional offices in Tel Aviv, Israel; Beijing, China; and Singapore.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "M.P. Misgav"
    },
    "TUZA.TA": {
        "short_name": "TEUZA",
        "long_name": "Teuza - A Fairchild Technology Venture Ltd.",
        "summary": "Teuza - A Fairchild Technology Venture Ltd. specializes in expansion capital and mezzanine investments. The fund prefers to invest in seed stage, start ups, early stage, mid venture, late venture, and middle market companies. It seeks to invest in semiconductors, software enterprise and information technology software, healthcare, electronics, medical equipment and devices, biotechnology, telecommunications, and communications. The fund prefers to invest in companies based in Israel, China, Canada, and United States of America. It seeks to invest $1 million to $2 million per investment. The fund prefers to invest in equity for a 25 percent to 49 percent stake in its portfolio companies; taking membership on the Board of Directors of its portfolio companies; and exits its investments through an IPO or an M&A transaction.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "XENA.TA": {
        "short_name": "XENIA VENTURE",
        "long_name": "Xenia Venture Capital Ltd",
        "summary": "Xenia Venture Capital Ltd is a venture capital firm specializing in seed, startups, early stage, and incubation investments. The firm prefers to invest in the high and medium technology sector with a focus on information technology, software (including enterprise IT, gaming, Internet, and mobile etc.), bio-tech, life science, and medical devices. It typically invests in companies based in Israel. The firm typically invests between $0.5 million and $1 million in seed financing. It also seeks to provide follow-on financing, mentoring, business and strategic counseling, fund raising assistance and exit planning as well as peripheral services pertaining to logistics, finance & accounting, office services and more. Xenia Venture Capital Ltd was founded in mid-2003 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    }
}