{
    "1FZA.F": {
        "short_name": "FORESIGHT AUT.SP.ADR IS 1",
        "long_name": "Foresight Autonomous Holdings Ltd.",
        "summary": "Foresight Autonomous Holdings Ltd., a technology company, engages in the design, development, and commercialization of sensor systems for the automotive industry. It develops in-line-of-sight vision systems and beyond-line-of-site cellular-based applications. The company offers QuadSight system, a quad-camera multi-spectral vision system for the semi-autonomous and autonomous vehicle market; V2X (vehicle-to-everything), an accident prevention solution based on real-time multi-agents positioning algorithms that enables communication between vehicles, infrastructure, grid, home, and network; and Eye-Net Protect, a cellular-based V2X solution that provides real-time pre-collision alerts to vulnerable road users, such as pedestrians, cyclists, scooter drivers, etc. by using smartphones. It has a strategic cooperation agreement with FLIR Systems, Inc. to develop, market, and distribute QuadSight vision system. The company was formerly known as Asia Development (A.D.B.M.) Ltd. and changed its name to Foresight Autonomous Holdings Ltd. in 2016. Foresight Autonomous Holdings Ltd. was incorporated in 1977 and is headquartered in Ness Ziona, Israel.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "FRSX": {
        "short_name": "Foresight Autonomous Holdings L",
        "long_name": "Foresight Autonomous Holdings Ltd.",
        "summary": "Foresight Autonomous Holdings Ltd., a technology company, engages in the design, development, and commercialization of sensor systems for the automotive industry. It develops in-line-of-sight vision systems and beyond-line-of-site cellular-based applications. The company offers QuadSight system, a quad-camera multi-spectral vision system for the semi-autonomous and autonomous vehicle market; V2X (vehicle-to-everything), an accident prevention solution based on real-time multi-agents positioning algorithms that enables communication between vehicles, infrastructure, grid, home, and network; and Eye-Net Protect, a cellular-based V2X solution that provides real-time pre-collision alerts to vulnerable road users, such as pedestrians, cyclists, scooter drivers, etc. by using smartphones. It has a strategic cooperation agreement with FLIR Systems, Inc. to develop, market, and distribute QuadSight vision system. The company was formerly known as Asia Development (A.D.B.M.) Ltd. and changed its name to Foresight Autonomous Holdings Ltd. in 2016. Foresight Autonomous Holdings Ltd. was incorporated in 1977 and is headquartered in Ness Ziona, Israel.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "FRSX.TA": {
        "short_name": "FORESIGHT AUTONOM",
        "long_name": "Foresight Autonomous Holdings Ltd.",
        "summary": "Foresight Autonomous Holdings Ltd., a technology company, engages in the design, development, and commercialization of sensor systems for the automotive industry. It develops in-line-of-sight vision systems and beyond-line-of-site cellular-based applications. The company offers QuadSight system, a quad-camera multi-spectral vision system for the semi-autonomous and autonomous vehicle market; V2X (vehicle-to-everything), an accident prevention solution based on real-time multi-agents positioning algorithms that enables communication between vehicles, infrastructure, grid, home, and network; and Eye-Net Protect, a cellular-based V2X solution that provides real-time pre-collision alerts to vulnerable road users, such as pedestrians, cyclists, scooter drivers, etc. by using smartphones. It has a strategic cooperation agreement with FLIR Systems, Inc. to develop, market, and distribute QuadSight vision system. The company was formerly known as Asia Development (A.D.B.M.) Ltd. and changed its name to Foresight Autonomous Holdings Ltd. in 2016. Foresight Autonomous Holdings Ltd. was incorporated in 1977 and is headquartered in Ness Ziona, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ness Ziona"
    },
    "INVZ": {
        "short_name": "Innoviz Technologies Ltd.",
        "long_name": "Innoviz Technologies Ltd.",
        "summary": "Innoviz Technologies Ltd. designs and manufactures solid state LiDAR sensors and develops perception software that enable the mass-production of autonomous vehicles. The company manufactures InnovizOne, a solid-state LiDAR sensor designed for automakers and robotaxi, shuttle, trucking, and delivery companies requiring an automotive-grade and mass-producible solution to achieve autonomy. Its automotive-grade sensor is integrable into Level 3 through 5 autonomous vehicles for the safety of passengers and pedestrians. The company also provides InnovizTwo, an automotive-grade LiDAR sensor that offers a solution for all levels of autonomous driving, as well as option to integrate the perception application in the LiDAR sensor; and perception application, a software application that turns the InnovizOne LiDAR's raw point cloud data into perception outputs to provide superior scene perception and deliver an automotive-grade ASIL B(D) solution. Its products can be used in various industries, including robotaxis, shuttles, delivery vehicles, buses, trucking, drones, and robotics, as well as construction, agriculture, smart city, security, mining, maritime, and mapping. The company operates in Europe, the Middle East, Africa, and North America. Innoviz Technologies Ltd. was incorporated in 2016 and is headquartered in Rosh HaAyin, Israel.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Rosh Haayin"
    },
    "PLSN.TA": {
        "short_name": "PLASSON INDUSTRIES",
        "long_name": "Plasson Industries Ltd",
        "summary": "Plasson Industries Ltd provides various solutions for connecting PE pipes worldwide. It offers electrofusion fittings, adjustable elbows, mechanical fittings, wastewater systems, PE ball valves, controllers, excess flow valves, geothermal systems, and large diameter electrofusion couplers, as well as fittings for polyethylene pipe systems. The company also offers a range of bathroom and kitchen products, such as bida seats, faucets, bathroom accessories, bath sinks, drainage channels, toilets and toilet seats, and rinsing tanks, as well as spare parts for plasaun products. It provides various systems for the controlled supply of potable water, automatic feeding, and climate control for poultry and livestock, including broilers, turkeys, breeders, layers, and swine, as well as offers professional solutions. In addition, the company offers Quality Point Management (QPM) that enables organizations to drive a pro-active quality management approach in infrastructure projects & maintenance. Its products are used in municipal water distribution, gas conveyance, industrial fluids transfer, wastewater systems, communication, mines and agriculture. The company was founded in 1963 and is headquartered in Menashe, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Menashe"
    },
    "RVL.TA": {
        "short_name": "RAVAL ICS LTD",
        "long_name": "Raval ACS Ltd.",
        "summary": "Raval ACS Ltd. develops, produces, and sells automotive fuel tank venting systems. It offers venting system solutions for gasoline, diesel, and bio fuel systems; and cleaner and check valves. The company has operations in Israel, the United States, Luxemburg, Germany, Russia, Japan, China, Korea, and India. Raval ACS Ltd. was founded in 2000 and is headquartered in Beer-Sheva, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Beer-Sheva"
    },
    "SHNP.TA": {
        "short_name": "E SCHNAPP CO WORKS",
        "long_name": "E. Schnapp & Co. Works Ltd",
        "summary": "E. Schnapp & Co. Works Ltd manufactures and sells batteries for vehicles. The company offers car, start and stop, motorcycle, and ATV batteries; battery accumulators; solar fire detection UPS backup batteries; washing machine batteries; and chargers and battery testers, as well as batteries for plateau levels, cinema and electric vehicles, and trailers and boats. It also exports its products internationally. The company serves various government ministries, the Ministry of Defense, IDF, military and air industries, and Israeli ports; and electricity, bus, and rental and leasing companies, as well as companies that import cars to Israel. E. Schnapp & Co. Works Ltd was founded in 1951 and is headquartered in Netanya, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "TDGN-L.TA": {
        "short_name": "TADIR-GAN",
        "long_name": "Tadir-Gan (Precision Products) 1993 Ltd.",
        "summary": "Tadir-Gan (Precision Products) 1993 Ltd., together with its subsidiary, produces, processes, and markets mechanical assemblies made of aluminum and magnesium for the automotive industry in Israel. The company offers products made from, including engine parts, such as oil basins, valve caps, sealing caps, parts for transfer tankers, chalk, parts of steering rods, and other products. Tadir-Gan (Precision Products) 1993 Ltd. was incorporated in 1993 and is based in Afula, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Afula"
    }
}