{
    "AMX.TA": {
        "short_name": "AUTOMAX MOTORS LTD",
        "long_name": "Automax Motors Ltd",
        "summary": "Automax Motors Ltd. does not have significant operations. Previously, it was engaged in offering domain monetization and mobile digital advertising services to advertisers, advertising agencies, app developers, and domain owners. The company was formerly known as Matomy Media Group Ltd and changed its name to Automax Motors Ltd. in April 2021. Automax Motors Ltd. was incorporated in 2006 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5250608",
        "website": "http://investors.matomy.com",
        "market_cap": null
    },
    "CRSO.TA": {
        "short_name": "CARASSO MOTORS LTD",
        "long_name": "Carasso Motors Ltd.",
        "summary": "Carasso Motors Ltd. engages in the import and sale of automobiles in Israel. The company offers new and used cars; and various financing programs. It operates through 11 branches in Haifa, Nazareth, Afula, Tiberias, Carmiel, Netanya, Jerusalem, Kfar Saba, Rishon LeZion, Ashdod, and Be'er Sheva. Carasso Motors Ltd. was founded in 2007 and is based in Bnei Ayish, Israel. Carasso Motors Ltd. is a subsidiary of The Carasso Group.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Bnei Ayish",
        "zipcode": null,
        "website": "http://www.carassotradein.co.il",
        "market_cap": null
    },
    "DLEA.TA": {
        "short_name": "DELEK AUTOMOTIVE S",
        "long_name": "Delek Automotive Systems Ltd.",
        "summary": "Delek Automotive Systems Ltd. imports and distributes cars and motorcycles in Israel. The company also operates technical training centers, garages, distribution centers for spare parts, and car supply centers. In addition, it offers insurance services for vehicles and car repair services. It operates through showrooms and sub-agencies, as well as operates approximately 60 service centers. The company was formerly known as Gal Â\u0096 Wisepiler and Karts Indsutiries Ltd. and changed its name to Delek Automotive Systems Ltd. in February 1994. Delek Automotive Systems Ltd. was founded in 1965 and is headquartered in Nir Tzvi, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Nir Tzvi",
        "zipcode": "7290500",
        "website": "http://delek-motors.co.il",
        "market_cap": null
    }
}