{
  "1BT.F": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Enlivex Therapeutics Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "ENLIVEX THERAP.LTD.IS-,01",
    "state": null,
    "summary": "Enlivex Therapeutics Ltd. operates as a clinical stage immunotherapy company. It is developing Allocetra, an off-the-shelf cell therapy designed to reprogram macrophages into homeostatic state. Resetting non-homeostatic macrophages into homeostatic state is critical for immune system rebalancing and resolution of life-threatening conditions. Diseases, such as solid cancers, sepsis, COVID-19, and others reprogram macrophages out of homeostatic state. Its Allocetra has the potential to provide a novel immunotherapeutic mechanism of action for life-threatening clinical indications that are defined as unmet medical needs, as a stand-alone therapy or in combination with therapeutic agents. The company has a research collaboration with Yale Cancer Center for the assessment of Allocetra to enhance the activity of checkpoint inhibitors in solid tumors. Enlivex Therapeutics Ltd. was incorporated in 2005 and is headquartered in Nes Ziona, Israel.",
    "website": "http://www.enlivex.com",
    "zipcode": "7403618"
  },
  "2F5.F": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "BiondVax Pharmaceuticals Ltd.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "BIOND.PHAR.S.ADS/40 IL-01",
    "state": null,
    "summary": "BiondVax Pharmaceuticals Ltd., a clinical stage biopharmaceutical company, focuses on developing and commercializing immunomodulation therapies for infectious diseases primarily in Israel. Its product candidate is M-001, a synthetic peptide-based protein, which is in Phase III clinical trials for treatment of seasonal and pandemic strains of the influenza virus. The company was founded in 2003 and is headquartered in Jerusalem, Israel.",
    "website": "http://www.biondvax.com",
    "zipcode": "7414002"
  },
  "APOP": {
    "city": "Kfar Saba",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Cellect Biotechnology Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "Cellect Biotechnology Ltd.",
    "state": null,
    "summary": "Cellect Biotechnology Ltd., a biotechnology company, engages in developing ApoGraft, a technology platform that functionally selects stem cells to enhance the safety of regenerative medicine and stem cell therapies in Israel. The company develops ApoTainer, a kit for hematopoietic stem cell transplantation procedures. It has collaborations with the denovoMATRIX group of the Technische Universität Dresden to conduct examinations into the tentative synergy between ApoGraft and denovoMAtrix technology for the purpose of evaluating collaborative development of products for regenerative medicine; Cell2in Inc. to conduct scientific evaluations combining ApoGraft with Cell2in's identification technology FreSHtracer, which monitors stem cell quality by utilizing a fluorescent dye to characterize their oxidative stress state; and XNK therapeutics to focus on the development of cell-based therapeutics from NK cells. The company was formerly known as Cellect Biomed Ltd. and changed its name to Cellect Biotechnology Ltd. in July 2016. Cellect Biotechnology Ltd. was incorporated in 1986 and is headquartered in Kfar Saba, Israel.",
    "website": "http://www.cellect.co",
    "zipcode": "44425"
  },
  "AYLA": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "Ayala Pharmaceuticals, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Ayala Pharmaceuticals, Inc.",
    "state": null,
    "summary": "Ayala Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, focuses on developing and commercializing small molecule therapeutics for patients suffering from rare and aggressive cancers. The company's lead product candidate is AL101, which is an intravenous injectable small molecule gamma secretase inhibitor (GSI) that is in Phase II clinical trial for the treatment of recurrent/metastatic adenoid cystic carcinoma for patients bearing Notch-activating mutations. It is also involved in developing AL102, an oral injectable small molecule GSI that is in Phase I clinical trial for the treatment of desmoid tumors. Ayala Pharmaceuticals, Inc. has a collaboration agreement with Novartis International Pharmaceutical Limited to develop AL102 for the treatment of multiple myeloma. The company was incorporated in 2017 and is headquartered in Rehovot, Israel.",
    "website": "http://www.ayalapharma.com",
    "zipcode": "7670104"
  },
  "BBIXF": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Bonus BioGroup Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "BONUS BIOGROUP LTD",
    "state": null,
    "summary": "Bonus BioGroup Ltd., a biotechnology company, develops technology solutions to generate tissue-regenerating bone grafts. It develops tissue-regenerating bone grafts from cells derived from the patient's own cells for the treatment of skeletal disorders, such as bone trauma and arthritis. The company's products include BonoFill injectable bone graft that is suitable for bone repair applications, including jaw bone cysts; and BonoFill pre-designed bone graft, which is used to repair large and segmental bone defects. Its products in pipeline comprise bone grafts for maxillofacial and orthopedic applications; novel nanomaterials technology for tissue regeneration; and large vascularized bone grafts. The company was formerly known as Oceana Advanced Industries Ltd. and changed its name to Bonus BioGroup Ltd. Bonus BioGroup Ltd. was founded in 1981 and is based in Haifa, Israel.",
    "website": "http://www.bonusbiogroup.com",
    "zipcode": "31905"
  },
  "BLRX": {
    "city": "Hevel Modi'in",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "BioLineRx Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "BioLineRx Ltd.",
    "state": null,
    "summary": "BioLineRx Ltd., a clinical-stage biopharmaceutical development company, focuses on oncology. Its development pipeline consists of clinical-stage therapeutic candidates, which include BL-8040, a peptide for the treatment of solid tumors, hematological malignancies, and stem cell mobilization; AGI-134, an immuno-oncology agent in the development for solid tumors; and BL-5010, a customized, proprietary, pen-like applicator for the non-surgical removal of skin lesions. The company has collaboration agreement with MSD for the cancer immunotherapy field; MD Anderson Cancer Center to investigate the combination of BL-8040 with KEYTRUDA (pembrolizumab) in pancreatic cancer; and Genentech Inc. to investigate the combination of BL-8040 for solid tumors. BioLineRx Ltd. was founded in 2003 and is headquartered in Hevel Modi'in, Israel.",
    "website": "http://www.biolinerx.com",
    "zipcode": "7177871"
  },
  "BLRX.TA": {
    "city": "Hevel Modi'in",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "BioLineRx Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "BIOLINE RX LTD",
    "state": null,
    "summary": "BioLineRx Ltd., a clinical-stage biopharmaceutical development company, focuses on oncology. Its development pipeline consists of clinical-stage therapeutic candidates, which include BL-8040, a peptide for the treatment of solid tumors, hematological malignancies, and stem cell mobilization; AGI-134, an immuno-oncology agent in the development for solid tumors; and BL-5010, a customized, proprietary, pen-like applicator for the non-surgical removal of skin lesions. The company has collaboration agreement with MSD for the cancer immunotherapy field; MD Anderson Cancer Center to investigate the combination of BL-8040 with KEYTRUDA (pembrolizumab) in pancreatic cancer; and Genentech Inc. to investigate the combination of BL-8040 for solid tumors. BioLineRx Ltd. was founded in 2003 and is headquartered in Hevel Modi'in, Israel.",
    "website": "http://www.biolinerx.com",
    "zipcode": "7177871"
  },
  "BOLT.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "BioLight Life Sciences Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "BIOLIGHT LIFE SCI",
    "state": null,
    "summary": "BioLight Life Sciences Ltd., an ophthalmic company, engages in the discovery, development, and commercialization of products and product candidates that address ophthalmic conditions comprising glaucoma, dry eye syndrome, and age-related macular degeneration. The company's ophthalmic product offering and pipeline of product candidates include IOPtiMate, a laser-based surgical treatment for glaucoma; TeaRx, a point-of-care multi-parameter diagnostic test for dry eye syndrome; Eye-D, a controlled release drug-delivery insert platform; OphRx, a non-invasive topical drug delivery technology; and LipiTear, a micro-emulsion technology for the dry eye treatment, as well as for the treatment of other ocular diseases. It also invests in cancer diagnostics technologies, including proprietary tests that are designated for bladder, cervical, multiple myeloma, and other cancers. The company was formerly known as Bio Light Israeli Life Sciences Investments Ltd. and changed its name to BioLight Life Sciences Ltd. in February 2016. BioLight Life Sciences Ltd. was founded in 2005 and is based in Tel Aviv, Israel.",
    "website": "http://bio-light.co.il",
    "zipcode": "6158101"
  },
  "BVXV": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Biotechnology",
    "long_name": "BiondVax Pharmaceuticals Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "BiondVax Pharmaceuticals Ltd.",
    "state": null,
    "summary": "BiondVax Pharmaceuticals Ltd., a clinical stage biopharmaceutical company, focuses on developing and commercializing immunomodulation therapies for infectious diseases primarily in Israel. Its product candidate is M-001, a synthetic peptide-based protein, which is in Phase III clinical trials for treatment of seasonal and pandemic strains of the influenza virus. The company was founded in 2003 and is headquartered in Jerusalem, Israel.",
    "website": "http://www.biondvax.com",
    "zipcode": "7414002"
  },
  "CANF": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Biotechnology",
    "long_name": "Can-Fite BioPharma Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "Can-Fite Biopharma Ltd Sponsore",
    "state": null,
    "summary": "Can-Fite BioPharma Ltd., a clinical-stage biopharmaceutical company, develops small molecule therapeutic products for the treatment of cancer, liver and inflammatory disease, COVID-19 and erectile dysfunction. The company's lead drug candidate CF101 (Piclidenoson), which is in Phase III clinical trial for the treatment of psoriasis; and Phase II clinical trial for the treatment of COVID-19. It also develops CF102 (Namodenoson) that is completed Phase II clinical trial for the treatment of hepatocellular carcinoma, as well as in Phase II trial for the treatment of non-alcoholic steatohepatitis; and CF602, which is in pre-clinical trial for the treatment of erectile dysfunction. In addition, the company develops commercial predictive biomarker blood test kit for A3AR. Can-Fite BioPharma Ltd. has collaboration agreement with CMS Medical to develop, manufacture, and commercialize Piclidenoson and Namodenoson; and Univo Pharmaceuticals to identify and co-develop specific formulations of cannabis components for the treatment of cancer, inflammatory, autoimmune, and metabolic diseases. The company was formerly known as Can-Fite Technologies Ltd. and changed its name to Can-Fite BioPharma Ltd. in January 2001. Can-Fite BioPharma Ltd. was incorporated in 1994 and is headquartered in Petah-Tikva, Israel.",
    "website": "http://www.canfite.com",
    "zipcode": "4951778"
  },
  "CANF.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Can-Fite BioPharma Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "CAN FITE BIOPHARMA",
    "state": null,
    "summary": "Can-Fite BioPharma Ltd., a clinical-stage biopharmaceutical company, develops small molecule therapeutic products for the treatment of cancer, liver and inflammatory disease, COVID-19 and erectile dysfunction. The company's lead drug candidate CF101 (Piclidenoson), which is in Phase III clinical trial for the treatment of psoriasis; and Phase II clinical trial for the treatment of COVID-19. It also develops CF102 (Namodenoson) that is completed Phase II clinical trial for the treatment of hepatocellular carcinoma, as well as in Phase II trial for the treatment of non-alcoholic steatohepatitis; and CF602, which is in pre-clinical trial for the treatment of erectile dysfunction. In addition, the company develops commercial predictive biomarker blood test kit for A3AR. Can-Fite BioPharma Ltd. has collaboration agreement with CMS Medical to develop, manufacture, and commercialize Piclidenoson and Namodenoson; and Univo Pharmaceuticals to identify and co-develop specific formulations of cannabis components for the treatment of cancer, inflammatory, autoimmune, and metabolic diseases. The company was formerly known as Can-Fite Technologies Ltd. and changed its name to Can-Fite BioPharma Ltd. in January 2001. Can-Fite BioPharma Ltd. was incorporated in 1994 and is headquartered in Petah-Tikva, Israel.",
    "website": "http://www.canfite.com",
    "zipcode": "4951778"
  },
  "CBI.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Clal Biotechnology Industries Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "CLAL BIOTECHNOLOGY",
    "state": null,
    "summary": "Clal Biotechnology Industries Ltd. is a private equity and venture capital firm specializing in development stage, pre-clinical; incubation, seed, start-up, early venture, emerging growth, mid venture, late venture, PIPEs, and growth capital stages of financing. It prefers to invest in life sciences, medical devices, biopharmaceutical technologies, and biotechnology companies. The firm seeks to invest in companies based in United States, and Israel. It invests between $0.5 million and $10 million per company. It takes a seat on the board of directors of the companies it invests in. It invests through personal capital of its management. The firm acts as a lead investor and major shareholder in its portfolio companies. Clal Biotechnology Industries Ltd. was founded in July, 1998 and is based in Tel Aviv, Israel with an additional office in Cambridge, Massachusetts. It operates as a former subsidiary of Clal Industries and Investments Ltd.",
    "website": "http://www.cbi.co.il",
    "zipcode": "67023"
  },
  "CGEN": {
    "city": "Holon",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "Compugen Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "Compugen Ltd.",
    "state": null,
    "summary": "Compugen Ltd., a clinical-stage therapeutic discovery and development company, engages in the research, development, and commercialization of therapeutic and product candidates in Israel, the United States, and Europe. The company's immuno-oncology pipeline consists of COM701, an anti-PVRIG antibody that is in Phase I clinical study used for the treatment of solid tumors; BAY 1905254, a therapeutic antibody targeting ILDR2, which is in Phase I clinical study in patients with solid tumors; and COM902, a therapeutic antibody targeting TIGIT. Its therapeutic pipeline also includes early-stage immuno-oncology programs focused primarily on myeloid targets. The company has collaboration agreement with Bayer Pharma AG for the research, development, and commercialization of antibody-based therapeutics for antibody-based therapeutics against the company's immune checkpoint regulators; Bristol-Myers Squibb to evaluate the safety and tolerability of COM701 in combination with Bristol-Myers Squibb's PD-1 immune checkpoint inhibitor Opdivo in patients with advanced solid tumors; and Johns Hopkins School of Medicine to evaluate novel T cell and myeloid checkpoint targets. It has license agreement with AstraZeneca for the development of bi-specific and multi-specific immuno-oncology antibody products. Compugen Ltd. was incorporated in 1993 and is headquartered in Holon, Israel.",
    "website": "http://www.cgen.com",
    "zipcode": "5885849"
  },
  "CGEN.TA": {
    "city": "Holon",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Compugen Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "COMPUGEN",
    "state": null,
    "summary": "Compugen Ltd., a clinical-stage therapeutic discovery and development company, engages in the research, development, and commercialization of therapeutic and product candidates in Israel, the United States, and Europe. The company's immuno-oncology pipeline consists of COM701, an anti-PVRIG antibody that is in Phase I clinical study used for the treatment of solid tumors; BAY 1905254, a therapeutic antibody targeting ILDR2, which is in Phase I clinical study in patients with solid tumors; and COM902, a therapeutic antibody targeting TIGIT. Its therapeutic pipeline also includes early-stage immuno-oncology programs focused primarily on myeloid targets. The company has collaboration agreement with Bayer Pharma AG for the research, development, and commercialization of antibody-based therapeutics for antibody-based therapeutics against the company's immune checkpoint regulators; Bristol-Myers Squibb to evaluate the safety and tolerability of COM701 in combination with Bristol-Myers Squibb's PD-1 immune checkpoint inhibitor Opdivo in patients with advanced solid tumors; and Johns Hopkins School of Medicine to evaluate novel T cell and myeloid checkpoint targets. It has license agreement with AstraZeneca for the development of bi-specific and multi-specific immuno-oncology antibody products; and research collaboration with Johns Hopkins University for myeloid. Compugen Ltd. was incorporated in 1993 and is headquartered in Holon, Israel.",
    "website": "http://www.cgen.com",
    "zipcode": "5885849"
  },
  "CLGN": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "CollPlant Biotechnologies Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "CollPlant Biotechnologies Ltd.",
    "state": null,
    "summary": "CollPlant Biotechnologies Ltd., a regenerative and aesthetic medicine company, focuses on three-dimensional (3D) bio-printing of tissues and organs, and medical aesthetics in the United States, Canada, and Europe. The company's products are based on recombinant type I human collagen that is produced with its proprietary plant based genetic engineering technology. Its products include BioInks for 3D printing of tissues and organs; dermal filler for treating wrinkles; 3D Bioprinted breast implants that are used for the regeneration of breast tissue; injectable implants to promote breast tissue regeneration; VergenixSTR, a soft tissue repair matrix intended for treatment of tendinopathy; and VergenixFG, an advanced wound care product for the treatment of deep surgical incisions and wounds, including diabetic ulcers, venous and pressure ulcers, burns, bedsores, and other chronic wounds. The company was formerly known as CollPlant Holdings Ltd. and changed its name to CollPlant Biotechnologies Ltd. in June 2019. CollPlant Biotechnologies Ltd. was founded in 2004 and is headquartered in Rehovot, Israel.",
    "website": "http://www.collplant.com",
    "zipcode": "7670104"
  },
  "CMMB": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Chemomab Therapeutics Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Chemomab Therapeutics Ltd.",
    "state": null,
    "summary": "Chemomab Therapeutics Ltd. engages in the research and development of biological drugs for the treatment of inflammatory and fibrotic diseases. The company was formerly known as Anchiano Therapeutics Ltd. and changed its name to Chemomab Therapeutics Ltd. in March 16, 2021. Chemomab Therapeutics Ltd. was incorporated in 2011 and is based in Tel Aviv, Israel.",
    "website": "http://www.chemomab.com",
    "zipcode": "6158002"
  },
  "CNMD.TA": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Cannomed Medical Cannabis Industries LTD",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "CANNOMED MEDICAL",
    "state": null,
    "summary": "Cannomed Medical Cannabis Industries Ltd, a biopharmaceutical company, discovers and develops novel therapeutics. It focuses on discovering inhibitors for E3 ubiquitin ligases for the treatment of cancer, metabolic diseases, viral infection, and CNS related disorders. The company was founded in 1999 and is based in Rehovot, Israel.",
    "website": null,
    "zipcode": "76704"
  },
  "CPTA.F": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "CollPlant Biotechnologies Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "COLL.BIO. SP.ADR/1 -,01",
    "state": null,
    "summary": "CollPlant Biotechnologies Ltd., a regenerative and aesthetic medicine company, focuses on three-dimensional (3D) bio-printing of tissues and organs, and medical aesthetics in the United States, Canada, and Europe. The company's products are based on recombinant type I human collagen that is produced with its proprietary plant based genetic engineering technology. Its products include BioInks for 3D printing of tissues and organs; dermal filler for treating wrinkles; 3D Bioprinted breast implants that are used for the regeneration of breast tissue; injectable implants to promote breast tissue regeneration; VergenixSTR, a soft tissue repair matrix intended for treatment of tendinopathy; and VergenixFG, an advanced wound care product for the treatment of deep surgical incisions and wounds, including diabetic ulcers, venous and pressure ulcers, burns, bedsores, and other chronic wounds. The company was formerly known as CollPlant Holdings Ltd. and changed its name to CollPlant Biotechnologies Ltd. in June 2019. CollPlant Biotechnologies Ltd. was founded in 2004 and is headquartered in Rehovot, Israel.",
    "website": "http://www.collplant.com",
    "zipcode": "7670104"
  },
  "CW9.F": {
    "city": "Holon",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Compugen Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "COMPUGEN LTD.",
    "state": null,
    "summary": "Compugen Ltd., a clinical-stage therapeutic discovery and development company, engages in the research, development, and commercialization of therapeutic and product candidates in Israel, the United States, and Europe. The company's immuno-oncology pipeline consists of COM701, an anti-PVRIG antibody that is in Phase I clinical study used for the treatment of solid tumors; BAY 1905254, a therapeutic antibody targeting ILDR2, which is in Phase I clinical study in patients with solid tumors; and COM902, a therapeutic antibody targeting TIGIT. Its therapeutic pipeline also includes early-stage immuno-oncology programs focused primarily on myeloid targets. The company has collaboration agreement with Bayer Pharma AG for the research, development, and commercialization of antibody-based therapeutics for antibody-based therapeutics against the company's immune checkpoint regulators; Bristol-Myers Squibb to evaluate the safety and tolerability of COM701 in combination with Bristol-Myers Squibb's PD-1 immune checkpoint inhibitor Opdivo in patients with advanced solid tumors; and Johns Hopkins School of Medicine to evaluate novel T cell and myeloid checkpoint targets. It has license agreement with AstraZeneca for the development of bi-specific and multi-specific immuno-oncology antibody products; and research collaboration with Johns Hopkins University for myeloid. Compugen Ltd. was incorporated in 1993 and is headquartered in Holon, Israel.",
    "website": "http://www.cgen.com",
    "zipcode": "5885849"
  },
  "DNA.TA": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "D.N.A Biomedical Solutions Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "D.N.A BIOMEDICAL S",
    "state": null,
    "summary": "D.N.A Biomedical Solutions Ltd. develops and commercializes laser spectrometry-based trace detection systems in Israel. The company offers remote scan systems for explosive detection; bottle liquid and powders, and hand held raman scanners that detects hazardous substances in liquids or powder forms; and luggage scanners for baggage screening. Its products are used in aviation and transportation security applications, such as baggage, personnel, and vehicle inspection; military applications; law enforcement and homeland security applications, including mega event security, multiple substances detection, and drug detection, as well as identification of solids, gases, and liquids in transparent containers; and monitoring and detection of hazardous materials in emergency situations. The company was formerly known as Laser Detect Systems Ltd. D.N.A Biomedical Solutions Ltd. was founded in 2004 and is based in Ramat Gan, Israel.",
    "website": "http://www.laser-detect.com",
    "zipcode": "5250607"
  },
  "ENLV": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Enlivex Therapeutics Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Enlivex Therapeutics Ltd.",
    "state": null,
    "summary": "Enlivex Therapeutics Ltd. operates as a clinical stage immunotherapy company. It is developing Allocetra, an off-the-shelf cell therapy designed to reprogram macrophages into homeostatic state. Resetting non-homeostatic macrophages into homeostatic state is critical for immune system rebalancing and resolution of life-threatening conditions. Diseases, such as solid cancers, sepsis, COVID-19, and others reprogram macrophages out of homeostatic state. Its Allocetra has the potential to provide a novel immunotherapeutic mechanism of action for life-threatening clinical indications that are defined as unmet medical needs, as a stand-alone therapy or in combination with therapeutic agents. The company has a research collaboration with Yale Cancer Center for the assessment of Allocetra to enhance the activity of checkpoint inhibitors in solid tumors. Enlivex Therapeutics Ltd. was incorporated in 2005 and is headquartered in Nes Ziona, Israel.",
    "website": "http://www.enlivex.com",
    "zipcode": "7403618"
  },
  "ENLV.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Enlivex Therapeutics Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "ENLIVEX THERAPEUTI",
    "state": null,
    "summary": "Enlivex Therapeutics Ltd. operates as a clinical stage immunotherapy company. It is developing Allocetra, an off-the-shelf cell therapy designed to reprogram macrophages into homeostatic state. Resetting non-homeostatic macrophages into homeostatic state is critical for immune system rebalancing and resolution of life-threatening conditions. Diseases, such as solid cancers, sepsis, COVID-19, and others reprogram macrophages out of homeostatic state. Its Allocetra has the potential to provide a novel immunotherapeutic mechanism of action for life-threatening clinical indications that are defined as unmet medical needs, as a stand-alone therapy or in combination with therapeutic agents. The company has a research collaboration with Yale Cancer Center for the assessment of Allocetra to enhance the activity of checkpoint inhibitors in solid tumors. Enlivex Therapeutics Ltd. was incorporated in 2005 and is headquartered in Nes Ziona, Israel.",
    "website": "http://www.enlivex.com",
    "zipcode": "7403618"
  },
  "ENTX": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Biotechnology",
    "long_name": "Entera Bio Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Entera Bio Ltd.",
    "state": null,
    "summary": "Entera Bio Ltd., a clinical-stage biopharmaceutical company, focuses on the development and commercialization of orally delivered large molecule therapeutics for unmet medical needs. The company's lead product candidates include the EB612, an oral parathyroid hormone product candidate, which is in Phase 2 clinical trials for the treatment of hypoparathyroidism; and EB613 that is in Phase 2 clinical trials for the treatment of osteoporosis. It is also developing EB613 for the treatment of non-union fractures. The company has a research collaboration and license agreement with the Amgen Inc. for the development and discovery of clinical candidates in the field of inflammatory disease and other serious illnesses. Entera Bio Ltd. was incorporated in 2009 and is based in Jerusalem, Israel.",
    "website": "http://www.enterabio.com",
    "zipcode": "9122002"
  },
  "EVGN": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Evogene Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Evogene Ltd.",
    "state": null,
    "summary": "Evogene Ltd., together with its subsidiaries, operates as a computational biology company. It focuses on product discovery and development in multiple life-science based industries, including human health and agriculture, through the use of its Computational Predictive Biology (CPB) platform. The CPB platform, incorporating a deep understanding of biology leveraged through big data and artificial intelligence, designed to computationally discover and uniquely guide the development of life-science products based on microbes, small molecules, and genetic elements. The company operates through three segments: Agriculture, Human Health, and Industrial Applications. The Agriculture segment develops seed traits, ag-chemical products, and ag-biological products to enhance plant performance. Its products focus on various crops, such as corn, soybean, wheat, rice, and cotton. The Industrial Applications segment develops enhanced castor bean seeds to serve as a feedstock source for other industrial uses. The Human Health segment discovers and develops human microbiome-based therapeutics for the treatment of immuno-oncology, GI related disorders, and antimicrobial resistance organisms. The company also provides medical cannabis products. It operates in the United States, Israel, Brazil, and internationally. The company has strategic collaborations and licensing agreements with agricultural companies, such as BASF SE, Corteva, and Bayer; and through its subsidiary, Canonic Ltd., has a collaboration agreement with Cannbit Ltd., a subsidiary of Tikun Olam-Cannbit Ltd. for the development of novel medical cannabis products. Evogene Ltd. was founded in 1999 and is headquartered in Rehovot, Israel.",
    "website": "http://www.evogene.com",
    "zipcode": "7414002"
  },
  "EVGN.TA": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Evogene Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "EVOGENE LTD",
    "state": null,
    "summary": "Evogene Ltd., together with its subsidiaries, operates as a computational biology company. It focuses on product discovery and development in multiple life-science based industries, including human health and agriculture, through the use of its Computational Predictive Biology (CPB) platform. The CPB platform, incorporating a deep understanding of biology leveraged through big data and artificial intelligence, designed to computationally discover and uniquely guide the development of life-science products based on microbes, small molecules, and genetic elements. The company operates through three segments: Agriculture, Human Health, and Industrial Applications. The Agriculture segment develops seed traits, ag-chemical products, and ag-biological products to enhance plant performance. Its products focus on various crops, such as corn, soybean, wheat, rice, and cotton. The Industrial Applications segment develops enhanced castor bean seeds to serve as a feedstock source for other industrial uses. The Human Health segment discovers and develops human microbiome-based therapeutics for the treatment of immuno-oncology, GI related disorders, and antimicrobial resistance organisms. The company also provides medical cannabis products. It operates in the United States, Israel, Brazil, and internationally. The company has strategic collaborations and licensing agreements with agricultural companies, such as BASF SE, Corteva, and Bayer; and through its subsidiary, Canonic Ltd., has a collaboration agreement with Cannbit Ltd., a subsidiary of Tikun Olam-Cannbit Ltd. for the development of novel medical cannabis products. Evogene Ltd. was founded in 1999 and is headquartered in Rehovot, Israel.",
    "website": "http://www.evogene.com",
    "zipcode": "7414002"
  },
  "GLMD": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Galmed Pharmaceuticals Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Galmed Pharmaceuticals Ltd.",
    "state": null,
    "summary": "Galmed Pharmaceuticals Ltd., a clinical-stage biopharmaceutical company, focuses on the development of therapeutics for the treatment of liver diseases. It develops Aramchol, an oral therapy, which is in Phase III study for the treatment of non-alcoholic steato-hepatitis (NASH) in patients with overweight or obesity and who are pre-diabetic or type-II-diabetes mellitus. The company also evaluates Aramchol through ARRIVE Study, a Phase IIa clinical trial with HIV-associated non-alcoholic fatty liver disease and lipodystrophy. In addition, it engages in the development of Amilo-5MER, a 5 amino acid synthetic peptide methionine, threonine, alanine, aspartic acid, and valine. Galmed Pharmaceuticals Ltd. has a research agreement with Gannex Pharma Co., Ltd. to develop a combination therapy of ASC41 (THR-beta agonist) and Aramchol (SCD 1 inhibitor) for the treatment of NASH; a research and development collaboration agreement with MyBiotics Pharma Ltd. to identify the selected microbiome repertoire associated with the response to Aramchol; and a license agreement with Samil Pharma. Co., Ltd. for the commercialization of Aramchol in the Republic of Korea. The company was founded in 2000 and is headquartered in Tel Aviv, Israel.",
    "website": "http://www.galmedpharma.com",
    "zipcode": "6578317"
  },
  "GMDA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "Gamida Cell Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Healthcare",
    "short_name": "Gamida Cell Ltd.",
    "state": null,
    "summary": "Gamida Cell Ltd., a clinical-stage biopharmaceutical company, develops cell therapies to cure blood cancers and serious blood diseases. The company's lead product candidate is omidubicel, a cell therapy that is in Phase III studies in patients with high-risk hematologic malignancies, as well as in Phase I/II clinical trials in patients with severe aplastic anemia. It is also developing GDA-201, a natural killer cell-based cancer immunotherapy, which is in Phase I/II studies for the treatment of relapsed or refractory non-Hodgkin lymphoma and multiple myeloma. The company was founded in 1998 and is headquartered in Jerusalem, Israel.",
    "website": "http://www.gamida-cell.com",
    "zipcode": "91340"
  },
  "H2K2.F": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "XTL Biopharmaceuticals Ltd.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "XTL BIOPHARMA. ADR 100",
    "state": null,
    "summary": "XTL Biopharmaceuticals Ltd., a biopharmaceutical company, engages in the acquisition and development of pharmaceutical products for the treatment of autoimmune diseases. Its lead drug candidate is hCDR1, a Phase II-ready asset for the treatment of systemic lupus erythematosus and Sjogren's syndrome. XTL Biopharmaceuticals Ltd. has a licensing agreement with Yeda Research and Development Company Limited for the research, development, and commercialization of hCDR1 for various indications. The company was formerly known as Xenograft Technologies Ltd. and changed its name to XTL Biopharmaceuticals Ltd. in July 1995. XTL Biopharmaceuticals Ltd. was incorporated in 1993 and is headquartered in Ramat Gan, Israel.",
    "website": "http://www.xtlbio.com",
    "zipcode": "5218102"
  },
  "HDST.TA": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Hadasit Bio-Holdings Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "HBL-HADASIT BIO",
    "state": null,
    "summary": "Hadasit Bio-Holdings Ltd operates in the biotechnology industry in Israel. It primarily focuses on the therapeutic areas, including oncology, regenerative medicine, and inflammatory disease. The company offers ProtAb, an immunotherapeutic monoclonal antibody for the treatment of autoimmune inflammatory diseases. Hadasit Bio-Holdings Ltd was founded in 2005 and is based in Jerusalem, Israel.",
    "website": "http://www.hbl.co.il",
    "zipcode": "91120"
  },
  "HSITF": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Hadasit Bio-Holdings Ltd",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "HBL - HADASIT BIO HOLDINGS LTD",
    "state": null,
    "summary": "Hadasit Bio-Holdings Ltd operates in the biotechnology industry in Israel. It primarily focuses on the therapeutic areas, including oncology, regenerative medicine, and inflammatory disease. The company offers ProtAb, an immunotherapeutic monoclonal antibody for the treatment of autoimmune inflammatory diseases. Hadasit Bio-Holdings Ltd was founded in 2005 and is based in Jerusalem, Israel.",
    "website": "http://www.hbl.co.il",
    "zipcode": "91120"
  },
  "ICB.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Israel China Biotechnology (ICB) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "ICB BIOTECHNOLOGY",
    "state": null,
    "summary": "Israel China Biotechnology (ICB) Ltd operates as a healthcare investment company. It invests in companies in the biomedical field in Israel. The company was founded in 2000 and is based in Tel Aviv, Israel.",
    "website": "http://www.icbinvest.co",
    "zipcode": "6971918"
  },
  "KDST.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Kadimastem Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "KADIMASTEM",
    "state": null,
    "summary": "Kadimastem Ltd, a biopharmaceutical company, develops regenerative medicine therapies based on cells derived from human embryonic stem cells to treat neuro-degenerative diseases. Its products in pipeline include AstroRx, a clinical grade human astrocytes that is in Phase 1/2a clinical trial for the treatment of amyotrophic lateral sclerosis and other neurodegenerative diseases; and IsletRx, a clinical grade pancreatic islet cell therapy treatment for diabetes. The company was founded in 2008 and is based in Ness Ziona, Israel.",
    "website": "http://www.kadimastem.com",
    "zipcode": "74140"
  },
  "KMSTF": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Kadimastem Ltd",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "KADIMASTEM LTD",
    "state": null,
    "summary": "Kadimastem Ltd, a biopharmaceutical company, develops regenerative medicine therapies based on cells derived from human embryonic stem cells to treat neuro-degenerative diseases. Its products in pipeline include AstroRx, a clinical grade human astrocytes that is in Phase 1/2a clinical trial for the treatment of amyotrophic lateral sclerosis and other neurodegenerative diseases; and IsletRx, a clinical grade pancreatic islet cell therapy treatment for diabetes. The company was founded in 2008 and is based in Ness Ziona, Israel.",
    "website": "http://www.kadimastem.com",
    "zipcode": "74140"
  },
  "M8W.F": {
    "city": "Yavne",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "MediWound Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "MEDIWOUND LTD  IS-,01",
    "state": null,
    "summary": "MediWound Ltd., a biopharmaceutical company, develops, manufactures, and commercializes novel and bio-therapeutic solutions for tissue repair and regeneration. It markets NexoBrid, a biopharmaceutical product for the removal of eschar, a dead or damaged tissue in adults with deep partial- and full-thickness thermal burns to burn centers and hospitals burn units. The company also develops EscharEx, which has completed Phase II clinical trials for the debridement of chronic and other hard-to-heal wounds; MWPC005, a topically applied biological drug candidate that is in Phase I/II clinical trial for the treatment of non-melanoma skin cancers; and MWPC003 for connective tissue disorders. MediWound Ltd. was founded in 2000 and is headquartered in Yavne, Israel.",
    "website": "http://www.mediwound.com",
    "zipcode": "8122745"
  },
  "MDWD": {
    "city": "Yavne",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "MediWound Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "MediWound Ltd.",
    "state": null,
    "summary": "MediWound Ltd., a biopharmaceutical company, develops, manufactures, and commercializes novel and bio-therapeutic solutions for tissue repair and regeneration. It markets NexoBrid, a biopharmaceutical product for the removal of eschar, a dead or damaged tissue in adults with deep partial- and full-thickness thermal burns to burn centers and hospitals burn units. The company also develops EscharEx, which has completed Phase II clinical trials for the debridement of chronic and other hard-to-heal wounds; MWPC005, a topically applied biological drug candidate that is in Phase I/II clinical trial for the treatment of non-melanoma skin cancers; and MWPC003 for connective tissue disorders. MediWound Ltd. was founded in 2000 and is headquartered in Yavne, Israel.",
    "website": "http://www.mediwound.com",
    "zipcode": "8122745"
  },
  "NTEC": {
    "city": "Jerusalem",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Intec Pharma Ltd",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "Intec Pharma Ltd.",
    "state": null,
    "summary": "Intec Pharma Ltd, a clinical stage biopharmaceutical company, focuses on developing drugs based on its proprietary Accordion Pill platform technology in Israel. Its Accordion Pill is an oral drug delivery system that is designed to enhance the efficacy and safety of existing drugs and drugs in development by utilizing a gastric retention and specific release mechanism. The company's lead product candidate is Accordion Pill Carbidopa/Levodopa, which has completed a Phase III clinical trial for the treatment of Parkinson's disease symptoms in advanced Parkinson's disease patients. It is also developing Accordion Pill Zaleplon that is in a Phase III clinical trial as a treatment for the induction and maintenance of sleep in patients suffering from insomnia; a product candidate, which has completed a Phase I clinical trial for the prevention and treatment of gastroduodenal and small bowel Nonsteroidal Anti-Inflammatory Drug induced ulcers; and AP-CBD/THC, AP-THC, and AP-CBD product candidates with Cannabidiol and 9-Tetrahydrocannabinol for the treatment of various pain indications. Intec Pharma Ltd. has a research collaboration agreement with Merck Sharp & Dohme for the development of Accordion Pill; and a cannabinoid research collaboration agreement with GW Research Limited to explore an undisclosed research program using the Accordion Pill platform. The company was formerly known as Intec Pharmaceuticals (2000) Ltd. and changed its name to Intec Pharma Ltd in March 2004. Intec Pharma Ltd was incorporated in 2000 and is based in Jerusalem, Israel.",
    "website": "http://www.intecpharma.com",
    "zipcode": "9777512"
  },
  "PBDA.F": {
    "city": "Karmiel",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Protalix BioTherapeutics, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "PROTALIX BIOTHERAP.DL-,01",
    "state": null,
    "summary": "Protalix BioTherapeutics, Inc., a biopharmaceutical company, focuses on the development and commercialization of recombinant therapeutic proteins based on its proprietary ProCellEx plant cell-based protein expression system in Israel, Brazil, rest of Latin America, and internationally. The company offers Elelyso for the treatment of Gaucher disease. Its product pipeline comprises PRX-102, a therapeutic protein candidate, which is in phase III clinical trials for the treatment of Fabry diseases; PRX-110, a proprietary plant cell recombinant form of human deoxyribonuclease I that has completed phase IIa clinical trials for the treatment of cystic fibrosis; PRX-115, a plant cell-expressed recombinant PEGylated Uricase for the treatment of gout; and PRX-119, a plant cell-expressed PEGylated recombinant human DNase I product candidate for the treatment of NETs-related diseases. The company has agreements and partnerships with Pfizer; Fundação Oswaldo Cruz (Fiocruz); and Chiesi Farmaceutici S.p.A. The company was founded in 1993 and is headquartered in Karmiel, Israel.",
    "website": "http://www.protalix.com",
    "zipcode": "2161401"
  },
  "PHGE": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Biotechnology",
    "long_name": "BiomX Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "BiomX Inc.",
    "state": null,
    "summary": "BiomX Inc., a clinical-stage microbiome company, develops products using natural and engineered phage technologies designed to target and kill specific harmful bacteria. It targets bacteria that affect the appearance of skin, as well as chronic diseases, such as inflammatory bowel diseases (IBD), primary sclerosing cholangitis (PSC), cystic fibrosis (CF), atopic dermatitis, and colorectal cancer (CRC). The company's lead product candidate BX001, which is in Phase II that helps to modify the appearance of skin in various skin types, including oily and acne-prone skin type. Its products under development include BX003 to treat acne-prone skin, IBD, and PSC; BX004, a therapeutic phage product candidate for chronic respiratory infections caused by pseudomonas aeruginosa; and BX005, a topical phage product candidate for staphylococcus aureus, a bacterium associated with the development and exacerbation of inflammation in atopic dermatitis, as well as CRC program targets strains of bacteria found in CRC tumors. The company has license agreement with Keio University and JSR Corporation to bacterial targets that are related to IBD and the phage to eradicate these bacterial targets. BiomX Inc. was founded in 2015 and is headquartered in Ness Ziona, Israel.",
    "website": "http://www.biomx.com",
    "zipcode": "7414002"
  },
  "PHGE.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "BiomX Inc.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "BIOMX INC",
    "state": null,
    "summary": "BiomX Inc., a clinical stage company, develops products using natural and engineered phage technologies designed to target and kill specific harmful bacteria. It targets bacteria that affect the appearance of skin, as well as chronic diseases, such as inflammatory bowel diseases (IBD), primary sclerosing cholangitis (PSC), cystic fibrosis (CF), atopic dermatitis, and colorectal cancer (CRC). The company's lead product candidate BX001, which is in phase II that helps to modify the appearance of skin in various skin types, including oily and acne-prone skin type. Its products under development include BX003 to treat acne-prone skin, IBD, and PSC; BX004, a therapeutic phage product candidate for chronic respiratory infections caused by pseudomonas aeruginosa; and BX005, a topical phage product candidate for staphylococcus aureus, a bacterium associated with the development and exacerbation of inflammation in atopic dermatitis, as well as CRC program targets strains of bacteria found in CRC tumors. The company has license agreement with Keio University and JSR Corporation to bacterial targets that are related to IBD and the phage to eradicate these bacterial targets. BiomX Inc. was founded in 2015 and is headquartered in Ness Ziona, Israel.",
    "website": "http://www.biomx.com",
    "zipcode": "7414002"
  },
  "PJT.F": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "Pluristem Therapeutics Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "PLURISTEM THERAPEUTICS",
    "state": null,
    "summary": "Pluristem Therapeutics Inc., together with its subsidiary, Pluristem Ltd., operates as a bio-therapeutics company in Israel. It focuses on the research, development, clinical trial, and manufacture of cell therapeutic products and related technologies for the treatment of various ischemic, inflammatory, and hematologic conditions, as well as autoimmune disorders. The company develops placental expanded (PLX) based cell therapy products, including PLX-PAD cells, which is Phase III clinical trial for the treatment of critical limb ischemia (CLI) in patients unsuitable for revascularization, recovery after surgery for hip fracture, and acute radiation syndrome (ARS), as well as peripheral and cardiovascular, and orthopedic diseases. It also develops PLX-R18 cells that is in Phase I clinical trial for incomplete hematopoietic recovery following hematopoietic cell transplantation, as well as conducts various animal studies for the evaluation of PLX-R18 for the treatment of ARS. The company has a license and commercialization agreement for conducting clinical trials and commercialization of its PLX-PAD product in South Korea related to the treatment CLI and intermittent claudication; and nTRACK, a collaborative project with Leitat to examine gold nano particles labeling of stem cells. It also has collaboration agreements with the NASA's Ames Research Center to evaluate the potential of PLX cell therapies in preventing and treating medical conditions caused during space missions; and BIH Center for Regenerative Therapy and Berlin Center for Advanced Therapies to expand its framework and research agreement, as well as conduct a joint project evaluating the therapeutic effects of the registrant's patented PLX cell product candidates for treatment of the respiratory and inflammatory complications associated with the COVID-19 coronavirus. Pluristem Therapeutics Inc. was founded in 2001 and is based in Haifa, Israel.",
    "website": "http://www.pluristem.com",
    "zipcode": "31905"
  },
  "PLNT.TA": {
    "city": "Ra'anana",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "PlantArc Bio Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "PLANTARC BIO LTD",
    "state": null,
    "summary": "PlantArc Bio Ltd. operates as a biotechnology company for the enhancement of crop productivity and performance for food security. The company has developed a Direct In Plant gene discovery platform. It focuses on yield and abiotic stresses, insect resistance, herbicide tolerance, and disease control market segments. The company was founded in 2014 and is based in Ra'anana, Israel.",
    "website": "http://plantarcbio.com",
    "zipcode": "4390500"
  },
  "PLX": {
    "city": "Karmiel",
    "country": "Israel",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Biotechnology",
    "long_name": "Protalix BioTherapeutics, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Protalix BioTherapeutics, Inc. ",
    "state": null,
    "summary": "Protalix BioTherapeutics, Inc., a biopharmaceutical company, focuses on the development and commercialization of recombinant therapeutic proteins based on its proprietary ProCellEx plant cell-based protein expression system in Israel, Brazil, rest of Latin America, and internationally. The company offers Elelyso for the treatment of Gaucher disease. Its product pipeline comprises PRX-102, a therapeutic protein candidate, which is in phase III clinical trials for the treatment of Fabry diseases; PRX-110, a proprietary plant cell recombinant form of human deoxyribonuclease I that has completed phase IIa clinical trials for the treatment of cystic fibrosis; PRX-115, a plant cell-expressed recombinant PEGylated Uricase for the treatment of gout; and PRX-119, a plant cell-expressed PEGylated recombinant human DNase I product candidate for the treatment of NETs-related diseases. The company has agreements and partnerships with Pfizer; Fundação Oswaldo Cruz (Fiocruz); and Chiesi Farmaceutici S.p.A. The company was founded in 1993 and is headquartered in Karmiel, Israel.",
    "website": "http://www.protalix.com",
    "zipcode": "2161401"
  },
  "PLX.TA": {
    "city": "Karmiel",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Protalix BioTherapeutics, Inc.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "PROTALIX BIOTHERAP",
    "state": null,
    "summary": "Protalix BioTherapeutics, Inc., a biopharmaceutical company, focuses on the development and commercialization of recombinant therapeutic proteins based on its proprietary ProCellEx plant cell-based protein expression system in Israel, Brazil, rest of Latin America, and internationally. The company offers Elelyso for the treatment of Gaucher disease. Its product pipeline comprises PRX-102, a therapeutic protein candidate, which is in phase III clinical trials for the treatment of Fabry diseases; PRX-110, a proprietary plant cell recombinant form of human deoxyribonuclease I that has completed phase IIa clinical trials for the treatment of cystic fibrosis; PRX-115, a plant cell-expressed recombinant PEGylated Uricase for the treatment of gout; and PRX-119, a plant cell-expressed PEGylated recombinant human DNase I product candidate for the treatment of NETs-related diseases. The company has agreements and partnerships with Pfizer; Fundação Oswaldo Cruz (Fiocruz); and Chiesi Farmaceutici S.p.A. The company was founded in 1993 and is headquartered in Karmiel, Israel.",
    "website": "http://www.protalix.com",
    "zipcode": "2161401"
  },
  "PPBT": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Biotechnology",
    "long_name": "Purple Biotech Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Purple Biotech Ltd.",
    "state": null,
    "summary": "Purple Biotech Ltd., a clinical-stage pharmaceutical company, focuses on the development and commercialization of various pharmaceutical drugs in the United States. It operates through two segments, Oncology, and Pain and Hypertension. The company's marketed products include Consensi, a fixed-dose combination of celecoxib and amlodipine besylate for the simultaneous treatment of osteoarthritis pain and hypertension. Its oncology pipeline includes NT219, a small molecule that targets insulin receptor substrate 1 and 2, and signal transducer and activator of transcription, which is in Phase 1/2 clinical trials for the treatment of recurrent and/or metastatic solid tumors and squamous cell carcinoma of the head and neck cancer; and CM-24, a monoclonal antibody blocking CEACAM1 that is being developed as a combination therapy with anti-PD-1 checkpoint inhibitors, which is in Phase 1/2 clinical trials for the treatment of non-small cell lung cancer and pancreatic cancer. The company was formerly known as Kitov Pharma Ltd and changed its name to Purple Biotech Ltd. in December 2020. Purple Biotech Ltd. was founded in 2010 and is headquartered in Rehovot, Israel.",
    "website": "http://purple-biotech.com",
    "zipcode": "7670104"
  },
  "PPBT.TA": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Purple Biotech Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "PURPLE BIOTECH",
    "state": null,
    "summary": "Purple Biotech Ltd., a clinical-stage pharmaceutical company, focuses on the development and commercialization of various pharmaceutical drugs in the United States. It operates through two segments, Oncology, and Pain and Hypertension. The company's marketed products include Consensi, a fixed-dose combination of celecoxib and amlodipine besylate for the simultaneous treatment of osteoarthritis pain and hypertension. Its oncology pipeline includes NT219, a small molecule that targets insulin receptor substrate 1 and 2, and signal transducer and activator of transcription, which is in Phase 1/2 clinical trials for the treatment of recurrent and/or metastatic solid tumors and squamous cell carcinoma of the head and neck cancer; and CM-24, a monoclonal antibody blocking CEACAM1 that is being developed as a combination therapy with anti-PD-1 checkpoint inhibitors, which is in Phase 1/2 clinical trials for the treatment of non-small cell lung cancer and pancreatic cancer. The company was formerly known as Kitov Pharma Ltd and changed its name to Purple Biotech Ltd. in December 2020. Purple Biotech Ltd. was founded in 2010 and is headquartered in Rehovot, Israel.",
    "website": "http://purple-biotech.com",
    "zipcode": "7670104"
  },
  "PSTI": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Pluristem Therapeutics Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Pluristem Therapeutics, Inc.",
    "state": null,
    "summary": "Pluristem Therapeutics Inc., together with its subsidiary, Pluristem Ltd., operates as a bio-therapeutics company in Israel. It focuses on the research, development, clinical trial, and manufacture of cell therapeutic products and related technologies for the treatment of various ischemic, inflammatory, and hematologic conditions, as well as autoimmune disorders. The company develops placental expanded (PLX) based cell therapy products, including PLX-PAD cells, which is Phase III clinical trial for the treatment of critical limb ischemia (CLI) in patients unsuitable for revascularization, recovery after surgery for hip fracture, and acute radiation syndrome (ARS), as well as peripheral and cardiovascular, and orthopedic diseases. It also develops PLX-R18 cells that is in Phase I clinical trial for incomplete hematopoietic recovery following hematopoietic cell transplantation, as well as conducts various animal studies for the evaluation of PLX-R18 for the treatment of ARS. The company has a license and commercialization agreement for conducting clinical trials and commercialization of its PLX-PAD product in South Korea related to the treatment CLI and intermittent claudication; and nTRACK, a collaborative project with Leitat to examine gold nano particles labeling of stem cells. It also has collaboration agreements with the NASA's Ames Research Center to evaluate the potential of PLX cell therapies in preventing and treating medical conditions caused during space missions; and BIH Center for Regenerative Therapy and Berlin Center for Advanced Therapies to expand its framework and research agreement, as well as conduct a joint project evaluating the therapeutic effects of the registrant's patented PLX cell product candidates for treatment of the respiratory and inflammatory complications associated with the COVID-19 coronavirus. Pluristem Therapeutics Inc. was founded in 2001 and is based in Haifa, Israel.",
    "website": "http://www.pluristem.com",
    "zipcode": "31905"
  },
  "PSTI.TA": {
    "city": "Haifa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Pluristem Therapeutics Inc.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "PLURISTEM THERAPEU",
    "state": null,
    "summary": "Pluristem Therapeutics Inc., together with its subsidiary, Pluristem Ltd., operates as a bio-therapeutics company in Israel. It focuses on the research, development, clinical trial, and manufacture of cell therapeutic products and related technologies for the treatment of various ischemic, inflammatory, and hematologic conditions, as well as autoimmune disorders. The company develops placental expanded (PLX) based cell therapy products, including PLX-PAD cells, which is Phase III clinical trial for the treatment of critical limb ischemia (CLI) in patients unsuitable for revascularization, recovery after surgery for hip fracture, and acute radiation syndrome (ARS), as well as peripheral and cardiovascular, and orthopedic diseases. It also develops PLX-R18 cells that is in Phase I clinical trial for incomplete hematopoietic recovery following hematopoietic cell transplantation, as well as conducts various animal studies for the evaluation of PLX-R18 for the treatment of ARS. The company has a license and commercialization agreement for conducting clinical trials and commercialization of its PLX-PAD product in South Korea related to the treatment CLI and intermittent claudication; and nTRACK, a collaborative project with Leitat to examine gold nano particles labeling of stem cells. It also has collaboration agreements with the NASA's Ames Research Center to evaluate the potential of PLX cell therapies in preventing and treating medical conditions caused during space missions; and BIH Center for Regenerative Therapy and Berlin Center for Advanced Therapies to expand its framework and research agreement, as well as conduct a joint project evaluating the therapeutic effects of the registrant's patented PLX cell product candidates for treatment of the respiratory and inflammatory complications associated with the COVID-19 coronavirus. Pluristem Therapeutics Inc. was founded in 2001 and is based in Haifa, Israel.",
    "website": "http://www.pluristem.com",
    "zipcode": "31905"
  },
  "PYPD": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "PolyPid Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "PolyPid Ltd.",
    "state": null,
    "summary": "PolyPid Ltd., a late-stage biopharma company, develops, manufactures, and commercializes products based on polymer-lipid encapsulation matrix (PLEX) platform to address unmet medical needs. Its lead product includes D-PLEX100, which is in Phase 3 clinical trial for the prevention of sternal (bone) surgical site infections (SSIs), as well as for the prevention of abdominal (soft tissue) SSIs. PolyPid Ltd. was incorporated in 2008 and is headquartered in Petah Tikva, Israel.",
    "website": "http://www.polypid.com",
    "zipcode": "4959376"
  },
  "SLGL": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Biotechnology",
    "long_name": "Sol-Gel Technologies Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Sol-Gel Technologies Ltd.",
    "state": null,
    "summary": "Sol-Gel Technologies Ltd., a clinical stage specialty pharmaceutical company, focuses on developing and commercializing topical dermatological drug products based on its proprietary microencapsulation delivery system in Israel. The company's lead product candidates include Twyneo, a novel, once-daily, non-antibiotic topical cream which has completed Phase III clinical trials for the treatment of acne vulgaris; Epsolay, a once-daily topical cream that has completed Phase III clinical trials for the treatment of papulopustular rosacea; SGT-210, which is in Phase I clinical trial for the treatment of palmoplantar keratoderma; and Erlotinib, Tapinarof, and roflumilast to treat psoriasis and other medical conditions. It is also involved in the development of generic topical dermatological drug products. Sol-Gel Technologies Ltd. has collaboration with Perrigo. The company was incorporated in 1997 and is headquartered in Ness Ziona, Israel.",
    "website": "http://www.sol-gel.com",
    "zipcode": "7403650"
  },
  "SLGN.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Biotechnology",
    "long_name": "Solegreen Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Healthcare",
    "short_name": "SOLEGREEN LTD",
    "state": null,
    "summary": "Solegreen Ltd engages in the renewable energy business in Israel. It operates and maintains solar energy facilities. The company was formerly known as Procognia (Israel) Ltd. and changed its name to Solegreen Ltd in January 2015. Solegreen Ltd was founded in 2000 and is based in Herzliya, Israel. As per the transaction announced on September 3, 2018, Solegreen Ltd operates as a subsidiary of Lahav Green Mountains Ltd.",
    "website": "http://solegreen.co.il",
    "zipcode": "6165202"
  },
  "SPRCY": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "SciSparc Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "SCISPARC LTD",
    "state": null,
    "summary": "SciSparc Ltd., a specialty clinical-stage pharmaceutical company, develops drugs based on cannabinoid molecules. Its drug development programs include SCI-110 for the treatment of Tourette syndrome, obstructive sleep apnea, and Alzheimer's disease and agitation; SCI-160 for the treatment of pain; and SCI-210 for the treatment of autism spectrum disorder and epilepsy. SciSparc Ltd. has an agreement with Procaps to develop and commercially manufacture SCI-110, as well as CannAmide, a palmitoylethanolamide compound in softgel capsule form. It also has an agreement with the Sheba Fund for Health Services and Research to perform a pre-clinical study for the evaluation of SCI-210 drug development program for the treatment of status epilepticus; and The Israeli Medical Center for Alzheimer's to conduct a phase IIa clinical trial to evaluate the safety, tolerability, and efficacy of SCI-110 in patients with Alzheimer's disease and agitation. The company was formerly known as Therapix Biosciences Ltd. and changed its name to SciSparc Ltd. in January 2021. SciSparc Ltd. was incorporated in 2004 and is headquartered in Tel Aviv, Israel.",
    "website": "http://scisparc.com",
    "zipcode": "6971916"
  },
  "TOMDF": {
    "city": "Rehovot",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Biotechnology",
    "long_name": "Todos Medical Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "TODOS MEDICAL LIMITED",
    "state": null,
    "summary": "Todos Medical Ltd., a clinical-stage medical diagnostics company, develops and commercializes blood tests for the detection of immune-related diseases in Israel and internationally. The company develops Total Biochemical Infrared Analysis method, a proprietary method for screening of solid tumors using peripheral blood spectroscopy analysis; and blood tests for the detection of neurodegenerative disorders, such as Alzheimer's disease. Its cancer screening and diagnosis product includes TM-B1 and TM-B2 for breast cancer blood tests; and TM-C1 for testing of colorectal cancer. The company also imports and distributes personal protective equipment, test kits, and medical devices, such as ventilators. Todos Medical Ltd. has partnership with Moto-Para and Meridian HSN to provide a complete turnkey solution for on-site COVID testing. Todos Medical Ltd. was founded in 2010 and is headquartered in Rehovot, Israel.",
    "website": "http://todosmedical.com",
    "zipcode": "7670301"
  },
  "VBLT": {
    "city": "Hevel Modi'in",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Biotechnology",
    "long_name": "Vascular Biogenics Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "Vascular Biogenics Ltd.",
    "state": null,
    "summary": "Vascular Biogenics Ltd., a clinical biopharmaceutical company, focuses on the discovery, development, and commercialization of treatments for cancer and immune/inflammatory indications. The company's program is based on its proprietary vascular targeting system platform technology, which utilizes genetically targeted therapy to destroy newly formed or angiogenic blood vessels. Its lead product candidate is VB-111, a gene-based biologic that is in Phase III clinical trials for the recurrent platinum-resistant ovarian cancer; and Phase II clinical trials treatment of recurrent glioblastoma and colorectal cancer, as well as has completed Phase II clinical trial for the treatment of thyroid cancer. It is also developing VB-511, an anti-angiogenic candidate for oncology; VB-211 and VB-411, which are pro-angiogenic candidates for the treatment of peripheral vascular diseases; and VB-703 for NASH and renal fibrosis. In addition, the company is developing VB-201, a Lecinoxoid-based product candidate to treat atherosclerosis that has completed Phase II clinical; and is in Phase II exploratory trials for COVID-19, as well as in pre-clinical stage for the treatment of NASH and renal fibrosis. It is also developing VB-601 for various inflammatory indications, and VB-611 for various solid tumors. The company was formerly known as Medicard Ltd. and changed its name to Vascular Biogenics Ltd. in January 2003. Vascular Biogenics Ltd. was incorporated in 2000 and is headquartered in Modi'in, Israel.",
    "website": "http://www.vblrx.com",
    "zipcode": "7178106"
  },
  "XTLB": {
    "city": "Ramat Gan",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Biotechnology",
    "long_name": "XTL Biopharmaceuticals Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Healthcare",
    "short_name": "XTL Biopharmaceuticals Ltd.",
    "state": null,
    "summary": "XTL Biopharmaceuticals Ltd., a biopharmaceutical company, engages in the acquisition and development of pharmaceutical products for the treatment of autoimmune diseases. Its lead drug candidate is hCDR1, a Phase II-ready asset for the treatment of systemic lupus erythematosus and Sjogren's syndrome. XTL Biopharmaceuticals Ltd. has a licensing agreement with Yeda Research and Development Company Limited for the research, development, and commercialization of hCDR1 for various indications. The company was formerly known as Xenograft Technologies Ltd. and changed its name to XTL Biopharmaceuticals Ltd. in July 1995. XTL Biopharmaceuticals Ltd. was incorporated in 1993 and is headquartered in Ramat Gan, Israel.",
    "website": "http://www.xtlbio.com",
    "zipcode": "5218102"
  },
  "YP2A.F": {
    "city": "Hevel Modi'in",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Biotechnology",
    "long_name": "BioLineRx Ltd.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Healthcare",
    "short_name": "BIOLIN.RX S.ADR 15 IL-,01",
    "state": null,
    "summary": "BioLineRx Ltd., a clinical-stage biopharmaceutical development company, focuses on oncology. Its development pipeline consists of clinical-stage therapeutic candidates, which include BL-8040, a peptide for the treatment of solid tumors, hematological malignancies, and stem cell mobilization; AGI-134, an immuno-oncology agent in the development for solid tumors; and BL-5010, a customized, proprietary, pen-like applicator for the non-surgical removal of skin lesions. The company has collaboration agreement with MSD for the cancer immunotherapy field; MD Anderson Cancer Center to investigate the combination of BL-8040 with KEYTRUDA (pembrolizumab) in pancreatic cancer; and Genentech Inc. to investigate the combination of BL-8040 for solid tumors. BioLineRx Ltd. was founded in 2003 and is headquartered in Hevel Modi'in, Israel.",
    "website": "http://www.biolinerx.com",
    "zipcode": "7177871"
  }
}
