{
    "19C.F": {
        "short_name": "CAESARSTONE LTD.  IS -,04",
        "long_name": "Caesarstone Ltd.",
        "summary": "Caesarstone Ltd., together with its subsidiaries, develops, manufactures, and markets engineered quartz surfaces under the Caesarstone brand in the United States, Australia, Canada, Latin America, Asia, Israel, Europe, the Middle East, and Africa. The company's engineered quartz slabs are primarily used as kitchen countertops in the renovation and remodeling construction end markets, as well as in new buildings construction market. Its products are also used in other applications, such as vanity tops, wall panels, back splashes, floor tiles, stairs, furniture, and other interior and exterior surfaces that are used in various residential and non-residential applications. The company also offers porcelain products under the Lioli brand for flooring and cladding applications, as well as resells natural stones, and fabrication and installation accessories. It sells its products directly to fabricators, sub-distributors, and resellers; and indirectly through a network of independent distributors. The company was formerly known as Caesarstone Sdot Yam Ltd. and changed its name to Caesarstone Ltd. in June 2016. Caesarstone Ltd. was founded in 1987 and is headquartered in MP Menashe, Israel.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Menashe"
    },
    "CSTE": {
        "short_name": "Caesarstone Ltd.",
        "long_name": "Caesarstone Ltd.",
        "summary": "Caesarstone Ltd., together with its subsidiaries, develops, manufactures, and markets engineered quartz surfaces under the Caesarstone brand in the United States, Australia, Canada, Latin America, Asia, Israel, Europe, the Middle East, and Africa. The company's engineered quartz slabs are primarily used as kitchen countertops in the renovation and remodeling construction end markets, as well as in new buildings construction market. Its products are also used in other applications, such as vanity tops, wall panels, back splashes, floor tiles, stairs, furniture, and other interior and exterior surfaces that are used in various residential and non-residential applications. The company also offers porcelain products under the Lioli brand for flooring and cladding applications, as well as resells natural stones, and fabrication and installation accessories. It sells its products directly to fabricators, sub-distributors, and resellers; and indirectly through a network of independent distributors. The company was formerly known as Caesarstone Sdot Yam Ltd. and changed its name to Caesarstone Ltd. in June 2016. Caesarstone Ltd. was founded in 1987 and is headquartered in MP Menashe, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Menashe"
    },
    "GLPL.TA": {
        "short_name": "GOLAN PLASTIC PROD",
        "long_name": "Golan Plastic Products Ltd.",
        "summary": "Golan Plastic Products Ltd engages in the production and sale of PE-Xa piping solutions under the Pexgol name worldwide. The company provides pipes, fittings, and accessories. It serves the mining, industrial, infrastructure, residential, oil and gas, and aquaculture sectors. Golan Plastic Products Ltd was founded in 1964 and is based in Sha'ar HaGolan, Israel. Golan Plastic Products Ltd operates as a subsidiary of Kibbutz Shaar Hagolan",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Sha'ar HaGolan"
    },
    "HAMAT.TA": {
        "short_name": "HAMAT GROUP LTD",
        "long_name": "Hamat Group Ltd.",
        "summary": "Hamat Group Ltd. manufactures, markets, and exports bathroom and kitchen products in Israel and internationally. The company provides faucets for bathroom, kitchen, and toilet; showers and shower stalls; kitchen and bathroom sinks; and spare parts, such as pipes, tubs, steam delicacies, handles for taps, ceramic apparatus, and drainage products, as well as installations and sanitary products. It also offers bath accessories, such as soap dispensers, towel bars, racks, mirrors, aerators, toilet paper holders, toilet brush holders, garbage pails, grab bars, hangers, and other functional products. The company was founded in 1951 and is based in Ashdod, Israel. Hamat Group Ltd. is a subsidiary of Niur Holdings Ltd.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ashdod"
    },
    "PLRM.TA": {
        "short_name": "PALRAM INDUSTRIES",
        "long_name": "Palram Industries (1990) Ltd",
        "summary": "Palram Industries (1990) Ltd, together with its subsidiaries, manufactures and sells semi-finished extruded thermoplastic sheets, architectural panel systems, and finished products in Israel and internationally. The company offers PVC, polycarbonate and acrylic sheets, and panel systems. Its products are used in DIY, construction, architectural project, advertising, agriculture, glazing, and fabrication markets. The company was founded in 1963 and is based in Zevulun, Israel. Palram Industries (1990) Ltd operates as a subsidiary of Ramat Yohanan Industries & Agriculture Development-Agricultural Coperative Society.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Zevulun"
    }
}