{
    "ORTC.TA": {
        "short_name": "O.R.T. TECHNOLOGIE",
        "long_name": "O.R.T. Technologies Ltd",
        "summary": "O.R.T. Technologies Ltd, through its subsidiaries, supplies automotive fleet management and electronic payment method products in Israel. The company provides smart cards; and management and control systems, as well as related products for public transportation. It also offers automated ticketing systems; rear office servers; driver consoles, sales machines, and device microbiology systems on vehicles; and manual and automatic devices for sale and validation stations. The company was formerly known as Rapac Electronics Ltd. and changed its name to O.R.T. Technologies Ltd in 2006. O.R.T. Technologies Ltd was founded in 2000 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "OTIVF": {
        "short_name": "ON TRACK INNOVATIONS",
        "long_name": "On Track Innovations Ltd.",
        "summary": "On Track Innovations Ltd., together with its subsidiaries, designs, develops, and markets cashless payment solutions worldwide. It operates in two segments, Retail and Mass Transit Ticketing; and Petroleum. The company offers OTI UNO, a single interface and contactless reader that supports various card associations' applications, as well as wallets, such as Apple Pay, Google Pay, and Samsung Pay; OTI TRIO, a near-field communication and contactless reader, which offers three-in-one cashless payment card options comprising magnetic stripe (swipe), contact (chip), and contactless (tap); and OTI Interno, an original equipment manufacturer reader module with integrated antenna used for integration into mass transit validators and terminals. It also provides OTI TeleBox which enables communication between machines primarily for vending machines, kiosks, and meters; OTI GoBox, a machine-to-machine cashless payment and telemetry gateway primarily used to stream Full-HD media and run either Linux or Android; TRIO-IQ, a telemetry gateway and payment reader; otiMetry, a telemetry solution for smart vending and cashless payments; otiKiosk, a cashless payment acceptance and remote management solution for kiosks and self-service environments; and otiPulse, a cashless payment solution for pulse operated machines. In addition, the company offers ticket vending machines, which are encoding and loading electronic card tickets for the public transport, and for selling paper tickets, as well as reselling tickets through point of sale terminals. Further, it provides EasyFuel Plus, a fuel management and payment solution used to control and manage refueling operations. The company was formerly known as De-Bug Innovations Ltd. and changed its name to On Track Innovations Ltd. in July 1991. On Track Innovations Ltd. was founded in 1990 and is headquartered in Yokneam Illit, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    }
}