{
    "ORTC.TA": {
        "short_name": "O.R.T. TECHNOLOGIE",
        "long_name": "O.R.T. Technologies Ltd",
        "summary": "O.R.T. Technologies Ltd, through its subsidiaries, supplies automotive fleet management and electronic payment method products in Israel. The company provides smart cards; and management and control systems, as well as related products for public transportation. It also offers automated ticketing systems; rear office servers; driver consoles, sales machines, and device microbiology systems on vehicles; and manual and automatic devices for sale and validation stations. The company was formerly known as Rapac Electronics Ltd. and changed its name to O.R.T. Technologies Ltd in 2006. O.R.T. Technologies Ltd was founded in 2000 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": null,
        "website": "http://www.ortechno.com",
        "market_cap": null
    },
    "OTIVF": {
        "short_name": "ON TRACK INNOVATIONS",
        "long_name": "On Track Innovations Ltd.",
        "summary": "On Track Innovations Ltd., together with its subsidiaries, designs, develops, and markets cashless payment solutions worldwide. It operates in two segments, Retail and Petroleum. The company's product portfolio includes readers, controllers and terminals, management software, payment services, and a complete Payment System as a Service (PSaaS). It offers OtiMetry System that incorporates telemetry, sales, and operations into solution with cloud control, and real-time online management and alerts; TRIO-IQ, a telemetry gateway and EMV payment reader; TRIO, a payment device for installation in kiosks and vending machines; UNO-8 and UNO-PLUS, a contactless reader for unattended retail environments with self-service payment stations, including ATMs, toll roads, access control, and mass transit validators; and controllers and gateways comprises OTI TeleBox, a machine-to-machine controller that enables the communication between machines, and GoBox, a machine-to-machine controller that communicates between machines, cashless readers, and remote servers. The company also provides a terminal management system, which is a cloud-based system that provides real-time control and insights of each machine enabling operators to remotely manage their terminal's fleet; and cloud based vending management system and vending BI. In addition, it offers payment services, including payment service API, which is an application programming interface, close loop payment that supports close-loop payment cards, and APIs for integration with mobile payment solutions, as well as original equipment manufacturer (OEM) payment solutions. The company's readers are certified by various card associations and support Apple Pay, Google Pay, Samsung Pay, MIFARE, FeliCa, and others. The company was formerly known as De-Bug Innovations Ltd. and changed its name to On Track Innovations Ltd. in July 1991. On Track Innovations Ltd. was founded in 1990 and is headquartered in Yokneam Illit, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Yokneam Illit",
        "zipcode": "2069200",
        "website": "http://www.otiglobal.com",
        "market_cap": "Nano Cap"
    }
}