{
    "BRSYF": {
        "short_name": "BRAINSWAY LTD",
        "long_name": "Brainsway Ltd.",
        "summary": "Brainsway Ltd., a commercial stage medical device company, focuses on the development and sale of non-invasive neuromodulation products in Israel and internationally. It offers deep transcranial magnetic stimulation technology for the treatment of major depressive disorders, obsessive-compulsive disorders, bipolar disorders, post traumatic stress disorders, schizophrenia, smoking cessation, Alzheimer's disease, Asperger syndromes, alcohol addictions, attention deficit hyperactivity disorders, Parkinson's disease, and chronic neuropathic pains to transmit electric current flows at varying rates and creating an electromagnetic field that serves to depolarize cortical neurons and activate neural networks in various areas of the brain. The company primarily serves doctors, hospitals, and medical centers in the field of psychiatry. Brainsway Ltd. was founded in 2003 and is headquartered in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "BWAY": {
        "short_name": "Brainsway Ltd.",
        "long_name": "Brainsway Ltd.",
        "summary": "Brainsway Ltd., a commercial stage medical device company, focuses on the development and sale of non-invasive neuromodulation products in Israel and internationally. It offers deep transcranial magnetic stimulation technology for the treatment of major depressive disorders, obsessive-compulsive disorders, bipolar disorders, post traumatic stress disorders, schizophrenia, smoking cessation, Alzheimer's disease, Asperger syndromes, alcohol addictions, attention deficit hyperactivity disorders, Parkinson's disease, and chronic neuropathic pains to transmit electric current flows at varying rates and creating an electromagnetic field that serves to depolarize cortical neurons and activate neural networks in various areas of the brain. The company primarily serves doctors, hospitals, and medical centers in the field of psychiatry. Brainsway Ltd. was founded in 2003 and is headquartered in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "BWAY.TA": {
        "short_name": "BRAINSWAY LTD",
        "long_name": "Brainsway Ltd.",
        "summary": "Brainsway Ltd., a commercial stage medical device company, focuses on the development and sale of non-invasive neuromodulation products in Israel and internationally. It offers deep transcranial magnetic stimulation technology for the treatment of major depressive disorders, obsessive-compulsive disorders, bipolar disorders, post traumatic stress disorders, schizophrenia, smoking cessation, Alzheimer's disease, Asperger syndromes, alcohol addictions, attention deficit hyperactivity disorders, Parkinson's disease, and chronic neuropathic pains to transmit electric current flows at varying rates and creating an electromagnetic field that serves to depolarize cortical neurons and activate neural networks in various areas of the brain. The company primarily serves doctors, hospitals, and medical centers in the field of psychiatry. Brainsway Ltd. was founded in 2003 and is headquartered in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "CHEK": {
        "short_name": "Check-Cap Ltd.",
        "long_name": "Check-Cap Ltd.",
        "summary": "Check-Cap Ltd., a clinical stage medical diagnostics company, engages in the development of a capsule-based system that utilizes low-dose X-rays for screening of the colon to detect polyps, masses, and colorectal cancers in Israel. Its C-Scan system consists of C-Scan Cap, an X-ray scanning capsule, which is designed to measure, collect, and transmit structural information; C-Scan Track, a biocompatible unit worn on the patient's back for capsule control, tracking, and data recording; and C-Scan View, a personal computer-based software package, which is designed to retrieve and process clinical data from the C-Scan Track, and to reconstruct and produce 3D visualization of the colon's inner surface. The company was founded in 2004 and is based in Isfiya, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Isfiya"
    },
    "DRIO": {
        "short_name": "DarioHealth Corp.",
        "long_name": "DarioHealth Corp.",
        "summary": "DarioHealth Corp., a digital health company, develops and commercializes patented and proprietary technologies providing consumers with laboratory-testing capabilities using smart phones and other mobile devices in the United States, Europe, Australia, and Canada. The company's flagship product, Dario, also known as Dario Smart Diabetes Management Solution, is a mobile, real-time, cloud-based, diabetes management solution based on a software application combined with Dario Blood Glucose Monitoring System, a pocket-sized, blood glucose monitoring device. It offers DarioEngage software platform, where the company digitally engages with Dario users and assists them in monitoring their chronic illnesses, as well as provides them with coaching, support, digital communications; and real time alerts, trends, and pattern analysis. DarioHealth Corp. markets its products directly to consumer cash sales, as well as retail pharmacy, hospitals, and distributors; and through online. The company was formerly known as LabStyle Innovations Corp. and changed its name to DarioHealth Corp. in July 2016. DarioHealth Corp. was founded in 2011 and is headquartered in Caesarea, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "IDTA": {
        "short_name": "IDENTA CORP",
        "long_name": "IDenta Corp.",
        "summary": "IDenta Corp. manufactures and sells detection and forensic science equipment worldwide. The company offers drug, explosives, and bullet-hole testing kits; precursors of drugs test kits; and portable sniffers. It provides its solutions to law enforcement, military, and government agencies, as well as other organizations that deal in fighting illicit drugs and terrorist threats. IDenta Corp. is based in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "ROSGQ": {
        "short_name": "ROSETTA GENOMICS LTD",
        "long_name": "Rosetta Genomics Ltd.",
        "summary": "Rosetta Genomics Ltd. operates as a genomic diagnostics company worldwide. The company's microRNA technologies based diagnostic tests include RosettaGX Cancer Origin for the identification of the primary site of metastatic cancer; mi-KIDNEY, a kidney tumor classification test for pathology samples; RosettaGX Reveal for the diagnosis of indeterminate thyroid fine-needle aspirate samples; and mi-LUNG diagnostic tests. It also provides UroVysion, a urine-based Fluorescence In Situ Hybridization (FISH) assay that is intended for use in conjunction with and not in lieu of current standard diagnostic procedures, as an aid for initial diagnosis of bladder carcinoma in patients with hematuria and subsequent monitoring for tumor recurrence in patients previously diagnosed with bladder cancer; and ERG/PTEN, which are FISH-based prognostic tests in prostate cancer. In addition, the company offers ALK/ROS1 that are FISH-based predictive tests indicated for patients who are diagnosed with late stage lung cancer; and PCR gene mutation analysis for bladder, lung, colon, and melanoma patients. The company provides its diagnostic solutions for oncologists, urologists, endocrinologists, cytopathologists, and other specialists to facilitate them in serving their patients. It has a license agreement with Max Planck Innovation GmbH for the rights to its proprietary microRNAs for diagnostics and research purposes. The company also has a collaboration agreement with Meir Medical Center to develop a microRNA classifier relating to patients with non-small cell lung cancer considered for treatment with immuno oncology drugs. Rosetta Genomics Ltd. was founded in 2000 and is headquartered in Rehovot, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Rehovot"
    }
}