{
    "CHEK": {
        "short_name": "Check-Cap Ltd.",
        "long_name": "Check-Cap Ltd.",
        "summary": "Check-Cap Ltd., a clinical stage medical diagnostics company, engages in the development of a capsule-based system that utilizes low-dose X-rays to scan the inner lining of the colon for precancerous polyps, and other structural abnormalities in Israel. Its C-Scan system consists of C-Scan Cap, an X-ray scanning capsule, which is designed to measure, collect, and transmit structural information; C-Scan Track, a disposable system attached to the patient's back via biocompatible adhesive skin patches; and C-Scan View software, a client/server-based application that enables procedure data download from the C-Scan Track, data analysis and report generation. The company was founded in 2004 and is based in Isfiya, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Isfiya",
        "zipcode": "30090",
        "website": "http://www.check-cap.com",
        "market_cap": "Micro Cap"
    },
    "IDTA": {
        "short_name": "IDENTA CORP",
        "long_name": "IDenta Corp.",
        "summary": "IDenta Corp. develops, manufactures, and supplies field detection and home diagnostics testing kits for narcotics and explosives, and forensic products in the homeland security and consumer markets worldwide. The company offers drug, explosives, and bullet-hole testing kits; FerroPrint testing products; blood detection kits; precursors of drugs test kits; and portable sniffers. It provides its solutions to law enforcement, military, and government agencies, as well as other organizations that deal in fighting illicit drugs and terrorist threats. IDenta Corp. is headquartered in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Jerusalem",
        "zipcode": "93420",
        "website": "http://www.identa-corp.com",
        "market_cap": "Nano Cap"
    },
    "ROSGQ": {
        "short_name": "ROSETTA GENOMICS LTD",
        "long_name": "Rosetta Genomics Ltd.",
        "summary": "Rosetta Genomics Ltd. operates as a genomic diagnostics company worldwide. The company's microRNA technologies based diagnostic tests include RosettaGX Cancer Origin for the identification of the primary site of metastatic cancer; mi-KIDNEY, a kidney tumor classification test for pathology samples; RosettaGX Reveal for the diagnosis of indeterminate thyroid fine-needle aspirate samples; and mi-LUNG diagnostic tests. It also provides UroVysion, a urine-based Fluorescence In Situ Hybridization (FISH) assay that is intended for use in conjunction with and not in lieu of current standard diagnostic procedures, as an aid for initial diagnosis of bladder carcinoma in patients with hematuria and subsequent monitoring for tumor recurrence in patients previously diagnosed with bladder cancer; and ERG/PTEN, which are FISH-based prognostic tests in prostate cancer. In addition, the company offers ALK/ROS1 that are FISH-based predictive tests indicated for patients who are diagnosed with late stage lung cancer; and PCR gene mutation analysis for bladder, lung, colon, and melanoma patients. The company provides its diagnostic solutions for oncologists, urologists, endocrinologists, cytopathologists, and other specialists to facilitate them in serving their patients. It has a license agreement with Max Planck Innovation GmbH for the rights to its proprietary microRNAs for diagnostics and research purposes. The company also has a collaboration agreement with Meir Medical Center to develop a microRNA classifier relating to patients with non-small cell lung cancer considered for treatment with immuno oncology drugs. Rosetta Genomics Ltd. was founded in 2000 and is headquartered in Rehovot, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Diagnostics & Research",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Rehovot",
        "zipcode": "76706",
        "website": "http://www.rosettagenomics.com",
        "market_cap": "Nano Cap"
    }
}