{
    "2RH.F": {
        "short_name": "REDHILL B.S.ADR 10/IL-,01",
        "long_name": "RedHill Biopharma Ltd.",
        "summary": "RedHill Biopharma Ltd., a specialty biopharmaceutical company, primarily focused on gastrointestinal and infectious diseases. The company promotes gastrointestinal drugs, including Movantik for opioid-induced constipation in adults with chronic non-cancer pain; Talicia for the treatment of Helicobacter pylori infection in adults; and Aemcolo for the treatment of travelers' diarrhea in adults. Its clinical late-stage investigational development programs include RHB-204, which is in Phase 3 study for pulmonary nontuberculous mycobacteria infections; opaganib (Yeliva), an SK2 selective inhibitor, which has completed Phase 2 study to treat patients with SARS-CoV-2 severe COVID-19 pneumonia, in Phase 1/2a study to treat advanced unresectable cholangiocarcinoma, and in investigator-sponsored Phase 2 study to treat prostate cancer; RHB-104, which is in Phase 3 studies for Crohn's disease; RHB-102 (Bekinda) that is in Phase 3 studies for acute gastroenteritis and gastritis, and has completed Phase 2 studies for irritable bowel syndrome with diarrhea; RHB-107, which is in Phase 2/3 study to treat outpatients infected with COVID-19 disease, and Phase 2a study to treat advanced unresectable cholangiocarcinoma, as well as has completed Phase 2 study to treat gastrointestinal and other solid tumors; and RHB-106, an encapsulated formulation for bowel preparation, which has completed Phase 2a study. The company was incorporated in 2009 and is headquartered in Tel Aviv, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6473921",
        "website": "http://www.redhillbio.com",
        "market_cap": "Small Cap"
    },
    "CNZN.TA": {
        "short_name": "CANZON ISRAEL LTD",
        "long_name": "Canzon Israel Ltd",
        "summary": "Canzon Israel Ltd manages and operates Internet sites in Israel. It offers various tools, such as forums, blogs, and video sharing platforms to users. The company also provides design and development services for Internet and mobile sectors. It serves corporations and large companies, technology product companies, and start-up customers. The company distributes its products through sales people, events, and cooperation agreements. The company was formerly known as User Trend Ltd. Canzon Israel Ltd was founded in 1999 and is based in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jaffa",
        "zipcode": "6249245",
        "website": null,
        "market_cap": null
    },
    "IMCC.CN": {
        "short_name": "IMCannabisCorp",
        "long_name": "IM Cannabis Corp.",
        "summary": "IM Cannabis Corp. engages in breeding, growing, and supply of medical cannabis products in Israel, Germany, and Canada. It offers strains under the Roma, Dairy Queen, London, Tel Aviv, Paris, and Pandora Box brands; and CBD oil products under the IMC brand. The company also offers its intellectual property related services to the medical cannabis industry. IM Cannabis Corp. is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.imcannabis.com",
        "market_cap": "Small Cap"
    },
    "IMCC": {
        "short_name": "IM Cannabis Corp.",
        "long_name": "IM Cannabis Corp.",
        "summary": "IM Cannabis Corp. engages in breeding, growing, and supply of medical cannabis products in Israel, Germany, and Canada. It offers strains under the Roma, Dairy Queen, London, Tel Aviv, Paris, and Pandora Box brands; and CBD oil products under the IMC brand. The company also offers its intellectual property related services to the medical cannabis industry. IM Cannabis Corp. is headquartered in Tel Aviv-Yafo, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.imcannabis.com",
        "market_cap": "Small Cap"
    },
    "INCR-U.TO": {
        "short_name": "INTERCURE LTD USD",
        "long_name": "InterCure Ltd.",
        "summary": "InterCure Ltd, together with its subsidiaries, engages in the research, cultivation, production, marketing, and distribution of medical cannabis products in Israel and internationally. It also invests in biomed sector. The company was incorporated in 1994 and is headquartered in Herzliya, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4676670",
        "website": "http://www.intercure.co",
        "market_cap": "Small Cap"
    },
    "INCR.TA": {
        "short_name": "INTERCURE LTD",
        "long_name": "InterCure Ltd.",
        "summary": "InterCure Ltd, together with its subsidiaries, engages in the research, cultivation, production, marketing, and distribution of medical cannabis products in Israel and internationally. It also invests in biomed sector. The company was incorporated in 1994 and is headquartered in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4676670",
        "website": "http://www.intercure.co",
        "market_cap": null
    },
    "INTL.TA": {
        "short_name": "INTELICANNA LTD",
        "long_name": "Intelicanna Ltd",
        "summary": "Intelicanna Ltd provides various management consulting services in Israel, the United States, Europe, and internationally. The company offers its services in the areas of corporate strategy, global strategy, marketing strategy, mergers and acquisitions, turnaround management, and innovation strategy; and sales and marketing areas, such as sales and channel management, customer relationship management, customer lifecycle, organization and capabilities, product launch, sales force efficiency, and pricing. It also provides operation and organization services in various areas comprising operational excellence, customer service, organization design, change management, and people capabilities; and services in the areas of manufacturing and quality, including quality management, lean manufacturing, six sigma, capacity planning and OEE, and facility design. In addition, the company offers services in the areas of supply chain comprising strategy and risk management, planning, procurement, distribution and logistics, and reverse logistics and green supply chain; and portfolio management, project management excellence, IT governance, risk management, and design for X methodology. Further, it provides services in the areas of corporate finance, such as financial reporting and cost controlling, financing strategy and financial control, value based management, and financial restructuring services. Additionally, the company offers Tefen AI, an artificial intelligence tool for businesses. It serves various companies in the retail, patient care, life sciences, healthcare, financial services, general manufacturing, aviation and transportation, consumer goods, telecommunications, energy and utilities, public sector, high tech, semiconductors, and legal industries. The company was formerly known as Tefen Industrial Engineering & Management & Systems Analysis and changed its name to Intelicanna Ltd. Intelicanna Ltd was founded in 1982 and is based in Beit-Dagan, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Beit Dagan",
        "zipcode": "50200",
        "website": "http://www.tefen.com",
        "market_cap": null
    },
    "IRCLF": {
        "short_name": "INTERCURE LTD",
        "long_name": "InterCure Ltd.",
        "summary": "InterCure Ltd, together with its subsidiaries, engages in the research, cultivation, production, marketing, and distribution of medical cannabis products in Israel and internationally. It also invests in biomed sector. The company was incorporated in 1994 and is headquartered in Herzliya, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "4676670",
        "website": "http://www.intercure.co",
        "market_cap": "Small Cap"
    },
    "KMDA": {
        "short_name": "Kamada Ltd.",
        "long_name": "Kamada Ltd.",
        "summary": "Kamada Ltd. develops, produces, and markets plasma-derived protein therapeutics for orphan indications. It operates in two segments, Proprietary Products and Distribution. The company offers Glassia for use in chronic augmentation and maintenance therapy in adults with emphysema due to congenital Alpha-1 Antitrypsin (AAT) deficiency. It also provides KamRAB for prophylaxis of rabies disease; KamRho (D) IM to treat prophylaxis of hemolytic disease of newborns; KamRho (D) IV for immune thermobocytopunic purpura; and snake bite antiserum to treat snake bites by the vipera palaestinae and echis coloratus. In addition, the company distributes Bramitob to manage chronic pulmonary infection; FOSTER to treat asthma; PROVOCHOLINE for the diagnosis of bronchial airway hyperactivity; IVIG 5% for the treatment of various immunodeficiency-related conditions; AeroBika, an OPEP device; Varitect, a varicella zoster immunoglobulin; Zutectra and Hepatect CP for the prevention of hepatitis B virus; Megalotect, a CMV immunoglobulin; and RUCONEST for the treatment of acute angioedema attacks in adults with hereditary angioedema. Further, it distributes Heparin sodium injection to treat thrombo-embolic disorders; Albumin and Albumin 4% for maintenance of blood plasma; and coagulation factors comprising Factor VIII and Factor IX, as well as IXIARO vaccine. It markets its products through strategic partners in the United States, as well as through distributors internationally. Kamada Ltd. has strategic partnerships with Takeda Pharmaceutical Company Limited; PARI GmbH; and Kedrion Biopharma. The company was incorporated in 1990 and is headquartered in Rehovot, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Rehovot",
        "zipcode": "7670402",
        "website": "http://www.kamada.com",
        "market_cap": "Small Cap"
    },
    "KMDA.TA": {
        "short_name": "KAMADA LTD",
        "long_name": "Kamada Ltd.",
        "summary": "Kamada Ltd. develops, produces, and markets plasma-derived protein therapeutics for orphan indications. It operates in two segments, Proprietary Products and Distribution. The company offers Glassia for use in chronic augmentation and maintenance therapy in adults with emphysema due to congenital Alpha-1 Antitrypsin (AAT) deficiency. It also provides KamRAB for prophylaxis of rabies disease; KamRho (D) IM to treat prophylaxis of hemolytic disease of newborns; KamRho (D) IV for immune thermobocytopunic purpura; and snake bite antiserum to treat snake bites by the vipera palaestinae and echis coloratus. In addition, the company distributes Bramitob to manage chronic pulmonary infection; FOSTER to treat asthma; PROVOCHOLINE for the diagnosis of bronchial airway hyperactivity; IVIG 5% for the treatment of various immunodeficiency-related conditions; AeroBika, an OPEP device; Varitect, a varicella zoster immunoglobulin; Zutectra and Hepatect CP for the prevention of hepatitis B virus; Megalotect, a CMV immunoglobulin; and RUCONEST for the treatment of acute angioedema attacks in adults with hereditary angioedema. Further, it distributes Heparin sodium injection to treat thrombo-embolic disorders; Albumin and Albumin 4% for maintenance of blood plasma; and coagulation factors comprising Factor VIII and Factor IX, as well as IXIARO vaccine. It markets its products through strategic partners in the United States, as well as through distributors internationally. Kamada Ltd. has strategic partnerships with Takeda Pharmaceutical Company Limited; PARI GmbH; and Kedrion Biopharma. The company was incorporated in 1990 and is headquartered in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Rehovot",
        "zipcode": "7670402",
        "website": "http://www.kamada.com",
        "market_cap": null
    },
    "NXTG.TA": {
        "short_name": "NEXTAGE THERAPEUTI",
        "long_name": "Nextage Therapeutics Ltd",
        "summary": "Nextage Therapeutics Ltd develops and commercializes in-vitro cancer diagnostic products and solutions worldwide. It offers CellDetect, a diagnostic platform for early cancer detection, including bladder cancer, cervical cancer, and prostate cancer. The company also provides BRONJ Test, a test for bisphosphonate-related osteonecrosis of the jaw. In addition, it offers gene expression, and biomarker and histochemical assays for early cancer detection and personalized medicine. Further, the company provides diagnostic solutions for multiple cancer diagnostic applications. The company was formerly known as Micromedic Technologies Ltd and changed its name to Nextage Therapeutics Ltd in August 2020. Nextage Therapeutics Ltd is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6158101",
        "website": "http://www.m-medic.com",
        "market_cap": null
    },
    "OWCP": {
        "short_name": "OWC PHARMACEUTICAL RESEARCH COR",
        "long_name": "OWC Pharmaceutical Research Corp.",
        "summary": "OWC Pharmaceutical Research Corp., through its subsidiary, One World Cannabis Ltd., engages in the research and development of cannabis-based medical products. It develops cannabis-based medical products for the treatment of various conditions, including multiple myeloma, psoriasis, post-traumatic stress disorder, chronic pain, and fibromyalgia. The company is also involved in developing cannabis soluble tablet delivery system. In addition, it provides consulting services to companies and governmental agencies related to international medical cannabis protocols and regulations. The company was formerly known as Dynamic Applications Corp. and changed its name to OWC Pharmaceutical Research Corp. in December 2014. OWC Pharmaceutical Research Corp. was founded in 2008 and is based in Ramat Gan, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "5257334",
        "website": "http://www.owcpharma.com",
        "market_cap": "Small Cap"
    },
    "PMCN.TA": {
        "short_name": "PHARMOCANN GLOBAL",
        "long_name": "Pharmocann Global Ltd",
        "summary": "Pharmocann Global Ltd engages in cultivation of cannabis for medical purposes. The company was founded in 2008 and is based in Raanana, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Raanana",
        "zipcode": "4335810",
        "website": "http://pharmocann.com",
        "market_cap": null
    },
    "PNAX.TA": {
        "short_name": "PANAXIA LABS ISRAE",
        "long_name": "Panaxia Labs Israel Ltd",
        "summary": "Panaxia Pharmaceutical Industries Ltd provides pharmaceutical solutions for patients and physicians. The company offers pharma-grade smokeless cannabis products, such as oral and sublingual tablets, medical oils, concentrations, pastilles, suppositories, topical creams, pain relief creams, and pain relief patches. Panaxia Pharmaceutical Industries Ltd has strategic partnerships with Ultra Health, Salus Biopharma, MPX Bioceutical Corporation, Rafa, Pharmocann, Seach Medical Cannabis Group, TevaAdir, Better, and Cann10. The company was incorporated in 2016 and is based in Lod, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Lod",
        "zipcode": "7116002",
        "website": "http://www.panaxia.co.il",
        "market_cap": null
    },
    "PRFX": {
        "short_name": "PainReform Ltd.",
        "long_name": "PainReform Ltd.",
        "summary": "PainReform Ltd., a clinical stage specialty pharmaceutical company, engages in the development of therapeutics that provides an extended period of post-surgical pain relief in Israel. It engages in developing PRF-110, a viscous clear oil-based solution that is instilled directly into the surgical wound to provide localized and extended post-operative analgesia. The company is currently conducting two Phase 3 clinical trials of PRF-110 for the treatment of patients undergoing bunionectomy surgery and hernia repair. PainReform Ltd. was incorporated in 2007 and is based in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6745442",
        "website": "http://www.painreform.com",
        "market_cap": "Small Cap"
    },
    "RDHL": {
        "short_name": "Redhill Biopharma Ltd.",
        "long_name": "RedHill Biopharma Ltd.",
        "summary": "RedHill Biopharma Ltd., a specialty biopharmaceutical company, primarily focused on gastrointestinal and infectious diseases. The company promotes gastrointestinal drugs, including Movantik for opioid-induced constipation in adults with chronic non-cancer pain; Talicia for the treatment of Helicobacter pylori infection in adults; and Aemcolo for the treatment of travelers' diarrhea in adults. Its clinical late-stage investigational development programs include RHB-204, which is in Phase 3 study for pulmonary nontuberculous mycobacteria infections; opaganib (Yeliva), an SK2 selective inhibitor, which has completed Phase 2 study to treat patients with SARS-CoV-2 severe COVID-19 pneumonia, in Phase 1/2a study to treat advanced unresectable cholangiocarcinoma, and in investigator-sponsored Phase 2 study to treat prostate cancer; RHB-104, which is in Phase 3 studies for Crohn's disease; RHB-102 (Bekinda) that is in Phase 3 studies for acute gastroenteritis and gastritis, and has completed Phase 2 studies for irritable bowel syndrome with diarrhea; RHB-107, which is in Phase 2/3 study to treat outpatients infected with COVID-19 disease, and Phase 2a study to treat advanced unresectable cholangiocarcinoma, as well as has completed Phase 2 study to treat gastrointestinal and other solid tumors; and RHB-106, an encapsulated formulation for bowel preparation, which has completed Phase 2a study. The company was incorporated in 2009 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "6473921",
        "website": "http://www.redhillbio.com",
        "market_cap": "Small Cap"
    },
    "REKA.TA": {
        "short_name": "REKAH PHARMA IND",
        "long_name": "Rekah Pharmaceutical Industry Ltd.",
        "summary": "Rekah Pharmaceutical Industry Ltd. engages in the manufacture, marketing, sale, and distribution of prescription and OTC drugs, dermo-cosmetics, vitamins, and nutritional supplements in Israel. The company offers steroid tablets; antibiotics, including penicillin and cephalosporin; drops and ointments to treat allergies, infections, and dryness of the eyes; dermatological preparations; baby products; and vitamins and nutritional supplements. Its portfolio of products comprise approximately 280 drugs used in various medical fields. The company was founded in 1941 and is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Holon",
        "zipcode": "5881904",
        "website": "http://www.rekah.co.il",
        "market_cap": null
    },
    "TAL.F": {
        "short_name": "TARO PHAR.INDS. IS 0,0001",
        "long_name": "Taro Pharmaceutical Industries Ltd.",
        "summary": "Taro Pharmaceutical Industries Ltd., a science-based pharmaceutical company, develops, manufactures, and markets prescription and over-the-counter pharmaceutical products in the United States, Canada, Israel, and internationally. The company also develops and manufactures active pharmaceutical ingredients primarily for use in its finished dosage form products. It offers its products for various therapeutic categories comprises allergy, analgesic, antibacterial, antibiotic, anticonvulsant, antiemetic, antifungal, anti-inflammatory, anti-cancer, antiplatelet agent, antipyretic, cardiovascular, CNS, corticosteroid, cosmetic, cough and cold, dermatology, diuretic, endocrine, gastrointestinal, laxative, narcotics, neuropathic pain, neuropsychiatric, sedative/hypnotic, and topical anti-neoplastic. The company provides its products in the form of capsule, cream, drops, emulsion, gel/gel kit, granules, injectable, lotion, oil, ointment, paste, powder/powder for solution, rectal suppository, shampoo, solution/solution for infusion, spray, suspension, syrup, tablets, toothpaste and mouthwash, topical foam, and topical solution. It distributes and sells its products directly to wholesalers, retail drug store chains, food chains, mass merchandisers, grocery chains, and other direct purchasers and customers, as well as healthcare institutions and private pharmacies. The company was founded in 1959 and is based in Haifa Bay, Israel. Taro Pharmaceutical Industries Ltd. is a subsidiary of Alkaloida Chemical Company Exclusive Group Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Haifa",
        "zipcode": "2624761",
        "website": "http://www.taro.com",
        "market_cap": "Mid Cap"
    },
    "TARO": {
        "short_name": "Taro Pharmaceutical Industries ",
        "long_name": "Taro Pharmaceutical Industries Ltd.",
        "summary": "Taro Pharmaceutical Industries Ltd., a science-based pharmaceutical company, develops, manufactures, and markets prescription and over-the-counter pharmaceutical products in the United States, Canada, Israel, and internationally. The company also develops and manufactures active pharmaceutical ingredients primarily for use in its finished dosage form products. It offers its products for various therapeutic categories comprises allergy, analgesic, antibacterial, antibiotic, anticonvulsant, antiemetic, antifungal, anti-inflammatory, anti-cancer, antiplatelet agent, antipyretic, cardiovascular, CNS, corticosteroid, cosmetic, cough and cold, dermatology, diuretic, endocrine, gastrointestinal, laxative, narcotics, neuropathic pain, neuropsychiatric, sedative/hypnotic, and topical anti-neoplastic. The company provides its products in the form of capsule, cream, drops, emulsion, gel/gel kit, granules, injectable, lotion, oil, ointment, paste, powder/powder for solution, rectal suppository, shampoo, solution/solution for infusion, spray, suspension, syrup, tablets, toothpaste and mouthwash, topical foam, and topical solution. It distributes and sells its products directly to wholesalers, retail drug store chains, food chains, mass merchandisers, grocery chains, and other direct purchasers and customers, as well as healthcare institutions and private pharmacies. The company was founded in 1959 and is based in Haifa Bay, Israel. Taro Pharmaceutical Industries Ltd. is a subsidiary of Alkaloida Chemical Company Exclusive Group Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Haifa",
        "zipcode": "2624761",
        "website": "http://www.taro.com",
        "market_cap": "Mid Cap"
    },
    "TEV.F": {
        "short_name": "TEVA PHARMACEUT. SP.ADR",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, it focuses on the central nervous system, pain, respiratory, and oncology areas. Its products in the central nervous system and pain area include Copaxone for the treatment of relapsing forms of multiple sclerosis; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. The company's products in the respiratory market comprise ProAir, QVAR, ProAir Digihaler, AirDuo Digihaler, and ArmonAir Digihaler, BRALTUS, CINQAIR/CINQAERO, DuoResp Spiromax, and AirDuo RespiClick/ArmonAir RespiClick for the treatment of asthma and chronic obstructive pulmonary disease. Its products in the oncology market include Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim. The company was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951033",
        "website": "http://www.tevapharm.com",
        "market_cap": "Large Cap"
    },
    "TEVA": {
        "short_name": "Teva Pharmaceutical Industries ",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, it focuses on the central nervous system, pain, respiratory, and oncology areas. Its products in the central nervous system and pain area include Copaxone for the treatment of relapsing forms of multiple sclerosis; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. The company's products in the respiratory market comprise ProAir, QVAR, ProAir Digihaler, AirDuo Digihaler, and ArmonAir Digihaler, BRALTUS, CINQAIR/CINQAERO, DuoResp Spiromax, and AirDuo RespiClick/ArmonAir RespiClick for the treatment of asthma and chronic obstructive pulmonary disease. Its products in the oncology market include Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim. The company was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951033",
        "website": "http://www.tevapharm.com",
        "market_cap": "Large Cap"
    },
    "TEVA.TA": {
        "short_name": "TEVA PHARMA IND",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, it focuses on the central nervous system, pain, respiratory, and oncology areas. Its products in the central nervous system and pain area include Copaxone for the treatment of relapsing forms of multiple sclerosis; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. The company's products in the respiratory market comprise ProAir, QVAR, ProAir Digihaler, AirDuo Digihaler, and ArmonAir Digihaler, BRALTUS, CINQAIR/CINQAERO, DuoResp Spiromax, and AirDuo RespiClick/ArmonAir RespiClick for the treatment of asthma and chronic obstructive pulmonary disease. Its products in the oncology market include Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim. The company was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951033",
        "website": "http://www.tevapharm.com",
        "market_cap": null
    },
    "TEVA.VI": {
        "short_name": "TEVA PHARMACEUTICAL ADR",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, it focuses on the central nervous system, pain, respiratory, and oncology areas. Its products in the central nervous system and pain area include Copaxone for the treatment of relapsing forms of multiple sclerosis; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. The company's products in the respiratory market comprise ProAir, QVAR, ProAir Digihaler, AirDuo Digihaler, and ArmonAir Digihaler, BRALTUS, CINQAIR/CINQAERO, DuoResp Spiromax, and AirDuo RespiClick/ArmonAir RespiClick for the treatment of asthma and chronic obstructive pulmonary disease. Its products in the oncology market include Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim. The company was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951033",
        "website": "http://www.tevapharm.com",
        "market_cap": "Large Cap"
    },
    "TEVJF": {
        "short_name": "TEVA PHARMACEUTICAL INDUSTRIES",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, it focuses on the central nervous system, pain, respiratory, and oncology areas. Its products in the central nervous system and pain area include Copaxone for the treatment of relapsing forms of multiple sclerosis; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. The company's products in the respiratory market comprise ProAir, QVAR, ProAir Digihaler, AirDuo Digihaler, and ArmonAir Digihaler, BRALTUS, CINQAIR/CINQAERO, DuoResp Spiromax, and AirDuo RespiClick/ArmonAir RespiClick for the treatment of asthma and chronic obstructive pulmonary disease. Its products in the oncology market include Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim. The company was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951033",
        "website": "http://www.tevapharm.com",
        "market_cap": "Large Cap"
    },
    "TGTR.TA": {
        "short_name": "TOGETHER PHARMA",
        "long_name": "Together Pharma Ltd",
        "summary": "Together Pharma Ltd, through its subsidiaries, engages in growing, production, storage, and distribution of medical cannabis products in Israel. The company is based in Ashkelon, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ashkelon",
        "zipcode": "7810001",
        "website": "http://www.together-pharma.com",
        "market_cap": null
    },
    "TKUN.TA": {
        "short_name": "TIKUN OLAM - CANNB",
        "long_name": "Tikun Olam - Cannbit Pharmaceuticals Ltd",
        "summary": "Tikun Olam - Cannbit Pharmaceuticals Ltd engages in the research, development, cultivation, manufacture, marketing, and sale of medical cannabis and related products. The company was incorporated in 1995 and is based in Tel Aviv-Yafo, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv-Yafo",
        "zipcode": null,
        "website": "http://tikun-olam.org.il",
        "market_cap": null
    }
}