{
    "2RH.F": {
        "short_name": "REDHILL B.S.ADR 10/IL-,01",
        "long_name": "RedHill Biopharma Ltd.",
        "summary": "RedHill Biopharma Ltd., a specialty biopharmaceutical company, primarily focused on gastrointestinal and infectious diseases. The company promotes gastrointestinal drugs, including Movantik for opioid-induced constipation in adults with non-cancer pain; Talicia for the treatment of Helicobacter pylori infection in adults; and Aemcolo for the treatment of travelers' diarrhea in adults. Its clinical late-stage investigational development programs include RHB-204, with a planned Phase 3 study for pulmonary nontuberculous mycobacteria infections; opaganib (Yeliva), a SK2 selective inhibitor targeting various indications with a Phase 2/3 program for COVID-19 and Phase 2 studies for prostate cancer and cholangiocarcinoma ongoing; RHB-104, which is in Phase 3 studies for Crohn's disease; RHB-102 (Bekinda) that is in Phase 3 studies for acute gastroenteritis and gastritis, and in Phase 2 studies for irritable bowel syndrome with diarrhea; RHB-107, a Phase 2-stage serine protease inhibitor for cancer and inflammatory gastrointestinal diseases, and is also being evaluated for COVID-19; and RHB-106, an encapsulated bowel preparation. The company was founded in 2009 and is headquartered in Tel Aviv, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "CNZN.TA": {
        "short_name": "CANZON ISRAEL LTD",
        "long_name": "Canzon Israel Ltd",
        "summary": "Canzon Israel Ltd manages and operates Internet sites in Israel. It offers various tools, such as forums, blogs, and video sharing platforms to users. The company also provides design and development services for Internet and mobile sectors. It serves corporations and large companies, technology product companies, and start-up customers. The company distributes its products through sales people, events, and cooperation agreements. The company was formerly known as User Trend Ltd. Canzon Israel Ltd was founded in 1999 and is based in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jaffa"
    },
    "IMCC.CN": {
        "short_name": "IMCannabisCorp",
        "long_name": "IM Cannabis Corp.",
        "summary": "IM Cannabis Corp. focuses on breeding, growing, and supply of medical cannabis products in Israel and Germany. Its products include strains and oils. The company also offers its intellectual property related services to the medical cannabis industry. IM Cannabis Corp. is based in Tel Aviv, Israel.",
        "currency": "CAD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "IMCNF": {
        "short_name": "IM CANNABIS CORP",
        "long_name": "IM Cannabis Corp.",
        "summary": "IM Cannabis Corp. focuses on breeding, growing, and supply of medical cannabis products in Israel and Germany. Its products include strains and oils. The company also offers its intellectual property related services to the medical cannabis industry. IM Cannabis Corp. is based in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "KMDA": {
        "short_name": "Kamada Ltd.",
        "long_name": "Kamada Ltd.",
        "summary": "Kamada Ltd. develops, produces, and markets plasma-derived protein therapeutics for orphan indications. It operates in two segments, Proprietary Products and Distribution. The company offers respiratory products, including Glassia for use in chronic augmentation and maintenance therapy in adults with emphysema due to congenital Alpha-1 Antitrypsin (AAT) deficiency. It also provides KamRAB for prophylaxis of rabies disease; KamRho (D) IM to treat prophylaxis of hemolytic disease of newborns; KamRho (D) IV for immune thermobocytopunic purpura; and snake bite antiserum to treat snake bites by the vipera palaestinae and echis coloratus, as well as human transferrin that is used as a cultural medium for diagnostic assays and cell cultures. In addition, the company distributes Bramitob to manage chronic pulmonary infection; FOSTER to treat asthma; PROVOCHOLINE for the diagnosis of bronchial airway hyperactivity; IVIG 5% for the treatment of various immunodeficiency-related conditions; Varitect, a varicella zoster immunoglobulin; Zutectra and Hepatect CP for the prevention of hepatitis B virus; Megalotect, a CMV immunoglobulin; and RUCONEST for the treatment of acute angioedema attacks in adults with hereditary angioedema. Further, it distributes Heparin sodium injection to treat thrombo-embolic disorders; Albumin and Albumin 4% for maintenance of blood plasma; and coagulation factors comprising Factor VIII and Factor IX, as well as IXIARO vaccine. The company's products in pipeline are G1-AAT (IV) for graft versus host disease and L1-AAT (1V) for lung transparent that are in Phase II stage; and Inhaled AAT for AAT deficiency, which is in Phase II and III stages. It markets its products through strategic partners in the United States, as well as through distributors internationally. Kamada Ltd. has strategic partnerships with Takeda Pharmaceutical Company Limited; PARI GmbH; and Kedrion Biopharma. The company was founded in 1990 and is headquartered in Rehovot, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Rehovot"
    },
    "KMDA.TA": {
        "short_name": "KAMADA LTD",
        "long_name": "Kamada Ltd.",
        "summary": "Kamada Ltd. develops, produces, and markets plasma-derived protein therapeutics for orphan indications. It operates in two segments, Proprietary Products and Distribution. The company offers respiratory products, including Glassia for use in chronic augmentation and maintenance therapy in adults with emphysema due to congenital Alpha-1 Antitrypsin (AAT) deficiency. It also provides KamRAB for prophylaxis of rabies disease; KamRho (D) IM to treat prophylaxis of hemolytic disease of newborns; KamRho (D) IV for immune thermobocytopunic purpura; and snake bite antiserum to treat snake bites by the vipera palaestinae and echis coloratus, as well as human transferrin that is used as a cultural medium for diagnostic assays and cell cultures. In addition, the company distributes Bramitob to manage chronic pulmonary infection; FOSTER to treat asthma; PROVOCHOLINE for the diagnosis of bronchial airway hyperactivity; IVIG 5% for the treatment of various immunodeficiency-related conditions; Varitect, a varicella zoster immunoglobulin; Zutectra and Hepatect CP for the prevention of hepatitis B virus; Megalotect, a CMV immunoglobulin; and RUCONEST for the treatment of acute angioedema attacks in adults with hereditary angioedema. Further, it distributes Heparin sodium injection to treat thrombo-embolic disorders; Albumin and Albumin 4% for maintenance of blood plasma; and coagulation factors comprising Factor VIII and Factor IX, as well as IXIARO vaccine. The company's products in pipeline are G1-AAT (IV) for graft versus host disease and L1-AAT (1V) for lung transparent that are in Phase II stage; and Inhaled AAT for AAT deficiency, which is in Phase II and III stages. It markets its products through strategic partners in the United States, as well as through distributors internationally. Kamada Ltd. has strategic partnerships with Takeda Pharmaceutical Company Limited; PARI GmbH; and Kedrion Biopharma. The company was founded in 1990 and is headquartered in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rehovot"
    },
    "NXTG.TA": {
        "short_name": "NEXTAGE THERAPEUTI",
        "long_name": "Nextage Therapeutics Ltd",
        "summary": "Nextage Therapeutics Ltd develops and commercializes in-vitro cancer diagnostic products and solutions worldwide. It offers CellDetect, a diagnostic platform for early cancer detection, including bladder cancer, cervical cancer, and prostate cancer. The company also provides BRONJ Test, a test for bisphosphonate-related osteonecrosis of the jaw. In addition, it offers gene expression, and biomarker and histochemical assays for early cancer detection and personalized medicine. Further, the company provides diagnostic solutions for multiple cancer diagnostic applications. The company was formerly known as Micromedic Technologies Ltd and changed its name to Nextage Therapeutics Ltd in August 2020. Nextage Therapeutics Ltd is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "OWCP": {
        "short_name": "OWC PHARMACEUTICAL RESEARCH COR",
        "long_name": "OWC Pharmaceutical Research Corp.",
        "summary": "OWC Pharmaceutical Research Corp., through its subsidiary, One World Cannabis Ltd., engages in the research and development of cannabis-based medical products. It develops cannabis-based medical products for the treatment of various conditions, including multiple myeloma, psoriasis, post-traumatic stress disorder, chronic pain, and fibromyalgia. The company is also involved in developing cannabis soluble tablet delivery system. In addition, it provides consulting services to companies and governmental agencies related to international medical cannabis protocols and regulations. The company was formerly known as Dynamic Applications Corp. and changed its name to OWC Pharmaceutical Research Corp. in December 2014. OWC Pharmaceutical Research Corp. was founded in 2008 and is based in Ramat Gan, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Ramat Gan"
    },
    "PNAX.TA": {
        "short_name": "PANAXIA LABS ISRAE",
        "long_name": "Panaxia Labs Israel Ltd",
        "summary": "Panaxia Pharmaceutical Industries Ltd provides pharmaceutical solutions for patients and physicians. The company offers pharma-grade smokeless cannabis products, such as oral and sublingual tablets, medical oils, concentrations, pastilles, suppositories, topical creams, pain relief creams, and pain relief patches. Panaxia Pharmaceutical Industries Ltd has strategic partnerships with Ultra Health, Salus Biopharma, MPX Bioceutical Corporation, Rafa, Pharmocann, Seach Medical Cannabis Group, TevaAdir, Better, and Cann10. The company was incorporated in 2016 and is based in Lod, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Lod"
    },
    "PRFX": {
        "short_name": "PainReform Ltd.",
        "long_name": "PainReform Ltd.",
        "summary": "PainReform Ltd., a clinical stage specialty pharmaceutical company, engages in the development of products for the treatment of pain in Israel. It develops PRF-110, a product based on local anesthetic ropivacaine, which completed Phase II clinical study in hernia repair. The company was founded in 2007 and is headquartered in Herzeliya, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Herzliya"
    },
    "RDHL": {
        "short_name": "Redhill Biopharma Ltd.",
        "long_name": "RedHill Biopharma Ltd.",
        "summary": "RedHill Biopharma Ltd., a specialty biopharmaceutical company, primarily focused on gastrointestinal and infectious diseases. The company promotes gastrointestinal drugs, including Movantik for opioid-induced constipation in adults with non-cancer pain; Talicia for the treatment of Helicobacter pylori infection in adults; and Aemcolo for the treatment of travelers' diarrhea in adults. Its clinical late-stage investigational development programs include RHB-204, with a planned Phase 3 study for pulmonary nontuberculous mycobacteria infections; opaganib (Yeliva), a SK2 selective inhibitor targeting various indications with a Phase 2/3 program for COVID-19 and Phase 2 studies for prostate cancer and cholangiocarcinoma ongoing; RHB-104, which is in Phase 3 studies for Crohn's disease; RHB-102 (Bekinda) that is in Phase 3 studies for acute gastroenteritis and gastritis, and in Phase 2 studies for irritable bowel syndrome with diarrhea; RHB-107, a Phase 2-stage serine protease inhibitor for cancer and inflammatory gastrointestinal diseases, and is also being evaluated for COVID-19; and RHB-106, an encapsulated bowel preparation. The company was founded in 2009 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "REKA.TA": {
        "short_name": "REKAH PHARMA IND",
        "long_name": "Rekah Pharmaceutical Industry Ltd.",
        "summary": "Rekah Pharmaceutical Industry Ltd. engages in the manufacture, marketing, sale, and distribution of prescription and OTC drugs, dermo-cosmetics, vitamins, and nutritional supplements in Israel. The company offers steroid tablets; antibiotics, including penicillin and cephalosporin; drops and ointments to treat allergies, infections, and dryness of the eyes; dermatological preparations; baby products; and vitamins and nutritional supplements. Its portfolio of products comprise approximately 280 drugs used in various medical fields. The company was founded in 1941 and is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Holon"
    },
    "TAL.F": {
        "short_name": "TARO PHAR.INDS. IS 0,0001",
        "long_name": "Taro Pharmaceutical Industries Ltd.",
        "summary": "Taro Pharmaceutical Industries Ltd., a science-based pharmaceutical company, develops, manufactures, and markets prescription and over-the-counter pharmaceutical products in the United States, Canada, Israel, and internationally. The company also develops and manufactures active pharmaceutical ingredients primarily for use in its finished dosage form products. It offers its products for various therapeutic categories comprises allergy, analgesic, antibacterial, antibiotic, anticonvulsant, antiemetic, antifungal, anti-inflammatory, anti-cancer, antiplatelet agent, antipyretic, cardiovascular, CNS, corticosteroid, cosmetic, cough and cold, dermatology, diuretic, endocrine, gastrointestinal, laxative, narcotics, neuropathic pain, neuropsychiatric, sedative/hypnotic, and topical anti-neoplastic. The company provides its products in the form of capsule, cream, drops, emulsion, gel/gel kit, granules, injectable, lotion, oil, ointment, paste, powder/powder for solution, rectal suppository, shampoo, solution/solution for infusion, spray, suspension, syrup, tablets, toothpaste and mouthwash, topical foam, and topical solution. It distributes and sells its products directly to wholesalers, retail drug store chains, food chains, mass merchandisers, grocery chains, and other direct purchasers and customers, as well as healthcare institutions and private pharmacies. The company was founded in 1959 and is based in Haifa Bay, Israel. Taro Pharmaceutical Industries Ltd. is a subsidiary of Alkaloida Chemical Company Exclusive Group Ltd.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "TARO": {
        "short_name": "Taro Pharmaceutical Industries ",
        "long_name": "Taro Pharmaceutical Industries Ltd.",
        "summary": "Taro Pharmaceutical Industries Ltd., a science-based pharmaceutical company, develops, manufactures, and markets prescription and over-the-counter pharmaceutical products in the United States, Canada, Israel, and internationally. The company also develops and manufactures active pharmaceutical ingredients primarily for use in its finished dosage form products. It offers its products for various therapeutic categories comprises allergy, analgesic, antibacterial, antibiotic, anticonvulsant, antiemetic, antifungal, anti-inflammatory, anti-cancer, antiplatelet agent, antipyretic, cardiovascular, CNS, corticosteroid, cosmetic, cough and cold, dermatology, diuretic, endocrine, gastrointestinal, laxative, narcotics, neuropathic pain, neuropsychiatric, sedative/hypnotic, and topical anti-neoplastic. The company provides its products in the form of capsule, cream, drops, emulsion, gel/gel kit, granules, injectable, lotion, oil, ointment, paste, powder/powder for solution, rectal suppository, shampoo, solution/solution for infusion, spray, suspension, syrup, tablets, toothpaste and mouthwash, topical foam, and topical solution. It distributes and sells its products directly to wholesalers, retail drug store chains, food chains, mass merchandisers, grocery chains, and other direct purchasers and customers, as well as healthcare institutions and private pharmacies. The company was founded in 1959 and is based in Haifa Bay, Israel. Taro Pharmaceutical Industries Ltd. is a subsidiary of Alkaloida Chemical Company Exclusive Group Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "TEV.F": {
        "short_name": "TEVA PHARMACEUT. SP.ADR",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, the company provides specialty medicines for use in central nervous system and respiratory indications. Further, its products in the central nervous system and pain area comprise Copaxone for the treatment of relapsing forms of MS; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. Additionally, the company's products in the respiratory market include ProAir, ProAir Respiclick, QVAR, Duoresp Spiromax, Braltus, Cinqair/Cinqaero, and AirDuo RespiClick/ArmonAir RespiClick/AirDuo Digihaler for the treatment of asthma and chronic obstructive pulmonary disease, as well as Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim products in the oncology market. It has collaboration arrangements with Otsuka Pharmaceutical Co. Ltd. and Regeneron Pharmaceuticals, Inc. Teva Pharmaceutical Industries Limited was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "TEVA": {
        "short_name": "Teva Pharmaceutical Industries ",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, the company provides specialty medicines for use in central nervous system and respiratory indications. Further, its products in the central nervous system and pain area comprise Copaxone for the treatment of relapsing forms of MS; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. Additionally, the company's products in the respiratory market include ProAir, ProAir Respiclick, QVAR, Duoresp Spiromax, Braltus, Cinqair/Cinqaero, and AirDuo RespiClick/ArmonAir RespiClick/AirDuo Digihaler for the treatment of asthma and chronic obstructive pulmonary disease, as well as Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim products in the oncology market. It has collaboration arrangements with Otsuka Pharmaceutical Co. Ltd. and Regeneron Pharmaceuticals, Inc. Teva Pharmaceutical Industries Limited was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "TEVA.TA": {
        "short_name": "TEVA PHARMA IND",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, the company provides specialty medicines for use in central nervous system and respiratory indications. Further, its products in the central nervous system and pain area comprise Copaxone for the treatment of relapsing forms of MS; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. Additionally, the company's products in the respiratory market include ProAir, ProAir Respiclick, QVAR, Duoresp Spiromax, Braltus, Cinqair/Cinqaero, and AirDuo RespiClick/ArmonAir RespiClick/AirDuo Digihaler for the treatment of asthma and chronic obstructive pulmonary disease, as well as Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim products in the oncology market. It has collaboration arrangements with Otsuka Pharmaceutical Co. Ltd. and Regeneron Pharmaceuticals, Inc. Teva Pharmaceutical Industries Limited was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "TEVA.VI": {
        "short_name": "TEVA PHARMACEUTICAL ADR",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, the company provides specialty medicines for use in central nervous system and respiratory indications. Further, its products in the central nervous system and pain area comprise Copaxone for the treatment of relapsing forms of MS; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. Additionally, the company's products in the respiratory market include ProAir, ProAir Respiclick, QVAR, Duoresp Spiromax, Braltus, Cinqair/Cinqaero, and AirDuo RespiClick/ArmonAir RespiClick/AirDuo Digihaler for the treatment of asthma and chronic obstructive pulmonary disease, as well as Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim products in the oncology market. It has collaboration arrangements with Otsuka Pharmaceutical Co. Ltd. and Regeneron Pharmaceuticals, Inc. Teva Pharmaceutical Industries Limited was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "TEVJF": {
        "short_name": "TEVA PHARMACEUTICAL INDUSTRIES",
        "long_name": "Teva Pharmaceutical Industries Limited",
        "summary": "Teva Pharmaceutical Industries Limited, a pharmaceutical company, develops, manufactures, markets, and distributes generic medicines, specialty medicines, and biopharmaceutical products in North America, Europe, and internationally. The company offers sterile products, hormones, high-potency drugs, and cytotoxic substances in various dosage forms, including tablets, capsules, injectables, inhalants, liquids, ointments, and creams. It also develops, manufactures, and sells active pharmaceutical ingredients. In addition, the company provides specialty medicines for use in central nervous system and respiratory indications. Further, its products in the central nervous system and pain area comprise Copaxone for the treatment of relapsing forms of MS; AJOVY for the preventive treatment of migraine; and AUSTEDO for the treatment of tardive dyskinesia and chorea associated with Huntington disease. Additionally, the company's products in the respiratory market include ProAir, ProAir Respiclick, QVAR, Duoresp Spiromax, Braltus, Cinqair/Cinqaero, and AirDuo RespiClick/ArmonAir RespiClick/AirDuo Digihaler for the treatment of asthma and chronic obstructive pulmonary disease, as well as Bendeka, Treanda, Granix, Trisenox, Lonquex, and Tevagrastim/Ratiograstim products in the oncology market. It has collaboration arrangements with Otsuka Pharmaceutical Co. Ltd. and Regeneron Pharmaceuticals, Inc. Teva Pharmaceutical Industries Limited was founded in 1901 and is headquartered in Petach Tikva, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "TGTR.TA": {
        "short_name": "TOGETHER PHARMA",
        "long_name": "Together Pharma Ltd",
        "summary": "Together Pharma Ltd, through its subsidiary, Globus Pharma Ltd., engages in growing, producing, and distributing medical cannabis products in Israel. The company is headquartered in Ashkelon, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ashkelon"
    },
    "TKUN.TA": {
        "short_name": "TIKUN OLAM - CANNB",
        "long_name": "Tikun Olam - Cannbit Pharmaceuticals Ltd",
        "summary": "A.L. Capital Holdings (2016) Ltd. does not have significant operations. The company was formerly known as Tamaris Holdings (1995) Ltd. and changed its name to A.L. Capital Holdings (2016) Ltd. in December 2015. The company was incorporated in 1995 and is based in Ramat Gan, Israel. A.L.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Drug Manufacturers—Specialty & Generic",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramat Gan"
    }
}