{
    "ACCL.TA": {
        "short_name": "ACCEL SOLUTIONS GR",
        "long_name": "Accel Solutions Group Ltd",
        "summary": "Accel Solutions Group Ltd engages in real estate development business in Ethiopia, Israel, and New York, the United States. The company also promotes and enhances technological projects in the areas of life sciences and cleantech; and engages in sorting and marketing of edible chicken eggs. It provides its products through retail chains and distributors. The company was founded in 1971 and is headquartered in Ramat Gan, Israel. Accel Solutions Group Ltd is a subsidiary of Ultra Equity Investments Ltd.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ramat Gan"
    },
    "BRMG.TA": {
        "short_name": "BRIMAG DIGITAL AGE",
        "long_name": "Brimag Digital Age Ltd.",
        "summary": "Brimag Digital Age Ltd. imports, markets, and distributes home appliances and commercial air conditioning systems in Israel. It operates through Commercial Systems Sector and Household Products Sector segments. The company markets household refrigerators, freezers, washing machines, dryers, dishwashers, queues, stoves, etc.; home electronics products, including smart TVs, VR glasses, video cameras, and audio systems; and small electrical appliances, such as vacuum cleaners, coffee makers, microwave ovens, food processors and mixers, wireless telephones, and telephones, toasters, ovens, irons, electric kettles, toiletries, and other products. It also provides warranty, maintenance, and repair services. The company sells its products under the under company-owned brands comprising CHROMEX, GRAETZ LENCO, DRAGON, and HOME. Brimag Digital Age Ltd. was incorporated in 1993 and is based in Azor, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Azor"
    },
    "RLCO.TA": {
        "short_name": "RALCO AGENCIES",
        "long_name": "Ralco Agencies Ltd",
        "summary": "Ralco Agencies Ltd imports, distributes, and sells electrical and electronic appliances in Israel. The company offers refrigerators, LCD TVs, washing machines, microwave ovens, built-in ovens, tumble dryers, dishwashers, stoves, and vacuum cleaners. It markets its products through stores, as well as through online stores. The company was founded in 1983 and is based in Azor, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Azor"
    },
    "TLSY.TA": {
        "short_name": "TELSYS LTD",
        "long_name": "Telsys Ltd.",
        "summary": "Telsys Ltd. imports, markets, and distributes electronic components in Israel. The company offers semiconductors, subsystems, passives, connectors, microwaves, telecom/datacom products, and others. It also provides specialized services. The company was founded in 1963 and is based in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    }
}