{
    "AFHL.TA": {
        "short_name": "AFCON HOLDINGS LTD",
        "long_name": "Afcon Holdings Ltd",
        "summary": "Afcon Holdings Ltd engages in the construction and infrastructure, control and automation, trade, and communication solutions businesses in Israel and internationally. It provides solutions and technologies in the areas of multi-system infrastructure projects, including construction contracting and finishing works; installation of electromechanical systems and electrical systems for industry; manufacture and installation of HV/MV/LV switchgear products for buildings, industry, and infrastructure; natural gas engineering; and the construction and setup of wind farms, photovoltaic fields, and infrastructure facilities. The company also offers control and automation solutions, such as industrial control, building monitoring and management, security solutions, fire protection and safety, parking systems, and remote water metering solutions. In addition, it engages in the design, development, manufacture, marketing, installation, distribution, servicing, and maintenance of unified communications and collaboration systems, including digital IP-based switchboards, communication servers for enterprises, contact/call centers, interfaces for exchanges and smartphones, and business data networks. Further, the company distributes electrical and control equipment and systems. Additionally, it develops and sells cyber solutions; security sensors; refrigeration facilities; Aeonix, a communications system for organizations; systems for parking and other parking systems; Harmony Gate, an entry/exit management solution for vehicles; and electricity switchgear panels. The company serves energy, ports and airports, transportation systems, fuel, gas and water, telecommunications, industry, and defense sectors; and public institutions and organizations, and municipal and government bodies. The company was formerly known as Afcon Industries Group. The company was founded in 1945 and is based in Petah Tikva, Israel. Afcon Holdings Ltd operates as a subsidiary of Shlomo Group.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4969104",
        "website": "http://www.afcon.co.il",
        "full_time_employees": 1209
    },
    "EK1.F": {
        "short_name": "ELTEK LTD.",
        "long_name": "Eltek Ltd.",
        "summary": "Eltek Ltd., together with its subsidiaries, manufactures, markets, and sells printed circuit boards (PCBs) in Israel, Europe, North America, India, the Netherlands, and internationally. The company offers a range of custom designed PCBs, including rigid, double-sided, and multi-layer PCBs; and flexible circuitry, such as flex and flex-rigid boards. It primarily serves manufacturers of defense and aerospace, medical, industrial, telecom, and networking equipment, as well as contract electronic manufacturers and others. The company markets and sells its products primarily through direct sales personnel, sales representatives, and PCB trading and manufacturing companies. Eltek Ltd. was incorporated in 1970 and is headquartered in Petach Tikva, Israel. Eltek Ltd. is a subsidiary of Nistec Golan Ltd.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4927920",
        "website": "http://www.nisteceltek.com",
        "full_time_employees": 288
    },
    "ELTK": {
        "short_name": "Eltek Ltd.",
        "long_name": "Eltek Ltd.",
        "summary": "Eltek Ltd., together with its subsidiaries, manufactures, markets, and sells printed circuit boards (PCBs) in Israel, Europe, North America, India, the Netherlands, and internationally. The company offers a range of custom designed PCBs, including rigid, double-sided, and multi-layer PCBs; and flexible circuitry, such as flex and flex-rigid boards. It primarily serves manufacturers of defense and aerospace, medical, industrial, telecom, and networking equipment, as well as contract electronic manufacturers and others. The company markets and sells its products primarily through direct sales personnel, sales representatives, and PCB trading and manufacturing companies. Eltek Ltd. was incorporated in 1970 and is headquartered in Petach Tikva, Israel. Eltek Ltd. is a subsidiary of Nistec Golan Ltd.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4927920",
        "website": "http://www.nisteceltek.com",
        "full_time_employees": 288
    },
    "ELWS.TA": {
        "short_name": "ELECTREON WIRELESS",
        "long_name": "Electreon Wireless Ltd",
        "summary": "Electreon Wireless Ltd is a venture capital firm and accelerator specializing in start-up and incubation investments. The firm seeks to invest in life science sector including medical equipment, green technology, software, and alternative energy. Electreon Wireless Ltd was founded in 2000 and is based in Beit Yanai, Israel with an additional office in New York, New York.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Beit Yanai",
        "zipcode": null,
        "website": "http://www.electreon.com",
        "full_time_employees": 32
    },
    "ELWSF": {
        "short_name": "ELECTREON WIRELESS LTD",
        "long_name": "Electreon Wireless Ltd",
        "summary": "Electreon Wireless Ltd is a venture capital firm and accelerator specializing in start-up and incubation investments. The firm seeks to invest in life science sector including medical equipment, green technology, software, and alternative energy. Electreon Wireless Ltd was founded in 2000 and is based in Beit Yanai, Israel with an additional office in New York, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Beit Yanai",
        "zipcode": null,
        "website": "http://www.electreon.com",
        "full_time_employees": 32
    },
    "GNCL.TA": {
        "short_name": "GENCELL LTD",
        "long_name": "Gencell Ltd",
        "summary": "GenCell Ltd. develops fuel cell solutions that offer clean power worldwide. The company's products include GenCell A5, an off-grid power solution for telecoms, schools, water purification, and other applications; GenCell G5rx, a utility backup power solution that produces 5kW of auxiliary electricity for substations during outages of any duration; and GenCell G5, a long-duration uninterruptible power supply that provides unlimited source of 5kW backup power for telecom, homeland security, healthcare, and industrial applications. It also provides GenCell IoT Remote Manager, a solution that supports backup power equipment in utilities, telecom, homeland security, healthcare, or industrial applications. The company was founded in 2011 and is headquartered in Petah Tikva, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951025",
        "website": "http://www.gencellenergy.com",
        "full_time_employees": 85
    },
    "GNCLF": {
        "short_name": "GENCELL LTD",
        "long_name": "Gencell Ltd",
        "summary": "GenCell Ltd. develops fuel cell solutions that offer clean power worldwide. The company's products include GenCell A5, an off-grid power solution for telecoms, schools, water purification, and other applications; GenCell G5rx, a utility backup power solution that produces 5kW of auxiliary electricity for substations during outages of any duration; and GenCell G5, a long-duration uninterruptible power supply that provides unlimited source of 5kW backup power for telecom, homeland security, healthcare, and industrial applications. It also provides GenCell IoT Remote Manager, a solution that supports backup power equipment in utilities, telecom, homeland security, healthcare, or industrial applications. The company was founded in 2011 and is headquartered in Petah Tikva, Israel.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "state": null,
        "city": "Petah Tikva",
        "zipcode": "4951025",
        "website": "http://www.gencellenergy.com",
        "full_time_employees": 85
    },
    "ININ.TA": {
        "short_name": "INTER INDUSTRIES",
        "long_name": "Inter Industries Plus Ltd",
        "summary": "Inter Industries Plus Ltd. engages in the energy and infrastructure businesses in Israel. The company offers motherboards, and high and low voltage power boards; and manufactures and installs electrical automation systems, and command and control systems, as well as provides control services for production lines, and air conditioning systems and high voltage systems. It also installs electro-mechanical systems, including electricity, air conditioning, and plumbing systems, as well as integrates multi-technical maintenance; and undertakes maintenance systems. In addition, the company installs power and transformer stations, and electrical systems for industry and the defense establishment; and supplies high voltage and low voltage electricity services, including repairing faults and preventative maintenance works. Further, it offers power stabilizers, filter systems, systems for handling power supply interruptions, and systems for enhancing power supply quality and efficiency. Additionally, the company undertakes construction works of buildings for unmanned aircraft simulator, flight squadron buildings, control towers, aircraft hangars, auditorium and office buildings, and real time command and control centers, as well as medical projects; and provides lighting solutions for urban transportation projects, streets, historical sites, museums, sites for preservation and national parks, sports centers, hospitals, office towers, and shopping centers. It serves local councils, military entities, agricultural organizations, industrial and commercial companies, and large factories. The company was founded in 1973 and is based in Nazareth Illit, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Nazareth Illit",
        "zipcode": "171000",
        "website": "http://www.interelectric.co.il",
        "full_time_employees": 316
    },
    "PAY.BR": {
        "short_name": "PAYTON PLANAR",
        "long_name": "Payton Planar Magnetics Ltd.",
        "summary": "Payton Planar Magnetics Ltd., together with its subsidiaries, develops, manufactures, and markets planar and conventional transformers worldwide. The company offers transformers; inductors comprising common mode chocks; and off the shelf SMT planar transformers. It serves telecom, automotive, and power electronic markets. The company was incorporated in 1992 and is based in Ness-Ziona, Israel. Payton Planar Magnetics Ltd. is a subsidiary of Payton Industries Ltd.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "BRU",
        "market": "be_market",
        "country": "Israel",
        "state": null,
        "city": "Ness Ziona",
        "zipcode": null,
        "website": "http://www.paytongroup.com/Payton_Planar_Magnetics",
        "full_time_employees": 175
    },
    "PCBT.TA": {
        "short_name": "P.C.B TECHNOLOGIES",
        "long_name": "P.C.B. Technologies Ltd",
        "summary": "P.C.B. Technologies Ltd provides contract electronic manufacturing services. The company offers printed circuit boards (PCB) design, fabrication, and assembly services; schematic and layout design, PCB bare board production, PCBA population and test, and full box build/system integration. It also provides board layout and board design; pre-production; and in-house HATS lab for electrical testing. In addition, the company offers assembly services, such as in house testing ICT, FP, CT, X-Ray, etc.; and complete engineering support for FMEA, NPI, DFP, and CIP. It serves defense, aerospace, healthcare, RF/microwave, telecom, and other markets in Israel and internationally. The company was founded in 1981 and is headquartered in Migdal HaEmek, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Migdal Haemek",
        "zipcode": "2310502",
        "website": "http://www.pcb.co.il",
        "full_time_employees": 757
    },
    "PRTC.TA": {
        "short_name": "PRIORTECH",
        "long_name": "Priortech Ltd",
        "summary": "Priortech Ltd, through its subsidiaries, operates as an electronic company in Israel and internationally. The company develops, manufactures, and markets optical systems for testing and automatic measurement, such as automated optical inspection of semiconductor components, semiconductors, semiconductor wafers. It also offers substrates for electronic packaging; glass fiber for electronic components; chipset, an electric circuit that designed for nano-metric components; and silicat to produce chips and semi-mulitic devices. In addition, the company is involved in manufacturing, marketing, sale of printed circuits, electronic cards, and electronic systems, as well as assembly of electronic components on printed circuits. Priortech Ltd was incorporated in 1980 and is based in Migdal HaEmek, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Migdal Haemek",
        "zipcode": "23150",
        "website": "http://www.prior-tech.co.il",
        "full_time_employees": null
    },
    "TEDE.TA": {
        "short_name": "TEDEA TECH DEV & A",
        "long_name": "Tedea Technological Development and Automation Ltd.",
        "summary": "Tedea Technological Development and Automation Ltd., through its subsidiaries, engages in processing chips in Israel. It is also involved in managing and investing activities. The company was founded in 1969 and is based in Herzliya, Israel.",
        "currency": "ILA",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Herzliya",
        "zipcode": "46766",
        "website": "http://www.tedea.com",
        "full_time_employees": 55
    }
}