{
    "BMLK.TA": {
        "short_name": "BIOMILK",
        "long_name": "Fantasy Network Ltd",
        "summary": "Fantasy Network Ltd is involved in the process of liquidation. Previously, it was engaged in gaming and cannabis businesses; and operation of gas stations. The company was formerly known as Bio-Cell Ltd. and changed its name to Fantasy Network Ltd in October 2015. Fantasy Network Ltd was incorporated in 1986 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": null,
        "market_cap": 221062560
    },
    "HMAM.TA": {
        "short_name": "HAMAMA MEIR TRADIN",
        "long_name": "Hamama Meir Trading (1996) Ltd.",
        "summary": "Hamama Meir Trading (1996) Ltd. imports and distributes raw materials for the food industry in Israel. The company offers grains, pulses, nuts, dried fruits, seeds and herbs, coffee, and animal feed. It serves food conglomerates, wholesalers and distributors, small and medium-sized natural food stores, and health food shops. Hamama Meir Trading (1996) Ltd. was founded in 1996 and is headquartered in Bnei Brak, Israel.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Bnei Brak",
        "zipcode": "5120261",
        "website": "http://hamama.biz",
        "market_cap": 55285960
    },
    "SMNIN.TA": {
        "short_name": "SHEMEN INDUSTRIES",
        "long_name": "Shemen Industries Ltd",
        "summary": "Shemen Industries Ltd manufactures, markets, and sells industrial products and raw materials for industry and livestock customers in Israel. The company operates in two segments, Food and Agro Food Sector. It offers edible oils and other food products to the consumer, domestic, and institutional markets; and tuna products under the Olive Tree brand. The company was founded in 1919 and is based in Haifa, Israel. Shemen Industries Ltd operates as a subsidiary of Memorandum Ltd.",
        "currency": "ILA",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Haifa",
        "zipcode": "31000",
        "website": "http://www.shemen.co.il",
        "market_cap": 189707392
    }
}