{
    "1696.HK": {
        "short_name": "SISRAM MED",
        "long_name": "Sisram Medical Ltd",
        "summary": "Sisram Medical Ltd, an investment holding company, designs, develops, manufactures, and sells energy-based aesthetic medical, minimally invasive treatment systems, and non-energy based devices and cosmeceuticals in the Asia Pacific, Europe, North America, Latin America, the Middle East, and Africa. It offers a portfolio of treatment systems for non-invasive medical aesthetic treatments, including hair removal, skin rejuvenation, skin resurfacing, vascular and pigmented lesions treatment, body contouring, skin tightening, tattoo removal, acne treatment, and cellulite reduction; and minimally invasive treatments, such as minimally invasive treatments, such as laser assisted liposuction and fat grafting, and feminine health, as well as treatment of varicose veins and ear, nose, and throat procedures. The company also provides beauty product line treatment systems, such as Rejuve and Spadeep; and manufactures, distributes, and sells medical equipment. It offers its products under the Alma, Soprano, Harmony, ClearLift, Accent, BeautiFill, and FemiLift brands. The company sells its products directly to treatment providers and treatment recipients; and through distributors and direct sales. Sisram Medical Ltd was incorporated in 2013 and is headquartered in Caesarea, Israel.",
        "currency": "HKD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "2QM.SG": {
        "short_name": "Medigus Ltd. Reg.Shares(Spon.AD",
        "long_name": "Medigus Ltd.",
        "summary": "Medigus Ltd., a medical device company, develops, produces, and markets minimally invasive endo-surgical tools and direct visualization technology in the United States, Europe, Asia, and internationally. It offers Medigus Ultrasonic Surgical Endostapler, an endoscopy system, which is used for the treatment of gastroesophageal reflux disease. Medigus Ltd. was founded in 1999 and is headquartered in Omer, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Israel",
        "city": "Omer"
    },
    "2RW.F": {
        "short_name": "REWALK ROBOTICS  IS -,01",
        "long_name": "ReWalk Robotics Ltd.",
        "summary": "ReWalk Robotics Ltd., a medical device company, designs, develops, and commercializes wearable robotic exoskeletons for individuals with mobility impairments or other medical conditions in Israel, the United States, Europe, the Asia-Pacific, Latin America, and Africa. It offers ReWalk Personal and ReWalk Rehabilitation for spinal cord injuries and everyday use by paraplegic individuals at home and in communities; ReStore, a soft exo-suit intended for used in the rehabilitation of individuals with lower limb disability due to stroke; and MyoCycle and MediTouch tutor movement biofeedback devices for use at home or in clinic. It markets and sells its products directly to third party payers, institutions, and individuals, as well as through distributors. The company was formerly known as Argo Medical Technologies Ltd. and changed its name to ReWalk Robotics Ltd. ReWalk Robotics Ltd. was founded in 2001 and is headquartered in Yokneam Ilit, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    },
    "ALMD.TA": {
        "short_name": "ALLMED SOLUTIONS",
        "long_name": "Allmed Solutions Ltd",
        "summary": "Allium Medical Solutions Ltd., a medical device company, develops, manufactures, and markets minimally invasive products in Israel and internationally. The company offers covered stents, such as ureteral, round posterior, triangular prostatic, bulbar, and biliary stents. It also provides uro-gynecology products, including EndoFast Reliant Systems for reinforcement; EndoFast Resorb kits for fixation of surgical mesh to tissues for tissue reinforcement; EndoFast Reliant MN, an implantable, sub-urethral support sling for the treatment of male stress urinary incontinence; and EndoFast Reliant SCP for fixation of surgical mesh to tissue for tissue reinforcement during laparotomy or laparoscopic Sacrocolpopexy approach. In addition, the company offers gastro-duodenal sleeves for the treatment of diabetes mellitus and obesity; and WIRION EPD system, an embolic protection system. Allium Medical Solutions Ltd. is headquartered in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "BIOV.TA": {
        "short_name": "BIO VIEW",
        "long_name": "Bio-View Ltd",
        "summary": "Bio-View Ltd develops, manufactures, and markets automated cell imaging and analysis solutions for use in cytology, cytogenetic, and pathology clinical and research laboratories in Israel and internationally. The company's products include Accord, a workbench microscope station for semi-automated fluorescent imaging and analysis; Accord Plus, an automatic fluorescent imaging system that automatically scans, analyses, and sorts a range of FISH samples in real-time; and Allegro Plus, an automatic fluorescent imaging system, which identifies various chromosomal aberrations under fluorescent light, such as amplifications, translocations, inversions, and deletions. It also offers DUET-3, an imaging and analysis platform that include an automated barcode reader, which enables scanning of various test types in a single scan batch; DeNovo, an automated scanning system for detection, analysis, and characterization of circulating tumor cells from peripheral blood; Solo Workstation, an offline workstation that streamlines and enables review and analysis of test results away from the microscope; and SoloWeb, a Web-based solution that provides analysis, reporting, and consulting on BioView-scanned cases. Bio-View Ltd was founded in 2000 and is headquartered in Rehovot, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Rehovot"
    },
    "BIVWF": {
        "short_name": "BIO VIEW",
        "long_name": "Bio-View Ltd",
        "summary": "Bio-View Ltd develops, manufactures, and markets automated cell imaging and analysis solutions for use in cytology, cytogenetic, and pathology clinical and research laboratories in Israel and internationally. The company's products include Accord, a workbench microscope station for semi-automated fluorescent imaging and analysis; Accord Plus, an automatic fluorescent imaging system that automatically scans, analyses, and sorts a range of FISH samples in real-time; and Allegro Plus, an automatic fluorescent imaging system, which identifies various chromosomal aberrations under fluorescent light, such as amplifications, translocations, inversions, and deletions. It also offers DUET-3, an imaging and analysis platform that include an automated barcode reader, which enables scanning of various test types in a single scan batch; DeNovo, an automated scanning system for detection, analysis, and characterization of circulating tumor cells from peripheral blood; Solo Workstation, an offline workstation that streamlines and enables review and analysis of test results away from the microscope; and SoloWeb, a Web-based solution that provides analysis, reporting, and consulting on BioView-scanned cases. Bio-View Ltd was founded in 2000 and is headquartered in Rehovot, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Rehovot"
    },
    "BRSYF": {
        "short_name": "BRAINSWAY LTD",
        "long_name": "BrainsWay Ltd.",
        "summary": "Brainsway Ltd., a commercial stage medical device company, focuses on the development and sale of non-invasive neuromodulation products in Israel and internationally. It offers deep transcranial magnetic stimulation technology for the treatment of major depressive disorders, obsessive-compulsive disorders, bipolar disorders, post traumatic stress disorders, schizophrenia, smoking cessation, Alzheimer's disease, Asperger syndromes, alcohol addictions, attention deficit hyperactivity disorders, Parkinson's disease, and chronic neuropathic pains to transmit electric current flows at varying rates and creating an electromagnetic field that serves to depolarize cortical neurons and activate neural networks in various areas of the brain. The company primarily serves doctors, hospitals, and medical centers in the field of psychiatry. Brainsway Ltd. was founded in 2003 and is headquartered in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "BWAY": {
        "short_name": "Brainsway Ltd.",
        "long_name": "BrainsWay Ltd.",
        "summary": "Brainsway Ltd., a commercial stage medical device company, focuses on the development and sale of non-invasive neuromodulation products in Israel and internationally. It offers deep transcranial magnetic stimulation technology for the treatment of major depressive disorders, obsessive-compulsive disorders, bipolar disorders, post traumatic stress disorders, schizophrenia, smoking cessation, Alzheimer's disease, Asperger syndromes, alcohol addictions, attention deficit hyperactivity disorders, Parkinson's disease, and chronic neuropathic pains to transmit electric current flows at varying rates and creating an electromagnetic field that serves to depolarize cortical neurons and activate neural networks in various areas of the brain. The company primarily serves doctors, hospitals, and medical centers in the field of psychiatry. Brainsway Ltd. was founded in 2003 and is headquartered in Jerusalem, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "BWAY.TA": {
        "short_name": "BRAINSWAY LTD",
        "long_name": "BrainsWay Ltd.",
        "summary": "Brainsway Ltd., a commercial stage medical device company, focuses on the development and sale of non-invasive neuromodulation products in Israel and internationally. It offers deep transcranial magnetic stimulation technology for the treatment of major depressive disorders, obsessive-compulsive disorders, bipolar disorders, post traumatic stress disorders, schizophrenia, smoking cessation, Alzheimer's disease, Asperger syndromes, alcohol addictions, attention deficit hyperactivity disorders, Parkinson's disease, and chronic neuropathic pains to transmit electric current flows at varying rates and creating an electromagnetic field that serves to depolarize cortical neurons and activate neural networks in various areas of the brain. The company primarily serves doctors, hospitals, and medical centers in the field of psychiatry. Brainsway Ltd. was founded in 2003 and is headquartered in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "CKNTF": {
        "short_name": "CELL KINETICS LTD",
        "long_name": "Cell Kinetics Ltd.",
        "summary": "Cell Kinetics Ltd. engages in the refining and commercialization of CellScan and related technology. It focuses on the development and commercialization of a cell carrier technology known as CKChip, a platform static cytometry technology that enables the simultaneous examination of various individual live cells using simple imaging methods, such as fluorescence microscopy. The company was founded in 1992 and is headquartered in Lod, Israel. Cell Kinetics Ltd. is a subsidiary of Medis Technologies Ltd.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Lod"
    },
    "EFNC.TA": {
        "short_name": "ERECH FINANCE",
        "long_name": "Erech Finance Cahalacha Ltd",
        "summary": "Erech Finance Cahalacha Ltd operates as a medical equipment company. It provides therapeutic medical devices for diabetes. The company is based in Jerusalem, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Jerusalem"
    },
    "EMITF": {
        "short_name": "ELBIT IMAGING LTD",
        "long_name": "Elbit Imaging Ltd.",
        "summary": "Elbit Imaging Ltd., together with its subsidiaries, engages in research and development, production, and marketing of treatment-oriented medical systems; and products to treat cancer diseases. Its treatment-oriented medical systems include magnetic resonance imaging for the purpose of performing noninvasive treatments in human beings. The company is also involved in the sale of plots in India. It has operations in the United States, Europe, and internationally. The company was founded in 1996 and is headquartered in Petach Tikva, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Petach Tikva"
    },
    "EMITF.TA": {
        "short_name": "ELBIT IMAGING LTD",
        "long_name": "Elbit Imaging Ltd.",
        "summary": "Elbit Imaging Ltd., together with its subsidiaries, engages in research and development, production, and marketing of treatment-oriented medical systems; and products to treat cancer diseases. Its treatment-oriented medical systems include magnetic resonance imaging for the purpose of performing noninvasive treatments in human beings. The company is also involved in the sale of plots in India. It has operations in the United States, Europe, and internationally. The company was founded in 1996 and is headquartered in Petach Tikva, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petach Tikva"
    },
    "EMTC.TA": {
        "short_name": "ELBIT MEDICAL TECH",
        "long_name": "Elbit Medical Technologies Ltd",
        "summary": "Elbit Medical Technologies Ltd, an investment holding company, engages in the research, development, production, and marketing of magnetic and focused imaging equipment in the United States, Europe, and internationally. The company is developing a magnetic resonance imaging guided focused ultrasound treatment equipment to address various oncology and gynecology indications, as well as neurological disorders and tumors. It is also involved in the study and development of medical products based on stem cells originating primarily from the umbilical cord blood that are used for bone marrow transplants in the patients of leukemia or cancer of lymph nodes, non-malignant blood diseases, and metabolic genetic disorders. The company is based in Petah Tikva, Israel. Elbit Medical Technologies Ltd is a subsidiary of Elbit Imaging Ltd.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Petah Tikva"
    },
    "HUMX.TA": {
        "short_name": "HUMAN XTENSIONS LT",
        "long_name": "Human Xtensions Ltd.",
        "summary": "Human Xtensions Ltd. develops unmediated surgical systems. It offers HandX, a handheld medical device for use in laparoscopic procedures. The company was founded in 2012 and is based in Netanya, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Netanya"
    },
    "II2.F": {
        "short_name": "INSPIREMD 1/18 DL-,0001",
        "long_name": "InspireMD, Inc.",
        "summary": "InspireMD, Inc., a medical device company, focuses on the development and commercialization of proprietary MicroNet stent platform technology for the treatment of vascular and coronary diseases in Europe, Latin America, the Middle East, and Asia. The company offers CGuard carotid embolic prevention system for use in carotid artery applications; and MGuard Prime embolic protection systems for use in patients with acute coronary syndromes, notably acute myocardial infarction, and saphenous vein graft coronary interventions. It is also developing NGuard, a neurovascular flow diverter that diverts blood flow away from cerebral aneurysms and seals the aneurysms. The company sells its products through local distributors. InspireMD, Inc. was founded in 2005 and is headquartered in Tel Aviv, Israel.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "INMD": {
        "short_name": "InMode Ltd.",
        "long_name": "InMode Ltd.",
        "summary": "InMode Ltd. designs, develops, manufactures, and markets minimally-invasive aesthetic medical products based on its proprietary radiofrequency assisted lipolysis and deep subdermal fractional radiofrequency technologies. The company offers minimally-invasive aesthetic medical products for various procedures, such as liposuction with simultaneous skin tightening, body and face contouring, and ablative skin rejuvenation treatments. It also designs, develops, manufactures, and markets non-invasive medical aesthetic products that target an array of procedures, including permanent hair reduction, facial skin rejuvenation, wrinkle reduction, cellulite treatment, skin appearance and texture, and superficial benign vascular and pigmented lesions, as well as hands-free medical aesthetic products that target a range of procedures, such as skin tightening, fat reduction, and muscle stimulation. InMode Ltd. offers its products directly in United States, Canada, United Kingdom, Spain, India, Australia, and France, as well as through distributors in 47 countries. The company was formerly known as Invasix Ltd. and changed its name to InMode Ltd. in November 2017. InMode Ltd. was founded in 2008 and is headquartered in Yokneam, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Yokne'am"
    },
    "IRME": {
        "short_name": "IR-MED INC",
        "long_name": "IR-Med Inc.",
        "summary": "IR-Med Inc., a medical device company, focuses on the development of infra-red light spectroscopy (IR) and artificial intelligence (AI) combined technology solutions to address the diagnosis of medical ailments. It develops PressureSafe, a non-invasive and real-time optical monitoring device for the preemptive detection of pressure injury; and Nobiotics, an advanced otoscope that works on IR-spectrographic analysis technology providing doctors an immediate indication of the infection being viral or bacterial. The company also engages in developing a real-time noninvasive optical monitor to determine Propofol blood concentration. Its products are used for applications in pressure injury, ear inflammation, and other pharmaceutical areas. IR-Med Inc. is headquartered in Rosh Pina, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Rosh Pina"
    },
    "ITMMF": {
        "short_name": "ITAMAR MEDICAL LTD",
        "long_name": "Itamar Medical Ltd.",
        "summary": "Itamar Medical Ltd., a medical technology company, develops and commercializes non-invasive medical devices and solutions for the treatment of respiratory sleep disorders. The company offers medical devices based on Peripheral Arterial Tone (PAT) signal, which measures changes in the patient's peripheral arterial pulse volumes and various parameters of arterial activities. It provides WatchPAT device, which enable to conduct home sleep apnea tests for the treatment of sleep apnea, such as obstructive sleep apnea; EndoPAT device that diagnoses endothelial dysfunction; and Loop device, a wrist device for measuring and recording physiological parameters, such as SpO2, respiration rate, and heart rate. The company operates in the United States, Canada, Europe, Israel, Japan, rest of the Asia Pacific, and internationally. The company was formerly known as Itamar Medical (CM) 1997 Ltd. and changed its name to Itamar Medical Ltd. in July 2000. Itamar Medical Ltd. was incorporated in 1997 and is headquartered in Caesarea, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "ITMR": {
        "short_name": "Itamar Medical Ltd. - American ",
        "long_name": "Itamar Medical Ltd.",
        "summary": "Itamar Medical Ltd., a medical technology company, develops and commercializes non-invasive medical devices and solutions for the treatment of respiratory sleep disorders. The company offers medical devices based on Peripheral Arterial Tone (PAT) signal, which measures changes in the patient's peripheral arterial pulse volumes and various parameters of arterial activities. It provides WatchPAT device, which enable to conduct home sleep apnea tests for the treatment of sleep apnea, such as obstructive sleep apnea; EndoPAT device that diagnoses endothelial dysfunction; and Loop device, a wrist device for measuring and recording physiological parameters, such as SpO2, respiration rate, and heart rate. The company operates in the United States, Canada, Europe, Israel, Japan, rest of the Asia Pacific, and internationally. The company was formerly known as Itamar Medical (CM) 1997 Ltd. and changed its name to Itamar Medical Ltd. in July 2000. Itamar Medical Ltd. was incorporated in 1997 and is headquartered in Caesarea, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "ITMR.TA": {
        "short_name": "ITAMAR MEDICAL LTD",
        "long_name": "Itamar Medical Ltd.",
        "summary": "Itamar Medical Ltd., a medical technology company, develops and commercializes non-invasive medical devices and solutions for the treatment of respiratory sleep disorders. The company offers medical devices based on Peripheral Arterial Tone (PAT) signal, which measures changes in the patient's peripheral arterial pulse volumes and various parameters of arterial activities. It provides WatchPAT device, which enable to conduct home sleep apnea tests for the treatment of sleep apnea, such as obstructive sleep apnea; EndoPAT device that diagnoses endothelial dysfunction; and Loop device, a wrist device for measuring and recording physiological parameters, such as SpO2, respiration rate, and heart rate. The company operates in the United States, Canada, Europe, Israel, Japan, rest of the Asia Pacific, and internationally. The company was formerly known as Itamar Medical (CM) 1997 Ltd. and changed its name to Itamar Medical Ltd. in July 2000. Itamar Medical Ltd. was incorporated in 1997 and is headquartered in Caesarea, Israel.",
        "currency": "ILA",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Caesarea"
    },
    "MDGS": {
        "short_name": "Medigus Ltd.",
        "long_name": "Medigus Ltd.",
        "summary": "Medigus Ltd., a medical device company, develops, produces, and markets minimally invasive endo-surgical tools and direct visualization technology in the United States, Europe, Asia, and internationally. It offers Medigus Ultrasonic Surgical Endostapler, an endoscopy system, which is used for the treatment of gastroesophageal reflux disease. Medigus Ltd. was founded in 1999 and is headquartered in Omer, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Israel",
        "city": "Omer"
    },
    "NNOX": {
        "short_name": "NANO-X IMAGING LTD",
        "long_name": "Nano-X Imaging Ltd.",
        "summary": "Nano-X Imaging Ltd., a development-stage company, develops, produces, and commercializes digital X-ray source technology for the medical imaging industry worldwide. Its X-ray source is based on a novel digital MEMs semiconductor cathode. The company also develops a prototype of the Nanox.ARC, a medical imaging system incorporating its novel digital X-ray source; and Nanox.CLOUD, a companion cloud-based software that will allow for the delivery of medical screening as a service. Nano-X Imaging Ltd. was founded in 2011 and is headquartered in Neve Ilan, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Israel",
        "city": "Neve Ilan"
    },
    "NSPR": {
        "short_name": "InspireMD Inc.",
        "long_name": "InspireMD, Inc.",
        "summary": "InspireMD, Inc., a medical device company, focuses on the development and commercialization of proprietary MicroNet stent platform technology for the treatment of vascular and coronary diseases in Europe, Latin America, the Middle East, and Asia. The company offers CGuard carotid embolic prevention system for use in carotid artery applications; and MGuard Prime embolic protection systems for use in patients with acute coronary syndromes, notably acute myocardial infarction, and saphenous vein graft coronary interventions. It is also developing NGuard, a neurovascular flow diverter that diverts blood flow away from cerebral aneurysms and seals the aneurysms. The company sells its products through local distributors. InspireMD, Inc. was founded in 2005 and is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASE",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "RWLK": {
        "short_name": "ReWalk Robotics Ltd.",
        "long_name": "ReWalk Robotics Ltd.",
        "summary": "ReWalk Robotics Ltd., a medical device company, designs, develops, and commercializes wearable robotic exoskeletons for individuals with mobility impairments or other medical conditions in Israel, the United States, Europe, the Asia-Pacific, Latin America, and Africa. It offers ReWalk Personal and ReWalk Rehabilitation for spinal cord injuries and everyday use by paraplegic individuals at home and in communities; ReStore, a soft exo-suit intended for used in the rehabilitation of individuals with lower limb disability due to stroke; and MyoCycle and MediTouch tutor movement biofeedback devices for use at home or in clinic. It markets and sells its products directly to third party payers, institutions, and individuals, as well as through distributors. The company was formerly known as Argo Medical Technologies Ltd. and changed its name to ReWalk Robotics Ltd. ReWalk Robotics Ltd. was founded in 2001 and is headquartered in Yokneam Ilit, Israel.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Yokneam Illit"
    }
}