{
    "DRAL.TA": {
        "short_name": "DOR ALON ENERGY IN",
        "long_name": "Dor Alon Energy In Israel (1988) Ltd",
        "summary": "Dor Alon Energy In Israel (1988) Ltd develops, constructs, and operates gas stations and commercial centers in Israel. The company also develops, constructs, and operates convenience stores in kibbutzim and moshavim; and markets fuel and other consumer products through gas stations and convenience stores, as well as markets distillates and natural gas to private customers, institutional investors, and airlines. It operates a chain of approximately 210 public gas stations under the Dor Alon brand, including convenience stores under the Alonit brand. In addition, the company operates approximately 70 independent convenience stores in the Gush Dan area, and kibbutzim and moshavim under the AM: PM, Alonit in the Moshav, Alonit in the kibbutz, and Super Alonit brands, as well as leases commercial centers adjacent to its refueling and commercial complexes. Further, it markets fuels and oils under the ARAL and Texaco brands directly to institutional customers. Additionally, it markets LPG cooking gas under the Lclmalh brand to approximately 110 thousand households; and LPG and natural gas to institutional customers. The company also markets jet fuel to foreign and domestic airlines. In addition, it is involved in the provision of Speedomet, a computerized refueling system that enables to refuel at various Dor Alon stations through a device or card. The company was founded in 1988 and is based in Yakum, Israel.",
        "currency": "ILA",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yakum"
    },
    "OILRF": {
        "short_name": "OIL REFINERIES LTD",
        "long_name": "Oil Refineries Ltd.",
        "summary": "Oil Refineries Ltd., together with its subsidiaries, produces and sells crude oil products in Israel and internationally. The company operates through Fuels, Polymers-Carmel Olefins, PolymersÂ\u0096Ducor, and Aromatics segments. It offers gasoline, naphtha, diesel fuel, kerosene, fuel oil, liquefied petroleum gas, and bitumen. The company also offers polymers comprising polypropylene and polyethylene, which are used as raw materials in the plastics industry; and aromatic materials, such as benzene, paraxylene, orthoxylene, and toluene that are used as raw materials in the chemical and petrochemical industries. In addition, it provides water treatment and steam to industries in Haifa refinery; and infrastructure services, including the storage, pumping, and distribution of fuel products. Further, the company is involved in trading and shipping. The company was formerly known as Haifa Refineries Ltd. and changed its name to Oil Refineries Ltd. in June 1972. Oil Refineries Ltd. was incorporated in 1959 and is based in Haifa, Israel.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Haifa"
    },
    "PZOL.TA": {
        "short_name": "PAZ OIL CO LTD",
        "long_name": "Paz Oil Company Ltd.",
        "summary": "Paz Oil Company Ltd., together with its subsidiaries, refines, produces, stores, imports, sells, and markets fuel products in Israel and internationally. The company markets oil and fuel products at its 268 fueling stations, and food and convenience products at the 241 Yellow market stores; leases its filling station spaces to various lessees, including businesses, restaurants, coffee shops, stores, etc.; and provides engineering, maintenance, and logistic services for the retail infrastructure customers. It is also involved in the direct marketing of fuels and oil products to industries, companies, enterprises, and aviation companies, as well as to car fleets and the Palestinian Authority. In addition, it is involved in the marketing, distribution, and sale of LPG for cooking, heating, and fueling LPG-operated cars to institutional, business, and private customers; marketing, distribution, and sale of devices that consume LPG; production, recycling, import, marketing, and export of lubricants, chemicals, and solvents; production, marketing, and export of sealing and insulation solutions, bitumen, coatings, and adhesives for the transportation, infrastructure, and construction industry; and marketing, supply, and storage of jet fuel and aviation gasoline, as well as provides refueling services to aviation companies. Further, Paz Oil Company Ltd. manufactures petroleum products and electricity. The company was formerly known as The Shell Company of Palestine and changed its name to Paz Oil Company Ltd. in 1960. Paz Oil Company Ltd. was founded in 1922 and is based in Yakum, Israel.",
        "currency": "ILA",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Yakum"
    }
}