{
  "0YL.F": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Else Nutrition Holdings Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "ELSE NUTRITION HLDG",
    "state": null,
    "summary": "Else Nutrition Holdings Inc. focuses on the research, development, manufacturing, marketing, and sale of plant-based food and nutrition products to infant, toddler, children, and adult markets. The company offers baby snacks products; baby feeding accessories, such as feeding bottles and disposable sterile nipples (teats); baby formulas; and toddlers/kids nutritional drinks. The company offers its products under the HEART brand. Else Nutrition Holdings Inc. is headquartered in Tel Aviv-Yafo, Israel.",
    "website": "http://www.elsenutrition.com",
    "zipcode": "6971904"
  },
  "BABY.V": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "CAD",
    "exchange": "VAN",
    "industry": "Packaged Foods",
    "long_name": "Else Nutrition Holdings Inc.",
    "market": "ca_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "ELSE NUTRITION HOLDINGS INC",
    "state": null,
    "summary": "Else Nutrition Holdings Inc. focuses on the research, development, manufacturing, marketing, and sale of plant-based food and nutrition products to infant, toddler, children, and adult markets. The company offers baby snacks products; baby feeding accessories, such as feeding bottles and disposable sterile nipples (teats); baby formulas; and toddlers/kids nutritional drinks. The company offers its products under the HEART brand. Else Nutrition Holdings Inc. is headquartered in Tel Aviv-Yafo, Israel.",
    "website": "http://www.elsenutrition.com",
    "zipcode": "6971904"
  },
  "BABYF": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Else Nutrition Holdings Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "ELSE NUTRITION HOLDINGS INC",
    "state": null,
    "summary": "Else Nutrition Holdings Inc. focuses on the research, development, manufacturing, marketing, and sale of plant-based food and nutrition products to infant, toddler, children, and adult markets. The company offers baby snacks products; baby feeding accessories, such as feeding bottles and disposable sterile nipples (teats); baby formulas; and toddlers/kids nutritional drinks. The company offers its products under the HEART brand. Else Nutrition Holdings Inc. is headquartered in Tel Aviv-Yafo, Israel.",
    "website": "http://www.elsenutrition.com",
    "zipcode": "6971904"
  },
  "CHAM.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Cham Foods (Israel) Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "CHAM FOODS ISRAEL",
    "state": null,
    "summary": "Cham Foods (Israel) Ltd produces and sells food ingredients in Israel and internationally. The company offers a range of processed agricultural ingredients, such as fruits, vegetables, pre-cooked legumes and grains, and nutritional supplements. It provides aseptic foods that include organic and tomato paste, roasted and peeled bell peppers, roasted eggplant puree, chickpea puree, pizza and pasta base sauce, diced tomatoes, and mediternian sauce. The company also offers freeze-dried fruits, such as sweet potato, prickly pear fruit; avocado powder; black bean; red, black, and white quinoa; lemon whole and juice powder; lime whole powder; lentils speckled; golden chickpeas; red and black lentils; orange whole powder; quinoa tricolor; kidney beans; pinto beans; black eyed beans; black wild rice; soybeans; whole bulgur; basmati white rice; red rice; white beans; tricolor rice; whole pearl barley; jasmine whole and white rice; mung beans; whole buckwheat; lentils green; and tricolor rice. In addition, it manufactures and markets spray-dried tomato powders used as raw materials in ready-to-consume meals comprising soups and sauces, natural food coloring and seasoning, pasta, seasonings, sauces, and dressings; and other powders, such a lemon powders and non-dairy thickeners/whiteners. It serves multinational food companies. The company was founded in 1970 and is based in Tel Aviv, Israel. Cham Foods (Israel) Ltd operates as a subsidiary of M. Shvi Family's Asset Ltd.",
    "website": "http://www.cham.co.il",
    "zipcode": "69710"
  },
  "KRUR.TA": {
    "city": "Or Yehuda",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Kerur Holdings Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "KERUR HOLDINGS LTD",
    "state": null,
    "summary": "Kerur Holdings Ltd., through its subsidiaries, operates in the food sector in Israel. It produces and markets soft drinks and mineral water; and frozen potato and onion fries, as well as plant products. The company was formerly known as The Israeli Company Cooling & Supply Co. Ltd. and changed its name to Kerur Holdings Ltd. in 2006. The company was incorporated in 1929 and is based in Or Yehuda, Israel. Kerur Holdings Ltd. is a subsidiary of Israel Lighterage & Supply Co. Ltd.",
    "website": "http://www.kerur-holdings.co.il",
    "zipcode": "6037607"
  },
  "MIFT.TA": {
    "city": "Jaffa",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Millennium Food Tech Limited Partnership",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "MILLENNIUM FOOD-TE",
    "state": null,
    "summary": "Millennium Food Tech Limited Partnership operates as a food technology company in Israel. It develops food substitutes and foods, as well as information technologies for food industry. The company was founded in 2019 and is based in Jaffa, Israel.",
    "website": null,
    "zipcode": "6578405"
  },
  "MITC": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Packaged Foods",
    "long_name": "Meat-Tech 3D Ltd.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "MeaTech 3D Ltd.",
    "state": null,
    "summary": "Meat-Tech 3D Ltd., a technology company, focuses on the development and out-licensing of proprietary three-dimensional printing technology, biotechnology processes, and customizable manufacturing processes to food processing and food retail companies to manufacture proteins without animal slaughtering. The company is developing three-dimensional bioprinter to deposit layers of differentiated stem cells, scaffolding, and cell nutrients in a three-dimensional form of structured cultured meat. It intends to license its proprietary production technology; provide associated products, such as cell lines, printheads, bioreactors, and incubators; and offer services, such as technology implementation, training, and engineering support directly and through contractors to food processing and food retail companies. The company is based in Ness Ziona, Israel.",
    "website": "http://www.meatech3d.com",
    "zipcode": "7414001"
  },
  "MITC.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "MeaTech 3D Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "MEATECH 3D LTD",
    "state": null,
    "summary": "As of January 26, 2020, Ophectra Real Estate and Investments Ltd was acquired by MeaTech Ltd. in a reverse merger transaction. Meat-Tech 3D Ltd develops a 3D printing technology for edible meat tissue using cellular agriculture. It develops technologies, processes, and machines for cultivating, producing, and printing cultured meat. The company was formerly known as Ophectra Real Estate & Investments Ltd and changed its name to Meat-Tech 3D Ltd in October 2019. The company is based in Ness Ziona, Israel.",
    "website": "http://www.meatech3d.com",
    "zipcode": null
  },
  "MTTCF": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Ophectra Real Estate and Investments Ltd",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "MEATECH 3D LTD",
    "state": null,
    "summary": "As of January 26, 2020, Ophectra Real Estate and Investments Ltd was acquired by MeaTech Ltd. in a reverse merger transaction. Meat-Tech 3D Ltd develops a 3D printing technology for edible meat tissue using cellular agriculture. It develops technologies, processes, and machines for cultivating, producing, and printing cultured meat. The company was formerly known as Ophectra Real Estate & Investments Ltd and changed its name to Meat-Tech 3D Ltd in October 2019. The company is based in Ness Ziona, Israel.",
    "website": "http://www.meatech3d.com",
    "zipcode": null
  },
  "NGS.AX": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Packaged Foods",
    "long_name": "Nutritional Growth Solutions Ltd.",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "NGSLTD FPO",
    "state": null,
    "summary": "Nutritional Growth Solutions Ltd. develops, produces, and sells pediatric protein supplements products in the United States, Asia, and the Middle East. It offers its products under the Healthy Height, Horlicks Growth Plus, and Pro Up brand names. The company was formerly known as N. G. Solutions Ltd. and changed its name to Nutritional Growth Solutions Ltd. in June 2020. The company was founded in 2013 and is headquartered in Tel Aviv, Israel.",
    "website": "http://ngsolutions.co",
    "zipcode": "6423806"
  },
  "NTML.TA": {
    "city": "Kiryat Malakhi",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Neto Malinda Trading Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "NETO MALINDA",
    "state": null,
    "summary": "Neto Malinda Trading Ltd. manufactures, imports, markets, and distributes kosher and edible products. It offers grilled meat products, such as hamburgers, kebabs, steaks, sausages, skewers, and others; ground meat products, including beef, lamb, veal, turkey, and chicken; meat products for cooking include calf goulash, roasted veal, faux-filet, kishke, roast beef, and other products; and instant meals, such as shawarma, readymade schnitzel, chicken rings, and others under the Tibon Veal brand. The company also provides whole fish, fish fillet, and various fish steak, including coated and readymade fish products; seafood products and fish cutlets; and fish salads, such as herring and ikra under the Delidag brand. In addition, it offers frozen bourekas, ethnic meat, pastries, and pizzas under the Three Bakers brand; and operates chain of restaurant, as well as provides catering services under the El Gaucho brand. Further, the company produces, packages, and sells canned tuna and frozen smoked salmon; imports and sells finished grocery products, such as canned mushrooms, fruits, sauces, and vegetables; and imports various pasta, rice, and granola products under the Williger brand. Additionally, it provides cooking and baking products, which include cooking and cream bases, whipped cream bases, coffee rich creamer, and others under the Rich's brand; and ready-to-eat noodle meals under the Magic brand. The company was formerly known as Food Hamashbir Ltd. and changed its name to Neto Malinda Trading Ltd. in September 2003. Neto Malinda Trading Ltd. was founded in 1992 and is based in Kiryat Malachi, Israel.",
    "website": "http://www.neto.org.il",
    "zipcode": "75864"
  },
  "NXFR.TA": {
    "city": "Yokneam Illit",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "NextFerm Technologies Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "NEXTFERM TECHNOLOG",
    "state": null,
    "summary": "NextFerm Technologies Ltd, a food-tech company, develops and produces active ingredients based on in-house yeast development and fermentation, and for human nutrition. It offers Astaferm, a fermented-astaxanthin; and ProteVin, a vegan protein. The company was founded in 2013 and is based in Yokneam Illit, Israel.",
    "website": "http://www.nextferm.com",
    "zipcode": "20692"
  },
  "STRS.TA": {
    "city": "Petah Tikva",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Strauss Group Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "STRAUSS GROUP LTD",
    "state": null,
    "summary": "Strauss Group Ltd., together with its subsidiaries, develops, manufactures, markets, and sells various food and beverage products in Israel, North America, Brazil, Europe, and internationally. The company operates through six segments: Health & Wellness; Fun & Indulgence; Israel Coffee; International Coffee; International Dips & Spreads; and Strauss Water. The Health & Wellness segment provides yogurts, dairy desserts, dairy-free tahini desserts, soft cheeses, flavored milk beverages, chilled salads, cut vegetables, fresh pasta products, cereal and granola bars, honey products, olive oils, fruit preserves, cooking sauces, lemon juices, and natural maple syrups. This segment also sells and distributes natural juices, butter spreads, sheep yogurt, and plant-based probiotic desserts. The Fun & Indulgence segment offers sweet snack bars, chocolate tablets, sweet spreads, candies, chewing gums, cakes and cookies, biscuits, wafers, and salty snacks. The Israel Coffee segment develops, manufactures, sells, markets, and distributes a range of coffee products, chocolate powders, and other drink powders; sells coffee beans; and retails coffee products. The International Coffee segment develops and manufactures various coffee products and powder drinks; markets and distributes coffee machines; and purchases and processes green coffee, corn products, and juice powders. The International Dips & Spreads segment manufactures, markets, and sells chilled dips and spreads under the Sabra, Obela, and Florentin brands. The Strauss Water segment also develops, manufactures, distributes, and sells filtration, purification, and carbonation systems for drinking water. The company was formerly known as Strauss-Elite Ltd. and changed its name to Strauss Group Ltd. in February 2007. Strauss Group Ltd. was founded in 1933 and is headquartered in Petach Tikva, Israel. Strauss Group Ltd. is a subsidiary of Strauss Holdings Ltd.",
    "website": "http://www.strauss-group.com",
    "zipcode": "4959504"
  },
  "SVRT.TA": {
    "city": "Ness Ziona",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "SavorEat Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "SAVOREAT LTD",
    "state": null,
    "summary": "SavorEat Ltd. develops plant-based meat alternative products using 3D printing technology for fast-moving kitchens. Its product is a combination of 3D printing technology, an automatic cooking machine, and plant-based ingredients that allow the creation of various textures and designs that characterize meat. The company was founded in 2018 and is based in Ness Ziona, Israel.",
    "website": "http://www.savor-eat.com",
    "zipcode": null
  },
  "WLFD.TA": {
    "city": "Yavne",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Willy-Food Investments Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "WILLY FOOD INVSTM.",
    "state": null,
    "summary": "Willy-Food Investments Ltd imports, exports, markets, and sells food products in Israel. It offers canned fruits, vegetables, and fish; coconut milk, rice vermicelli, mushrooms, roasted/in brine vegetables, vinegar, prepared meal, and milk alternative drink products; oil, sauces, rice, pasta, noodles, juices, cereals, and snacks products; tortillas, toasts, crackers, and corn flour; and dry, chilled, and frozen food products. The company also provides butter, margarine, whipped cream, cheese, and dairy products; and cookies and sweets, and tea and others. It offers its products under Willi-Food, Del Monte, DAAWAT, Completa, Sera, Zanetti, NOBLEZA GAUCHA, and El Pastor brands. The company was formerly known as T.K.D Investment Ltd. and changed its name to Willi-Food Investments Ltd in January 1995. Willy-Food Investments Ltd was founded in 1992 and is based in Yavne, Israel.",
    "website": "http://www.willi-food.co.il",
    "zipcode": "81106022"
  },
  "ZNKL.TA": {
    "city": "Afula",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Packaged Foods",
    "long_name": "Zanlakol Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "ZANLAKOL",
    "state": null,
    "summary": "Zanlakol Ltd produces and sells food products in Israel. The company offers hummus and dips, cooking sauces, tomato products, canned vegetables, and fruits and syrups, as well as customized products. It also exports its products worldwide. The company was founded in 1940 and is based in Afula, Israel.",
    "website": "http://www.sanlakol.com",
    "zipcode": "1812302"
  }
}
