{
    "HAIPF": {
        "short_name": "HADERA PAPER LTD",
        "long_name": "Hadera Paper Ltd.",
        "summary": "Hadera Paper Ltd., through its subsidiaries, manufactures and sells writing and printing paper, packaging paper, cardboard and corrugated boards, and recycled paper products in Israel and internationally. It provides collection and recycling services for wastepaper, cardboard and plastic waste, electronic waste, and other recyclable materials; and offers cardboard packaging solutions for the food, cosmetics, pharmaceutics, textile, high-tech, games, plastic, and metal products. The company also offers office supplies, paper and paper products, technology and peripherals, hobbies and crafts, furniture, food, and cleaning products. The company was formerly known as American Israeli Paper Mills Ltd. and changed its name to Hadera Paper Ltd. in July 2008. Hadera Paper Ltd. was incorporated in 1951 and is based in Hadera, Israel.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Hadera"
    },
    "HAP.TA": {
        "short_name": "HADERA PAPER LTD",
        "long_name": "Hadera Paper Ltd.",
        "summary": "Hadera Paper Ltd., through its subsidiaries, manufactures and sells writing and printing paper, packaging paper, cardboard and corrugated boards, and recycled paper products in Israel and internationally. It provides collection and recycling services for wastepaper, cardboard and plastic waste, electronic waste, and other recyclable materials; and offers cardboard packaging solutions for the food, cosmetics, pharmaceutics, textile, high-tech, games, plastic, and metal products. The company also offers office supplies, paper and paper products, technology and peripherals, hobbies and crafts, furniture, food, and cleaning products. The company was formerly known as American Israeli Paper Mills Ltd. and changed its name to Hadera Paper Ltd. in July 2008. Hadera Paper Ltd. was founded in 1951 and is based in Hadera, Israel.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Hadera"
    },
    "SHAN.TA": {
        "short_name": "SHANIV PAPER IND",
        "long_name": "Shaniv Paper Industry Ltd",
        "summary": "Shaniv Paper Industry Ltd develops, manufactures, and markets paper products in Israel and internationally. It offers toilet paper, paper towels, tissue paper, and paper napkins, as well as a line of products for rolling for the institutional market. household, automotive, personal care, institutional, and industrial. The company also provides detergents; bleach products; products for cleaning and handling various surfaces; pesticide products for household use; laundry and perfume products; complementary products for cleaning and maintenance of the house, such as cloths, scrubbing pillows, nylon bags, kitchen auxiliary products, and disposable products; and soaps and toiletries, hair and skin care products, sun blocking products, deodorants, and shaving gels under the Touch and Lovely brand names. In addition, it offers automotive and industry maintenance and servicing products, including urea additives; oils and greases; cooling system liquids; maintenance sprays; vehicle care products; grease removers; professional washing preparations; and hand cleaning and hygiene products under the MAXOL-MAX name. The company's products are used in various sectors, such as household, automotive, personal care, institutional, and industrial sectors. The company was founded in 1988 and is based in Ofakim, Israel.",
        "currency": "ILA",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Ofakim"
    }
}