{
    "MNRT.TA": {
        "short_name": "MENIVIM REIT",
        "long_name": "Menivim - The New Reit Ltd",
        "summary": "Menivim - The New Reit Ltd is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Caesarea",
        "zipcode": null,
        "website": "http://www.menivim-reit.co.il",
        "market_cap": null
    },
    "RIT1.TA": {
        "short_name": "REIT 1 LTD",
        "long_name": "Reit 1 Ltd",
        "summary": "Reit 1, Ltd. engages in the acquisition, management, and lease of real estate property. The company holds real estate for commercial and industrial use primarily in the central region of Israel. As of September 30, 2008, its holdings included 9 office properties, 2 industrial properties, and a commercial property, as well as a commercial parking lot with 376 parking spaces. The company, formerly known as Reit 1 Israel (2006) Ltd., was founded in 2006 and is headquartered in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://reit1.co.il",
        "market_cap": null
    },
    "SLARL.TA": {
        "short_name": "SELLA CAPITAL REAL",
        "long_name": "Sella Capital Real Estate Ltd.",
        "summary": "Sella Capital Real Estate Ltd., a real estate investment trust, is engaged in the acquisition, management, holding, and rental of yielding real estate properties in Israel. The company operates office buildings, shopping centers, industrial buildings, and residential apartments for professionals, commercial companies, high- tech companies, and government institutions. As of December 31, 2013, it had a total rentable area of 116,880 square meters and 70,000 square meters of parking areas. The company was incorporated in 2007 and is headquartered in Ramat Gan, Israel.",
        "currency": "ILA",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Ramat Gan",
        "zipcode": "52520",
        "website": "http://www.sellacapital.com",
        "market_cap": null
    }
}