{
    "ALD.TA": {
        "short_name": "A.L.D. ADVANCED",
        "long_name": "A.L.D. Advanced Logistics Developments Ltd.",
        "summary": "A.L.D. Advanced Logistics Developments Ltd. provides professional consulting, software development, and training services in Israel and internationally. It offers RAM Commander, a modular software that covers various engineering tasks related to reliability of electronic, electro-mechanical, and mechanical systems; and Failure Reporting, Analysis and Corrective Action System, a Web based and user configurable system, which captures information about equipment or the processes throughout its life cycle ranging from design and production testing to customers support. The company also provides Decision by Life Cycle Cost, a life cycle cost tool for managers, decision-makers, engineers, ILS personnel, and other staff; and Favoscope Quality Management System, a Web-based audit system for quality process management. In addition, it offers Statistical Process Control, a software for real-time monitoring of the manufacturing process and its enhancement with decision-making support, statistical analysis, and reports; and ALD College Course Management Software System for colleges and educational institutions. Further, the company provides consulting services, such as reliability and quality program plan, reliability prediction and analysis, FMEA/FMECA, failure and testability analysis, aviation safety assessment, electrical parts stress analysis, suppliers quality management, maintainability prediction and analysis, reliability demonstration test program, reliability centered maintenance, failure data collection, thermal analysis, logistics support, spares optimization, statistical process control, accelerated life testing, software QA, six sigma process improvement, validation, quality management, and ISO certification services. It serves clients in aerospace, defense, electronic components, railway, and telecommunications sectors. A.L.D. Advanced Logistics Developments Ltd. was founded in 1984 and is headquartered in Or-Yehuda, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Or-Yehuda"
    },
    "CTGL": {
        "short_name": "CITRINE GLOBAL",
        "long_name": "Citrine Global Corp.",
        "summary": "Citrine Global Corp., a technology company, engages in the design, development, and commercialization of a platform utilizing proprietary vaporization technology to enable health, wellness, and beauty treatments in Israel, the United States, Canada, and Europe. Its products include Novokid, a device for the treatment of head lice and eggs; and Shine, a device for the treatment and rejuvenation of the hair and scalp. The company was formerly known as TechCare Corp. and changed its name to Citrine Global Corp. in August 2020. Citrine Global Corp. is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "SHGR.TA": {
        "short_name": "SHAGRIR GROUP VEHI",
        "long_name": "Shagrir Group Vehicle Services Ltd",
        "summary": "Shagrir Group Vehicle Services Ltd provides roadside towing, rescue, and assistance services in Israel. The company offers various services, such as assistance in starting the vehicle, repairing, wheel replacement, fuel supply, and light bulb replacement services, as well as other services that consist of water damage, plumbing, bodywork, and paint services. It provides services to insurance companies, insurance agents, and general public. The company operates eight service centers. Shagrir Group Vehicle Services Ltd was founded in 1984 and is based in Holon, Israel.",
        "currency": "ILA",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "city": "Holon"
    },
    "SRRPF": {
        "short_name": "SHAGRIR GROUP VEHICLE SERVICES ",
        "long_name": "Shagrir Group Vehicle Services Ltd",
        "summary": "Shagrir Group Vehicle Services Ltd provides roadside towing, rescue, and assistance services in Israel. The company offers various services, such as assistance in starting the vehicle, repairing, wheel replacement, fuel supply, and light bulb replacement services, as well as other services that consist of water damage, plumbing, bodywork, and paint services. It provides services to insurance companies, insurance agents, and general public. The company operates eight service centers. Shagrir Group Vehicle Services Ltd was founded in 1984 and is based in Holon, Israel.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Israel",
        "city": "Holon"
    }
}