{
    "CKRT.TA": {
        "short_name": "CHAKRATEC LTD",
        "long_name": "Chakratec Ltd.",
        "summary": "Chakratec Ltd. provides economic and environmental electricity storage solutions in Israel. It offers kinetic power boosters, high power chargers, and managed charging services for electric vehicles. The company was founded in 2013 and is based in Lod, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Lod",
        "zipcode": "7152026",
        "website": "http://www.chakratec.com",
        "market_cap": null
    },
    "GOLF.TA": {
        "short_name": "GOLF & CO",
        "long_name": "Golf & Co Group Ltd",
        "summary": "Golf & Co Group Ltd operates as a retail company in the field of fashion, home styling, and clothing in Israel. The company offers home ware and styling products, such as kitchen-ware, dining-ware, home textile, and spa products; home textile products, including bed linens, blankets, towels, and other products; fashion apparel and accessories for men and women; intimate wear, including lingerie, night wear, leisure clothing, and swim and beach wear; and basic and fashionable collections for children and babies. It also operates approximately 330 stores primarily under the GOLF, TSUMI, MAX MORETTI, DANIEL HECHTER, TOPSHOP, KITAN, POLGAT, ROYAL SATEEN, and Adika brand names, as well as online stores, such as golfco.co.il, golfkids.co.il, il.topshop.com, and adikastyle.com. Golf & Co Group Ltd was incorporated in 1961 and is based in Tel Aviv, Israel. Golf & Co Group Ltd is a subsidiary of Clal Industries Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": null,
        "website": "http://www.golfgroup.co.il",
        "market_cap": "Small Cap"
    }
}