{
    "AVGL.TA": {
        "short_name": "AVGOL INDUSTRIES",
        "long_name": "Avgol Industries 1953 Ltd",
        "summary": "Avgol Industries 1953 Ltd manufactures and supplies nonwoven fabrics primarily for manufacturers of baby diapers, adult incontinence, and feminine hygiene products worldwide. It offers front and back ears, side panels, top sheets, leg cuffs/ leak guards, and back sheet solutions. The company offers its products primarily under the Avsoft, Avsilk, Avspun, Avgol, Avcore, and Avcuff brands. Its products are also used in medical and industrial applications. Avgol Industries 1953 Ltd was founded in 1953 and is based in Tel Aviv, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tel Aviv",
        "zipcode": "67134",
        "website": "http://www.avgol.com",
        "market_cap": 912665984
    },
    "GNGR.TA": {
        "short_name": "GINEGAR PLASTIC",
        "long_name": "Ginegar Plastic Products Ltd.",
        "summary": "Ginegar Plastic Products Ltd. produces and sells advanced films for various agricultural and non-agricultural applications worldwide. The company offers Sun Selector films for use in greenhouse and tunnel covering applications; and Mulch More films for crops and growing applications. It also provides ozgard, a virtually impermeable film, which enhances the effectiveness of fumigants, including methyl bromide, methane sodium, dicloropropene, iodo methane, and others; Super Seal geomembranes for use in soil engineering applications, such as reservoirs, waste disposal sites, sub-terranean structures, roadworks, and other projects; and table grape cover films. In addition, the company offers polysack nets comprising thermal screens and shade nets; energy saving screens and darkening screens; shading nets; protection nets; anti-insect nets; anti-hail nets; wind breakers; and decorative single and double layer products. Further, it provides shade and mesh nets; barrier films for soil fumigation with noxious chemicals; HDPE films for pond and reservoir liners; and heavy duty bags for chemical fertilizers. Ginegar Plastic Products Ltd. was founded in 1969 and is based in Jezreel Valley, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Jezreel Valley",
        "zipcode": "36580",
        "website": "http://www.ginegar.com",
        "market_cap": 278549344
    },
    "SALG.TA": {
        "short_name": "SHALAG INDUSTRIES",
        "long_name": "Shalag Industries Ltd.",
        "summary": "Shalag Industries Ltd. develops and produces nonwoven products in Israel and internationally. The company offers baby and adult diapers, and feminine hygiene products. It also provides polypropylene viscose and cotton fiber dry wipes; wet wipes for hygienic, disinfection, and window and other surfaces cleaning applications; and industrial wipes for household, hand cleaner, disinfection, heavy duty cleaning, and various industrial applications. The company was founded in 1984 and is headquartered in Upper Galilee, Israel. Shalag Industries Ltd. is a subsidiary of Shamir Shalag Holdings Agricultural Cooperative Society Ltd.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Upper Galilee",
        "zipcode": "12135",
        "website": "http://www.shalag.co.il",
        "market_cap": 521553440
    },
    "SPNTC.TA": {
        "short_name": "SPUNTECH INDUSTRIE",
        "long_name": "N.R. Spuntech Industries Ltd.",
        "summary": "N.R. Spuntech Industries Ltd. develops, manufactures, and supplies spunlace hydroentangled fabrics in Israel. The company offers dry, disinfecting, hard surface scrubbing, window, bathroom, automobile, and glass wipes for use in household applications; medical swabs and gauzes, bleach wipes, bandages and tapes, germicidal wipes, and medicated wipes for medical applications; pads, face masks, make-up removal wipes, exfoliating fabrics for gentle peeling, soap impregnated facial wipes, face care wipes, and feminine hygiene wipes for cosmetic and feminine care applications; baby wipes; commercial multipurpose wipes for use in industrial facilities and restaurants; and HVAC filters and hard surface scrubbing wipes for industrial applications. The company markets its products in approximately 30 countries worldwide. N.R. Spuntech Industries Ltd. was founded in 1996 and is based in Tiberias, Israel.",
        "currency": "ILA",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TLV",
        "market": "il_market",
        "country": "Israel",
        "state": null,
        "city": "Tiberias",
        "zipcode": "14133",
        "website": "http://www.spuntech.com",
        "market_cap": 610227712
    }
}