{
  "GPGB.TA": {
    "city": "Givatayim",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Utilities - Independent Power Producers",
    "long_name": "G.P. Global Power Ltd",
    "market": "il_market",
    "market_cap": null,
    "sector": "Utilities",
    "short_name": "G.P. GLOBAL POWER",
    "state": null,
    "summary": "G.P. Global Power Ltd engages in planning, development, construction, and financing of infrastructure and energy projects in Israel. It undertakes electricity, thermal energy, natural gas, and renewable energy power plant projects. The company was incorporated in 1999 and is based in Givatayim, Israel.",
    "website": "http://www.global-power.co.il",
    "zipcode": "5358310"
  },
  "OPCE.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Utilities - Independent Power Producers",
    "long_name": "OPC Energy Ltd.",
    "market": "il_market",
    "market_cap": null,
    "sector": "Utilities",
    "short_name": "OPC ENERGY LTD",
    "state": null,
    "summary": "OPC Energy Ltd. owns, develops, and operates power generation facilities in Israeli. It operates a conventional combined cycle power plant with an installed capacity of 466 megawatts (MW); steam boilers and turbines with an installed capacity of up to 18 MW; and a natural gas-fired open-cycle power station with a capacity of approximately 396 MW, as well as has a co-generation power plant with an installed capacity of 148 MW, which is under construction. The company was formerly known as IC Power Israel Ltd. and changed its name to OPC Energy Ltd. in July 2017. The company was incorporated in 2010 and is based in Tel Aviv, Israel. OPC Energy Ltd. is a subsidiary of Kenon Holdings Ltd.",
    "website": "http://www.opc-energy.com",
    "zipcode": "6473919"
  },
  "RTEN-L.TA": {
    "city": "Tel Aviv",
    "country": "Israel",
    "currency": "ILA",
    "exchange": "TLV",
    "industry": "Utilities - Independent Power Producers",
    "long_name": "Rotem Energy Mineral (REM) - Limited Partnership",
    "market": "il_market",
    "market_cap": null,
    "sector": "Utilities",
    "short_name": "ROTEM ENERGY MINER",
    "state": null,
    "summary": "Rotem Energy Mineral (REM) - Limited Partnership engages in the search, development, and production of energy oil shale in Israel. It also focuses on the production of electricity from oil shale and plastic waste in the Mishor Rotem area. Northwood Exploration Israel Ltd. operates as a general partner of Rotem Energy Mineral (REM) - Limited Partnership. The company was founded in 2016 and is based in Tel Aviv, Israel.",
    "website": "http://www.rem-energy.com",
    "zipcode": "6789156"
  }
}
