{"BTS-B.ST": {"short_name": "BTS Group AB ser. B", "long_name": "BTS Group AB (publ)", "summary": "BTS Group AB (publ) operates as a consulting and education firm. The company operates through BTS North America, BTS Europe, BTS Other Markets, and APG segments. It offers a range of services that meet needs within strategy execution and talent development with services that monitor the employee from evaluation for selection and development, to strategic consensus and strategy implementation; leadership development programs; assessment solutions; and business acumen programs. The company also provides buyer-centric consulting, sales transformation, assessment, selection, and on-the-job execution tools; and digital solutions and cloud-based business simulations. It serves customers in IT equipment and software, financial services, manufacturing, pharmaceuticals and biotech, fast-moving consumer goods, energy, telecommunications, professional services, and retail sectors. The company was founded in 1986 and is headquartered in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Consulting Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "CAPAC.ST": {"short_name": "Capacent Holding AB", "long_name": "Capacent Holding AB (publ)", "summary": "Capacent Holding AB (publ) provides consulting services to industrial and service companies, B2B and B2C, private equity firms, financial institutions, and public sector entities. Its services include strategy and organization, finance and performance management, operations excellence, working capital management, market and customer excellence, pricing and revenue management, and business analytics. The company was formerly known as ABB Financial Consulting. Capacent Holding AB (publ) is headquartered in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Consulting Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}, "REJL-B.ST": {"short_name": "Rejlers AB ser. B", "long_name": "Rejlers AB (publ)", "summary": "Rejlers AB (publ) provides technical consultancy services to various customers in the construction and property, energy, industry, infrastructure, and telecom sectors. The company also offers IT services. It operates in Sweden, Finland, and Norway. The company was formerly known as Rejlerkoncernen AB and changed its name to Rejlers AB (publ) in July 2013. Rejlers AB (publ) was founded in 1942 and is headquartered in Stockholm, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Consulting Services", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Stockholm"}}