{
    "AGES-B.ST": {
        "short_name": "Ages Industri AB ser. B",
        "long_name": "AGES Industri AB (publ)",
        "summary": "AGES Industri AB (publ) engages in the die casting, machining, welding, and assembly of precision components. The company is involved in the die casting of aluminum; machining of materials, such as stainless steel, brass, iron, and aluminum; robot and manual welding; component and system assembly and testing; and rheocasting, a semi-solid casting process. It also manufactures casting tools. The company primarily serves automotive, industrial, infrastructure, engineering, electronics, and construction industries in Sweden, Belgium, North America, Poland, the Netherland, France, and internationally. AGES Industri AB (publ) is headquartered in Halmstad, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Halmstad"
    },
    "CI-B.ST": {
        "short_name": "Cell Impact AB ser. B",
        "long_name": "Cell Impact AB (publ)",
        "summary": "Cell Impact AB (publ) manufactures and sells bipolar flow plates for hydrogen fuel cells worldwide. The company offers plates with complex and precise flow patterns. It serves hydrogen fuel cells producers. The company was founded in 1999 and is based in Karlskoga, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Karlskoga"
    },
    "NFGAB.ST": {
        "short_name": "Nordic Flanges Group AB",
        "long_name": "Nordic Flanges Group AB (publ)",
        "summary": "Nordic Flanges Group AB (publ) manufactures and sells industrial flanges in Nordic countries. It offers stainless steel, carbon steel, special alloy, titanium, and aluminum products that include flanges, welding necks, welding rings, and loose flanges, as well as special flanges and customized products. The company was formerly known as Vinovo AB (publ) and changed its name to Nordic Flanges Group AB (publ) in March 2015. Nordic Flanges Group AB (publ) was founded in 1970 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "PCOM-B.ST": {
        "short_name": "Precomp Solutions AB ser. B",
        "long_name": "Precomp Solutions AB (publ)",
        "summary": "Precomp Solutions AB (publ) manufactures and supplies precision components for automotive and manufacturing industries in Europe. It offers individual and assembled components for various applications, as well as provides conventional stampings. The company was founded in 1956 and is headquartered in Ulricehamn, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Ulricehamn"
    },
    "PROF-B.ST": {
        "short_name": "ProfilGruppen AB ser. B",
        "long_name": "ProfilGruppen AB (publ)",
        "summary": "ProfilGruppen AB (publ), together with its subsidiaries, designs, develops, manufactures, and markets customized aluminum extrusions and components primarily in Europe. The company serves interior design, construction, electronics, and automotive industries. It also exports its products. ProfilGruppen AB (publ) was founded in 1981 and is headquartered in Ã\u0085seda, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Ã\u0085seda"
    }
}