{
    "NFGAB.ST": {
        "short_name": "Nordic Flanges Group AB",
        "long_name": "Nordic Flanges Group AB (publ)",
        "summary": "Nordic Flanges Group AB (publ) manufactures and sells industrial flanges in Nordic countries. It offers stainless steel, carbon steel, special alloy, titanium, and aluminum products that include flanges, welding necks, welding rings, and loose flanges, as well as special flanges and customized products. The company was formerly known as Vinovo AB (publ) and changed its name to Nordic Flanges Group AB (publ) in March 2015. Nordic Flanges Group AB (publ) was founded in 1970 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Stockholm",
        "zipcode": "111 52",
        "website": "http://www.nordicflanges.com",
        "market_cap": "Small Cap"
    },
    "PCOM-B.ST": {
        "short_name": "Precomp Solutions AB ser. B",
        "long_name": "Precomp Solutions AB (publ)",
        "summary": "Precomp Solutions AB (publ) manufactures and supplies precision components for automotive and manufacturing industries in Europe. It offers individual and assembled components for various applications, as well as provides conventional stampings. The company was founded in 1956 and is headquartered in Ulricehamn, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Ulricehamn",
        "zipcode": "523 37",
        "website": "http://precomp.se",
        "market_cap": "Small Cap"
    },
    "PROF-B.ST": {
        "short_name": "ProfilGruppen AB ser. B",
        "long_name": "ProfilGruppen AB (publ)",
        "summary": "ProfilGruppen AB (publ), together with its subsidiaries, designs, develops, manufactures, and markets customized aluminum extrusions and components primarily in Europe. The company serves interior design, construction, electronics, and automotive industries. It also exports its products. ProfilGruppen AB (publ) was founded in 1981 and is headquartered in Ã\u0085seda, Sweden.",
        "currency": "SEK",
        "sector": "Industrials",
        "industry": "Metal Fabrication",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "state": null,
        "city": "Ã\u0085seda",
        "zipcode": "364 21",
        "website": "http://www.profilgruppen.se",
        "market_cap": "Small Cap"
    }
}