{"203.F": {"short_name": "NOBINA AB  SK 90", "long_name": "Nobina AB (publ)", "summary": "Nobina AB (publ), through its subsidiaries, provides public transportation services in Sweden, Denmark, Norway, and Finland. The company offers bus services. Nobina AB (publ) was founded in 1911 and is headquartered in Solna, Sweden.", "currency": "EUR", "sector": "Industrials", "industry": "Railroads", "exchange": "FRA", "market": "dr_market", "country": "Sweden", "city": "Solna"}, "NOBINA.ST": {"short_name": "Nobina AB", "long_name": "Nobina AB (publ)", "summary": "Nobina AB (publ), through its subsidiaries, provides public transportation services in Sweden, Denmark, Norway, and Finland. The company offers bus services. Nobina AB (publ) was founded in 1911 and is headquartered in Solna, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Railroads", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Solna"}, "RAIL.ST": {"short_name": "Railcare Group AB", "long_name": "Railcare Group AB (publ)", "summary": "Railcare Group AB (publ) provides railway maintenance services primarily in Scandinavia and the United Kingdom. The company offers works on the track area, including ballast change on line and in gear; drainage; pre-projection/cable location; cable glands; cable cut/unlock cable; ducting; snow removal; vegetation clearance and ballast uptake; and cleaning of drums. It also undertakes renovation and earthworks; and operates workshops for railway operators, as well as locomotives, wagons, and machines. In addition, the company engages in the construction, project, heavy, and special transportation activities; owing and rental of 20 diesel lorries in various sizes and approximately 160 lorries; and provision of logistic services. Further, it provides infrastructure management, railway tunnels refurbishment, machine construction, and staff rental services, as well as tractor units for contractors. The company was founded in 1992 and is headquartered in Skelleftehamn, Sweden.", "currency": "SEK", "sector": "Industrials", "industry": "Railroads", "exchange": "STO", "market": "se_market", "country": "Sweden", "city": "Skelleftehamn"}}