{
    "583.SI": {
        "short_name": "$ Progen",
        "long_name": "Progen Holdings Ltd",
        "summary": "Progen Holdings Ltd, an investment holding company, engages in the design, supply, installation, and maintenance of air-conditioning and mechanical ventilation systems in Singapore. The company operates in three segments: Products and Installation, Servicing and Maintenance, and Rental. It is also involved in the trading and contracting of engineering works, cooling towers, and air-conditioning and mechanical ventilation systems. In addition, the company engages in servicing and repairing air-conditioners, cooling towers, and other cooling equipment; and supplying and installing cooling fans, cooling towers, and air-conditioners. Further, it sells and distributes household electrical appliances and air-conditioners; and rents and leases factory, office, and building space. Progen Holdings Ltd was founded in 1981 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5IF.SI": {
        "short_name": "$ Natural Cool",
        "long_name": "Natural Cool Holdings Limited",
        "summary": "Natural Cool Holdings Limited provides installation, maintenance, repair, and replacement services for air-conditioning systems in Singapore. The company operates in four segments: Aircon, Investment, Paint, and Food and beverages. It offers inspection and cleaning services for air-conditioning and ventilation systems to residential and commercial markets; and trades in air-conditioning units and spare parts. The company also manufactures and sells paints and chemicals, including enamel coatings, epoxy coatings, PU coatings, and solvents principally under the Cougar brand name. In addition, it engages in the manufacturing, distribution, and retail of soy bean beverages under the Tobo brand name; and cooked-food snacks preparations, including dim sum products, pumpkin cakes, and traditional Chinese dumplings. Further, the company operates Abang Recipes, a dine-in restaurant. Natural Cool Holdings Limited was founded in 1989 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5VP.SI": {
        "short_name": "$ GDS Global",
        "long_name": "GDS Global Limited",
        "summary": "GDS Global Limited, an investment holding company, provides commercial and industrial door and shutter solutions in Singapore and the South East Asia region. The company's industrial door systems include Gliderol continuous sheet roller doors; Gliderol GIANT series roller shutters; heavy duty and high security roller shutters; insulated and Louvred roller shutters; sectional overhead doors; Renlita bi-folding doors; and Butzbach stacking doors. It also provides commercial door systems, such as Gliderol continuous and Alfresco steel roller shutters, crystal aluminum and CrystalClear transparent shutters, aluminum roller grilles, high security roller shutters, and Butzbach glass stacking doors; Gliderol GIANT series and Butzbach sliding hangar doors; and garage door systems that include sectional garage and roller doors, as well as Renlita tiltup doors for use in private homes. In addition, the company offers proprietary fire-rated shutter systems, which comprise non-insulated fire shutters, normal heat and fire insulated shutters, and fire insulated curtains; door systems for Gliderol swift high-speed traffic doors, Gliderol horizontally coiling hatches, Gliderol fall arresters, Butzbach NOVOSPRINT high-speed traffic doors, Won-Door DuraSound acoustic accordion doors, and Won-Door FireGuard fire-rated accordion doors. Further, it provides preventive, general maintenance, repair, overhaul, and replacement services for faulty components and safety checks; and ad hoc repair and maintenance services. Additionally, the company manufactures metal doors, window and door frames, and grilles and gratings; and trades in production components, as well as sells metal doors through internet. Its products are used in manufacturing, retail, food processing, hospitality, health, education, aerospace, and security and defense industries. The company was founded in 1982 and is headquartered in Singapore. GDS Global Limited is a subsidiary of D'Oasis Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "5VS.SI": {
        "short_name": "Hafary",
        "long_name": "Hafary Holdings Limited",
        "summary": "Hafary Holdings Limited, an investment holding company, imports, exports, distributes, and wholesales building materials. The company operates in three segments: General, Project, and Others. It offers vinyl, ceramic, klinker, cement, terracotta, and porcelain tiles; stones, such as marble, onyx, Travertine, granite, composite, limestone, sandstone, artificial, lavastone, and quartz; mosaic products; wood products comprising vinyl, solid hardwood, engineered timber, and laminate; quartz top products; sanitary wares and fittings; and kitchen products. The company also engages in dealing stones and wood for home furnishings; storage and warehousing of furniture and related products; and intellectual property holding and management business. It serves architecture, interior design, and renovation firms, as well as property developers and construction companies in Singapore, the People's Republic of China, the Socialist Republic of Vietnam, the Republic of the Union of Myanmar, the Republic of Indonesia, Cambodia, Malaysia, Maldives, and internationally. The company was founded in 1980 and is headquartered in Singapore. Hafary Holdings Limited is a subsidiary of Hap Seng Investment Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "N7E.F": {
        "short_name": "NATURAL COOL HLDGS LTD",
        "long_name": "Natural Cool Holdings Limited",
        "summary": "Natural Cool Holdings Limited provides installation, maintenance, repair, and replacement services for air-conditioning systems in Singapore. The company operates in four segments: Aircon, Investment, Paint, and Food and beverages. It offers inspection and cleaning services for air-conditioning and ventilation systems to residential and commercial markets; and trades in air-conditioning units and spare parts. The company also manufactures and sells paints and chemicals, including enamel coatings, epoxy coatings, PU coatings, and solvents principally under the Cougar brand name. In addition, it engages in the manufacturing, distribution, and retail of soy bean beverages under the Tobo brand name; and cooked-food snacks preparations, including dim sum products, pumpkin cakes, and traditional Chinese dumplings. Further, the company operates Abang Recipes, a dine-in restaurant. Natural Cool Holdings Limited was founded in 1989 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "U09.SI": {
        "short_name": "Avarga",
        "long_name": "Avarga Limited",
        "summary": "Avarga Limited, an investment holding company, engages in manufacturing and trading of paper products, and providing management services in Canada, the United States, Malaysia, Singapore, Myanmar, Sri Lanka, Australia, and internationally. The company operates through four segments: Paper Mill, Power Plant, Building Products, and Others. The company manufactures and sells industrial grade paper products, such as test liner, corrugating medium, chipboard, and core boards that are primarily used to manufacture corrugated carton boxes and other finished paper products. It also collects and trades in waste paper products. In addition, the company operates a 50 megawatt gas-fired electricity plant in Ywama, Myanmar, which sells its electricity to the Myanmar Government. Further, it distributes building materials, such as lumber, panels, moldings, sidings, engineered wood, flooring, roofing, insulations, and others. Additionally, the company engages in property rental and management activities. The company was formerly known as UPP Holdings Limited and changed its name to Avarga Limited in April 2018. Avarga Limited was founded in 1967 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}