{"1376.HK": {"short_name": "RAFFLESINTERIOR", "long_name": "Raffles Interior Limited", "summary": "Raffles Interior Limited, an investment holding company, provides interior fitting-out services in Singapore. The company offers project and construction management services; and interior fitting-out services, which include manufacture or installation of ceiling, carpentry, joinery, plastering, floor finishing, woodworks, steel and metal works, painting works, sanitary fittings and wares, MEP works, and structural works, such as staircases, as well as other associated works. It also manufactures, customizes, and supplies carpentry/joinery and integral fixtures, as well as upholstery works; and maintenance services for interior fitting-out projects. The company serves premises in the private commercial sector, such as office spaces and light-industrial properties; construction contractors; and professional consultants. Raffles Interior Limited was founded in 1986 and is headquartered in Singapore. Raffles Interior Limited is a subsidiary of Ultimate Global Enterprises Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Consulting Services", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "1650.HK": {"short_name": "HYGIEIA GROUP", "long_name": "Hygieia Group Limited", "summary": "Hygieia Group Limited, an investment holding company, provides general cleaning services in Singapore and Thailand. The company offers general cleaning works for various public and private venues, including a sports stadium, medical centers, shopping malls, commercial and industrial buildings, schools, hotels, and private condominiums, as well as public access areas in town councils. It also provides general cleaning works for private customers at private residences, an office, a hotel, and industrial buildings. The company was founded in 1991 and is headquartered in Singapore. Hygieia Group Limited is a subsidiary of TEK Assets Management Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Consulting Services", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}}