{
    "AWC.SI": {
        "short_name": "Brook Crompton",
        "long_name": "Brook Crompton Holdings Ltd.",
        "summary": "Brook Crompton Holdings Ltd., an investment holding company, engages in the distribution of electric motors in the United Kingdom, the Asia Pacific, and North America. The company provides its products under the Brook Crompton brand name for marine, oil and gas, and mining sectors, as well as for heating, ventilation, and air conditioning sector. Brook Crompton Holdings Ltd. was formerly known as Lindeteves-Jacoberg Limited and changed its name to Brook Crompton Holdings Ltd. in April 2016. The company was incorporated in 1947 and is based in Singapore. Brook Crompton Holdings Ltd. is a subsidiary of ATB Austria Antriebstechnik AG.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "089058",
        "website": "http://www.brookcromptonholdings.com",
        "market_cap": "Small Cap"
    },
    "BQN.SI": {
        "short_name": "BH Global",
        "long_name": "BH Global Corporation Limited",
        "summary": "BH Global Corporation Limited, together with its subsidiaries, provides supply chain management, design, and manufacturing solutions to marine and offshore industries worldwide. It operates through four segments: Electrical and Technical Supply, Green LED Lighting, Security, and Integration Engineering. The company supplies marine, offshore, industrial, and marine data and coaxial cables, as well as cable accessories; marine and offshore, ATEX, and LED lighting solutions, as well as lighting accessories; and ATEX sounders and beacons, alarm and signaling equipment, ship horns, battery chargers and accessories, and switchboard control and automation products. It also offers inventory management, quality component integration, and support services. In addition, the company provides LED module, LED luminaire, floodlight, panel light, downlight, and industrial highway series products. Further, it provides project management; procurement management; design and engineering management; fabrication monitoring; control and management; and integration, testing and commissioning. Additionally, the company offers critical infra-structure protection and cyber security products and services; and develops, manufactures, and markets remote sensing and motion control systems for industrial, commercial, and law enforcement applications. The company was formerly known as BH Global Marine Limited and changed its name to BH Global Corporation Limited in May 2013. BH Global Corporation Limited was founded in 1963 and is headquartered in Singapore. BH Global Corporation Limited is a subsidiary of Beng Hui Holding (S) Pte Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "609189",
        "website": "http://www.bhglobal.com.sg",
        "market_cap": "Small Cap"
    },
    "G20.SI": {
        "short_name": "GP Industries",
        "long_name": "GP Industries Limited",
        "summary": "GP Industries Limited, an investment holding company, develops, manufactures, and markets batteries and related products in Singapore and internationally. The company operates through four segments: Batteries, Electronics and Acoustics, Automotive Wire Harness, and Other Industrial Investments. It offers primary, alkaline, and rechargeable batteries to original equipment manufacturers, battery companies, and consumer retail markets under the GP brand name. The company also develops, manufactures, markets, and retails professional electronic products, including portable public address systems, professional amplifiers, music instrument applications, mixing controllers, and subwoofers for professional and commercial applications; home electronic products comprising audiophile home amplifiers, home CD players, surround sound home theatre systems, and multi-media amplifier systems; and battery chargers. In addition, it offers loudspeakers under the KEF and CELESTION brand names; and aluminum face plates and heat sink components for computer and consumer electronic products. In addition, the company designs, manufactures, and markets automotive wire harness; manufactures transformers and switching mode power supply products; markets and trades in parts and components, and hygienic and health care products; and provides logistic support services. Further, it holds trademarks; and manufactures electronic and network cables. The company was formerly known as GPE Industries Limited and changed its name to GP Industries Limited in June 2000. GP Industries Limited was incorporated in 1995 and is based in Singapore. GP Industries Limited is a subsidiary of Gold Peak Industries (Holdings) Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "138543",
        "website": "http://www.gp-industries.com",
        "market_cap": "Small Cap"
    },
    "XPP.L": {
        "short_name": "XP POWER LIMITED ORD 1P (DI)",
        "long_name": "XP Power Limited",
        "summary": "XP Power Limited, an investment holding company, designs and manufactures power supply solutions in Europe, North America, and Asia. The company offers AC-DC power supplies, DC-DC converters, high voltage AC-DC power supplies, high voltage DC-DC converters, RF power systems, EMI filters, custom power supplies, and 3 phase power sources. It also offers engineering services. The company serves healthcare, industrial technology, and semiconductor equipment manufacturing industries. XP Power Limited was founded in 1988 and is based in Singapore.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "149598",
        "website": "http://www.xppowerplc.com",
        "market_cap": "Small Cap"
    },
    "XPPLF": {
        "short_name": "XP POWER LTD",
        "long_name": "XP Power Limited",
        "summary": "XP Power Limited, an investment holding company, designs and manufactures power supply solutions in Europe, North America, and Asia. The company offers AC-DC power supplies, DC-DC converters, high voltage AC-DC power supplies, high voltage DC-DC converters, RF power systems, EMI filters, custom power supplies, and 3 phase power sources. It also offers engineering services. The company serves healthcare, industrial technology, and semiconductor equipment manufacturing industries. XP Power Limited was founded in 1988 and is based in Singapore.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "149598",
        "website": "http://www.xppowerplc.com",
        "market_cap": "Small Cap"
    }
}