{"0924.HK": {"short_name": "KHOON GROUP", "long_name": "Khoon Group Limited", "summary": "Khoon Group Limited, an investment holding company, operates as a mechanical and electrical service provider specialized in providing electrical engineering solutions in Singapore. The company's electrical engineering services primarily comprise customization and/or installation of electrical systems; assisting to obtain statutory approvals; and testing and commissioning. It offers its electrical engineering services to new building developments, redevelopment, repair, additions and alterations works to existing buildings and structures, and upgrading projects for residential, commercial, and industrial buildings. The company was incorporated in 2018 and is headquartered in Singapore. Khoon Group Limited is a subsidiary of Lead Development Investment Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "1420.HK": {"short_name": "CHUAN HOLDING", "long_name": "Chuan Holdings Limited", "summary": "Chuan Holdings Limited, an investment holding company, provides earthworks and ancillary services, and general construction works in Singapore. The company's earthworks include land clearing, demolition, rock breaking, mass excavation, deep basement and foundation excavation, earth disposal and filling, and shore protection services. Its general construction works consist of alteration and addition works, including interior works or works affecting building systems or components, such as structural works, additions of lifts, and reinforcement works; and the construction of new buildings. The company is also involved in the rental of construction and civil engineering machinery and equipment. Chuan Holdings Limited was founded in 1992 and is headquartered in Singapore.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "1656.HK": {"short_name": "ISDN HOLDINGS", "long_name": "ISDN Holdings Limited", "summary": "ISDN Holdings Limited provides motion control, other specialized engineering solutions, and industrial computing solutions in Singapore, the People's Republic of China, Hong Kong, Malaysia, and internationally. The company provides the conceptualization, design, development, prototyping, procurement, assembly production, testing, commissioning, installation, software design and customization, and after-sales technical support services for motion control systems; standard modular construction components for use in industrial automation systems; and hardware components, such as industrial locks and hinges, latches, and other fitting technology. It also engages in manufacturing and assembling special purpose motors and gears; and trading and distributing spares, components, and motors. In addition, the company offers industrial computing products and services, such as industrial computer systems customizing and assembling, and software installing services; hardware and automation products; system integration services for industrial computing systems; and software development and integration advisory services. It serves manufacturers and original design manufacturers of products and equipment that have requirements in precision controls in defense, medical, aerospace, oil and gas, robotic, aerospace, medical, textile, information technology and telecommunications, packaging, alternative energy, automotive, semiconductor, special-purpose machine tools, and marine and offshore industries. The company was founded in 1986 and is headquartered in Singapore. ISDN Holdings Limited is a subsidiary of Assetraise Holdings Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "1742.HK": {"short_name": "HPC HOLDINGS", "long_name": "HPC Holdings Limited", "summary": "HPC Holdings Limited, an investment holding company, engages in the provision of general building and civil engineering construction works in Singapore. The company provides contractor and subcontractor construction services for the public and private sectors. It designs and builds projects for commercial and industrial buildings, such as logistics and warehouses facilities, factories, offices, workshops and car parks, and nursing homes. The company's subcontracting works relate to the upgrading of HDB flats, as well as construction of MRT stations, schools, factories, and highways. It also offers engineering design and consultancy services. HPC Holdings Limited was founded in 2004 and is headquartered in Singapore.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "1987.HK": {"short_name": "BENG SOON MACH", "long_name": "Beng Soon Machinery Holdings Limited", "summary": "Beng Soon Machinery Holdings Limited provides demolition services to public and private sector clients in Singapore. The company undertakes demolition works of industrial buildings, power stations, chemical plants, high rise commercial, educational institutions and residential properties, bridges and marine structures, public roads, and infrastructures. It also engages in the sale of inventories and leasing of machinery. The company was founded in 1979 and is headquartered in Singapore.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "2227.HK": {"short_name": "SOLIS HOLDINGS", "long_name": "Solis Holdings Limited", "summary": "Solis Holdings Limited, an investment holding company, operates as a design and build mechanical and electrical engineering contractor in Singapore. The company undertakes installation works of electrical-based systems, such as lightings, switchgears, and generators; communication and security systems comprising CCTV and card access systems; and telephone cabling systems. It also operates as a subcontractor for the installation works of air-conditioning system, including air-conditioning units, refrigerant pipework and drainage work, and requisite insulation and fittings; mechanical ventilation systems, including exhaust air fans; and fire protection systems, which include fire alarm panels, heat detectors, fire sprinkler, hose reel, and hydrant systems, and clean gas total flooding system. The company serves private residential, mixed residential and commercial developments, and institutional buildings. Solis Holdings Limited was founded in 1983 and is headquartered in Singapore. Solis Holdings Limited is a subsidiary of HMK Investment Holdings Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "39Q.F": {"short_name": "LIAN BENG GROUP  SD -,05", "long_name": "Lian Beng Group Ltd", "summary": "Lian Beng Group Ltd, an investment holding company, engages in the construction business in Singapore and Australia. It operates in four segments: Construction, Dormitory, Investment Holding, and Property Development. The Construction segment constructs residential, institutional, industrial, and commercial properties; and undertakes civil engineering projects in private and public sectors. This segment also sells construction materials, such as concrete and asphalt; provides engineering services; and leases construction machinery. The Dormitory segment is involved in the rental of dormitory units; and provision of dormitory services. The Investment Holding segment holds investments in quoted and unquoted securities and properties. The Property Development segment develops and sells residential, commercial, and industrial properties, as well as offers property management services. The company also provides engineering, automation, and technical services, as well as management and management consulting services; undertakes general building construction, civil engineering, and electrical works; manufactures and supplies concrete; and sells, rents, and maintains construction machinery and equipment. In addition, it is involved in shipping operations, including chartering of ships; trading steel products; and the provision of training for construction workers. Lian Beng Group Ltd was founded in 1973 and is based in Singapore.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "3IN.SG": {"short_name": "Dyna-Mac Holdings Ltd. Register", "long_name": "Dyna-Mac Holdings Ltd.", "summary": "Dyna-Mac Holdings Limited, an investment holding company, engineers, fabricates, and constructs offshore floating production storage offloading and floating storage offloading topside modules for the oil and gas industries. The company operates through two segments, Module Business and Ad-hoc Projects. It is involved in the engineering, procurement, and construction of specialized process and control equipment modules, including separators, heat exchangers, coolers, pumps, electrical equipment, process piping, control valves and control panels that are installed on steel structural frames and connected to operate as an integrated facility, as well as power generation and accommodation modules. The company also constructs modules for refineries, chemical and pharmaceutical plants, LNG liquefaction plants, LNG terminals, and pharmaceutical plants. In addition, it engages in the offshore construction of hull of floating production units, turret mooring systems, sub-sea pipelines, self-installing platforms, and fixed platforms and jackets. Further, the company is involved in the repair of ships, tankers, and other ocean-going vessels, as well as engineering, fabrication, and construction of onshore plants and other sub-sea products. Additionally, it manufactures and repairs marine engines and ship parts; and offers manpower resources for shipping-related projects. The company operates primarily in Singapore, Malaysia, Australia, Monaco, Switzerland, the United Kingdom, and Americas. Dyna-Mac Holdings Limited was founded in 1990 and is headquartered in Singapore.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "STU", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "41B.SI": {"short_name": "$ Huationg Global", "long_name": "Huationg Global Limited", "summary": "Huationg Global Limited, an investment holding company, provides civil engineering services for infrastructure projects primarily in Singapore. It operates in three segments: Civil Engineering Services, Inland Logistics Support, and Sales of Construction Materials. The Civil Engineering Services segment offers earthworks, infrastructure works, external works, demolition and excavation works, drainage works and road diversion, site clearance, reinforcing bar installation, formwork, concrete installation, backfill and compaction, and final handover. The Inland Logistics Support segment leases construction equipment, including articulated dump trucks, rollers, bulldozers, wheel loaders, telescopic clamshell, breakers, tipper trucks, compactors, excavators, and concrete pumps. The Sales of Construction Materials segment offers recycled concrete aggregates, such as graded stones, granite aggregates, and manufactures and supplies liquefied soil stabilizers, which are used as non-structural fills for buildings and other structures, and backfill in utility and road construction. The company was founded in 1983 and is headquartered in Singapore. Huationg Global Limited is a subsidiary of Dandelion Capital Pte. Ltd.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "42D.SI": {"short_name": "$ NauticAWT", "long_name": "NauticAWT Limited", "summary": "NauticAWT Limited provides offshore and marine engineering services. It operates through Renewables, Ports and Offshore, Energy & Mining, and Civil Structures segments. The Renewables segment provides ultra-high performance concrete and composite (UHPC) materials for the installation of onshore and offshore wind turbines. The Ports and Offshore segment offers engineering and contracting services for greenfield and brownfield offshore and marine infrastructure projects. The Energy & Mining segment provides UHPC materials for well integrity and remediation of production wells. The Civil Structures segment offers UHPC and high performance concrete and composite materials for the civil structures, facades, and claddings. The company operates in Australasia, India, rest of Asia, the Middle East, Africa, the Americas, and Europe. NauticAWT Limited was founded in 2011 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "43F.SI": {"short_name": "$ Acromec", "long_name": "Acromec Limited", "summary": "Acromec Limited, an investment holding company, provides specialist engineering services in the field of controlled environments in Singapore. The company operates through two segments, Engineering, Procurement, and Construction; and Maintenance. It designs and constructs facilities requiring controlled environments, such as laboratories, medical and sterile facilities, and cleanrooms; and provides engineering, procurement, and construction services, such as architectural, mechanical, and electrical and process works. The company also provides maintenance and repair services for facilities and equipment of controlled environments and their supporting infrastructure. In addition, it engages in import and distribution of laboratory furniture and accessories; and provides maintenance and installation services for air-conditioning and mechanical ventilation systems, as well as generates electricity by other sources, such as solar power and biofuels. The company serves hospitals and medical centers, government agencies, research and development (R&D) companies and agencies, R&D units of multinational corporations, tertiary educational institutions, pharmaceutical companies, semiconductor manufacturing companies, and multinational engineering companies. The company was founded in 1996 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5CF.SI": {"short_name": "OKP", "long_name": "OKP Holdings Limited", "summary": "OKP Holdings Limited operates as a transport infrastructure and civil engineering company in Singapore and Australia. It operates through three segments: Construction, Maintenance, and Rental Income. The Construction segment constructs urban and arterial roads, airport runways and taxiways, expressways, flyovers, vehicular bridges, flyovers and buildings, airports infrastructure, and oil and gas-related infrastructure for petrochemical plants and oil storage terminals. The Maintenance segment provides re-construction work performed on roads, road reserves, pavements, footpaths and kerbs, guardrails, railings, drains, and signboards, as well as bus bays and shelters. The Rental Income segment engages in the rental of investment properties. The company also offers technical management and consultancy, rental and investment holding, property investment and development, and transport and logistics services. OKP Holdings Limited was founded in 1966 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5G9.SI": {"short_name": "$ Tritech", "long_name": "Tritech Group Limited", "summary": "Tritech Group Limited, an investment holding company, engages in engineering, and water and environmental business in Singapore and the People's Republic of China. The company offers geotechnical instrumentation and monitoring services; geotechnical and geological site explorations; investigations, analysis, and testing for general and infrastructure construction; design, consultancy, and project management services for infrastructure, environmental, geotechnical, civil, and rock engineering works; and products and related services, as well as supplies and installs geotechnical instruments, and undertakes automatic tunnel monitoring survey and other land surveying works. In addition, the company offers produces and sells bottled and alkaline drinking water and dispensers; markets related technologies, systems, and services; and supplies water quality monitoring products and services. Further, it engages in soil investigation, treatment, and stabilization activities; development and sale of engineering finite element analysis programs in the geotechnical field; designing and developing automation and engineering systems; provision of remote water monitoring services; and architectural, engineering, and professional consultancy activities. The company serves a range of industries, such as infrastructure, oil and gas, and commercial and residential property developments. Tritech Group Limited was founded in 1999 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5HV.SI": {"short_name": "$ Koh Eco", "long_name": "Koh Brothers Eco Engineering Limited", "summary": "Koh Brothers Eco Engineering Limited, provides engineering, procurement, and construction services for infrastructure, water and wastewater treatment, hydro-engineering, bio-refinery, and bio-energy projects. The company operates in two segments, Engineering and Construction; and Bio-Refinery and Bio-Energy. It undertakes various civil engineering and construction projects. The company also offers water and wastewater treatment solutions, such as engineering, manufacturing, and procurement services for infrastructure, specialist equipment, and turnkey systems, as well as project management, installation, performance trial, commissioning, training, and operation and maintenance services. In addition, it designs, builds, and installs hydro-engineering equipment and systems; and acts as a system integrator for the mechanical and electrical power, as well as instrumentation and control systems. Further, the company offers refining solutions, such as edible and non-edible oil refining plants, renewable energy and biofuel plants, and system and process improvements for the existing refining operations; provides consultancy, design, engineering, procurement, and construction services for palm oil mills that are seeking to recover and utilize methane as a source of renewable energy for power generation; and distributes machinery and components, as well as assists in designing, reviewing, submitting, and supporting palm oil mill effluent biogas recovery projects to achieve carbon credits. It serves government, and public and private sectors in Singapore, Malaysia, Indonesia, rest of Asia, South America, Africa, and internationally. The company was formerly known as Metax Engineering Corporation Limited and changed its name to Koh Brothers Eco Engineering Limited in April 2014. The company was incorporated in 1975 and is based in Singapore. Koh Brothers Eco Engineering Limited is a subsidiary of Koh Brothers Group Limited.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5OC.SI": {"short_name": "$ Koyo Intl", "long_name": "Koyo International Limited", "summary": "Koyo International Limited, an investment holding company, provides integrated mechanical and electrical engineering services in Singapore. It operates in three divisions: Mechanical Engineering, Electrical Engineering, and Facilities Management. It designs and installs air-conditioning and mechanical ventilation, plumbing and sanitary installation, and fire prevention and protection systems, as well as integrated monitoring and control systems; and high and low tension electrical distribution, communications, audio-visual, and securities systems. The company also offers mechanical and electrical services for industrial, commercial, and residential buildings; provides maintenance, repair, and replacement services for commercial buildings, hotels, schools, and universities; supplies construction materials, including reclamation sand, construction sand, armour rock, granite, and other aggregates; owns mines and concession for raw materials, shipping/chartering services, logistics planning and ancillary support services, such as stevedoring and dredging; designs, integrates, and implements industrial engineering services; and provides oil, gas, and marine engineering services, as well as facilities management services. It focuses on integrating environmental engineering and clean technologies for industries by offering a suite of clean technologies, such as large scale solar heat collector arrays, hot water storage tanks, high-temperature heat pumps, phase change materials, non-chemical water treatment, electrical licensing services, regenerator, conditioner, degassing system, condensate water collection system, and liquid desiccant systems. The company engages in the property development and construction, management, and investment activities; and general trading of products. It serves customers in construction, marine, oil and gas, industrial, and pharmaceutical industries, as well as public sector. The company was founded in 1983 and is headquartered in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5TT.SI": {"short_name": "Keong Hong", "long_name": "Keong Hong Holdings Limited", "summary": "Keong Hong Holdings Limited, an investment holding company, engages in the building construction, and property and hotel development activities in Singapore, Japan, and the Maldives. It operates through four segments: Construction, Property Development, Investment Property, and Investment Holding. The company offers a range of building construction services to private and public sectors for residential, commercial, industrial, and institutional projects. Its construction projects cover new construction, additions and alteration works of existing buildings, and refurbishment and upgrading of existing buildings. The company is also involved in real estate development, building construction materials trading, and hotel building contracting activities. In addition, it provides timber and wooden flooring services in residential apartment and commercial properties; and engages in leasing offices and retail shops in commercial buildings in Osaka, Japan. Keong Hong Holdings Limited was founded in 1983 and is headquartered in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5UO.SI": {"short_name": "$ Sysma", "long_name": "Sysma Holdings Limited", "summary": "Sysma Holdings Limited, an investment holding company, engages in the building construction and property development businesses in Singapore. Its building projects comprise residential, commercial, heritage and conservation, institutional, and industrial properties. The company was founded in 1986 and is based in Singapore. Sysma Holdings Limited is a subsidiary of Xiang Investment Ltd.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5VC.SI": {"short_name": "$ Kori", "long_name": "Kori Holdings Limited", "summary": "Kori Holdings Limited, an investment holding company, provides civil/structural engineering and infrastructural construction services as a sub-contractor for commercial, industrial, and public infrastructural construction projects in Singapore and Malaysia. The company operates through two segments, Structural Steel Works Services and Tunneling Services. It is involved in the design and supply of steel strutting for temporary earth retaining or stabilizing structures; steel decking for traffic diversion and working platform; TBM bored tunneling services; and steel piling services for driving steel piles as decking post, king post, and retaining wall systems. The company's solutions are used for underground works in the urban environment. Kori Holdings Limited was founded in 1982 and is headquartered in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "5VI.SI": {"short_name": "$ Boldtek", "long_name": "Boldtek Holdings Limited", "summary": "Boldtek Holdings Limited, an investment holding company, engages in the general building, precast manufacturing, properties development and investment, and soil investigation and treatment activities in Singapore and Malaysia. The company's General Building segment is involved in the provision of construction and building, and maintenance works, such as excavation, piling, sub-structures, and superstructures works; architectural works; aluminum cladding and curtain walling; mechanical and engineering works; supply and installation of furniture/interior fitting-out works; external works; and landscaping activities. Its Precast Manufacturing segment manufactures and trades in concrete precast products. The company's Properties Development and Investment segment invests, trades in, and develops residential and industrial properties. Its Soil Investigation and Treatment segment provides consultation services. Boldtek Holdings Limited also engages in the stabilization, research, and experimental engineering development activities; and land development activities. The company was formerly known as Logistics Holdings Limited and changed its name to Boldtek Holdings Limited in August 2017. The company was founded in 1985 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "8373.HK": {"short_name": "INDIGO STAR", "long_name": "Indigo Star Holdings Limited", "summary": "Indigo Star Holdings Limited, an investment holding company, operates as a subcontractor for structural reinforced and concrete works in Singapore. It undertakes reinforced concrete works, including steel reinforced, formwork erection, and concrete works of general building and civil engineering projects. The company was founded in 1996 and is headquartered in Singapore. Indigo Star Holdings Limited is a subsidiary of Amber Capital Holdings Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "9998.HK": {"short_name": "KWAN YONG", "long_name": "Kwan Yong Holdings Limited", "summary": "Kwan Yong Holdings Limited, an investment holding company, provides general building and construction services in Singapore. It undertakes building construction works of institutional buildings, such as education institutions, hospitals, and nursing homes; and commercial buildings comprising office buildings and restaurants, as well as industrial and residential buildings. The company was incorporated in 2018 and is headquartered in Singapore. Kwan Yong Holdings Limited is a subsidiary of Ideal Smart Ventures Limited.", "currency": "HKD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "HKG", "market": "hk_market", "country": "Singapore", "city": "Singapore"}, "AVM.SI": {"short_name": "Boustead Proj", "long_name": "Boustead Projects Limited", "summary": "Boustead Projects Limited, together with its subsidiaries, provides real estate solutions for multinational corporations and local enterprises in Singapore, Malaysia, China, and Vietnam. The company operates in Design-and-Build, Real Estate, and Investment segments. It designs, builds, and develops industrial facilities and parks for lease or sale for aerospace and automotive, business park, food, healthcare and pharmaceutical, high-tech manufacturing, infocommunications, lifestyle, logistics, oil and gas, precision engineering, research and development, technology, and waste management industries. The company also develops and leases a leasehold portfolio primarily consists of single-tenanted custom-built business parks; and offers asset and facilities management services. In addition, it offers property fund management; property management; real estate trading; project management; and other property-related services, as well as acts as a private business trust and trustee for real estate trust. The company was founded in 1996 and is headquartered in Singapore. Boustead Projects Limited is a subsidiary of Boustead Singapore Limited.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "AXB.SI": {"short_name": "Yongnam", "long_name": "Yongnam Holdings Limited", "summary": "Yongnam Holdings Limited, an investment holding company, provides engineering and construction services in Singapore and rest of Asia Pacific. The company's Structural Steelworks division engages in engineering coordination, detailing, and fabrication and erection of structural steel. This division is also involved in the design, fabrication, supply, and erection of steel structural frames for long span aircraft hangars, high rise buildings, and commercial and industrial buildings, as well as for infrastructure related developments. Its Specialist Civil Engineering division offers modular strutting systems, including laced universal beams of various cross-sections in modular lengths; single and double waler beams in various lengths, intermediate supporting beams, king posts, and bracing and waler support brackets; and a range of strut to waler joints to cover the used angles. The company's Mechanical Engineering division engages in the installation of mechanical equipment and plants; and supply, fabrication, and installation of mechanical components, as well as in the plant maintenance activities. Yongnam Holdings Limited was founded in 1971 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BBP.SI": {"short_name": "Hor Kew", "long_name": "Hor Kew Corporation Limited", "summary": "Hor Kew Corporation Limited, an investment holding company, provides various integrated construction related products and services in Singapore. Its Property Investment and Development segment is involved in the development, sale, and leasing of residential, commercial, and industrial properties. The company's Construction segment constructs residential, institutional, industrial, and commercial properties as a primary contractor. Its Prefabrication segment designs, manufactures, and sells prestressed and reinforced concrete building components, as well as prefabricated architectural metal components. The company also rents machinery. Hor Kew Corporation Limited was founded in 1979 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BFI.SI": {"short_name": "Tiong Seng", "long_name": "Tiong Seng Holdings Limited", "summary": "Tiong Seng Holdings Limited, together with its subsidiaries, provides building construction and civil engineering services. It operates through three segments: Construction, Engineering Solutions, and Property Development. The company undertakes various construction projects, such as residential, commercial, institutional, civil engineering, foundation, industrial, hotel, and infrastructural projects for private and public sectors. It also develops residential and commercial properties. In addition, the company manufactures and supplies precast and prefabricated components, as well as provides steel and mass engineered timber works to main contractors in construction and civil engineering projects; and offers pre-fabrication solutions. Further, it undertakes metal works and stainless steelwork, structural steel work, steel mold fabrication and design, and engineering solutions and strutting works, as well as design for manufacturing and assembly. It operates in Singapore, the People's Republic of China, Papua New Guinea, Europe, and Malaysia. The company was founded in 1959 and is based in Singapore. Tiong Seng Holdings Limited is a subsidiary of Tiong Seng Shareholdings Pte Ltd.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BRD.SI": {"short_name": "Sapphire", "long_name": "Sapphire Corporation Limited", "summary": "Sapphire Corporation Limited, an investment management and holding company, engages in the engineering, procurement, and construction (EPC) business in Singapore, China, Sri Lanka, Australia, and internationally. The company provides EPC services for railway, highway, municipal, industrial and civil construction, airports, and water conservancy projects. It also offers enterprise management, engineering information, and technology consultation services; construction consulting, projects management consulting, construction cost consulting, construction design, supervision, and bidding agency services; labor service subcontracting for construction industry; and domestic labor dispatching services. In addition, the company provides property management and consulting services; and equipment maintenance and leasing services, as well as constructs electrical networks and other telecommunication channels. The company was formerly known as I.R.E. Corporation Limited and changed its name to Sapphire Corporation Limited in 2005. Sapphire Corporation Limited was incorporated in 1985 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "G7Y1.F": {"short_name": "YONGNAM HLDGS LTD", "long_name": "Yongnam Holdings Limited", "summary": "Yongnam Holdings Limited, an investment holding company, provides engineering and construction services in Singapore and rest of Asia Pacific. The company's Structural Steelworks division engages in engineering coordination, detailing, and fabrication and erection of structural steel. This division is also involved in the design, fabrication, supply, and erection of steel structural frames for long span aircraft hangars, high rise buildings, and commercial and industrial buildings, as well as for infrastructure related developments. Its Specialist Civil Engineering division offers modular strutting systems, including laced universal beams of various cross-sections in modular lengths; single and double waler beams in various lengths, intermediate supporting beams, king posts, and bracing and waler support brackets; and a range of strut to waler joints to cover the used angles. The company's Mechanical Engineering division engages in the installation of mechanical equipment and plants; and supply, fabrication, and installation of mechanical components, as well as in the plant maintenance activities. Yongnam Holdings Limited was founded in 1971 and is based in Singapore.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "HKF.F": {"short_name": "HOCK LIAN SENG HLDGS LTD", "long_name": "Hock Lian Seng Holdings Limited", "summary": "Hock Lian Seng Holdings Limited, an investment holding company, primarily provides civil engineering services to public and private sectors in Singapore. It operates through three segments: Civil Engineering, Properties Development, and Properties Investment. The Civil Engineering segment is involved in the provision of infrastructure construction and civil engineering works for bridges, expressways, tunnels, mass rapid transit, port facilities, water and sewage facilities, and other infrastructure works. Its customers include government and government related bodies. The Properties Development segment develops properties in the residential and industrial sectors. The Properties Investment segment invests in properties for renting and/or for capital appreciation and others. The company is also involved in the rental of workers' dormitory; and building construction activities. Hock Lian Seng Holdings Limited was founded in 1969 and is based in Singapore.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "I07.SI": {"short_name": "ISDN", "long_name": "ISDN Holdings Limited", "summary": "ISDN Holdings Limited provides motion control, other specialized engineering solutions, and industrial computing solutions in Singapore, the People's Republic of China, Hong Kong, Malaysia, and internationally. The company provides the conceptualization, design, development, prototyping, procurement, assembly production, testing, commissioning, installation, software design and customization, and after-sales technical support services for motion control systems; standard modular construction components for use in industrial automation systems; and hardware components, such as industrial locks and hinges, latches, and other fitting technology. It also engages in manufacturing and assembling special purpose motors and gears; and trading and distributing spares, components, and motors. In addition, the company offers industrial computing products and services, such as industrial computer systems customizing and assembling, and software installing services; hardware and automation products; system integration services for industrial computing systems; and software development and integration advisory services. It serves manufacturers and original design manufacturers of products and equipment that have requirements in precision controls in defense, medical, aerospace, oil and gas, robotic, aerospace, medical, textile, information technology and telecommunications, packaging, alternative energy, automotive, semiconductor, special-purpose machine tools, and marine and offshore industries. The company was founded in 1986 and is headquartered in Singapore. ISDN Holdings Limited is a subsidiary of Assetraise Holdings Limited.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "I8D.F": {"short_name": "ISDN HLDGS LTD  SD -,05", "long_name": "ISDN Holdings Limited", "summary": "ISDN Holdings Limited provides motion control, other specialized engineering solutions, and industrial computing solutions in Singapore, the People's Republic of China, Hong Kong, Malaysia, and internationally. The company provides the conceptualization, design, development, prototyping, procurement, assembly production, testing, commissioning, installation, software design and customization, and after-sales technical support services for motion control systems; standard modular construction components for use in industrial automation systems; and hardware components, such as industrial locks and hinges, latches, and other fitting technology. It also engages in manufacturing and assembling special purpose motors and gears; and trading and distributing spares, components, and motors. In addition, the company offers industrial computing products and services, such as industrial computer systems customizing and assembling, and software installing services; hardware and automation products; system integration services for industrial computing systems; and software development and integration advisory services. It serves manufacturers and original design manufacturers of products and equipment that have requirements in precision controls in defense, medical, aerospace, oil and gas, robotic, aerospace, medical, textile, information technology and telecommunications, packaging, alternative energy, automotive, semiconductor, special-purpose machine tools, and marine and offshore industries. The company was founded in 1986 and is headquartered in Singapore. ISDN Holdings Limited is a subsidiary of Assetraise Holdings Limited.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}, "J2T.SI": {"short_name": "Hock Lian Seng", "long_name": "Hock Lian Seng Holdings Limited", "summary": "Hock Lian Seng Holdings Limited, an investment holding company, primarily provides civil engineering services to public and private sectors in Singapore. It operates through three segments: Civil Engineering, Properties Development, and Properties Investment. The Civil Engineering segment is involved in the provision of infrastructure construction and civil engineering works for bridges, expressways, tunnels, mass rapid transit, port facilities, water and sewage facilities, and other infrastructure works. Its customers include government and government related bodies. The Properties Development segment develops properties in the residential and industrial sectors. The Properties Investment segment invests in properties for renting and/or for capital appreciation and others. The company is also involved in the rental of workers' dormitory; and building construction activities. Hock Lian Seng Holdings Limited was founded in 1969 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "KJ5.SI": {"short_name": "BBR", "long_name": "BBR Holdings (S) Ltd", "summary": "BBR Holdings (S) Ltd, an investment holding company, operates in the construction business in Singapore, Malaysia, and internationally. It operates through four segments: Specialised Engineering, General Construction, Property Development, and Green Technology. The General Construction segment engages in the design and building, general building construction, civil and structural engineering, and building conservation and restoration activities. The Specialised Engineering segment is involved in the business of post-tensioning, installation of stay cable systems for structural engineering applications, piling and foundation systems, heavy lifting, bridge design and construction, maintenance, repair, strengthening, retrofitting, and prefabricated pre-finished volumetric construction systems. The Property Development segment develops residential properties, as well as mixed commercial and residential development projects; and provides property management and consultancy services. The Green Technology segment engages in the system integration and distribution of renewable energy; and supply, installation, and leasing of solar panels and grid connected systems. The company also provides healthcare products and services. BBR Holdings (S) Ltd was founded in 1993 and is headquartered in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "L03.SI": {"short_name": "Lian Beng", "long_name": "Lian Beng Group Ltd", "summary": "Lian Beng Group Ltd, an investment holding company, engages in the construction business in Singapore and Australia. It operates in four segments: Construction, Dormitory, Investment Holding, and Property Development. The Construction segment constructs residential, institutional, industrial, and commercial properties; and undertakes civil engineering projects in private and public sectors. This segment also sells construction materials, such as concrete and asphalt; provides engineering services; and leases construction machinery. The Dormitory segment is involved in the rental of dormitory units; and provision of dormitory services. The Investment Holding segment holds investments in quoted and unquoted securities and properties. The Property Development segment develops and sells residential, commercial, and industrial properties, as well as offers property management services. The company also provides engineering, automation, and technical services, as well as management and management consulting services; undertakes general building construction, civil engineering, and electrical works; manufactures and supplies concrete; and sells, rents, and maintains construction machinery and equipment. In addition, it is involved in shipping operations, including chartering of ships; trading steel products; and the provision of training for construction workers. Lian Beng Group Ltd was founded in 1973 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "M1Z.SI": {"short_name": "TEE Intl", "long_name": "TEE International Limited", "summary": "TEE International Limited, an investment holding company, engages in the engineering and infrastructure businesses. The company's Engineering segment provides mechanical and electrical engineering services relating to large-scale and complex engineering, and infrastructure-related projects in the areas of plumbing and sanitary, fire protection, extra low voltage, integrated building management system, and plants and processes, as well as electrical, air conditioning, civil, architecture and interior decoration, and mechanical ventilation. This segment is also involved in constructing commercial, industrial, and institutional buildings; converting existing buildings and facilities for new uses; offering turnkey approaches to the construction of infrastructure; and system development activities, including system definition, deployment, and development. The company's Infrastructure segment offers infrastructure solutions in the areas of water and energy related projects; integrated waste management and wastewater treatment solutions; disinfection services for hotels and other commercial premises; and commercial and industrial real estate management services. TEE International Limited operates in Singapore, Malaysia, Thailand, Vietnam, Hong Kong, Australia, and New Zealand. The company was founded in 1980 and is based in Singapore. TEE International Limited is a subsidiary of Tramore Global Limited.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "MF6.SI": {"short_name": "Mun Siong Engg", "long_name": "Mun Siong Engineering Limited", "summary": "Mun Siong Engineering Limited provides mechanical and electrical engineering services for the oil and gas, process, chemical, and pharmaceutical industries worldwide. The company provides engineering services; and electrical and instrumentation works for the process industry. It also offers construction services that include the design, fabrication, and erection of steel structures/fixed equipment; design, prefabrication, and installation of piping works; installation of static and rotating equipment; construction of storage tanks; design and prefabrication of pre-assembled modules; design and site installation of electrical and instrumentation works; and construction management of plants and refineries. In addition, the company provides maintenance services, such as rotating and static equipment, electrical and instrumentation, column/vessel heat exchangers, storage tank, and plant turnarounds/shutdown maintenance services; new or existing pipeline works; structural modifications, additions, or repairs; valve management, valves change-out, servicing, and certification; divestment of plant equipment; and isolation and replacement of parts and equipment. Further, it offers an array of specialized services, such as customized machining, grit blasting, hydro-drilling, hydro-jetting, mechanical de-coking, protective coatings, re-tubing of heat exchangers, rotating equipment services, and tube shooting, as well as mechanical seal supply, repair, and modification; and scaffolding, insulation, and painting services. The company was founded in 1969 and is headquartered in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "NO4.SI": {"short_name": "Dyna-Mac", "long_name": "Dyna-Mac Holdings Ltd.", "summary": "Dyna-Mac Holdings Limited, an investment holding company, engineers, fabricates, and constructs offshore floating production storage offloading and floating storage offloading topside modules for the oil and gas industries. The company operates through two segments, Module Business and Ad-hoc Projects. It is involved in the engineering, procurement, and construction of specialized process and control equipment modules, including separators, heat exchangers, coolers, pumps, electrical equipment, process piping, control valves and control panels that are installed on steel structural frames and connected to operate as an integrated facility, as well as power generation and accommodation modules. The company also constructs modules for refineries, chemical and pharmaceutical plants, LNG liquefaction plants, LNG terminals, and pharmaceutical plants. In addition, it engages in the offshore construction of hull of floating production units, turret mooring systems, sub-sea pipelines, self-installing platforms, and fixed platforms and jackets. Further, the company is involved in the repair of ships, tankers, and other ocean-going vessels, as well as engineering, fabrication, and construction of onshore plants and other sub-sea products. Additionally, it manufactures and repairs marine engines and ship parts; and offers manpower resources for shipping-related projects. The company operates primarily in Singapore, Malaysia, Australia, Monaco, Switzerland, the United Kingdom, and Americas. Dyna-Mac Holdings Limited was founded in 1990 and is headquartered in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "Q0X.SI": {"short_name": "$ Ley Choon", "long_name": "Ley Choon Group Holdings Limited", "summary": "Ley Choon Group Holdings Limited, an investment holding company, provides underground utilities infrastructure construction and road works services in Singapore, China, and Sri Lanka. It operates through two segments, Pipes and Roads, and Construction Materials. The Pipes and Roads segment constructs and maintains underground utilities infrastructure, including water pipes, NEWater pipes, high-pressure gas pipes, high-voltage power cables, and fibre optic cables; and offers sewer pipeline rehabilitation services. It also provides road and airfield pavement construction and maintenance services comprising supply and laying of graded stone and cement treated base, and milling and laying of asphalt premix. The Construction Materials segment produces asphalt premix, cement bricks, and ready mix concrete, as well as recycled aggregates from construction and demolition waste. Ley Choon Group Holdings Limited serves Singapore government agencies and various companies. The company was incorporated in 1987 and is headquartered in Singapore. Ley Choon Group Holdings Limited is a subsidiary of Zheng Choon Holding Pte Ltd.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "S7P.SI": {"short_name": "Soilbuild Const", "long_name": "Soilbuild Construction Group Ltd.", "summary": "Soilbuild Construction Group Ltd., an investment holding company, engages in the construction business in Singapore and Myanmar. It offers a range of real estate services, which include civil engineering, design and build, construction, turnkey construction, project management consultancy, procurement, and mechanical and electrical installation. The company also provides construction management services; and manufactures construction materials and parts, as well as operates as a building and general contractor. Its projects comprise residential and business space properties. The company was founded in 1976 and is based in Singapore.", "currency": "SGD", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "TUF.DE": {"short_name": "TUFF GROUP AG  O.N.", "long_name": "Tuff Group AG", "summary": "Tuff Group AG engages in the oil and gas, infrastructure, energy and power generation, power engineering, fabrication, and contracting fields in Singapore, Germany, and internationally. It is involved in the engineering, procurement, construction, fabrication, integration, installation, commissioning, and operations of marine, hull/naval, and topsides for floaters and fixed installations, such as floating production storage and offloading units, floating storage and offloading units, mobile offshore production units, floating storage units, floating storage and regasification units, refineries, platform and onshore plants for the oil and gas industry. The company also engages in the engineering, procurement, construction, and general contracting of large public-private partnership projects, including roads/highways/bridges infrastructure, airports, and housing, as well as supply of installations for utilities. In addition, it is involved in the engineering, procurement, and construction of power generation plants in conventional and renewable energies sector, as well as waste to energy projects. Tuff Group AG was founded in 2015 and is headquartered in Singapore.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "GER", "market": "de_market", "country": "Singapore", "city": "Singapore"}, "TUF.F": {"short_name": "TUFF GROUP AG  O.N.", "long_name": "Tuff Group AG", "summary": "Tuff Group AG engages in the oil and gas, infrastructure, energy and power generation, power engineering, fabrication, and contracting fields in Singapore, Germany, and internationally. It is involved in the engineering, procurement, construction, fabrication, integration, installation, commissioning, and operations of marine, hull/naval, and topsides for floaters and fixed installations, such as floating production storage and offloading units, floating storage and offloading units, mobile offshore production units, floating storage units, floating storage and regasification units, refineries, platform and onshore plants for the oil and gas industry. The company also engages in the engineering, procurement, construction, and general contracting of large public-private partnership projects, including roads/highways/bridges infrastructure, airports, and housing, as well as supply of installations for utilities. In addition, it is involved in the engineering, procurement, and construction of power generation plants in conventional and renewable energies sector, as well as waste to energy projects. Tuff Group AG was founded in 2015 and is headquartered in Singapore.", "currency": "EUR", "sector": "Industrials", "industry": "Engineering & Construction", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}}