{
    "40W.SI": {
        "short_name": "$ ZICO Hldgs",
        "long_name": "ZICO Holdings Inc.",
        "summary": "ZICO Holdings Inc., an investment holding company, provides multidisciplinary professional services in Malaysia, Singapore, Indonesia, Hong Kong, Thailand, the United Kingdom, the United States, and the United Arab Emirates. The company operates through two segments, Advisory and Transactional Services; and Management, Support Services and Licensing Services. The Advisory and Transactional Services segment offers legal, Shariah advisory, trust, incorporation and corporate secretarial, investor, intellectual property, wealth planning and multi-asset management, corporate finance advisory, insourcing and consultancy, business and governmental issues advisory, and immigration services. The Management, Support Services and Licensing Services segment offers regional management services, such as strategic advisory, market intelligence, business relations, public sector relations, and risk management; and business support services, including information technology, human resource, knowledge management and training, and business development and corporate communications, as well as accounting, finance, and budgeting. This segment also licenses the ZICO, ZICOlaw, and ZICOlaw Trusted Business Advisor trademarks. The company also provides fiduciary and custody; tax administration, payroll, and accounting support services; insourcing and outsourcing; and capital markets services. It serves governments and government-linked companies, law firms, private and public listed companies, multinational corporations, and high net worth individuals. The company was formerly known as ZICOlaw Holdings Inc. and changed its name to ZICO Holdings Inc. in April 2014. ZICO Holdings Inc. was incorporated in 2010 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048544",
        "website": "http://www.zicoholdings.com",
        "market_cap": "Small Cap"
    },
    "A33.SI": {
        "short_name": "Blumont",
        "long_name": "Blumont Group Ltd.",
        "summary": "Blumont Group Ltd., an investment holding company, provides contract sterilization and polymerization services in Singapore, Malaysia, and Indonesia. It operates through three segments: Investment Holding, Sterilisation, and Property. The Investment Holding segment invests in transferable securities, such as marketable shares, warrants, debentures, etc. The Sterilisation segment offers contract sterilization and polymerization services to the food packaging, medical devices, cosmetic raw materials, and consumers products. The Property segment develops properties for sale, as well as holds properties for rental and related income. The company was incorporated in 1993 and is based in Singapore. Blumont Group Ltd. is a subsidiary of Ultimate Horizon Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "159545",
        "website": "http://www.blumontgroup.com",
        "market_cap": "Small Cap"
    },
    "BQC.SI": {
        "short_name": "A-Smart",
        "long_name": "A-Smart Holdings Ltd.",
        "summary": "A-Smart Holdings Ltd., an investment holding company, provides various print management services in Singapore and internationally. The company operates through Print Media, Property, Smart Technologies, and Corporate and Others segments. It offers a range of services, including financial printing, conceptualization, design, copywriting, translation, typesetting, color proofing, printing, post-press packaging, distribution, and delivery. The company prints financial research reports, annual reports, asset management reports, initial public offering prospectuses, corporate brochures, year books, magazines, and trade directories, as well as other commercial publications, collaterals, and corporate gifts/premiums. It also organizes media events; and provides publishing services. In addition, the company develops, sells, and redistributes smart information technology solutions, gadgets, and software and hardware products; undertakes multimedia and pre-press works; and develops and invests in real estate properties. Further, it is involved in selling, leasing, servicing, and maintaining green technology systems. The company was formerly known as Xpress Holdings Ltd and changed its name to A-Smart Holdings Ltd. in October 2016. A-Smart Holdings Ltd. was founded in 1986 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "534167",
        "website": "http://www.a-smart.sg",
        "market_cap": "Small Cap"
    },
    "EB7.SI": {
        "short_name": "KTL Global^",
        "long_name": "KTL Global Limited",
        "summary": "KTL Global Limited, together with its subsidiaries, operates in the branding, operation, and procurement (BOP) service industry. The company provides branding management, operational support, and central procurement services, as well as human resource recruitment, customized training, and development services to the downstream operators that supply to hospitals, clinics, and pharmacies in various provinces of the People's Republic of China with automatic vending kiosks (AVK) dispensing medical consumables and supplements. It is also involved in the inspection and certification of lifting equipment and certification of wire ropes; developing and advancing the technology of synthetics material for use in the manufacture of heavy lift synthetics sling; and the property investment ctivites. The company was incorporated in 2007 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049483",
        "website": "http://www.ktl.group",
        "market_cap": "Small Cap"
    },
    "V2Y.SI": {
        "short_name": "$ V2Y Corp",
        "long_name": "V2Y Corporation Ltd.",
        "summary": "V2Y Corporation Ltd., an ecommerce company, provides end-to-end commerce enablement and fulfillment solutions for the body, beauty, and baby sectors in the Southeast Asia. It operates in three segments: E-Commerce, E-Logistics, and Insurtech. The company offers solutions through cloud-based platform that leverages on technology, such as cloud computing, big data analytics, and artificial intelligence. Its solutions include various aspects of the e-commerce value chain covering technology, online store operations, content and channel management, digital marketing, customer service, warehousing, and fulfilment. The company also provides third party administration for extended warranty and accidental damage protection services, as well as after sales support and call center services for customers in the computer, consumer electronics, and communication sectors. In addition, it is involved in the wholesale of other household goods; and provision of value added logistic, and other information technology and computer services. The company was formerly known as Synagie Corporation Ltd. and changed its name to V2Y Corporation Ltd. in November 2020. V2Y Corporation Ltd. was founded in 2014 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "577178",
        "website": "http://synagie.com",
        "market_cap": "Small Cap"
    },
    "V3M.SI": {
        "short_name": "$ Metech Intl",
        "long_name": "Metech International Limited",
        "summary": "Metech International Limited, an investment holding company, engages in the supply-chain management and services business in the People's Republic of China. The company is involved in the general wholesale trading of copper cathode and other products, as well as recycling technology, operations, and procurement management services. It also provides circular economy marketing services; engineering design and consultancy services in energy management and clean energy systems; and recycling and supply chain management and advisory services. The company was formerly known as Centillion Environment & Recycling Limited and changed its name to Metech International Limited in May 2012. Metech International Limited was incorporated in 1992 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "637787",
        "website": "http://www.metechinternational.com",
        "market_cap": "Small Cap"
    }
}