{
    "571.SI": {
        "short_name": "$ IP Softcom",
        "long_name": "International Press Softcom Limited",
        "summary": "International Press Softcom Limited, together with its subsidiaries, provides supply chain solutions, print and media products, and packaging and software replication solutions. The company's Supply Chain Management segment provides supply chain solutions; and print and media products, including material procurement, inventory management, logistics management, software replication, and order fulfillment. Its Computer Systems Integration and Consultation Services segment focuses on mobile contents, which include digital product shelf displays and other related activities. The company also assembles software packages and peripherals, printed materials, compact discs (CD), and diskettes; and manufactures and duplicates diskettes and CDs, as well as distributes and sells computer related products. In addition, it manufactures and distributes electronic and telecommunication goods; and computer software, hardware, and peripherals; packaging boxes; and paper boxes and plastic products, as well as provides other related technical, consulting, and aftersales services. Further, the company sells electronic products, printers and related accessories, paper products, packing materials, office appliances, hardware tools, and domestic appliances; imports, exports, and sells electronic components and equipment; and provides supporting services. Additionally, it establishes, purchases, and carries general merchants business; and offers offset printing and packaging services. The company operates primarily in Singapore, Malaysia, India, Australia, Vietnam, and the People's Republic of China. The company was founded in 1968 and is headquartered in Singapore. International Press Softcom Limited is a subsidiary of International Press Holdings Pte Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "A33.SI": {
        "short_name": "Blumont",
        "long_name": "Blumont Group Ltd.",
        "summary": "Blumont Group Ltd., an investment holding company, provides contract sterilization and polymerization services in Singapore, Malaysia, and Indonesia. It operates through three segments: Investment Holding, Sterilisation, and Property. The Investment Holding segment invests in transferable securities, such as marketable shares, warrants, debentures, etc. The Sterilisation segment offers contract sterilization and polymerization services to the food packaging, medical devices, cosmetic raw materials, and consumers products. The Property segment develops properties for sale, as well as holds properties for rental and related income. The company was incorporated in 1993 and is based in Singapore. Blumont Group Ltd. is a subsidiary of Ultimate Horizon Pte. Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BQC.SI": {
        "short_name": "A-Smart",
        "long_name": "A-Smart Holdings Ltd.",
        "summary": "A-Smart Holdings Ltd., an investment holding company, provides various print management services in Singapore and internationally. The company operates through Print Media, Property, Smart Technologies, and Corporate and Others segments. It offers a range of services, including financial printing, conceptualization, design, copywriting, translation, typesetting, color proofing, printing, post-press packaging, distribution, and delivery. The company prints financial research reports, annual reports, asset management reports, initial public offering prospectuses, corporate brochures, year books, magazines, and trade directories, as well as other commercial publications, collaterals, and corporate gifts/premiums. It also organizes media events; and provides publishing services. In addition, the company develops, sells, and redistributes smart information technology solutions, gadgets, and software and hardware products; undertakes multimedia and pre-press works; and develops and invests in real estate properties. Further, it is involved in selling, leasing, servicing, and maintaining green technology systems. The company was formerly known as Xpress Holdings Ltd and changed its name to A-Smart Holdings Ltd. in October 2016. A-Smart Holdings Ltd. was founded in 1986 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "EB7.SI": {
        "short_name": "KTL Global^",
        "long_name": "KTL Global Limited",
        "summary": "KTL Global Limited, together with its subsidiaries, operates in the branding, operation, and procurement (BOP) service industry. The company provides branding management, operational support, and central procurement services, as well as human resource recruitment, customized training, and development services to the downstream operators that supply to hospitals, clinics, and pharmacies in various provinces of the People's Republic of China with automatic vending kiosks (AVK) dispensing medical consumables and supplements. It is also involved in the inspection and certification of lifting equipment and certification of wire ropes; developing and advancing the technology of synthetics material for use in the manufacture of heavy lift synthetics sling; and the property investment ctivites. The company was incorporated in 2007 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "V3M.SI": {
        "short_name": "$ Metech Intl",
        "long_name": "Metech International Limited",
        "summary": "Metech International Limited, an investment holding company, engages in the supply-chain management and services business in the People's Republic of China. The company is involved in the general wholesale trading of copper cathode and other products, as well as recycling technology, operations, and procurement management services. It also provides circular economy marketing services; engineering design and consultancy services in energy management and clean energy systems; and recycling and supply chain management and advisory services. The company was formerly known as Centillion Environment & Recycling Limited and changed its name to Metech International Limited in May 2012. Metech International Limited was incorporated in 1992 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}