{
    "8462.HK": {
        "short_name": "OMNIBRIDGE HLDG",
        "long_name": "Omnibridge Holdings Limited",
        "summary": "Omnibridge Holdings Limited, an investment holding company, provides human resources outsourcing and recruitment services in Singapore and Hong Kong. The company sources and employs suitable candidates that match the job descriptions specified by its clients; and human resources recruitment services to employers seeking suitable candidates for positions at various levels, including administrative, executive, managerial, and professional. It also offers other human resources support services, such as referral and parking services. The company serves public and private sector clients, including Singapore government agencies and non-profit organizations. Omnibridge Holdings Limited was founded in 2005 and is headquartered in Singapore. Omnibridge Holdings Limited is a subsidiary of Omnipartners Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "CHZ.SI": {
        "short_name": "HRnetGroup",
        "long_name": "HRnetGroup Limited",
        "summary": "HRnetGroup Limited, an investment holding company, engages in the recruitment and staffing business in Singapore, Hong Kong, Taiwan, the People's Republic of China, Japan, South Korea, Malaysia, Thailand, and Indonesia. The company operates through Professional Recruitment, Flexible Staffing, and Others segments. It offers personnel recruitment and human resource related services; employment, recruitment, and personnel placement agency services; executive search services; permanent recruitment, payroll, and temporary and contracted staffing services; and executive and management recruitment services, as well as management consultancy services. The company serves financial institutions, information technology and telecommunications, retail and consumer, healthcare life science, manufacturing, insurance, logistics, services, education, and other industries. It provides its services under the HRnet One, Recruit Express, PeopleSearch, SearchAsia, RecruitFirst, PeopleFirst, RecruitLegal, YesPay!, Performance Consulting, HRnetRimbun, REForce, CENTER Point PERSONNEL, and Young Talent brands. The company was founded in 1992 and is headquartered in Singapore. HRnetGroup Limited is a subsidiary of SIMCO Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}