{
    "43Q.SI": {
        "short_name": "$ Advancer Global",
        "long_name": "Advancer Global Limited",
        "summary": "Advancer Global Limited, an investment holding company, provides workforce solutions and facilities management services in Singapore. It operates through three segments: Employment Services Business, Building Management Business, and Security Services Business. The Employment Services Business segment offers services for the sourcing, employment, and training of foreign domestic workers for households, as well as foreign workers, corporates, and organizations. The Building Management Business segment provides integrated building facility management services, including property consultancy, property and facilities management, property valuation, investment sales, cleaning and stewarding, waste management, landscape, pest control, and fumigation services to hospitals, hotels, schools, residential, commercial, industrial, and other properties. The Security Services Business segment offers manpower and technology for security solutions and services to commercial, industrial, and residential properties; and security escort services, as well as remote surveillance and security consultancy services, such as crisis management. The company also engages in the business and management consultancy, maid agency, and real estate agency activities; plumbing, heating, and air-conditioning businesses; provision of landscape planting, care, and maintenance services; wholesale of electronic components; and data analytics, processing, and related activities. Advancer Global Limited was incorporated in 2016 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "600135",
        "website": "http://advancer.sg",
        "market_cap": "Nano Cap"
    },
    "8293.HK": {
        "short_name": "SINGASIA HLDG",
        "long_name": "SingAsia Holdings Limited",
        "summary": "SingAsia Holdings Limited, an investment holding company, provides workforce solutions in Singapore. The company offers manpower outsourcing, recruitment, and training services, as well as HR consulting services. The company also provides cleaning services. It offers workforce solutions for the hotel and resort, retail, and food and beverage sectors; educational institutions; event organizers; and other industries. SingAsia Holdings Limited was founded in 2004 and is headquartered in Singapore. SingAsia Holdings Limited operates as a subsidiary of Centrex Treasure Holdings Limited.",
        "currency": "HKD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "059432",
        "website": "http://www.singasia.com.sg",
        "market_cap": "Nano Cap"
    },
    "851.F": {
        "short_name": "ADVANCER GLOBAL LTD",
        "long_name": "Advancer Global Limited",
        "summary": "Advancer Global Limited, an investment holding company, provides workforce solutions and facilities management services in Singapore. It operates through three segments: Employment Services Business, Building Management Business, and Security Services Business. The Employment Services Business segment offers services for the sourcing, employment, and training of foreign domestic workers for households, as well as foreign workers, corporates, and organizations. The Building Management Business segment provides integrated building facility management services, including property consultancy, property and facilities management, property valuation, investment sales, cleaning and stewarding, waste management, landscape, pest control, and fumigation services to hospitals, hotels, schools, residential, commercial, industrial, and other properties. The Security Services Business segment offers manpower and technology for security solutions and services to commercial, industrial, and residential properties; and security escort services, as well as remote surveillance and security consultancy services, such as crisis management. The company also engages in the business and management consultancy, maid agency, and real estate agency activities; plumbing, heating, and air-conditioning businesses; provision of landscape planting, care, and maintenance services; wholesale of electronic components; and data analytics, processing, and related activities. Advancer Global Limited was incorporated in 2016 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "600135",
        "website": "http://advancer.sg",
        "market_cap": "Nano Cap"
    },
    "CHZ.SI": {
        "short_name": "HRnetGroup",
        "long_name": "HRnetGroup Limited",
        "summary": "HRnetGroup Limited, an investment holding company, engages in the recruitment and staffing business in Singapore, Hong Kong, Taiwan, the People's Republic of China, Japan, South Korea, Malaysia, Thailand, and Indonesia. The company operates through Professional Recruitment, Flexible Staffing, and Others segments. It offers personnel recruitment and human resource related services; employment, recruitment, and personnel placement agency services; executive search services; permanent recruitment, payroll, and temporary and contracted staffing services; and executive and management recruitment services, as well as management consultancy services. The company serves financial institutions, information technology and telecommunications, retail and consumer, healthcare life science, manufacturing, insurance, logistics, services, education, and other industries. It provides its services under the HRnet One, Recruit Express, PeopleSearch, SearchAsia, RecruitFirst, PeopleFirst, RecruitLegal, YesPay!, Performance Consulting, HRnetRimbun, REForce, CENTER Point PERSONNEL, and Young Talent brands. The company was founded in 1992 and is headquartered in Singapore. HRnetGroup Limited is a subsidiary of SIMCO Ltd.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "238873",
        "website": "http://www.hrnetgroup.com",
        "market_cap": "Small Cap"
    }
}