{
    "564.SI": {
        "short_name": "Spindex Ind",
        "long_name": "Spindex Industries Limited",
        "summary": "Spindex Industries Limited, together with its subsidiaries, engages in the manufacture, import, export, and trade of mechanical, electrical, electronic, and precision machine parts, as well as other engineering materials. It offers printer shaft products, such as inkjet printer, laser printer, digital scanner, and 3D and craft printer shafts; steering shaft systems, throttle shafts, powertrain and transmission OCVs, and sensor systems for automotive applications; and industrial and power tools for a range of products, such as industrial outdoor transmission products, industrial impact hammers, industrial drills, and industrial angle grinders. The company also provides agitator shafts, input shafts, spin tubes, steam shafts, motor shafts, and eccentric pins; and components for washing machine design, assembly, and in line testing. It has operations in the People's Republic of China, Singapore and other ASEAN countries, the United States, Europe, and internationally. The company was founded in 1981 and is headquartered in Singapore. Spindex Industries Limited is a subsidiary of Uob Kay Hian Private Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "609964",
        "website": "http://www.spindex.com.sg",
        "market_cap": 136130688
    },
    "BJW.SI": {
        "short_name": "Shinvest",
        "long_name": "Shinvest Holding Ltd.",
        "summary": "Shinvest Holding Ltd., an investment holding company, imports, export, and markets building materials in Singapore, Indonesia, Malaysia, China, and internationally. It offers fasteners and hardware. The company operates through hardware distributors, stockists, and retail hardware stores, as well as retail shops. It serves manufacturing sectors, including machine manufacturing and assembly, automation assembly, electronic assembly, metal stamping, construction building, and shipyard and aerospace aviation industries; and distributors and traders. The company was formerly known as Eastgate Technology Ltd. and changed its name to Shinvest Holding Ltd. in October 2015. Shinvest Holding Ltd. was incorporated in 1989 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628881",
        "website": "http://www.shinvest.com.sg",
        "market_cap": 71772480
    }
}