{
    "1E3.SI": {
        "short_name": "$ Sanli Env",
        "long_name": "Sanli Environmental Limited",
        "summary": "Sanli Environmental Limited operates as an environmental engineering company in the field of water and waste management primarily in Singapore. The company operates through two segments, Engineering, Procurement and Construction (EPC); and Operations and Maintenance (O&M). The EPC segment provides various services in the field of water and waste management, including process upgrading of existing water treatment plants and pumping station capacities, replacement of aged mechanical and electrical equipment, and designing and building various treatment process systems. This segment also offers engineering solutions and services for the treatment of raw water and used water, and refuse in incineration plants. The O&M segment provides operations and maintenance services related to water and waste management; and corrective and preventive maintenance services for customers' operations. The company was incorporated in 2017 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628845",
        "website": "http://www.sanli.com.sg",
        "market_cap": 22298612
    },
    "567.SI": {
        "short_name": "$ Colex",
        "long_name": "Colex Holdings Limited",
        "summary": "Colex Holdings Limited, an investment holding company, provides waste management services in Singapore. It operates in Waste Disposal and Contract Cleaning segments. The company primarily engages in the provision of waste disposal services for domestic, commercial, and industrial waste; the sale and rental of equipment; and the repair of waste compactors. It also offers contract cleaning services for commercial, industrial, and residential buildings. In addition, it offers recycling, material recovery, refuse disposal, and general cleaning services. Colex Holdings Limited provides its waste disposal and recycling services for various clients, including commercial offices, shopping complexes, food courts, cineplexes, residential buildings, and warehouses. The company was incorporated in 1971 and is headquartered in Singapore. Colex Holdings Limited is a subsidiary of Bonvests Holdings Limited.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "637083",
        "website": "http://www.colex.com.sg",
        "market_cap": 28492446
    },
    "5CT.SI": {
        "short_name": "$ EcoWise",
        "long_name": "ecoWise Holdings Limited",
        "summary": "ecoWise Holdings Limited, an investment holding company, provides resource recovery, renewable energy, and integrated environmental solutions in Singapore, Malaysia, Australia, the People's Republic of China, and internationally. Its Renewable Energy segment designs, builds, and operates biomass co-generation systems; generates and sells power; and provides services related to the applications of heat. The company's Resource Recovery segment is involved in processing, recycling, and repurposing waste and salvageable materials into various products for industrial applications, such as compost and retreaded tires. Its Integrated Environmental Management Solutions segment offers resource management and integrated environmental engineering solutions for industrial waste and energy management comprising designing, optimizing, engineering, procuring, fabricating, commissioning, managing, and maintaining waste and energy management facilities. The company also provides general waste management services; manufactures, processes, procures, deals in, and trades in rubberized related goods; researches and develops environmental and clean technologies; and develops and commercializes ecology solutions. In addition, it offers environmental solutions consultancy services; and project and investment consultancy, management services; and generates and sale electricity and heat. Further, the company engages in trading of new and retread tires, and related rubberized products; producing, trading, and consulting related to biomass products; and processing and recycling horticultural and other waste. ecoWise Holdings Limited was founded in 1979 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "149544",
        "website": "http://www.ecowise.com.sg",
        "market_cap": 76856528
    },
    "BLA.SI": {
        "short_name": "Union Steel",
        "long_name": "Union Steel Holdings Limited",
        "summary": "Union Steel Holdings Limited, an investment holding company, primarily operates as a metal recycling company in Singapore, Malaysia, Indonesia, India, Bangladesh, Korea, Vietnam, China, Australia, and internationally. It operates through Metals, Scaffolding, Engineering, and Others segments. The company is involved in the collection, recycling, and trading of ferrous and non-ferrous scrap materials; and leasing of steel plates, sheet piles, test piles, and beams to companies in the construction and engineering industries. It also trades in steel reinforcement bars, as well as provides cut-and-bend services for reinforcement bars and rods; operates as a collection center for ferrous and nonferrous scrap metals; offers scaffolding and related consultancy services; and sells and rents scaffolding materials, as well as supplies skilled workers in the erection and dismantling of scaffolds. In addition, the company undertakes engineering works for trailer mount units for the oil and gas industry; manufactures motor vehicle bodies, trailers, and semi-trailer vehicles; manufactures, supplies, and leases winches, cranes, and hydraulic power units; sells and rents marine deck equipment; and offers equipment and components for load handling, including truck-mounted cranes, tailgates, and rubbish compactors. Further, it rents and holds properties; collects and manages waste; and operates an online portal for sale of industrial equipment. Union Steel Holdings Limited was founded in 1984 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628474",
        "website": "http://www.unionsteel.com.sg",
        "market_cap": 23626860
    },
    "L23.SI": {
        "short_name": "Enviro-Hub",
        "long_name": "Enviro-Hub Holdings Ltd.",
        "summary": "Enviro-Hub Holdings Ltd., an investment holding company, engages in the property investments and management businesses in Singapore, Hong Kong, China, Malaysia, Europe, and internationally. Its Property Investments and Management segment engages in the investment and rental of properties. The company's Trading, Recycling and Refining of e-Waste/Metals segment engages in the trading, recycling, and refining of electronic waste and metals comprising the recycling, extraction, and refining of platinum group metals and copper. Its Piling Contracts, Construction, Rental and Servicing of Machinery segment is involved in the provision of piling services, as well as building and construction related engineering and technical services; and rental and sale of cranes and heavy machinery for the construction industry. In addition, the company invests in and manages commercial and industrial properties; trades in ferrous and non-ferrous metals; and sells, rents, and services engineering hardware, as well as conversion of plastics to fuel. The company was formerly known as Leong Hin Holdings Ltd. and changed its name to Enviro-Hub Holdings Ltd. in August 2005. Enviro-Hub Holdings Ltd. was incorporated in 1998 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629519",
        "website": "http://www.enviro-hub.com",
        "market_cap": 119088000
    },
    "NEX.SI": {
        "short_name": "$ Reclaims Global",
        "long_name": "Reclaims Global Limited",
        "summary": "Reclaims Global Limited operates as an eco-friendly integrated service provider in the construction industry in Singapore. The company operates through three segments: Recycling, Excavation Services, and Logistics and Leasing. The Recycling segment focuses on the reclaiming and recycling of construction and demolition of waste for sale as recycled building materials. This segments recycled products include recycled concrete aggregates, such as recycled graded stone, recycled quarry dust, and 20-mm recycled aggregate used for foundations and roads, and ready-mixed concrete production. The Excavation Services segment offers earth moving, mass excavation, deep basement excavation, foundation, pile cap excavation, and land reshaping services for contractors who are involved in public sector projects and works. The Logistics and Leasing segment provides material transportation and disposal services using its fleet of tipper trucks. This segment also leases machinery and equipment, such as excavators, articulated dump trucks, mobile jaw crushers, tipper trucks, and mobile screeners. The company was founded in 2009 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "637114",
        "website": "http://www.reclaims-enterprise.com",
        "market_cap": 31440000
    }
}