{
    "8QM.F": {
        "short_name": "APATOR B  ZY 0,10",
        "long_name": "Apator S.A.",
        "summary": "Apator S.A. manufactures and sells metering and switchgear equipment in Poland and internationally. Its products include electricity meters, such as smart, electronic, prepayment, and induction meters, as well as smart grid systems comprising remote data read out and prepayment systems, and analysis of metering data; and water meters, volume parts for heat meters, heat meters, heating cost allocators, remote reading systems, installation fittings, test and measurement products, archives, and other products. The company also offers residential, commercial, and smart gas meters; radio telemetry modules; switchgear systems, such as switch disconnectors, fuse rails, surge arresters, accessories, and 4G cam switches, as well as APASYS 60, a modular designed current distribution system; and mining equipment. In addition, it provides IT solutions in the areas of grid assets, utilization of power grid assets, grid assets development, customer service, analyses and reports, process and document management, customer portals, and connectors; and IT services, such as grid passporting, integration, outsourcing, implementation, training, and consulting. Further, the company offers power and distribution engineering equipment, drives and control engineering equipment, AC and DC drives, softstarts, and motors and gears, as well as MRO and customer training services. Additionally, it provides research and development services in technical sciences; manufacture instruments and appliances for measuring, checking, navigating and other uses; thermometers and thermostats; and IT system applications. Furthermore, the company engages in the publishing, printing, and reproduction of recorded media; sale of prepayment electricity and gas meters; and distribution of water and heat meters. It also offers controlgears, electricity, electrical equipment, lifting equipment, pumps, and compressors; and manufactures reading and transmitting data devices. Apator S.A. is based in Torun, Poland.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductor Equipment & Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Torun",
        "zipcode": "87-100",
        "website": "http://www.apator.com",
        "market_cap": "Micro Cap"
    }
}