{
    "BANB.SW": {
        "short_name": "BACHEM N -B-",
        "long_name": "Bachem Holding AG",
        "summary": "Bachem Holding AG, a technology-based biochemicals company, provides services to the pharmaceutical and biotechnology industries primarily in Switzerland, the United States, the United Kingdom, Germany, Austria, and Japan. It develops and manufactures peptide and oligonucleotides as active pharmaceutical ingredients (APIs), as well as biochemicals for research purposes. The company offers research products, which include peptides, amino acid derivatives, and biochemicals for peptide research; and custom synthesis services. It also provides API products comprising generic APIs used in the fields of cancer, diabetes, obesity, fertility, and others; and peptides for new chemical entities. In addition, the company offers oligonucleotide-based APIs, as well as customer support services. Bachem Holding AG was founded in 1971 and is headquartered in Bubendorf, Switzerland. Bachem Holding AG is a subsidiary of Ingro Finanz AG.",
        "currency": "CHF",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Bubendorf"
    },
    "DESN.SW": {
        "short_name": "DOTTIKON ES N",
        "long_name": "Dottikon Es Holding AG",
        "summary": "Dottikon Es Holding AG manufactures and sells performance chemicals, intermediates, and active pharmaceutical ingredients for the chemical and pharmaceutical industries in Switzerland and internationally. The company's chemicals and intermediates include amines, anilines, azaindoles, benzimidazoles, benzoic acid derivatives, benzyl compounds, boron building blocks, chiral compounds, cyclohexane derivatives, cyclopropyl building blocks, indazoles, indoles, N-heterocycles, nitrate esters, nitroaromatic compounds, O-heterocycles, phenols and anisoles, and pyridine building blocks. It also provides Dottisol, an isosorbide dimethyl ether for application as a solubility enhancer in cosmetic, and pharma and agro products, as well as a performance additive in various industries. In addition, the company engages in the recycling and waste treatment activities; and provision of consulting services for investment companies. Dottikon Es Holding AG was founded in 1913 and is headquartered in Dottikon, Switzerland. Dottikon Es Holding AG is a subsidiary of EVOLMA Holding AG.",
        "currency": "CHF",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "city": "Dottikon"
    },
    "DTI0.F": {
        "short_name": null,
        "long_name": "Dottikon Es Holding AG",
        "summary": "Dottikon Es Holding AG manufactures and sells performance chemicals, intermediates, and active pharmaceutical ingredients for the chemical and pharmaceutical industries in Switzerland and internationally. The company's chemicals and intermediates include amines, anilines, azaindoles, benzimidazoles, benzoic acid derivatives, benzyl compounds, boron building blocks, chiral compounds, cyclohexane derivatives, cyclopropyl building blocks, indazoles, indoles, N-heterocycles, nitrate esters, nitroaromatic compounds, O-heterocycles, phenols and anisoles, and pyridine building blocks. It also provides Dottisol, an isosorbide dimethyl ether for application as a solubility enhancer in cosmetic, and pharma and agro products, as well as a performance additive in various industries. In addition, the company engages in the recycling and waste treatment activities; and provision of consulting services for investment companies. Dottikon Es Holding AG was founded in 1913 and is headquartered in Dottikon, Switzerland. Dottikon Es Holding AG is a subsidiary of EVOLMA Holding AG.",
        "currency": "None",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Switzerland",
        "city": "Dottikon"
    }
}