{"SST.AX": {"short_name": "STEAMSHIP FPO 50T", "long_name": "Steamships Trading Company Limited", "summary": "Steamships Trading Company Limited engages in the shipping, transport, property, manufacturing, and hotel businesses in Papua New Guinea. It operates through three segments: Hotels and Property, Logistics, and Commercial and Investment. It offers scheduled cargo liner services to manufacturers, wholesalers, and liner carriers; depot services comprising equipment hire, warehousing, and yard storage; short and long term vessel charters specialized in shallow water river shipping; and intermodal logistics solutions linked to land based services, such as road transport, cargo handling, storage, agency, customs clearance, lay down areas, and warehousing. It also provides harbor, coastal, and ocean towage, as well as mooring services; and ancillary marine services, such as life raft sales, rental, servicing, commercial diving, subsea pipeline inspections, PLEM hook up and release, and pollution prevention and oil spill response services. In addition, it operates a fleet of prime movers, heavy and light trucks, forklifts, and reach stackers for the transport of bulk fuel, containerized cargoes, and sawdust and break-bulk cargoes; offers customs cargo clearance service in Lae and Port Moresby; and provides project solutions for the mining, oil and gas, and commercial sectors. Further, it operates nine hotel, and residence and apartment properties with 592 hotel rooms, 127 apartments, and 138 residences, which offer serviced hotel rooms and apartments, and food and beverage outlets, as well as recreation and meeting, conference, and banqueting facilities; and develops and holds residential, commercial, retail, and industrial properties. Additionally, is involved in the commercial and insurance activities. It operates a fleet of 13 coastal vessels; and 13 tugs and 10 associated support vessels. The company was incorporated in 1918 and is headquartered in Port Moresby, Papua New Guinea. Steamships Trading Company Limited is a subsidiary of John Swire & Sons (PNG) Limited.", "currency": "AUD", "sector": "Industrials", "industry": "Integrated Freight & Logistics", "exchange": "ASX", "market": "au_market", "country": "Papua New Guinea", "city": "Port Moresby"}}