{
    "DESA.MC": {
        "short_name": "DESARROLLOS ESPECIALES DE SISTE",
        "long_name": "Desarrollos Especiales de Sistemas de Anclaje, S.A.",
        "summary": "Desarrollos Especiales de Sistemas de Anclaje, S.A. manufactures and sells anchors and fastenings primarily in Spain. It offers metallic, chemical, and plastic anchors; screws, and threaded sockets and spouts; rivets, and shank and threaded rivets; power drive, gad drive, tips, sockets, and spikes; and chemical solutions, such as foam and silicon applicator guns, putties, MS polymer, and adhesives. The company also provides installation systems, which include rails and accessories, and radiator and WC supports; clamps, nylon cable ties, and perforated tapes; and tying system in trusses. Its products are used for construction and industrial supplies, building materials, and plates, as well as air conditioning, plumbing, and electricity warehouses.It offers its products under Desa, Construsim, Simes, Agrifast, and Salki brand names. Desarrollos Especiales de Sistemas de Anclaje, S.A. was founded in 1956 and is based in Barcelona, Spain.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "city": "Barcelona"
    },
    "NBI.MC": {
        "short_name": "NBI BEARINGS EUROPE, S.A",
        "long_name": "NBI Bearings Europe, S.A.",
        "summary": "NBI Bearings Europe, S.A. engages in the design, production, and sale of bearings worldwide. It offers ball bearings, cylindrical roller bearings, tapered roller bearings, spherical roller bearings, needle roller bearings, support rollers, cam followers, cylindrical roller thrust bearings, and spherical roller thrust bearings. The company's products have applications in the cranes and off shore, gear boxes and drives, pulps and grabs, pulp and paper machinery, steel and iron industries, tubular stranders, agricultural machinery, pulleys and sheare blocks, and crushing and schreeding industries. NBI Bearings Europe, S.A. is headquartered in Okondo, Spain.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MCE",
        "market": "es_market",
        "country": "Spain",
        "city": "Okondo"
    }
}