{
    "1H4.SI": {
        "short_name": "$ Memories",
        "long_name": "Memories Group Limited",
        "summary": "Memories Group Limited, together with its subsidiaries, operates as a tourism company in Myanmar. It operates through three segments: Experiences, Services, and Hotels. The Experiences segment engages in the full service commercial hot air balloon business under the Balloons over Bagan brand in Bagan and Inle Lake area. It also provides cruising services on luxury yacht in the Mergui Archipelago in southern Myanmar under the Burma Boating brand. The Services segment engages in the provision of travel and destination management services, including designing and preparing customized itineraries for tour packages; organizing various excursions, activities, and cultural experiences; managing tour logistics, such as recommending and booking of accommodations, restaurants, and transportation; organizing meetings, incentives, travel, conventions, and exhibition events; and provision of travel guides of various languages in Myanmar. It provides its services under the Asia Holiday brand. The Hotels segment owns and operates hotels, resorts, and lodges at various tourist and business destinations. It operates hotels under the Awei, Keinnara, and Suggati brands; lodges under the Pun Hlaing, Hpa An, and Loikaw brands; and resorts under the Kayah brand, as well as an integrated tourism platform. The company also develops and manages hotels and related hospitality businesses; operates restaurant and related services; and provides tour operator and travel agency services. Memories Group Limited is headquartered in Yangon, Myanmar.",
        "currency": "SGD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Myanmar",
        "city": "Yangon"
    },
    "22M.SG": {
        "short_name": "Myanmar Investments Intl Ltd. R",
        "long_name": "Myanmar Investments International Limited",
        "summary": "Myanmar Investments International Limited is a venture capital and private equity firm specializing in investments in start-up, expansion capital, and buyouts stages. The firm prefers to invest in equity, quasi-equity or debt instruments. Its investments are classified into core holdings and financial holdings. It does not focus on sectors like large real estate development, infrastructure development and exploration and production of natural resources. The firm prefers to invest in companies in hard infrastructure including telecoms, power, waste water treatment utilities, and transportation; soft infrastructure including financial services, education, and healthcare; manufacturing; tourism; agriculture; consumer goods and services; logistics; distribution, telecommunications, entertainment, business to business, and retailing sectors. It invests in companies, businesses, or assets based in Myanmar or the companies with business exposure to Myanmar. The firm invests between $5 million and $25 million in its portfolio companies and may invest outside this range in exceptional cases. It may acquire majority or minority shareholdings in portfolio companies. The firm may also invest through contracts that grant an economic interest in an asset. It may also invest in greenfield businesses. It seeks to participate in the management process through board representation in the portfolio companies. The firm would continue to hold the investments in core holdings and would seek to monetize the investment within five to seven years in financial holdings. It prefers to exit its investments through listings in Myanmar or on suitable overseas stock exchanges, trade sales or share swaps. Myanmar Investments International Limited was founded in 2013 and is based in Yangon, Myanmar with additional offices in Singapore and Road Town, British Virgin Islands.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Myanmar",
        "city": "Yangon"
    },
    "MIL.L": {
        "short_name": "MYANMAR INVESTMENTS INTERNATION",
        "long_name": "Myanmar Investments International Limited",
        "summary": "Myanmar Investments International Limited is a venture capital and private equity firm specializing in investments in start-up, expansion capital, and buyouts stages. The firm prefers to invest in equity, quasi-equity or debt instruments. Its investments are classified into core holdings and financial holdings. It does not focus on sectors like large real estate development, infrastructure development and exploration and production of natural resources. The firm prefers to invest in companies in hard infrastructure including telecoms, power, waste water treatment utilities, and transportation; soft infrastructure including financial services, education, and healthcare; manufacturing; tourism; agriculture; consumer goods and services; logistics; distribution, telecommunications, entertainment, business to business, and retailing sectors. It invests in companies, businesses, or assets based in Myanmar or the companies with business exposure to Myanmar. The firm invests between $5 million and $25 million in its portfolio companies and may invest outside this range in exceptional cases. It may acquire majority or minority shareholdings in portfolio companies. The firm may also invest through contracts that grant an economic interest in an asset. It may also invest in greenfield businesses. It seeks to participate in the management process through board representation in the portfolio companies. The firm would continue to hold the investments in core holdings and would seek to monetize the investment within five to seven years in financial holdings. It prefers to exit its investments through listings in Myanmar or on suitable overseas stock exchanges, trade sales or share swaps. Myanmar Investments International Limited was founded in 2013 and is based in Yangon, Myanmar with additional offices in Singapore and Road Town, British Virgin Islands.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Myanmar",
        "city": "Yangon"
    }
}