{"0DH.F": {"short_name": "DARMA HENWA TBK  RP 100", "long_name": "PT Darma Henwa Tbk", "summary": "PT Darma Henwa Tbk, together with its subsidiaries, provides mining contracting, general mining, and equipment maintenance services in Indonesia. It operates through two segments, Mining Contractor and Other Services. The company is involved in various mining activities, including land clearing, top soiling, drilling, blasting, overburden removal and dumping, coal getting, coal rom, coal hauling, coal barging, vegetation, and rehabilitation activities, as well as engages in equipment rental and port service businesses. The company was formerly known as PT HWE Indonesia and changed its name to PT Darma Henwa Tbk in September 2005. PT Darma Henwa Tbk was founded in 1991 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "3IB.F": {"short_name": "INDO TAMBANGR.MEGA.RP 500", "long_name": "PT Indo Tambangraya Megah Tbk", "summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates seven mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal/BoCT, three loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, coal transportation, and alternative energy marketing and support services, as well as engages in electricity generation activity. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, Australia, and other parts of Southeast Asia. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk is a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "44H.F": {"short_name": "HARUM ENERGY TBK  RP 100", "long_name": "PT Harum Energy Tbk", "summary": "PT Harum Energy Tbk, together with its subsidiaries, engages in coal mining and logistics activities in Indonesia. It operates through Coal Mining Sectors, Shipping Services, and Others Sectors divisions. The Coal Mining Sectors division is involved in the general survey, exploration, exploitation, transportation, processing, and sale of coal. The Shipping Services division engages in the transportation and rental of tugboats and barges. The Others Sectors division invests in coal mining, trading, and services businesses. The company also exports its products to China, South Korea, Japan, Taiwan, Hong Kong, India, Bangladesh, Thailand, the Philippines, Singapore, and Vietnam. The company was formerly known as PT Asia Antrasit and changed its name to PT Harum Energy Tbk in November 2007. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT Harum Energy Tbk is a subsidiary of PT Karunia Bara Perkasa.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Central Jakarta"}, "71S.SG": {"short_name": "Surya Esa Perkasa Tbk PT Regist", "long_name": "PT Surya Esa Perkasa Tbk", "summary": "PT Surya Esa Perkasa Tbk engages in purification and processing of natural gas in Indonesia. The company operates through LPG Refinery, Ammonia, and Others segments. It offers LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries such as steel workshop as welding fuel. The company also provides propane; condensate for use as a raw material for thinner, glue, and vehicle tires applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene; and ammonia that is used as a raw material for fertilizer production, pharmaceutical, food and beverage, textile, industrial and household cleaning, water and wastewater treatment, metallurgical processes, pulp and paper, leather, rubber, and other applications.In addition, it offers management and business consulting services; operates an ammonia plant; and sells raw feed gas through pipelines. PT Surya Esa Perkasa Tbk was founded in 2006 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "A64.F": {"short_name": "ADARO ENERGY TBK  RP 100", "long_name": "PT Adaro Energy Tbk", "summary": "PT Adaro Energy Tbk, together with its subsidiaries, engages in the trading, hauling, services, industry, workshop, mining, and construction activities of coal industry in Indonesia. It operates through Coal Mining and Trading; Mining Services; Logistics; and Others segments. The company provides coal mining and trading, mining contracting, infrastructure, coal logistics, power generation, and water and mud treatment services; and coal handling and barging, terminal handling, farming, trading, power plant, and construction services, as well as manufactures, repairs, and maintains sea transportation. It also exports its products to China, Malaysia, Japan, India, South Korea, and internationally. The company was formerly known as PT Padang Karunia and changed its name to PT Adaro Energy Tbk in April 2008. PT Adaro Energy Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "ABMM.JK": {"short_name": "ABM Investama Tbk.", "long_name": "PT ABM Investama Tbk", "summary": "PT ABM Investama Tbk operates in the energy resources, energy services, and energy infrastructure sectors in Indonesia. It operates in three segments: Mining Contractors and Coal Mining, Services, and Fabrication. The company owns coal mining concessions; supplies fuel for mining process; and supports engineered product and manufacturing services for mining activities. It offers port management services, which include technical and operational management services for handling, storing, loading and unloading operations; stevedoring and seaport services; floating crane, harbor tug, tug boat, and transshipment logistics services; warehousing management solutions for storage, inventory management, and distribution; freight management services; transportation management services for overweight and oversized items, such as transportation of heavy equipment, machinery, factory equipment, and power plants; integrated logistics and material management services for resource and energy industry, including drilling, exploration, and production activities. It also provides business management consulting services, including planning and designing the framework of developing business management in mining, energy, engineering, industry, oil, gas and geothermal energy, energy resources, and other consulting services; and rents offices and residential areas, as well as heavy equipment in mining and other industries. In addition, the company engages in the trade of petroleum; provides electricity solutions; manufactures equipment for heavy equipment and material transportation; and produces low calorific thermal coal. The company was formerly known as PT Adiratna Bani Makmur and changed its name to PT ABM Investama Tbk in August 2009. The company was founded in 2006 and is based in South Jakarta, Indonesia. PT ABM Investama Tbk is a subsidiary of Valle Verde Pte. Ltd.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "ADOOY": {"short_name": "ADARO ENERGY TBK", "long_name": "PT Adaro Energy Tbk", "summary": "PT Adaro Energy Tbk, together with its subsidiaries, engages in the trading, hauling, services, industry, workshop, mining, and construction activities of coal industry in Indonesia. It operates through Coal Mining and Trading; Mining Services; Logistics; and Others segments. The company provides coal mining and trading, mining contracting, infrastructure, coal logistics, power generation, and water and mud treatment services; and coal handling and barging, terminal handling, farming, trading, power plant, and construction services, as well as manufactures, repairs, and maintains sea transportation. It also exports its products to China, Malaysia, Japan, India, South Korea, and internationally. The company was formerly known as PT Padang Karunia and changed its name to PT Adaro Energy Tbk in April 2008. PT Adaro Energy Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.", "currency": "USD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "ADRO.JK": {"short_name": "Adaro Energy Tbk.", "long_name": "PT Adaro Energy Tbk", "summary": "PT Adaro Energy Tbk, together with its subsidiaries, engages in the trading, hauling, services, industry, workshop, mining, and construction activities of coal industry in Indonesia. It operates through Coal Mining and Trading; Mining Services; Logistics; and Others segments. The company provides coal mining and trading, mining contracting, infrastructure, coal logistics, power generation, and water and mud treatment services; and coal handling and barging, terminal handling, farming, trading, power plant, and construction services, as well as manufactures, repairs, and maintains sea transportation. It also exports its products to China, Malaysia, Japan, India, South Korea, and internationally. The company was formerly known as PT Padang Karunia and changed its name to PT Adaro Energy Tbk in April 2008. PT Adaro Energy Tbk was founded in 2004 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "AIMS.JK": {"short_name": "Akbar Indo Makmur Stimec Tbk", "long_name": "PT Akbar Indo Makmur Stimec Tbk", "summary": "PT Akbar Indo Makmur Stimec Tbk engages in the coal mining and trading business in Indonesia. The company was founded in 1957 and is headquartered in South Jakarta, Indonesia. PT Akbar Indo Makmur Stimec Tbk is a subsidiary of PT Aims Indo Investama.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "AKRA.JK": {"short_name": "AKR Corporindo Tbk.", "long_name": "PT AKR Corporindo Tbk", "summary": "PT AKR Corporindo Tbk, a logistics and supply chain company, distributes and trades in petroleum and basic chemical products primarily in Indonesia. The company operates in four segments: Trading and Distribution, Logistics Services, Manufacturing, and Industrial Estate. The Trading and Distribution segment distributes petroleum products and various basic chemicals, such as caustic soda, sodium sulphate, PVC resins, and soda ash. The Logistics Services segment provides various logistics services, including rental of storage tanks and warehouses, bagging, port handling, and transportation services primarily for liquid and solid chemical, and petroleum products in Indonesia. The Manufacturing segment produces and sells adhesive materials. The Industrial Estate segment develops industrial and port estates. The company was formerly known as PT Aneka Kimia Raya Tbk and changed its name to PT AKR Corporindo Tbk in September 2004. PT AKR Corporindo Tbk was founded in 1977 and is headquartered in Jakarta, Indonesia. PT AKR Corporindo Tbk is a subsidiary of PT Arthakencana Rayatama.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "APEX.JK": {"short_name": "Apexindo Pratama Duta Tbk.", "long_name": "PT Apexindo Pratama Duta Tbk", "summary": "PT Apexindo Pratama Duta Tbk provides onshore and offshore drilling services for oil and gas, geothermal, and coal bed methane industries in Indonesia and internationally. The company has a fleet of six offshore rigs that include 4 swamp barges and 2 jack-up rigs; and eight onshore rigs, as well as one floating production storage and offloading vessel. It serves international and domestic energy companies. The company was founded in 1984 and is headquartered in Jakarta, Indonesia. PT Apexindo Pratama Duta Tbk is a subsidiary of PT Aserra Capital.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Drilling", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ARII.JK": {"short_name": "Atlas Resources Tbk.", "long_name": "PT Atlas Resources Tbk", "summary": "PT Atlas Resources Tbk, together with its subsidiaries, engages in the mining, exploration, development, production, and sale of coal primarily in Indonesia and internationally. It produces a range of low to high calorific value thermal coal, as well as metallurgical coal for use in steel production, power generation, cement, and general manufacturing. The company holds various mining concessions covering a total area of approximately 200,000 hectares in Indonesia. In addition, it is involved in trading, services, construction, transportation, printing, industrial, logistics, investment, and agricultural activities. Further, the company operates workshops. The company was founded in 2007 and is based in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "ARTI.JK": {"short_name": "Ratu Prabu Energi Tbk", "long_name": "PT. Ratu Prabu Energi Tbk", "summary": "PT. Ratu Prabu Energi Tbk, through its subsidiaries, provides oil and gas services in Indonesia. The company operates through Tubular Services; Hydraulic Work Over; Construction, Engineering, and Non Destructive Testing; and Property Unit divisions. It offers tubular, casing, and tubing inspection and maintenance services for mining companies; and oil service equipment leasing and inspection; and consulting and manpower services. The company also provides labor services for supporting exploration, drilling and production of oil and gas; non-destructive testing services; and water injection and ROV services. In addition, it owns and rents office building. The company was formerly known as PT. Arona Binasejati Tbk and changed its name to PT. Ratu Prabu Energi Tbk in June 2008. PT. Ratu Prabu Energi Tbk was founded in 1993 and is based in Jakarta Selatan, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "BNB.F": {"short_name": "BAYAN RESOURCES GROUP", "long_name": "PT Bayan Resources Tbk", "summary": "PT Bayan Resources Tbk, together with its subsidiaries, engages in the open cut mining and sale of coal in Kalimantan. It operates through Coal and Non-Coal segments. The company produces semi-soft coking, bituminous, sub-bituminous low-sulphur, and low-ash coal. It has rights to mine 5 coal contracts of works and 16 mining business permits with a concession area of 126,293 hectares. The company also owns and operates a Balikpapan coal terminal located in Balikpapan, East Kalimantan, as well as owns and manages two Kalimantan floating transfer barges located in East Kalimantan. In addition, it is involved in the provision of mining contractor, port management, shipping, construction, transportation, and trading services. PT Bayan Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "BOSS.JK": {"short_name": "Borneo Olah Sarana Sukses Tbk.", "long_name": "PT. Borneo Olah Sarana Sukses Tbk", "summary": "PT. Borneo Olah Sarana Sukses Tbk operates as a coal exploration and production company in Indonesia. The company's mining assets are located in Muara Pahu, Kutai Barat, and East Kalimantan regions. It exports its products to Japan, South Korea, the United States, the Philippines, Thailand, Vietnam, India, and Bangladesh. PT. Borneo Olah Sarana Sukses Tbk is based in West Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Barat"}, "BSSR.JK": {"short_name": "Baramulti Suksessarana Tbk.", "long_name": "PT Baramulti Suksessarana Tbk", "summary": "PT Baramulti Suksessarana Tbk mines, produces, trades in, and transports coal. The company holds interests in the PT Antang Gunung Meratus coal concession covering an area of approximately 22,433 hectares located in South Kalimantan; and the PT Baramulti Suksessarana coal concession totaling an area of approximately 2,459.8 hectares located in East Kalimantan. It exports coal to India, South Korea, China, Indonesia, Thailand, the Philippines, and Japan. The company was founded in 1990 and is headquartered in Jakarta, Indonesia. PT Baramulti Suksessarana Tbk is a subsidiary of PT Wahana Sentosa Cemerlang.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BUMI.JK": {"short_name": "Bumi Resources Tbk.", "long_name": "PT Bumi Resources Tbk", "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BYAN.JK": {"short_name": "Bayan Resources Tbk.", "long_name": "PT Bayan Resources Tbk", "summary": "PT Bayan Resources Tbk, together with its subsidiaries, engages in the open cut mining and sale of coal in Kalimantan. It operates through Coal and Non-Coal segments. The company produces semi-soft coking, bituminous, sub-bituminous low-sulphur, and low-ash coal. It has rights to mine 5 coal contracts of works and 16 mining business permits with a concession area of 126,293 hectares. The company also owns and operates a Balikpapan coal terminal located in Balikpapan, East Kalimantan, as well as owns and manages two Kalimantan floating transfer barges located in East Kalimantan. In addition, it is involved in the provision of mining contractor, port management, shipping, construction, transportation, and trading services. PT Bayan Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "CTBN.JK": {"short_name": "Citra Tubindo Tbk.", "long_name": "PT Citra Tubindo Tbk", "summary": "PT Citra Tubindo Tbk, together with its subsidiaries, provides pipes and accessories, and related services in Indonesia. It operated through three segments: Pipe Processing, Transportation, and Technical Support. The Pipe Processing segment engages in the finishing and threading of pipes, as well as manufacturing accessories; and heat treatment for seamless pipes. The Transportation segment offers logistics and other services. The Technical Support segment provides marketing and technical support services in connection with the supply of oil country tubular goods and accessories for the oil and gas industry. It also offers line and drill pipes; port management, container and cargo, warehousing, and open storage rental services; public transportation, expedition, stevedoring, and heavy equipment rental services, as well as cargo handling services. The company offers its products and services primarily to the oil and gas industries. It exports its products to the United States, Canada, Australia, the Middle East, Brazil, and other countries in Africa and Asia. The company was founded in 1983 and is headquartered in Batam, Indonesia. PT Citra Tubindo Tbk is a subsidiary of Vallourec SA.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Batam"}, "D5A.SG": {"short_name": "PT Delta Dunia Makmur Tbk Regis", "long_name": "PT Delta Dunia Makmur Tbk", "summary": "PT Delta Dunia Makmur Tbk, through its subsidiaries, operates as a mining contractor in Indonesia. The company provides coal mining, overburden removal, coal hauling, waste removal, reclamation, and land rehabilitation services, as well as coal transportation and road maintenance services. It also engages in the rental of heavy equipment. PT Delta Dunia Makmur Tbk was founded in 1990 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "DEWA.JK": {"short_name": "Darma Henwa Tbk", "long_name": "PT Darma Henwa Tbk", "summary": "PT Darma Henwa Tbk, together with its subsidiaries, provides mining contracting, general mining, and equipment maintenance services in Indonesia. It operates through two segments, Mining Contractor and Other Services. The company is involved in various mining activities, including land clearing, top soiling, drilling, blasting, overburden removal and dumping, coal getting, coal rom, coal hauling, coal barging, vegetation, and rehabilitation activities, as well as engages in equipment rental and port service businesses. The company was formerly known as PT HWE Indonesia and changed its name to PT Darma Henwa Tbk in September 2005. PT Darma Henwa Tbk was founded in 1991 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "DOID.JK": {"short_name": "Delta Dunia Makmur Tbk.", "long_name": "PT Delta Dunia Makmur Tbk", "summary": "PT Delta Dunia Makmur Tbk, through its subsidiaries, operates as a mining contractor in Indonesia. The company provides coal mining, overburden removal, coal hauling, waste removal, reclamation, and land rehabilitation services, as well as coal transportation and road maintenance services. It also engages in the rental of heavy equipment. PT Delta Dunia Makmur Tbk was founded in 1990 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "DSSA.JK": {"short_name": "Dian Swastatika Sentosa Tbk", "long_name": "PT Dian Swastatika Sentosa Tbk", "summary": "PT Dian Swastatika Sentosa Tbk, together with its subsidiaries, engages in the power generation, trading, coal mining and trading, multimedia, forestry, and infrastructure businesses. It operates through Supply of Steam and Electricity, Fertilizer and Chemicals Trading, Rent, and Coal Mining and Trading segments. The company operates 4 units of captive power plants located in Tangerang, Serang, Karawang-1, and Karawang-2 with a total capacity of 600 megawatts. It also offers research and development, and management consulting services; trades in chemicals, pesticides, and fertilizers; and engages in the pulp and wood chip mill activities. In addition, the company provides pay TV and Internet service provider services; and venture capital and management services. It also operates in Indonesia, China, India, Korea, Spain, Thailand, Cambodia, and Dubai. The company was founded in 1996 and is headquartered in Jakarta, Indonesia. PT Dian Swastatika Sentosa Tbk is a subsidiary of PT Sinar Mas Tunggal.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "DSX.SG": {"short_name": "Dian Swastatika Sentosa Tbk Reg", "long_name": "PT Dian Swastatika Sentosa Tbk", "summary": "PT Dian Swastatika Sentosa Tbk, together with its subsidiaries, engages in the power generation, trading, coal mining and trading, multimedia, forestry, and infrastructure businesses. It operates through Supply of Steam and Electricity, Fertilizer and Chemicals Trading, Rent, and Coal Mining and Trading segments. The company operates 4 units of captive power plants located in Tangerang, Serang, Karawang-1, and Karawang-2 with a total capacity of 600 megawatts. It also offers research and development, and management consulting services; trades in chemicals, pesticides, and fertilizers; and engages in the pulp and wood chip mill activities. In addition, the company provides pay TV and Internet service provider services; and venture capital and management services. It also operates in Indonesia, China, India, Korea, Spain, Thailand, Cambodia, and Dubai. The company was founded in 1996 and is headquartered in Jakarta, Indonesia. PT Dian Swastatika Sentosa Tbk is a subsidiary of PT Sinar Mas Tunggal.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "DWGL.JK": {"short_name": "Dwi Guna Laksana Tbk.", "long_name": "PT Dwi Guna Laksana Tbk", "summary": "PT Dwi Guna Laksana Tbk, together with its subsidiaries, engages in the coal mining and trading activities in Indonesia. It also offers port, crushing, loading, and barging services. The company has a concession area of 412.8 hectares located in the Jilatan Village, district of Batu Ampar, Regency of Tanah Laut, South Kalimantan. The company was founded in 1986 and is headquartered in Banjarmasin, Indonesia. PT Dwi Guna Laksana Tbk is a subsidiary of Hawthorn-Capital Investment Pte. Ltd.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Banjarmasin"}, "ELSA.JK": {"short_name": "Elnusa Tbk.", "long_name": "PT Elnusa Tbk", "summary": "PT Elnusa Tbk provides oil and gas services in Indonesia. The company operates through Integrated Upstream Oil and Gas Services; Oil and Gas Support Services; and Energy Distribution and Logistics Services segments. It offers geophysical/seismic data measurement services, such as seismic and non-seismic data acquisition, and seismic data processing; and drilling and oilfield services, including drilling, hydraulic workover, coiled tubing, cementing and pumping, drilling fluid, drilling evaluation, electric wireline logging, surface well testing and drill stem testing, mud logging and H2S, slick line, artificial lift, operation and maintenance, enhance oil recovery, and well plug and abandonment. The company also provides data licensing solutions, data access services, and integrated data management solutions; and integrated storage system, online helpdesk, mobile storage services, delivery, health safety security environment system, and electrical power backup services. In addition, it offers threading services; logistic and marine support services for field operation, such as tug boat, crew boat, and accommodation work barges, as well as rents multipurpose barges; and services for mining and general businesses. Further, PT Elnusa Tbk engages in transportation, depot, and trading business; operates fuel and LPG filling stations; and distributes and trades in oil, gas, and chemicals. The company was formerly known as PT Electronika Nusantara and changed its name to PT Elnusa Tbk in September 1969. PT Elnusa Tbk was founded in 1969 and is based in South Jakarta, Indonesia. PT Elnusa Tbk is a subsidiary of PT Pertamina (Persero).", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "ENRG.JK": {"short_name": "Energi Mega Persada Tbk.", "long_name": "PT Energi Mega Persada Tbk", "summary": "PT Energi Mega Persada Tbk, an upstream oil and gas company, engages in the exploration, development, production, and trading of crude oil and natural gas in Indonesia and Mozambique. It has interests in oil and gas properties located in Kangean Island, East Java province, Riau, North Sumatra, and East Kalimantan provinces. PT Energi Mega Persada Tbk was founded in 2001 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ESSA.JK": {"short_name": "Surya Esa Perkasa Tbk.", "long_name": "PT Surya Esa Perkasa Tbk", "summary": "PT Surya Esa Perkasa Tbk engages in purification and processing of natural gas in Indonesia. The company operates through LPG Refinery, Ammonia, and Others segments. It offers LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries such as steel workshop as welding fuel. The company also provides propane; condensate for use as a raw material for thinner, glue, and vehicle tires applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene; and ammonia that is used as a raw material for fertilizer production, pharmaceutical, food and beverage, textile, industrial and household cleaning, water and wastewater treatment, metallurgical processes, pulp and paper, leather, rubber, and other applications.In addition, it offers management and business consulting services; operates an ammonia plant; and sells raw feed gas through pipelines. PT Surya Esa Perkasa Tbk was founded in 2006 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "HRUM.JK": {"short_name": "Harum Energy Tbk.", "long_name": "PT Harum Energy Tbk", "summary": "PT Harum Energy Tbk, together with its subsidiaries, engages in coal mining and logistics activities in Indonesia. It operates through Coal Mining Sectors, Shipping Services, and Others Sectors divisions. The Coal Mining Sectors division is involved in the general survey, exploration, exploitation, transportation, processing, and sale of coal. The Shipping Services division engages in the transportation and rental of tugboats and barges. The Others Sectors division invests in coal mining, trading, and services businesses. The company also exports its products to China, South Korea, Japan, Taiwan, Hong Kong, India, Bangladesh, Thailand, the Philippines, Singapore, and Vietnam. The company was formerly known as PT Asia Antrasit and changed its name to PT Harum Energy Tbk in November 2007. The company was founded in 1995 and is headquartered in Central Jakarta, Indonesia. PT Harum Energy Tbk is a subsidiary of PT Karunia Bara Perkasa.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Central Jakarta"}, "INDO": {"short_name": "Indonesia Energy Corporation Li", "long_name": "Indonesia Energy Corporation Limited", "summary": "Indonesia Energy Corporation Limited, through its subsidiaries, operates as an oil and gas exploration and production company in Indonesia. It holds interests in the Kruh Block, a producing block covering an area of 258 km2 with net crude oil proved reserves of 1.98 million barrels located to the northwest of Pendopo, Pali, South Sumatra; and the Citarum Block, an exploration block covering an area of 3,924.67 km2 located onshore in West Java. The company was incorporated in 2018 and is headquartered in Jakarta, Indonesia. Indonesia Energy Corporation Limited is a subsidiary of Maderic Holdings Limited.", "currency": "USD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "ASE", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "INDY.JK": {"short_name": "Indika Energy Tbk.", "long_name": "PT. Indika Energy Tbk", "summary": "PT. Indika Energy Tbk operates as an integrated energy company in Indonesia. The company operates through Energy Resources, Energy Services, and Energy Infrastructure segments. The Energy Resources segment produces coal. This segment undertakes surface coal mining at a 50,921 hectare concession in Paser Regency, East Kalimantan, Indonesia. The Energy Services segment provides mining, engineering, procurement, construction, and offshore supply base services in the coal, and oil and gas sectors; and operation, maintenance, and logistics services. The Energy Infrastructure segment operates 660 megawatt coal-fired power plant in Cirebon, West Java. It also provides sea logistics and transportation solutions for bulk materials and natural resources; and offshore supply logistics services for oil and gas companies. In addition, this segment engages in the port operations; and provision of logistics, integrated operation, management, and maintenance services. The company is also involved in the investment, general trading, marketing, financing, coal and mineral trading, contracting, development, construction, industrial, agriculture, printing, workshop, and transportation activities; and provision of consultancy services for construction, industry, and infrastructure, as well as waste management services. In addition, the company provides transportation management, business and management consultancy, real estate and trading, shipping, warehousing, stevedoring, and other services. Further, it offers information and communication, professional, scientific and technical manpower, travelling agent and general trading, insurance, vehicle repair maintenance, and retail and rental and lease services, as well as digital technology services. The company was founded in 1973 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ITMG.JK": {"short_name": "Indo Tambangraya Megah Tbk.", "long_name": "PT Indo Tambangraya Megah Tbk", "summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates seven mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal/BoCT, three loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, coal transportation, and alternative energy marketing and support services, as well as engages in electricity generation activity. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, Australia, and other parts of Southeast Asia. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk is a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "KALG": {"short_name": "KAL ENERGY INC", "long_name": "KAL Energy, Inc.", "summary": "KAL Energy, Inc. engages in the exploration, extraction, and distribution of coal. It holds interests in two coal concessions situated near the Mahakam River in north eastern Kalimantan, Indonesia. The company was formerly known as Patriarch, Inc. and changed its name to KAL Energy, Inc. in November 2006. KAL Energy, Inc. was founded in 2001 and is based in Jakarta, Indonesia.", "currency": "USD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "KKGI.JK": {"short_name": "Resource Alam Indonesia Tbk.", "long_name": "PT Resource Alam Indonesia Tbk", "summary": "PT Resource Alam Indonesia Tbk engages in coal and methane mining in Indonesia. It also manufactures and sells high pressure laminate and melamine laminated particle boards; and provides harbor management and electricity supply services. In addition, the company engages in hydropower plant industry, real estate, and trading activities. The company was formerly known as PT Kurnia Kapuas Utama Tbk and changed its name to PT Resource Alam Indonesia Tbk in November 2003. PT Resource Alam Indonesia Tbk was founded in 1981 and is headquartered in Central Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "KOPI.JK": {"short_name": "Mitra Energi Persada Tbk.", "long_name": "PT Mitra Energi Persada Tbk", "summary": "PT Mitra Energi Persada Tbk engages in the gas trading and distribution business in Indonesia. The company trades in and distributes gas through a network of downstream pipelines in South Sumatra region. It is also involved in the power plant, coal mining, and other related businesses. The company was formerly known as PT Korpora Persada Investama, Tbk and changed its name to PT Mitra Energi Persada Tbk in January 2008. The company was founded in 1981 and is based in Jakarta Selatan, Indonesia. PT Mitra Energi Persada Tbk is a subsidiary of PT Mulya Tara Mandiri.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "MBAP.JK": {"short_name": "Mitrabara Adiperdana Tbk.", "long_name": "PT Mitrabara Adiperdana Tbk", "summary": "PT Mitrabara Adiperdana Tbk, together with its subsidiaries, engages in coal mining, trading, and industrial businesses. It holds interests in coal mines, which cover a total area of 2,960 hectares located in Malinau Regency, North Kalimantan. The company also operates biomass power plants; and provides plantation services. It sells its products in India, the Philippines, South Korea, China, Taiwan, Japan, New Zealand, Indonesia, and Sri Lanka. The company was founded in 1992 and is headquartered in Central Jakarta Pusat, Indonesia. PT Mitrabara Adiperdana Tbk is a subsidiary of PT Wahana Sentosa Cemerlang.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "MEDC.JK": {"short_name": "Medco Energi Internasional Tbk.", "long_name": "PT Medco Energi Internasional Tbk", "summary": "PT Medco Energi Internasional Tbk, an energy and natural resources company, explores and produces oil and gas. The company operates 11 exploration and production blocks in Sumatra, Kalimantan, Java, and Sulawesi in Indonesia; and holds oil and gas assets in the Vietnam, Thailand, Oman, Libya, Yemen, Malaysia, Mexico, and Tanzania. It also engages in the power business; copper and gold mining operations in Sumbawa Island and Nusa Tenggara; and the operation of compression station with 3 gas compressors and 10 pipeline facilities in Gunung Megang and South Sumatra. The company was formerly known as PT Medco Energi Corporation and changed its name to PT Medco Energi Internasional Tbk in 2000. The company was founded in 1980 and is headquartered in Jakarta, Indonesia. PT Medco Energi Internasional Tbk is a subsidiary of PT Medco Daya Abadi Lestari.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "MEF.F": {"short_name": "MEDCO ENERGI INTL  RP 25", "long_name": "PT Medco Energi Internasional Tbk", "summary": "PT Medco Energi Internasional Tbk, an energy and natural resources company, explores and produces oil and gas. The company operates 11 exploration and production blocks in Sumatra, Kalimantan, Java, and Sulawesi in Indonesia; and holds oil and gas assets in the Vietnam, Thailand, Oman, Libya, Yemen, Malaysia, Mexico, and Tanzania. It also engages in the power business; copper and gold mining operations in Sumbawa Island and Nusa Tenggara; and the operation of compression station with 3 gas compressors and 10 pipeline facilities in Gunung Megang and South Sumatra. The company was formerly known as PT Medco Energi Corporation and changed its name to PT Medco Energi Internasional Tbk in 2000. The company was founded in 1980 and is headquartered in Jakarta, Indonesia. PT Medco Energi Internasional Tbk is a subsidiary of PT Medco Daya Abadi Lestari.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "MYOH.JK": {"short_name": "Samindo Resources Tbk.", "long_name": "PT Samindo Resources Tbk", "summary": "PT Samindo Resources Tbk, through its subsidiaries, provides coal mining and general mining services primarily in Indonesia. Its activities include overburden removal, coal getting, coal hauling from stockpile to port, and exploration drilling. The company also offers mining contractor services, such as stripping and excavating, hauling of mining products, stock piling, importing goods for investment activities, and marketing the mining products, as well as maintenance of high-technology equipment. In addition, it is involved in geological mapping, drilling exploration work, and calculation of coal deposits using feasibility studies, as well as mining development management and consultation businesses. The company was formerly known as PT Myoh Technology, Tbk and changed its name to PT Samindo Resources Tbk in February 2012. The company was founded in 2000 and is based in South Jakarta, Indonesia. Samindo Resources Tbk is a subsidiary of Samtan Co., Ltd.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Jakarta"}, "PBMRF": {"short_name": "BUMI RESOURCES TBK", "long_name": "PT Bumi Resources Tbk", "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.", "currency": "USD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PBMRY": {"short_name": "BUMI RESOURCES TBK", "long_name": "PT Bumi Resources Tbk", "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.", "currency": "USD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PJM.F": {"short_name": "PT BUMI RES.  RP 500", "long_name": "PT Bumi Resources Tbk", "summary": "PT Bumi Resources Tbk, through its subsidiaries, engages in the mining activities in Indonesia. It operates through Coal, Services, Oil and Gas, and Gold segments. The Coal segment engages in the exploration, exploitation, and sale of coal deposits. The Services segment offers marketing and management services. The Oil and Gas segment explores for oil and gas properties. The Gold segment explores for gold properties. It also exports its products. The company was formerly known as PT Bumi Modern Tbk. and changed its name to PT Bumi Resources Tbk in September 2000. PT Bumi Resources Tbk was founded in 1973 and is headquartered in Jakarta, Indonesia. PT Bumi Resources Tbk is a subsidiary of Long Haul Holdings Ltd.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "PTBA.JK": {"short_name": "Bukit Asam Tbk.", "long_name": "PT Bukit Asam Tbk", "summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities primarily in Indonesia. The company operates through two segments, Coal Mining and Other. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It manages special coal port facilities; operates steam power plants; and provides consulting services related to the coal mining industry. The company also offers briquette processing, contact services, oil palm plantation and processing, and health services. It also operates in China, India, Hong Kong, the Philippines, Cambodia, Bangladesh, Malaysia, Pakistan, Thailand, Vietnam, Taiwan, Japan, South Korea, and Singapore. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is headquartered in Tanjung Enim, Indonesia. PT Bukit Asam Tbk is a subsidiary of PT Indonesia Asahan Aluminium.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Tanjung Enim"}, "PTIZF": {"short_name": "INDO TAMBANGRAYA MEGAH TBK", "long_name": "PT Indo Tambangraya Megah Tbk", "summary": "PT Indo Tambangraya Megah Tbk, together with its subsidiaries, engages in coal mining activities. The company operates seven mining concessions in the island of Kalimantan covering East, Central, and South Kalimantan. It also owns and operates the Bontang Coal Terminal/BoCT, three loading ports, and Bontang power plant. In addition, the company provides mining support, coal and fuel trading, coal transportation, and alternative energy marketing and support services, as well as engages in electricity generation activity. It primarily sells its coal in Indonesia, India, Pakistan, Taiwan, China, Hong Kong, Korea, Japan, Europe, Australia, and other parts of Southeast Asia. The company was founded in 1987 and is headquartered in South Jakarta, Indonesia. PT Indo Tambangraya Megah Tbk is a subsidiary of Banpu Minerals (Singapore) Pte. Ltd.", "currency": "USD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "R4U.SG": {"short_name": "PT Radiant Utama Int.Tbk(RUIS)R", "long_name": "PT Radiant Utama Interinsco Tbk", "summary": "PT Radiant Utama Interinsco Tbk, together with its subsidiaries, provides technical support services to the oil and gas sector primarily in Indonesia. It operates through Operating Support Services, Inspection Services, Agency and Offshore Services, and Others segments. The company offers inspection and certification services, including non-destructive testing, oil country tubular goods, blasting and coating, statutory and voluntary inspection, and environmental study services; and technical support services, such as warehouse and camp maintenance, production and facilities maintenance, well intervention, and manpower supply services. It also provides agency and trading services comprising emergency response, integrated risk management, and storm alert services, as well as ALERT iResponse emergency management solution, a software that offers a map view of the asset regarding its resources and support infrastructure. In addition, the company offers strategic, commercial, and technical services; and oilfield equipment and services for the drilling and work over sector, as well as supplies drilling rig components, pressure control equipment, down hole tools, and tubulars. Further, it provides marine and construction services comprising dredging and lifting, river crossing and river bank repair and cement stabilized mud paste, and EPCI construction services; and offshore production facility services, asset management and operations, and offshore and dredging operations support services. Additionally, the company offers equipment exploration and local shipping services. It also engages in the new and renewable energy development business, such as geothermal, coal, and solar cell projects. The company was founded in 1984 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "RUIS.JK": {"short_name": "Radiant Utama Interinsco Tbk.", "long_name": "PT Radiant Utama Interinsco Tbk", "summary": "PT Radiant Utama Interinsco Tbk, together with its subsidiaries, provides technical support services to the oil and gas sector primarily in Indonesia. It operates through Operating Support Services, Inspection Services, Agency and Offshore Services, and Others segments. The company offers inspection and certification services, including non-destructive testing, oil country tubular goods, blasting and coating, statutory and voluntary inspection, and environmental study services; and technical support services, such as warehouse and camp maintenance, production and facilities maintenance, well intervention, and manpower supply services. It also provides agency and trading services comprising emergency response, integrated risk management, and storm alert services, as well as ALERT iResponse emergency management solution, a software that offers a map view of the asset regarding its resources and support infrastructure. In addition, the company offers strategic, commercial, and technical services; and oilfield equipment and services for the drilling and work over sector, as well as supplies drilling rig components, pressure control equipment, down hole tools, and tubulars. Further, it provides marine and construction services comprising dredging and lifting, river crossing and river bank repair and cement stabilized mud paste, and EPCI construction services; and offshore production facility services, asset management and operations, and offshore and dredging operations support services. Additionally, the company offers equipment exploration and local shipping services. It also engages in the new and renewable energy development business, such as geothermal, coal, and solar cell projects. The company was founded in 1984 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "SGER.JK": {"short_name": "Sumber Global Energy Tbk.", "long_name": "PT Sumber Global Energy Tbk", "summary": "PT Sumber Global Energy offers coal trading services. The company is based in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Jakarta"}, "SHIP.JK": {"short_name": "Sillo Maritime Perdana Tbk.", "long_name": "PT Sillo Maritime Perdana Tbk", "summary": "PT Sillo Maritime Perdana Tbk provides shipping and agency services. The company is also involved in the offshore support vessel rental and leasing business in the upstream oil and gas industry. In addition, it provides sea transportation and trading services. As of December 31, 2018, it had a fleet of 15 vessels. PT Sillo Maritime Perdana Tbk was founded in 1989 and is headquartered in Central Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Central Jakarta"}, "SMMT.JK": {"short_name": "Golden Eagle Energy Tbk.", "long_name": "PT Golden Eagle Energy Tbk", "summary": "PT Golden Eagle Energy Tbk, together with its subsidiaries, engages in the coal mining business in Indonesia. The company owns interests in a coal concession that covers an area of 3,238 hectares located in Samarinda, East Kalimantan; and three coal concessions covering 2.143 hectares located in Musi Rawas Regency, South Sumatera province. It also offers mining support and coal transportation services. In addition, the company exports its products. The company was formerly known as PT Eatertainment International Tbk and changed its name to PT Golden Eagle Energy Tbk in August 2012. PT Golden Eagle Energy Tbk was founded in 1980 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "SURE.JK": {"short_name": "Super Energy Tbk.", "long_name": "PT Super Energy Tbk", "summary": "PT Super Energy Tbk, through its subsidiaries, produces and distributes oil and gas in Indonesia. The company processes natural gas into condensate, liquefied petroleum gas, lean gas, and compressed natural gas (CNG). It also trades in and distributes fuel and CNG; and offers transportation services for mining and other petroleum products, as well as operates CNG station. The company was founded in 2011 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Integrated", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "TBA.F": {"short_name": "BUKIT ASAM TBK  RP 100", "long_name": "PT Bukit Asam Tbk", "summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities primarily in Indonesia. The company operates through two segments, Coal Mining and Other. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It manages special coal port facilities; operates steam power plants; and provides consulting services related to the coal mining industry. The company also offers briquette processing, contact services, oil palm plantation and processing, and health services. It also operates in China, India, Hong Kong, the Philippines, Cambodia, Bangladesh, Malaysia, Pakistan, Thailand, Vietnam, Taiwan, Japan, South Korea, and Singapore. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is headquartered in Tanjung Enim, Indonesia. PT Bukit Asam Tbk is a subsidiary of PT Indonesia Asahan Aluminium.", "currency": "EUR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Tanjung Enim"}, "TBNGY": {"short_name": "BUKIT ASAM TBK", "long_name": "PT Bukit Asam Tbk", "summary": "PT Bukit Asam Tbk, together with its subsidiaries, engages in the coal mining activities primarily in Indonesia. The company operates through two segments, Coal Mining and Other. Its coal mining activities include general surveying, exploration, exploitation, processing, refining, transportation, and trading. It manages special coal port facilities; operates steam power plants; and provides consulting services related to the coal mining industry. The company also offers briquette processing, contact services, oil palm plantation and processing, and health services. It also operates in China, India, Hong Kong, the Philippines, Cambodia, Bangladesh, Malaysia, Pakistan, Thailand, Vietnam, Taiwan, Japan, South Korea, and Singapore. The company was formerly known as PT Bukit Asam Persero Tbk and changed its name to PT Bukit Asam Tbk in November 2017. PT Bukit Asam Tbk was founded in 1919 and is headquartered in Tanjung Enim, Indonesia. PT Bukit Asam Tbk is a subsidiary of PT Indonesia Asahan Aluminium.", "currency": "USD", "sector": "Energy", "industry": "Thermal Coal", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Tanjung Enim"}, "TOBA.JK": {"short_name": "TBS Energi Utama Tbk.", "long_name": "PT TBS Energi Utama Tbk", "summary": "PT TBS Energi Utama Tbk, through its subsidiaries, engages in the coal mining, palm oil plantation, and power generation businesses in Indonesia and internationally. It owns interests in the Adimitra Baratama Nusantara mine covering an area of 2,990 hectares; the Trisensa Mineral Utama that covers an area of 3,414 hectares; and the Indomining mine covering an area of 683 hectares situated in Sangasanga, Kutai Kartanegara, East Kalimantan. The company also trades in coal. In addition, it has palm oil cultivation area totaling 8,633 hectares in Muara Jawa, Sangasanga, and Loa Janan District, Kutai Kartanegara Regency, East Kalimantan; and operates as an independent power producer. The company was formerly known as PT Toba Bara Sejahtra Tbk. PT TBS Energi Utama Tbk was founded in 2007 and is headquartered in Jakarta, Indonesia. PT TBS Energi Utama Tbk is a subsidiary of Highland Strategic Holdings Pte. Ltd.", "currency": "IDR", "sector": "Energy", "industry": "Thermal Coal", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "WOWS.JK": {"short_name": "Ginting Jaya Energi Tbk.", "long_name": "PT Ginting Jaya Energi Tbk", "summary": "PT Ginting Jaya Energi Tbk, an oil and gas contracting company, engages in supporting oil and gas operations in Indonesia. The company provides drilling well operation, workover, and well services. It also offers rig rental services, as well as sells spare parts. The company is based in Palembang, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Equipment & Services", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Palembang"}}