{
    "ARTI.JK": {
        "short_name": "Ratu Prabu Energi Tbk",
        "long_name": "PT. Ratu Prabu Energi Tbk",
        "summary": "PT. Ratu Prabu Energi Tbk, through its subsidiaries, provides oil and gas services in Indonesia. The company operates through Tubular Services; Hydraulic Work Over; Construction, Engineering, and Non Destructive Testing; and Property Unit divisions. It offers tubular, casing, and tubing inspection and maintenance services for mining companies; and oil service equipment leasing and inspection; and consulting and manpower services. The company also provides labor services for supporting exploration, drilling and production of oil and gas; non-destructive testing services; and water injection and ROV services. In addition, it owns and rents office building. The company was formerly known as PT. Arona Binasejati Tbk and changed its name to PT. Ratu Prabu Energi Tbk in June 2008. PT. Ratu Prabu Energi Tbk was founded in 1993 and is based in Jakarta Selatan, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12560",
        "website": "http://www.ratuprabuenergi.com",
        "market_cap": "Large Cap"
    },
    "CTBN.JK": {
        "short_name": "Citra Tubindo Tbk.",
        "long_name": "PT Citra Tubindo Tbk",
        "summary": "PT Citra Tubindo Tbk, together with its subsidiaries, provides pipes and accessories, and related services in Indonesia. It operated through three segments: Pipe Processing, Transportation, and Technical Support. The Pipe Processing segment engages in the finishing and threading of pipes, as well as manufacturing accessories; and heat treatment for seamless pipes. The Transportation segment offers logistics and other services. The Technical Support segment provides marketing and technical support services in connection with the supply of oil country tubular goods and accessories for the oil and gas industry. It also offers line and drill pipes; port management, container and cargo, warehousing, and open storage rental services; public transportation, expedition, stevedoring, and heavy equipment rental services, as well as cargo handling services. The company offers its products and services primarily to the oil and gas industries. It exports its products to the United States, Canada, Australia, the Middle East, Brazil, and other countries in Africa and Asia. The company was founded in 1983 and is headquartered in Batam, Indonesia. PT Citra Tubindo Tbk is a subsidiary of Vallourec SA.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Batam",
        "zipcode": "29467",
        "website": "http://www.citratubindo.com",
        "market_cap": "Large Cap"
    },
    "ELSA.JK": {
        "short_name": "Elnusa Tbk.",
        "long_name": "PT Elnusa Tbk",
        "summary": "PT Elnusa Tbk provides oil and gas services in Indonesia. The company operates through Integrated Upstream Oil and Gas Services; Oil and Gas Support Services; and Energy Distribution and Logistics Services segments. It offers geophysical/seismic data measurement services, such as seismic and non-seismic data acquisition, and seismic data processing; and drilling and oilfield services, including drilling, hydraulic workover, coiled tubing, cementing and pumping, drilling fluid, drilling evaluation, electric wireline logging, surface well testing and drill stem testing, mud logging and H2S, slick line, artificial lift, operation and maintenance, enhance oil recovery, and well plug and abandonment. The company also provides data licensing solutions, data access services, and integrated data management solutions; and integrated storage system, online helpdesk, mobile storage services, delivery, health safety security environment system, and electrical power backup services. In addition, it offers threading services; logistic and marine support services for field operation, such as tug boat, crew boat, and accommodation work barges, as well as rents multipurpose barges; and services for mining and general businesses. Further, PT Elnusa Tbk engages in transportation, depot, and trading business; operates fuel and LPG filling stations; and distributes and trades in oil, gas, and chemicals. The company was formerly known as PT Electronika Nusantara and changed its name to PT Elnusa Tbk in September 1969. PT Elnusa Tbk was founded in 1969 and is based in South Jakarta, Indonesia. PT Elnusa Tbk is a subsidiary of PT Pertamina (Persero).",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12560",
        "website": "http://www.elnusa.co.id",
        "market_cap": "Large Cap"
    },
    "MIRA.JK": {
        "short_name": "Mitra International Resources T",
        "long_name": "PT Mitra International Resources Tbk",
        "summary": "PT Mitra International Resources Tbk, together with its subsidiaries, provides land transportation services in Indonesia. The company offers transportation services to automobile assembling industry; logistics and warehousing services, including handles loading and unloading of goods in warehouses; on shore and offshore support services for energy, oil, and gas sectors; and building management services, as well as industrial support services, as well as operates a mixer truck fleet for carrying out projects in Central Java and East Java. It also provides manufacturing services of various car body products, such as flat truck deck truck, dump truck, box, and wing box. As of December 31, 2019, the company operated 518 trucks. The company was formerly known as PT Mitra Rajasa and changed its name to PT Mitra International Resources Tbk in October 2009. PT Mitra International Resources Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12510",
        "website": "http://www.mitrarajasa.com",
        "market_cap": "Large Cap"
    },
    "RUIS.JK": {
        "short_name": "Radiant Utama Interinsco Tbk.",
        "long_name": "PT Radiant Utama Interinsco Tbk",
        "summary": "PT Radiant Utama Interinsco Tbk, together with its subsidiaries, provides technical support services to the oil and gas sector primarily in Indonesia. It operates through Operating Support Services, Inspection Services, Agency and Offshore Services, and Others segments. The company offers inspection and certification services, including non-destructive testing, oil country tubular goods, blasting and coating, statutory and voluntary inspection, and environmental study services; and technical support services, such as warehouse and camp maintenance, production and facilities maintenance, well intervention, and manpower supply services. It also provides agency and trading services comprising emergency response, integrated risk management, and storm alert services, as well as ALERT iResponse emergency management solution, a software that offers a map view of the asset regarding its resources and support infrastructure. In addition, the company offers strategic, commercial, and technical services; and oilfield equipment and services for the drilling and work over sector, as well as supplies drilling rig components, pressure control equipment, down hole tools, and tubulars. Further, it provides marine and construction services comprising dredging and lifting, river crossing and river bank repair and cement stabilized mud paste, and EPCI construction services; and offshore production facility services, asset management and operations, and offshore and dredging operations support services. Additionally, the company offers equipment exploration and local shipping services. It also engages in the new and renewable energy development business, such as geothermal, coal, and solar cell projects. The company was founded in 1984 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12720",
        "website": "http://www.radiant.co.id",
        "market_cap": "Large Cap"
    },
    "SHIP.JK": {
        "short_name": "Sillo Maritime Perdana Tbk.",
        "long_name": "PT Sillo Maritime Perdana Tbk",
        "summary": "PT Sillo Maritime Perdana Tbk provides shipping and agency services. The company is also involved in the offshore support vessel rental and leasing business in the upstream oil and gas industry. In addition, it provides sea transportation and trading services. As of December 31, 2018, it had a fleet of 15 vessels. PT Sillo Maritime Perdana Tbk was founded in 1989 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Central Jakarta",
        "zipcode": "10310",
        "website": "http://www.sillomaritime.com",
        "market_cap": "Large Cap"
    },
    "WOWS.JK": {
        "short_name": "Ginting Jaya Energi Tbk.",
        "long_name": "PT Ginting Jaya Energi Tbk",
        "summary": "PT Ginting Jaya Energi Tbk, an oil and gas contracting company, engages in supporting oil and gas operations in Indonesia. The company provides drilling well operation, workover, and well services. It also offers rig rental services, as well as sells spare parts. The company is based in Palembang, Indonesia.",
        "currency": "IDR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Palembang",
        "zipcode": "30961",
        "website": "http://www.gj-energi.co.id",
        "market_cap": "Large Cap"
    }
}