{"71S.SG": {"short_name": "Surya Esa Perkasa Tbk PT Regist", "long_name": "PT Surya Esa Perkasa Tbk", "summary": "PT Surya Esa Perkasa Tbk engages in purification and processing of natural gas in Indonesia. The company operates through LPG Refinery, Ammonia, and Others segments. It offers LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries such as steel workshop as welding fuel. The company also provides propane; condensate for use as a raw material for thinner, glue, and vehicle tires applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene; and ammonia that is used as a raw material for fertilizer production, pharmaceutical, food and beverage, textile, industrial and household cleaning, water and wastewater treatment, metallurgical processes, pulp and paper, leather, rubber, and other applications.In addition, it offers management and business consulting services; operates an ammonia plant; and sells raw feed gas through pipelines. PT Surya Esa Perkasa Tbk was founded in 2006 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "AKRA.JK": {"short_name": "AKR Corporindo Tbk.", "long_name": "PT AKR Corporindo Tbk", "summary": "PT AKR Corporindo Tbk, a logistics and supply chain company, distributes and trades in petroleum and basic chemical products primarily in Indonesia. The company operates in four segments: Trading and Distribution, Logistics Services, Manufacturing, and Industrial Estate. The Trading and Distribution segment distributes petroleum products and various basic chemicals, such as caustic soda, sodium sulphate, PVC resins, and soda ash. The Logistics Services segment provides various logistics services, including rental of storage tanks and warehouses, bagging, port handling, and transportation services primarily for liquid and solid chemical, and petroleum products in Indonesia. The Manufacturing segment produces and sells adhesive materials. The Industrial Estate segment develops industrial and port estates. The company was formerly known as PT Aneka Kimia Raya Tbk and changed its name to PT AKR Corporindo Tbk in September 2004. PT AKR Corporindo Tbk was founded in 1977 and is headquartered in Jakarta, Indonesia. PT AKR Corporindo Tbk is a subsidiary of PT Arthakencana Rayatama.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ESSA.JK": {"short_name": "Surya Esa Perkasa Tbk.", "long_name": "PT Surya Esa Perkasa Tbk", "summary": "PT Surya Esa Perkasa Tbk engages in purification and processing of natural gas in Indonesia. The company operates through LPG Refinery, Ammonia, and Others segments. It offers LPG primarily for use as a kitchen appliance fuel for homes, shopping centers, and hotels; and motor vehicle fuel, as well as for construction industries such as steel workshop as welding fuel. The company also provides propane; condensate for use as a raw material for thinner, glue, and vehicle tires applications, as well as light naphtha, which is a cracker material for the manufacture of polyethylene; and ammonia that is used as a raw material for fertilizer production, pharmaceutical, food and beverage, textile, industrial and household cleaning, water and wastewater treatment, metallurgical processes, pulp and paper, leather, rubber, and other applications.In addition, it offers management and business consulting services; operates an ammonia plant; and sells raw feed gas through pipelines. PT Surya Esa Perkasa Tbk was founded in 2006 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "KOPI.JK": {"short_name": "Mitra Energi Persada Tbk.", "long_name": "PT Mitra Energi Persada Tbk", "summary": "PT Mitra Energi Persada Tbk engages in the gas trading and distribution business in Indonesia. The company trades in and distributes gas through a network of downstream pipelines in South Sumatra region. It is also involved in the power plant, coal mining, and other related businesses. The company was formerly known as PT Korpora Persada Investama, Tbk and changed its name to PT Mitra Energi Persada Tbk in January 2008. The company was founded in 1981 and is based in Jakarta Selatan, Indonesia. PT Mitra Energi Persada Tbk is a subsidiary of PT Mulya Tara Mandiri.", "currency": "IDR", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}}