{
    "ESKN.L": {
        "short_name": "ESKEN LIMITED ORD 10P",
        "long_name": "Esken Limited",
        "summary": "Esken Limited operates in the aviation and energy business primarily in the United Kingdom, Europe, Ireland, and internationally. It operates through Stobart Aviation, Stobart Energy, Stobart Rail & Civils, Stobart Investments, and Stobart Non-Strategic Infrastructure segments. The Stobart Aviation segment engages in the operation of commercial airports and the provision of ground handling services. The Stobart Energy segment is involved in the supply of sustainable biomass for the generation of renewable energy. The Stobart Rail & Civils segment delivers internal and external civil engineering development projects, including rail network operations. The Stobart Investments segment engages in the transport and distribution, and baggage handling businesses. The Stobart Non-Strategic Infrastructure segment is involved in the management, development, and realization of a portfolio of property assets, including Carlisle Lake District Airport, as well as an investment in a renewable energy plant. The company was formerly known as Stobart Group Limited and changed its name to Esken Limited in February 2021. Esken Limited was incorporated in 2002 and is based in Saint Peter Port, Guernsey.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Guernsey",
        "state": null,
        "city": "Saint Peter Port",
        "zipcode": "GY1 4LY",
        "website": "http://www.esken.com",
        "full_time_employees": 1205
    },
    "MPL.L": {
        "short_name": "MERCANTILE PORTS & LOGISTICS LI",
        "long_name": "Mercantile Ports & Logistics Limited",
        "summary": "Mercantile Ports & Logistics Limited, through its subsidiaries, develops, owns, and operates port and logistics facilities in India. It is developing a port and logistics facility in approximately 200 acres of land with a sea frontage of 1,000 meters at Karanja Creek in the Raigad District of Maharashtra. The company was formerly known as SKIL Ports & Logistics Limited and changed its name to Mercantile Ports & Logistics Limited in November 2016. Mercantile Ports & Logistics Limited was incorporated in 2010 and is based in Saint Peter Port, Guernsey.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Guernsey",
        "state": null,
        "city": "Saint Peter Port",
        "zipcode": "GY1 1DB",
        "website": "http://www.mercpl.com",
        "full_time_employees": 56
    }
}