{
    "PROF.AT": {
        "short_name": "PROFILE SYSTEMS & SOFTWARE S.A",
        "long_name": "Profile Systems & Software SA",
        "summary": "Profile Systems & Software SA develops and delivers software solutions primarily for the banking and investment management industry in Europe, the Middle East, America, Asia, and Africa. Its products include Axia, a Web-based omni-channel and MiFID II enabled investment management solution; IMSplus, an investment management platform that incorporates a set of solutions targeted to banking and investment management firms; and FMS.next, an integrated banking platform for financial institutions, such as universal banks, private banks, Islamic banks, and auto and leasing institutions, as well as marketplace lending platforms, alternative banking/finance organizations, and digital and online banks. The company also offers FMS.next Payments, a payments solution that facilitates domestic and international payment, and automates and monitors the full cycle of transactions; RiskAvert, a risk management solution that assists financial institutions to gather and reconcile data, as well as calculate, aggregate, and report regulatory credit, market, operational, and concentration risk; and Acumen-net, a front-to-back-to-risk office treasury and capital markets platform that supports various financial market transactions. In addition, it provides Mobius Wealth, a mobile wealth management application that integrates with back-end system and uses data from existing systems, as well as compiles them into a single presentation. Further, the company offers GS Market suite, a real-time data feed monitoring application for the stock exchange market; GS Trader, a tool for traders in investment firms, brokerage firms, banks, and private investors; Plexus, an application that provides feeds from various exchanges real-time or delayed, FX, and news; and Registry, a system for monitoring and management of shareholders registry. Additionally, it offers implementation and post implementation services. Profile Systems & Software SA was founded in 1990 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Business Software & Services",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "city": "Athens"
    }
}