{
    "FORTH.AT": {
        "short_name": "FORTHNET S.A.",
        "long_name": "Hellenic Company for Telecommunications and Telematic Applications S.A.",
        "summary": "Hellenic Company for Telecommunications and Telematic Applications S.A., together with its subsidiaries, provides telecommunications and pay-TV services to small and medium-sized enterprises, and private consumers in Greece. It offers Internet services, such as Internet access, Internet leased lines, data connectivity services, LMDS, etc., as well as fixed telephony and data services. The company also provides digital radio-television and/or audiovisual services; owns and broadcasts the Novasports channels; and offers content acquisition and customer support services, as well as provides satellite services. Hellenic Company for Telecommunications and Telematic Applications S.A. was incorporated in 1995 and is headquartered in Pallini, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Wireless Communications",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Pallini",
        "zipcode": "153 51",
        "website": "http://www.forthnet.gr",
        "market_cap": "Micro Cap"
    },
    "HTO.AT": {
        "short_name": "HELLENIC TELECOM. ORG. (CR)",
        "long_name": "Hellenic Telecommunications Organization S.A.",
        "summary": "Hellenic Telecommunications Organization S.A., together with its subsidiaries, provides telecommunications and related services to businesses and individuals primarily in Greece and Romania. It operates through OTE, COSMOTE Group, TELEKOM ROMANIA, and Other segments. The company offers fixed-line, Internet access, and ICT services; and international carrier and TV production services. It also provides mobile and satellite telecommunication, electronic money, e-commerce, financing, consultancy and security, real estate, insurance brokerage, training, wholesale telephony, retail, marketing, overdue accounts management, wholesale broadband, and infrastructure services. The company was incorporated in 1949 and is based in Athens, Greece.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Wireless Communications",
        "exchange": "ATH",
        "market": "gr_market",
        "country": "Greece",
        "state": null,
        "city": "Athens",
        "zipcode": "151 24",
        "website": "http://www.cosmote.gr/cs/otegroup/en/ote_ae.html",
        "market_cap": "Mid Cap"
    }
}