{
    "ALNU.ME": {
        "short_name": "ALROSA-NYURBA PJSC",
        "long_name": "PJSC ALROSA-Nyurba",
        "summary": "PJSC ALROSA-Nyurba engages in the mining of diamonds in Russia. It holds the mining licenses for the Nyurbinskoye and Botuobinskoye primary deposits in the Nyurba District of the Republic of Sakha. The company was formerly known as Open Joint Stock Company ALROSA-Nyurba and changed its name to PJSC ALROSA-Nyurba in December 2015. The company was founded in 1997 and is based in Moscow, Russia. PJSC ALROSA-Nyurba is a subsidiary of Public Joint Stock Company ALROSA.",
        "currency": "RUB",
        "sector": "Basic Materials",
        "industry": "Other Precious Metals & Mining",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "115184",
        "website": "http://eng.alrosa.ru/corporate-structure/ojsc-alrosa-nyurba-nyurba/",
        "full_time_employees": 29
    },
    "ALRS.ME": {
        "short_name": "ALROSA PJSC",
        "long_name": "Public Joint Stock Company ALROSA",
        "summary": "Public Joint Stock Company ALROSA, together with subsidiaries, operates as a diamond mining company. The company operates through Diamonds, Transportation, Social Infrastructure, and Other Activities segments. It is involved in the exploration and extraction of diamond reserves; and marketing and distribution of raw and cut diamonds. The company operates mining facilities in Mirny, Udachny, Aikhal, Nyurba, and Anabar located in Western Yakutia, as well as in the Arkhangelsk region. The company also offers airline, transportation, and financial services; and services at transportation terminals, ports, and airports. In addition, it engages in construction of sports complexes; and cultural facilities, such as cinemas and theatres and other social infrastructure. Further, the company extracts gas; and produces electricity. It operates in Belgium, Russia, India, the United Arab Emirates, Israel, China, Switzerland, Angola, the United Kingdom, the Republic of Botswana, Belarus, the United States, Armenia, and internationally. The company was founded in 1957 and is headquartered in Mirny, Russia.",
        "currency": "RUB",
        "sector": "Basic Materials",
        "industry": "Other Precious Metals & Mining",
        "exchange": "MCX",
        "market": "ru_market",
        "country": "Russia",
        "state": null,
        "city": "Mirny",
        "zipcode": "678174",
        "website": "http://www.alrosa.ru",
        "full_time_employees": null
    }
}