{"0AJ.F": {"short_name": "STRIDE INC.  DL -,0001", "long_name": "Stride, Inc.", "summary": "Stride, Inc., a technology-based education company, provides proprietary and third-party online curriculum, software systems, and educational services to facilitate individualized learning for students primarily in kindergarten through 12th grade (K-12) in the United States and internationally. The company offers managed public school programs, which offer an integrated package of systems, services, products, and professional services that K12 administers to support an online or blended public school, including administrative support, information technology and provisioning, academic support, curriculum, learning systems, and instructional services. It also provides institutionalÂ\u0096non-managed public school programs, which offers instruction, curriculum, supplemental courses, marketing, enrollment, and other educational services; and institutional software and services, such as educational software and services to school districts, public schools, and other educational institutions. In addition, the company offers private pay schools and other services; and talent development services for individuals and enterprises in information technology fields. Further, it provides curriculum portfolios, pre-K and K-8 courses, high school courses, learning applications, and learning management systems; and TotalView, a student information system, which include a suite of online applications that offers administrators, teachers, parents, and students a view of student attendance, truancy management, graduation planning, communications, and learning kit shipment tracking. Additionally, the company provides a suite of services, such as academic support, and administrative and technology to students and their families, as well as directly to virtual and blended public schools, traditional schools, and school districts. It sells individual K-8 online courses and supplemental educational products directly to families. The company was formerly known as K12 Inc. and changed its name to Stride, Inc. in December 2020. Stride, Inc. was founded in 2000 and is headquartered in Herndon, Virginia.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Herndon"}, "0CG.F": {"short_name": "CHEGG INC.  DL -,001", "long_name": "Chegg, Inc.", "summary": "Chegg, Inc. operates direct-to-student learning platform that supports students on their journey from high school to college and into their career with tools designed to help them pass their test, pass their class, and save money on required materials. The company offers Chegg Services, which include digital products and services; and required materials that comprise its print textbooks and eTextbooks. Its digital products and services include Chegg Study, which helps students master challenging concepts on their own; Chegg Writing that enables generate sources in the required formats, when students need to cite their sources in written work; Chegg Tutors that allow students find human help on its learning platform through a network of live tutors; Chegg Math solver, a step-by-step math problem solver and calculator that helps students to solve problems; and Thinkful, a skills-based learning platform that offers professional courses in the areas of software engineering, data science, data analytics, product design, and product management directly to students. The company also provides other services, such as Chegg Prep and internships, college admission and scholarship services; rents and sells print textbooks and eTextbooks; and offers supplemental materials. Chegg, Inc. was founded in 2005 and is headquartered in Santa Clara, California.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Santa Clara"}, "APEI": {"short_name": "American Public Education, Inc.", "long_name": "American Public Education, Inc.", "summary": "American Public Education, Inc., together with its subsidiaries, provides online and campus-based postsecondary education. The company operates in two segments, American Public Education and Hondros College of Nursing. It offers 121 degree programs and 111 certificate programs in various fields of study, including business administration, health science, technology, criminal justice, education, and liberal arts, as well as national security, military studies, intelligence, and homeland security. The company also provides diploma in practical nursing, an associate degree in nursing, and an associate degree in medical laboratory technology. American Public Education, Inc. was founded in 1991 and is headquartered in Charles Town, West Virginia.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Charles Town"}, "ASPU": {"short_name": "Aspen Group Inc.", "long_name": "Aspen Group, Inc.", "summary": "Aspen Group, Inc., an education technology company, provides online higher education services in the United States. The company offers certificate programs; and associate, bachelor's, master's, and doctoral degree programs in a range of areas, including nursing and health sciences, business and technology, arts and sciences, education, and professional and extended studies. As of April 30, 2020, it had 11,444 degree-seeking students enrolled. The company was founded in 1987 and is based in New York, New York.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "New York"}, "ATGE": {"short_name": "Adtalem Global Education Inc.", "long_name": "Adtalem Global Education Inc.", "summary": "Adtalem Global Education Inc. provides educational services worldwide. It operates through two segments, Medical and Healthcare and Financial Services. The Medical and Healthcare segment operates Chamberlain University, which provides a pre-licensure bachelor of science in nursing (BSN) program, registered nurse (RN)-to-BSN degree completion option, and graduate programs. The Chamberlain University offers educational services through its 22 campuses and online. This segment also operates medical and veterinary schools, such as American University of the Caribbean School of Medicine, Ross University School of Medicine, and Ross University School of Veterinary Medicine. The Financial Services segment provides test preparation, certifications, conferences, seminars, memberships, and subscriptions to business professionals in the areas of accounting, anti-money laundering, banking, and mortgage lending. It operates an Association of Certified Anti-Money Laundering Specialists that provides membership services, certified anti-money laundering specialist certification, conferences, risk assessment, training, and publications; and Becker Professional Education that prepares candidates for the Certified Public Accountant and Certified Management Accountant certification examinations, as well as professional education programs and seminars in accounting and finance. This segment also offers compliance training, mortgage licensure preparation, continuing education, and professional development in the banking and mortgage industries; and online and classroom programs in the areas of finance, accounting, and analytics. The company was formerly known as DeVry Education Group Inc. and changed its name to Adtalem Global Education Inc. in May 2017. Adtalem Global Education Inc. was incorporated in 1987 and is based in Chicago, Illinois.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Chicago"}, "CCHZ": {"short_name": "CAREER COLLEGE HLDG CO INC", "long_name": "Career College Holding Co., Inc.", "summary": "Career College Holding Co., Inc., an online learning company, provides a network of accredited campus-based and online institutions of higher education in the United States and Europe. The company was formerly known as WorldSage, Inc. and changed its name to Career College Holding Co., Inc. in October 2008. The company was founded in 2006 and is based in Cupertino, California.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cupertino"}, "CHGG": {"short_name": "Chegg, Inc.", "long_name": "Chegg, Inc.", "summary": "Chegg, Inc. operates direct-to-student learning platform that supports students on their journey from high school to college and into their career with tools designed to help them pass their test, pass their class, and save money on required materials. The company offers Chegg Services, which include digital products and services; and required materials that comprise its print textbooks and eTextbooks. Its digital products and services include Chegg Study, which helps students master challenging concepts on their own; Chegg Writing that enables generate sources in the required formats, when students need to cite their sources in written work; Chegg Tutors that allow students find human help on its learning platform through a network of live tutors; Chegg Math solver, a step-by-step math problem solver and calculator that helps students to solve problems; and Thinkful, a skills-based learning platform that offers professional courses in the areas of software engineering, data science, data analytics, product design, and product management directly to students. The company also provides other services, such as Chegg Prep and internships, college admission and scholarship services; rents and sells print textbooks and eTextbooks; and offers supplemental materials. Chegg, Inc. was founded in 2005 and is headquartered in Santa Clara, California.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "CLCN": {"short_name": "CREATIVE LEARNING CORP", "long_name": "Creative Learning Corporation", "summary": "Creative Learning Corporation, together with its subsidiaries, provides educational and enrichment programs under the Bricks 4 Kidz and Sew Fun Studios trade names in the United States and internationally. The company's programs are offered to children ages 3 to 13+, which include in-school workshops, and after-school and pre-school classes, as well as classes for home-schooled children; and camps, birthday parties, and special events to enhance and enrich the traditional school curriculum, trigger young children's lively imaginations, and build self-confidence. As of September 30, 2020, it had 451 Bricks 4 Kidz and Sew Fun Studios franchises, 28 Bricks 4 Kidz master franchises, and 134 Bricks 4 Kidz sub-franchises operating in 39 countries. Creative Learning Corporation was founded in 2009 and is based in St. Augustine, Idaho.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Augustine"}, "EDMCQ": {"short_name": "EDUCATION MANAGEMENT LLC/CORP", "long_name": "Education Management Corporation", "summary": "Education Management Corporation provides post-secondary education in North America. It offers academic programs to students through campus-based and online instruction to earn undergraduate and graduate degrees, and various specialized non-degree diplomas in a range of disciplines comprising business, culinary, design, education, fashion, health sciences, information technology, legal, media arts, and psychology and behavioral sciences. The company was founded in 1962 and is headquartered in Pittsburgh, Pennsylvania. On June 29, 2018, Education Management Corporation filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the District of Delaware. It is in joint administration with The Art Institute Of Philadelphia Limited Partnership.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pittsburgh"}, "ESINQ": {"short_name": "ITT EDUCATIONAL SERVICES INC", "long_name": "ITT Educational Services, Inc.", "summary": "ITT Educational Services, Inc. provides postsecondary degree programs in the United States. It offers master, bachelor, and associate degree programs to approximately 45,000 students; and short-term information technology and business learning solutions for career advancers and other professionals. The company's business education programs include accounting, business administration, financial services, manufacturing, marketing and advertising, and sales; and drafting and design programs consist of architectural and construction drafting, civil drafting, computer aided drafting, electrical and electronics drafting, industrial engineering technology, interior design, landscape architecture, mechanical drafting, and multimedia communications. Its electronics technology programs include communications, computer technology, electronics product design and fabrication, industrial electronics, instrumentation, and telecommunications; and criminal justice programs include corrections, cyber security, investigations, and security and policing. The company's IT programs include communications, network administration, network technology, software development, systems technology, and technical support; and Breckinridge school of nursing and health sciences programs comprise health information technology, medical assisting and administration, and nursing. As of December 31, 2015, it had 138 college locations in 39 states. The company was founded in 1946 and is headquartered in Carmel, Indiana. On September 16, 2016, ITT Educational Services Inc. along with its affiliates filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the Southern District of Indiana.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carmel"}, "EVCI": {"short_name": "EVCI CAREER COLLEGES INCORPORAT", "long_name": "EVCI Career Colleges Holding Corp.", "summary": "EVCI Career Colleges Holding Corp., through its subsidiaries, provides on-campus career college education in the United States. The company, through its subsidiary, Technical Career Institutes, Inc., offers college degree programs leading to the associate in applied sciences degree, as well as certain certificate programs. Its other subsidiary, Interboro Institute, Inc., provides college degree programs leading to the associate in occupational studies degree and associate in applied sciences degree. EVCI Career Colleges Holding Corp., through its subsidiary, Pennsylvania School of Business, Inc., offers two associate in specialized business degree programs and two diploma programs in information technology, as well as three business diploma programs. The company was founded in 1997 and is based in Yonkers, New York. On November 13, 2017, EVCI Career Colleges Holding Corp. filed a voluntary petition for liquidation under Chapter 7 in the US Bankruptcy Court for the Southern District of New York.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Yonkers"}, "GHC": {"short_name": "Graham Holdings Company", "long_name": "Graham Holdings Company", "summary": "Graham Holdings Company, through its subsidiaries, operates as a diversified education and media company worldwide. It provides test preparation services and materials; data science education, and training and healthcare simulation services; professional training and exam preparation for professional certifications and licensures; and non-academic operations support services to Purdue University Global. The company also offers training, test preparation, and degrees for accounting and financial services professionals; English-language training, academic preparation programs, and test preparation for English proficiency exams; and A-level examination preparation services, as well as operates three colleges, including one business school, one higher education institution, and one online learning institution. In addition, it owns and operates seven television stations; and provides social media management tools designed to connect newsrooms with their users, as well as produces Foreign Policy magazine and ForeignPolicy.com website. Further, the company publishes Slate, an online magazine; and two French-language news magazine websites at slate.fr and slateafrique.com. Additionally, it provides marketing solutions on social, mobile, and video platforms; home health and hospice services; burners, igniters, dampers, and controls; screw jacks, linear actuators and related linear motion products, and lifting systems; pressure impregnated kiln-dried lumber and plywood products; cybersecurity training solutions; digital advertising services; and power charging and data systems, industrial and commercial indoor lighting solutions, and electrical components and assemblies. The company also owns and operates 13 restaurants; and engages in automobile dealerships business. The company was formerly known as The Washington Post Company and changed its name to Graham Holdings Company in November 2013. Graham Holdings Company was founded in 1877 and is based in Arlington, Virginia.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Arlington"}, "GKD.F": {"short_name": "GRAND CANYON EDUCAT. INC.", "long_name": "Grand Canyon Education, Inc.", "summary": "Grand Canyon Education, Inc. provides education services to colleges and universities in the United States. The company's technology services include learning management system, internal administration, infrastructure, and support services; academic services comprises program and curriculum, faculty and related training and development, class scheduling, and skills and simulation lab sites; and counseling services and support include admission, financial aid, and field experience counseling services. It also offers marketing and communication services, such as lead acquisition, digital communications strategy, brand identity, media planning and strategy, video, and data science and analysis services; and back office services comprising finance and accounting, human resources, audit, procurement services. The company, through its subsidiary, Orbis Education Services, LLC, supports healthcare education programs for 22 universities. Grand Canyon Education, Inc. was founded in 1949 and is based in Phoenix, Arizona.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Phoenix"}, "GPLA": {"short_name": "GAMEPLAN INC", "long_name": "GamePlan, Inc.", "summary": "Athena Bitcoin Inc. operates a network of bitcoin and other crypto ATMs in North and South America. The company's peer-to-peer exchanges enable individuals to buy and sell bitcoin and bitcoin cash without an ATM. It also provides advisory services on a range of equity and fixed income transactions for companies and real estate developers. The company was founded in 2015 and is based in Chicago, Illinois with a network of locations in California, Florida, Georgia, Illinois, Missouri, Ohio, Pennsylvania, and Texas.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Chicago"}, "GPX": {"short_name": "GP Strategies Corporation", "long_name": "GP Strategies Corporation", "summary": "GP Strategies Corporation provides performance improvement and learning solutions worldwide. The company operates in two segments, Workforce Excellence and Business Transformation Services. The Workforce Excellence segment offers managed learning services, including strategic learning and development consulting; digital learning content design and development solutions; and a suite of learning operations services, such as managed facilitation and delivery, managed training administration and logistics, help desk support, and event and vendor management. This segment also provides engineering and technical services comprising design, development and delivery of technical work-based learning, plant launch initiatives, engineering design and construction management, fabrication, management, operational excellence consulting, chemical demilitarization, homeland security, emergency management support, and asset management and performance improvement consulting, as well as technical documentation services; EtaPRO performance and condition monitoring system, a suite of real-time digital solutions for facilities and power-generating units; and GPiLEARN+ portal, a web-based off-the-shelf delivery format of technical courses. The Business Transformation Services segment offers custom product sales training and service technical training primarily to automotive manufacturers and service technicians; and organizational development solutions, including strategy, leadership, employee engagement and culture consulting, enterprise technology implementation and adoption, and organization design and business performance consulting. It serves companies in the automotive, financial services and insurance, pharmaceutical, oil and gas, power, chemical, electronics and technology, manufacturing, software, retail, healthcare, education, and food and beverage industries, as well as government agencies. GP Strategies Corporation was founded in 1959 and is headquartered in Columbia, Maryland.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Columbia"}, "HM0.F": {"short_name": "HOUGH.MIFFIN HARCOU.DL-01", "long_name": "Houghton Mifflin Harcourt Company", "summary": "Houghton Mifflin Harcourt Company, a learning company, provides curriculum, supplemental, intervention solutions, and professional learning services worldwide. The company operates in two segments, Education and HMH Books & Media. The Education segment provides educational products, technology platforms, and services, including print and digital content in the form of textbooks, digital courseware, instructional aids, educational assessment, and intervention solutions for students. The Trade Publishing segment primarily develops, markets, and sells consumer books in print and digital formats, as well as licenses book rights to other publishers and electronic businesses; and reference materials, such as fiction and non-fiction books, dictionaries, and other reference works to schools, colleges, libraries, office supply distributors, and other businesses. This segment distributes products through retail stores comprising physical and online, and wholesalers. The company was formerly known as HMH Holdings (Delaware), Inc. and changed its name to Houghton Mifflin Harcourt Company in October 2013. Houghton Mifflin Harcourt Company was founded in 1832 and is headquartered in Boston, Massachusetts.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Boston"}, "HMHC": {"short_name": "Houghton Mifflin Harcourt Compa", "long_name": "Houghton Mifflin Harcourt Company", "summary": "Houghton Mifflin Harcourt Company, a learning company, provides curriculum, supplemental, intervention solutions, and professional learning services worldwide. The company operates in two segments, Education and HMH Books & Media. The Education segment provides educational products, technology platforms, and services, including print and digital content in the form of textbooks, digital courseware, instructional aids, educational assessment, and intervention solutions for students. The Trade Publishing segment primarily develops, markets, and sells consumer books in print and digital formats, as well as licenses book rights to other publishers and electronic businesses; and reference materials, such as fiction and non-fiction books, dictionaries, and other reference works to schools, colleges, libraries, office supply distributors, and other businesses. This segment distributes products through retail stores comprising physical and online, and wholesalers. The company was formerly known as HMH Holdings (Delaware), Inc. and changed its name to Houghton Mifflin Harcourt Company in October 2013. Houghton Mifflin Harcourt Company was founded in 1832 and is headquartered in Boston, Massachusetts.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Boston"}, "ISTC": {"short_name": "INSTRUCTIVISION INC", "long_name": "Instructivision, Inc.", "summary": "Instructivision, Inc. operates as a New Jersey test preparation company. The company offers a range of materials and services for the SAT, including workbooks, computer software, and staff development seminars; and workbooks on mathematics, science reasoning, reading, and English for improving ACT college admission test scores. It also provides a range of products to prepare the student in grade 3 through 8 for the NJ-ASK and NJ-HSPA. In addition, the company offers pre-and post-tests, diagnostic tests, and online tests; benchmarks; formative assessments and summative assessments; grading and reports; lesson plans; instructional materials; and training and professional development programs. Instructivision, Inc. was founded in 1981 and is based in Pine Brook, New Jersey.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pine Brook"}, "LAUR": {"short_name": "Laureate Education, Inc.", "long_name": "Laureate Education, Inc.", "summary": "Laureate Education, Inc., together with its subsidiaries, provides higher education programs and services to students through a network of universities and higher education institutions. It offers a range of undergraduate and graduate degree programs primarily in the areas of business and management, medicine and health sciences, and engineering and information technology through campus-based, online, and hybrid programs. The company also operates online institutions that offer professional degree programs primarily for the working adults with undergraduate and graduate degree programs. It provides its services in Brazil, Mexico, Chile, Peru, Australia, China, New Zealand, the United Kingdom, and the United States. The company was formerly known as Sylvan Learning Systems, Inc. and changed its name to Laureate Education, Inc. in May 2004. The company was founded in 1989 and is headquartered in Baltimore, Maryland.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Baltimore"}, "LEAI": {"short_name": "LEGACY EDUCATION ALLIANCE INC", "long_name": "Legacy Education Alliance, Inc.", "summary": "Legacy Education Alliance, Inc. provides educational training on the topics of personal finance, entrepreneurship, real estate, and financial markets investing strategies and techniques in North America, the United Kingdom, and internationally. The company offers its services under the Legacy Education and Homemade Investor by Tarek El Moussa brands. Legacy Education Alliance, Inc. provides its programs through various formats and channels, including free workshops, basic training classes, symposiums, forums, telephone mentoring, one-on-one mentoring, coaching, and e-learning. The company is based in Cape Coral, Florida.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cape Coral"}, "LINC": {"short_name": "Lincoln Educational Services Co", "long_name": "Lincoln Educational Services Corporation", "summary": "Lincoln Educational Services Corporation, together with its subsidiaries, provides various career-oriented post-secondary education services to high school graduates and working adults in the United States. The company operates through three segments: Transportation and Skilled Trades, Healthcare and Other Professions, and Transitional. It offers associate's degree, and diploma and certificate programs in automotive technology; skilled trades, including welding, computerized numerical control, and electrical and electronic systems technology, as well as heating, ventilating, and air conditioning programs; healthcare services comprising nursing, dental assistant, medical administrative assistant, etc.; hospitality services, such as culinary, therapeutic massage, cosmetology, and aesthetics; and information technology. The company operates 22 campuses in 14 states under the Lincoln Technical Institute, Lincoln College of Technology, Lincoln Culinary Institute, and Euphoria Institute of Beauty Arts and Sciences, as well as associated brand names. As of December 31, 2019, it had 11,285 students enrolled at 22 campuses. Lincoln Educational Services Corporation was founded in 1946 and is based in West Orange, New Jersey.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "West Orange"}, "LOPE": {"short_name": "Grand Canyon Education, Inc.", "long_name": "Grand Canyon Education, Inc.", "summary": "Grand Canyon Education, Inc. provides education services to colleges and universities in the United States. The company's technology services include learning management system, internal administration, infrastructure, and support services; academic services comprises program and curriculum, faculty and related training and development, class scheduling, and skills and simulation lab sites; and counseling services and support include admission, financial aid, and field experience counseling services. It also offers marketing and communication services, such as lead acquisition, digital communications strategy, brand identity, media planning and strategy, video, and data science and analysis services; and back office services comprising finance and accounting, human resources, audit, procurement services. The company, through its subsidiary, Orbis Education Services, LLC, supports healthcare education programs for 22 universities. Grand Canyon Education, Inc. was founded in 1949 and is based in Phoenix, Arizona.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Phoenix"}, "LRN": {"short_name": "Stride, Inc.", "long_name": "Stride, Inc.", "summary": "Stride, Inc., a technology-based education company, provides proprietary and third-party online curriculum, software systems, and educational services to facilitate individualized learning for students primarily in kindergarten through 12th grade (K-12) in the United States and internationally. The company offers managed public school programs, which offer an integrated package of systems, services, products, and professional services that K12 administers to support an online or blended public school, including administrative support, information technology and provisioning, academic support, curriculum, learning systems, and instructional services. It also provides institutionalÂ\u0096non-managed public school programs, which offers instruction, curriculum, supplemental courses, marketing, enrollment, and other educational services; and institutional software and services, such as educational software and services to school districts, public schools, and other educational institutions. In addition, the company offers private pay schools and other services; and talent development services for individuals and enterprises in information technology fields. Further, it provides curriculum portfolios, pre-K and K-8 courses, high school courses, learning applications, and learning management systems; and TotalView, a student information system, which include a suite of online applications that offers administrators, teachers, parents, and students a view of student attendance, truancy management, graduation planning, communications, and learning kit shipment tracking. Additionally, the company provides a suite of services, such as academic support, and administrative and technology to students and their families, as well as directly to virtual and blended public schools, traditional schools, and school districts. It sells individual K-8 online courses and supplemental educational products directly to families. The company was formerly known as K12 Inc. and changed its name to Stride, Inc. in December 2020. Stride, Inc. was founded in 2000 and is headquartered in Herndon, Virginia.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Herndon"}, "LTRE": {"short_name": "LEARNING TREE INTERNATIONAL INC", "long_name": "Learning Tree International, Inc.", "summary": "Learning Tree International, Inc., together with its subsidiaries, develops, markets, and delivers a library of instructor-led classroom courses for professional development needs of information technology (IT) professionals and managers worldwide. It offers education and training courses across a range of technical and management disciplines, such as operating systems, databases, computer networks, cyber and network security, Web development, programming languages, software engineering, open source applications, project management, business skills, leadership, and professional development. The company also provides courses through its proprietary live online learning platform, Learning Tree AnyWare that allow individuals at any location to participate online in instructor-led classes conducted live in its Education Centers, at customer locations, or at other facilities; and workforce optimization solutions to support an IT organization's life-cycle of workforce development needs. As of September 29, 2018, its library of instructor-led courses comprised 299 instructor-led course titles, including 181 multi-day IT course titles, 82 multi-day management course titles, and 36 one-day course titles. The company markets and sells its course offerings through direct and electronic mail, telemarketing, and field sales channels. It serves national and multinational companies, government organizations, and small and medium-size companies. The company was founded in 1974 and is headquartered in Herndon, Virginia. Learning Tree International, Inc. is a subsidiary of The Kevin Ross Gruneich Legacy Trust.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Herndon"}, "MMTS": {"short_name": "MULTI-MEDIA TUTORIAL SERVICES I", "long_name": "Multi-Media Tutorial Services, Inc.", "summary": "Multi-Media Tutorial Services, Inc. provides math multi-media tutorial review programs for elementary school, middle school, high school, and colleges in the United States and internationally. The company offers math DVD programs in the areas of basic arithmetic, middle school math, pre algebra, algebra, geometry, trigonometry, intermediate algebra, calculus 1, calculus 2, advanced calculus, probability and statistics, and GED review. It also offers tutoring in various subjects, such as physical science, biology, chemistry, physics, SAT, GED, ACT, Accuplacer, CLEP, English composition, and grammar. Multi-Media Tutorial Services, Inc. was formerly known as Intechnica International, Inc. and changed its name to Multi-Media Tutorial Services, Inc. in November 1994. The company was founded in 1987 and is based in Brooklyn, New York.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Brooklyn"}, "MNMT": {"short_name": "MOTIVATING THE MASSES INC", "long_name": "Motivating the Masses, Inc.", "summary": "Motivating the Masses, Inc. provides professional development and coaching services to small businesses and entrepreneurs in the United States. It operates through two segments, Business and Personal. The company offers personal and business coaching programs through a package of books and DVDs; and training and development programs through local and national seminars, on-site employee training, public and private speaking engagements, and customized life-coaching programs. Its services include Global Leadership Program that offers group coaching services; Executive Coaching services; Business Academy training programs for entrepreneurs to grow their brand; Keynotes/Speaking services at industry events and at private gatherings; Speak And Write to Make Millions, a live training program, which teaches attendees how to speak powerfully and to write best sellers; and Speakers Vault, a comprehensive on-line training program for speakers. The company's services also comprise Breakthrough the Retreat, an intensive program for executives and entrepreneurs ready; Abundance Now, a 12-part online course; Transformational Coaching services for personal development; and Motivating the Teen Spirit, an advanced life skills training for teens and their parents, as well as online modules, such as 28 Days To Results and No Matter What. Motivating the Masses, Inc. was founded in 1998 and is headquartered in Carlsbad, California.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carlsbad"}, "NAUH": {"short_name": "NATIONAL AMERICAN UNIVERSITY HL", "long_name": "National American University Holdings, Inc.", "summary": "National American University Holdings, Inc. owns and operates National American University (NAU) that provides professional and technical postsecondary education primarily for working adults and other non-traditional students in the United States. It operates in two segments, NAU and Other. The company offers diploma, associate, baccalaureate, master's, and doctoral degree programs in business-related disciplines, such as accounting, management, business administration, and information technology; healthcare-related disciplines, including occupational therapy, medical assisting, nursing, surgical technology, and healthcare information and management; legal-related disciplines comprising paralegal, criminal justice, and professional legal studies; and higher education. As of July 31, 2019, it operated five 33 educational sites in Colorado, Indiana, Kansas, South Dakota, and Texas; and distance learning service centers and administration offices in Rapid City, South Dakota, as well as through the Internet. The company also engages in the real estate business, which rents apartment units; and develops and sells condominium units in the Fairway Hills Planned Residential Development area of Rapid City, South Dakota. National American University Holdings, Inc. was founded in 1941 and is headquartered in Rapid City, South Dakota.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rapid City"}, "NPD.F": {"short_name": "GP STRATEGIES CORP DL-,01", "long_name": "GP Strategies Corporation", "summary": "GP Strategies Corporation provides performance improvement and learning solutions worldwide. The company operates in two segments, Workforce Excellence and Business Transformation Services. The Workforce Excellence segment offers managed learning services, including strategic learning and development consulting; digital learning content design and development solutions; and a suite of learning operations services, such as managed facilitation and delivery, managed training administration and logistics, help desk support, and event and vendor management. This segment also provides engineering and technical services comprising design, development and delivery of technical work-based learning, plant launch initiatives, engineering design and construction management, fabrication, management, operational excellence consulting, chemical demilitarization, homeland security, emergency management support, and asset management and performance improvement consulting, as well as technical documentation services; EtaPRO performance and condition monitoring system, a suite of real-time digital solutions for facilities and power-generating units; and GPiLEARN+ portal, a web-based off-the-shelf delivery format of technical courses. The Business Transformation Services segment offers custom product sales training and service technical training primarily to automotive manufacturers and service technicians; and organizational development solutions, including strategy, leadership, employee engagement and culture consulting, enterprise technology implementation and adoption, and organization design and business performance consulting. It serves companies in the automotive, financial services and insurance, pharmaceutical, oil and gas, power, chemical, electronics and technology, manufacturing, software, retail, healthcare, education, and food and beverage industries, as well as government agencies. GP Strategies Corporation was founded in 1959 and is headquartered in Columbia, Maryland.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Columbia"}, "OTED": {"short_name": "OAK TREE EDUCATIONAL PARTNERS I", "long_name": "Oak Tree Educational Partners, Inc.", "summary": "Oak Tree Educational Partners, Inc. owns and operates vocational training and technical schools in the United States. The company provides vocational education courses for the employees in the heath care and medical industries; and educational skills and vocational training in commercial cooking, catering, hotel operations, and customer service. It also offers review and update courses, seminars, and study materials that aid student registered nurse anesthetists and graduate registered nurse anesthetists in preparation for the national certifying exam, as well as publishes course manuals. In addition, the company provides distance learning programs in the fields and industries of medical office assistant, medical billing and coding, hotel-motel front office, veterinary assistant, paralegal, and pharmacy technician; and residential training programs in medical billing and coding, as well as programs in pharmacy technology and phlebotomy. Further, it offers student services to assist students with a range of administrative, advisory, referral, and employment assistance matters; and culinary training programs comprising commercial cooking plus externship, commercial cooking and catering plus externship, customer service, and hotel operations courses in classroom, kitchen, and industry environments. The company is based in New York, New York.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "PBYA": {"short_name": "PROBILITY MEDIA CORP", "long_name": "ProBility Media Corporation", "summary": "ProBility Media Corporation provides compliance and e-learning solutions worldwide. The company offers technical codes and standards, training materials, work place guides, online e-learning, and testing and certifications services; technical professionals with the information required to design products and construct and complete engineering projects; and content on engineering and technical standards, codes, specifications, handbooks, reference books, journals, and other scientific and technical documents for engineering projects. It also operates a bookstore in Houston, Texas; and an e-commerce Website, www.browntechnical.org. In addition, the company provides print and electronic codes and standards used by engineers and tradesmen to ensure that they are following the national and local building and industrial codes as they perform their jobs; sells individual print and electronic versions of individual codes and subscriptions to sets of codes, as well as aids and guides that assist engineers and tradesmen; and publishes its own content and resells the content of independent third parties. Further, it produces and distributes online training courses aimed at its target market; provides printed reference materials in addition to e-books, downloadable digital formatting, and mobile applications; and offers HVAC, plumbing, industrial, and residential trade reference materials with online training for product education, certification, and code practices. Additionally, the company offers e-learning courses and weekly training classes for contractors. It serves electrical distributors, including bookstores, trade/vocational schools, universities, retail chains, specialty retailers, and independent hardware stores, as well as small to medium sized business market governmental institutions and private sectors. The company offers its services under the Brown, One Exam Prep, NEWP, and W Marketing brands. ProBility Media Corporation is based in Pasadena, Texas.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pasadena"}, "PCSV": {"short_name": "PCS EDVENTURES COM INC", "long_name": "PCS Edventures!.com, Inc.", "summary": "PCS Edventures!.com, Inc. develops, markets, and distributes technology-based educational products and services to the pre-kindergarten through university classroom, the K-12 afterschool, the private learning center, and the home school markets in the United States and internationally. Its products include PCS Edventures! Labs, a learning center that offers teaching in science, technology, engineering, and math (STEM); and PCS BrickLab, a system of building blocks combined with PCS curriculum resources that address technology, math, construction engineering, communication, and science principles. The company also provides PCS Digital Media Labs, which contains lesson plans, a hard cover mobile case, digital cameras, camcorders or voice recorders, accessories, and a teacher guide; and PCS Academy of Engineering Lab, a STEM based program that is designed for use in tech-ed programs and for various environments through 10 student modules, such as hardware, software, lab furniture, and curriculum. In addition, it offers PCS Edventures Robotics system, a platform that provides various robotics lab implementations to its RiQ robot kits for home users, as well as engages students in various areas, including computer programming, physics, math, and other topics; PCS Discover STEM Lab, a modular program that provides activities for afterschool facilitators in the areas of STEM; summer camp packages, which offer summer camp solutions for schools and afterschool programs; and Riot, a racing drone product. The company was formerly known as PCS Education Systems, Inc. and changed its name to PCS Edventures!.com, Inc. in March 2000. PCS Edventures!.com, Inc. was incorporated in 1994 and is based in Boise, Idaho.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boise"}, "PRDO": {"short_name": "Perdoceo Education Corporation", "long_name": "Perdoceo Education Corporation", "summary": "Perdoceo Education Corporation operates colleges, institutions, and universities that provide education to student population in various career-oriented disciplines through online, campus based, and blended learning programs in the United States. It operates through two segments, Colorado Technical University and American InterContinental University. The company offers doctoral, master's, bachelor's, and associate degrees, as well as certificate programs. It also provides academic programs in the career-oriented disciplines of business studies, nursing, computer science, engineering, information systems and technologies, cybersecurity, criminal justice, and healthcare management. As of December 31, 2019, the company had a total student enrollment of approximately 36,600 students. The company was formerly known as Career Education Corporation and changed its name to Perdoceo Education Corporation in January 2020. Perdoceo Education Corporation was incorporated in 1994 and is headquartered in Schaumburg, Illinois.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Schaumburg"}, "SIBE": {"short_name": "SIBLING GROUP HOLDINGS INC", "long_name": "Sibling Group Holdings, Inc.", "summary": "Sibling Group Holdings, Inc., doing business as a Global Personalized Academics, operates as an education company that provides virtual and classroom learning solutions to students and teachers worldwide. The company offers digital curriculum, including core, electives, AP, world language, and credit recovery courses for K-12 grade students; online and face-to-face professional teacher training; access to learning management software; end-to-end online school solutions, such as online courses, learning management systems, and a teacher for tuition on per student and per semester basis; and international dual-diploma courses. It serves approximately 150 school districts in the United States. The company was formerly known as Sibling Entertainment Group Holdings, Inc. and changed its name to Sibling Group Holdings, Inc. Sibling Group Holdings, Inc. was founded in 2010 and is headquartered in Orlando, Florida.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Orlando"}, "SQE.F": {"short_name": "STRATEGIC EDUCAT.  DL-,01", "long_name": "Strategic Education, Inc.", "summary": "Strategic Education, Inc., through its subsidiaries, provides a range of post-secondary education and non-degree programs in the United States. The company operates through three segments: Strayer University, Capella University, and Non-Degree Programs. It operates Strayer University that provides undergraduate and graduate degree programs in business administration, accounting, information technology, education, health services administration, public administration, and criminal justice for working adult students through its 77 physical campuses located in the eastern United States, as well as through online; and an executive MBA online through its Jack Welch Management Institute. The company also operates Capella University, an online post-secondary education company, which offers various bachelor's, master's, and doctoral degree programs in public service leadership, nursing and health sciences, psychology, business and technology, counseling and human services, and education primarily for working adults. In addition, it is involved in the operation of a software development school that provides Web Development, iOS development, and UX design programs in person at classrooms in Lehi, Utah, Dallas, Texas; and Phoenix, Arizona, as well as through online. Further, the company operates a software engineering school for women, which offers software development programs in person through classrooms in the San Francisco Bay area; and provides non-degree Web and application software development courses, as well as self-paced online learning courses. It offers its non-degree programs primarily for workers and their employers. Strategic Education, Inc. was founded in 1892 and is headquartered in Herndon, Virginia.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Herndon"}, "STRA": {"short_name": "Strategic Education, Inc.", "long_name": "Strategic Education, Inc.", "summary": "Strategic Education, Inc., through its subsidiaries, provides a range of post-secondary education and non-degree programs in the United States. The company operates through three segments: Strayer University, Capella University, and Non-Degree Programs. It operates Strayer University that provides undergraduate and graduate degree programs in business administration, accounting, information technology, education, health services administration, public administration, and criminal justice for working adult students through its 77 physical campuses located in the eastern United States, as well as through online; and an executive MBA online through its Jack Welch Management Institute. The company also operates Capella University, an online post-secondary education company, which offers various bachelor's, master's, and doctoral degree programs in public service leadership, nursing and health sciences, psychology, business and technology, counseling and human services, and education primarily for working adults. In addition, it is involved in the operation of a software development school that provides Web Development, iOS development, and UX design programs in person at classrooms in Lehi, Utah, Dallas, Texas; and Phoenix, Arizona, as well as through online. Further, the company operates a software engineering school for women, which offers software development programs in person through classrooms in the San Francisco Bay area; and provides non-degree Web and application software development courses, as well as self-paced online learning courses. It offers its non-degree programs primarily for workers and their employers. Strategic Education, Inc. was founded in 1892 and is headquartered in Herndon, Virginia.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Herndon"}, "TIGE": {"short_name": "TIGRENT INC", "long_name": "Tigrent Inc.", "summary": "Tigrent Inc., together with its subsidiaries, provides practical value-based training, conferences, publications, technology-based tools, and mentoring services. It offers instruction and mentoring on the topics of real estate, financial instruments investing, and entrepreneurship in the United States, the United Kingdom, and Canada. The company's training courses include Building Wealth, a curriculum focused on real estate and the fundamentals of negotiating real estate purchases with sellers, rehabilitating distressed properties, and leasing rental units to tenants; and Making Money from Property with Martin Roberts, a real estate curriculum focused on property auctions. Its training courses also comprise Teach Me To Trade, a curriculum focused on financial instrument trading strategies using software and specific teaching techniques; Women in Wealth that teaches women how to take control of their financial circumstances; and Business Success Systems, a business basics curriculum focused on the small business ideas and opportunities that are available to individuals. The company, through its licensing agreement with Rich Global, markets various courses and training programs under the Rich Dad brand, including Rich Dad Learn to be Rich that focuses on real estate training; and Rich Dad Stock Success, which concentrates on financial instruments training. Tigrent Inc. enables customers to access training content through various delivery channels, including live instruction in classroom settings, onsite mentoring, telephonic coaching, conferences, teleconferences, and electronic media, as well as electronic access to live online or pre-recorded on-demand programs. The company was formerly known as Whitney Information Network, Inc. and changed its name to Tigrent Inc. in September 2009. Tigrent Inc. was founded in 1992 and is based in Cape Coral, Florida.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cape Coral"}, "TWOU": {"short_name": "2U, Inc.", "long_name": "2U, Inc.", "summary": "2U, Inc. operates as an education technology company in the United States, Hong Kong, South Africa, and the United Kingdom. It operates in two segments, Graduate Program Segment and Short Course Segment. The Graduate Program Segment targets students seeking a full graduate degree. The Short Course Segment targets working professionals seeking career advancement through skills attainment. The company builds, delivers, and supports online graduate programs and certificates for working adults through its 2U Operating System, a platform that provides front-end and back-end cloud-based SaaS technology and technology-enabled services to university clients. The company was formerly known as 2Tor Inc. and changed its name to 2U, Inc. in October 2012. 2U, Inc. was founded in 2008 and is headquartered in Lanham, Maryland.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Lanham"}, "UTI": {"short_name": "Universal Technical Institute I", "long_name": "Universal Technical Institute, Inc.", "summary": "Universal Technical Institute, Inc. provides postsecondary education for students seeking careers as professional automotive, diesel, collision repair, motorcycle, and marine technicians in the United States. It offers certificate, diploma, or degree programs; and specialized technical education programs under various brands, such as Universal Technical Institute, Motorcycle Mechanics Institute and Marine Mechanics Institute, and NASCAR Technical Institute. The company also provides manufacturer specific advanced training programs, including student paid electives at its campuses; and manufacturer or dealer sponsored training at various campuses and dedicated training centers, as well as offers programs for welding and computer numeric control machining. As of November 18, 2020, it operated 12 campuses. Universal Technical Institute, Inc. was founded in 1965 and is headquartered in Phoenix, Arizona.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Phoenix"}, "VCTL": {"short_name": "RAINMAKER SYSTEMS INC", "long_name": "Rainmaker Systems, Inc.", "summary": "Rainmaker Systems, Inc. provides B2B small and medium-sized business sales and service solutions. It develops Rainmaker Revenue Delivery Platform, an integrated solution that combines specialized sales and marketing services coupled with its proprietary, renewals software, and business analytics. The company's services include marketing strategy development, personalized renewals or subscription e-commerce and microsite creation and hosting, inbound and outbound e-mail, direct mail, chat, and global call center services. It also offers ViewCentral SaaS platform that provides an end-to-end solution for the management and delivery of training and certification programs for corporations. The company markets its products and services through a direct sales force to enterprises in hardware, software, software as a service, and telecommunications industries. Rainmaker Systems, Inc. was founded in 1991 and is headquartered in Campbell, California.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Campbell"}, "VRED": {"short_name": "VIRTUAL ED LINK INC", "long_name": "Virtual Ed Link, Inc.", "summary": "Virtual Ed Link, Inc. provides safety and security management systems to public and private schools, and higher education institutions in the United States. The company offers Virtual Ed Link, a Web 2.0 portal application, which manages mission-critical information enabling users to customize the way they collect, process, and distribute real-time data. Its safety and security management systems enable instant sending of departmental or geographically targeted alerts; easy communication with on-staff first responders and local emergency officials; real-time notification and response from students, faculty, and staff; informed decision making based on real time relevant information; and message sending to students, and outreach to people with disabilities. Virtual Ed Link, Inc. is based in Fairfield, New Jersey.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Fairfield"}, "WPOB.F": {"short_name": "GRAHAM HLDGS CO.", "long_name": "Graham Holdings Company", "summary": "Graham Holdings Company, through its subsidiaries, operates as a diversified education and media company worldwide. It provides test preparation services and materials; data science education, and training and healthcare simulation services; professional training and exam preparation for professional certifications and licensures; and non-academic operations support services to Purdue University Global. The company also offers training, test preparation, and degrees for accounting and financial services professionals; English-language training, academic preparation programs, and test preparation for English proficiency exams; and A-level examination preparation services, as well as operates three colleges, including one business school, one higher education institution, and one online learning institution. In addition, it owns and operates seven television stations; and provides social media management tools designed to connect newsrooms with their users, as well as produces Foreign Policy magazine and ForeignPolicy.com website. Further, the company publishes Slate, an online magazine; and two French-language news magazine websites at slate.fr and slateafrique.com. Additionally, it provides marketing solutions on social, mobile, and video platforms; home health and hospice services; burners, igniters, dampers, and controls; screw jacks, linear actuators and related linear motion products, and lifting systems; pressure impregnated kiln-dried lumber and plywood products; cybersecurity training solutions; digital advertising services; and power charging and data systems, industrial and commercial indoor lighting solutions, and electrical components and assemblies. The company also owns and operates 13 restaurants; and engages in automobile dealerships business. The company was formerly known as The Washington Post Company and changed its name to Graham Holdings Company in November 2013. Graham Holdings Company was founded in 1877 and is based in Arlington, Virginia.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Education & Training Services", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Arlington"}}