{
    "76K.SG": {
        "short_name": "WEIS MARKETS INC. Registered Sh",
        "long_name": "Weis Markets, Inc.",
        "summary": "Weis Markets, Inc. engages in the retail sale of food in Pennsylvania and surrounding states. The company's retail food stores sell groceries, dairy products, frozen foods, meats, seafood, fresh produce, floral, pharmacy services, deli products, prepared foods, bakery products, beer and wine, and fuel; and general merchandise items, such as health and beauty care, and household products. It operates stores primarily under the Weis Markets trade name, as well as trademarks for its product lines and promotions, such as Weis, Weis 2 Go, Weis Great Meals Start Here, Weis Gas-n-Go, and Weis Nutri-Facts. As of December 31, 2019, the company owned and operated 197 retail food stores including 4 stores in Delaware, 50 stores in Maryland, 6 stores in New Jersey, 9 stores in New York, 116 stores in Pennsylvania, 11 stores in Virginia, and 2 stores in West Virginia. Weis Markets, Inc. was founded in 1912 and is based in Sunbury, Pennsylvania.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Sunbury"
    },
    "ACI": {
        "short_name": "Albertsons Companies, Inc.",
        "long_name": "Albertsons Companies, Inc.",
        "summary": "Albertsons Companies, Inc., through its subsidiaries, operates as a food and drug retailer in the United States. Its food and drug retail stores offer grocery products, general merchandise, health and beauty care products, pharmacy, fuel, and other items and services. As of February 29, 2020, the company operated 2,252 stores under various banners, including Albertsons, Safeway, Vons, Jewel-Osco, Shaw's, Acme, Tom Thumb, Randalls, United Supermarkets, Market Street, Pavilions, Star Market, Carrs, and Haggen; and 1,726 pharmacies, 1,290 in-store branded coffee shops, and 402 adjacent fuel centers. The company was founded in 1939 and is headquartered in Boise, Idaho. Albertsons Companies, Inc. operates as a subsidiary of Albertsons Investor Holdings LLC.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Boise"
    },
    "CASY": {
        "short_name": "Caseys General Stores, Inc.",
        "long_name": "Casey's General Stores, Inc.",
        "summary": "Casey's General Stores, Inc., together with its subsidiaries, operates convenience stores under the Casey's and Casey's General Store names. The company's stores offer a selection of food, including freshly prepared foods, such as pizza, donuts, and sandwiches; beverages, tobacco, and nicotine products; health and beauty aids; automotive products; and other nonfood items. Its stores also provide fuel for sale on a self-service basis. In addition, the company operates two stores under the Tobacco City name primarily selling tobacco and nicotine products; one liquor stores; and one grocery store. As of April 30, 2020, it operated 2,207 convenience stores in 16 states in the Midwest. Casey's General Stores, Inc. was founded in 1959 and is headquartered in Ankeny, Iowa.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Ankeny"
    },
    "CS2.F": {
        "short_name": "CASEY'S GENL STORES",
        "long_name": "Casey's General Stores, Inc.",
        "summary": "Casey's General Stores, Inc., together with its subsidiaries, operates convenience stores under the Casey's and Casey's General Store names. The company's stores offer a selection of food, including freshly prepared foods, such as pizza, donuts, and sandwiches; beverages, tobacco, and nicotine products; health and beauty aids; automotive products; and other nonfood items. Its stores also provide fuel for sale on a self-service basis. In addition, the company operates two stores under the Tobacco City name primarily selling tobacco and nicotine products; one liquor stores; and one grocery store. As of April 30, 2020, it operated 2,207 convenience stores in 16 states in the Midwest. Casey's General Stores, Inc. was founded in 1959 and is headquartered in Ankeny, Iowa.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Ankeny"
    },
    "FFPM": {
        "short_name": "FFP MARKETING INC",
        "long_name": "FFP Marketing Company, Inc.",
        "summary": "FFP Marketing Company, Inc., through its subsidiaries, operates convenience stores with gas station. It also retails motor fuel, merchandise, and ancillary products and services at convenience stores, and truck stop. The company operates motor fuel terminal and processing facility. The convenience stores sell groceries, tobacco product, take-out food and beverages, dairy products, and non-food merchandise, such as money order, telephone calling cards, lottery tickets, health and beauty aid, magazines, and motor fuel. The company sells motor fuel on a wholesale basis to independent, regional chain and end user, such as contractors, operators of vehicle fleet, and public utilities. The company was founded in 1997 and is based in Fort Worth, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Fort Worth"
    },
    "GO": {
        "short_name": "Grocery Outlet Holding Corp.",
        "long_name": "Grocery Outlet Holding Corp.",
        "summary": "Grocery Outlet Holding Corp. owns and operates a chain of grocery stores in the United States. The company offers products in various categories, such as dairy and deli, produce, and fresh meat and seafood products, as well as grocery, frozen, beer and wine, general merchandise, and health and beauty care products; and natural, organic, specialty, and healthy products. As of November 10, 2020, it had 350 stores in California, Washington, Oregon, Pennsylvania, Idaho, and Nevada. The company was founded in 1946 and is headquartered in Emeryville, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "EmeryVille"
    },
    "HCMC": {
        "short_name": "HEALTHIER CHOICES MANAGEMENT CO",
        "long_name": "Healthier Choices Management Corp.",
        "summary": "Healthier Choices Management Corp. provides e-liquids, vaporizers, and related products. The company operates through two segments, Natural and Organic Retail Stores, and Vapor Products. Its vaporizers are battery-powered products that enable users to inhale nicotine vapor without smoke, tar, ash, or carbon monoxide. The company sells its e-liquid under the Vape Store brand name; and offers its products through nine retail vape stores in the Southeast region of the United States. In addition, it offers fresh produce; bulk foods and private label products; vitamins and supplements; packaged groceries; meat and seafood; deli; baked goods, dairy products and substitutes; dry, frozen, and canned groceries; health and beauty products; and natural household items through Ada's Natural Market, a natural and organic grocery store. Further, the company provides prepared foods, bread and baked goods, beverages, body care, and household and general merchandise products, as well as Q-Cup technology for consumers who prefer to vape concentrates either medicinally or recreationally. It sells its product directly to consumers through the company owned retail vape stores. The company was formerly known as Vapor Corp. and changed its name to Healthier Choices Management Corp. in March 2017. Healthier Choices Management Corp. is headquartered in Hollywood, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Hollywood"
    },
    "HWIN": {
        "short_name": "HOMETOWN INTERNATIONAL INC",
        "long_name": "Hometown International, Inc.",
        "summary": "Hometown International, Inc., through its subsidiary, Your Hometown Deli Limited Liability Company, operates a delicatessen store under the Your Hometown Deli brand name in the United States. Its Your Hometown Deli store provides sandwiches; soups; salads, including made-to-order green salads, prepared pasta, potato, chicken, and various wet salads; deli meats/cheeses; hot/cold drinks; fresh breads/rolls; breakfast products, such as pastries, bagels, and toast; yogurt; and small retail items for cooking, baking, and home use, as well as coffee, tea, and other hot and cold beverages. The company was incorporated in 2014 and is based in Woodstown, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Woodstown"
    },
    "IFMK": {
        "short_name": "iFresh Inc.",
        "long_name": "iFresh Inc.",
        "summary": "iFresh Inc., through its subsidiaries, operates a network of grocery supermarket chains in the north-eastern United States. It operates through Wholesale and Retail segments. The company provides vegetables, seafood, meat, fruits, snacks, seasonings, and spices, such as peanut oil, cooking wine, vinegar, dark soy sauce, black bean sauce, pepper oil, and chilly oil; tea, condiments, canned goods, flour products, marine food products, candies groceries, traditional Chinese medicine, health products, and dried food; rice and rice products; assortment of noodles, frozen vegetables, frozen dumplings, frozen seafood products, and aquatic products; and cooking utensils. Its brand portfolio includes Family Elephant, Feiyan, Green Acre, Golden Smell, Redolent, and I FRESH. The company also distributes its products to wholesale stores, retail supermarkets, and restaurants. As of August 10, 2020, it operated nine retail supermarkets and two in-house wholesale businesses. The company offers its products through online sales channels and delivery network in suburban areas. iFresh Inc. was founded in 1995 and is headquartered in Long Island City, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Long Island City"
    },
    "IMKTA": {
        "short_name": "Ingles Markets, Incorporated",
        "long_name": "Ingles Markets, Incorporated",
        "summary": "Ingles Markets, Incorporated operates a chain of supermarkets in the southeast United States. Its supermarkets offer various food products, including grocery, meat and dairy products, produce, frozen foods, and other perishables; and non-food products, such as fuel centers, pharmacies, health and beauty care products, and general merchandise, as well as private label items. The company also provides home meal replacement items, delicatessens, bakeries, floral departments, and greeting cards, as well as organic, beverage, and health-related items. As of September 26, 2020, it operated 188 supermarkets under the Ingles name; and nine supermarkets under the Sav-Mor name in western North Carolina, western South Carolina, northern Georgia, eastern Tennessee, southwestern Virginia, and northeastern Alabama, as well as 109 pharmacies and 106 fuel stations. In addition, it is involved in fluid dairy operations and shopping center rental businesses. Ingles Markets, Incorporated was founded in 1963 and is headquartered in Asheville, North Carolina.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Asheville"
    },
    "KOG.DE": {
        "short_name": "KROGER CO.  DL 1",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates supermarkets, multi-department stores, marketplace stores, and price impact warehouse stores. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provides grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,567 fuel centers. As of March 25, 2020, the company operated 2,757 retail food stores under various banner names in 35 states and the District of Columbia, as well as an online retail store. The Kroger Co. has a strategic partnership with Ocado Solutions to construct three new customer fulfillment centers in the Great Lakes, Pacific Northwest, and West regions. The company was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KOG.F": {
        "short_name": "KROGER CO.  DL 1",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates supermarkets, multi-department stores, marketplace stores, and price impact warehouse stores. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provides grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,567 fuel centers. As of March 25, 2020, the company operated 2,757 retail food stores under various banner names in 35 states and the District of Columbia, as well as an online retail store. The Kroger Co. has a strategic partnership with Ocado Solutions to construct three new customer fulfillment centers in the Great Lakes, Pacific Northwest, and West regions. The company was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KR": {
        "short_name": "Kroger Company (The)",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates supermarkets, multi-department stores, marketplace stores, and price impact warehouse stores. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provides grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,567 fuel centers. As of March 25, 2020, the company operated 2,757 retail food stores under various banner names in 35 states and the District of Columbia, as well as an online retail store. The Kroger Co. has a strategic partnership with Ocado Solutions to construct three new customer fulfillment centers in the Great Lakes, Pacific Northwest, and West regions. The company was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "KR.MX": {
        "short_name": "KROGER CO",
        "long_name": "The Kroger Co.",
        "summary": "The Kroger Co. operates as a retailer in the United States. The company operates supermarkets, multi-department stores, marketplace stores, and price impact warehouse stores. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care departments, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and price impact warehouse stores provides grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets; and sells fuel through 1,567 fuel centers. As of March 25, 2020, the company operated 2,757 retail food stores under various banner names in 35 states and the District of Columbia, as well as an online retail store. The Kroger Co. has a strategic partnership with Ocado Solutions to construct three new customer fulfillment centers in the Great Lakes, Pacific Northwest, and West regions. The company was founded in 1883 and is based in Cincinnati, Ohio.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Cincinnati"
    },
    "MTVX": {
        "short_name": "APT MOTO VOX GROUP INC",
        "long_name": "APT Moto Vox Group Inc",
        "summary": "APT Group, Inc. is a holding company, which through its subsidiaries manufactures and distributes recreational, utility, and power sports products. The company, through its subsidiaries, offers mini bikes, electric and dirt bikes, go-karts, scooters, portable generators, carburetors, and automotive engines. APT Group, Inc. was incorporated in 2012 and is based in Kansas City, Missouri.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Kansas City"
    },
    "N2V.F": {
        "short_name": "NAT.GRO.BY VIT.COT.DL-001",
        "long_name": "Natural Grocers by Vitamin Cottage, Inc.",
        "summary": "Natural Grocers by Vitamin Cottage, Inc., together with its subsidiaries, retails natural and organic groceries, and dietary supplements in the United States. The company's stores offer natural and organic grocery products, such as organic produce; bulk food products; private label products comprising pasta, pasta sauce, ketchup, canned beans and vegetables, frozen vegetables, frozen fruits, bread, plant based butter, olive and coconut oil, coconut milk, honey, maple syrup, preserves, chocolate, coffee, bacon, beef jerky, canned seafood, popcorn, tortilla chips, taco shells, eggs, cheese, apple sauce, apple cider vinegar, spring water, paper products, cleaning products, and other products; dry, frozen, and canned groceries; meat and seafood products; dairy products, dairy substitutes, and eggs; prepared foods; bread and baked products; beverages; and beer, wine, and hard cider products. Its stores also provide private label dietary supplements; body care products consisting of cosmetics, skin care, hair care, fragrance, and personal care products containing natural and organic ingredients; pet care and food products; books and handouts; and household and general merchandise, including cleaning supplies, paper products, and dish and laundry soaps, as well as other common household products, such as diapers. The company operates its retail stores under the Natural Grocers by Vitamin Cottage trademark. As of December 03, 2020, it operated 160 stores in 20 states. The company also offers science-based nutrition education programs to help customers make informed health and nutrition choices. Natural Grocers by Vitamin Cottage, Inc. was founded in 1955 and is headquartered in Lakewood, Colorado.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Lakewood"
    },
    "NGVC": {
        "short_name": "Natural Grocers by Vitamin Cott",
        "long_name": "Natural Grocers by Vitamin Cottage, Inc.",
        "summary": "Natural Grocers by Vitamin Cottage, Inc., together with its subsidiaries, retails natural and organic groceries, and dietary supplements in the United States. The company's stores offer natural and organic grocery products, such as organic produce; bulk food products; private label products comprising pasta, pasta sauce, ketchup, canned beans and vegetables, frozen vegetables, frozen fruits, bread, plant based butter, olive and coconut oil, coconut milk, honey, maple syrup, preserves, chocolate, coffee, bacon, beef jerky, canned seafood, popcorn, tortilla chips, taco shells, eggs, cheese, apple sauce, apple cider vinegar, spring water, paper products, cleaning products, and other products; dry, frozen, and canned groceries; meat and seafood products; dairy products, dairy substitutes, and eggs; prepared foods; bread and baked products; beverages; and beer, wine, and hard cider products. Its stores also provide private label dietary supplements; body care products consisting of cosmetics, skin care, hair care, fragrance, and personal care products containing natural and organic ingredients; pet care and food products; books and handouts; and household and general merchandise, including cleaning supplies, paper products, and dish and laundry soaps, as well as other common household products, such as diapers. The company operates its retail stores under the Natural Grocers by Vitamin Cottage trademark. As of December 03, 2020, it operated 160 stores in 20 states. The company also offers science-based nutrition education programs to help customers make informed health and nutrition choices. Natural Grocers by Vitamin Cottage, Inc. was founded in 1955 and is headquartered in Lakewood, Colorado.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Lakewood"
    },
    "SFM": {
        "short_name": "Sprouts Farmers Market, Inc.",
        "long_name": "Sprouts Farmers Market, Inc.",
        "summary": "Sprouts Farmers Market, Inc., a healthy grocery store, provides fresh, natural, and organic food products in the United States. Its stores offer fresh produce, packaged groceries, meat and seafood, deli, vitamins and supplements, dairy and dairy alternatives, bulk items, baked goods, frozen foods, natural health and body care, beer and wine, and household items. As of February 20, 2020, it operated 341 stores in 22 states. Sprouts Farmers Market, Inc. was founded in 2002 and is based in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "SMMR": {
        "short_name": "SYMMETRY TECHNOLOGIES INC",
        "long_name": "Symmetry Technologies Inc.",
        "summary": "Symmetry Technologies Inc. develops data center, infrastructure, and network solutions. It provides managed information technology (IT) services, including maintenance plans that include planned service for network, reducing possibilities for unplanned outages; and networking services comprising professional implementation services for network projects. The company is based in Coral Gables, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Coral Gables"
    },
    "VLGEA": {
        "short_name": "Village Super Market, Inc.",
        "long_name": "Village Super Market, Inc.",
        "summary": "Village Super Market, Inc. operates a chain of supermarkets in the United States. Its stores feature specialty departments, such as an on-site bakery, an expanded delicatessen, various natural and organic foods, ethnic and international foods, prepared foods, and pharmacies. The company operates a chain of 30 ShopRite supermarkets, 5 Fairway Markets, and 3 Gourmet Garage specialty markets located in New Jersey, New York, Pennsylvania, and Maryland. Village Super Market, Inc. was founded in 1937 and is based in Springfield, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Springfield"
    },
    "WMK": {
        "short_name": "Weis Markets, Inc.",
        "long_name": "Weis Markets, Inc.",
        "summary": "Weis Markets, Inc. engages in the retail sale of food in Pennsylvania and surrounding states. The company's retail food stores sell groceries, dairy products, frozen foods, meats, seafood, fresh produce, floral, pharmacy services, deli products, prepared foods, bakery products, beer and wine, and fuel; and general merchandise items, such as health and beauty care, and household products. It operates stores primarily under the Weis Markets trade name, as well as trademarks for its product lines and promotions, such as Weis, Weis 2 Go, Weis Great Meals Start Here, Weis Gas-n-Go, and Weis Nutri-Facts. As of December 31, 2019, the company owned and operated 197 retail food stores including 4 stores in Delaware, 50 stores in Maryland, 6 stores in New Jersey, 9 stores in New York, 116 stores in Pennsylvania, 11 stores in Virginia, and 2 stores in West Virginia. Weis Markets, Inc. was founded in 1912 and is based in Sunbury, Pennsylvania.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Grocery Stores",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "Sunbury"
    }
}