{
    "0EF.F": {
        "short_name": "E.L.F. BEAUTY INC  DL-,01",
        "long_name": "e.l.f. Beauty, Inc.",
        "summary": "e.l.f. Beauty, Inc., through its subsidiaries, provides cosmetic and skin care products under the e.l.f. and W3LL PEOPLE brand names worldwide. The company offers eye, lip, face, and skin care products, as well as kits and tools. It sells its products through national and international retailers and direct-to-consumer channels, which include e-commerce platforms in the United States; and internationally primarily through distributors. The company was formerly known as J.A. Cosmetics Holdings, Inc. and changed its name to e.l.f. Beauty, Inc. in April 2016. e.l.f. Beauty, Inc. was founded in 2004 and is based in Oakland, California.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94607",
        "website": "http://www.elfcosmetics.com",
        "full_time_employees": 209
    },
    "2NF1.F": {
        "short_name": "SUMMER INFANT INC.",
        "long_name": "Summer Infant, Inc.",
        "summary": "Summer Infant, Inc., together with its subsidiaries, designs, markets, and distributes branded juvenile health, safety, and wellness products. It offers audio and video monitors; and gates, potties, entertainers, baby monitors, bath products, specialty blankets, strollers, car seats, and travel systems, as well as baby gear products under the Summer and SwaddleMe brand names. The company sells its products directly to retailers through own direct sales force and a network of independent manufacturers' representatives and distributors; and through partner's websites and its summerinfant.com website, as well as through international distributors, representatives, and to retail customers. It operates in the United States, Canada, Europe, South America, Mexico, Asia, and the Middle East. Summer Infant, Inc. was founded in 1985 and is headquartered in Woonsocket, Rhode Island.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "RI",
        "city": "Woonsocket",
        "zipcode": "02895",
        "website": "http://www.summerinfant.com",
        "full_time_employees": 115
    },
    "82W.F": {
        "short_name": "HIMS+HERS HERS A DL-,0001",
        "long_name": "Hims & Hers Health, Inc.",
        "summary": "Hims & Hers Health, Inc. operates a multi-specialty telehealth platform that connects consumers to licensed healthcare professionals. The company offers a range of health and wellness products and services available for purchase on its websites directly by customers. It provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, as well as cosmetics and supplement products, primarily focusing on wellness, sexual health, skincare, and hair care. The company's curated non-prescription products include vitamin C, melatonin, collagen protein, biotin, and teas in the wellness category; moisturizer, fragrances, face wash, and anti-wrinkle creams in the skincare category; condoms and lubricants in the sexual health category; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care category. It also offers medical consultation services; and engages in the wholesale of non-prescription product sales to retailers. Hims & Hers Health, Inc. is based in San Francisco, California.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94123",
        "website": "http://www.forhims.com",
        "full_time_employees": 181
    },
    "ACU": {
        "short_name": "Acme",
        "long_name": "Acme United Corporation",
        "summary": "Acme United Corporation, together with its subsidiaries, supplies cutting, measuring, first aid, sharpening, and safety products to the school, home, office, hardware, sporting good, and industrial markets in the United States, Canada, Europe, and Asia. It offers scissors, shears, rulers, pencil sharpeners, paper trimmers, safety cutters, lettering products, glue guns, and other craft products under the Westcott brand name; and cutting tools under the Clauss brand. It also provides fixed blades, folding knives, sight cutting tools, and tactical tools under the Camillus brand name; fishing tools and knives, as well as cut and puncture resistant gloves, telescopic landing nets, net containment systems, and fishing gaffs under the Cuda brand name; and sharpening tools under the DMT brand name. It offers first aid kit and safety solution under the First Aid Only brand; portable eyewash solution and over-the-counter medication, including active ingredients aspirin, acetaminophen, and ibuprofen under the PhysiciansCare brand; bodily fluid and spill clean-up solution under the Spill Magic brand; various first aid kit, refill, and safety supplies, including CPR kits, burn kits, and automotive and emergency survival kits under the First Aid Central; and alcohol prep pads, alcohol wipes, benzalkonium chloride wipes, various antiseptic wipes, castile soaps, and lens cleaning wipes under the Med-Nap brand. It sells its products directly and through its independent manufacturer representatives to wholesale, contract, and retail stationery distributors; office supply superstores; school supply distributors; industrial distributors; wholesale florists; mass market and e-commerce retailers; and hardware chains, as well as sells a selection of products through its websites. The company was formerly known as Acme Shear Company and changed its name to Acme United Corporation in 1971. The company was founded in 1867 and is based in Shelton, Connecticut.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "ASE",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Shelton",
        "zipcode": "06484",
        "website": "http://www.acmeunited.com",
        "full_time_employees": 552
    },
    "AQSP": {
        "short_name": "ACQUIRED SALES CORPORATION",
        "long_name": "Acquired Sales Corp.",
        "summary": "Acquired Sales Corp. primarily engages in the identification, structuring, and seeking to execute on acquisitions of all or a portion of one or more operating businesses. The company primarily focuses on businesses involved in the manufacture, sale, and distribution of cannabinoid-infused products, such as beverages, shots, water, other liquids, water soluble nano drops or liquids, lotions, sprays, conditioners, creams, oils, pre-rolled hemp joints and hemp cigarettes, cartridges, syringes, tinctures, powder, water packets, effervescent tablets, capsules, bath bombs, balms, body washes, gummies, food, other edibles, and non-prescription cannabinoid formulations. It is also involved in selling and distributing products containing nicotine and hand sanitizers. The company was incorporated in 1986 and is based in Jacksonville, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Jacksonville",
        "zipcode": "32217",
        "website": "http://www.acquiredsalescorp.com",
        "full_time_employees": 46
    },
    "AVVH": {
        "short_name": "AVVAA WORLD HEALTH CARE PROD IN",
        "long_name": "AVVAA World Health Care Products, Inc.",
        "summary": "AVVAA World Health Care Products, Inc. provides natural and therapeutic skin care products worldwide. The company is a biotechnology company which primarily focuses on manufacturing and marketing over-the-counter the Neuroskin line of products used for the treatment of skin abnormalities, and to enhance the natural clarity and texture of healthy skin through mass marketing food and drug channels. It also has distribution rights for patented European skin care products, which are scientifically developed to treat the symptoms of skin diseases, including eczema, psoriasis, and acne. The company also offers a line of natural animal care products, which is a grooming treatment for dogs, cats, horses, and other pets. AVVAA World Health Care Products, Inc. was incorporated in 1998 and is based in Richmond, Virginia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "VA",
        "city": "Richmond",
        "zipcode": "23225",
        "website": null,
        "full_time_employees": 5
    },
    "BMXC": {
        "short_name": "BEMAX INC",
        "long_name": "Bemax Inc.",
        "summary": "Bemax Inc., a development stage company, engages in the distribution of disposable baby diapers to distributors and wholesalers in Europe, and South, East, and West Africa. The company was founded in 2012 and is based in Dallas, Georgia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Dallas",
        "zipcode": "30132",
        "website": "http://www.bemax.com",
        "full_time_employees": 1
    },
    "CAWW": {
        "short_name": "CCA INDUSTRIES",
        "long_name": "CCA Industries, Inc.",
        "summary": "CCA Industries, Inc. manufactures and distributes health and beauty aid products in the United States and internationally. It offers oral health-care products under the Plus+White brand; skin-care products under the Sudden Change and Porcelana brand names; nail treatments under the brand name of Nutra Nail; pre and after-shave products under the Bikini Zone brand; depilatories under the Hair Off brand; perfumes under the brand name of Sunset Cafe; ear-care products under the Lobe Miracle brand; and scar diminishing creams under the Scar Zone brand. The company markets its products to drug, food, and mass-merchandise retail chains; warehouse clubs; and wholesalers through independent sales representatives and distributors, as well as through Internet. CCA Industries, Inc. was founded in 1983 and is based in Lyndhurst, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Lyndhurst",
        "zipcode": "07071",
        "website": "http://www.ccainvestor.com",
        "full_time_employees": 14
    },
    "CHD.MX": {
        "short_name": "CHURCH & DWIGHT",
        "long_name": "Church & Dwight Co., Inc.",
        "summary": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; FLAWLESS products; and cold remedy products under the ZICAM brand. It also provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement that enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are used to reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ewing",
        "zipcode": "08628",
        "website": "http://www.churchdwight.com",
        "full_time_employees": 5100
    },
    "CHD": {
        "short_name": "Church & Dwight Company, Inc.",
        "long_name": "Church & Dwight Co., Inc.",
        "summary": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; FLAWLESS products; and cold remedy products under the ZICAM brand. It also provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement that enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are used to reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ewing",
        "zipcode": "08628",
        "website": "http://www.churchdwight.com",
        "full_time_employees": 5100
    },
    "CHD.VI": {
        "short_name": "CHURCH & DWIGHT CO INC",
        "long_name": "Church & Dwight Co., Inc.",
        "summary": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; FLAWLESS products; and cold remedy products under the ZICAM brand. It also provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement that enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are used to reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ewing",
        "zipcode": "08628",
        "website": "http://www.churchdwight.com",
        "full_time_employees": 5100
    },
    "CHDC34.SA": {
        "short_name": "CHURCH DWIGHDRN",
        "long_name": "Church & Dwight Co., Inc.",
        "summary": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; FLAWLESS products; and cold remedy products under the ZICAM brand. It also provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement that enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are used to reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ewing",
        "zipcode": "08628",
        "website": "http://www.churchdwight.com",
        "full_time_employees": 5100
    },
    "CL.BA": {
        "short_name": "COLGATE-PALMOLIVE",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "ARS",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "CL.MX": {
        "short_name": "COLGATE-PALMOLIVE CO",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "CL": {
        "short_name": "Colgate-Palmolive Company",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "CLX.MX": {
        "short_name": "CLOROX CO",
        "long_name": "The Clorox Company",
        "summary": "The Clorox Company manufactures and markets consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The company offers laundry additives, including bleach products under the Clorox brand, as well as Clorox 2 stain fighter and color booster; home care products primarily under the Clorox, Scentiva, Formula 409, Liquid-Plumr, Pine-Sol, S.O.S, and Tilex brands; naturally derived products under the Green Works brand; professional cleaning, disinfecting, and food service products under the CloroxPro, Clorox Healthcare, and Clorox Total 360 brands; professional food service products under the Hidden Valley brand; and vitamins, minerals, and supplement products under the RenewLife, Rainbow Light, Natural Vitality, NeoCell, and Stop Aging Now brands. It also provides grilling products under the Kingsford and Match Light brands; bags and wraps under the Glad brand; and cat litter products under the Fresh Step, Scoop Away, and Ever Clean brands. In addition, the company offers dressings and sauces primarily under the Hidden Valley brand; water-filtration systems and filters under the Brita brand; and natural personal care products under the Burt's Bees brand. Further, it markets its products under the Ayudin, Clorinda, and Poett brands. The company sells its products primarily through mass retailers, grocery outlets, warehouse clubs, dollar stores, home hardware centers, third-party and owned e-commerce channels, military stores, and distributors, as well as a direct sales force. Clorox has a collaboration partnership with Cleveland Clinic and the CDC Foundation. The Clorox Company was founded in 1913 and is headquartered in Oakland, California.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94612-1888",
        "website": "http://www.thecloroxcompany.com",
        "full_time_employees": 8800
    },
    "CLX": {
        "short_name": "Clorox Company (The)",
        "long_name": "The Clorox Company",
        "summary": "The Clorox Company manufactures and markets consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The company offers laundry additives, including bleach products under the Clorox brand, as well as Clorox 2 stain fighter and color booster; home care products primarily under the Clorox, Scentiva, Formula 409, Liquid-Plumr, Pine-Sol, S.O.S, and Tilex brands; naturally derived products under the Green Works brand; professional cleaning, disinfecting, and food service products under the CloroxPro, Clorox Healthcare, and Clorox Total 360 brands; professional food service products under the Hidden Valley brand; and vitamins, minerals, and supplement products under the RenewLife, Rainbow Light, Natural Vitality, NeoCell, and Stop Aging Now brands. It also provides grilling products under the Kingsford and Match Light brands; bags and wraps under the Glad brand; and cat litter products under the Fresh Step, Scoop Away, and Ever Clean brands. In addition, the company offers dressings and sauces primarily under the Hidden Valley brand; water-filtration systems and filters under the Brita brand; and natural personal care products under the Burt's Bees brand. Further, it markets its products under the Ayudin, Clorinda, and Poett brands. The company sells its products primarily through mass retailers, grocery outlets, warehouse clubs, dollar stores, home hardware centers, third-party and owned e-commerce channels, military stores, and distributors, as well as a direct sales force. Clorox has a collaboration partnership with Cleveland Clinic and the CDC Foundation. The Clorox Company was founded in 1913 and is headquartered in Oakland, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94612-1888",
        "website": "http://www.thecloroxcompany.com",
        "full_time_employees": 8800
    },
    "CLXC34.SA": {
        "short_name": "CLOROX CO   DRN",
        "long_name": "The Clorox Company",
        "summary": "The Clorox Company manufactures and markets consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The company offers laundry additives, including bleach products under the Clorox brand, as well as Clorox 2 stain fighter and color booster; home care products primarily under the Clorox, Scentiva, Formula 409, Liquid-Plumr, Pine-Sol, S.O.S, and Tilex brands; naturally derived products under the Green Works brand; professional cleaning, disinfecting, and food service products under the CloroxPro, Clorox Healthcare, and Clorox Total 360 brands; professional food service products under the Hidden Valley brand; and vitamins, minerals, and supplement products under the RenewLife, Rainbow Light, Natural Vitality, NeoCell, and Stop Aging Now brands. It also provides grilling products under the Kingsford and Match Light brands; bags and wraps under the Glad brand; and cat litter products under the Fresh Step, Scoop Away, and Ever Clean brands. In addition, the company offers dressings and sauces primarily under the Hidden Valley brand; water-filtration systems and filters under the Brita brand; and natural personal care products under the Burt's Bees brand. Further, it markets its products under the Ayudin, Clorinda, and Poett brands. The company sells its products primarily through mass retailers, grocery outlets, warehouse clubs, dollar stores, home hardware centers, third-party and owned e-commerce channels, military stores, and distributors, as well as a direct sales force. Clorox has a collaboration partnership with Cleveland Clinic and the CDC Foundation. The Clorox Company was founded in 1913 and is headquartered in Oakland, California.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94612-1888",
        "website": "http://www.thecloroxcompany.com",
        "full_time_employees": 8800
    },
    "CO3A.F": {
        "short_name": "COTY INC.CL.A  DL -,01",
        "long_name": "Coty Inc.",
        "summary": "Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. The company provides prestige fragrances, skin care, and color cosmetics products through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Alexander McQueen, Burberry, Bottega Veneta, Calvin Klein, Cavalli, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Jil Sander, Joop!, Kylie Jenner, Lacoste, Lancaster, Marc Jacobs, Miu Miu, Nikos, philosophy, and Tiffany & Co. brands. It also offers mass color cosmetics, fragrance, skin care, and body care products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Biocolor, Bozzano, Bourjois, Bruno Banani, CoverGirl, Enrique, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, Rimmel, Risque, Sally Hansen, Stetson, and 007 James Bond brands. The company also sells its products through third-party distributors. It sells its products to approximately 150 countries and territories. The company was founded in 1904 and is based in New York, New York. Coty Inc. is a subsidiary of Cottage Holdco B.V.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10118",
        "website": "http://www.coty.com",
        "full_time_employees": 18260
    },
    "COLG.VI": {
        "short_name": "COLGATE-PALMOLIVE CO",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "COLG34.SA": {
        "short_name": "COLGATE     DRN",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "COTY": {
        "short_name": "Coty Inc.",
        "long_name": "Coty Inc.",
        "summary": "Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. The company provides prestige fragrances, skin care, and color cosmetics products through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Alexander McQueen, Burberry, Bottega Veneta, Calvin Klein, Cavalli, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Jil Sander, Joop!, Kylie Jenner, Lacoste, Lancaster, Marc Jacobs, Miu Miu, Nikos, philosophy, and Tiffany & Co. brands. It also offers mass color cosmetics, fragrance, skin care, and body care products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Biocolor, Bozzano, Bourjois, Bruno Banani, CoverGirl, Enrique, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, Rimmel, Risque, Sally Hansen, Stetson, and 007 James Bond brands. The company also sells its products through third-party distributors. It sells its products to approximately 150 countries and territories. The company was founded in 1904 and is based in New York, New York. Coty Inc. is a subsidiary of Cottage Holdco B.V.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10118",
        "website": "http://www.coty.com",
        "full_time_employees": 18260
    },
    "COTY34.SA": {
        "short_name": "COTY INC    DRN",
        "long_name": "Coty Inc.",
        "summary": "Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. The company provides prestige fragrances, skin care, and color cosmetics products through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Alexander McQueen, Burberry, Bottega Veneta, Calvin Klein, Cavalli, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Jil Sander, Joop!, Kylie Jenner, Lacoste, Lancaster, Marc Jacobs, Miu Miu, Nikos, philosophy, and Tiffany & Co. brands. It also offers mass color cosmetics, fragrance, skin care, and body care products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Biocolor, Bozzano, Bourjois, Bruno Banani, CoverGirl, Enrique, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, Rimmel, Risque, Sally Hansen, Stetson, and 007 James Bond brands. The company also sells its products through third-party distributors. It sells its products to approximately 150 countries and territories. The company was founded in 1904 and is based in New York, New York. Coty Inc. is a subsidiary of Cottage Holdco B.V.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10118",
        "website": "http://www.coty.com",
        "full_time_employees": 18260
    },
    "CPA.DE": {
        "short_name": "COLGATE-PALMOLIVE  DL 1",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "CPA.F": {
        "short_name": "COLGATE-PALMOLIVE  DL 1",
        "long_name": "Colgate-Palmolive Company",
        "summary": "Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022-7499",
        "website": "http://www.colgatepalmolive.com",
        "full_time_employees": 34200
    },
    "CXU.DE": {
        "short_name": "CHURCH + DWIGHT CO. DL 1",
        "long_name": "Church & Dwight Co., Inc.",
        "summary": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; FLAWLESS products; and cold remedy products under the ZICAM brand. It also provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement that enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are used to reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ewing",
        "zipcode": "08628",
        "website": "http://www.churchdwight.com",
        "full_time_employees": 5100
    },
    "CXU.F": {
        "short_name": "CHURCH + DWIGHT CO. DL 1",
        "long_name": "Church & Dwight Co., Inc.",
        "summary": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; FLAWLESS products; and cold remedy products under the ZICAM brand. It also provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement that enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are used to reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Ewing",
        "zipcode": "08628",
        "website": "http://www.churchdwight.com",
        "full_time_employees": 5100
    },
    "CXX.DE": {
        "short_name": "CLOROX CO.  DL 1",
        "long_name": "The Clorox Company",
        "summary": "The Clorox Company manufactures and markets consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The company offers laundry additives, including bleach products under the Clorox brand, as well as Clorox 2 stain fighter and color booster; home care products primarily under the Clorox, Scentiva, Formula 409, Liquid-Plumr, Pine-Sol, S.O.S, and Tilex brands; naturally derived products under the Green Works brand; professional cleaning, disinfecting, and food service products under the CloroxPro, Clorox Healthcare, and Clorox Total 360 brands; professional food service products under the Hidden Valley brand; and vitamins, minerals, and supplement products under the RenewLife, Rainbow Light, Natural Vitality, NeoCell, and Stop Aging Now brands. It also provides grilling products under the Kingsford and Match Light brands; bags and wraps under the Glad brand; and cat litter products under the Fresh Step, Scoop Away, and Ever Clean brands. In addition, the company offers dressings and sauces primarily under the Hidden Valley brand; water-filtration systems and filters under the Brita brand; and natural personal care products under the Burt's Bees brand. Further, it markets its products under the Ayudin, Clorinda, and Poett brands. The company sells its products primarily through mass retailers, grocery outlets, warehouse clubs, dollar stores, home hardware centers, third-party and owned e-commerce channels, military stores, and distributors, as well as a direct sales force. Clorox has a collaboration partnership with Cleveland Clinic and the CDC Foundation. The Clorox Company was founded in 1913 and is headquartered in Oakland, California.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94612-1888",
        "website": "http://www.thecloroxcompany.com",
        "full_time_employees": 8800
    },
    "CXX.F": {
        "short_name": "CLOROX CO.  DL 1",
        "long_name": "The Clorox Company",
        "summary": "The Clorox Company manufactures and markets consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The company offers laundry additives, including bleach products under the Clorox brand, as well as Clorox 2 stain fighter and color booster; home care products primarily under the Clorox, Scentiva, Formula 409, Liquid-Plumr, Pine-Sol, S.O.S, and Tilex brands; naturally derived products under the Green Works brand; professional cleaning, disinfecting, and food service products under the CloroxPro, Clorox Healthcare, and Clorox Total 360 brands; professional food service products under the Hidden Valley brand; and vitamins, minerals, and supplement products under the RenewLife, Rainbow Light, Natural Vitality, NeoCell, and Stop Aging Now brands. It also provides grilling products under the Kingsford and Match Light brands; bags and wraps under the Glad brand; and cat litter products under the Fresh Step, Scoop Away, and Ever Clean brands. In addition, the company offers dressings and sauces primarily under the Hidden Valley brand; water-filtration systems and filters under the Brita brand; and natural personal care products under the Burt's Bees brand. Further, it markets its products under the Ayudin, Clorinda, and Poett brands. The company sells its products primarily through mass retailers, grocery outlets, warehouse clubs, dollar stores, home hardware centers, third-party and owned e-commerce channels, military stores, and distributors, as well as a direct sales force. Clorox has a collaboration partnership with Cleveland Clinic and the CDC Foundation. The Clorox Company was founded in 1913 and is headquartered in Oakland, California.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94612-1888",
        "website": "http://www.thecloroxcompany.com",
        "full_time_employees": 8800
    },
    "EGZ.F": {
        "short_name": "EDGEWELL PERS.CARE DL-,01",
        "long_name": "Edgewell Personal Care Company",
        "summary": "Edgewell Personal Care Company manufactures and markets personal care products in the wet shave, sun and skin care, and feminine care categories in the United States and internationally. It operates through three segments: Wet Shave, Sun and Skin Care, and Feminine Care. The company offers Schick and Wilkinson Sword razor systems, including razor handles and refillable blades, and disposable shave products for men and women; and shave preparation products, such as shaving gels and creams under the Edge, Skintimate, and Shave Guard brands. It also manufactures, distributes, and sells private label and value-priced wet shaving disposable razors, shaving systems, and replacement blades under a retailer's store name or under value brand names, such as Personna. In addition, the company offers sun care products comprising protection, sport, kids, baby, tanning, and after sun products under the Banana Boat, Hawaiian Tropic, Bulldog, Jack Black, Cremo, and Wet Ones brands; and feminine care products that include tampons under the Playtex Gentle Glide 360Â°, Playtex Sport, Playtex, and o.b. brands, as well as pads and liners under the Stayfree and Carefree brands. It sells its products through direct sales force, distributors, and wholesalers; retail locations, including mass merchandisers and warehouse clubs, food, drug and convenience stores, and military stores; and e-commerce. The company was formerly known as Energizer Holdings, Inc. and changed its name to Edgewell Personal Care Company in June 2015. Edgewell Personal Care Company was founded in 1999 and is headquartered in Shelton, Connecticut.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Shelton",
        "zipcode": "06484",
        "website": "http://edgewell.com",
        "full_time_employees": 5800
    },
    "EL.MX": {
        "short_name": "ESTEE LAUDER COMPANIES INC",
        "long_name": "The Estée Lauder Companies Inc.",
        "summary": "The EstÃ©e Lauder Companies Inc. manufactures and markets skin care, makeup, fragrance, and hair care products. The company offers a range of skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, cleansing devices, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, nail polishes, and powders, as well as compacts, brushes, and other makeup tools. It also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products that include shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. The company offers its products under EstÃ©e Lauder, Aramis, Clinique, Lab Series, Origins, MÂ·AÂ·C, Bobbi Brown, La Mer, Aveda, Jo Malone London, Bumble and bumble, Darphin, Smashbox, Le Labo, Editions de Parfums FrÃ©dÃ©ric Malle, GLAMGLOW, By Kilian, BECCA, Too Faced, RODIN olio lusso, FLIRT!, Kiton, and Tom Ford brands. It also holds license arrangements for Tommy Hilfiger, Donna Karan New York, DKNY, Michael Kors, Ermenegildo Zegna, Dr. Andrew Weil, TOM FORD BEAUTY, AERIN, and Tory Burch brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer Websites; third-party online malls; stores in airports and on cruise ships; in-flight and duty-free shops; and self-select outlets. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The EstÃ©e Lauder Companies Inc. has a joint development agreement with Atropos Therapeutics Inc. to discover senomodulators. The company was founded in 1946 and is headquartered in New York, New York.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10153",
        "website": "http://www.elcompanies.com",
        "full_time_employees": 48000
    },
    "EL": {
        "short_name": "Estee Lauder Companies, Inc. (T",
        "long_name": "The Estée Lauder Companies Inc.",
        "summary": "The EstÃ©e Lauder Companies Inc. manufactures and markets skin care, makeup, fragrance, and hair care products. The company offers a range of skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, cleansing devices, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, nail polishes, and powders, as well as compacts, brushes, and other makeup tools. It also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products that include shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. The company offers its products under EstÃ©e Lauder, Aramis, Clinique, Lab Series, Origins, MÂ·AÂ·C, Bobbi Brown, La Mer, Aveda, Jo Malone London, Bumble and bumble, Darphin, Smashbox, Le Labo, Editions de Parfums FrÃ©dÃ©ric Malle, GLAMGLOW, By Kilian, BECCA, Too Faced, RODIN olio lusso, FLIRT!, Kiton, and Tom Ford brands. It also holds license arrangements for Tommy Hilfiger, Donna Karan New York, DKNY, Michael Kors, Ermenegildo Zegna, Dr. Andrew Weil, TOM FORD BEAUTY, AERIN, and Tory Burch brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer Websites; third-party online malls; stores in airports and on cruise ships; in-flight and duty-free shops; and self-select outlets. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The EstÃ©e Lauder Companies Inc. has a joint development agreement with Atropos Therapeutics Inc. to discover senomodulators. The company was founded in 1946 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10153",
        "website": "http://www.elcompanies.com",
        "full_time_employees": 48000
    },
    "ELAA.F": {
        "short_name": "ESTEE LAUDER COS A DL-,01",
        "long_name": "The Estée Lauder Companies Inc.",
        "summary": "The EstÃ©e Lauder Companies Inc. manufactures and markets skin care, makeup, fragrance, and hair care products. The company offers a range of skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, cleansing devices, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, nail polishes, and powders, as well as compacts, brushes, and other makeup tools. It also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products that include shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. The company offers its products under EstÃ©e Lauder, Aramis, Clinique, Lab Series, Origins, MÂ·AÂ·C, Bobbi Brown, La Mer, Aveda, Jo Malone London, Bumble and bumble, Darphin, Smashbox, Le Labo, Editions de Parfums FrÃ©dÃ©ric Malle, GLAMGLOW, By Kilian, BECCA, Too Faced, RODIN olio lusso, FLIRT!, Kiton, and Tom Ford brands. It also holds license arrangements for Tommy Hilfiger, Donna Karan New York, DKNY, Michael Kors, Ermenegildo Zegna, Dr. Andrew Weil, TOM FORD BEAUTY, AERIN, and Tory Burch brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer Websites; third-party online malls; stores in airports and on cruise ships; in-flight and duty-free shops; and self-select outlets. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The EstÃ©e Lauder Companies Inc. has a joint development agreement with Atropos Therapeutics Inc. to discover senomodulators. The company was founded in 1946 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10153",
        "website": "http://www.elcompanies.com",
        "full_time_employees": 48000
    },
    "ELCI34.SA": {
        "short_name": "ESTEE LAUDERDRN",
        "long_name": "The Estée Lauder Companies Inc.",
        "summary": "The EstÃ©e Lauder Companies Inc. manufactures and markets skin care, makeup, fragrance, and hair care products. The company offers a range of skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, cleansing devices, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, nail polishes, and powders, as well as compacts, brushes, and other makeup tools. It also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products that include shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. The company offers its products under EstÃ©e Lauder, Aramis, Clinique, Lab Series, Origins, MÂ·AÂ·C, Bobbi Brown, La Mer, Aveda, Jo Malone London, Bumble and bumble, Darphin, Smashbox, Le Labo, Editions de Parfums FrÃ©dÃ©ric Malle, GLAMGLOW, By Kilian, BECCA, Too Faced, RODIN olio lusso, FLIRT!, Kiton, and Tom Ford brands. It also holds license arrangements for Tommy Hilfiger, Donna Karan New York, DKNY, Michael Kors, Ermenegildo Zegna, Dr. Andrew Weil, TOM FORD BEAUTY, AERIN, and Tory Burch brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer Websites; third-party online malls; stores in airports and on cruise ships; in-flight and duty-free shops; and self-select outlets. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The EstÃ©e Lauder Companies Inc. has a joint development agreement with Atropos Therapeutics Inc. to discover senomodulators. The company was founded in 1946 and is headquartered in New York, New York.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10153",
        "website": "http://www.elcompanies.com",
        "full_time_employees": 48000
    },
    "ELF": {
        "short_name": "e.l.f. Beauty, Inc.",
        "long_name": "e.l.f. Beauty, Inc.",
        "summary": "e.l.f. Beauty, Inc., through its subsidiaries, provides cosmetic and skin care products under the e.l.f. and W3LL PEOPLE brand names worldwide. The company offers eye, lip, face, and skin care products, as well as kits and tools. It sells its products through national and international retailers and direct-to-consumer channels, which include e-commerce platforms in the United States; and internationally primarily through distributors. The company was formerly known as J.A. Cosmetics Holdings, Inc. and changed its name to e.l.f. Beauty, Inc. in April 2016. e.l.f. Beauty, Inc. was founded in 2004 and is based in Oakland, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Oakland",
        "zipcode": "94607",
        "website": "http://www.elfcosmetics.com",
        "full_time_employees": 209
    },
    "EMPO": {
        "short_name": "EMPOWERED PRODUCT INC",
        "long_name": "Empowered Products, Inc.",
        "summary": "Empowered Products, Inc., together with its subsidiaries, manufactures, sells, and distributes personal care products principally in the United States, Europe, and Asia. It provides various products, including topical gels, lotions, and oils, which are designed to enhance a person's mental focus and to improve the bond of interpersonal relationships. The company sells 12 formulated skin lubricants under PINK for women and GUN OIL for men trademarks. It offers various products for men, such as GUN OIL Silicone, a silicone-based interactive lubricant; GUN OIL H2O, a water-based interactive lubricant; GUN OIL Force Recon, a combination water and silicone interactive lubricant; GUN OIL Gel, a gelatinous lubricant for men's personal toys; GUN OIL Stroke 29, a self-applied men's personal lubricant; GUN OIL Loaded, a silicone infused cream hybrid interactive lubricant; GUN OIL Jack Jelly, a self-applied men's personal lubricant in gelatinous form; and GUN OIL Shine, a personal toy cleaner. The company also provides products for women comprising PINK Silicone, an interactive lubricant with silicone vitamin E and aloe vera; PINK Water, a water-based interactive lubricant with vitamin E and aloe vera; Hot PINK, an exothermic massage lubricant; PINK Frolic, a women's personal toy lubricant; PINK Unity, a gelatinous hybrid lubricant with silicone and water; PINK Indulgence CrÃ¨me, a hybrid cream interactive lubricant; and PINK Sparkle, a personal toy cleaner. Empowered Products, Inc. sells its products directly to retailers, as well as to consumers through its online Wellness Stores. The company is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89118",
        "website": "http://www.empoweredproducts.com",
        "full_time_employees": 19
    },
    "EPC": {
        "short_name": "Edgewell Personal Care Company",
        "long_name": "Edgewell Personal Care Company",
        "summary": "Edgewell Personal Care Company manufactures and markets personal care products in the wet shave, sun and skin care, and feminine care categories in the United States and internationally. It operates through three segments: Wet Shave, Sun and Skin Care, and Feminine Care. The company offers Schick and Wilkinson Sword razor systems, including razor handles and refillable blades, and disposable shave products for men and women; and shave preparation products, such as shaving gels and creams under the Edge, Skintimate, and Shave Guard brands. It also manufactures, distributes, and sells private label and value-priced wet shaving disposable razors, shaving systems, and replacement blades under a retailer's store name or under value brand names, such as Personna. In addition, the company offers sun care products comprising protection, sport, kids, baby, tanning, and after sun products under the Banana Boat, Hawaiian Tropic, Bulldog, Jack Black, Cremo, and Wet Ones brands; and feminine care products that include tampons under the Playtex Gentle Glide 360Â°, Playtex Sport, Playtex, and o.b. brands, as well as pads and liners under the Stayfree and Carefree brands. It sells its products through direct sales force, distributors, and wholesalers; retail locations, including mass merchandisers and warehouse clubs, food, drug and convenience stores, and military stores; and e-commerce. The company was formerly known as Energizer Holdings, Inc. and changed its name to Edgewell Personal Care Company in June 2015. Edgewell Personal Care Company was founded in 1999 and is headquartered in Shelton, Connecticut.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Shelton",
        "zipcode": "06484",
        "website": "http://edgewell.com",
        "full_time_employees": 5800
    },
    "EROX": {
        "short_name": "HUMAN PHERAMONE SCIENCES INC",
        "long_name": "Human Pheromone Sciences, Inc.",
        "summary": "Human Pheromone Sciences, Inc. engages in the research, development, manufacture, and marketing of consumer products containing synthetic human pheromones and other mood enhancing compounds in the United States and internationally. It provides a line of fragrance and toiletry products for men and women under the Natural Attraction trademark. The company also licenses its initial compounds and related technology, as well as sells its patented compounds to licensed customers to include these compounds as components in their products. In addition, it offers private label manufacturing services to licensed customers. Human Pheromone Sciences, Inc. distributes its products through distributors, as well as through the Web site, naturalattraction.com. The company was formerly known as EROX Corporation and changed its name to Human Pheromone Sciences, Inc. in May 1998. Human Pheromone Sciences, Inc. was founded in 1989 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Jose",
        "zipcode": "95113",
        "website": "http://www.naturalattraction.com",
        "full_time_employees": null
    },
    "ESLA.VI": {
        "short_name": "ESTEE LAUDER COMPANIES-CL A",
        "long_name": "The Estée Lauder Companies Inc.",
        "summary": "The EstÃ©e Lauder Companies Inc. manufactures and markets skin care, makeup, fragrance, and hair care products. The company offers a range of skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, cleansing devices, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, nail polishes, and powders, as well as compacts, brushes, and other makeup tools. It also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products that include shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. The company offers its products under EstÃ©e Lauder, Aramis, Clinique, Lab Series, Origins, MÂ·AÂ·C, Bobbi Brown, La Mer, Aveda, Jo Malone London, Bumble and bumble, Darphin, Smashbox, Le Labo, Editions de Parfums FrÃ©dÃ©ric Malle, GLAMGLOW, By Kilian, BECCA, Too Faced, RODIN olio lusso, FLIRT!, Kiton, and Tom Ford brands. It also holds license arrangements for Tommy Hilfiger, Donna Karan New York, DKNY, Michael Kors, Ermenegildo Zegna, Dr. Andrew Weil, TOM FORD BEAUTY, AERIN, and Tory Burch brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer Websites; third-party online malls; stores in airports and on cruise ships; in-flight and duty-free shops; and self-select outlets. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The EstÃ©e Lauder Companies Inc. has a joint development agreement with Atropos Therapeutics Inc. to discover senomodulators. The company was founded in 1946 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10153",
        "website": "http://www.elcompanies.com",
        "full_time_employees": 48000
    },
    "GYSN": {
        "short_name": "GREYSON INTERNATIONAL INC.",
        "long_name": "Greyson International, Inc.",
        "summary": "Greyson International, Inc. engages in the research, development, manufacture, distribution, and marketing of beauty and pharmaceutical products. It offers Trilexon, a skin care delivery system. The company also provides anti-aging skin care products, such as foaming cleansers, pore diminishing toners, moisturizers, night creams, and eye creams under the Trilexon brand name. It offers its products online. Greyson International, Inc. was founded in 1996 and is based in Coconut Creek, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Coconut Creek",
        "zipcode": "33073",
        "website": "http://www.greysonproducts.com",
        "full_time_employees": null
    },
    "H221.F": {
        "short_name": "SPECTR.BRANDS HLDG DL-,01",
        "long_name": "Spectrum Brands Holdings, Inc.",
        "summary": "Spectrum Brands Holdings, Inc. operates as a branded consumer products company worldwide. The company's Hardware & Home Improvement segment offers hardware products under the National Hardware and FANAL brands; locksets and door hardware under the Kwikset, Weiser, Baldwin, EZSET, and Tell Manufacturing brands; and plumbing products under the Pfister brand. Its Home and Personal Care segment provides home appliances under the Black & Decker, Russell Hobbs, George Foreman, Toastmaster, Juiceman, Farberware, and Breadman brands; and personal care products under the Remington and LumaBella brands. The company's Global Pet Care segment provides rawhide chewing, dog and cat clean-up and food, training, health and grooming, small animal food and care, and rawhide-free products under the 8IN1 (8-in-1), Dingo, Nature's Miracle, Wild Harvest, Littermaid, Jungle, Excel, FURminator, IAMS, Eukanuba, Healthy-Hide, DreamBone, SmartBones, ProSense, Perfect Coat, eCOTRITION, Birdola, and Digest-eeze brands. This segment also offers aquarium kits, stand-alone tanks, and aquatics equipment and consumables under the Tetra, Marineland, Whisper, Instant Ocean, GloFish, OmegaOne, and OmegaSea brands. Its Home and Garden segment provides outdoor insect and weed control solutions, and animal repellents under the Spectracide, Garden Safe, Liquid Fence, and EcoLogic brands; household pest control solutions under the Hot Shot, Black Flag, Real-Kill, Ultra Kill, The Ant Trap, and Rid-A-Bug brand names; and personal-use pesticides and insect repellent products under the Cutter and Repel brands. The company sells its products through retailers, e-commerce and online retailers, wholesalers and distributors, construction companies, and original equipment manufacturers. Spectrum Brands Holdings, Inc. is headquartered in Middleton, Wisconsin.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "WI",
        "city": "Middleton",
        "zipcode": "53562",
        "website": "http://www.spectrumbrands.com",
        "full_time_employees": 12100
    },
    "HELE": {
        "short_name": "Helen of Troy Limited",
        "long_name": "Helen of Troy Limited",
        "summary": "Helen of Troy Limited designs, develops, imports, markets, and distributes a portfolio of consumer products worldwide. The company operates in three segments: Housewares, Health & Home, and Beauty. The Housewares segment offers food and beverage preparation tools and gadgets, storage containers, and organization products; household cleaning products, shower organization, bathroom accessories, and gardening products; feeding and drinking products, child seating products, cleaning tools, and nursery accessories; and insulated water bottles, jugs, thermoses, drinkware, travel mugs, and food containers. The Health & Home segment provides thermometers, blood pressure monitors, and humidifiers; faucet mount water-filtration systems and pitcher based water filtration systems; and air purifiers, heaters, fans, and dehumidifiers. The Beauty segment provides hair, facial, and skin care appliances, as well as grooming brushes, tools, and decorative hair accessories; and liquid hair styling, treatment and conditioning products, shampoos, and skin care products. The company sells its products through mass merchandisers, drugstore chains, warehouse clubs, home improvement stores, grocery and specialty stores, beauty supply and e-commerce retailers, wholesalers, and various types of distributors, as well as directly to consumers under the OXO, Good Grips, Hydro Flask, Soft Works, OXO tot, PUR, Honeywell, Braun, Vicks, Drybar, Hot Tools, Brut, Pert, Sure, Infusium, Revlon, and Bed Head brands. Helen of Troy Limited was founded in 1968 and is based in headquartered in El Paso, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "El Paso",
        "zipcode": "79912",
        "website": "http://www.helenoftroy.com",
        "full_time_employees": 1650
    },
    "HIMS": {
        "short_name": "Hims & Hers Health, Inc.",
        "long_name": "Hims & Hers Health, Inc.",
        "summary": "Hims & Hers Health, Inc. operates a multi-specialty telehealth platform that connects consumers to licensed healthcare professionals. The company offers a range of health and wellness products and services available for purchase on its websites directly by customers. It provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, as well as cosmetics and supplement products, primarily focusing on wellness, sexual health, skincare, and hair care. The company's curated non-prescription products include vitamin C, melatonin, collagen protein, biotin, and teas in the wellness category; moisturizer, fragrances, face wash, and anti-wrinkle creams in the skincare category; condoms and lubricants in the sexual health category; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care category. It also offers medical consultation services; and engages in the wholesale of non-prescription product sales to retailers. Hims & Hers Health, Inc. is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Francisco",
        "zipcode": "94123",
        "website": "http://www.forhims.com",
        "full_time_employees": 181
    },
    "HT2.F": {
        "short_name": "HELEN OF TROY LTD  DL-,10",
        "long_name": "Helen of Troy Limited",
        "summary": "Helen of Troy Limited designs, develops, imports, markets, and distributes a portfolio of consumer products worldwide. The company operates in three segments: Housewares, Health & Home, and Beauty. The Housewares segment offers food and beverage preparation tools and gadgets, storage containers, and organization products; coffee makers, grinders, manual pour overs, and tea kettles; household cleaning products, shower organization, and bathroom accessories; feeding and drinking products, child seating products, cleaning tools, and nursery accessories; and insulated water bottles, jugs, thermoses, drinkware, travel mugs, and food containers and accessories. The Health & Home segment provides thermometers, blood pressure monitors, and humidifiers; faucet mount water-filtration systems and pitcher based water filtration systems; and air purifiers, heaters, fans, and humidifiers. The Beauty segment provides hair, facial, and skin care appliances, as well as grooming brushes, tools, and decorative hair accessories; and liquid hair styling, treatment and conditioning products, shampoos, and skin care products. The company sells its products through mass merchandisers, drugstore chains, warehouse clubs, home improvement stores, grocery and specialty stores, beauty supply and e-commerce retailers, wholesalers, and various types of distributors, as well as directly to consumers under the OXO, Good Grips, Hydro Flask, Soft Works, OXO tot, OXO Brew, PUR, Honeywell, Braun, Vicks, Drybar, Hot Tools, Brut, Pert, Sure, Infusium, Revlon, and Bed Head brands. Helen of Troy Limited was incorporated in 1968 and is headquartered in El Paso, Texas.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "El Paso",
        "zipcode": "79912",
        "website": "http://www.helenoftroy.com",
        "full_time_employees": 1769
    },
    "INBI": {
        "short_name": "INFUSION BRANDS INTERNATIONAL I",
        "long_name": "Infusion Brands International, Inc.",
        "summary": "Infusion Brands International, Inc., a consumer products company, builds and markets brands through international direct-to-consumer marketing channels. The company markets power tools under the DUALTOOLS brand; kitchen products under the Ronco brand; and cloths under the DOC brand. It also offers dieting and lifestyle maintenance plans, products, and services through eDiets.com Website. The company is based in Clearwater, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Clearwater",
        "zipcode": "33760",
        "website": null,
        "full_time_employees": 47
    },
    "IPAR": {
        "short_name": "Inter Parfums, Inc.",
        "long_name": "Inter Parfums, Inc.",
        "summary": "Inter Parfums, Inc., together with its subsidiaries, manufactures, markets, and distributes a range of fragrances and fragrance related products in the United States and internationally. The company operates in two segments, European Based Operations and United States Based Operations. It offers its fragrance and cosmetic products under the Boucheron, Coach, Jimmy Choo, Karl Lagerfeld, Kate Spade New York, Lanvin, Montblanc, Paul Smith, Repetto, Rochas, S.T. Dupont, Van Cleef & Arpels, Abercrombie & Fitch, Anna Sui, bebe, Dunhill, Hollister, French Connection, Graff, GUESS, Lily Aldridge, MCM, Bella Vita, and Oscar de la Renta brand names, as well as under the Intimate and Aziza names. It sells its products to department stores, specialty stores, duty free shops, beauty retailers, and domestic and international wholesalers, and distributors, as well as through e-commerce. The company was formerly known as Jean Philippe Fragrances, Inc. and changed its name to Inter Parfums, Inc. in July 1999. Inter Parfums, Inc. was founded in 1982 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10176",
        "website": "http://www.interparfumsinc.com",
        "full_time_employees": 396
    },
    "ITLK": {
        "short_name": "INTERLINK PRODUCTS INTERNATIONA",
        "long_name": "Interlink Products International, Inc.",
        "summary": "Interlink Products International, Inc. provides shower products for retailers and shower brands in the United States. It offers showers and systems, such as fixed-mount, fixed mount rainfall, adjustable rainfall, handheld, combination, rainfall combination, LED, hydrotherapy, designer, and brushed nickel showers, as well as shower slide bars and convenience shower systems. The company also provides therapeutic showers; bathroom accessories comprising shower dispensers; personal care shower devices; and special products. In addition, it provides products through online store. The company offers its products under the HotelSpa, DreamSpa, Hydroluxe, AquaSpa, PowerSpa, AquaPalm, and Fusion brands. Interlink Products International, Inc. is based in Linden, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Linden",
        "zipcode": "07036",
        "website": "http://www.ipshowers.com",
        "full_time_employees": null
    },
    "IVMB.SG": {
        "short_name": "PURE Bioscience Inc. Registered",
        "long_name": "PURE Bioscience, Inc.",
        "summary": "PURE Bioscience, Inc. develops and commercializes antimicrobial products that provide solutions to the health and environmental challenges of pathogen and hygienic control in the United States and internationally. It manufactures and distributes silver dihydrogen citrate (SDC), a non-toxic antimicrobial agent, which offers residual protection and formulates with other compounds. The company offers SDC-based disinfecting and sanitizing products, including PURE Hard Surface, a food contact surface sanitizer and disinfectant; PURE Control, a food contact processing aid for fresh produce and raw poultry; PURE Multi-Purpose and Floor Cleaner Concentrate to clean various resilient surfaces, including floors, glass, and food contact surfaces; and PURE Multi-Purpose Hi-Foam Cleaner Concentrate to clean stainless steel equipment, resilient floors, walls, and painted surfaces. It also provides Axen30, a hard surface disinfectant; Axenohl, an antimicrobial formulation for use as a raw material ingredient in the manufacturing of consumer and commercial disinfecting and sanitizing products; and SILVÃ\u0089RION, an antimicrobial formulation that is used against bacteria, viruses, yeasts, and molds. The company was incorporated in 1992 and is headquartered in Rancho Cucamonga, California.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Cucamonga",
        "zipcode": "91730",
        "website": "http://www.purebio.com",
        "full_time_employees": 10
    },
    "JF1.F": {
        "short_name": "INTER PARFUMS INC. DL-001",
        "long_name": "Inter Parfums, Inc.",
        "summary": "Inter Parfums, Inc., together with its subsidiaries, manufactures, markets, and distributes a range of fragrances and fragrance related products in the United States and internationally. The company operates in two segments, European Based Operations and United States Based Operations. It offers its fragrance and cosmetic products under the Boucheron, Coach, Jimmy Choo, Karl Lagerfeld, Kate Spade New York, Lanvin, Montblanc, Paul Smith, Repetto, Rochas, S.T. Dupont, Van Cleef & Arpels, Abercrombie & Fitch, Anna Sui, bebe, Dunhill, Hollister, French Connection, Graff, GUESS, Lily Aldridge, MCM, Bella Vita, and Oscar de la Renta brand names, as well as under the Intimate and Aziza names. It sells its products to department stores, specialty stores, duty free shops, beauty retailers, and domestic and international wholesalers, and distributors, as well as through e-commerce. The company was formerly known as Jean Philippe Fragrances, Inc. and changed its name to Inter Parfums, Inc. in July 1999. Inter Parfums, Inc. was founded in 1982 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10176",
        "website": "http://www.interparfumsinc.com",
        "full_time_employees": 396
    },
    "JOEY": {
        "short_name": "JOEY NEW YORK INC",
        "long_name": "Joey New York, Inc.",
        "summary": "Joey New York, Inc., through its subsidiary, RAR Beauty, LLC, manufactures and markets natural skin care and beauty products in the United States and Internationally. The company operates through The LABB, Aesthetic Beauty Bar; and Joey New York Cosmetics divisions. The LABB, Aesthetic Beauty Bar division provides injectable services, which eliminate unwanted wrinkles by performing Botox and filler injections. The company offers its products under the Joey New York brand. It offers its products through retailers, professional salons, spas, and beauty Websites. The company was founded in 1993 and is headquartered in Sunny Isles Beach, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Sunny Isles Beach",
        "zipcode": "33160",
        "website": "http://www.joeynewyork.com",
        "full_time_employees": 3
    },
    "KMB.BA": {
        "short_name": "KIMBERLY-CLARK CP",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "ARS",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KMB.MX": {
        "short_name": "KIMBERLY CLARK CORP",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KMB": {
        "short_name": "Kimberly-Clark Corporation",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KMBB34.SA": {
        "short_name": "KIMBERLY CL DRN ED",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KMBC.VI": {
        "short_name": "KIMBERLY-CLARK CORP",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KMY.DE": {
        "short_name": "KIMBERLY-CLARK  DL 1,25",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KMY.F": {
        "short_name": "KIMBERLY-CLARK  DL 1,25",
        "long_name": "Kimberly-Clark Corporation",
        "summary": "Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products worldwide. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Depend, Plenitud, Softex, Poise, and other brand names. The Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The K-C Professional segment offers wipers, tissues, towels, apparel, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. The company sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to manufacturing, lodging, office building, food service, and public facilities, as well as through distributors and e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75261-9100",
        "website": "http://www.kimberly-clark.com",
        "full_time_employees": 46000
    },
    "KPOC": {
        "short_name": "KIMBERLY PARRY ORGANICS CORP",
        "long_name": "Kimberly Parry Organics Inc.",
        "summary": "Kimberly Parry Organics Inc. manufactures and distributes spa and resort products. It offers organic skin care, organic bath and body, organic mom and baby care, gift, manicure/pedicure and prenatal, and organic spa treatment products. The company serves retail and professional markets; and sells its products online. Kimberly Parry Organics Inc. distributes its products through 500 outlets, including CosmeKitchen locations in Japan; Beauty Gallery locations in Macau; Great Jones Spa in New York; Four Seasons Resorts in Las Vegas and Santa Barbara; Terranea Resort & Spa in California; Ascent Spa at Tenaya Lodge, California; and other retail outlets across the United States. The company was formerly known as VizStar, Inc. and changed its name to Kimberly Parry Organics Inc. in April 2014. Kimberly Parry Organics Inc. was founded in 1999 and is based in San Clemente, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Clemente",
        "zipcode": "92673",
        "website": "http://www.kimberlyparry.com",
        "full_time_employees": 5
    },
    "LPHM": {
        "short_name": "LEE PHARMACEUTICALS",
        "long_name": "Lee Pharmaceuticals, Inc.",
        "summary": "Lee Pharmaceuticals, Inc. manufactures personal care and cosmetic products. The company specializes in personal care products, such as lip balm for chapped lips, nasal spray, nail care products, depilatories, and quit smoking items. Its products category includes aloe vera products, antacids, baby care, cosmetics and douche, cough and cold products, depilatories and waxes, laxatives, lip balm products, men's personal care, oral care, pain relievers, personal care, skin care, tobacco accessories, topical ointments/creams, and vitamins and nutritional items. The company also provides private label and contract manufacturing services. It offers its products through retailers and wholesalers, as well as online. The company was incorporated in 1971 and is based in South El Monte, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "South El Monte",
        "zipcode": "91733",
        "website": "http://www.leepharmaceuticals.com",
        "full_time_employees": 30
    },
    "MDAV": {
        "short_name": "DAVI LUXURY BRAND GROUP INC",
        "long_name": "Davi Luxury Brand Group, Inc.",
        "summary": "Davi Luxury Brand Group, Inc. develops and markets a line of skin care/cosmetic products based on grape and botanical-based luxury branded skin care products for women and men under the Davi, Davi Skin, and Davi Napa brand names. The company offers skin care, cosmetics, hair care, and other products. It provides approximately 30 Davi branded products of which approximately 20 are sold through its daviskin.com Website. The company's target customers include retail stores, luxury hotels, and in-flight and duty-free shops. The company was formerly known as Dafoe Corp. and changed its name to Davi Luxury Brand Group, Inc. in January 2011. Davi Luxury Brand Group, Inc. was founded in 2007 and is headquartered in Beverly Hills, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Beverly Hills",
        "zipcode": "90210",
        "website": "http://www.daviskin.com",
        "full_time_employees": 2
    },
    "MTEX": {
        "short_name": "Mannatech, Incorporated",
        "long_name": "Mannatech, Incorporated",
        "summary": "Mannatech, Incorporated operates as a health and wellness company worldwide. It develops, markets, and sells nutritional supplements; topical and skin care, and anti-aging products; and weight-management products. The company primarily sells its products directly, as well as through network marketing channels and a website. Mannatech, Incorporated was founded in 1993 and is headquartered in Flower Mound, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Flower Mound",
        "zipcode": "75028",
        "website": "http://www.mannatech.com",
        "full_time_employees": 225
    },
    "N1WL34.SA": {
        "short_name": "NEWELL BRANDDRN",
        "long_name": "Newell Brands Inc.",
        "summary": "Newell Brands Inc. designs, manufactures, sources, and distributes consumer and commercial products worldwide. Its Appliances and Cookware segment offers household products, including kitchen appliances, gourmet cookware, bakeware, and cutlery under the Calphalon, Crock-Pot, Mr. Coffee, Oster, and Sunbeam brands. The company's Commercial Solutions segment provides commercial cleaning and maintenance solutions; closet and garage organization; hygiene systems and material handling solutions; and home and security, and smoke and carbon monoxide alarms products under the BRK, First Alert, Mapa, Quickie, Rubbermaid, Rubbermaid Commercial Products, and Spontex brands. Its Home Solutions segment offers food and home storage; fresh preserving; vacuum sealing; and home fragrance products under the Ball, Chesapeake Bay Candle, FoodSaver, Rubbermaid, Sistema, WoodWick, and Yankee Candle brands. The company's Learning and Development segment provides writing instruments, including markers and highlighters, pens, and pencils; art products; activity-based adhesive and cutting products; labeling solutions; and baby gear and infant care products under the Aprica, Baby Jogger, Dymo, Elmer's, EXPO, Graco, Mr. Sketch, NUK, Paper Mate, Parker, Prismacolor, Sharpie, Tigex Waterman, and X-Acto brands. Its Outdoor and Recreation segment offers products for outdoor and outdoor-related activities under the Coleman, Contigo, ExOfficio, and Marmot brands. The company markets its products to warehouse clubs, department stores, drug/grocery stores, mass merchants, specialty retailers, distributors and e-commerce companies, home centers, sporting goods retailers, office superstores and supply stores, contract stationers, and travel retailers. The company was formerly known as Newell Rubbermaid Inc. and changed its name to Newell Brands Inc. in April 2016. Newell Brands Inc. was founded in 1903 and is based in Atlanta, Georgia.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.newellbrands.com",
        "full_time_employees": 31000
    },
    "NATR": {
        "short_name": "Nature's Sunshine Products, Inc",
        "long_name": "Nature's Sunshine Products, Inc.",
        "summary": "Nature's Sunshine Products, Inc., a natural health and wellness company, primarily manufactures and sells nutritional and personal care products in Asia, Europe, North America, Latin America, and internationally. The company offers general health products related to blood sugar support, bone health, cellular health, cognitive function, joint health, mood, sexual health, sleep, sports and energy, and vision. It also provides immunity, cardiovascular, and digestive products; and personal care products, such as oils and lotions, aloe vera gels, herbal shampoos, herbal skin treatment, toothpaste, and skin cleansers, as well as weight management products. The company offers its products under the Nature's Sunshine and Synergy WorldWide brands through a sales force of independent consultants. Nature's Sunshine Products, Inc. was founded in 1972 and is based in Lehi, Utah.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Lehi",
        "zipcode": "84043",
        "website": "http://www.naturessunshine.com",
        "full_time_employees": 837
    },
    "NRPR": {
        "short_name": "NUTRI PHARMACEUTICALS RESEARCH ",
        "long_name": "Nutri Pharmaceuticals Research, Inc.",
        "summary": "Nutri Pharmaceuticals Research, Inc. engages in the manufacture and sale of health, beauty, and food ingredients, as well as vitamins and supplements worldwide. It also develops a process that transforms edible oils into a free-flowing powder form. The company uses its Â\u0091oil to powder' products as ingredients in finished goods, such as food, pet food, nutraceuticals or vitamin supplements, cosmetics, and organic household products. Nutri Pharmaceuticals is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89119",
        "website": "http://www.o2pus.com",
        "full_time_employees": null
    },
    "NUGN": {
        "short_name": "NUGENE INTERNATIONAL INC",
        "long_name": "NuGene International, Inc.",
        "summary": "NuGene International, Inc. develops and markets customized skin care products in the United States. The company offers skincare products, such as universal cream, universal and eye serum, gel, and face wash products; and hair care products comprising regenerative shampoos and conditioners, and anti-hair loss serums. It is also involved in the research and formulation of a topical burn cream for the treatment of burns. The company offers its products to wholesale distributors, physicians, and consumers. NuGene International, Inc. is based in Irvine, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Irvine",
        "zipcode": "92614",
        "website": "http://www.nugene.com",
        "full_time_employees": 10
    },
    "NUS.F": {
        "short_name": "NU SKIN ENTERPRISES A",
        "long_name": "Nu Skin Enterprises, Inc.",
        "summary": "Nu Skin Enterprises, Inc. develops and distributes personal care and wellness products worldwide. It provides skin care systems, including ageLOC Me customized skin care and ageLOC Spa systems, and ageLOC LumiSpa skin treatment and cleansing devices; and Epoch products comprising botanical ingredients derived from renewable sources, as well as a range of other cosmetic and personal care products. The company also offers ageLOC Youth nutritional supplements, ageLOC TR90 weight management and body shaping systems, and LifePak nutritional supplements, as well as other anti-aging nutritional solutions and weight management products. In addition, it is involved in the research and product development of skin care products and nutritional supplements. Further, the company operates retail stores and service centers in Mainland China. It sells its products under the Nu Skin, Pharmanex, and ageLOC brands. The company promotes and sells its products directly, as well as through distributors and Website. Nu Skin Enterprises, Inc. was founded in 1984 and is headquartered in Provo, Utah.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "UT",
        "city": "Provo",
        "zipcode": "84601",
        "website": "http://www.nuskin.com",
        "full_time_employees": 5000
    },
    "NUS": {
        "short_name": "Nu Skin Enterprises, Inc.",
        "long_name": "Nu Skin Enterprises, Inc.",
        "summary": "Nu Skin Enterprises, Inc. develops and distributes personal care and wellness products worldwide. It provides skin care systems, including ageLOC Me customized skin care and ageLOC Spa systems, and ageLOC LumiSpa skin treatment and cleansing devices; and Epoch products comprising botanical ingredients derived from renewable sources, as well as a range of other cosmetic and personal care products. The company also offers ageLOC Youth nutritional supplements, ageLOC TR90 weight management and body shaping systems, and LifePak nutritional supplements, as well as other anti-aging nutritional solutions and weight management products. In addition, it is involved in the research and product development of skin care products and nutritional supplements. Further, the company operates retail stores and service centers in Mainland China. It sells its products under the Nu Skin, Pharmanex, and ageLOC brands. The company promotes and sells its products directly, as well as through distributors and Website. Nu Skin Enterprises, Inc. was founded in 1984 and is headquartered in Provo, Utah.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Provo",
        "zipcode": "84601",
        "website": "http://www.nuskin.com",
        "full_time_employees": 5000
    },
    "NUUU": {
        "short_name": "REJUVEL BIO-SCIENCES INC",
        "long_name": "Rejuvel Bio-Sciences, Inc.",
        "summary": "Rejuvel Bio-Sciences, Inc., a development stage company, produces, distributes, markets, and sells skin care products worldwide. The company primarily offers skin cream under the Rejuvel brand. It also intends to develop, build, and sell environmental management solutions that use electron particle accelerator technology for the treatment of drinking water, municipal and industrial wastewater, sludge, and produced water from oil and gas fracturing activities. The company was formerly known as Technology Applications International Corporation and changed its name to Rejuvel Bio-Sciences, Inc. in June 2015. Rejuvel Bio-Sciences, Inc. was founded in 2009 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Miami",
        "zipcode": "33131",
        "website": "http://www.rejuvel.com",
        "full_time_employees": 1
    },
    "NUVI": {
        "short_name": "EMO CAPITAL CORP",
        "long_name": "Emo Capital Corp.",
        "summary": "Emo Capital Corp. does not have significant operations. It focuses on identifying a business opportunity. The company was founded in 2006 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89109",
        "website": null,
        "full_time_employees": null
    },
    "NWL.F": {
        "short_name": "NEWELL BRANDS INC.  DL 1",
        "long_name": "Newell Brands Inc.",
        "summary": "Newell Brands Inc. designs, manufactures, sources, and distributes consumer and commercial products worldwide. Its Appliances and Cookware segment offers household products, including kitchen appliances, gourmet cookware, bakeware, and cutlery under the Calphalon, Crock-Pot, Mr. Coffee, Oster, and Sunbeam brands. The company's Commercial Solutions segment provides commercial cleaning and maintenance solutions; closet and garage organization; hygiene systems and material handling solutions; and home and security, and smoke and carbon monoxide alarms products under the BRK, First Alert, Mapa, Quickie, Rubbermaid, Rubbermaid Commercial Products, and Spontex brands. Its Home Solutions segment offers food and home storage; fresh preserving; vacuum sealing; and home fragrance products under the Ball, Chesapeake Bay Candle, FoodSaver, Rubbermaid, Sistema, WoodWick, and Yankee Candle brands. The company's Learning and Development segment provides writing instruments, including markers and highlighters, pens, and pencils; art products; activity-based adhesive and cutting products; labeling solutions; and baby gear and infant care products under the Aprica, Baby Jogger, Dymo, Elmer's, EXPO, Graco, Mr. Sketch, NUK, Paper Mate, Parker, Prismacolor, Sharpie, Tigex Waterman, and X-Acto brands. Its Outdoor and Recreation segment offers products for outdoor and outdoor-related activities under the Coleman, Contigo, ExOfficio, and Marmot brands. The company markets its products to warehouse clubs, department stores, drug/grocery stores, mass merchants, specialty retailers, distributors and e-commerce companies, home centers, sporting goods retailers, office superstores and supply stores, contract stationers, and travel retailers. The company was formerly known as Newell Rubbermaid Inc. and changed its name to Newell Brands Inc. in April 2016. Newell Brands Inc. was founded in 1903 and is based in Atlanta, Georgia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.newellbrands.com",
        "full_time_employees": 31000
    },
    "NWL": {
        "short_name": "Newell Brands Inc.",
        "long_name": "Newell Brands Inc.",
        "summary": "Newell Brands Inc. designs, manufactures, sources, and distributes consumer and commercial products worldwide. Its Appliances and Cookware segment offers household products, including kitchen appliances, gourmet cookware, bakeware, and cutlery under the Calphalon, Crock-Pot, Mr. Coffee, Oster, and Sunbeam brands. The company's Commercial Solutions segment provides commercial cleaning and maintenance solutions; closet and garage organization; hygiene systems and material handling solutions; and home and security, and smoke and carbon monoxide alarms products under the BRK, First Alert, Mapa, Quickie, Rubbermaid, Rubbermaid Commercial Products, and Spontex brands. Its Home Solutions segment offers food and home storage; fresh preserving; vacuum sealing; and home fragrance products under the Ball, Chesapeake Bay Candle, FoodSaver, Rubbermaid, Sistema, WoodWick, and Yankee Candle brands. The company's Learning and Development segment provides writing instruments, including markers and highlighters, pens, and pencils; art products; activity-based adhesive and cutting products; labeling solutions; and baby gear and infant care products under the Aprica, Baby Jogger, Dymo, Elmer's, EXPO, Graco, Mr. Sketch, NUK, Paper Mate, Parker, Prismacolor, Sharpie, Tigex Waterman, and X-Acto brands. Its Outdoor and Recreation segment offers products for outdoor and outdoor-related activities under the Coleman, Contigo, ExOfficio, and Marmot brands. The company markets its products to warehouse clubs, department stores, drug/grocery stores, mass merchants, specialty retailers, distributors and e-commerce companies, home centers, sporting goods retailers, office superstores and supply stores, contract stationers, and travel retailers. The company was formerly known as Newell Rubbermaid Inc. and changed its name to Newell Brands Inc. in April 2016. Newell Brands Inc. was founded in 1903 and is based in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Atlanta",
        "zipcode": "30328",
        "website": "http://www.newellbrands.com",
        "full_time_employees": 31000
    },
    "OLVI": {
        "short_name": "OLIVEDA INTERNATIONAL INC",
        "long_name": "Oliveda International, Inc.",
        "summary": "Heritage Media Corporation was formerly known as Lignin Industries Inc. Heritage Media Corporation is based in Calgary, Canada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Santa Monica",
        "zipcode": "90404",
        "website": "http://www.oliveda.com",
        "full_time_employees": null
    },
    "PCGR": {
        "short_name": "PC GROUP INC",
        "long_name": "PC Group, Inc.",
        "summary": "PC Group, Inc., through its subsidiaries, offers personal care products for the private label retail, medical, and therapeutic markets primarily in the United States, Canada, and Europe. Its personal care products include soaps, cleansers, toners, moisturizers, exfoliants, and facial masks, as well as over-the-counter drug products, such as acne soaps; and gel-based products, including gloves and sock products that are used for cosmetic and scar management purposes. The company's gel-based orthopedic products include digitcare products, diabetes management products, products that protect the hands and wrists, gel sheeting products for various applications, and pressure, friction, and shear force absorption products, as well as products for the treatment of common orthopedic and footcare conditions; and gel-based prosthetic products for the treatment of common orthopedic and footcare conditions. PC Group sells its personal care products through account representatives to health and beauty companies, specialty retailers, cosmetics companies, direct marketing companies, amenities companies, health clubs and spas, and catalog companies; and medical products through national and regional account managers, field sales representatives, and inside sales representatives, as well as through medical distributors. The company was formerly known as Langer, Inc. and changed its name to PC Group, Inc. in July 2009 as a result of business focus shift to personal care products business. PC Group, Inc. was founded in 1971 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10016",
        "website": "http://www.langerbiomechanics.com",
        "full_time_employees": 289
    },
    "PG.BA": {
        "short_name": "PROCTER & GAMBLE",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "ARS",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PG.MX": {
        "short_name": "PROCTER & GAMBLE CO",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PG": {
        "short_name": "Procter & Gamble Company (The)",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PG.SN": {
        "short_name": "PROCTER & GAMBLE",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PG.VI": {
        "short_name": "PROCTER & GAMBLE CO",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PGCO34.SA": {
        "short_name": "PG          DRN",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "BRL",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PHLI": {
        "short_name": "PACIFICHEALTH LABORATORIES INC",
        "long_name": "PacificHealth Laboratories, Inc.",
        "summary": "PacificHealth Laboratories, Inc. engages in the development of nutritional products that enhance health and athletic performance in the United States and internationally. It primarily focuses on sports performance, hydration, fueling, and muscle recovery. The company provides ENDUROX R4, a muscle recovery drink; ACCELERADE protein powered sports drink; ACCEL GEL, a energy gel; Body Glove Surge; ENDUROX EXCEL, an exercise supplement; and 2ND SURGE, an ultra energy gel. It also offers ACCELERADE HYDRO for less intense workouts use before, during, and after workouts for hydration, energy, and recovery. The company markets its products to various distribution channels, including sports specialty and natural product retailers and chains, as well as markets their products through its Website. PacificHealth Laboratories, Inc. was founded in 1995 and is based in Matawan, New Jersey.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Matawan",
        "zipcode": "07747",
        "website": "http://www.pacifichealthlabs.com",
        "full_time_employees": 8
    },
    "PNAT": {
        "short_name": "PURA NATURALS INC",
        "long_name": "Pura Naturals, Inc.",
        "summary": "Pura Naturals, Inc. primarily engages in the marketing and sale of cleaning, health, beauty, and marine products in the United States. It operates through four segments: Health, Consumer, Marine, and Oil Spill Prevention. The company provides bath and body line products, and kitchen and household sponges that absorb oil, grease, and grime, as well as remove impurities from skin; and products for fishing and boating, spas and pools, pet care, infant care, and industrial use. It also develops environmentally sustainable oil spill prevention products and solutions for marine oil transport, oil refining, and trucking industries; and plant-based foam products to the recreational boating and fishing industries. The company offers its products under the Pura Naturals brand name. It sells its products through direct sales, retailers, brokers, and distributors to wholesalers and mass merchandisers, as well as through Internet; and operates retail stores. Pura Naturals, Inc. was founded in 2013 and is headquartered in Lake Forest, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Lake Forest",
        "zipcode": "92630",
        "website": "http://www.puranaturalsproducts.com",
        "full_time_employees": 6
    },
    "PRG.DE": {
        "short_name": "PROCTER GAMBLE",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PRG.F": {
        "short_name": "PROCTER GAMBLE",
        "long_name": "The Procter & Gamble Company",
        "summary": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, personal cleansing, and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "OH",
        "city": "Cincinnati",
        "zipcode": "45202",
        "website": "http://www.pginvestor.com",
        "full_time_employees": 99000
    },
    "PURE": {
        "short_name": "PURE BIOSCIENCE",
        "long_name": "PURE Bioscience, Inc.",
        "summary": "PURE Bioscience, Inc. develops and commercializes antimicrobial products that provide solutions to the health and environmental challenges of pathogen and hygienic control in the United States and internationally. It manufactures and distributes silver dihydrogen citrate (SDC), a non-toxic antimicrobial agent, which offers residual protection and formulates with other compounds. The company offers SDC-based disinfecting and sanitizing products, including PURE Hard Surface, a food contact surface sanitizer and disinfectant; PURE Control, a food contact processing aid for fresh produce and raw poultry; PURE Multi-Purpose and Floor Cleaner Concentrate to clean various resilient surfaces, including floors, glass, and food contact surfaces; and PURE Multi-Purpose Hi-Foam Cleaner Concentrate to clean stainless steel equipment, resilient floors, walls, and painted surfaces. It also provides Axen30, a hard surface disinfectant; Axenohl, an antimicrobial formulation for use as a raw material ingredient in the manufacturing of consumer and commercial disinfecting and sanitizing products; and SILVÃ\u0089RION, an antimicrobial formulation that is used against bacteria, viruses, yeasts, and molds. The company was incorporated in 1992 and is headquartered in Rancho Cucamonga, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Cucamonga",
        "zipcode": "91730",
        "website": "http://www.purebio.com",
        "full_time_employees": 10
    },
    "PYCT": {
        "short_name": "PAYCHEST INC",
        "long_name": "PayChest, Inc.",
        "summary": "Paychest, Inc., a marketing company, licenses non-polluting technologies for the development and commercialization. It offers a range of feminine hygiene products under the Mibella brand name using Flushaway technology, which are flushable, biodegradable, and dispersible. The company also engages in developing Mibella and Flushaway technology solutions to deliver biodegradable diapers for babies, as well as a product for adult incontinence protection. In addition, it offers winged pads and pantiliners. The company offers its products through retailers in the United States, Hong Kong, South Africa, Australia, and the United Kingdom. The company was formerly known as Mellon Research, Inc. and changed its name to Paychest, Inc. in January 2006. Paychest, Inc. was founded in 2000 and is based in Blaine, Washington.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WA",
        "city": "Blaine",
        "zipcode": "98230",
        "website": "http://www.paychest.com",
        "full_time_employees": null
    },
    "QNTA": {
        "short_name": "QUANTA INC",
        "long_name": "Quanta, Inc.",
        "summary": "Quanta, Inc., an applied science company, focuses on enhancing energy levels in plant matter to increase performance within the human body. Its proprietary technology uses quantum mechanics to increase bio-activity of targeted molecules to enhance the desired effects. The company specializes in potentiating rare naturally occurring elements to create impactful and sustainable healing solutions. It offers its technology as a platform to product makers through distribution channels, as well as consumer products. The company sells its products directly to customers through online orders from its websites, and DTC sales at conventions and events; and through wholesalers, including physicians, pharmacies, fitness studios, grocery stores, and other organizations. The company was founded in 2016 and is headquartered in Burbank, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Burbank",
        "zipcode": "91505",
        "website": "http://www.buyquanta.com",
        "full_time_employees": 10
    },
    "RBCL": {
        "short_name": "RBC LIFE SCIENCE INC",
        "long_name": "RBC Life Sciences, Inc.",
        "summary": "RBC Life Sciences, Inc. manufactures, markets, and distributes nutritional supplements and personal care products in North America, Southeast Asia, and Australia. The company's Nutritional Products segment offers nutritional supplements and personal care products, including herbs, vitamins, and minerals; and natural skin, hair, and body care products through a network of independent distributors and license arrangements. Its products include Stem-Kine, a dietary supplement; Microhydrin and Microhydrin Plus antioxidants; VitAloe, a blend of research-backed ingredients; OliViva, an antioxidant beverage to support immune and cardiovascular system; Organic Spirulina, a nutritious alga that provides range of nutrients and easily digested proteins; and NeuroBright to support brain function, and enhance energy and acuity. This segments products also comprise Colo-Vada Plus, a colon cleansing program; HydraCel to enhance the quality of drinking water; 24 Seven, a multivitamin/mineral supplement; Immune 360 to nourish and support the function of the immune system; and Aloe Gelee gel that provides the soothing and moisturizing. Its Medical Products segment offers wound care products for the treatment and healing of wounds, such as pressure ulcers, leg ulcers, cuts, burns, and abrasions. Its products include cleansers, dressings, hydrogels, collagen, calcium alginates, moisture barriers, antimicrobials, and a hydrogel wound dressing with Lidocaine. This segment also offers other wound care products designed to reduce destruction to skin and tissue caused by radiation; and to reduce pain and itching in the skin, and the internal mucosa caused by radiation reactions or reactions to various cancer medications. This segment sells its products under the MPM Medical brand to hospitals, nursing homes, clinics, and pharmacies through a network of medical/surgical supply dealers and pharmaceutical distributors. The company was founded in 1988 and is headquartered in Irving, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Irving",
        "zipcode": "75038",
        "website": null,
        "full_time_employees": 89
    },
    "REV": {
        "short_name": "Revlon, Inc. New",
        "long_name": "Revlon, Inc.",
        "summary": "Revlon, Inc., through its subsidiaries, develops, manufactures, markets, distributes, and sells beauty and personal care products worldwide. The company's Relvon segment offers color cosmetics and beauty tools under the Revlon brand; and hair color under the Revlon ColorSilk and Revlon Professional brands. Its Elizabeth Arden segment markets, distributes, and sells skin care products under the Elizabeth Arden Ceramide, Prevage, Eight Hour, SUPERSTART, Visible Difference, and Skin Illuminating brands; and fragrances under the Elizabeth Arden White Tea, Elizabeth Arden Red Door, Elizabeth Arden 5th Avenue, and Elizabeth Arden Green Tea brands. The company's Portfolio segment offers color cosmetics under the Almay and SinfulColors brands; men's grooming products under the American Crew brand; nail polishes, gel nail color, and nail enhancements under the CND brand; nail care products under the Cutex brand; anti-perspirant deodorants under the Mitchum brand; hair care products under the Creme of Nature; and hair color line under the Llongueras brand. Its Fragrances segment develops, markets, and distributes owned and licensed fragrances, as well as distributes prestige fragrance brands owned by third parties. This segment offers its products under the Juicy Couture, John Varvatos, AllSaints, Britney Spears, Elizabeth Taylor, Christina Aguilera, Jennifer Aniston, Mariah Carey, Curve, Giorgio Beverly Hills, Ed Hardy, Charlie, Lucky Brand, Â\u008bPSÂ\u009b, Alfred Sung, Halston, Geoffrey Beene, and White Diamonds brands. It sells its products through sales force, sales representatives, independent distributors, mass and prestige retail, e-commerce sites, department stores, and specialty cosmetics stores, as well as licenses its Revlon and other trademarks to the manufacturers of complementary beauty-related products and accessories. Revlon, Inc. was founded in 1932 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10004",
        "website": "http://www.revlon.com",
        "full_time_employees": 6000
    },
    "RVIV": {
        "short_name": "REVIV3 PROCARE CO",
        "long_name": "Reviv3 Procare Company",
        "summary": "Reviv3 Procare Company manufactures, markets, distributes, and sells hair and skin care products in the United States, Canada, Europe, and Asia. It offers PREP shampoos; PRIME hair conditioners; TREAT maintenance care products; BOOST to deliver nutrients and enhance circulation to the scalp; MEND deep hair repair masks for added moisture; and PROTECT, a heat protectant product to prevent damage from irons and dryers, as well as thickening sprays for giving hair more volume and body. The company also provides baby care products, such as shampoos, body washes, and lotions under the LANU brand name; and perfumes, mouthwashes, and deodorants, as well as shaving, makeup, and nail products. It serves business-to-business salon through its network of domestic and international distributors; and individuals through its e-commerce site and various third party online platforms. Reviv3 Procare Company was incorporated in 2015 and is based in El Monte, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "El Monte",
        "zipcode": "91731",
        "website": "http://www.reviveprocare.com",
        "full_time_employees": 6
    },
    "RVL1.F": {
        "short_name": "REVLON INC. A NEW  DL-,01",
        "long_name": "Revlon, Inc.",
        "summary": "Revlon, Inc., through its subsidiaries, develops, manufactures, markets, distributes, and sells beauty and personal care products worldwide. The company's Relvon segment offers color cosmetics and beauty tools under the Revlon brand; and hair color under the Revlon ColorSilk and Revlon Professional brands. Its Elizabeth Arden segment markets, distributes, and sells skin care products under the Elizabeth Arden Ceramide, Prevage, Eight Hour, SUPERSTART, Visible Difference, and Skin Illuminating brands; and fragrances under the Elizabeth Arden White Tea, Elizabeth Arden Red Door, Elizabeth Arden 5th Avenue, and Elizabeth Arden Green Tea brands. The company's Portfolio segment offers color cosmetics under the Almay and SinfulColors brands; men's grooming products under the American Crew brand; nail polishes, gel nail color, and nail enhancements under the CND brand; nail care products under the Cutex brand; anti-perspirant deodorants under the Mitchum brand; hair care products under the Creme of Nature; and hair color line under the Llongueras brand. Its Fragrances segment develops, markets, and distributes owned and licensed fragrances, as well as distributes prestige fragrance brands owned by third parties. This segment offers its products under the Juicy Couture, John Varvatos, AllSaints, Britney Spears, Elizabeth Taylor, Christina Aguilera, Jennifer Aniston, Mariah Carey, Curve, Giorgio Beverly Hills, Ed Hardy, Charlie, Lucky Brand, Â\u008bPSÂ\u009b, Alfred Sung, Halston, Geoffrey Beene, and White Diamonds brands. It sells its products through sales force, sales representatives, independent distributors, mass and prestige retail, e-commerce sites, department stores, and specialty cosmetics stores, as well as licenses its Revlon and other trademarks to the manufacturers of complementary beauty-related products and accessories. Revlon, Inc. was founded in 1932 and is based in New York, New York.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10004",
        "website": "http://www.revlon.com",
        "full_time_employees": 6000
    },
    "SHRG": {
        "short_name": "SHARING SERVICES GLOBAL CORP",
        "long_name": "Sharing Services Global Corporation",
        "summary": "Sharing Services Global Corporation operates in the direct selling industry primarily in the United States and Canada. It markets and distributes health and wellness products under the Elevate brand through an independent sales force. The company offers its products online through its website, www.elevacity.com. It also provides products in the areas of technology, media, insurance, and travel industries. The company was formerly known as Sharing Services, Inc. and changed its name to Sharing Services Global Corporation in January 2019. Sharing Services Global Corporation is headquartered in Plano, Texas.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Plano",
        "zipcode": "75075",
        "website": "http://www.shrginc.com",
        "full_time_employees": 80
    },
    "SKVI": {
        "short_name": "SKINVISIBLE INC",
        "long_name": "Skinvisible, Inc.",
        "summary": "Skinvisible, Inc., together with its subsidiaries, focuses on the development, manufacture, and sale of topical, transdermal, and mucosal polymer-based delivery system technologies and formulations for use in pharmaceutical, over-the-counter, personal skincare, and cosmetic arenas. Its non-dermatological formulations offer solutions for women's health, pain management, and others markets. The company offers sunless tanning and sunscreen products. It also licenses to pharmaceutical and consumer goods companies; assists pharmaceutical clients in the early development of the formulations; and provides solutions to pharmaceutical companies by reformulating their products coming off patent with a new Invisicare patent, and new product benefits and line extensions. The company was formerly known as Microbial Solutions, Inc. and changed its name to Skinvisible, Inc. in February 1999. Skinvisible, Inc. was founded in 1998 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89120",
        "website": "http://www.skinvisible.com",
        "full_time_employees": 2
    },
    "SLGD": {
        "short_name": "SCOTT'S LIQUID GOLD-INC",
        "long_name": "Scott's Liquid Gold-Inc.",
        "summary": "Scott's Liquid Gold-Inc., together its subsidiaries, develops, markets, and sells household and personal care products in the United States. It operates in two segments, Household Products and Personal Care Products. The Household Products segment offers wood care and floor restore products under the Scott's Liquid Gold name; stain and odor removing products under the Kids N Pets and Messy Pet brand name for children and pets; laundry additives under the Biz brand name; and dry cleaning products under the Dryel brand. The Personal Care Products segment provides skincare products under the Alpha brand; and hair care products under the Prell and Denorex brands, as well as distributes Batiste Dry shampoos. It sells its products through sales force and independent distributors to mass merchandisers, drugstores, supermarkets, hardware stores, e-commerce retailers, and other retail outlets, as well as to wholesale distributors. Scott's Liquid Gold-Inc. was incorporated in 1954 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Greenwood Village",
        "zipcode": "80111-0019",
        "website": "http://www.slginc.com",
        "full_time_employees": 36
    },
    "SNBH": {
        "short_name": "SENTIENT BRANDS HLDGS INC",
        "long_name": "Sentient Brands Holdings Inc.",
        "summary": "Sentient Brands Holdings Inc., a product development and brand management company, focuses on building innovative brands in the luxury and premium market space. It intends to offers CBD luxury skin care and lifestyle products, such as purifying exfoliator, replenishing oil, ultra-nourishing face cream, revitalizing eye cream, high potency tincture, CBD infused and scented candles, and CBD infused women's fragrance under the Ouevre brand through direct-to consumer online e-commerce platform, as well as wholesale partners. The company was formerly known as Intelligent Buying, Inc. and changed its name to Sentient Brands Holdings Inc. in March 2021. Sentient Brands Holdings Inc. was founded in 2002 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10022",
        "website": "http://www.sentientbrands.com",
        "full_time_employees": 2
    },
    "SNST": {
        "short_name": "SUNSET CAPITAL ASSETS INC",
        "long_name": "Sunset Capital Assets, Inc.",
        "summary": "Aphex BioCleanse Systems, Inc. develops sanitizing solutions without the use of alcohol. It products includes sanitizers, surface disinfectants, wound wash, and solutions for treatment of livestock. The company was incorporated in 2010 and is based in Rochester, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Rochester",
        "zipcode": "14534",
        "website": "http://www.aphexus.com",
        "full_time_employees": null
    },
    "SPB.MX": {
        "short_name": "SPECTRUM BRANDS HOLDINGS INC",
        "long_name": "Spectrum Brands Holdings, Inc.",
        "summary": "Spectrum Brands Holdings, Inc. operates as a branded consumer products company worldwide. The company's Hardware & Home Improvement segment offers hardware products under the National Hardware and FANAL brands; locksets and door hardware under the Kwikset, Weiser, Baldwin, EZSET, and Tell Manufacturing brands; and plumbing products under the Pfister brand. Its Home and Personal Care segment provides home appliances under the Black & Decker, Russell Hobbs, George Foreman, Toastmaster, Juiceman, Farberware, and Breadman brands; and personal care products under the Remington and LumaBella brands. The company's Global Pet Care segment provides rawhide chewing, dog and cat clean-up and food, training, health and grooming, small animal food and care, and rawhide-free products under the 8IN1 (8-in-1), Dingo, Nature's Miracle, Wild Harvest, Littermaid, Jungle, Excel, FURminator, IAMS, Eukanuba, Healthy-Hide, DreamBone, SmartBones, ProSense, Perfect Coat, eCOTRITION, Birdola, and Digest-eeze brands. This segment also offers aquarium kits, stand-alone tanks, and aquatics equipment and consumables under the Tetra, Marineland, Whisper, Instant Ocean, GloFish, OmegaOne, and OmegaSea brands. Its Home and Garden segment provides outdoor insect and weed control solutions, and animal repellents under the Spectracide, Garden Safe, Liquid Fence, and EcoLogic brands; household pest control solutions under the Hot Shot, Black Flag, Real-Kill, Ultra Kill, The Ant Trap, and Rid-A-Bug brand names; and personal-use pesticides and insect repellent products under the Cutter and Repel brands. The company sells its products through retailers, e-commerce and online retailers, wholesalers and distributors, construction companies, and original equipment manufacturers. Spectrum Brands Holdings, Inc. is headquartered in Middleton, Wisconsin.",
        "currency": "MXN",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "WI",
        "city": "Middleton",
        "zipcode": "53562",
        "website": "http://www.spectrumbrands.com",
        "full_time_employees": 12100
    },
    "SPB": {
        "short_name": "Spectrum Brands Holdings, Inc.",
        "long_name": "Spectrum Brands Holdings, Inc.",
        "summary": "Spectrum Brands Holdings, Inc. operates as a branded consumer products company worldwide. The company's Hardware & Home Improvement segment offers hardware products under the National Hardware and FANAL brands; locksets and door hardware under the Kwikset, Weiser, Baldwin, EZSET, and Tell Manufacturing brands; and plumbing products under the Pfister brand. Its Home and Personal Care segment provides home appliances under the Black & Decker, Russell Hobbs, George Foreman, Toastmaster, Juiceman, Farberware, and Breadman brands; and personal care products under the Remington and LumaBella brands. The company's Global Pet Care segment provides rawhide chewing, dog and cat clean-up and food, training, health and grooming, small animal food and care, and rawhide-free products under the 8IN1 (8-in-1), Dingo, Nature's Miracle, Wild Harvest, Littermaid, Jungle, Excel, FURminator, IAMS, Eukanuba, Healthy-Hide, DreamBone, SmartBones, ProSense, Perfect Coat, eCOTRITION, Birdola, and Digest-eeze brands. This segment also offers aquarium kits, stand-alone tanks, and aquatics equipment and consumables under the Tetra, Marineland, Whisper, Instant Ocean, GloFish, OmegaOne, and OmegaSea brands. Its Home and Garden segment provides outdoor insect and weed control solutions, and animal repellents under the Spectracide, Garden Safe, Liquid Fence, and EcoLogic brands; household pest control solutions under the Hot Shot, Black Flag, Real-Kill, Ultra Kill, The Ant Trap, and Rid-A-Bug brand names; and personal-use pesticides and insect repellent products under the Cutter and Repel brands. The company sells its products through retailers, e-commerce and online retailers, wholesalers and distributors, construction companies, and original equipment manufacturers. Spectrum Brands Holdings, Inc. is headquartered in Middleton, Wisconsin.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Middleton",
        "zipcode": "53562",
        "website": "http://www.spectrumbrands.com",
        "full_time_employees": 12100
    },
    "SPCO": {
        "short_name": "STEPHAN CO",
        "long_name": "The Stephan Co.",
        "summary": "The Stephan Co., together with its subsidiaries, manufactures, sells, and distributes hair care and personal care products. It operates in two segments, Distributors and Brands. The Distributors segment sells to distributors that purchase company's hair care products, and beauty and barber supplies for resale to salons, barbershops, and beauty schools, as well as operates as a mail order, and online barber and beauty supply company. This segment also sells products directly to cosmetology schools. The Brands segment manufacture and sells products to mass merchandisers, chain drug stores, and supermarkets that sells hair care and other personal care products directly to the end user; and distributors that sell to retailers. The company manufactures Image and Sorbie hair care products that are sold through distributors to salons; and Cashmere Bouquet talc, Quinsana Medicated talc, Balm Barr and Stretch Mark creams and lotions, Protein 29 liquid and gel grooming aids, and Stiff Stuff and Wildroot hair care products. It also markets a line of cosmetics through online and mail order channels; and manufactures and sells shampoos, hair treatments, after-shave lotion, dandruff lotion, hair conditioners, and hair spray under the brand name STEPHAN'S, as well as Lekari, New Era, OLD 97, and ImÃ¡gen. In addition, it markets Hope, Interlude, and Fade-away brand names through various retail chains. The company operates in the United States, Canada, Europe, and Asia. The Stephan Co. was founded in 1897 and is headquartered in Tampa, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Tampa",
        "zipcode": "33605",
        "website": "http://www.thestephanco.com",
        "full_time_employees": 95
    },
    "SUMR": {
        "short_name": "Summer Infant, Inc.",
        "long_name": "Summer Infant, Inc.",
        "summary": "Summer Infant, Inc., together with its subsidiaries, designs, markets, and distributes branded juvenile health, safety, and wellness products. It offers audio and video monitors; and gates, potties, entertainers, baby monitors, bath products, specialty blankets, strollers, car seats, and travel systems, as well as baby gear products under the Summer and SwaddleMe brand names. The company sells its products directly to retailers through own direct sales force and a network of independent manufacturers' representatives and distributors; and through partner's websites and its summerinfant.com website, as well as through international distributors, representatives, and to retail customers. It operates in the United States, Canada, Europe, South America, Mexico, Asia, and the Middle East. Summer Infant, Inc. was founded in 1985 and is headquartered in Woonsocket, Rhode Island.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "RI",
        "city": "Woonsocket",
        "zipcode": "02895",
        "website": "http://www.summerinfant.com",
        "full_time_employees": 115
    },
    "SYHO": {
        "short_name": "SYNERGIE WELLNESS PRODUCTS INC",
        "long_name": "Synergie Wellness Products, Inc.",
        "summary": "Synergie Wellness Products, Inc. manufactures personal wellness products. It develops products for personal sanitation, hygiene, and relaxation. The company was formerly known as Synergie Holdings Limited, Inc. and changed its name to Synergie Wellness Products, Inc. in May 2004. The company is based in Del Mar, California.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Del Mar",
        "zipcode": "92014",
        "website": "http://www.synergiewellness.com",
        "full_time_employees": 7
    },
    "TDNT": {
        "short_name": "TRIDENT BRANDS INC",
        "long_name": "Trident Brands Incorporated",
        "summary": "Trident Brands Incorporated, together with its subsidiaries, focuses on developing branded and private label consumer products and ingredients in the United States and Canada. The company offers branded consumer products in the functional nutrition and dietary supplement categories under the Brain Armor and P2N Peak Performance Nutrition brands, as well as private label sports nutrition items to various retailers. The company also holds various banking facilities. The company was formerly known as Sandfield Ventures Corp. and changed its name to Trident Brands Incorporated in July 2013. Trident Brands Incorporated was founded in 2007 and is based in Brookfield, Wisconsin.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "WI",
        "city": "Brookfield",
        "zipcode": "53005",
        "website": "http://www.tridentbrands.com",
        "full_time_employees": null
    },
    "TMXN": {
        "short_name": "TRIMAX CORPORATION",
        "long_name": "Trimax Corporation",
        "summary": "Trimax Corporation provides mobile apps and Web development solutions. It offers application development, Web application development, technology consulting, cloud services, and e-commerce or business intelligence and analytics. The company is also involved in production of olives and organic farming; provision of coffee; real estate development; and tourism activities. In addition, it engages in the design, manufacture, sale, export, and after-sales service of yachts and yacht parts. The company is based in Ft Lauderdale, Florida.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "FL",
        "city": "Ft Lauderdale",
        "zipcode": "33304",
        "website": "http://www.trimaxcorp.com",
        "full_time_employees": null
    },
    "UG": {
        "short_name": "United-Guardian, Inc.",
        "long_name": "United-Guardian, Inc.",
        "summary": "United-Guardian, Inc. manufactures and markets cosmetic ingredients, pharmaceuticals, medical lubricants, and specialty industrial products in the United States and internationally. It offers cosmetic ingredients, including LUBRAJEL line of water-based moisturizing and lubricating gel formulations; LUBRAJEL NATURAL consisting of natural ingredients for cosmetic use; LUBRAJEL MARINE; LUBRASIL II SB, a special formulation of LUBRAJEL in which silicone oil is incorporated into a LUBRAJEL base; LUBRAJEL II XD; B-122, a powdered lubricant that is used in the manufacture of pressed powders, eyeliners, rouges, and industrial products; KLENSOFT, a surfactant, which is used in shampoos, shower gels, makeup removers, and other cosmetic formulations; and ORCHID COMPLEX, an oil-soluble base for skin creams, lotions, cleansers, and other cosmetics. The company's medical lubricants comprise LUBRAJEL RR and RC, which are water-based lubricant gels for urinary catheters; LUBRAJEL MG to lubricate urinary catheters, pre-lubricated enema tips, and other medical devices; LUBRAJEL LC and LUBRAJEL FA that are LUBRAJEL formulations for oral care; and LUBRAJEL FLUID to lubricate water-soluble products. Its pharmaceutical products consist of RENACIDIN, a prescription drug to prevent and dissolve calcifications in urethral catheters and the urinary bladder; and CLORPACTIN WCS-90, an antimicrobial product to treat infections in the urinary bladder. The company's industrial products include DESELEX, a sequestering and chelating agent used for manufacturing detergents; and THOROCLENS, a chlorine-based cleanser. It also conducts research and development, primarily related to the development of cosmetic ingredients. The company markets its products through marketing partners, distributors, and wholesalers. United-Guardian, Inc. was incorporated in 1942 and is based in Hauppauge, New York.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NGM",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Hauppauge",
        "zipcode": "11788",
        "website": "http://www.u-g.com",
        "full_time_employees": 22
    },
    "USJ.F": {
        "short_name": "USANA HEALTH",
        "long_name": "USANA Health Sciences, Inc.",
        "summary": "USANA Health Sciences, Inc. develops, manufactures, and sells science-based nutritional and personal care products. The company offers USANA nutritional products that comprise essentials/CellSentials, such as vitamin and mineral supplements that provide a foundation of total body nutrition for various age groups; optimizers comprising targeted supplements that are designed to meet cardiovascular, skeletal/structural, and digestive health needs; and foods that include meal replacement shakes, snack bars, and other related products, which provide macro-nutrition. It also provides Celavive, a skin care regimen for various skin care types and ethnicities; and other products for prenatal, infant, and young child age groups. In addition, the company offers materials and online tools to assist associates in building their businesses, as well as in marketing products. It offers its products directly in the Asia Pacific, the Americas, and Europe, as well as online. USANA Health Sciences, Inc. was founded in 1992 and is headquartered in Salt Lake City, Utah.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84120",
        "website": "http://www.usana.com",
        "full_time_employees": 1943
    },
    "USNA": {
        "short_name": "USANA Health Sciences, Inc.",
        "long_name": "USANA Health Sciences, Inc.",
        "summary": "USANA Health Sciences, Inc. develops, manufactures, and sells science-based nutritional and personal care products. The company offers USANA nutritional products that comprise essentials/CellSentials, such as vitamin and mineral supplements that provide a foundation of total body nutrition for various age groups; optimizers comprising targeted supplements that are designed to meet cardiovascular, skeletal/structural, and digestive health needs; and foods that include meal replacement shakes, snack bars, and other related products, which provide macro-nutrition. It also provides Celavive, a skin care regimen for various skin care types and ethnicities; and other products for prenatal, infant, and young child age groups. In addition, the company offers materials and online tools to assist associates in building their businesses, as well as in marketing products. It offers its products directly in the Asia Pacific, the Americas, and Europe, as well as online. USANA Health Sciences, Inc. was founded in 1992 and is headquartered in Salt Lake City, Utah.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "UT",
        "city": "Salt Lake City",
        "zipcode": "84120",
        "website": "http://www.usana.com",
        "full_time_employees": 1943
    },
    "UT1.F": {
        "short_name": "ACME UTD CORP.  DL 2,50",
        "long_name": "Acme United Corporation",
        "summary": "Acme United Corporation, together with its subsidiaries, supplies cutting, measuring, first aid, sharpening, and safety products to the school, home, office, hardware, sporting good, and industrial markets in the United States, Canada, Europe, and Asia. It offers scissors, shears, rulers, pencil sharpeners, paper trimmers, safety cutters, lettering products, glue guns, and other craft products under the Westcott brand name; and cutting tools under the Clauss brand. It also provides fixed blades, folding knives, sight cutting tools, and tactical tools under the Camillus brand name; fishing tools and knives, as well as cut and puncture resistant gloves, telescopic landing nets, net containment systems, and fishing gaffs under the Cuda brand name; and sharpening tools under the DMT brand name. It offers first aid kit and safety solution under the First Aid Only brand; portable eyewash solution and over-the-counter medication, including active ingredients aspirin, acetaminophen, and ibuprofen under the PhysiciansCare brand; bodily fluid and spill clean-up solution under the Spill Magic brand; various first aid kit, refill, and safety supplies, including CPR kits, burn kits, and automotive and emergency survival kits under the First Aid Central; and alcohol prep pads, alcohol wipes, benzalkonium chloride wipes, various antiseptic wipes, castile soaps, and lens cleaning wipes under the Med-Nap brand. It sells its products directly and through its independent manufacturer representatives to wholesale, contract, and retail stationery distributors; office supply superstores; school supply distributors; industrial distributors; wholesale florists; mass market and e-commerce retailers; and hardware chains, as well as sells a selection of products through its websites. The company was formerly known as Acme Shear Company and changed its name to Acme United Corporation in 1971. The company was founded in 1867 and is based in Shelton, Connecticut.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CT",
        "city": "Shelton",
        "zipcode": "06484",
        "website": "http://www.acmeunited.com",
        "full_time_employees": 552
    },
    "ZRVT": {
        "short_name": "ZURVITA HOLDINGS INC",
        "long_name": "Zurvita Holdings, Inc.",
        "summary": "Zurvita Holdings, Inc. markets health and wellness products in the United States, Hong Kong, Canada, Singapore, Australia, the United Kingdom, and the Dominican Republic. Its principal products comprise Zeal Wellness, an antioxidants and vitamins nutritional product in wild berry and bold grape flavors; Zeal Advanced Formula Protein Shakes, a source of dietary fiber in chocolate delight and vanilla crÃ¨me flavors; Zeal cleanse, a herbal and probiotic cleanse; and Zeal burn, a thermogenic fat burner. The company sells its products through its network of independent sales consultants. Zurvita Holdings, Inc. is headquartered in Houston, Texas. Zurvita Holdings, Inc. is a subsidiary of The Amacore Group, Inc.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77024",
        "website": "http://www.zurvita.com",
        "full_time_employees": 21
    }
}