{
  "0L5.F": {
    "city": "Eagle",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Lamb Weston Holdings, Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "LAMB WESTON HLDGS  DL 1",
    "state": "ID",
    "summary": "Lamb Weston Holdings, Inc. produces, distributes, and markets value-added frozen potato products worldwide. It operates through four segments: Global, Foodservice, Retail, and Other. The company offers frozen potatoes, sweet potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as various customer labels. The company also offers its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. In addition, it engages in the vegetable and dairy businesses. The company serves retail and foodservice customers; grocery, mass, club, and specialty retailers; and businesses, independent restaurants, regional chain restaurants, and convenience stores, as well as educational institutions. Lamb Weston Holdings, Inc. was founded in 1950 and is headquartered in Eagle, Idaho.",
    "website": "http://www.lambweston.com",
    "zipcode": "83616"
  },
  "0Q3.F": {
    "city": "El Segundo",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Beyond Meat, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "BEYOND MEAT INC.",
    "state": "CA",
    "summary": "Beyond Meat, Inc., a food company, manufactures, markets, and sells plant-based meat products in the United States and internationally. It operates under the Beyond Meat, Beyond Burger, Beyond Beef, Beyond Sausage, Beyond Breakfast Sausage, Beyond Chicken, Beyond Fried Chicken, Beyond Meatball, the Caped Steer Logo, Go Beyond, Eat What You Love, The Cookout Classic, The Future of Protein, and The Future of Protein Beyond Meat and design trademarks. The company sells its products through grocery, mass merchandiser, club, convenience store, natural retailer channels, restaurants, foodservice outlets, and schools, as well as through an e-commerce site. The company was formerly known as Savage River, Inc. and changed its name to Beyond Meat, Inc. in September 2018. Beyond Meat, Inc. was founded in 2009 and is headquartered in El Segundo, California.",
    "website": "http://www.beyondmeat.com",
    "zipcode": "90245"
  },
  "2OV.MU": {
    "city": "Chula Vista",
    "country": "United States",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Packaged Foods",
    "long_name": "Youngevity International, Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "YOUNGEVITY INTL  DL-,01",
    "state": "CA",
    "summary": "Youngevity International, Inc. develops and distributes health and nutrition related products and services in the United States and internationally. It operates in three segments: Direct Selling, Commercial Coffee, and Commercial Hemp. The company offers nutritional supplements, gourmet coffee, weight management products, skincare and cosmetics, health and wellness, packaged foods, lifestyle products, pet care, digital products, telecare health services, apparel and fashion accessories, and business lending products. It also produces and sells coffee products under the Café La Rica, Café Alma, Josie's Java House, Javalution Urban Grind, Javalution Daily Grind, and Javalution Royal Roast brands; and produces and markets a line of coffees under the JavaFit brand directly to consumers. In addition, it offers cannabidiol oils from hemp stock. The company sells coffee and equipment to wellness and retirement communities, and various cruise lines and coffee service operators, as well as through distribution network. Youngevity International, Inc. also markets its products through a range of consumer Websites, such as youngevity.com; ygyi.com; heritagemakers.com; hempfx.com; clrroasters.com; cafelarica.com; javalution.com. The company was formerly known as AL International, Inc. and changed its name to Youngevity International, Inc. in July 2013. Youngevity International, Inc. was founded in 1996 and is headquartered in Chula Vista, California.",
    "website": "http://www.ygyi.com",
    "zipcode": "91914"
  },
  "43D.F": {
    "city": "Irving",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Darling Ingredients Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "DARLING INGRED.INC.DL-,01",
    "state": "TX",
    "summary": "Darling Ingredients Inc. develops, produces, and sells natural ingredients from edible and inedible bio-nutrients. The company operates through three segments: Feed Ingredients, Food Ingredients, and Fuel Ingredients. It offers ingredients and customized specialty solutions for customers in the pharmaceutical, food, pet food, feed, industrial, fuel, bioenergy, and fertilizer industries. The company collects and transforms various animal by-product streams into useable and specialty ingredients, such as collagen, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstock, green energy, natural casings, and hides. It also recovers and converts used cooking oil and animal fats, and residual bakery products into valuable feed and fuel ingredients. In addition, the company provides environmental services, including grease trap collection and disposal services to food service establishments. It primarily operates under the Sonac, Dar Pro, Rothsay, Rousselot, CTH, Ecoson, and Rendac brand names in North America, Europe, China, South America, Australia, and internationally. The company was formerly known as Darling International Inc. and changed its name to Darling Ingredients Inc. in May 2014. Darling Ingredients Inc. was founded in 1882 and is headquartered in Irving, Texas.",
    "website": "http://www.darlingii.com",
    "zipcode": "75038"
  },
  "5UQ.F": {
    "city": "Plano",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "NuZee, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "NUZEE INC.  DL -,00001",
    "state": "TX",
    "summary": "NuZee, Inc., a specialty coffee company, engages in the manufacture, packing, and sale of single serve coffee and tea bag-style coffee for coffee roasters, store brands, and coffee brands in North America, Japan, Latin America, and South Korea. The company provides its products under Barista, Twin Peaks, and Pine Ranch brands. It serves retail and grocery customers, office, and hospitality sectors. NuZee, Inc. was founded in 2011 and is headquartered in Plano, Texas.",
    "website": "http://www.mynuzee.com",
    "zipcode": "75074"
  },
  "6PP.F": {
    "city": "Greeley",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Pilgrim's Pride Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "PILGRIM'S PRIDE  DL-,01",
    "state": "CO",
    "summary": "Pilgrim's Pride Corporation produces, processes, markets, and distributes fresh, frozen, and value-added chicken and pork products to retailers, distributors, and foodservice operators in the United States, the United Kingdom, Mexico, France, Puerto Rico, the Netherlands, rest of Europe, the Middle East, Asia, and internationally. The company offers fresh chicken and pork products, including pre-marinated or non-marinated refrigerated (nonfrozen) whole or cut-up chickens; frozen whole chickens; breast and mini breast fillets; pork cuts; added value pork and pork ribs; and prepackaged case-ready chickens, such as whole chickens and chicken parts. It also provides prepared chicken products comprising portion-controlled breast fillets, tenderloins and strips, delicatessen products, salads, formed nuggets and patties, and bone-in chicken parts; and exported chicken and pork products primarily consist of whole chickens and chicken parts sold either refrigerated for distributors in the U.S. or frozen for distribution to export markets and primary pork cuts, hog heads, and trotters frozen for distribution to export markets. The company offers its products under the Pilgrim's, Just BARE, Gold'n Pump, Gold Kist, County Pride Chicken, Pierce Chicken, Pilgrim's Mexico, County Post, Savoro, To-Ricos, Del Dia, Moy Park, and O'Kane brands. Pilgrim's Pride Corporation sells its products to the foodservice market principally consists of chain restaurants, food processors, broad-line distributors, and other institutions; and retail market, which comprise primarily grocery store chains, wholesale clubs, and other retail distributors. The company was founded in 1946 and is headquartered in Greeley, Colorado. Pilgrim's Pride Corporation is a subsidiary of JBS S.A.",
    "website": "http://www.pilgrims.com",
    "zipcode": "80634-9038"
  },
  "7521.F": {
    "city": "Denver",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Koios Beverage Corp.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "KOIOS BEVERAGE CORP.",
    "state": "CO",
    "summary": "Koios Beverage Corp., together with its subsidiaries, produces, markets, and sells functional beverages in the United States. The company also provides supplements and coffee products. It distributes its products through a network of approximately 4,400 retail locations and Website. The company was formerly known as Super Nova Petroleum Corp. and changed its name to Koios Beverage Corp. in April 2018. Koios Beverage Corp. was incorporated in 2012 and is headquartered in Denver, Colorado.",
    "website": "http://koiosbeveragecorp.com",
    "zipcode": "80204"
  },
  "76L.SG": {
    "city": "Denver",
    "country": "United States",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Packaged Foods",
    "long_name": "The Simply Good Foods Company",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Simply Good Foods Co. Reg. Shar",
    "state": "CO",
    "summary": "The Simply Good Foods Company operates as a consumer packaged food and beverage company in North America and internationally. The company develops, markets, and sells snacks and meal replacements. It offers primarily nutrition bars, ready-to-drink (RTD) shakes, sweet and salty snacks, protein bars, cookies, pizza, protein chips, recipes, and confectionery products, as well as licensed frozen meals under the Atkins, Atkins Endulge, and Quest brand names. The company distributes its products to various retail channels, such as mass merchandise, grocery and drug channels, club stores, convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including atkins.com, questnutrition.com, and amazon.com. The Simply Good Foods Company is headquartered in Denver, Colorado.",
    "website": "http://www.thesimplygoodfoodscompany.com",
    "zipcode": "80202"
  },
  "7FP.F": {
    "city": "Secaucus",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Freshpet, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "FRESHPET INC.  DL-,001",
    "state": "NJ",
    "summary": "Freshpet, Inc. manufactures and markets natural fresh meals and treats for dogs and cats in the United States, Canada, and the United Kingdom. The company sells its products under the Freshpet brand; and Dognation and Dog Joy labels through various classes of retail, including grocery, mass, club, pet specialty, and natural, as well as online. Freshpet, Inc. was incorporated in 2004 and is headquartered in Secaucus, New Jersey.",
    "website": "http://www.freshpet.com",
    "zipcode": "07094"
  },
  "A501.F": {
    "city": "Flushing",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Planet Green Holdings Corp.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "PLANET GREEN HOLDINGS",
    "state": "NY",
    "summary": "Planet Green Holdings Corp., through its subsidiaries, grows, manufactures, and distributes Cyan brick, black, and green tea in China. It also engages in the research, development, manufacture, and sale of chemical products, including formaldehyde, urea formaldehyde adhesive, methylal, ethanol fuel, fuel additives, and clean fuel. In addition, it operates an online demand-side platform, a system that allows buyers of digital advertising inventory to manage multiple advertisement exchange and data exchange through one interface in North America and China. The company was formerly known as American Lorain Corporation and changed its name to Planet Green Holdings Corp. in September 2018. Planet Green Holdings Corp. was incorporated in 1986 and is headquartered in Flushing, New York.",
    "website": "http://www.planetgreenholdings.com",
    "zipcode": "11345"
  },
  "AAGH": {
    "city": "Alhambra",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "America Great Health",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "AMERICA GREAT HEALTH",
    "state": "CA",
    "summary": "America Great Health does not have significant operations. The company focuses on its business in the health related industry. Previously, it was engaged in the sale of electronic products. The company was formerly known as Crown Marketing. America Great Health was founded in 2013 and is based in Alhambra, California.",
    "website": "http://www.cwnmusa.com",
    "zipcode": "91803"
  },
  "AAPT": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "All American Pet Company, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "ALL AMERICAN PET COMPANY INC",
    "state": "CA",
    "summary": "All American Pet Company, Inc. develops and markets pet wellness products in the United States. The company offers alcohol-free anti-bacterial dog cleaner products, such as pet wipes and sprays under the Pawtizer name; vitamin and mineral bars under the CHOMPBar brand name; and nutritional dog food bar under the Nutra Bars brand. It also intends to offer Mutt pet food product; and Chewies dog snacks. All American Pet Company, Inc. was founded in 2003 and is based in Los Angeles, California.",
    "website": "http://www.allamericanpetcompany.com",
    "zipcode": "90024"
  },
  "ADIA": {
    "city": "Kurtistown",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Adia Nutrition, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "ADIA NUTRITION INC",
    "state": "HI",
    "summary": "Adia Nutrition, Inc. produces probiotic chews and drink mixes. It offers balanced berry, unsweetened green tea, raspberry lemonade slim, lemon lime sport, and orange mango probiotic drink mixes; and berry and lemonade probiotic chews. The company provides its products online, as well as through its nutrition stores. Adia Nutrition, Inc. was formerly known as PivX Solutions Inc. and changed its name to Adia Nutrition, Inc. in May 2004. The company was founded in 1999 and is based in Kurtistown, Hawaii.",
    "website": "http://www.adianutrition.com",
    "zipcode": "96760"
  },
  "AMNC": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Amincor, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "AMINCOR INC",
    "state": "NY",
    "summary": "Amincor, Inc., through its subsidiaries, manufactures and sells bakery food products. It provides various sliced bread, yeast and cake doughnuts, frozen donuts, cookies, and snack products to supermarket in-store bakery departments, and food service channels. It also offers water remediation services, such as water testing and evaluation, system engineering and design, system training servicing, and maintenance service in the northeast United States, as well as is involved in treating and discharging petroleum impacted water into the sanitary sewer system. The company serves oil companies, petroleum marketers, jobbers, municipal entities, school districts, industrial facilities, and other businesses. In addition, it provides maintenance, repair, and construction services to customers with underground petroleum storage tanks and petroleum product dispensing equipment, as well as is engaged in environmental consulting, site assessment, analysis, and management of site remediation for owners and operators of petroleum storage facilities. The company serves national and multinational enterprises, as well as to local and national governmental agencies and municipalities. The company was formerly known as Joning Corp and changed its name to Amincor, Inc. in February 2010. Amincor, Inc. was incorporated in 1997 and is headquartered in New York, New York.",
    "website": "http://www.amincorinc.com",
    "zipcode": "10019"
  },
  "AMNCB": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Amincor, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "AMINCOR INC",
    "state": "NY",
    "summary": "Amincor, Inc., through its subsidiaries, manufactures and sells bakery food products. It provides various sliced bread, yeast and cake doughnuts, frozen donuts, cookies, and snack products to supermarket in-store bakery departments, and food service channels. It also offers water remediation services, such as water testing and evaluation, system engineering and design, system training servicing, and maintenance service in the northeast United States, as well as is involved in treating and discharging petroleum impacted water into the sanitary sewer system. The company serves oil companies, petroleum marketers, jobbers, municipal entities, school districts, industrial facilities, and other businesses. In addition, it provides maintenance, repair, and construction services to customers with underground petroleum storage tanks and petroleum product dispensing equipment, as well as is engaged in environmental consulting, site assessment, analysis, and management of site remediation for owners and operators of petroleum storage facilities. The company serves national and multinational enterprises, as well as to local and national governmental agencies and municipalities. The company was formerly known as Joning Corp and changed its name to Amincor, Inc. in February 2010. Amincor, Inc. was incorporated in 1997 and is headquartered in New York, New York.",
    "website": "http://www.amincorinc.com",
    "zipcode": "10019"
  },
  "AMNF": {
    "city": "Hayward",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Armanino Foods of Distinction, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "ARMANINO FOOD OF DISTINCTION IN",
    "state": "CA",
    "summary": "Armanino Foods of Distinction, Inc. produces and markets frozen and refrigerated food products in the United States. The company's frozen products comprise pesto sauces, stuffed pastas, and pasta sheets, as well as Italian pastas and cooked meat products. It also offers cooked beef and turkey meatballs, and cheese shakers; and cooked and uncooked frozen stuffed pastas include meat, butternut squash, cheese ravioli and jumbo cheese, and jumbo mushroom ravioli; jumbo cheese/spinach green dough ravioli; cheese ravioli; meat filled, tri-color cheese, and cheese tortellini; and tri-color cheese and cheese capelletti, manicotti, and stuffed shells. The company offers its products under the Armanino brand. It markets its products through a network of food brokers and sells to retail and foodservice distributors, club-type stores, and industrial accounts. The company was founded in 1978 and is headquartered in Hayward, California.",
    "website": "http://www.armaninofoods.com",
    "zipcode": "94544"
  },
  "ASRE": {
    "city": "North Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Astra Energy Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "ASTRA ENERGY INC",
    "state": "NV",
    "summary": "Astra Energy Inc. provides scallop farming and marine hatchery services. It involves in farming, processing, and marketing marine species, such as scallops and sablefish in the west coast of North America. The company's product includes Qualicum Beach Scallop', which is a hybrid of the imported Japanese scallop and the local weathervane scallop. It also produces various shellfish seed species, including the Pacific oyster, eastern blue mussel, Mediterranean mussel, and geoduck clam that are sold to third party shellfish farmers. In addition, the company provides consulting, research and development, and custom processing and marketing services, as well as offers aquaculture equipment. The company was founded in 1989 and is based in North Las Vegas, Nevada",
    "website": null,
    "zipcode": "89084"
  },
  "AVOZ": {
    "city": "Washington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Altavoz Entertainment, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "ALTAVOZ ENTERTAINMENT INC",
    "state": "DC",
    "summary": "Altavoz Entertainment, Inc. provides a Distribution as a Service solution that enables artists, bands, and labels to promote their music. It offers services covering a range of physical and digital services, including warehousing, inventory management, marketing/promotion, and global distro, as well as packaging, manufacturing, and distribution deals to music, film, book, video, and other suppliers. The company also offers crypto and data services. The company was founded in 2011 and is headquartered in Washington, District of Columbia.",
    "website": "http://www.altavoz.com",
    "zipcode": "20016"
  },
  "B2YN34.SA": {
    "city": "El Segundo",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "Beyond Meat, Inc.",
    "market": "br_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "BEYOND MEAT DRN",
    "state": "CA",
    "summary": "Beyond Meat, Inc., a food company, manufactures, markets, and sells plant-based meat products in the United States and internationally. It operates under the Beyond Meat, Beyond Burger, Beyond Beef, Beyond Sausage, Beyond Breakfast Sausage, Beyond Chicken, Beyond Fried Chicken, Beyond Meatball, the Caped Steer Logo, Go Beyond, Eat What You Love, The Cookout Classic, The Future of Protein, and The Future of Protein Beyond Meat and design trademarks. The company sells its products through grocery, mass merchandiser, club, convenience store, natural retailer channels, restaurants, foodservice outlets, and schools, as well as through an e-commerce site. The company was formerly known as Savage River, Inc. and changed its name to Beyond Meat, Inc. in September 2018. Beyond Meat, Inc. was founded in 2009 and is headquartered in El Segundo, California.",
    "website": "http://www.beyondmeat.com",
    "zipcode": "90245"
  },
  "BABB": {
    "city": "Deerfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "BAB, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BAB INC",
    "state": "IL",
    "summary": "BAB, Inc. franchises and licenses bagel and muffin retail units under the Big Apple Bagels (BAB), My Favorite Muffin (MFM), and SweetDuet (SD) trade names in the United States. It's BAB franchised brand consists of daily baked bagels, flavored cream cheeses, premium coffees, gourmet bagel sandwiches, and other related products. The company's MFM brand comprise of various freshly baked muffins and coffees; and units operating as My Favorite Muffin Your All Day Bakery Café featuring specialty bagel sandwiches and related products. Its SD brand includes frozen yogurt products. As of November 30, 2020, the company had 72 franchise units and 7 licensed units in operation in 22 states and the United Arab Emirates. BAB, Inc. was incorporated in 2000 and is based in Deerfield, Illinois.",
    "website": "http://www.babcorp.com",
    "zipcode": "60015"
  },
  "BCCI": {
    "city": "Kent",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Baristas Coffee Company, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BARISTAS COFFEE COMPANY INC",
    "state": "WA",
    "summary": "Barista Coffee Company, Inc., doing business as Baristas, operates as a specialty drive-through beverage retailer in the United States. The company offers hot and cold beverages, including specialty coffees, blended teas, and other custom drinks, as well as smoothies, fresh-baked pastries, and other confections. It also provides beverages, such as hot apple cider, hot chocolate, frozen coffees, and other products. In addition, the company promotes and sells Baristas merchandise, calendars, mugs, T-shirts, and hats. As of May 28, 2020, it operated through ten coffee stands in the greater Seattle area. Barista Coffee Company, Inc. also sells its merchandise and other novelties through its baristas.tv Website. The company was formerly known as Innovative Communications, Inc. and changed its name to Barista Coffee Company, Inc. in May 2010. Barista Coffee Company, Inc. was founded in 1996 and is headquartered in Kent, Washington.",
    "website": "http://www.baristas.tv",
    "zipcode": "98032"
  },
  "BDPT": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "BioAdaptives, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BIOADAPTIVES INC",
    "state": "NV",
    "summary": "BioAdaptives, Inc. operates as a research, development, and educational company. The company focuses on offering health and wellness products, such as dietary supplements and specialty food items for humans and animals. It offers PrimiCell, PrimiLungs, and PluriPain or humans; and Canine Regen and Equine Regen for dogs and horses. The company was formerly known as APEX 8 Inc. and changed its name to BioAdaptives, Inc. in September 2013. BioAdaptives, Inc. was incorporated in 2013 and is based in Las Vegas, Nevada.",
    "website": "http://www.shopbioadaptives.com",
    "zipcode": "89128"
  },
  "BEES": {
    "city": "West Palm Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "BEESFREE, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BEESFREE INC",
    "state": "FL",
    "summary": "BeesFree, Inc., a development stage company, focuses on developing solutions for the beekeeping community worldwide. The company offers BeesVita Plus, a patent-pending composite nutritional food supplement for honey bees that enhances general health and wellbeing of honey bee's through boosting its immune and defense system; promotes brood rearing; increases adult bee population; controls Varroa and Nosema infestations; and prevents the occurrence of colony collapse disorder. It also develops Beespenser, a patent-pending automated external honey bee feeding system used to deliver BeesVita Plus. The company intends to sells its products directly to beekeepers in the United States, Europe, Argentina, and Turkey. BeesFree, Inc. is headquartered in West Palm Beach, Florida.",
    "website": "http://www.beesfree.biz",
    "zipcode": "33411"
  },
  "BFNH": {
    "city": "Virginia Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "BioForce Nanosciences Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "BIOFORCE NANOSCIENCES HOLDINGS ",
    "state": "VA",
    "summary": "BioForce Nanosciences Holdings, Inc. focuses on providing natural vitamins, minerals, other nutritional supplements, powders, and beverages for individuals in various age ranges. The company offers private label products with distributors and manufacturing providers. It sells its nutrition supplements to retailers, sporting goods retailers, supermarkets, and mass merchandisers under the BioForce Eclipse brand, as well as through online and telemarketing. BioForce Nanosciences Holdings, Inc. is based in Virginia Beach, Virginia.",
    "website": "http://www.bioforceeclipse.com",
    "zipcode": "23454"
  },
  "BGS": {
    "city": "Parsippany",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "B&G Foods, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "B&G Foods, Inc. B&G Foods, Inc.",
    "state": "NJ",
    "summary": "B&G Foods, Inc. manufactures, sells, and distributes a portfolio of shelf-stable and frozen foods, and household products in the United States, Canada, and Puerto Rico. The company's products include frozen and canned vegetables, oatmeal and other hot cereals, fruit spreads, canned meats and beans, bagel chips, spices, seasonings, hot sauces, wine vinegars, maple syrups, molasses, salad dressings, pizza crusts, Mexican-style sauces, dry soups, taco shells and kits, salsas, pickles, peppers, tomato-based products, baking powder and soda, corn starch, cookies and crackers, nut clusters, and other specialty products. It markets its products under various brands, including Ac'cent, B&G, B&M, Back to Nature, Baker's Joy, Bear Creek Country Kitchens, Brer Rabbit, Canoleo, Cary's, Clabber Girl, Cream of Rice, Cream of Wheat, Crisco, Dash, Davis, Devonsheer, Don Pepino, Durkee, Emeril's, Farmwise, Grandma's Molasses, Green Giant, JJ Flats, Joan of Arc, Las Palmas, Le Sueur, MacDonald's, Mama Mary's, Maple Grove Farms of Vermont, McCann's, Molly McButter, New York Flatbreads, New York Style, Old London, Ortega, Polaner, Red Devil, Regina, Rumford, Sa-són, Sclafani, SnackWell's, Spice Islands, Spring Tree, Sugar Twin, Tone's, Trappey's, TrueNorth, Underwood, Vermont Maid, Victoria, and Weber and Wright's. The company also sells, markets, and distributes household products under the Static Guard brand. It sells and distributes its products directly, as well as through a network of independent brokers and distributors to supermarket chains, food service outlets, mass merchants, warehouse clubs, non-food outlets, and specialty distributors. The company was formerly known as B&G Foods Holdings Corp. and changed its name to B&G Foods, Inc. in October 2004. B&G Foods, Inc. was founded in 1822 and is headquartered in Parsippany, New Jersey.",
    "website": "http://www.bgfoods.com",
    "zipcode": "07054"
  },
  "BLEG": {
    "city": "Orlando",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Branded Legacy Inc",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BRANDED LEGACY INC",
    "state": "FL",
    "summary": "Branded Legacy Inc engages in the commercial development of hemp and cannabinoid-infused beverages. It provides CBD topicals and tinctures, and hemp coffees and teas. The company was formerly known as Elev8 Brands, Inc. and changed its name to Branded Legacy Inc in May 2020. Branded Legacy Inc is based in Orlando, Florida.",
    "website": "http://elev8hemp.com",
    "zipcode": "32801"
  },
  "BLLB": {
    "city": "Lewisburg",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Bell Buckle Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BELL BUCKLE HOLDINGS INC",
    "state": "TN",
    "summary": "Bell Buckle Holdings, Inc. produces all- natural products. It offers pure cane sugar, whole fruits and berries, and fresh produce. The company, through its subsidiaries, provides all-natural fruit jams, including strawberry, peach, raspberry, blackberry, blueberry, and cherry jams; instant drink mixes, such as spiced tea and cocoa mocha; fruit pecan pepper jellies, salad dressings, dessert toppings, wine jellies, vanillas, glazes and sauces, hot sauces, specialties, and salsas; traditional pickles; and cappuccino. It offers its products online. Bell Buckle Holdings, Inc. was formerly known as Digital Color Print Inc. and changed its name to Bell Buckle Holdings, Inc. in June 2007. Bell Buckle Holdings, Inc. was founded in 1995 and is headquartered in Lewisburg, Tennessee.",
    "website": "http://bellbucklecompanystore.com",
    "zipcode": "37091"
  },
  "BRBR": {
    "city": "Saint Louis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "BellRing Brands, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "BellRing Brands, Inc.",
    "state": "MO",
    "summary": "BellRing Brands, Inc. manufactures and sells nutrition products in the United States and internationally. It offers ready-to-drink (RTD) protein shakes, other RTD beverages, powders, and nutrition bars and supplements. The company provides its products primarily under the Premier Protein, Premier Nutrition, Dymatize, PowerBar, Bell Ring, Joint Juice, and Supreme Protein brands. It sells its products through a network of channels, including club, food, drug, mass, convenience, specialty, and eCommerce; and through a broker network for customers in the convenience, grocery, and mass channels, and through distributors for the specialty channel. The company was founded in 2019 and is headquartered in Saint Louis, Missouri. BellRing Brands, Inc. is a subsidiary of Post Holdings, Inc.",
    "website": "http://www.bellring.com",
    "zipcode": "63144-2503"
  },
  "BRID": {
    "city": "Anaheim",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Packaged Foods",
    "long_name": "Bridgford Foods Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Bridgford Foods Corporation",
    "state": "CA",
    "summary": "Bridgford Foods Corporation, together with its subsidiaries, manufactures, markets, and distributes frozen, refrigerated, and snack food products in the United States. It operates in two segments, Frozen Food Products and Snack Food Products. The company primarily offers biscuits, bread dough items, roll dough items, and dry sausage and beef jerky products. It provides approximately 140 frozen food products to food service and retail customers through wholesalers, cooperatives, and distributors; and 130 snack food items to supermarkets, and mass merchandise and convenience retail stores through customer owned distribution centers, as well as a direct store delivery network. The company was founded in 1932 and is headquartered in Anaheim, California. Bridgford Foods Corporation is a subsidiary of Bridgford Industries Incorporated.",
    "website": "http://www.bridgford.com",
    "zipcode": "92801"
  },
  "BRZL": {
    "city": "Las Vegas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Scepter Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "SCEPTER HLDGS INC",
    "state": "NV",
    "summary": "Scepter Holdings, Inc., through its subsidiaries, produces and sells fuel additives. The company was formerly known as Brazos International Exploration, Inc. and changed its name to Scepter Holdings, Inc. Scepter Holdings, Inc. was founded in 2007 and is based in Las Vegas, Nevada.",
    "website": "http://scepterbrands.com",
    "zipcode": "89118"
  },
  "BSFC": {
    "city": "Miami",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Blue Star Foods Corp.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "BLUE STAR FOODS CORP",
    "state": "FL",
    "summary": "Blue Star Foods Corp., an international seafood company, processes, imports, packages, and sells refrigerated seafood products. It offers pasteurized crab meat, and other seafood products, under the Blue Star, Pacifika, Oceanica, Crab & Go Premium Seafood, Lubkin, First Choice, Good Stuff, and Coastal Pride Fresh brands. The company sells its products to food service distributors, wholesalers, retail establishments, and seafood distributors in the United States, Canada, and Europe. Blue Star Foods Corp. was formerly known as John Keeler & Co. Inc. Blue Star Foods Corp. was founded in 1995 and is headquartered in Miami, Florida.",
    "website": "http://www.bluestarfoods.com",
    "zipcode": "33172"
  },
  "BTTR": {
    "city": "Oldsmar",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Better Choice Company Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "BETTER CHOICE COMPANY INC",
    "state": "FL",
    "summary": "Better Choice Company Inc. operates as an animal health and wellness company. It offers raw-diet dog food and treats, naturally formulated premium kibble and canned dog and cat food, freeze-dried raw dog food and treats, vegan dog food and treats, oral care products, supplements, and grooming aids. The company provides its products for dogs, cats, and pet parents under the Halo, TruDog, and Rawgo! brand names. Better Choice Company Inc. primarily sells its products through its online portal, as well as through online retailers and pet specialty stores. It has operations in the United States, Canada, Australia, and Asia. The company was founded in 1986 and is headquartered in Oldsmar, Florida.",
    "website": "http://www.betterchoicecompany.com",
    "zipcode": "34677"
  },
  "BYND": {
    "city": "El Segundo",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Beyond Meat, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Beyond Meat, Inc.",
    "state": "CA",
    "summary": "Beyond Meat, Inc., a food company, manufactures, markets, and sells plant-based meat products in the United States and internationally. It operates under the Beyond Meat, Beyond Burger, Beyond Beef, Beyond Sausage, Beyond Breakfast Sausage, Beyond Chicken, Beyond Fried Chicken, Beyond Meatball, the Caped Steer Logo, Go Beyond, Eat What You Love, The Cookout Classic, The Future of Protein, and The Future of Protein Beyond Meat and design trademarks. The company sells its products through grocery, mass merchandiser, club, convenience store, natural retailer channels, restaurants, foodservice outlets, and schools, as well as through an e-commerce site. The company was formerly known as Savage River, Inc. and changed its name to Beyond Meat, Inc. in September 2018. Beyond Meat, Inc. was founded in 2009 and is headquartered in El Segundo, California.",
    "website": "http://www.beyondmeat.com",
    "zipcode": "90245"
  },
  "BYND.MX": {
    "city": "El Segundo",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaged Foods",
    "long_name": "Beyond Meat, Inc.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "BEYOND MEAT INC",
    "state": "CA",
    "summary": "Beyond Meat, Inc., a food company, manufactures, markets, and sells plant-based meat products in the United States and internationally. It operates under the Beyond Meat, Beyond Burger, Beyond Beef, Beyond Sausage, Beyond Breakfast Sausage, Beyond Chicken, Beyond Fried Chicken, Beyond Meatball, the Caped Steer Logo, Go Beyond, Eat What You Love, The Cookout Classic, The Future of Protein, and The Future of Protein Beyond Meat and design trademarks. The company sells its products through grocery, mass merchandiser, club, convenience store, natural retailer channels, restaurants, foodservice outlets, and schools, as well as through an e-commerce site. The company was formerly known as Savage River, Inc. and changed its name to Beyond Meat, Inc. in September 2018. Beyond Meat, Inc. was founded in 2009 and is headquartered in El Segundo, California.",
    "website": "http://www.beyondmeat.com",
    "zipcode": "90245"
  },
  "BYND.VI": {
    "city": "El Segundo",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Packaged Foods",
    "long_name": "Beyond Meat, Inc.",
    "market": "at_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "BEYOND MEAT INC",
    "state": "CA",
    "summary": "Beyond Meat, Inc., a food company, manufactures, markets, and sells plant-based meat products in the United States and internationally. It operates under the Beyond Meat, Beyond Burger, Beyond Beef, Beyond Sausage, Beyond Breakfast Sausage, Beyond Chicken, Beyond Fried Chicken, Beyond Meatball, the Caped Steer Logo, Go Beyond, Eat What You Love, The Cookout Classic, The Future of Protein, and The Future of Protein Beyond Meat and design trademarks. The company sells its products through grocery, mass merchandiser, club, convenience store, natural retailer channels, restaurants, foodservice outlets, and schools, as well as through an e-commerce site. The company was formerly known as Savage River, Inc. and changed its name to Beyond Meat, Inc. in September 2018. Beyond Meat, Inc. was founded in 2009 and is headquartered in El Segundo, California.",
    "website": "http://www.beyondmeat.com",
    "zipcode": "90245"
  },
  "C1AG34.SA": {
    "city": "Chicago",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "Conagra Brands, Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "CONAGRA BRANDRN",
    "state": "IL",
    "summary": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company in North America. The company operates through Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice segments. The Grocery & Snacks segment primarily offers shelf stable food products in various retail channels in the United States. The Refrigerated & Frozen segment provides temperature controlled food products in various retail channels in the United States. The International segment offers food products in various temperature states in retail and foodservice channels outside of the United States. The Foodservice segment offers food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for sale to restaurants and other foodservice establishments in the United States. The company sells its products under the Birds Eye, Marie Callender's, Banquet, Healthy Choice, Slim Jim, Reddi-wip, Vlasic, Angie's BOOMCHICKAPOP, Duke's, Earth Balance, Gardein, Frontera, Chef Boyardee, and Alexia brands. The company was formerly known as ConAgra Foods, Inc. and changed its name to Conagra Brands, Inc. in November 2016. Conagra Brands, Inc. was founded in 1919 and is headquartered in Chicago, Illinois.",
    "website": "http://www.conagrabrands.com",
    "zipcode": "60654"
  },
  "C1PB34.SA": {
    "city": "Camden",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "Campbell Soup Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "CAMPBELL SOUDRN",
    "state": "NJ",
    "summary": "Campbell Soup Company, together with its subsidiaries, engages in the manufacture and market food and beverage products. It operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; Plum baby food and snacks; V8 juices and beverages; V8 juices and beverages; and Campbell's tomato juice. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products in the United States; Milano cookies and Goldfish crackers; and Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory Pretzel Crisps, Pop Secret popcorn, Emerald nuts, and other snacking products in the United States and Canada. This segment is also involved in the retail business in Latin America. The company sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments; and independent contractor distributors. Campbell Soup Company was founded in 1869 and is headquartered in Camden, New Jersey.",
    "website": "http://www.campbellsoupcompany.com",
    "zipcode": "08103-1799"
  },
  "CAG": {
    "city": "Chicago",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Conagra Brands, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "ConAgra Brands, Inc.",
    "state": "IL",
    "summary": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company in North America. The company operates through Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice segments. The Grocery & Snacks segment primarily offers shelf stable food products in various retail channels in the United States. The Refrigerated & Frozen segment provides temperature controlled food products in various retail channels in the United States. The International segment offers food products in various temperature states in retail and foodservice channels outside of the United States. The Foodservice segment offers food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for sale to restaurants and other foodservice establishments in the United States. The company sells its products under the Birds Eye, Marie Callender's, Banquet, Healthy Choice, Slim Jim, Reddi-wip, Vlasic, Angie's BOOMCHICKAPOP, Duke's, Earth Balance, Gardein, Frontera, Chef Boyardee, and Alexia brands. The company was formerly known as ConAgra Foods, Inc. and changed its name to Conagra Brands, Inc. in November 2016. Conagra Brands, Inc. was founded in 1919 and is headquartered in Chicago, Illinois.",
    "website": "http://www.conagrabrands.com",
    "zipcode": "60654"
  },
  "CAO.F": {
    "city": "Chicago",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Conagra Brands, Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "CONAGRA BRANDS INC.  DL 5",
    "state": "IL",
    "summary": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company in North America. The company operates through Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice segments. The Grocery & Snacks segment primarily offers shelf stable food products in various retail channels in the United States. The Refrigerated & Frozen segment provides temperature controlled food products in various retail channels in the United States. The International segment offers food products in various temperature states in retail and foodservice channels outside of the United States. The Foodservice segment offers food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for sale to restaurants and other foodservice establishments in the United States. The company sells its products under the Birds Eye, Marie Callender's, Banquet, Healthy Choice, Slim Jim, Reddi-wip, Vlasic, Angie's BOOMCHICKAPOP, Duke's, Earth Balance, Gardein, Frontera, Chef Boyardee, and Alexia brands. The company was formerly known as ConAgra Foods, Inc. and changed its name to Conagra Brands, Inc. in November 2016. Conagra Brands, Inc. was founded in 1919 and is headquartered in Chicago, Illinois.",
    "website": "http://www.conagrabrands.com",
    "zipcode": "60654"
  },
  "CENT": {
    "city": "Walnut Creek",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Central Garden & Pet Company",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Central Garden & Pet Company",
    "state": "CA",
    "summary": "Central Garden & Pet Company produces and distributes various products for the lawn and garden, and pet supplies markets in the United States. It provides pet supplies products, including edible chews and treats, dog chew toys, dog play toys, natural dog treats and chews, pet dental chews and solutions, dog training pads, pet containment, grooming supplies, and other accessories; products for birds, small animals, and specialty pets comprising food, cages and habitats, toys, chews, and related accessories; animal and household health and insect control products; live fish and products for fish, reptiles, and other aquarium-based pets, such as aquariums, furniture and lighting fixtures, pumps, filters, water conditioners, food, and supplements; and products for horses and livestock, as well as outdoor cushions and pillows. The company sells its pet supplies products under the Aqueon, Cadet, Comfort Zone, Farnam, Four Paws, Kaytee, K&H Pet Products, Nylabone, and Zilla brands, as well as under Adams, Altosid, Arden Companies, Coralife, C&S Products, Interpet, Pet Select, TFH, and Zodiac other brands. It also offers lawn and garden supplies products that include grass seed; wild bird feed, bird feeders, bird houses, and other birding accessories; fertilizers; decorative outdoor lifestyle products; live plants; and weed and grass, as well as other herbicides, insecticide, and pesticide products. The company sells its lawn and garden supplies products under the AMDRO, Ironite, Pennington, and Sevin brands, as well as under Bell Nursery, Lilly Miller, and Over-N-Out other brand names. Central Garden & Pet Company was founded in 1955 and is based in Walnut Creek, California.",
    "website": "http://www.central.com",
    "zipcode": "94597"
  },
  "CENTA": {
    "city": "Walnut Creek",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Central Garden & Pet Company",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Central Garden & Pet Company",
    "state": "CA",
    "summary": "Central Garden & Pet Company produces and distributes various products for the lawn and garden, and pet supplies markets in the United States. It provides pet supplies products, including edible chews and treats, dog chew toys, dog play toys, natural dog treats and chews, pet dental chews and solutions, dog training pads, pet containment, grooming supplies, and other accessories; products for birds, small animals, and specialty pets comprising food, cages and habitats, toys, chews, and related accessories; animal and household health and insect control products; live fish and products for fish, reptiles, and other aquarium-based pets, such as aquariums, furniture and lighting fixtures, pumps, filters, water conditioners, food, and supplements; and products for horses and livestock, as well as outdoor cushions and pillows. The company sells its pet supplies products under the Aqueon, Cadet, Comfort Zone, Farnam, Four Paws, Kaytee, K&H Pet Products, Nylabone, and Zilla brands, as well as under Adams, Altosid, Arden Companies, Coralife, C&S Products, Interpet, Pet Select, TFH, and Zodiac other brands. It also offers lawn and garden supplies products that include grass seed; wild bird feed, bird feeders, bird houses, and other birding accessories; fertilizers; decorative outdoor lifestyle products; live plants; and weed and grass, as well as other herbicides, insecticide, and pesticide products. The company sells its lawn and garden supplies products under the AMDRO, Ironite, Pennington, and Sevin brands, as well as under Bell Nursery, Lilly Miller, and Over-N-Out other brand names. Central Garden & Pet Company was founded in 1955 and is based in Walnut Creek, California.",
    "website": "http://www.central.com",
    "zipcode": "94597"
  },
  "CHLE": {
    "city": "Centennial",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Centennial Specialty Foods Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "CENTENNIAL SPECIALTY FOODS CORP",
    "state": "CO",
    "summary": "Centennial Specialty Foods Corp. markets, sells, and distributes branded ethnic Southwestern sauces and food products in Colorado. It offers green chile sauces, and chili con carne or chili products. The company's sauces and chili products come in varieties with pork, chicken, beef, and no meat. Its Ellis products include refried beans, tamale products, chili products, bean products, and Ellis burrito sauce. The company sells its products through grocery stores, superstores, and club stores primarily in Colorado, Arizona, and California. Centennial Specialty Foods Corp. was founded in 2003 and is headquartered in Centennial, Colorado.",
    "website": null,
    "zipcode": "80112"
  },
  "CLXT": {
    "city": "Roseville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Calyxt, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Calyxt, Inc.",
    "state": "MN",
    "summary": "Calyxt, Inc., a technology company, focuses on delivering plant-based solutions in the United States. It engages in the development of improved digestibility alfalfa; high fiber wheat; high oleic low linolenic soybeans; winter oats; hemp; fat soybeans; and cold storable potatoes. As of March 4, 2021, the company had nine projects at Phase I stage or later in development across alfalfa, hemp, oats, soybeans, and wheat. Calyxt, Inc. has a research collaboration with NRGene, which includes the adoption of NRGene's cloud-based genomics platform to support various research projects; and a commercialization agreement with S&W Seed Company for the exclusive license of an improved quality alfalfa seed in the United States and various geographies outside the United States. The company was formerly known as Cellectis Plant Sciences, Inc. and changed its name to Calyxt, Inc. in May 2015. Calyxt, Inc. was incorporated in 2010 and is headquartered in Roseville, Minnesota. Calyxt, Inc. is a subsidiary of Cellectis S.A.",
    "website": "http://www.calyxt.com",
    "zipcode": "55113-1127"
  },
  "CNP.F": {
    "city": "Westchester",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Ingredion Incorporated",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "INGREDION INC.  DL-,01",
    "state": "IL",
    "summary": "Ingredion Incorporated, together with its subsidiaries, produces and sells starches and sweeteners for various industries. It operates through four segments: North America; South America; Asia Pacific; and Europe, Middle East, and Africa. The company offers sweetener products comprising glucose syrups, high maltose syrups, high fructose corn syrups, caramel colors, dextrose, polyols, maltodextrins, and glucose syrup solids, as well as food-grade and industrial starches, biomaterials, and nutrition ingredients. It also provides edible corn oil; refined corn oil to packers of cooking oil and to producers of margarine, salad dressings, shortening, mayonnaise, and other foods; and corn gluten feed used as protein feed for chickens, pet food, and aquaculture, as well as fruit and vegetable products, such as concentrates, purees and essences, pulse proteins, and hydrocolloids systems and blends. The company's products are derived primarily from processing corn and other starch-based materials, such as tapioca, potato, and rice. It serves food, beverage, paper and corrugating products, brewing, pharmaceutical, textile, and personal care industries, as well as animal feed markets. The company was formerly known as Corn Products International, Inc. and changed its name to Ingredion Incorporated in June 2012. Ingredion Incorporated was founded in 1906 and is headquartered in Westchester, Illinois.",
    "website": "http://www.ingredion.com",
    "zipcode": "60154"
  },
  "CPB": {
    "city": "Camden",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Campbell Soup Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "Campbell Soup Company",
    "state": "NJ",
    "summary": "Campbell Soup Company, together with its subsidiaries, engages in the manufacture and market food and beverage products. It operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; Plum baby food and snacks; V8 juices and beverages; V8 juices and beverages; and Campbell's tomato juice. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products in the United States; Milano cookies and Goldfish crackers; and Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory Pretzel Crisps, Pop Secret popcorn, Emerald nuts, and other snacking products in the United States and Canada. This segment is also involved in the retail business in Latin America. The company sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments; and independent contractor distributors. Campbell Soup Company was founded in 1869 and is headquartered in Camden, New Jersey.",
    "website": "http://www.campbellsoupcompany.com",
    "zipcode": "08103-1799"
  },
  "CPB.MX": {
    "city": "Camden",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaged Foods",
    "long_name": "Campbell Soup Company",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "CAMPBELL SOUP CO",
    "state": "NJ",
    "summary": "Campbell Soup Company, together with its subsidiaries, engages in the manufacture and market food and beverage products. It operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; Plum baby food and snacks; V8 juices and beverages; V8 juices and beverages; and Campbell's tomato juice. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products in the United States; Milano cookies and Goldfish crackers; and Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory Pretzel Crisps, Pop Secret popcorn, Emerald nuts, and other snacking products in the United States and Canada. This segment is also involved in the retail business in Latin America. The company sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments; and independent contractor distributors. Campbell Soup Company was founded in 1869 and is headquartered in Camden, New Jersey.",
    "website": "http://www.campbellsoupcompany.com",
    "zipcode": "08103-1799"
  },
  "CRMBQ": {
    "city": "New York",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Crumbs Bake Shop, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "CRUMBS BAKE SHOP INC",
    "state": "NY",
    "summary": "Crumbs Bake Shop, Inc. sells various cupcakes, cakes, cookies, and other baked goods. The company provides its products through its online portal. Crumbs Bake Shop, Inc. was formerly known as Crumbs Holdings LLC and changed its name to Crumbs Bake Shop, Inc. in October 2011. The company was founded in 2003 and is headquartered in New York, New York.",
    "website": null,
    "zipcode": "10018"
  },
  "CSC.F": {
    "city": "Camden",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Campbell Soup Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "CAMPBELL SOUP CO.DL-,0375",
    "state": "NJ",
    "summary": "Campbell Soup Company, together with its subsidiaries, engages in the manufacture and market food and beverage products. It operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; Plum baby food and snacks; V8 juices and beverages; V8 juices and beverages; and Campbell's tomato juice. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products in the United States; Milano cookies and Goldfish crackers; and Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory Pretzel Crisps, Pop Secret popcorn, Emerald nuts, and other snacking products in the United States and Canada. This segment is also involved in the retail business in Latin America. The company sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments; and independent contractor distributors. Campbell Soup Company was founded in 1869 and is headquartered in Camden, New Jersey.",
    "website": "http://www.campbellsoupcompany.com",
    "zipcode": "08103-1799"
  },
  "CUSI": {
    "city": "Sterling",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Cuisine Solutions, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "CUISINE SOLUTIONS INC",
    "state": "VA",
    "summary": "Cuisine Solutions, Inc. produces and markets various food products in the United States. Its products include beef, lamb, pork and veal, pastas and sous-vide sides, chicken and moist turkey, prepared sauces, and seafood products, as well as prepared vegetarian meals. The company offers its products to foodservice, on board services, retail, military, and national restaurant chain industries. Cuisine Solutions, Inc. was founded in 1972 and is based in Sterling, Virginia.",
    "website": "http://www.cuisinesolutions.com",
    "zipcode": "20166"
  },
  "CVGW": {
    "city": "Santa Paula",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Calavo Growers, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Calavo Growers, Inc.",
    "state": "CA",
    "summary": "Calavo Growers, Inc. markets and distributes avocados, prepared avocados, and other perishable foods to retail grocery and foodservice customers, club stores, mass merchandisers, food distributors, and wholesale customers worldwide. It operates in three segments: Fresh Products, Calavo Foods, and Renaissance Food Group (RFG). The Fresh products segment distributes avocados and other fresh produce products; and procures avocados grown in California, Mexico, and Peru, as well as various other commodities, including tomatoes and papayas. The Calavo Foods segment is involved in purchasing, manufacturing, and distributing prepared avocado products, including guacamole and salsa. The RFG segment manufactures and distributes fresh-cut fruits and vegetables, fresh prepared entrée salads, wraps, sandwiches, and fresh snacking products, as well as ready-to-heat entrees, other hot bar and various deli items, meals kits and related components, and salad kits. The company offers its products under the Calavo and RFG brands, and related logos; and Avo Fresco, Bueno, Calavo Gold, Calavo Salsa Lisa, Salsa Lisa, Celebrate the Taste, El Dorado, Fresh Ripe, Select, Taste of Paradise, The First Name in Avocados, Tico, Mfresh, Maui Fresh International, Triggered Avocados, ProRipeVIP, RIPE NOW!, Garden Highway Fresh Cut, Garden Highway, and Garden Highway Chef Essentials trademarks. Calavo Growers, Inc. was founded in 1924 and is headquartered in Santa Paula, California.",
    "website": "http://www.calavo.com",
    "zipcode": "93060"
  },
  "CYAN": {
    "city": "Kailua-Kona",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Cyanotech Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Cyanotech Corporation",
    "state": "HI",
    "summary": "Cyanotech Corporation engages in the cultivation, production, and sale of natural products derived from microalgae for the health and human nutrition markets worldwide. The company's products include BioAstin Hawaiian Astaxanthin, a dietary antioxidant, which is used as a human nutraceutical and functional food ingredient to support and maintain the body's natural inflammatory response, enhance skin, and support eye and joint health; and Hawaiian Spirulina Pacifica, a nutrient-rich dietary supplement that is used for extra energy, a strengthened immune system, cardiovascular benefits, and as a source of antioxidant carotenoids. Cyanotech Corporation sells its products as packaged consumer products through distributors, retailers, and online channels, and direct to consumers, as well as in bulk form to manufacturers, formulators, and distributors. The company was founded in 1983 and is headquartered in Kailua-Kona, Hawaii.",
    "website": "http://www.cyanotech.com",
    "zipcode": "96740"
  },
  "DAR": {
    "city": "Irving",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Darling Ingredients Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "Darling Ingredients Inc.",
    "state": "TX",
    "summary": "Darling Ingredients Inc. develops, produces, and sells natural ingredients from edible and inedible bio-nutrients. The company operates through three segments: Feed Ingredients, Food Ingredients, and Fuel Ingredients. It offers ingredients and customized specialty solutions for customers in the pharmaceutical, food, pet food, feed, industrial, fuel, bioenergy, and fertilizer industries. The company collects and transforms various animal by-product streams into useable and specialty ingredients, such as collagen, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstock, green energy, natural casings, and hides. It also recovers and converts used cooking oil and animal fats, and residual bakery products into valuable feed and fuel ingredients. In addition, the company provides environmental services, including grease trap collection and disposal services to food service establishments. It primarily operates under the Sonac, Dar Pro, Rothsay, Rousselot, CTH, Ecoson, and Rendac brand names in North America, Europe, China, South America, Australia, and internationally. The company was formerly known as Darling International Inc. and changed its name to Darling Ingredients Inc. in May 2014. Darling Ingredients Inc. was founded in 1882 and is headquartered in Irving, Texas.",
    "website": "http://www.darlingii.com",
    "zipcode": "75038"
  },
  "DEWM": {
    "city": "Clinton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Dewmar International BMC, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "DEWMAR INTL BMC INC",
    "state": "MS",
    "summary": "Dewmar International BMC, Inc. operates as a brand management services company in the United States and internationally. The company specializes in developing or acquiring new products, brands, or companies for launch or distribution in various markets. It manages multiple brands and services, including consumer good categories, and health and wellness industry verticals, as well as offers outsourced sales and marketing services. The company also provides yella, purp, and easta pink flavored relaxation beverage products under the brand name of Lean Slow Motion Potion. Dewmar International BMC, Inc. is headquartered in Clinton, Mississippi.",
    "website": "http://www.dewmarinternational.com",
    "zipcode": "39056"
  },
  "DFODQ": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Dean Foods Company",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "DEAN FOODS CO",
    "state": "TX",
    "summary": "Dean Foods Company, a food and beverage company, processes and distributes milk, and other dairy and dairy case products in the United States. The company manufactures, markets, and distributes various branded and private label dairy and dairy case products, such as fluid milk, ice creams, cultured dairy products, creamers, ice cream mixes, and other dairy products; and juices, teas, and bottled water. It sells its products under approximately 50 national, regional, and local proprietary or licensed brands, as well as private labels, including DairyPure, TruMoo, Alta Dena, Berkeley Farms, Country Fresh, Dean's, Friendly's, Garelick Farms, LAND O LAKES, Lehigh Valley Dairy Farms, Mayfield, McArthur, Meadow Gold, Oak Farms, PET, T.G. Lee, Tuscan, and others. The company sells its products to retailers, distributors, foodservice outlets, educational institutions, and governmental entities through its local and regional sales forces. Dean Foods Company was founded in 1925 and is headquartered in Dallas, Texas. On November 12, 2019, Dean Foods Company filed a voluntary petition for reorganization under Chapter 11 in the U.S. Bankruptcy Court for the Southern District of Texas. It is in joint administration with Southern Foods Group, LLC.",
    "website": "http://www.deanfoods.com",
    "zipcode": "75204"
  },
  "DHR.F": {
    "city": "Parsippany",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "B&G Foods, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "B + G FOODS INC. (NEW)",
    "state": "NJ",
    "summary": "B&G Foods, Inc. manufactures, sells, and distributes a portfolio of shelf-stable and frozen foods, and household products in the United States, Canada, and Puerto Rico. The company's products include frozen and canned vegetables, oatmeal and other hot cereals, fruit spreads, canned meats and beans, bagel chips, spices, seasonings, hot sauces, wine vinegars, maple syrups, molasses, salad dressings, pizza crusts, Mexican-style sauces, dry soups, taco shells and kits, salsas, pickles, peppers, tomato-based products, baking powder and soda, corn starch, cookies and crackers, nut clusters, and other specialty products. It markets its products under various brands, including Ac'cent, B&G, B&M, Back to Nature, Baker's Joy, Bear Creek Country Kitchens, Brer Rabbit, Canoleo, Cary's, Clabber Girl, Cream of Rice, Cream of Wheat, Crisco, Dash, Davis, Devonsheer, Don Pepino, Durkee, Emeril's, Farmwise, Grandma's Molasses, Green Giant, JJ Flats, Joan of Arc, Las Palmas, Le Sueur, MacDonald's, Mama Mary's, Maple Grove Farms of Vermont, McCann's, Molly McButter, New York Flatbreads, New York Style, Old London, Ortega, Polaner, Red Devil, Regina, Rumford, Sa-són, Sclafani, SnackWell's, Spice Islands, Spring Tree, Sugar Twin, Tone's, Trappey's, TrueNorth, Underwood, Vermont Maid, Victoria, and Weber and Wright's. The company also sells, markets, and distributes household products under the Static Guard brand. It sells and distributes its products directly, as well as through a network of independent brokers and distributors to supermarket chains, food service outlets, mass merchants, warehouse clubs, non-food outlets, and specialty distributors. The company was formerly known as B&G Foods Holdings Corp. and changed its name to B&G Foods, Inc. in October 2004. B&G Foods, Inc. was founded in 1822 and is headquartered in Parsippany, New Jersey.",
    "website": "http://www.bgfoods.com",
    "zipcode": "07054"
  },
  "DMAN": {
    "city": "Santa Monica",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Demand Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "DEMAND BRANDS INC",
    "state": "CA",
    "summary": "Demand Brands, Inc. focuses on developing electroseismic applications and drone programs technologies for the energy industry. The company is based in Santa Monica, California.",
    "website": "http://www.pacifictechnologiesgroup.com",
    "zipcode": "90403"
  },
  "DWIS": {
    "city": "Farmingdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Dinewise, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "DINEWISE INC",
    "state": "NY",
    "summary": "DineWise, Inc. provides direct-to-consumer gourmet home meal replacement services in the United States. The company offers an array of meal planning, delivery, and preparation services under the Dinewise brand name. Its principal products include branded, prepared, and frozen entrees, such as beef, chicken, pork, and fish; and meals, soups, appetizers, and desserts. Dinewise, Inc. markets its products through various channels, including direct mail, catalog, print, public relations, and e-retailing, as well as through its inbound and outbound call center. The company was founded in 1959 and is headquartered in Farmingdale, New York.",
    "website": null,
    "zipcode": "11735-3940"
  },
  "E6U.F": {
    "city": "Staten Island",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Coffee Holding Co., Inc.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "COFFEE HLDG CO.INC.DL-001",
    "state": "NY",
    "summary": "Coffee Holding Co., Inc. manufactures, roasts, packages, markets, and distributes roasted and blended coffees in the United States, Australia, Canada, England, and China. The company offers wholesale green coffee products, which include unroasted raw beans of approximately 90 varieties that are sold to large, medium, and small roasters, as well as coffee shop operators. It also roasts, blends, packages, and sells coffee under private labels. As of October 31, 2020, the company supplied private label coffee under approximately 21 labels to wholesalers and retailers in cans, brick packages, and instants of various sizes. In addition, it roasts, blends, and packages company label branded coffee to supermarkets, wholesalers, and individually owned and multi-unit retail customers. Further, the company offers tabletop coffee roasting equipment, instant coffees, and tea products for its customers. Its coffee brands include Cafe Caribe, Don Manuel, S&W, Cafe Supremo, Via Roma, Premier Roasters, Harmony Bay, and Steep and Brew. The company was formerly known as Transpacific International Group Corp and changed its name to Coffee Holding Co., Inc. in April 1998. Coffee Holding Co., Inc. was founded in 1971 and is headquartered in Staten Island, New York.",
    "website": "http://coffeeholding.com",
    "zipcode": "10314"
  },
  "ELAMF": {
    "city": "El Paso",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Elamex SA de CV",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "ELAMEX S.A.DE CV",
    "state": "TX",
    "summary": "Elamex SA de CV engages in candy manufacturing, and nut processing and packaging in the United States and Mexico. It produces sugar candies, such as starlight mints, orange slices, spice drops, jelly beans, and gummies. The company also processes packaged nuts, including pecans, walnuts, and almonds; and bulk foodservice items, such as sunflower seeds and trail mixes. In addition, it offers contract manufacturing services for food products; and warehousing and logistics services. Further, the company engages in real estate holdings in Mexico. It sells sugar candies through grocery, drug, mass merchant, food service, and convenience channels; and markets and distributes packaged nuts to foodservice and retail markets. The company serves restaurants, healthcare facilities, hotels, schools, and colleges. Elamex SA de CV was founded in 1973 and is headquartered in El Paso, Texas. It has operations in Mexico and the United States. The company has a distribution center in El Paso, Texas.",
    "website": "http://www.elamex.com",
    "zipcode": "79912"
  },
  "EWLU": {
    "city": "West Covina",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Merion, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "MERION INC",
    "state": "CA",
    "summary": "Merion, Inc. provides health and nutritional supplements, and personal care products in the People's Republic of China and the United States. The company offers Noir Naturel, a gentle formula for grey coverage from the first application into hair; natural aphrodisiac supplements comprises Viwooba (1-3) for men; Lady-S, a female dietary supplement that assists on weight loss; Gold King, a nutritional supplement that provides antioxidant support and liver health; New Power, a nutritional supplement, which supports heart health; Taibao, a nutritional supplement that enhances physical performance and energy metabolism; and ReMage Power, a nutritional supplement that provides anti-aging Nicotinamide adenine dinucleotide support, as well as promotes energy and cell metabolis. It sells its products through dailynu.com and merionus.com websites, as well as to wholesale distributors through phone and electronic communication. The company was formerly known as E-World USA Holding, Inc. and changed its name to Merion, Inc. in June 2017. Merion, Inc. was founded in 2007 and is headquartered in West Covina, California.",
    "website": "http://www.merionus.com",
    "zipcode": "91791"
  },
  "F7M.F": {
    "city": "Paramount",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Tattooed Chef, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "TATTOOED CHEF INC CL.A",
    "state": "CA",
    "summary": "Tattooed Chef, Inc., a plant-based food company, produces and sells a portfolio of frozen foods. It supplies plant-based products to retailers in the United States. The company offers ready-to-cook bowls, zucchini spirals, riced cauliflower, acai and smoothie bowls, cauliflower crust pizza, and plant-based burgers. Its products are available in private label and Tattooed Chef brand name in the frozen food section of retail food stores. As of December 31, 2020, it operated 4,300 retail outlets, as well as offers its products through the e-commerce channel. Tattooed Chef, Inc. is headquartered in Paramount, California.",
    "website": "http://www.tattooedchef.com",
    "zipcode": "90723-3750"
  },
  "FARM": {
    "city": "Northlake",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Farmer Bros. Co.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Farmer Brothers Company",
    "state": "TX",
    "summary": "Farmer Bros. Co. engages in the manufacture, wholesale, and distribution of coffee, tea, and culinary products in the United States. The company offers roast and ground coffee; frozen liquid coffee; flavoured and unflavoured iced and hot teas; culinary products, including gelatins and puddings, soup bases, dressings, gravy and sauce mixes, pancake and biscuit mixes, jellies and preserves, and coffee-related products, such as coffee filters, sugar, and creamers; spices; and other beverages comprising cappuccino, cocoa, granitas, and concentrated and ready-to-drink cold brew and iced coffee. It sells its products under the Farmer Brothers, Artisan Collection by Farmer Brothers, Superior, Metropolitan, China Mist, Boyds, Direct Trade, Project D.I.R.E.C.T., Fair Trade Certified, Public Domain, Rainforest Alliance Certified, Un Momento, Collaborative Coffee, Cain's, and McGarvey brands, as well as under various private labels. The company serves small independent restaurants, foodservice operators, restaurants, department and convenience store chains, hotels, casinos, healthcare facilities, gourmet coffee houses, grocery chains, and foodservice distributors. It distributes its products through direct-store-delivery network, and common carriers or third-party distributors, as well as Website. Farmer Bros. Co. has strategic partnership with High Brew Coffee. Farmer Bros. Co. was founded in 1912 and is headquartered in Northlake, Texas.",
    "website": "http://www.farmerbros.com",
    "zipcode": "76262"
  },
  "FB1.F": {
    "city": "Northlake",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Farmer Bros. Co.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "FARMER BROS CO.  DL 1",
    "state": "TX",
    "summary": "Farmer Bros. Co. engages in the manufacture, wholesale, and distribution of coffee, tea, and culinary products in the United States. The company offers roast and ground coffee; frozen liquid coffee; flavoured and unflavoured iced and hot teas; culinary products, including gelatins and puddings, soup bases, dressings, gravy and sauce mixes, pancake and biscuit mixes, jellies and preserves, and coffee-related products, such as coffee filters, sugar, and creamers; spices; and other beverages comprising cappuccino, cocoa, granitas, and concentrated and ready-to-drink cold brew and iced coffee. It sells its products under the Farmer Brothers, Artisan Collection by Farmer Brothers, Superior, Metropolitan, China Mist, Boyds, Direct Trade, Project D.I.R.E.C.T., Fair Trade Certified, Public Domain, Rainforest Alliance Certified, Un Momento, Collaborative Coffee, Cain's, and McGarvey brands, as well as under various private labels. The company serves small independent restaurants, foodservice operators, restaurants, department and convenience store chains, hotels, casinos, healthcare facilities, gourmet coffee houses, grocery chains, and foodservice distributors. It distributes its products through direct-store-delivery network, and common carriers or third-party distributors, as well as Website. Farmer Bros. Co. has strategic partnership with High Brew Coffee. Farmer Bros. Co. was founded in 1912 and is headquartered in Northlake, Texas.",
    "website": "http://www.farmerbros.com",
    "zipcode": "76262"
  },
  "FLO": {
    "city": "Thomasville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Flowers Foods, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Flowers Foods, Inc.",
    "state": "GA",
    "summary": "Flowers Foods, Inc. produces and markets packaged bakery products in the United States. It offers fresh breads, buns, rolls, snack cakes, and tortillas, as well as frozen breads and rolls under the Nature's Own, Dave's Killer Bread, Wonder, Canyon Bakehouse, Mrs. Freshley's, and Tastykake brand names. The company distributes its products through a direct-store-delivery distribution and a warehouse delivery system, as well as operates 46 bakeries comprising 44 owned and 2 leased. Its customers include mass merchandisers, supermarkets and other retailers, convenience stores, national and regional restaurants, quick-serve chains, retail in-store bakeries, foodservice distributors, food wholesalers, institutions, dollar stores, and vending companies. The company was formerly known as Flowers Industries and changed its name to Flowers Foods, Inc. in 2001. Flowers Foods, Inc. was founded in 1919 and is headquartered in Thomasville, Georgia.",
    "website": "http://www.flowersfoods.com",
    "zipcode": "31757"
  },
  "FPFID": {
    "city": "Midwest City",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Rogue One, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "ROGUE ONE INC",
    "state": "OK",
    "summary": "Rogue One, Inc. operates as a consumer products and marketing company focused on the alcoholic beverages sector. The company was formerly known as Fresh Promise Foods, Inc. and changed its name to Rogue One, Inc. in April 2021. Rogue One, Inc. was incorporated in 1993 and is based in Midwest City, Oklahoma.",
    "website": null,
    "zipcode": "73110"
  },
  "FREE": {
    "city": "Chicago",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Whole Earth Brands, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Whole Earth Brands, Inc.",
    "state": "IL",
    "summary": "Whole Earth Brands, Inc. operates as a food company worldwide. It operates in two segments, Branded CPG and Flavors & Ingredients. The Branded CPG segment focuses on building a branded portfolio serving consumers seeking zero-calorie, low-calorie, natural, no-sugar added, and plant-based products. The Branded CPG segment sells products under the Whole Earth, Pure Via, Swerve, Canderel, and Equal brands. This segment offers various sweetener formulations under each brand to address local consumer preferences and price points. The Flavors & Ingredients segment provides flavoring enhancement, flavor/aftertaste masking, moisturizing, product mouth feel modification, and skin soothing characteristics. This segment also offers licorice-derived products for use in confectionary, food, beverage, cosmetic, pharmaceutical, personal care, and tobacco products applications. The company is based in Chicago, Illinois.",
    "website": "http://www.wholeearthbrands.com",
    "zipcode": "60606"
  },
  "FRPT": {
    "city": "Secaucus",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Freshpet, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Freshpet, Inc.",
    "state": "NJ",
    "summary": "Freshpet, Inc. manufactures and markets natural fresh meals and treats for dogs and cats in the United States, Canada, and the United Kingdom. The company sells its products under the Freshpet brand; and Dognation and Dog Joy labels through various classes of retail, including grocery, mass, club, pet specialty, and natural, as well as online. Freshpet, Inc. was incorporated in 2004 and is headquartered in Secaucus, New Jersey.",
    "website": "http://www.freshpet.com",
    "zipcode": "07094"
  },
  "FTLF": {
    "city": "Omaha",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "FitLife Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "FITLIFE BRANDS INC",
    "state": "NE",
    "summary": "FitLife Brands, Inc. provides nutritional supplements for health-conscious consumers in the United States and internationally. It offers weight loss, general health, and sports nutrition supplements; precision sports nutrition formulations for professional muscular development; weight loss and sports nutrition performance enhancing supplements for fitness enthusiasts; and men's health and weight loss formulations, as well as other diet, health, and sports nutrition supplements and related products; and sports nutritional products, energy and weight loss products, and meal replacements. It markets its products under the brand names of NDS Nutrition, PMD Sports, SirenLabs, CoreActive, Metis Nutrition, iSatori, BioGenetic Laboratories, and Energize through franchised stores, as well as through various retail locations, including specialty, mass, and online. The company was formerly known as Bond Laboratories, Inc. and changed its name to FitLife Brands, Inc. in September 2013. FitLife Brands, Inc. was incorporated in 2005 and is headquartered in Omaha, Nebraska.",
    "website": "http://www.fitlifebrands.com",
    "zipcode": "68137"
  },
  "FWF.F": {
    "city": "Thomasville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Flowers Foods, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "FLOWERS FOODS INC. DL-,01",
    "state": "GA",
    "summary": "Flowers Foods, Inc. produces and markets packaged bakery products in the United States. It offers fresh breads, buns, rolls, snack cakes, and tortillas, as well as frozen breads and rolls under the Nature's Own, Dave's Killer Bread, Wonder, Canyon Bakehouse, Mrs. Freshley's, and Tastykake brand names. The company distributes its products through a direct-store-delivery distribution and a warehouse delivery system, as well as operates 46 bakeries comprising 44 owned and 2 leased. Its customers include mass merchandisers, supermarkets and other retailers, convenience stores, national and regional restaurants, quick-serve chains, retail in-store bakeries, foodservice distributors, food wholesalers, institutions, dollar stores, and vending companies. The company was formerly known as Flowers Industries and changed its name to Flowers Foods, Inc. in 2001. Flowers Foods, Inc. was founded in 1919 and is headquartered in Thomasville, Georgia.",
    "website": "http://www.flowersfoods.com",
    "zipcode": "31757"
  },
  "G1MI34.SA": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "General Mills, Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "GENERAL MILLDRN",
    "state": "MN",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, snack bars, fruit snacks, nutrition bars, and savory snacks, as well as organic products, including refrigerated yogurt, frozen and shelf-stable vegetables, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Oui, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino's, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 500 leased and 358 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.generalmills.com",
    "zipcode": "55426"
  },
  "GCGX": {
    "city": "Coconut Creek",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Global Consortium Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "GLOBAL CONSORTIUM INC",
    "state": "FL",
    "summary": "Global Consortium Inc. operates as a diversified cannabis holding company in Florida. It focuses on operating a cannabis mall that engages in cultivation, manufacturing, distribution, and delivery of THC and CBD distillates and edibles. The company is based in Coconut Creek, Florida.",
    "website": "http://www.gcgx.org",
    "zipcode": "33073"
  },
  "GDMK": {
    "city": "Island Park",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Global Diversified Marketing Group, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "GLOBAL DIVERSIFIED MARKTG GRP I",
    "state": "NY",
    "summary": "Global Diversified Marketing Group, Inc., a multi-line consumer packaged goods company, engages in the manufacture, marketing, and distribution of food and snack products in the United States, Canada, and Europe. It operates in the snack market segment and offers Italian wafers, French madeleines, coconut wafer bites, Italian filled croissants, shelf-stable macarons, and other gourmet snacks. The company sells its products directly through various distribution channels comprising specialty and grocery retailers, food service distributors, and direct store delivery (DSD); online e-commerce companies; and vending, pantry, and the micro-market segments. It also sells directly to Fortune 500 companies, including clubs and retail chain stores; and DSD and food-service distributors. The company is based in Island Park, New York.",
    "website": "http://www.360worldsnacks.com",
    "zipcode": "11558"
  },
  "GHAV": {
    "city": "Miami",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Grand Havana Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "GRAND HAVANA INC",
    "state": "FL",
    "summary": "Grand Havana, Inc. sells and distributes various coffee and tea. The company sells its products directly to end-users, as well as through its website; and distribute its products to 65 restaurants and coffee shops throughout Florida. The company is based in Miami, Florida.",
    "website": "http://www.grandhavanacoffee.com",
    "zipcode": "33127"
  },
  "GIS": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "General Mills, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "General Mills, Inc.",
    "state": "MN",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, snack bars, fruit snacks, nutrition bars, and savory snacks, as well as organic products, including refrigerated yogurt, frozen and shelf-stable vegetables, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Oui, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino's, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 500 leased and 358 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.generalmills.com",
    "zipcode": "55426"
  },
  "GIS.MX": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaged Foods",
    "long_name": "General Mills, Inc.",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "GENERAL MILLS INC",
    "state": "MN",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, snack bars, fruit snacks, nutrition bars, and savory snacks, as well as organic products, including refrigerated yogurt, frozen and shelf-stable vegetables, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Oui, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino's, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 500 leased and 358 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.generalmills.com",
    "zipcode": "55426"
  },
  "GIS.VI": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Packaged Foods",
    "long_name": "General Mills, Inc.",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "GENERAL MILLS INC",
    "state": "MN",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, snack bars, fruit snacks, nutrition bars, and savory snacks, as well as organic products, including refrigerated yogurt, frozen and shelf-stable vegetables, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Oui, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino's, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 500 leased and 358 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.generalmills.com",
    "zipcode": "55426"
  },
  "GLUC": {
    "city": "Bentonville",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Glucose Health, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "GLUCOSE HEALTH INC",
    "state": "AR",
    "summary": "Glucose Health, Inc. manufactures and sells dietary supplements for persons with pre-diabetes and/or Type-2 diabetes. Its principal product is Glucose Health, a dietary supplement formulated from nine natural ingredients to have a beneficial impact upon blood glucose, triglyceride, and cholesterol levels. Glucose Health, Inc. sells its product through national and regional pharmacy retailers, as well as through its Website, glucosehealth.com. The company was formerly known as Bio-Solutions Corp. and changed its name to Glucose Health, Inc. in November 2014. Glucose Health, Inc. was incorporated in 2007 and is based in Bentonville, Arkansas.",
    "website": "http://www.glucosehealthinc.com",
    "zipcode": "72712"
  },
  "GP7.F": {
    "city": "Walnut Creek",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Central Garden & Pet Company",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "CENTRAL GAR. + PET DL-,01",
    "state": "CA",
    "summary": "Central Garden & Pet Company produces and distributes various products for the lawn and garden, and pet supplies markets in the United States. It provides pet supplies products, including edible chews and treats, dog chew toys, dog play toys, natural dog treats and chews, pet dental chews and solutions, dog training pads, pet containment, grooming supplies, and other accessories; products for birds, small animals, and specialty pets comprising food, cages and habitats, toys, chews, and related accessories; animal and household health and insect control products; live fish and products for fish, reptiles, and other aquarium-based pets, such as aquariums, furniture and lighting fixtures, pumps, filters, water conditioners, food, and supplements; and products for horses and livestock, as well as outdoor cushions and pillows. The company sells its pet supplies products under the Aqueon, Cadet, Comfort Zone, Farnam, Four Paws, Kaytee, K&H Pet Products, Nylabone, and Zilla brands, as well as under Adams, Altosid, Arden Companies, Coralife, C&S Products, Interpet, Pet Select, TFH, and Zodiac other brands. It also offers lawn and garden supplies products that include grass seed; wild bird feed, bird feeders, bird houses, and other birding accessories; fertilizers; decorative outdoor lifestyle products; live plants; and weed and grass, as well as other herbicides, insecticide, and pesticide products. The company sells its lawn and garden supplies products under the AMDRO, Ironite, Pennington, and Sevin brands, as well as under Bell Nursery, Lilly Miller, and Over-N-Out other brand names. Central Garden & Pet Company was founded in 1955 and is based in Walnut Creek, California.",
    "website": "http://www.central.com",
    "zipcode": "94597"
  },
  "GP7A.F": {
    "city": "Walnut Creek",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Central Garden & Pet Company",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "CENTRAL GAR.C.A NV DL-,01",
    "state": "CA",
    "summary": "Central Garden & Pet Company produces and distributes various products for the lawn and garden, and pet supplies markets in the United States. It provides pet supplies products, including edible chews and treats, dog chew toys, dog play toys, natural dog treats and chews, pet dental chews and solutions, dog training pads, pet containment, grooming supplies, and other accessories; products for birds, small animals, and specialty pets comprising food, cages and habitats, toys, chews, and related accessories; animal and household health and insect control products; live fish and products for fish, reptiles, and other aquarium-based pets, such as aquariums, furniture and lighting fixtures, pumps, filters, water conditioners, food, and supplements; and products for horses and livestock, as well as outdoor cushions and pillows. The company sells its pet supplies products under the Aqueon, Cadet, Comfort Zone, Farnam, Four Paws, Kaytee, K&H Pet Products, Nylabone, and Zilla brands, as well as under Adams, Altosid, Arden Companies, Coralife, C&S Products, Interpet, Pet Select, TFH, and Zodiac other brands. It also offers lawn and garden supplies products that include grass seed; wild bird feed, bird feeders, bird houses, and other birding accessories; fertilizers; decorative outdoor lifestyle products; live plants; and weed and grass, as well as other herbicides, insecticide, and pesticide products. The company sells its lawn and garden supplies products under the AMDRO, Ironite, Pennington, and Sevin brands, as well as under Bell Nursery, Lilly Miller, and Over-N-Out other brand names. Central Garden & Pet Company was founded in 1955 and is based in Walnut Creek, California.",
    "website": "http://www.central.com",
    "zipcode": "94597"
  },
  "GRM.DE": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Packaged Foods",
    "long_name": "General Mills, Inc.",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "GENL MILLS  DL -,10",
    "state": "MN",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, snack bars, fruit snacks, nutrition bars, and savory snacks, as well as organic products, including refrigerated yogurt, frozen and shelf-stable vegetables, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Oui, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino's, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 500 leased and 358 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.generalmills.com",
    "zipcode": "55426"
  },
  "GRM.F": {
    "city": "Minneapolis",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "General Mills, Inc.",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "GENL MILLS  DL -,10",
    "state": "MN",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, snack bars, fruit snacks, nutrition bars, and savory snacks, as well as organic products, including refrigerated yogurt, frozen and shelf-stable vegetables, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Oui, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino's, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 500 leased and 358 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.",
    "website": "http://www.generalmills.com",
    "zipcode": "55426"
  },
  "GSFD": {
    "city": "Biloxi",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Global Seafood Technologies, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "GLOBAL SEAFOOD TECHNOLOGIES INC",
    "state": "MS",
    "summary": "Global Seafood Technologies, Inc. engages in the processing and packaging of shrimp for seafood restaurant chains and retail grocery outlets in the United States. The company operates through the Seafood, Fishing Bait, and Freshwater Shrimp segments. The Seafood segment performs processing, packaging, and storage of shrimp and other seafood products. The company provides frozen shrimp in various sizes and descriptions, which are packaged for commercial or consumer use. Frozen, headless shrimp with shell, is the principal product processed and packaged in one-pound and two-pound packages. Peeled shrimp is also processed under private labels for customers or for distribution to restaurants, and it is used in ready-to-cook meal kits for supermarket distribution. The Fishing Bait segment packages and distributes recreational fishing bait products. Its Killer Bee Bait products include varieties of bait shrimp, catfish bait, cut squid, whole squid, cigar minnows, ballyhoo, frozen chum, and menhaden oil. Killer Bee Bait products are sold through retail outlets and at independent marinas and bait shops. The Freshwater Shrimp segment engages in the development and harvesting of farm-grown and freshwater shrimp through its hatchery and nursery facility for sale to independent aquaculture farmers. Global Seafood Technologies is based in Biloxi, Mississippi.",
    "website": null,
    "zipcode": "39530"
  },
  "H1RL34.SA": {
    "city": "Austin",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "Hormel Foods Corporation",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "HORMEL FOODSDRN",
    "state": "MN",
    "summary": "Hormel Foods Corporation produces and markets various meat and food products to retail, foodservice, deli, and commercial customers in the United States and internationally. The company operates through four segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International & Other. It offers various perishable meat products, including fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products, such as canned luncheon meats, peanut butters, chilies, shelf-stable microwaveable meals, hashes, stews, meat spreads, flour and corn tortillas, salsas, tortilla chips, and other products. The company also provides turkey products; nutritional food products and supplements; dessert and drink mixes; and industrial gelatin products. It sells its products under the SKIPPY, SPAM, Hormel, Natural Choice, Applegate, Justin's, Jennie-O, Café H, Herdez, Black Label, Sadler's, Columbus, etc. brand names through sales personnel, as well as through independent brokers and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "website": "http://www.hormelfoods.com",
    "zipcode": "55912-3680"
  },
  "HAIN": {
    "city": "Lake Success",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "The Hain Celestial Group, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "The Hain Celestial Group, Inc.",
    "state": "NY",
    "summary": "The Hain Celestial Group, Inc. manufactures, markets, and sells organic and natural products in United States, United Kingdom, and internationally. It operates through two segments, North America and International. The company offers infant formula; infant, toddler, and kids food; plant-based beverages and frozen desserts, such as soy, rice, oat, almond, and coconut; and condiments. It also provides cooking and culinary oils; cereal bars; canned, chilled fresh, aseptic, and instant soups; yogurts, chilis, chocolate, and nut butters; and juices. In addition, the company offers hot-eating desserts, cookies, frozen fruit and vegetables, pre-cut fresh fruits, refrigerated and frozen plant-based meat-alternative products, jams, fruit spreads, jellies, honey, natural sweeteners, and marmalade products, as well as other food products. Further, it provides snack products comprising potato, root vegetable and other exotic vegetable chips, straws, tortilla chips, whole grain chips, pita chips, and puffs; and personal care products that include hand, skin, hair, and oral care products, as well as deodorants, baby care items, body washes, sunscreens, and lotions under the Alba Botanica, Avalon Organics, Earth's Best, JASON, Live Clean, and Queen Helene brands name. Additionally, the company offers herbal, green, black, wellness, rooibos, and chai tea under the Celestial Seasonings brand. It sells pantry products under the Spectrum, Spectrum Essentials, MaraNatha, Imagine broths, Hain Pure Foods, Health Valley, Hollywood, Westbrae, Almond Dream, Coconut Dream, Rice Dream, Oat Dream, Soy Dream, and DreamTM brand names. It sells its products through specialty and natural food distributors, supermarkets, natural food stores, mass-market and e-commerce retailers, food service channels and clubs, and drug and convenience stores in approximately 75 countries worldwide. The company was founded in 1993 and is headquartered in Lake Success, New York.",
    "website": "http://www.hain.com",
    "zipcode": "11042-1034"
  },
  "HBIS": {
    "city": "Miami Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Home Bistro Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "HOME BISTRO INC",
    "state": "FL",
    "summary": "Home Bistro Inc. provides direct-to-consumer, ready-made, and gourmet meals through homebistro.com in the United States. It manufactures, packages, and sells gourmet meals under the Home Bistro brand; and markets restaurant quality meats and seafoods under the Prime Chop and Colorado Prime brands. The company also has partnership with chefs to offer Chef Cora's Mediterranean/Southern cooking; and with Hungry Fan to offer Ms. Falk's sports stadium tailgate recipes. The company was formerly known as Gratitude Health, Inc. and changed its name to Home Bistro Inc. in September 2020. Home Bistro Inc was incorporated in 2009 and is headquartered in Miami Beach, Florida.",
    "website": "http://homebistro.com",
    "zipcode": "33140"
  },
  "HCEI": {
    "city": "Irvine",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Healthy Coffee International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "HEALTHY COFFEE INTERNATIONAL IN",
    "state": "CA",
    "summary": "Healthy Coffee International, Inc. operates in the coffee, wellness, and energy drinks industries. Its coffee products include EnerGi BLACK Healthy Coffee, a gourmet coffee with the mix of Reishi and Ginseng extracts; EnerGi BLEND Healthy Coffee, a mix of instant Gourmet coffee, Reishi, and Ginseng extracts blended with non-dairy creamer and natural cane sugar; EnerGi Blast Healthy Energy Drink; EnerGi CHOCO, an instant chocolate with Reishi and Ginseng extract plus non-dairy creamer and natural cane sugar; and EnerGi CHAI Healthy Milk Tea that is formulated from the ingredients of gourmet tea, Reishi, and Ginseng extracts plus non-dairy creamer and natural cane sugar. The company is based in Irvine, California.",
    "website": "http://www.healthycoffee.com",
    "zipcode": "92618"
  },
  "HF1.F": {
    "city": "Lake Success",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "The Hain Celestial Group, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "HAIN CELESTIAL GRP DL-,01",
    "state": "NY",
    "summary": "The Hain Celestial Group, Inc. manufactures, markets, and sells organic and natural products in United States, United Kingdom, and internationally. It operates through two segments, North America and International. The company offers infant formula; infant, toddler, and kids food; plant-based beverages and frozen desserts, such as soy, rice, oat, almond, and coconut; and condiments. It also provides cooking and culinary oils; cereal bars; canned, chilled fresh, aseptic, and instant soups; yogurts, chilis, chocolate, and nut butters; and juices. In addition, the company offers hot-eating desserts, cookies, frozen fruit and vegetables, pre-cut fresh fruits, refrigerated and frozen plant-based meat-alternative products, jams, fruit spreads, jellies, honey, natural sweeteners, and marmalade products, as well as other food products. Further, it provides snack products comprising potato, root vegetable and other exotic vegetable chips, straws, tortilla chips, whole grain chips, pita chips, and puffs; and personal care products that include hand, skin, hair, and oral care products, as well as deodorants, baby care items, body washes, sunscreens, and lotions under the Alba Botanica, Avalon Organics, Earth's Best, JASON, Live Clean, and Queen Helene brands name. Additionally, the company offers herbal, green, black, wellness, rooibos, and chai tea under the Celestial Seasonings brand. It sells pantry products under the Spectrum, Spectrum Essentials, MaraNatha, Imagine broths, Hain Pure Foods, Health Valley, Hollywood, Westbrae, Almond Dream, Coconut Dream, Rice Dream, Oat Dream, Soy Dream, and DreamTM brand names. It sells its products through specialty and natural food distributors, supermarkets, natural food stores, mass-market and e-commerce retailers, food service channels and clubs, and drug and convenience stores in approximately 75 countries worldwide. The company was founded in 1993 and is headquartered in Lake Success, New York.",
    "website": "http://www.hain.com",
    "zipcode": "11042-1034"
  },
  "HLF": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Herbalife Nutrition Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Herbalife Nutrition Ltd.",
    "state": "CA",
    "summary": "Herbalife Nutrition Ltd. offers nutrition solutions in North America, Mexico, South and Central America, Europe, the Middle East, Africa, and the Asia Pacific. The company provides products in the areas of weight management; targeted nutrition; energy, sports, and fitness; and outer nutrition. It offers weight management products, including meal replacement products, protein shakes, drink mixes, weight loss enhancers, and healthy snacks; targeted nutrition products, which include functional beverages, and dietary and nutritional supplements that contain herbs, vitamins, minerals, and other natural ingredients; outer nutrition products, such as facial skin, body, and hair care products; and energy, sports, and fitness products comprising N-R-G tea and energy drink products. The company also provides literature, promotional, and other materials that include start-up kits, sales tools, and educational materials. It offers its products through independent service providers and sales representatives, as well as through company-operated retail platforms. The company was formerly known as Herbalife Ltd. and changed its name to Herbalife Nutrition Ltd. in April 2018. Herbalife Nutrition Ltd. was founded in 1980 and is headquartered in Los Angeles, California.",
    "website": "http://www.herbalife.com",
    "zipcode": "90080-0210"
  },
  "HNFSA": {
    "city": "Hanover",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Hanover Foods Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "HANOVER FOODS CORP",
    "state": "PA",
    "summary": "Hanover Foods Corporation engages in processing, packaging, and selling fresh canned and frozen products. It offers baked beans, beans, canned blends and vegetables, frozen blends and vegetables, kosher, pork and beans, soft pretzels, steam in bag products, and tomatoes, as well as soups, salads, and broths. The company was founded in 1924 and is based in Hanover, Pennsylvania.",
    "website": "http://www.hanoverfoods.com",
    "zipcode": "17331"
  },
  "HNFSB": {
    "city": "Hanover",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Hanover Foods Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "HANOVER FOODS CORP",
    "state": "PA",
    "summary": "Hanover Foods Corporation engages in processing, packaging, and selling fresh canned and frozen products. It offers baked beans, beans, canned blends and vegetables, frozen blends and vegetables, kosher, pork and beans, soft pretzels, steam in bag products, and tomatoes, as well as soups, salads, and broths. The company was founded in 1924 and is based in Hanover, Pennsylvania.",
    "website": "http://www.hanoverfoods.com",
    "zipcode": "17331"
  },
  "HO7.DE": {
    "city": "Austin",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Packaged Foods",
    "long_name": "Hormel Foods Corporation",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "HORMEL FOODS  DL-,01465",
    "state": "MN",
    "summary": "Hormel Foods Corporation produces and markets various meat and food products to retail, foodservice, deli, and commercial customers in the United States and internationally. The company operates through four segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International & Other. It offers various perishable meat products, including fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products, such as canned luncheon meats, peanut butters, chilies, shelf-stable microwaveable meals, hashes, stews, meat spreads, flour and corn tortillas, salsas, tortilla chips, and other products. The company also provides turkey products; nutritional food products and supplements; dessert and drink mixes; and industrial gelatin products. It sells its products under the SKIPPY, SPAM, Hormel, Natural Choice, Applegate, Justin's, Jennie-O, Café H, Herdez, Black Label, Sadler's, Columbus, etc. brand names through sales personnel, as well as through independent brokers and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "website": "http://www.hormelfoods.com",
    "zipcode": "55912-3680"
  },
  "HO7.F": {
    "city": "Austin",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Hormel Foods Corporation",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "HORMEL FOODS  DL-,01465",
    "state": "MN",
    "summary": "Hormel Foods Corporation produces and markets various meat and food products to retail, foodservice, deli, and commercial customers in the United States and internationally. The company operates through four segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International & Other. It offers various perishable meat products, including fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products, such as canned luncheon meats, peanut butters, chilies, shelf-stable microwaveable meals, hashes, stews, meat spreads, flour and corn tortillas, salsas, tortilla chips, and other products. The company also provides turkey products; nutritional food products and supplements; dessert and drink mixes; and industrial gelatin products. It sells its products under the SKIPPY, SPAM, Hormel, Natural Choice, Applegate, Justin's, Jennie-O, Café H, Herdez, Black Label, Sadler's, Columbus, etc. brand names through sales personnel, as well as through independent brokers and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "website": "http://www.hormelfoods.com",
    "zipcode": "55912-3680"
  },
  "HOO.F": {
    "city": "Los Angeles",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Herbalife Nutrition Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "HERBALIFE NUTR.LTD.DL-002",
    "state": "CA",
    "summary": "Herbalife Nutrition Ltd. offers nutrition solutions in North America, Mexico, South and Central America, Europe, the Middle East, Africa, and the Asia Pacific. The company provides products in the areas of weight management; targeted nutrition; energy, sports, and fitness; and outer nutrition. It offers weight management products, including meal replacement products, protein shakes, drink mixes, weight loss enhancers, and healthy snacks; targeted nutrition products, which include functional beverages, and dietary and nutritional supplements that contain herbs, vitamins, minerals, and other natural ingredients; outer nutrition products, such as facial skin, body, and hair care products; and energy, sports, and fitness products comprising N-R-G tea and energy drink products. The company also provides literature, promotional, and other materials that include start-up kits, sales tools, and educational materials. It offers its products through independent service providers and sales representatives, as well as through company-operated retail platforms. The company was formerly known as Herbalife Ltd. and changed its name to Herbalife Nutrition Ltd. in April 2018. Herbalife Nutrition Ltd. was founded in 1980 and is headquartered in Los Angeles, California.",
    "website": "http://www.herbalife.com",
    "zipcode": "90080-0210"
  },
  "HOTF": {
    "city": "Springfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Hot Mama's Foods, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "HOT MAMAS FOODS INC",
    "state": "MA",
    "summary": "Hot Mama's Foods, Inc. develops, manufactures, sells, and distributes fresh, refrigerated, or perishable prepared foods in the United States, Canada, and Mexico. The company's products include salsa, hummus, pesto, dips, spreads, sauces, deli salads, entrees, side dishes, and others. It also provides private label food manufacturing, as well as co-packing services; offers testing and documentation of custom or proprietary formulas; and processes necessary for the introduction of new or customized products. The company sells its products under the Hot Mama's Foods' brand; and under the label of a wholesale brand customer or under private label. Hot Mama's Foods, Inc. markets its products to regional and national retail grocery chains, distributors to the retail grocery industry, brand-holders requiring contract manufacturing services, restaurant chains, and secondary processors making assemblies using the products as components or ingredients. The company was founded in 1984 and is headquartered in Springfield, Massachusetts.",
    "website": "http://www.hotmamas.ca",
    "zipcode": "01104"
  },
  "HRCR": {
    "city": "Harrisburg",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Hershey Creamery Company, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "HERSHEY CREAMERY CO",
    "state": "PA",
    "summary": "Hershey Creamery Company, Inc. produces, sells, and distributes bulk ice cream and ice cream novelties. It offers various flavors of bulk ice cream, including reduced fat and no sugar added bulk ice creams; hand dipped products, such as ice cream shakes, splits, smoothies, cups, and dishes; pre-packaged ice-cream products, which comprise scrounds, round pints, rounds, foam cups, slices, and ice cream cakes; creamy soft serve ice creams; and frozen drinks, which include milkshakes, smoothies, frozen coffee drinks, and more. The company also provides sherbets, sorbets, and frozen yogurts. It serves parlors, restaurants, healthcare customers, K-12 schools, and colleges/universities, as well as other non-traditional sites, such as campgrounds, amusement parks, and others. The company sells its products through retailers in the United States. Hershey Creamery Company, Inc. was founded in 1894 and is based in Harrisburg, Pennsylvania.",
    "website": "http://www.hersheyicecream.com",
    "zipcode": "17101"
  },
  "HRL": {
    "city": "Austin",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Hormel Foods Corporation",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "Hormel Foods Corporation",
    "state": "MN",
    "summary": "Hormel Foods Corporation produces and markets various meat and food products to retail, foodservice, deli, and commercial customers in the United States and internationally. The company operates through four segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International & Other. It offers various perishable meat products, including fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products, such as canned luncheon meats, peanut butters, chilies, shelf-stable microwaveable meals, hashes, stews, meat spreads, flour and corn tortillas, salsas, tortilla chips, and other products. The company also provides turkey products; nutritional food products and supplements; dessert and drink mixes; and industrial gelatin products. It sells its products under the SKIPPY, SPAM, Hormel, Natural Choice, Applegate, Justin's, Jennie-O, Café H, Herdez, Black Label, Sadler's, Columbus, etc. brand names through sales personnel, as well as through independent brokers and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "website": "http://www.hormelfoods.com",
    "zipcode": "55912-3680"
  },
  "HRL.VI": {
    "city": "Austin",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Packaged Foods",
    "long_name": "Hormel Foods Corporation",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "HORMEL FOODS CORP",
    "state": "MN",
    "summary": "Hormel Foods Corporation produces and markets various meat and food products to retail, foodservice, deli, and commercial customers in the United States and internationally. The company operates through four segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International & Other. It offers various perishable meat products, including fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products, such as canned luncheon meats, peanut butters, chilies, shelf-stable microwaveable meals, hashes, stews, meat spreads, flour and corn tortillas, salsas, tortilla chips, and other products. The company also provides turkey products; nutritional food products and supplements; dessert and drink mixes; and industrial gelatin products. It sells its products under the SKIPPY, SPAM, Hormel, Natural Choice, Applegate, Justin's, Jennie-O, Café H, Herdez, Black Label, Sadler's, Columbus, etc. brand names through sales personnel, as well as through independent brokers and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.",
    "website": "http://www.hormelfoods.com",
    "zipcode": "55912-3680"
  },
  "INBP": {
    "city": "Hillside",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Integrated BioPharma, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "INTEGRATED BIOPHARMA INC",
    "state": "NJ",
    "summary": "Integrated BioPharma, Inc., together with its subsidiaries, manufactures, distributes, markets, and sells vitamins, nutritional supplements, and herbal products primarily in the United States, Luxembourg, and Canada. It operates through two segments, Contract Manufacturing and Other Nutraceutical Businesses. The Contract Manufacturing segment manufactures vitamins and nutritional supplements for sale to distributors, multilevel marketers, and specialized healthcare providers. The Other Nutraceutical Businesses segment distributes healthful nutritional products for sale through mass market, grocery, drug, and vitamin retailers under the Peaceful Sleep and Wheatgrass brands, as well as other branded proprietary nutraceutical products. This segment also sells private label vitamin and nutritional supplement products through the Internet; provides warehousing and fulfilment services; and distributes fine natural botanicals, including multi minerals, as well as raw materials. The company was formerly known as Integrated Health Technologies, Inc. Integrated BioPharma, Inc. was incorporated in 1980 and is based in Hillside, New Jersey.",
    "website": "http://www.ibiopharma.com",
    "zipcode": "07205"
  },
  "INGR": {
    "city": "Westchester",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Ingredion Incorporated",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Ingredion Incorporated",
    "state": "IL",
    "summary": "Ingredion Incorporated, together with its subsidiaries, produces and sells starches and sweeteners for various industries. It operates through four segments: North America; South America; Asia Pacific; and Europe, Middle East, and Africa. The company offers sweetener products comprising glucose syrups, high maltose syrups, high fructose corn syrups, caramel colors, dextrose, polyols, maltodextrins, and glucose syrup solids, as well as food-grade and industrial starches, biomaterials, and nutrition ingredients. It also provides edible corn oil; refined corn oil to packers of cooking oil and to producers of margarine, salad dressings, shortening, mayonnaise, and other foods; and corn gluten feed used as protein feed for chickens, pet food, and aquaculture, as well as fruit and vegetable products, such as concentrates, purees and essences, pulse proteins, and hydrocolloids systems and blends. The company's products are derived primarily from processing corn and other starch-based materials, such as tapioca, potato, and rice. It serves food, beverage, paper and corrugating products, brewing, pharmaceutical, textile, and personal care industries, as well as animal feed markets. The company was formerly known as Corn Products International, Inc. and changed its name to Ingredion Incorporated in June 2012. Ingredion Incorporated was founded in 1906 and is headquartered in Westchester, Illinois.",
    "website": "http://www.ingredion.com",
    "zipcode": "60154"
  },
  "JALA": {
    "city": "Great Neck",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Be Active Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "BE ACTIVE HLDGS INC",
    "state": "NY",
    "summary": "Be Active Holdings, Inc. manufactures and sells frozen yogurt and ice cream products. It offers frozen yogurt sandwiches and bars, and ice cream products under the trade name Jala. The Company sells its products to convenience, supermarket chains, and other foods stores in New York, New Jersey, Connecticut, Massachusetts, Rhode Island, and Vermont. Be Active Holdings, Inc. was formerly known as Superlight, Inc. The company was founded in 2009 and is based in Great Neck, New York.",
    "website": null,
    "zipcode": "11021"
  },
  "JBSS": {
    "city": "Elgin",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "John B. Sanfilippo & Son, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "John B. Sanfilippo & Son, Inc.",
    "state": "IL",
    "summary": "John B. Sanfilippo & Son, Inc., together with its subsidiary, JBSS Ventures, LLC, processes and distributes tree nuts and peanuts in the United States. The company offers raw and processed nuts, including almonds, pecans, peanuts, black walnuts, English walnuts, cashews, macadamia nuts, pistachios, pine nuts, Brazil nuts, and filberts in various styles and seasonings. It also offers peanut butter in various sizes and varieties; snack and trail mixes, salad toppings, snacks, snack bites, dried fruit, and chocolate and yogurt coated products; baking ingredients; bulk food products; sunflower kernels, pepitas, almond and cashew butter, candy and confections, corn snacks, sesame sticks, and other sesame snack products; and various toppings for ice cream and yogurt. In addition, the company operates a retail store. The company provides its products under the Fisher, Orchard Valley Harvest, Squirrel Brand, Southern Style Nuts, and Sunshine Country brands, as well as under various private brands. It serves retailers and wholesalers, and commercial ingredient and contract packaging customers through a network of independent brokers, distributors, and suppliers. John B. Sanfilippo & Son, Inc. was founded in 1959 and is headquartered in Elgin, Illinois.",
    "website": "http://www.jbssinc.com",
    "zipcode": "60123"
  },
  "JJSF": {
    "city": "Pennsauken",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "J & J Snack Foods Corp.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "J & J Snack Foods Corp.",
    "state": "NJ",
    "summary": "J & J Snack Foods Corp. manufactures, markets, and distributes various nutritional snack foods and beverages to the food service and retail supermarket industries in the United States, Mexico, and Canada. It operates in three segments: Food Service, Retail Supermarkets, and Frozen Beverages. The company offers soft pretzels under the SUPERPRETZEL, PRETZEL FILLERS, PRETZELFILS, GOURMET TWISTS, MR. TWISTER, SOFT PRETZEL BITES, SOFTSTIX, SOFT PRETZEL BUNS, TEXAS TWIST, BAVARIAN BAKERY, SUPERPRETZEL BAVARIAN, NEW YORK PRETZEL, KIM & SCOTT'S GOURMET PRETZELS, SERIOUSLY TWISTED!, BRAUHAUS, AUNTIE ANNE'S, and LABRIOLA, as well as under the private labels. It also provides frozen juice treats and desserts under the LUIGI'S, WHOLE FRUIT, PHILLY SWIRL, SOUR PATCH, ICEE, and MINUTE MAID brands; churros under the TIO PEPE'S and CALIFORNIA CHURROS brands; and dough enrobed handheld products under the SUPREME STUFFERS and SWEET STUFFERS brands. In addition, the company offers bakery products, including biscuits, fig and fruit bars, cookies, breads, rolls, crumb, muffins, and donuts under the MRS. GOODCOOKIE, READI-BAKE, COUNTRY HOME, MARY B'S, DADDY RAY'S, and HILL & VALLEY brands, as well as under private labels; and frozen beverages under the ICEE, SLUSH PUPPIE, and PARROT ICE brands. J & J Snack Foods Corp. sells its products through a network of food brokers, independent sales distributors, and direct sales force. The company was founded in 1971 and is headquartered in Pennsauken, New Jersey.",
    "website": "http://www.jjsnack.com",
    "zipcode": "08109"
  },
  "JM2.F": {
    "city": "Orrville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "The J. M. Smucker Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "SMUCKER -J.M.-",
    "state": "OH",
    "summary": "The J. M. Smucker Company manufactures and markets food and beverage products worldwide. It operates in four segments: U.S. Retail Pet Foods, U.S. Retail Coffee, U.S. Retail Consumer Foods, and International and Away From Home. The company offers pet food and snacks; mainstream roast, ground, single serve, and premium coffee; peanut butter and specialty spreads; fruit spreads, shortening and oils, and frozen sandwiches and snacks; and foodservice hot beverage, foodservice portion control, and flour products, as well as dog and cat food, frozen handheld products, portion control products, juices and beverages, and baking mixes and ingredients. It provides its products under the Meow Mix, Kibbles n Bits, 9Lives, Nature's Recipe, Milk-Bone, Pup-Peroni, Rachael Ray Nutrish, Natural Balance, Folgers, Café Bustelo, Dunkin' Donuts, 1850, Jif, Smucker's, Smucker's Uncrustables, Crisco, Robin Hood, and Five Roses brands. The company sells its products through direct sales and brokers to food retailers and wholesalers, club stores, discount and dollar stores, online retailers, pet specialty stores, natural foods stores and distributors, drug stores, military commissaries, and mass merchandisers; and through retail channels, and foodservice distributors and operators. The J. M. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.",
    "website": "http://www.jmsmucker.com",
    "zipcode": "44667-0280"
  },
  "JO1.F": {
    "city": "Elgin",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "John B. Sanfilippo & Son, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "SANFILIPPO,JOHN B. DL-,01",
    "state": "IL",
    "summary": "John B. Sanfilippo & Son, Inc., together with its subsidiary, JBSS Ventures, LLC, processes and distributes tree nuts and peanuts in the United States. The company offers raw and processed nuts, including almonds, pecans, peanuts, black walnuts, English walnuts, cashews, macadamia nuts, pistachios, pine nuts, Brazil nuts, and filberts in various styles and seasonings. It also offers peanut butter in various sizes and varieties; snack and trail mixes, salad toppings, snacks, snack bites, dried fruit, and chocolate and yogurt coated products; baking ingredients; bulk food products; sunflower kernels, pepitas, almond and cashew butter, candy and confections, corn snacks, sesame sticks, and other sesame snack products; and various toppings for ice cream and yogurt. In addition, the company operates a retail store. The company provides its products under the Fisher, Orchard Valley Harvest, Squirrel Brand, Southern Style Nuts, and Sunshine Country brands, as well as under various private brands. It serves retailers and wholesalers, and commercial ingredient and contract packaging customers through a network of independent brokers, distributors, and suppliers. John B. Sanfilippo & Son, Inc. was founded in 1959 and is headquartered in Elgin, Illinois.",
    "website": "http://www.jbssinc.com",
    "zipcode": "60123"
  },
  "JVA": {
    "city": "Staten Island",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Coffee Holding Co., Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Coffee Holding Co., Inc.",
    "state": "NY",
    "summary": "Coffee Holding Co., Inc. manufactures, roasts, packages, markets, and distributes roasted and blended coffees in the United States, Australia, Canada, England, and China. The company offers wholesale green coffee products, which include unroasted raw beans of approximately 90 varieties that are sold to large, medium, and small roasters, as well as coffee shop operators. It also roasts, blends, packages, and sells coffee under private labels. As of October 31, 2020, the company supplied private label coffee under approximately 21 labels to wholesalers and retailers in cans, brick packages, and instants of various sizes. In addition, it roasts, blends, and packages company label branded coffee to supermarkets, wholesalers, and individually owned and multi-unit retail customers. Further, the company offers tabletop coffee roasting equipment, instant coffees, and tea products for its customers. Its coffee brands include Cafe Caribe, Don Manuel, S&W, Cafe Supremo, Via Roma, Premier Roasters, Harmony Bay, and Steep and Brew. The company was formerly known as Transpacific International Group Corp and changed its name to Coffee Holding Co., Inc. in April 1998. Coffee Holding Co., Inc. was founded in 1971 and is headquartered in Staten Island, New York.",
    "website": "http://coffeeholding.com",
    "zipcode": "10314"
  },
  "K": {
    "city": "Battle Creek",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Kellogg Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "Kellogg Company",
    "state": "MI",
    "summary": "Kellogg Company, together with its subsidiaries, manufactures and markets ready-to-eat cereal and convenience foods. The company operates through four segments: North America, Europe, Latin America, and Asia Middle East Africa. Its principal products include crackers, crisps, savory snacks, toaster pastries, cereal bars and bites, granola bars and bites, ready-to-eat cereals, frozen waffles, veggie foods, and noodles. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Kashi, Bear Naked, Eggo, Morningstar Farms, Choco Krispies, Crunchy Nut, Nutri-Grain, Special K, Squares, Zucaritas, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, Be Natural, LCMs, Coco Pops, Frosties, Rice Krispies Squares, Kashi Go, Vector, Incogmeato, Veggitizers, and Gardenburger brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. Kellogg Company was founded in 1906 and is headquartered in Battle Creek, Michigan.",
    "website": "http://www.kelloggcompany.com",
    "zipcode": "49016-3599"
  },
  "K.MX": {
    "city": "Battle Creek",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaged Foods",
    "long_name": "Kellogg Company",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KELLOGG COMPANY",
    "state": "MI",
    "summary": "Kellogg Company, together with its subsidiaries, manufactures and markets ready-to-eat cereal and convenience foods. The company operates through four segments: North America, Europe, Latin America, and Asia Middle East Africa. Its principal products include crackers, crisps, savory snacks, toaster pastries, cereal bars and bites, granola bars and bites, ready-to-eat cereals, frozen waffles, veggie foods, and noodles. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Kashi, Bear Naked, Eggo, Morningstar Farms, Choco Krispies, Crunchy Nut, Nutri-Grain, Special K, Squares, Zucaritas, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, Be Natural, LCMs, Coco Pops, Frosties, Rice Krispies Squares, Kashi Go, Vector, Incogmeato, Veggitizers, and Gardenburger brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. Kellogg Company was founded in 1906 and is headquartered in Battle Creek, Michigan.",
    "website": "http://www.kelloggcompany.com",
    "zipcode": "49016-3599"
  },
  "K1EL34.SA": {
    "city": "Battle Creek",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "Kellogg Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KELLOGG CO  DRN",
    "state": "MI",
    "summary": "Kellogg Company, together with its subsidiaries, manufactures and markets ready-to-eat cereal and convenience foods. The company operates through four segments: North America, Europe, Latin America, and Asia Middle East Africa. Its principal products include crackers, crisps, savory snacks, toaster pastries, cereal bars and bites, granola bars and bites, ready-to-eat cereals, frozen waffles, veggie foods, and noodles. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Kashi, Bear Naked, Eggo, Morningstar Farms, Choco Krispies, Crunchy Nut, Nutri-Grain, Special K, Squares, Zucaritas, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, Be Natural, LCMs, Coco Pops, Frosties, Rice Krispies Squares, Kashi Go, Vector, Incogmeato, Veggitizers, and Gardenburger brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. Kellogg Company was founded in 1906 and is headquartered in Battle Creek, Michigan.",
    "website": "http://www.kelloggcompany.com",
    "zipcode": "49016-3599"
  },
  "KBEV.CN": {
    "city": "Denver",
    "country": "United States",
    "currency": "CAD",
    "exchange": "CNQ",
    "industry": "Packaged Foods",
    "long_name": "Koios Beverage Corp.",
    "market": "ca_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "KoiosBeverage",
    "state": "CO",
    "summary": "Koios Beverage Corp., together with its subsidiaries, produces, markets, and sells functional beverages in the United States. The company also provides supplements and coffee products. It distributes its products through a network of approximately 4,400 retail locations and Website. The company was formerly known as Super Nova Petroleum Corp. and changed its name to Koios Beverage Corp. in April 2018. Koios Beverage Corp. was incorporated in 2012 and is headquartered in Denver, Colorado.",
    "website": "http://koiosbeveragecorp.com",
    "zipcode": "80204"
  },
  "KBEVF": {
    "city": "Denver",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Koios Beverage Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "KOIOS BEVERAGE CORP",
    "state": "CO",
    "summary": "Koios Beverage Corp., together with its subsidiaries, produces, markets, and sells functional beverages in the United States. The company also provides supplements and coffee products. It distributes its products through a network of approximately 4,400 retail locations and Website. The company was formerly known as Super Nova Petroleum Corp. and changed its name to Koios Beverage Corp. in April 2018. Koios Beverage Corp. was incorporated in 2012 and is headquartered in Denver, Colorado.",
    "website": "http://koiosbeveragecorp.com",
    "zipcode": "80204"
  },
  "KEL.DE": {
    "city": "Battle Creek",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Packaged Foods",
    "long_name": "Kellogg Company",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KELLOGG CO.  DL -,25",
    "state": "MI",
    "summary": "Kellogg Company, together with its subsidiaries, manufactures and markets ready-to-eat cereal and convenience foods. The company operates through four segments: North America, Europe, Latin America, and Asia Middle East Africa. Its principal products include crackers, crisps, savory snacks, toaster pastries, cereal bars and bites, granola bars and bites, ready-to-eat cereals, frozen waffles, veggie foods, and noodles. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Kashi, Bear Naked, Eggo, Morningstar Farms, Choco Krispies, Crunchy Nut, Nutri-Grain, Special K, Squares, Zucaritas, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, Be Natural, LCMs, Coco Pops, Frosties, Rice Krispies Squares, Kashi Go, Vector, Incogmeato, Veggitizers, and Gardenburger brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. Kellogg Company was founded in 1906 and is headquartered in Battle Creek, Michigan.",
    "website": "http://www.kelloggcompany.com",
    "zipcode": "49016-3599"
  },
  "KEL.F": {
    "city": "Battle Creek",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Kellogg Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KELLOGG CO.  DL -,25",
    "state": "MI",
    "summary": "Kellogg Company, together with its subsidiaries, manufactures and markets ready-to-eat cereal and convenience foods. The company operates through four segments: North America, Europe, Latin America, and Asia Middle East Africa. Its principal products include crackers, crisps, savory snacks, toaster pastries, cereal bars and bites, granola bars and bites, ready-to-eat cereals, frozen waffles, veggie foods, and noodles. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Kashi, Bear Naked, Eggo, Morningstar Farms, Choco Krispies, Crunchy Nut, Nutri-Grain, Special K, Squares, Zucaritas, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, Be Natural, LCMs, Coco Pops, Frosties, Rice Krispies Squares, Kashi Go, Vector, Incogmeato, Veggitizers, and Gardenburger brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. Kellogg Company was founded in 1906 and is headquartered in Battle Creek, Michigan.",
    "website": "http://www.kelloggcompany.com",
    "zipcode": "49016-3599"
  },
  "KELL.VI": {
    "city": "Battle Creek",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Packaged Foods",
    "long_name": "Kellogg Company",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KELLOGG CO",
    "state": "MI",
    "summary": "Kellogg Company, together with its subsidiaries, manufactures and markets ready-to-eat cereal and convenience foods. The company operates through four segments: North America, Europe, Latin America, and Asia Middle East Africa. Its principal products include crackers, crisps, savory snacks, toaster pastries, cereal bars and bites, granola bars and bites, ready-to-eat cereals, frozen waffles, veggie foods, and noodles. The company offers its products under the Kellogg's, Cheez-It, Pringles, Austin, Parati, RXBAR, Kashi, Bear Naked, Eggo, Morningstar Farms, Choco Krispies, Crunchy Nut, Nutri-Grain, Special K, Squares, Zucaritas, Sucrilhos, Pop-Tarts, K-Time, Sunibrite, Split Stix, Be Natural, LCMs, Coco Pops, Frosties, Rice Krispies Squares, Kashi Go, Vector, Incogmeato, Veggitizers, and Gardenburger brand names. It sells its products to retailers through direct sales forces, as well as brokers and distributors. Kellogg Company was founded in 1906 and is headquartered in Battle Creek, Michigan.",
    "website": "http://www.kelloggcompany.com",
    "zipcode": "49016-3599"
  },
  "KHC": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "The Kraft Heinz Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "The Kraft Heinz Company",
    "state": "PA",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy, meals, meats and seafood, frozen and chilled foods, packaged drinking pouches, appetizers, nuts and salted snacks, refreshment beverages, coffee, infant and nutrition products, and other grocery products, as well as desserts, dressings, toppings, and baking. The company offers its products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Velveeta, Lunchables, Planters, Maxwell House, Capri Sun, Ore-Ida, Kool-Aid, Jell-O, ABC, Master, Golden Circle, Quero, Plasmon, Wattie's, Pudliszki, Classico, TGI Fridays, and Taco Bell Home Originals brand names. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.kraftheinzcompany.com",
    "zipcode": "15222"
  },
  "KHC.MX": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaged Foods",
    "long_name": "The Kraft Heinz Company",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KRAFT HEINZ CO",
    "state": "PA",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy, meals, meats and seafood, frozen and chilled foods, packaged drinking pouches, appetizers, nuts and salted snacks, refreshment beverages, coffee, infant and nutrition products, and other grocery products, as well as desserts, dressings, toppings, and baking. The company offers its products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Velveeta, Lunchables, Planters, Maxwell House, Capri Sun, Ore-Ida, Kool-Aid, Jell-O, ABC, Master, Golden Circle, Quero, Plasmon, Wattie's, Pudliszki, Classico, TGI Fridays, and Taco Bell Home Originals brand names. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.kraftheinzcompany.com",
    "zipcode": "15222"
  },
  "KHC.VI": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Packaged Foods",
    "long_name": "The Kraft Heinz Company",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KRAFT HEINZ CO",
    "state": "PA",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy, meals, meats and seafood, frozen and chilled foods, packaged drinking pouches, appetizers, nuts and salted snacks, refreshment beverages, coffee, infant and nutrition products, and other grocery products, as well as desserts, dressings, toppings, and baking. The company offers its products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Velveeta, Lunchables, Planters, Maxwell House, Capri Sun, Ore-Ida, Kool-Aid, Jell-O, ABC, Master, Golden Circle, Quero, Plasmon, Wattie's, Pudliszki, Classico, TGI Fridays, and Taco Bell Home Originals brand names. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.kraftheinzcompany.com",
    "zipcode": "15222"
  },
  "KHCB34.SA": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "The Kraft Heinz Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KRAFT HEINZ DRN",
    "state": "PA",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy, meals, meats and seafood, frozen and chilled foods, packaged drinking pouches, appetizers, nuts and salted snacks, refreshment beverages, coffee, infant and nutrition products, and other grocery products, as well as desserts, dressings, toppings, and baking. The company offers its products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Velveeta, Lunchables, Planters, Maxwell House, Capri Sun, Ore-Ida, Kool-Aid, Jell-O, ABC, Master, Golden Circle, Quero, Plasmon, Wattie's, Pudliszki, Classico, TGI Fridays, and Taco Bell Home Originals brand names. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.kraftheinzcompany.com",
    "zipcode": "15222"
  },
  "KHNZ.DE": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "EUR",
    "exchange": "GER",
    "industry": "Packaged Foods",
    "long_name": "The Kraft Heinz Company",
    "market": "de_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KRAFT HEINZ CO.DL -,01",
    "state": "PA",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy, meals, meats and seafood, frozen and chilled foods, packaged drinking pouches, appetizers, nuts and salted snacks, refreshment beverages, coffee, infant and nutrition products, and other grocery products, as well as desserts, dressings, toppings, and baking. The company offers its products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Velveeta, Lunchables, Planters, Maxwell House, Capri Sun, Ore-Ida, Kool-Aid, Jell-O, ABC, Master, Golden Circle, Quero, Plasmon, Wattie's, Pudliszki, Classico, TGI Fridays, and Taco Bell Home Originals brand names. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.kraftheinzcompany.com",
    "zipcode": "15222"
  },
  "KHNZ.F": {
    "city": "Pittsburgh",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "The Kraft Heinz Company",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "KRAFT HEINZ CO.DL -,01",
    "state": "PA",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States, Canada, the United Kingdom, and internationally. Its products include condiments and sauces, cheese and dairy, meals, meats and seafood, frozen and chilled foods, packaged drinking pouches, appetizers, nuts and salted snacks, refreshment beverages, coffee, infant and nutrition products, and other grocery products, as well as desserts, dressings, toppings, and baking. The company offers its products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Velveeta, Lunchables, Planters, Maxwell House, Capri Sun, Ore-Ida, Kool-Aid, Jell-O, ABC, Master, Golden Circle, Quero, Plasmon, Wattie's, Pudliszki, Classico, TGI Fridays, and Taco Bell Home Originals brand names. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative and independent grocery accounts, convenience stores, drug stores, value stores, bakeries, pharmacies, mass merchants, club stores, foodservice distributors and institutions, including hotels, restaurants, hospitals, health care facilities, and government agencies; and online through e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.",
    "website": "http://www.kraftheinzcompany.com",
    "zipcode": "15222"
  },
  "L1WH34.SA": {
    "city": "Eagle",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "Lamb Weston Holdings, Inc.",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "LAMB WESTON DRN ED",
    "state": "ID",
    "summary": "Lamb Weston Holdings, Inc. produces, distributes, and markets value-added frozen potato products worldwide. It operates through four segments: Global, Foodservice, Retail, and Other. The company offers frozen potatoes, sweet potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as various customer labels. The company also offers its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. In addition, it engages in the vegetable and dairy businesses. The company serves retail and foodservice customers; grocery, mass, club, and specialty retailers; and businesses, independent restaurants, regional chain restaurants, and convenience stores, as well as educational institutions. Lamb Weston Holdings, Inc. was founded in 1950 and is headquartered in Eagle, Idaho.",
    "website": "http://www.lambweston.com",
    "zipcode": "83616"
  },
  "L2T1.F": {
    "city": "Sandy",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "LifeVantage Corporation",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "LIFEVANTAGE CORP.",
    "state": "UT",
    "summary": "LifeVantage Corporation engages in the identification, research, development, and distribution of nutrigenomic activators, dietary supplements, nootropics, pre- and pro-biotics, weight management, and skin and hair care products. The company offers Protandim, a line of scientifically-validated dietary supplements; LifeVantage Omega+, a dietary supplement that combines DHA and EPA Omega-3 fatty acids, Omega-7 fatty acids, and vitamin D3; LifeVantage ProBio, a dietary supplement to support digestive system health; a line of weight management products under the PhysIQ brand; Petandim for Dogs, a supplement to combat oxidative stress in dogs; and Axio, a line of energy drink mixes. It also provides anti-aging skin care products, including facial cleansers, perfecting lotions, eye serums, anti-aging creams, and hand creams, as well as hair care products, such as invigorating shampoos, nourishing conditioners, and scalp serums under the LifeVantage TrueScience brand name. The company sells its products through its website, as well as through a network of independent distributors in the United States, Mexico, Japan, Australia, Hong Kong, Canada, Thailand, the United Kingdom, the Netherlands, Germany, Taiwan, Austria, Spain, Ireland, Belgium, New Zealand, and China. LifeVantage Corporation is headquartered in Sandy, Utah.",
    "website": "http://www.lifevantage.com",
    "zipcode": "84070"
  },
  "LANC": {
    "city": "Westerville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Lancaster Colony Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Lancaster Colony Corporation",
    "state": "OH",
    "summary": "Lancaster Colony Corporation manufactures and markets specialty food products for the retail and foodservice markets in the United States. The company operates in two segments, Retail and Foodservice. It offers frozen garlic bread under the New York BRAND Bakery; frozen Parkerhouse style yeast and dinner rolls under the Sister Schubert's; frozen mini stuffed bagels under the Bantam Bagels; salad dressings under the Marzetti, Simply Dressed, Simply 60, Cardini's, Tastefully Dressed, and Girard's; and vegetable and fruit dips under the Marzetti brand names. The company also provides flatbread wraps and pizza crusts under the Flatout; sprouted grain bakery products under the Angelic Bakehouse; croutons and salad toppings under the New York BRAND Bakery, Chatham Village, and Marzetti; and frozen pasta under the Marzetti Frozen Pasta brand names. In addition, it manufactures and sells other products to brand license agreements, including Olive Garden's dressings, Chick-fil-A, and Buffalo Wild Wings sauces. The company sells its products through sales personnel, food brokers, and distributors to retailers and restaurants. Lancaster Colony Corporation was founded in 1961 and is based in Westerville, Ohio.",
    "website": "http://www.lancastercolony.com",
    "zipcode": "43082"
  },
  "LC1.F": {
    "city": "Westerville",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Lancaster Colony Corporation",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "LANCASTER COLONY CORP.",
    "state": "OH",
    "summary": "Lancaster Colony Corporation manufactures and markets specialty food products for the retail and foodservice markets in the United States. The company operates in two segments, Retail and Foodservice. It offers frozen garlic bread under the New York BRAND Bakery; frozen Parkerhouse style yeast and dinner rolls under the Sister Schubert's; frozen mini stuffed bagels under the Bantam Bagels; salad dressings under the Marzetti, Simply Dressed, Simply 60, Cardini's, Tastefully Dressed, and Girard's; and vegetable and fruit dips under the Marzetti brand names. The company also provides flatbread wraps and pizza crusts under the Flatout; sprouted grain bakery products under the Angelic Bakehouse; croutons and salad toppings under the New York BRAND Bakery, Chatham Village, and Marzetti; and frozen pasta under the Marzetti Frozen Pasta brand names. In addition, it manufactures and sells other products to brand license agreements, including Olive Garden's dressings, Chick-fil-A, and Buffalo Wild Wings sauces. The company sells its products through sales personnel, food brokers, and distributors to retailers and restaurants. Lancaster Colony Corporation was founded in 1961 and is based in Westerville, Ohio.",
    "website": "http://www.lancastercolony.com",
    "zipcode": "43082"
  },
  "LDE.F": {
    "city": "Santa Clara",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Landec Corporation",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "LANDEC CORP.  DL-,01",
    "state": "CA",
    "summary": "Landec Corporation, together with its subsidiaries, designs, develops, manufactures, and sells differentiated health and wellness products for food and biomaterials markets. It operates through Curation Foods and Lifecore segments. The Curation Foods segment engages in processing, marketing, and selling of vegetable-based salads, and fresh-cut and whole vegetable products primarily under the Eat Smart brand, O branded olive oils and wine vinegars, and Yucatan and Cabo Fresh guacamole and avocado food products, as well as various private labels. It serves retail grocery chains, club stores, and food service operators. The Lifecore segment engages in the manufacture of pharmaceutical-grade sodium hyaluronate (HA) in bulk form, as well as formulated and filled syringes and vials for injectable products used in treating a range of medical conditions and procedures. It also provides services, including technology transfer, material component changes, analytical method development, formulation development, pilot studies, stability studies, process validation, and production of materials for clinical studies to its partners for HA-based and non-HA based aseptically formulated and filled products. This segment sells its non-HA products for medical use primarily in the ophthalmic, orthopedic, and other markets. It sells its products directly to partners in the medical device and pharmaceutical markets. The company was founded in 1986 and is headquartered in Santa Clara, California.",
    "website": "http://www.landec.com",
    "zipcode": "95054"
  },
  "LFVN": {
    "city": "Sandy",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "LifeVantage Corporation",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Lifevantage Corporation",
    "state": "UT",
    "summary": "LifeVantage Corporation engages in the identification, research, development, and distribution of nutrigenomic activators, dietary supplements, nootropics, pre- and pro-biotics, weight management, and skin and hair care products. The company offers Protandim, a line of scientifically-validated dietary supplements; LifeVantage Omega+, a dietary supplement that combines DHA and EPA Omega-3 fatty acids, Omega-7 fatty acids, and vitamin D3; LifeVantage ProBio, a dietary supplement to support digestive system health; a line of weight management products under the PhysIQ brand; Petandim for Dogs, a supplement to combat oxidative stress in dogs; and Axio, a line of energy drink mixes. It also provides anti-aging skin care products, including facial cleansers, perfecting lotions, eye serums, anti-aging creams, and hand creams, as well as hair care products, such as invigorating shampoos, nourishing conditioners, and scalp serums under the LifeVantage TrueScience brand name. The company sells its products through its website, as well as through a network of independent distributors in the United States, Mexico, Japan, Australia, Hong Kong, Canada, Thailand, the United Kingdom, the Netherlands, Germany, Taiwan, Austria, Spain, Ireland, Belgium, New Zealand, and China. LifeVantage Corporation is headquartered in Sandy, Utah.",
    "website": "http://www.lifevantage.com",
    "zipcode": "84070"
  },
  "LNDC": {
    "city": "Santa Clara",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Landec Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Landec Corporation",
    "state": "CA",
    "summary": "Landec Corporation, together with its subsidiaries, designs, develops, manufactures, and sells differentiated health and wellness products for food and biomaterials markets. It operates through Curation Foods and Lifecore segments. The Curation Foods segment engages in processing, marketing, and selling of vegetable-based salads, and fresh-cut and whole vegetable products primarily under the Eat Smart brand, O branded olive oils and wine vinegars, and Yucatan and Cabo Fresh guacamole and avocado food products, as well as various private labels. It serves retail grocery chains, club stores, and food service operators. The Lifecore segment engages in the manufacture of pharmaceutical-grade sodium hyaluronate (HA) in bulk form, as well as formulated and filled syringes and vials for injectable products used in treating a range of medical conditions and procedures. It also provides services, including technology transfer, material component changes, analytical method development, formulation development, pilot studies, stability studies, process validation, and production of materials for clinical studies to its partners for HA-based and non-HA based aseptically formulated and filled products. This segment sells its non-HA products for medical use primarily in the ophthalmic, orthopedic, and other markets. It sells its products directly to partners in the medical device and pharmaceutical markets. The company was founded in 1986 and is headquartered in Santa Clara, California.",
    "website": "http://www.landec.com",
    "zipcode": "95054"
  },
  "LSF": {
    "city": "Sisters",
    "country": "United States",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Packaged Foods",
    "long_name": "Laird Superfood, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Laird Superfood, Inc.",
    "state": "OR",
    "summary": "Laird Superfood, Inc. manufactures and markets plant-based natural and functional food in the United States. It offers powdered and liquid coffee creamers, and hydration and beverage enhancing supplements; hydrate coconut water products, activate daily jumpstart products, activate prebiotic daily greens, renew plant-based proteins, and performance mushroom supplements; coffee, tea, hot chocolate products; and Pili nuts and Harvest dates. The company provides its products through wholesale channels, its own website, as well as third-party online channels. Laird Superfood, Inc. was founded in 2015 and is headquartered in Sisters, Oregon.",
    "website": "http://lairdsuperfood.com",
    "zipcode": "97759"
  },
  "LW": {
    "city": "Eagle",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Lamb Weston Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "Lamb Weston Holdings, Inc.",
    "state": "ID",
    "summary": "Lamb Weston Holdings, Inc. produces, distributes, and markets value-added frozen potato products worldwide. It operates through four segments: Global, Foodservice, Retail, and Other. The company offers frozen potatoes, sweet potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as various customer labels. The company also offers its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. In addition, it engages in the vegetable and dairy businesses. The company serves retail and foodservice customers; grocery, mass, club, and specialty retailers; and businesses, independent restaurants, regional chain restaurants, and convenience stores, as well as educational institutions. Lamb Weston Holdings, Inc. was founded in 1950 and is headquartered in Eagle, Idaho.",
    "website": "http://www.lambweston.com",
    "zipcode": "83616"
  },
  "LWAY": {
    "city": "Morton Grove",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Lifeway Foods, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Lifeway Foods, Inc.",
    "state": "IL",
    "summary": "Lifeway Foods, Inc. produces and markets probiotic-based products in the United States and internationally. Its primary product is drinkable kefir, a cultured dairy product in various organic and non-organic sizes, flavors, and types, including low fat, non-fat, whole milk, protein, and BioKefir. The company also offers European-style soft cheeses; cream and other products; ProBugs, a line of kefir products designed for children; cupped kefir and Icelandic Skyr, a line of strained kefir and yogurt products; and frozen kefir in soft serve and pint-size containers. It sells its products under the Lifeway and Fresh Made brand names, as well as under private labels on behalf of customers primarily through direct sales force, brokers, and distributors. The company was founded in 1986 and is based in Morton Grove, Illinois.",
    "website": "http://lifewaykefir.com",
    "zipcode": "60053"
  },
  "LWF.F": {
    "city": "Morton Grove",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Lifeway Foods, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "LIFEWAY FOODS INC.",
    "state": "IL",
    "summary": "Lifeway Foods, Inc. produces and markets probiotic-based products in the United States and internationally. Its primary product is drinkable kefir, a cultured dairy product in various organic and non-organic sizes, flavors, and types, including low fat, non-fat, whole milk, protein, and BioKefir. The company also offers European-style soft cheeses; cream and other products; ProBugs, a line of kefir products designed for children; cupped kefir and Icelandic Skyr, a line of strained kefir and yogurt products; and frozen kefir in soft serve and pint-size containers. It sells its products under the Lifeway and Fresh Made brand names, as well as under private labels on behalf of customers primarily through direct sales force, brokers, and distributors. The company was founded in 1986 and is based in Morton Grove, Illinois.",
    "website": "http://lifewaykefir.com",
    "zipcode": "60053"
  },
  "M1KC34.SA": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "MCCORMICK   DRN ED",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MCX.F": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "MCCORMICK + CO.INC. N.VTG",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MCX0.F": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "dr_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "MCCORMICK+CO.INC.  DL-,01",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MIXX": {
    "city": "Scottsdale",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Mix1 Life, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "MIX 1 LIFE INC",
    "state": "AZ",
    "summary": "Mix1 Life, Inc. engages in the development, marketing, and distribution of nutritional supplements in the United States. It offers ready-to-drink protein shakes under the mix1 brand name, which are intended to be consumed as a post work out, snack replacement, meal supplement, or a meal replacement. The company was formerly known as Antaga International Corp and changed its name to Mix 1 Life, Inc. in September 2013. Mix 1 Life, Inc. was founded in 2009 and is based in Scottsdale, Arizona.",
    "website": null,
    "zipcode": "85260"
  },
  "MKC": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "McCormick & Company, Incorporat",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MKC-V": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "McCormick & Company, Incorporat",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MKC.MX": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "mx_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "MCCORMICK & COMPANY INC",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MKC.VI": {
    "city": "Hunt Valley",
    "country": "United States",
    "currency": "EUR",
    "exchange": "VIE",
    "industry": "Packaged Foods",
    "long_name": "McCormick & Company, Incorporated",
    "market": "at_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "MCCORMICK & CO-NON VTG SHRS",
    "state": "MD",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. The company operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as desserts. This segment markets its products under the McCormick, French, Frank's RedHot, Lawry's, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, and Drogheria & Alimentari, and Vahiné brand names in Europe, the Middle East, and Africa; McCormick and DaQiao brands in China; and McCormick, Aeroplane, and Gourmet Garden brand names in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors or wholesalers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.",
    "website": "http://www.mccormickcorporation.com",
    "zipcode": "21031"
  },
  "MMMB": {
    "city": "East Rutherford",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "MamaMancini's Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "MAMAMANCINI S HLDGS INC",
    "state": "NJ",
    "summary": "MamaMancini's Holdings, Inc. manufactures and distributes prepared, frozen, and refrigerated food products primarily in the United States. The company offers beef and turkey meatballs, meat loaf, chicken, and sausage-related products and pasta entrees with Sauce; and meats and sauces. It also provides ready to serve dinners, single-size pasta bowls, bulk deli, packaged refrigerated, and frozen products. The company sells its products to supermarkets and mass-market retailers, and food retailers and distributors. MamaMancini's Holdings, Inc. was founded in 2010 and is headquartered in East Rutherford, New Jersey.",
    "website": "http://www.mamamancinis.com",
    "zipcode": "07073"
  },
  "MSLP": {
    "city": "Calabasas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "MusclePharm Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "MUSCLE PHARM CORP",
    "state": "CA",
    "summary": "MusclePharm Corporation develops, manufactures, markets, and distributes sports nutrition products and nutritional supplements in the United States and internationally. The company offers a range of powders, capsules, tablets, and gels. Its MusclePharm brand product portfolio include combat protein powder and combat crunch protein bars; essentials supplements, such as a BCAA, creatine, glutamine, carnitine, CLA, fish oil, multi-vitamin, and other products; and non-genetically modified organism sports performance products with organic ingredients, plant-based proteins, and natural caffeine sources for use in the various stages of the workout. The company also provides FitMiss branded sports nutrition products, which are designed and formulated primarily for women lifestyle to cover various needs, including weight management, lean muscle mass, body composition, and general health and wellness; and On-the-Go portfolio of ready to eat products, such as combat crunch, protein crisp, organic protein, and protein cookie. MusclePharm Corporation sells its products to various fitness enthusiasts, such as professional, combat sport, weight training, bodybuilding, running, and various team and individual sports persons. The company was incorporated in 2006 and is headquartered in Calabasas, California.",
    "website": "http://www.musclepharm.com",
    "zipcode": "91302"
  },
  "NA2.F": {
    "city": "Carlsbad",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Natural Alternatives International, Inc.",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "NATURAL ALTERNAT.DL-,01",
    "state": "CA",
    "summary": "Natural Alternatives International, Inc. engages in formulating, manufacturing, and marketing nutritional supplements in the United States and internationally. The company operates in two segments, Private-Label Contract Manufacturing, and Patent and Trademark Licensing. It offers private-label contract manufacturing services to companies that market and distribute vitamins, minerals, herbs, and other nutritional supplements, as well as other health care products. The company also provides strategic partnering services, such as customized product formulation, clinical studies, manufacturing, marketing support, international regulatory and label law compliance, international product registration, packaging in multiple formats and labeling design, scientific research, proprietary ingredients, customer-specific nutritional product formulation, product testing and evaluation, packaging and delivery system design, and regulatory review. In addition, it sells beta-alanine ingredient under the CarnoSyn and SR CarnoSyn names. The company manufactures products in various forms, including capsules, tablets, chewable wafers, and powders. Its private-label contract manufacturing customers include companies that market nutritional supplements through direct sales marketing channels, direct to consumer e-commerce channels, and retail stores. Natural Alternatives International, Inc. was founded in 1980 and is headquartered in Carlsbad, California.",
    "website": "http://www.nai-online.com",
    "zipcode": "92008"
  },
  "NAII": {
    "city": "Carlsbad",
    "country": "United States",
    "currency": "USD",
    "exchange": "NGM",
    "industry": "Packaged Foods",
    "long_name": "Natural Alternatives International, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "Natural Alternatives Internatio",
    "state": "CA",
    "summary": "Natural Alternatives International, Inc. engages in formulating, manufacturing, and marketing nutritional supplements in the United States and internationally. The company operates in two segments, Private-Label Contract Manufacturing, and Patent and Trademark Licensing. It offers private-label contract manufacturing services to companies that market and distribute vitamins, minerals, herbs, and other nutritional supplements, as well as other health care products. The company also provides strategic partnering services, such as customized product formulation, clinical studies, manufacturing, marketing support, international regulatory and label law compliance, international product registration, packaging in multiple formats and labeling design, scientific research, proprietary ingredients, customer-specific nutritional product formulation, product testing and evaluation, packaging and delivery system design, and regulatory review. In addition, it sells beta-alanine ingredient under the CarnoSyn and SR CarnoSyn names. The company manufactures products in various forms, including capsules, tablets, chewable wafers, and powders. Its private-label contract manufacturing customers include companies that market nutritional supplements through direct sales marketing channels, direct to consumer e-commerce channels, and retail stores. Natural Alternatives International, Inc. was founded in 1980 and is headquartered in Carlsbad, California.",
    "website": "http://www.nai-online.com",
    "zipcode": "92008"
  },
  "NBRY": {
    "city": "Houston",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Newberry Specialty Bakers, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "NEWBERRY SPECIALTY BAKERS INC",
    "state": "TX",
    "summary": "Newberry Specialty Bakers, Inc. produces bakery products for grocery stores and food services industry. It offers scones, pastries, brownies, cakes, cheesecakes, cookies, single serves, pies, pie shells, and Latin deserts. Newberry Specialty Bakers, Inc. was formerly known as Coastal Foods, Inc. and changed its name to Newberry Specialty Bakers, Inc. in November 2015. The company was founded in 1990 and is based in Houston, Texas. On July 3, 2018, the voluntary petition of Newberry Specialty Bakers, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on October 13, 2017.",
    "website": null,
    "zipcode": "77032"
  },
  "NDTP": {
    "city": "Cape Coral",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "NDT Pharmaceuticals Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "NDT PHARMACEUTICALS INC",
    "state": "FL",
    "summary": "Mistral Ventures, Inc. develops and acquires the rights to natural medicine formulas for treating specific medical conditions. It offers Breathe Easy for chronic breathing disorders; cold and flu-formula; kidney tonic; and sinus and weight loss formulas. The company's medicines are natural and derived from botanicals and mineral bases. It offers its products in the United States and internationally. The company was incorporated in 2007 and is based in Cape Coral, Florida.",
    "website": null,
    "zipcode": "33914"
  },
  "NGTF": {
    "city": "Tarrytown",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "NightFood Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "NIGHTFOOD HLDGS INC",
    "state": "NY",
    "summary": "NightFood Holdings, Inc., through its subsidiary, NightFood, Inc., manufactures, markets, and distributes snacks for evening consumption in the United States. It provides ice cream products through distributors and non-traditional retailers. The company was founded in 2010 and is based in Tarrytown, New York.",
    "website": "http://www.nightfood.com",
    "zipcode": "10591"
  },
  "NHMD": {
    "city": "Huntington Beach",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Nate's Food Co.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "NATE'S FOODS CO",
    "state": "CA",
    "summary": "Nate's Food Co. manufactures, distributes, and sells ready-to-use pre-mixed pancake and waffle batter products in the United States. It sells its products through its online store, nateshomemade.com. The company was founded in 2014 and is headquartered in Huntington Beach, California.",
    "website": "http://www.natesfoodco.com",
    "zipcode": "92649"
  },
  "NTQ3.F": {
    "city": "The Woodlands",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "RiceBran Technologies",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "RICEBRAN TECHS",
    "state": "TX",
    "summary": "RiceBran Technologies, together with its subsidiaries, operates as a specialty ingredient company. It focuses on producing, processing, and marketing of value-added processing and marketing of healthy, natural, and nutrient dense products derived from rice and other small grains, and by-products created in the milling of these grains. The company converts raw rice bran into stabilized rice bran (SRB) and high value derivative products, including RiBalance, a complete rice bran nutritional package derived from further processing of SRB; RiSolubles, a nutritious carbohydrate and lipid rich fraction of RiBalance; RiFiber, a protein and fiber rich insoluble derivative of RiBalance; and ProRyza products, which includes derivatives composed of protein and protein/fiber blends. Its SRB and derivative products are nutritional and beneficial food products that contain a combination of oil, protein, carbohydrates, vitamins, minerals, fibers, and antioxidants that enhance the nutritional value of consumer products. The company's SRB products are also marketed as feed ingredients in the animal nutrition markets. It serves food and animal nutrition manufacturers, wholesalers, and retailers in the United States and internationally. The company was formerly known as NutraCea and changed its name to RiceBran Technologies in October 2012. RiceBran Technologies was founded in 2000 and is headquartered in The Woodlands, Texas.",
    "website": "http://www.ricebrantech.com",
    "zipcode": "77380"
  },
  "NTQ3.SG": {
    "city": "The Woodlands",
    "country": "United States",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Packaged Foods",
    "long_name": "RiceBran Technologies",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "RiceBran Technologies Registere",
    "state": "TX",
    "summary": "RiceBran Technologies, together with its subsidiaries, operates as a specialty ingredient company. It focuses on producing, processing, and marketing of value-added processing and marketing of healthy, natural, and nutrient dense products derived from rice and other small grains, and by-products created in the milling of these grains. The company converts raw rice bran into stabilized rice bran (SRB) and high value derivative products, including RiBalance, a complete rice bran nutritional package derived from further processing of SRB; RiSolubles, a nutritious carbohydrate and lipid rich fraction of RiBalance; RiFiber, a protein and fiber rich insoluble derivative of RiBalance; and ProRyza products, which includes derivatives composed of protein and protein/fiber blends. Its SRB and derivative products are nutritional and beneficial food products that contain a combination of oil, protein, carbohydrates, vitamins, minerals, fibers, and antioxidants that enhance the nutritional value of consumer products. The company's SRB products are also marketed as feed ingredients in the animal nutrition markets. It serves food and animal nutrition manufacturers, wholesalers, and retailers in the United States and internationally. The company was formerly known as NutraCea and changed its name to RiceBran Technologies in October 2012. RiceBran Technologies was founded in 2000 and is headquartered in The Woodlands, Texas.",
    "website": "http://www.ricebrantech.com",
    "zipcode": "77380"
  },
  "NUTTQ": {
    "city": "Bethesda",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Nutroganics, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "NUTROGANICS INC",
    "state": "MD",
    "summary": "Nutroganics, Inc. focuses on acquiring and operating revenue-generating businesses in the healthy lifestyle space, primarily the nutritional supplement, and natural and organic food industries. The company, through its subsidiary, Silverbow Honey Company, produces, packages, and sells honey products. It sells its products to food manufacturers and national grocery chains under the Silverbow brand and private label brands. Nutroganics, Inc. is based in Bethesda, Maryland. On October 14, 2016, Nutroganics, Inc., along with its affiliates, filed a voluntary petition for liquidation under Chapter 7 in the US Bankruptcy Court for the District of Delaware.",
    "website": null,
    "zipcode": "20817"
  },
  "NUVM": {
    "city": "Lewes",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "NuVim, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "NUVIM INC",
    "state": "DE",
    "summary": "NuVim, Inc. engages in the production, marketing, and distribution of beverage products in the United States. It offers refrigerated dietary supplement beverages in various flavors, including strawberry, vanilla, orange tangerine, and fruit symphony; shelf stable beverages; powdered supplements in vanilla, chocolate, and strawberry flavors; and natural teas and lemonade, such as black tea with lemon, green tea with citrus, and lemonade. The company offers its products under the NuVim and Fruit Symphony names through distributors, supermarkets, and convenience stores, as well as other chains that carry limited items not served by refrigerated distributors. NuVim, Inc. was founded in 1999 and is based in Lewes, Delaware.",
    "website": "http://www.nuvim.com",
    "zipcode": "19958"
  },
  "NUZE": {
    "city": "Plano",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "NuZee, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "NuZee, Inc.",
    "state": "TX",
    "summary": "NuZee, Inc., a specialty coffee company, engages in the manufacture, packing, and sale of single serve coffee and tea bag-style coffee for coffee roasters, store brands, and coffee brands in North America, Japan, Latin America, and South Korea. The company provides its products under Barista, Twin Peaks, and Pine Ranch brands. It serves retail and grocery customers, office, and hospitality sectors. NuZee, Inc. was founded in 2011 and is headquartered in Plano, Texas.",
    "website": "http://www.mynuzee.com",
    "zipcode": "75074"
  },
  "OCBM": {
    "city": "Wellington",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Preferred Commerce, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "PREFERRED COMMERCE INC",
    "state": "FL",
    "summary": "Preferred Commerce, Inc., doing business as Growums, provides children's gardening products and online games. The company's products are designed to help childhood obesity and promote making good nutritional choices. Its garden kits, fun garden characters, games, and social activities help children learn to grow their own vegetables. The company's products are marketed to schools. Preferred Commerce, Inc. also operates Learn2Grow.com that offers plant database and gardening information services to home gardeners. It has approximately 80,000 photos of plants and planting ideas. The company was formerly known as PlantFind.com, Inc. and changed its name to Preferred Commerce, Inc. Preferred Commerce, Inc. was founded in 1999 and is based in Wellington, Florida.",
    "website": "http://www.preferredcommerce.com",
    "zipcode": "33414"
  },
  "PECD": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Pet Ecology Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "PET ECOLOGY BRANDS INC",
    "state": "TX",
    "summary": "Pet Ecology Brands, Inc. engages in the development, manufacture, and marketing of products for pets in the United States. It focuses on lightweight, flushable, and odor free cat litters, as well as offers a line of fat free treats for dogs. The company was founded in 1996 and is based in Dallas, Texas. Pet Ecology Brands, Inc. is in liquidation.",
    "website": null,
    "zipcode": "75234"
  },
  "PLAG": {
    "city": "Flushing",
    "country": "United States",
    "currency": "USD",
    "exchange": "ASE",
    "industry": "Packaged Foods",
    "long_name": "Planet Green Holdings Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Planet Green Holdings Corp.",
    "state": "NY",
    "summary": "Planet Green Holdings Corp., through its subsidiaries, grows, manufactures, and distributes Cyan brick, black, and green tea in China. It also engages in the research, development, manufacture, and sale of chemical products, including formaldehyde, urea formaldehyde adhesive, methylal, ethanol fuel, fuel additives, and clean fuel. In addition, it operates an online demand-side platform, a system that allows buyers of digital advertising inventory to manage multiple advertisement exchange and data exchange through one interface in North America and China. The company was formerly known as American Lorain Corporation and changed its name to Planet Green Holdings Corp. in September 2018. Planet Green Holdings Corp. was incorporated in 1986 and is headquartered in Flushing, New York.",
    "website": "http://www.planetgreenholdings.com",
    "zipcode": "11345"
  },
  "POST": {
    "city": "Saint Louis",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Post Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Post Holdings, Inc.",
    "state": "MO",
    "summary": "Post Holdings, Inc. operates as a consumer packaged goods holding company in the United States and internationally. It operates through five segments: Post Consumer Brands, Weetabix, Foodservice, Refrigerated Retail, and BellRing Brands. The Post Consumer Brands segment manufactures, markets, and sells branded and private label ready-to-eat (RTE) cereal and hot cereal products. The Weetabix segment primarily markets and distributes branded and private label RTE cereal, hot cereals and other cereal-based food products, breakfast drinks, and muesli. The Foodservice segment produces and distributes egg and potato products in the foodservice and food ingredient channels. The Refrigerated Retail segment produces and distributes side dishes, eggs and egg products, cheese, sausages, and other refrigerated products to retail customers. The BellRing Brands segment markets and distributes ready-to-drink (RTD) protein shakes, other RTD beverages, powders, nutrition bars, and supplements. Post Holdings, Inc. sells its products primarily to grocery stores, mass merchandise customers, supercenters, club stores, natural/specialty stores, and drug store customers; military, e-commerce, and foodservice channels; discounters, wholesalers, and convenience stores; foodservice distributors, restaurant chains, and food manufacturers and processors; online and specialty retailers, supplement stores, and distributors; and food ingredient customers. The company was founded in 1895 and is headquartered in St. Louis, Missouri.",
    "website": "http://www.postholdings.com",
    "zipcode": "63144"
  },
  "PPC": {
    "city": "Greeley",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Pilgrim's Pride Corporation",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Pilgrim's Pride Corporation",
    "state": "CO",
    "summary": "Pilgrim's Pride Corporation produces, processes, markets, and distributes fresh, frozen, and value-added chicken and pork products to retailers, distributors, and foodservice operators in the United States, the United Kingdom, Mexico, France, Puerto Rico, the Netherlands, rest of Europe, the Middle East, Asia, and internationally. The company offers fresh chicken and pork products, including pre-marinated or non-marinated refrigerated (nonfrozen) whole or cut-up chickens; frozen whole chickens; breast and mini breast fillets; pork cuts; added value pork and pork ribs; and prepackaged case-ready chickens, such as whole chickens and chicken parts. It also provides prepared chicken products comprising portion-controlled breast fillets, tenderloins and strips, delicatessen products, salads, formed nuggets and patties, and bone-in chicken parts; and exported chicken and pork products primarily consist of whole chickens and chicken parts sold either refrigerated for distributors in the U.S. or frozen for distribution to export markets and primary pork cuts, hog heads, and trotters frozen for distribution to export markets. The company offers its products under the Pilgrim's, Just BARE, Gold'n Pump, Gold Kist, County Pride Chicken, Pierce Chicken, Pilgrim's Mexico, County Post, Savoro, To-Ricos, Del Dia, Moy Park, and O'Kane brands. Pilgrim's Pride Corporation sells its products to the foodservice market principally consists of chain restaurants, food processors, broad-line distributors, and other institutions; and retail market, which comprise primarily grocery store chains, wholesale clubs, and other retail distributors. The company was founded in 1946 and is headquartered in Greeley, Colorado. Pilgrim's Pride Corporation is a subsidiary of JBS S.A.",
    "website": "http://www.pilgrims.com",
    "zipcode": "80634-9038"
  },
  "QEDN": {
    "city": "Manchester",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "QED Connect, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "QED CONNECT INC",
    "state": "NH",
    "summary": "QED Connect, Inc. operates financial news Internet sites. It operates StockProfile.com, an information portal for investors choosing to make their own investment decisions and for companies wishing to reach those investors. The company also operates StockProfileTV.com and SPNewsWire.com sites. In addition, it operates as a Web development and marketing solutions company. The company is headquartered in Manchester, New Hampshire.",
    "website": "http://www.qedconnect.com",
    "zipcode": "03103"
  },
  "RELV": {
    "city": "Chesterfield",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Reliv' International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "RELIV' INTERNATIONAL INC",
    "state": "MO",
    "summary": "Reliv' International, Inc. develops and markets nutritional supplements that address basic nutrition, specific wellness needs, weight management, and sports nutrition. The company's basic nutritional supplements are formulated to provide a balanced and complete level of supplementation for the consumer. Its principal products include Reliv Classic, Reliv Now, Innergize!, and FibRestore along with LunaRich X capsules. The company markets and sells its products through a direct selling system of independent distributors in the United States, Australia, Austria, Canada, France, Germany, Indonesia, Ireland, Malaysia, Mexico, the Netherlands, New Zealand, the Philippines, and the United Kingdom. Reliv' International, Inc. was founded in 1988 and is headquartered in Chesterfield, Missouri.",
    "website": "http://www.reliv.com",
    "zipcode": "63005"
  },
  "RIBT": {
    "city": "The Woodlands",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Packaged Foods",
    "long_name": "RiceBran Technologies",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "RiceBran Technologies",
    "state": "TX",
    "summary": "RiceBran Technologies, together with its subsidiaries, operates as a specialty ingredient company. It focuses on producing, processing, and marketing of value-added processing and marketing of healthy, natural, and nutrient dense products derived from rice and other small grains, and by-products created in the milling of these grains. The company converts raw rice bran into stabilized rice bran (SRB) and high value derivative products, including RiBalance, a complete rice bran nutritional package derived from further processing of SRB; RiSolubles, a nutritious carbohydrate and lipid rich fraction of RiBalance; RiFiber, a protein and fiber rich insoluble derivative of RiBalance; and ProRyza products, which includes derivatives composed of protein and protein/fiber blends. Its SRB and derivative products are nutritional and beneficial food products that contain a combination of oil, protein, carbohydrates, vitamins, minerals, fibers, and antioxidants that enhance the nutritional value of consumer products. The company's SRB products are also marketed as feed ingredients in the animal nutrition markets. It serves food and animal nutrition manufacturers, wholesalers, and retailers in the United States and internationally. The company was formerly known as NutraCea and changed its name to RiceBran Technologies in October 2012. RiceBran Technologies was founded in 2000 and is headquartered in The Woodlands, Texas.",
    "website": "http://www.ricebrantech.com",
    "zipcode": "77380"
  },
  "RTON": {
    "city": "Dallas",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Right On Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "RIGHT ON BRANDS INC",
    "state": "TX",
    "summary": "Right On Brands, Inc., a health and wellness company, manufactures, sells, markets, and retails a line of hemp enhanced snack foods. It offers Humbly Hemp snack bars; Humbly Hemp Sparkling Tea, ENDO Water, a wellness drink; ENDO Drops, a daily cannabidiol supplementation; ENDO Ease, a topical pain relief product; and ENDO Tokes, a pre-rolled CBD flower that comes in the shape of a cigarette. The company was formerly known as HealthTalk Live, Inc. and changed its name to Right On Brands, Inc. in August 2017. Right On Brands, Inc. was incorporated in 2011 and is headquartered in Dallas, Texas.",
    "website": "http://rightonbrands.com",
    "zipcode": "75243"
  },
  "RYNL": {
    "city": "Vernon",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Reynaldo's Mexican Food Company, LLC",
    "market": "us_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "REYNALDOS MEXICAN FOOD CO INC",
    "state": "CA",
    "summary": "Reynaldo's Mexican Food Company, LLC produces and distributes meat and meat products. The company's products include burritos, enchiladas, chorizos, and longanizas; and various types of Mexican style sausages, chicharrones (pork rinds), and desserts, such as flans, rice puddings, and milk gelatins. The company distributes its products in Mexico and the western United States. The company was formerly known as Reynaldo's Food Manufacturer, Inc. Reynaldo's Mexican Food Company, LLC was incorporated in 2006 and is based in Vernon, California.",
    "website": null,
    "zipcode": "90058"
  },
  "S1JM34.SA": {
    "city": "Orrville",
    "country": "United States",
    "currency": "BRL",
    "exchange": "SAO",
    "industry": "Packaged Foods",
    "long_name": "The J. M. Smucker Company",
    "market": "br_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "THE JM SMUCKDRN",
    "state": "OH",
    "summary": "The J. M. Smucker Company manufactures and markets food and beverage products worldwide. It operates in four segments: U.S. Retail Pet Foods, U.S. Retail Coffee, U.S. Retail Consumer Foods, and International and Away From Home. The company offers pet food and snacks; mainstream roast, ground, single serve, and premium coffee; peanut butter and specialty spreads; fruit spreads, shortening and oils, and frozen sandwiches and snacks; and foodservice hot beverage, foodservice portion control, and flour products, as well as dog and cat food, frozen handheld products, portion control products, juices and beverages, and baking mixes and ingredients. It provides its products under the Meow Mix, Kibbles n Bits, 9Lives, Nature's Recipe, Milk-Bone, Pup-Peroni, Rachael Ray Nutrish, Natural Balance, Folgers, Café Bustelo, Dunkin' Donuts, 1850, Jif, Smucker's, Smucker's Uncrustables, Crisco, Robin Hood, and Five Roses brands. The company sells its products through direct sales and brokers to food retailers and wholesalers, club stores, discount and dollar stores, online retailers, pet specialty stores, natural foods stores and distributors, drug stores, military commissaries, and mass merchandisers; and through retail channels, and foodservice distributors and operators. The J. M. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.",
    "website": "http://www.jmsmucker.com",
    "zipcode": "44667-0280"
  },
  "SAFM": {
    "city": "Laurel",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Sanderson Farms, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Sanderson Farms, Inc.",
    "state": "MS",
    "summary": "Sanderson Farms, Inc., an integrated poultry processing company, produces, processes, markets, and distributes fresh, frozen, and prepared chicken products in the United States. The company sells ice-packed, chill-packed, bulk-packed, and frozen chicken primarily under the Sanderson Farms brand name to retailers, distributors, and casual dining operators in the southeastern, southwestern, northeastern, and western United States, as well as to customers who resell frozen chicken into export markets. Its prepared chicken product line includes institutional and consumer packaged partially cooked or marinated chicken items for distributors and food service establishments. Sanderson Farms, Inc. was founded in 1947 and is headquartered in Laurel, Mississippi.",
    "website": "http://www.sandersonfarms.com",
    "zipcode": "39443"
  },
  "SELR": {
    "city": "Del Mar",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Steele Oceanic Corporation",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "STEELE OCEANIC CORP",
    "state": "CA",
    "summary": "Steele Oceanic Corporation focuses on seafood industry. It focuses on purchasing small seafood companies. The company is headquartered in Del Mar, California.",
    "website": null,
    "zipcode": "92014"
  },
  "SENEA": {
    "city": "Marion",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Seneca Foods Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Seneca Foods Corp.",
    "state": "NY",
    "summary": "Seneca Foods Corporation provides packaged fruits and vegetables in the United States and internationally. The company offers canned, frozen, and bottled produce; and snack chips and other food products under the private label, as well as under various national and regional brands that the company owns or licenses, including Seneca, Libby's, Aunt Nellie's, READ, Green Valley, Paradise, Seneca Farms, and CherryMan. It also packs Green Giant, Le Sueur, and other brands of canned vegetables, as well as select Green Giant frozen vegetables for B&G Foods North America under a contract packing agreement. In addition, the company engages in the sale of cans and ends, as well as trucking and aircraft operations. It provides its products to grocery outlets, including supermarkets, mass merchandisers, limited assortment stores, club stores, and dollar stores; and food service distributors, industrial markets, other food packagers, and export customers in 90 countries, as well as federal, state, and local governments for school and other feeding programs. The company was founded in 1949 and is headquartered in Marion, New York.",
    "website": "http://www.senecafoods.com",
    "zipcode": "14505-9751"
  },
  "SENEB": {
    "city": "Marion",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Seneca Foods Corporation",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Seneca Foods Corp.",
    "state": "NY",
    "summary": "Seneca Foods Corporation provides packaged fruits and vegetables in the United States and internationally. The company offers canned, frozen, and bottled produce; and snack chips and other food products under the private label, as well as under various national and regional brands that the company owns or licenses, including Seneca, Libby's, Aunt Nellie's, READ, Green Valley, Paradise, Seneca Farms, and CherryMan. It also packs Green Giant, Le Sueur, and other brands of canned vegetables, as well as select Green Giant frozen vegetables for B&G Foods North America under a contract packing agreement. In addition, the company engages in the sale of cans and ends, as well as trucking and aircraft operations. It provides its products to grocery outlets, including supermarkets, mass merchandisers, limited assortment stores, club stores, and dollar stores; and food service distributors, industrial markets, other food packagers, and export customers in 90 countries, as well as federal, state, and local governments for school and other feeding programs. The company was founded in 1949 and is headquartered in Marion, New York.",
    "website": "http://www.senecafoods.com",
    "zipcode": "14505-9751"
  },
  "SF9.F": {
    "city": "Laurel",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Sanderson Farms, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "SANDERSON FARMS INC. DL 1",
    "state": "MS",
    "summary": "Sanderson Farms, Inc., an integrated poultry processing company, produces, processes, markets, and distributes fresh, frozen, and prepared chicken products in the United States. The company sells ice-packed, chill-packed, bulk-packed, and frozen chicken primarily under the Sanderson Farms brand name to retailers, distributors, and casual dining operators in the southeastern, southwestern, northeastern, and western United States, as well as to customers who resell frozen chicken into export markets. Its prepared chicken product line includes institutional and consumer packaged partially cooked or marinated chicken items for distributors and food service establishments. Sanderson Farms, Inc. was founded in 1947 and is headquartered in Laurel, Mississippi.",
    "website": "http://www.sandersonfarms.com",
    "zipcode": "39443"
  },
  "SJM": {
    "city": "Orrville",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "The J. M. Smucker Company",
    "market": "us_market",
    "market_cap": "Large Cap",
    "sector": "Consumer Defensive",
    "short_name": "J.M. Smucker Company (The) New",
    "state": "OH",
    "summary": "The J. M. Smucker Company manufactures and markets food and beverage products worldwide. It operates in four segments: U.S. Retail Pet Foods, U.S. Retail Coffee, U.S. Retail Consumer Foods, and International and Away From Home. The company offers pet food and snacks; mainstream roast, ground, single serve, and premium coffee; peanut butter and specialty spreads; fruit spreads, shortening and oils, and frozen sandwiches and snacks; and foodservice hot beverage, foodservice portion control, and flour products, as well as dog and cat food, frozen handheld products, portion control products, juices and beverages, and baking mixes and ingredients. It provides its products under the Meow Mix, Kibbles n Bits, 9Lives, Nature's Recipe, Milk-Bone, Pup-Peroni, Rachael Ray Nutrish, Natural Balance, Folgers, Café Bustelo, Dunkin' Donuts, 1850, Jif, Smucker's, Smucker's Uncrustables, Crisco, Robin Hood, and Five Roses brands. The company sells its products through direct sales and brokers to food retailers and wholesalers, club stores, discount and dollar stores, online retailers, pet specialty stores, natural foods stores and distributors, drug stores, military commissaries, and mass merchandisers; and through retail channels, and foodservice distributors and operators. The J. M. Smucker Company was founded in 1897 and is headquartered in Orrville, Ohio.",
    "website": "http://www.jmsmucker.com",
    "zipcode": "44667-0280"
  },
  "SMPL": {
    "city": "Denver",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Packaged Foods",
    "long_name": "The Simply Good Foods Company",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "The Simply Good Foods Company",
    "state": "CO",
    "summary": "The Simply Good Foods Company operates as a consumer packaged food and beverage company in North America and internationally. The company develops, markets, and sells snacks and meal replacements. It offers primarily nutrition bars, ready-to-drink (RTD) shakes, sweet and salty snacks, protein bars, cookies, pizza, protein chips, recipes, and confectionery products, as well as licensed frozen meals under the Atkins, Atkins Endulge, and Quest brand names. The company distributes its products to various retail channels, such as mass merchandise, grocery and drug channels, club stores, convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including atkins.com, questnutrition.com, and amazon.com. The Simply Good Foods Company is headquartered in Denver, Colorado.",
    "website": "http://www.thesimplygoodfoodscompany.com",
    "zipcode": "80202"
  },
  "SOUPQ": {
    "city": "Staten Island",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Soupman, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "SOUPMAN INC",
    "state": "NY",
    "summary": "Soupman, Inc., together with its subsidiaries, manufactures and sells soups in the United States. It markets and sells its products to grocery chains, school systems, and franchisees under The Original Soupman brand name. The company also franchises Original Soupman restaurants and mobile unit; and other high-traffic locations, such as casinos, airports, theme parks, and other tourist locations. It has 9 franchise locations, including co-branded locations. The company was formerly known as Passport Arts, Inc. and changed its name to Soupman, Inc. in January 2011. Soupman, Inc. was founded in 1984 and is based in Staten Island, New York.",
    "website": "http://www.originalsoupman.com",
    "zipcode": "10314"
  },
  "SOWG": {
    "city": "Irving",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Sow Good Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "SOW GOOD INC",
    "state": "TX",
    "summary": "Sow Good Inc. engages in the production of the nutritious products in the freeze-dried food industry in the United States. It also sells freeze dried snacks and smoothies online. The company was formerly known as Black Ridge Oil & Gas, Inc. and changed its name to Sow Good Inc. in January 2021. Sow Good Inc. was founded in 2010 and is based in Irving, Texas.",
    "website": "http://www.thisissowgood.com",
    "zipcode": "75061"
  },
  "SWEE": {
    "city": "Rancho Santa Margarita",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "SweeGen, Inc.",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Defensive",
    "short_name": "SWEEGEN INC",
    "state": "CA",
    "summary": "SweeGen, Inc. develops, produces, and distributes nature-based and non-caloric sweeteners for the food, flavor, and beverage industries. The company was formerly known as Aceway Corp. and changed its name to SweeGen, Inc. in January 2015. SweeGen, Inc. was incorporated in 2013 and is based in Rancho Santa Margarita, California.",
    "website": "http://www.sweegen.com",
    "zipcode": "92688"
  },
  "T4H.F": {
    "city": "Oak Brook",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "TreeHouse Foods, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "TREEHOUSE FOODS  DL-,01",
    "state": "IL",
    "summary": "TreeHouse Foods, Inc. manufactures and distributes private label packaged foods and beverages in the United States and internationally. It operates in two segments, Meal Preparation, and Snacking & Beverages. The Meal Preparation segment provides aseptic cheese and pudding products; baking and mix powders; hot cereals; jams, preserves, and jellies; liquid and powdered non-dairy creamers; macaroni and cheese; mayonnaise; Mexican, barbeque, and other sauces; pastas; pickles and related products; powdered soups and gravies; refrigerated and shelf stable dressings and sauces; refrigerated dough; single serve hot beverages; skillet dinners; and table and flavored syrups. The Snacking & Beverages segment offers bars, broths, candies, cookies, crackers, in-store bakery products, pita chips, powdered drinks, pretzels, ready-to-drink coffee, retail griddle waffles, pancakes, French toasts, specialty teas, and sweeteners. The company sells its products through various distribution channels, including grocery retailers and foodservice distributors, as well as industrial and export, which includes food manufacturers and repackagers of foodservice products. TreeHouse Foods, Inc. was founded in 1862 and is based in Oak Brook, Illinois.",
    "website": "http://www.treehousefoods.com",
    "zipcode": "60523"
  },
  "THS": {
    "city": "Oak Brook",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "TreeHouse Foods, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Treehouse Foods, Inc.",
    "state": "IL",
    "summary": "TreeHouse Foods, Inc. manufactures and distributes private label packaged foods and beverages in the United States and internationally. It operates in two segments, Meal Preparation, and Snacking & Beverages. The Meal Preparation segment provides aseptic cheese and pudding products; baking and mix powders; hot cereals; jams, preserves, and jellies; liquid and powdered non-dairy creamers; macaroni and cheese; mayonnaise; Mexican, barbeque, and other sauces; pastas; pickles and related products; powdered soups and gravies; refrigerated and shelf stable dressings and sauces; refrigerated dough; single serve hot beverages; skillet dinners; and table and flavored syrups. The Snacking & Beverages segment offers bars, broths, candies, cookies, crackers, in-store bakery products, pita chips, powdered drinks, pretzels, ready-to-drink coffee, retail griddle waffles, pancakes, French toasts, specialty teas, and sweeteners. The company sells its products through various distribution channels, including grocery retailers and foodservice distributors, as well as industrial and export, which includes food manufacturers and repackagers of foodservice products. TreeHouse Foods, Inc. was founded in 1862 and is based in Oak Brook, Illinois.",
    "website": "http://www.treehousefoods.com",
    "zipcode": "60523"
  },
  "TLCC": {
    "city": "Boca Raton",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Twinlab Consolidated Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "TWINLAB CONSOLIDATED HOLDINGS I",
    "state": "FL",
    "summary": "Twinlab Consolidated Holdings, Inc., together with its subsidiaries, manufactures, markets, distributes, and retails nutritional supplements and other natural products in the United States and internationally. The company offers vitamins, minerals, specialty supplements, and sports nutrition products under the Twinlab brand; healthy aging and beauty products under the Reserveage Nutrition and ResVitale brands; diet and energy products under the Metabolife and Re-Body brands; and a line of herbal teas under the Alvita brand, as well as joint support products under the Trigosamine brand. It also acts as contract manufacturer for private label customers. The company sells its products in various formulations and delivery forms, including capsules, tablets, softgels, chewables, liquids, sprays, and powders primarily through health and natural food stores, supermarkets, mass market retailers, specialty stores retailers, online retailers, and websites. Twinlab Consolidated Holdings, Inc. is based in Boca Raton, Florida.",
    "website": "http://www.tchhome.com",
    "zipcode": "33431"
  },
  "TOFB": {
    "city": "Cranford",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Tofutti Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "TOFUTTI BRANDS INC",
    "state": "NJ",
    "summary": "Tofutti Brands Inc. engages in the development, production, and marketing of dairy free, vegan frozen desserts, cheeses, and other food products under the TOFUTTI brand in the United States, Europe, the Middle East, the Asia Pacific, Africa, and internationally. It offers frozen desserts, including frozen sandwiches and chocolate-coated crispy cones; bars; dairy free vegan cheese products, such as cream cheese, sour cream, cheese slices, and dairy free ricotta cheese alternatives; spreads; and frozen food products comprising frozen crepes. The company sells its products through independent unaffiliated food brokers to distributors, as well as on a direct basis to retail chain accounts or to warehouse accounts that directly service chain accounts. Tofutti Brands, Inc. was founded in 1981 and is based in Cranford, New Jersey.",
    "website": "http://www.tofutti.com",
    "zipcode": "07016"
  },
  "TQLB": {
    "city": "Wheat Ridge",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Torque Lifestyle Brands, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "TORQUE LIFESTYLE BRANDS INC",
    "state": "CO",
    "summary": "Torque Lifestyle Brands, Inc. develops, manufactures, and markets nutritional supplements for the sports industry in the United States. The company was formerly known as Commodore International Corp. and changed its name to Torque Lifestyle Brands, Inc. in August 2020. The company is headquartered in Wheat Ridge, Colorado.",
    "website": null,
    "zipcode": null
  },
  "TTCF": {
    "city": "Paramount",
    "country": "United States",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Packaged Foods",
    "long_name": "Tattooed Chef, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "Tattooed Chef, Inc.",
    "state": "CA",
    "summary": "Tattooed Chef, Inc., a plant-based food company, produces and sells a portfolio of frozen foods. It supplies plant-based products to retailers in the United States. The company offers ready-to-cook bowls, zucchini spirals, riced cauliflower, acai and smoothie bowls, cauliflower crust pizza, and plant-based burgers. Its products are available in private label and Tattooed Chef brand name in the frozen food section of retail food stores. As of December 31, 2020, it operated 4,300 retail outlets, as well as offers its products through the e-commerce channel. Tattooed Chef, Inc. is headquartered in Paramount, California.",
    "website": "http://www.tattooedchef.com",
    "zipcode": "90723-3750"
  },
  "TWNK": {
    "city": "Lenexa",
    "country": "United States",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Packaged Foods",
    "long_name": "Hostess Brands, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Hostess Brands, Inc.",
    "state": "KS",
    "summary": "Hostess Brands, Inc., a packaged food company, develops, manufactures, markets, sells, and distributes snack products in the United States. The company provides a range of snack cakes, donuts, sweet rolls, breakfast pastries, cookies, snack pies, sweet baked goods, wafers, bread and buns, frozen retail products, danishes, honey buns, coffee cakes, and sugar-free products. It offers its products under the Hostess, Dolly Madison, Cloverhill, Big Texas, Voortman, CupCakes, Twinkies, Donettes, Ding Dongs, Zingers, HoHos, and Big Texas brands. The company was formerly known as Gores Holdings, Inc. and changed its name to Hostess Brands, Inc. in November 2016. Hostess Brands, Inc. was founded in 1919 and is headquartered in Lenexa, Kansas.",
    "website": "http://www.hostessbrands.com",
    "zipcode": "66215"
  },
  "UPDC": {
    "city": "Reno",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "UPD Holding Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "UPD HOLDING CORP",
    "state": "NV",
    "summary": "UPD Holding Corp. operates in the food and beverage industry in the United States. The company offers craft beers under the Record Street brand. It also provides weight loss and weight management products, blend meal replacements, dietary specialty foods, and nutraceuticals through stores and doctor offices under the iMetabolic brand. The company was founded in 2013 and is based in Reno, Nevada.",
    "website": null,
    "zipcode": "89502"
  },
  "UTZ": {
    "city": "Hanover",
    "country": "United States",
    "currency": "USD",
    "exchange": "NYQ",
    "industry": "Packaged Foods",
    "long_name": "Utz Brands, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Utz Brands Inc",
    "state": "PA",
    "summary": "Utz Brands, Inc. manufacturers, markets, and distributes snacking products in the United States. It offers a range of salty snacks, including potato chips, pretzels, cheese snacks, veggie snacks, pork skins, pub/party mixes, and other snacks under the Utz, Zapp's, ON THE BORDER, Golden Flake, Good Health, Boulder Canyon, Hawaiian, and TORTIYAHS brands. The company distributes its products through grocery, mass, club, convenience, drug, and other retailers. The company was formerly known as Collier Creek Holdings and changed its name to Utz Brands, Inc. in August 2020. Utz Brands, Inc. was founded in 1921 and is headquartered in Hanover, Pennsylvania.",
    "website": "http://www.utzsnacks.com",
    "zipcode": "17331"
  },
  "VITX": {
    "city": "Miami",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Vitana-X, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "VITANA-X INC",
    "state": "FL",
    "summary": "Vitana-X Inc. focuses on providing consulting services for business development to assist companies in going public. The company markets its consulting services through word of mouth, and participation in online forums, as well as traditional print media and online publications in Europe. The company was formerly known as GH Capital Inc. and changed its name to Vitana-X Inc. in December 2020. Vitana-X Inc. was founded in 2014 and is based in Miami, Florida.",
    "website": "http://www.ghcapital-inc.com",
    "zipcode": "33131-5324"
  },
  "XGW.F": {
    "city": "Santa Paula",
    "country": "United States",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Packaged Foods",
    "long_name": "Calavo Growers, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Defensive",
    "short_name": "CALAVO GROWERS  DL-,001",
    "state": "CA",
    "summary": "Calavo Growers, Inc. markets and distributes avocados, prepared avocados, and other perishable foods to retail grocery and foodservice customers, club stores, mass merchandisers, food distributors, and wholesale customers worldwide. It operates in three segments: Fresh Products, Calavo Foods, and Renaissance Food Group (RFG). The Fresh products segment distributes avocados and other fresh produce products; and procures avocados grown in California, Mexico, and Peru, as well as various other commodities, including tomatoes and papayas. The Calavo Foods segment is involved in purchasing, manufacturing, and distributing prepared avocado products, including guacamole and salsa. The RFG segment manufactures and distributes fresh-cut fruits and vegetables, fresh prepared entrée salads, wraps, sandwiches, and fresh snacking products, as well as ready-to-heat entrees, other hot bar and various deli items, meals kits and related components, and salad kits. The company offers its products under the Calavo and RFG brands, and related logos; and Avo Fresco, Bueno, Calavo Gold, Calavo Salsa Lisa, Salsa Lisa, Celebrate the Taste, El Dorado, Fresh Ripe, Select, Taste of Paradise, The First Name in Avocados, Tico, Mfresh, Maui Fresh International, Triggered Avocados, ProRipeVIP, RIPE NOW!, Garden Highway Fresh Cut, Garden Highway, and Garden Highway Chef Essentials trademarks. Calavo Growers, Inc. was founded in 1924 and is headquartered in Santa Paula, California.",
    "website": "http://www.calavo.com",
    "zipcode": "93060"
  },
  "YGYI": {
    "city": "Chula Vista",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Youngevity International, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Youngevity International, Inc.",
    "state": "CA",
    "summary": "Youngevity International, Inc. develops and distributes health and nutrition related products and services in the United States and internationally. It operates in three segments: Direct Selling, Commercial Coffee, and Commercial Hemp. The company offers nutritional supplements, gourmet coffee, weight management products, skincare and cosmetics, health and wellness, packaged foods, lifestyle products, pet care, digital products, telecare health services, apparel and fashion accessories, and business lending products. It also produces and sells coffee products under the Café La Rica, Café Alma, Josie's Java House, Javalution Urban Grind, Javalution Daily Grind, and Javalution Royal Roast brands; and produces and markets a line of coffees under the JavaFit brand directly to consumers. In addition, it offers cannabidiol oils from hemp stock. The company sells coffee and equipment to wellness and retirement communities, and various cruise lines and coffee service operators, as well as through distribution network. Youngevity International, Inc. also markets its products through a range of consumer Websites, such as youngevity.com; ygyi.com; heritagemakers.com; hempfx.com; clrroasters.com; cafelarica.com; javalution.com. The company was formerly known as AL International, Inc. and changed its name to Youngevity International, Inc. in July 2013. Youngevity International, Inc. was founded in 1996 and is headquartered in Chula Vista, California.",
    "website": "http://www.ygyi.com",
    "zipcode": "91914"
  },
  "YGYIP": {
    "city": "Chula Vista",
    "country": "United States",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Packaged Foods",
    "long_name": "Youngevity International, Inc.",
    "market": "us_market",
    "market_cap": null,
    "sector": "Consumer Defensive",
    "short_name": "Youngevity International, Inc. ",
    "state": "CA",
    "summary": "Youngevity International, Inc. develops and distributes health and nutrition related products and services in the United States and internationally. It operates in three segments: Direct Selling, Commercial Coffee, and Commercial Hemp. The company offers nutritional supplements, gourmet coffee, weight management products, skincare and cosmetics, health and wellness, packaged foods, lifestyle products, pet care, digital products, telecare health services, apparel and fashion accessories, and business lending products. It also produces and sells coffee products under the Café La Rica, Café Alma, Josie's Java House, Javalution Urban Grind, Javalution Daily Grind, and Javalution Royal Roast brands; and produces and markets a line of coffees under the JavaFit brand directly to consumers. In addition, it offers cannabidiol oils from hemp stock. The company sells coffee and equipment to wellness and retirement communities, and various cruise lines and coffee service operators, as well as through distribution network. Youngevity International, Inc. also markets its products through a range of consumer Websites, such as youngevity.com; ygyi.com; heritagemakers.com; hempfx.com; clrroasters.com; cafelarica.com; javalution.com. The company was formerly known as AL International, Inc. and changed its name to Youngevity International, Inc. in July 2013. Youngevity International, Inc. was founded in 1996 and is headquartered in Chula Vista, California.",
    "website": "http://www.ygyi.com",
    "zipcode": "91914"
  }
}
