{
    "1376.T": {
        "short_name": "KANEKO SEEDS CO",
        "long_name": "Kaneko Seeds Co., Ltd.",
        "summary": "Kaneko Seeds Co., Ltd. engages in the agribusiness in Japan. The company breeds various vegetables, including tomatoes, cabbages, squashes, bulb onions, bunching onions, carrots, lettuces, radishes, cucumber, eggplants, cauliflowers, okras, spinach, rootstocks, and Asian vegetables; and flowers, such as eustoma, delphinium, and limonium. It also sells forage, greening, and various other seeds comprising dent corn, grass, wild flower, etc.; flower seeds, seedlings, bulbs, and plants; and garden supplies consisting of fertilizers, agrichemicals, soil, pots, and tools for personal use. In addition, the company researches and develops virus-free seedlings, propagation technology, and embryo culture; develops and designs hydroponic systems, as well as recycling hydroponic systems; sells greenhouse equipment; develops coated fertilizers; and designs and undertakes greening works, such as landscaping and legal construction. Kaneko Seeds Co., Ltd. was founded in 1895 and is headquartered in Maebashi, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Maebashi",
        "zipcode": "371-8503",
        "website": "http://www.kanekoseeds.jp",
        "market_cap": "Large Cap"
    },
    "4031.T": {
        "short_name": "KATAKURA & CO-OP AGRI CORPORATI",
        "long_name": "Katakura & Co-op Agri Corporation",
        "summary": "Katakura & Co-op Agri Corporation engages in the fertilizer, cosmetic, chemical, feed, real estate, and other businesses in Japan. It offers a range of agricultural materials, including chemical fertilizers and compound fertilizers, soil-friendly organic fertilizers, liquid fertilizers, and microbial materials, as well as soil cultivation products that cultivates seedlings; and silica gel and home gardening fertilizers. The company also supplies chemical products, such as calcium phosphate, calcium carbonate, other feed ingredients; and industrial phosphoric, fertilizer phosphoric, food phosphoric, and sulfuric acids, as well as liquid products and water. In addition, it provides raw materials for maintaining health, such as poultry farming, pig farming, dairy cows, and beef cattle; and owns, operates, and manages real estate properties. Further, the company develops, manufactures, and sells cosmetic raw materials for skin care, hair care, and make-up; and collagen and plant extracted extracts, as well as inorganic materials, including synthetic mica. Additionally, it is involved in the freeze-dried cosmetics contract manufacturing activities. The company also provides physical and chemical analysis of soil and compost; biological analysis; quality analysis of agricultural products; cultivation test; pesticide residue analysis; and DNA analysis services. The company also exports its products. Katakura & Co-op Agri Corporation was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0073",
        "website": "http://www.katakuraco-op.com",
        "market_cap": "Large Cap"
    },
    "4979.T": {
        "short_name": "OAT AGRIO CO LTD",
        "long_name": "OAT Agrio Co., Ltd.",
        "summary": "OAT Agrio Co., Ltd. researches, develops, manufactures, and sells agrochemicals and fertilizers in Japan. The company offers plant protection products and biostimulants. It is also involved in the drug discovery, biological evaluation, formulation development, and pesticide registration activities. The company was formerly known as Otsuka Chemical Co., Ltd. and changed its name to OAT Agrio Co., Ltd. in 2014. OAT Agrio Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0052",
        "website": "http://www.oat-agrio.co.jp",
        "market_cap": "Mid Cap"
    },
    "4992.T": {
        "short_name": "HOKKO CHEMICAL INDUSTRY CO",
        "long_name": "Hokko Chemical Industry Co., Ltd.",
        "summary": "Hokko Chemical Industry Co., Ltd. manufactures and sells crop protection products in Japan. The company operates through Crop Protection Products, Fine Chemicals, and Textile Materials segments. It offers insecticides, fungicides, herbicides, plant growth regulators, and related products; and pharmaceutical and agrochemical intermediates, as well as raw materials for electronics components, catalysts, functional polymers, fine ceramics, preservatives, antifungal agents, and related products. The company also provides industrial textile materials used in automobiles and furniture; and consumer textile materials for bags, shoes, apparel, and other products. It also exports its products. Hokko Chemical Industry Co., Ltd. was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8341",
        "website": "http://www.hokkochem.co.jp",
        "market_cap": "Large Cap"
    },
    "4995.F": {
        "short_name": "SANKEI CHEMICALS CO",
        "long_name": "Sankei Chemical Co., Ltd.",
        "summary": "Sankei Chemical Co., Ltd. manufactures and sells plant protection materials for agricultural products in Japan. It offers insecticides, fungicides, pheromone agents, herbicides, spreading agents, soil fumigants, agricultural materials, pest control agents, and others. The company was formerly known as Kagoshima Kagaku Kogyo Co., Ltd. and changed its name to Sankei Chemical Co., Ltd. in January 1962. Sankei Chemical Co., Ltd. was founded in 1918 and is headquartered in Kagoshima, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kagoshima",
        "zipcode": "891-0122",
        "website": "http://www.sankei-chem.com",
        "market_cap": "Small Cap"
    },
    "4996.T": {
        "short_name": "KUMIAI CHEMICAL INDUSTRY CO",
        "long_name": "Kumiai Chemical Industry Co., Ltd.",
        "summary": "Kumiai Chemical Industry Co., Ltd. manufactures and sells agrochemicals. Its agricultural chemicals comprise herbicides, fungicides, acaricide, microbial pesticide, and PGR; and fine chemicals include chlorotoluenes, chlorobenzyl chlorides, chlorobenzotrichlorides, chlorobenzaldehydes, chlorobenzoyl chlorides, chlorobenzoic acids, phenoxyphenols, and phosphines. The company also offers curing agents. It markets its products in Japan, as well as in approximately 50 countries. The company was formerly known as Ihara Agrochemical Co., Ltd. and changed its name to Kumiai Chemical Industry Co., Ltd. in 1968. Kumiai Chemical Industry Co., Ltd. was founded in 1928 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-8782",
        "website": "http://www.kumiai-chem.co.jp",
        "market_cap": "Large Cap"
    },
    "4997.T": {
        "short_name": "NIHON NOHYAKU CO",
        "long_name": "Nihon Nohyaku Co., Ltd.",
        "summary": "Nihon Nohyaku Co., Ltd. engages in the development, manufacture, import, export, and sale of agrochemicals in Japan and internationally. It offers fungicides, insecticides, and herbicides. The company also offers chemical products for use in home gardening, greenery, and termite applications. In addition, it provides pharmaceuticals and animal health products, including topical anti-fungal agents, such as drugs for athlete's foot, as well as sprays for cow liver illness and fat necrosis treatment, and tick repellents for bees; antibacterial feed additives, pig and chicken growth promotion products, and products for feed efficacy improvement; wood preservatives, industrial chemicals, and other agricultural materials; and landscape work, agrochemical residue analysis, and real estate rental services. The company was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8386",
        "website": "http://www.nichino.co.jp",
        "market_cap": "Large Cap"
    },
    "4998.T": {
        "short_name": "FUMAKILLA LTD",
        "long_name": "Fumakilla Limited",
        "summary": "Fumakilla Limited manufactures, sells, imports, and exports insecticidal, household, gardening, business, and other products worldwide. The company offers insecticides; garden supplies, including fungicides, herbicides, fertilizers, potting soil, pest control agents, and other horticultural products; and household goods, such as pollen, house dust measure, insect repellent, dehumidifier, and other home care products. It also provides pest control products for stores, factories, and restaurants for business and industry uses. The company was formerly known as Oshimo Kaishundo and changed its name to Fumakilla Limited in 1962. Fumakilla Limited was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8606",
        "website": "http://www.fumakilla.co.jp",
        "market_cap": "Large Cap"
    }
}