{
    "1971.T": {
        "short_name": "CHUO BUILD INDUSTRY CO",
        "long_name": "Chuo Build Industry Co., Ltd.",
        "summary": "Chuo Build Industry Co., Ltd. engages in the production, sale, and rental of temporary equipment for civil engineering and construction industry in China. It offers framework scaffoldings, single pipe scaffolds and parts, rolling towers, aluminum sky guards, suspension scaffoldings, steel scaffolding boards, etc.; and mobile indoor scaffoldings, shuttering systems, construction scaffold frames, Al Column, Al props, beam brackets, building frames, steel stepladders and cart horse products, aluminum load receiving beams, hanging scaffoldings, stairs/handrails, and wedge tightening scaffolds. The company also provides steel clamps/stanions, flying shore systems, corner guards, jack support products, nursing frames/ vertical dumplings, DS hanger stages, fall prevention products, multi truss products, single tubes/clamps, Karaman chains/chain clamps, and wall ties/floor plates. In addition, it processes and sells residential steel products. The company was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0006",
        "website": "http://www.chuo-build.co.jp",
        "market_cap": "Small Cap"
    },
    "3157.T": {
        "short_name": "JUTEC HOLDINGS CORPORATION",
        "long_name": "JUTEC Holdings Corporation",
        "summary": "JUTEC Holdings Corporation, through its subsidiaries, sells building materials in Japan. It also engages in building and renovating homes; and provides support for cloud-based IT systems and logistics. The company was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.jutec-hd.jp",
        "market_cap": "Large Cap"
    },
    "5011.T": {
        "short_name": "NICHIREKI CO LTD",
        "long_name": "Nichireki Co., Ltd.",
        "summary": "Nichireki Co., Ltd. manufactures and sells various paving materials primarily in Japan. Its primary products include various types of asphalt emulsions used in constructing and recycling road paving; and various modified asphalts. The company also offers bridge waterproofing materials, crack sealing materials, pothole filling materials, surface level correcting materials, landscape materials, waterproof materials for bridge decks, cement concrete materials, crack repairing materials, mixtures for pavement, and pavement supplementary materials. In addition, it provides special materials, such as airfield aprons, railway tracks primarily for high speed trains, agricultural watercourses, dams, rivers, sewers, reservoirs, and tank base foundations, as well as offers jointing and grouting materials. Further, the company provides roads and paving maintenance and management services. Nichireki Co., Ltd. was founded in 1943 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8222",
        "website": "http://www.nichireki.co.jp",
        "market_cap": "Large Cap"
    },
    "5232.T": {
        "short_name": "SUMITOMO OSAKA CEMENT CO",
        "long_name": "Sumitomo Osaka Cement Co., Ltd.",
        "summary": "Sumitomo Osaka Cement Co., Ltd. engages in the cement production business in Japan and internationally. The company's Cement segment offers assorted cement, ready-mix concrete, and cement-related solidification materials; supplies electrical power; and recycles raw materials and fuels. Its Mineral Resources segment supplies limestone to the steel, chemical, and cement industries, as well as electric power companies; calcium carbonate powder for thermal power stations; aggregates for cement and civil engineering; limestone and silica powder for flue-gas desulfurization or construction materials; and dolomite, slag, etc. for steel, construction materials, fertilizers, paper, and ready mixed concrete. This segment also exports its products to Taiwan and South Korea, as well as countries in Southeast Asia. The company's Cement-Related Products segment manufactures and sells repairing and reinforcing products for concrete structures. It is also involved in the development of materials for coping with heavy metal pollution; protection for concrete structures; and artificial marine reefs. Its Optoelectronics segment manufactures and sells optical communications devices and components, optical measurement equipment, and optical transceivers. The company's Advanced Materials segment offers ceramic components for semiconductor manufacturing equipment; nanoparticle materials; antibacterial agents; cosmetics; and functional paints. Its Battery Materials segment provides rechargeable battery cathode materials. The company's Other segment leases real estate properties; provides engineering services; and develops software. Sumitomo Osaka Cement Co., Ltd. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8465",
        "website": "http://www.soc.co.jp",
        "market_cap": "Large Cap"
    },
    "5233.T": {
        "short_name": "TAIHEIYO CEMENT CORP",
        "long_name": "Taiheiyo Cement Corporation",
        "summary": "Taiheiyo Cement Corporation engages in cement, mineral resources, environmental, and construction materials businesses in Japan and internationally. The company's Cement segment offers ordinary Portland cement, specialty cement, soil stabilizers, and ready-mixed concrete. Its Mineral Resources segment sells limestone aggregate products comprising course and fine aggregate used in ready-mixed concrete, and aggregate used in concrete products and civil engineering; sandstone and andesite as aggregate materials; quicklime, slaked lime, filler, silica, and silica powder; and hollow ceramics, sepiolite, wollastonite, and kaolin, as well as recycles surplus construction soil. The company's Environmental segment recycles used tires, waste plastics, paper sludge, waste casting sand, other industrial waste, surplus soil from water purification, sewage sludge, dredging sludge, and other wastes discarded from municipalities, as well as engages in the CFC treatment and building waste treatment plants; develops and commercializes environmental recycling technologies, including ash washing system and applied kiln system; supplies flue gas desulfurization materials, such as calcium carbonate to coal-fired power plants; and sells slag powder and other inorganic materials, coal, heavy oil, and other fuels, as well as chemicals and gypsum. Its Construction Materials segment produces precast concrete products; promenades, interlocking blocks, and concrete housing products; acoustic panels used to reduce construction noise; and fireproof covering materials used in tunnels. The company's Other Businesses segment leases land for office buildings, commercial stores, leisure facilities, distribution warehouses, and other structures, as well as develops land for residential housing; and engages in data processing, transportation and warehouse, engineering, chemical products, and sports businesses. Taiheiyo Cement Corporation was founded in 1881 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8503",
        "website": "http://www.taiheiyo-cement.co.jp",
        "market_cap": "Large Cap"
    },
    "5282.T": {
        "short_name": "GEOSTR CORP",
        "long_name": "GEOSTR Corporation",
        "summary": "GEOSTR Corporation engages in the manufacture and sale of precast concrete products for civil engineering in Japan. The company offers shield tunnels, precast box and arch culverts, earthquake-resistant response precast culverts, pavements, mountain tunnels, bridges, retaining walls, precast piers, precast seawalls and guard fences, concrete slabs, tunnel linings, precast PV and RC pavements, precast concreate panels, and precast tunnels. Its products are used in construction of roads, railroads, water supply and sewage systems, river/waterways, electricity/gas/utility tunnels, reservoirs/ponds, dams, harbors, airports, and defense projects. The company was formerly known as Nippon Concrete Industries Co., Ltd. and changed its name to GEOSTR Corporation in July 1994. GEOSTR Corporation was founded in 1958 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-0002",
        "website": "http://www.geostr.co.jp",
        "market_cap": "Large Cap"
    },
    "5283.T": {
        "short_name": "TAKAMISAWA CO",
        "long_name": "Takamisawa Co., Ltd.",
        "summary": "Takamisawa Co., Ltd. manufactures and sells secondary concrete products, ready-mixed concrete, gravel, sand, cement, and other construction materials in Japan. The company also sells petroleum products; sells and maintains automobiles; undertakes civil engineering contracting and construction works; and transports freight cars. In addition, it is involved in the general waste/industrial waste treatment/disposal; construction demolition work and its collection/transportation; real estate sales/intermediation and management; non-life insurance agency; and golf range management businesses. Further, the company sells fruits, vegetables, and fertilizers; processes and sells food products and cheeses; imports and sells corncobs; and produces and sells mineral water and confectionery products. The company was founded in 1951 and is headquartered in Nagano, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagano",
        "zipcode": "380-0813",
        "website": "http://www.kk-takamisawa.co.jp",
        "market_cap": "Mid Cap"
    },
    "5284.T": {
        "short_name": "YAMAU HOLDINGS CO LTD",
        "long_name": "Yamau Holdings Co., Ltd.",
        "summary": "Yamau Holdings Co., Ltd. manufactures, engineers, and sells concrete products in Japan. The company develops, sells, and maintains information devices; and sells environment-related products. It also engages in the manufacture, construction, and maintenance of water gates and dams; general civil engineering works; and inspection, investigation, and repair of concrete structures, as well as sale of reinforcement materials. In addition, the company is involved in the provision of geological survey and design activities; and construction of steel gates and structures. Yamau Holdings Co., Ltd. was founded in 1953 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "810-0073",
        "website": "http://www.yamau-holdings.co.jp/company",
        "market_cap": "Mid Cap"
    },
    "5288.T": {
        "short_name": "ASIA PILE HOLDINGS CORPORATION",
        "long_name": "Asia Pile Holdings Corporation",
        "summary": "Asia Pile Holdings Corporation, through its subsidiaries, operates as a general foundation construction company in Asia. The company engages in the manufacture, installation, and sale of precast concrete piles, steel pipe piles, and cast-in-place piles. The company was formerly known as Japan Pile Corporation and changed its name to Asia Pile Holdings Corporation in October 2015. The company was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0015",
        "website": "http://www.asiapile-hd.com",
        "market_cap": "Large Cap"
    },
    "5290.T": {
        "short_name": "VERTEX CORPORATION",
        "long_name": "Vertex Corporation",
        "summary": "Vertex Corporation manufactures and sells concrete secondary products. The company was founded in 2018 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0083",
        "website": "http://www.vertex-grp.co.jp",
        "market_cap": "Large Cap"
    },
    "5352.T": {
        "short_name": "KROSAKI HARIMA CORP",
        "long_name": "Krosaki Harima Corporation",
        "summary": "Krosaki Harima Corporation, together with its subsidiaries, manufactures and sells refractory and ceramic products in Japan and internationally. Its refractory products include blast furnace, hot store, coke oven, torpedo ladle, oxygen converter, secondary refining furnace, steel ladle, and continuous casting refractories, as well as unshaped and functional refractories, and refractories for kilns; and industrial furnaces comprising heating furnaces, incinerators, etc. The company also provides fine ceramics that are used in the manufacturing processes of semiconductors, measurement devices, and satellites; NEXCERA, a low thermal expansion ceramic material used in the manufacturing processes of communications devices, home appliances, automobiles, and other products; Platect, a thermal ceramic for use in thermal insulation materials, heaters, landscape bricks, etc.; and high performance thermal insulation WDS. In addition, it is involved in the furnace construction and maintenance activities. The company serves iron and steel, materials, and cement sectors, as well as incinerators and power plants. The company was formerly known as Kurosaki Refractories Co.,Ltd. and changed its name to Krosaki Harima Corporation in April 2000. Krosaki Harima Corporation was founded in 1918 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "806-8586",
        "website": "http://www.krosaki.co.jp",
        "market_cap": "Large Cap"
    },
    "5357.T": {
        "short_name": "YOTAI REFRACTORIES CO",
        "long_name": "Yotai Refractories Co., Ltd.",
        "summary": "Yotai Refractories Co., Ltd. manufactures and sells refractories and ceramics in Japan. The company also provides engineering services related to refractories business. Its refractories are used in steel, cement, non-ferrous, glass, environment, chemistry, lime, and carbon black industries, as well as used in various electronic parts, such as smartphones, personal computers, cars, and televisions. The company was formerly known as Osaka Yogyo Fire Brick Co., Ltd. and changed its name to Yotai Refractories Co., Ltd. in June 1987. Yotai Refractories Co., Ltd. was founded in 1936 and is headquartered in Kaizuka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kaizuka",
        "zipcode": "597-0093",
        "website": "http://www.yotai.co.jp",
        "market_cap": "Large Cap"
    },
    "5363.T": {
        "short_name": "TYK CORPORATION",
        "long_name": "TYK Corporation",
        "summary": "TYK Corporation engages in the development, production, and sale of refractory bricks primarily for use in steel making worldwide. It also offers fine ceramics, including metal matrix composites; and porcelain products and construction materials for aesthetic purposes. In addition, the company provides refractory products for converters, secondary refining, gas blowing, flow control system, pig iron making, continuous casting, cement and lime kiln, incineration and industrial furnace, and refactory engineering. Further, the company offers bricks for pig iron ladles, precast blocks, lance pipes, tuyere sleeves for blast furnace, and auxiliary machinery and equipment; and advanced materials, such as fine ceramics, abrasion-resistant materials, composite material, ceramic sensors, carbon sheets, brake material, and ceramic filter. Additionally, it provides analytical testing and engine test bench services. TYK Corporation was founded in 1947 and is headquartered in Minato, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Minato",
        "zipcode": "108-005",
        "website": "http://www.tyk.co.jp",
        "market_cap": "Large Cap"
    },
    "5387.T": {
        "short_name": "CHIYODA UTE CO LTD",
        "long_name": "Chiyoda Ute Co., Ltd.",
        "summary": "Chiyoda Ute Co., Ltd., together with its subsidiaries, develops, manufactures, and sells building materials in Japan. The company primarily offers gypsum boards. It also provides high function products, general wall and ceiling boards, and other related products. The company was formerly known as Chiyoda Building Materials Industry Co. Ltd. and changed its name to Chiyoda Ute Co., Ltd. in 1990. Chiyoda Ute Co., Ltd. was founded in 1948 and is headquartered in Mie-gun, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Mie",
        "zipcode": "510-8570",
        "website": "http://www.chiyoda-ute.co.jp",
        "market_cap": "Mid Cap"
    },
    "5388.T": {
        "short_name": "KUNIMINE INDUSTRIES CO",
        "long_name": "Kunimine Industries Co., Ltd.",
        "summary": "Kunimine Industries Co., Ltd. engages in the mining, manufacture, and sale of bentonite, and related equipment and materials in Japan. The company is involved in extraction, processing, and sale of rocks and clay; and manufacturing, processing, and sale of inorganic and organic industrial chemicals, agricultural chemicals, medicines, quasi-drugs, and drugs intended for animal use. It also engages in manufacturing, processing, and sale of food, food additives, feed, and feed additives; and designing, constructing, and operating plants related to powder and granular material equipment, molding devices and civil engineering equipment, etc.; and manufacturing and sale of related equipment and materials. In addition, the company manufactures and sells water and waste water/sewage treatment agents, and bentonite-based products for castings, civil engineering and construction, toilet sand for pets, and waste disposal; and procures and supplies mud conditioning materials, conducts various studies and analyses related to bentonite, and constructs and operates treatment equipment. Kunimine Industries Co., Ltd. was incorporated in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0032",
        "website": "http://www.kunimine.co.jp",
        "market_cap": "Large Cap"
    },
    "6173.T": {
        "short_name": "AQUALINE LTD",
        "long_name": "Aqualine Ltd.",
        "summary": "Aqualine Ltd. provides emergency repair services for water supply products to individual and corporate clients in Japan. It offers a range of services, including unclogging blocks in toilets, kitchens, washrooms, and bathrooms; repairing leaks; selling water supply products; pipe-laying within homes and apartments; and renovating water supply systems, as well as customer-oriented services, such as dedicated customer call centers and on-site customer visits. The company also provides mineral water under the aqua-aqua brand name; and water dispenser services. Aqualine Ltd. was founded in 1995 and is based in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": "730-0012",
        "website": "http://www.aqualine.jp",
        "market_cap": "Small Cap"
    },
    "7461.T": {
        "short_name": "KIMURA CO LTD",
        "long_name": "Kimura Co.,Ltd.",
        "summary": "Kimura Co.,Ltd. engages in the wholesale of housing materials. It is also involved in leasing and sale of real estate properties; management of home improvement centers; and the renting and assembly of scaffolding materials for construction and renovation of houses. In addition, the company engages in the glass, sash, and joinery construction activities. The company was founded in 1946 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "060-8576",
        "website": "http://www.kimuranet.jp",
        "market_cap": "Mid Cap"
    },
    "8007.T": {
        "short_name": "TAKASHIMA & CO",
        "long_name": "Takashima & Co., Ltd.",
        "summary": "Takashima & Co., Ltd. operates as a trading company in Japan. The company's Construction Supply Division provides energy and insulation solutions; construction materials for the use in civil works and construction supply; and housing materials, as well as construction and fabrication services for residential materials, equipment, and interior related needs. Its Industrial Materials Division offers a range of services from planning to operation in the promotion of energy saving, such as LED lighting renovation and installing EV chargers in parking for commercial facilities; designs and develops interior materials; provides composite molded plastic products and sub materials; and offers OEM and ODM related design and production procurement services. This division also engages in the manufacture, construction, and maintenance of sheet houses and other membrane structures; provision of buffering materials, and specialized containers used in the medical field; and rental and sale of collaborative robots. The company was formerly known as Takashimaya Kogyou Co., Ltd. and changed its name to Takashima & Co., Ltd. in 1949. Takashima & Co., Ltd. was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8118",
        "website": "http://www.tak.co.jp",
        "market_cap": "Mid Cap"
    },
    "8104.T": {
        "short_name": "KUWAZAWA HOLDINGS CORPORATION",
        "long_name": "KUWAZAWA Holdings Corporation",
        "summary": "KUWAZAWA Holdings Corporation operates as a construction materials trading company in Japan. It offers basic materials, such as cement, ready-mixed concretes, and concrete piles; civil engineering materials; water supply, agriculture, sewage products, including PVC pipes, RCP pipes, cast iron pipes, valve joints, etc.; guard fences, net fences, railings, and composite fences joints; sealing materials, artificial grasses, and vegetation mats; underdrain drain pipes and various types of poly double pipes and telecommunications pipes; road and park materials; and disaster prevention materials. The company also provides fence construction and roofing materials; steel products, such as deformed bar steel, general shape steel, steel pipe proof, steel sheet pile, steel pipe, sheet pile, tie rod, surface treated steel plate, wire rod, and non-ferrous products; gypsum board, plywood, decorative wall material, laminated wood, and plasterboard products; and siding, die light, and structural insulation board products. In addition, it is involved in the pile and demolition works; and flooring works. Further, the company offers interior fittings housing equipment, and electrification equipment consisting of electric water heaters; eco cute products; oil panel, storage floor, and electric floor heaters; electric boilers; and heat pump heating equipment. The company was formerly known as KUWAZAWA Trading Co.,Ltd. and changed its name to KUWAZAWA Holdings Corporation in September 2020. KUWAZAWA Holdings Corporation was founded in 1933 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "003-8560",
        "website": "http://www.kuwazawa-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "9812.T": {
        "short_name": "T.O.HOLDINGS CO LTD",
        "long_name": "T.O. Holdings CO.,LTD.",
        "summary": "T.O. Holdings Co.,Ltd., through its subsidiaries, engages in the distribution of clothing, furniture, home appliances, household appliances, mobile phone agency, and credit card business in Japan and internationally. It also offers consumer loans; sells DIY supplies and groceries; sells DVD / CD rentals, books/magazines, etc.; constructs and sells detached houses, condominiums, and residential land; and sells timber and building materials. In addition, the company is involved in the civil engineering, pavement, and construction works, such as buildings and commercial facilities; leasing business of land and buildings, comprising of condominiums, detached houses, offices, warehouses, etc.; automobile sales and automobile repair business; and operation of sports clubs and swimming schools. Further, it engages in the provision of fire and automobile insurance, non-life insurance agency business, life insurance business, and leasing business, as well as care service business, such as housing for the elderly with services and daycare. The company was formerly known as T.O. Ogasawara Co., Ltd. and changed its name to T.O. Holdings Co.,Ltd. in June 2017. T.O. Holdings Co.,Ltd. was founded in 1950 and is headquartered in Hakodate, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hakodate",
        "zipcode": "041-8610",
        "website": "http://www.tohd.co.jp",
        "market_cap": "Mid Cap"
    },
    "N3A.F": {
        "short_name": "NIPPON AQUA CO. LTD.",
        "long_name": "Nippon Aqua Co., Ltd.",
        "summary": "Nippon Aqua Co., Ltd. manufactures and sells building materials in Japan. It offers energy-saving products, such as AQUA FOAM, an on-site spray polyurethane foam insulation material; heat insulating sheets; spacers; A1 and B type insulation materials; and AQUA FOAM NEO materials. The company also develops, manufactures, and sells merchandise related for energy saving housing. It offers its products for detached houses and buildings. The company was founded in 2004 and is headquartered in Tokyo, Japan. Nippon Aqua Co., Ltd. is a subsidiary of Hinokiya Group Co.,Ltd.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.n-aqua.jp",
        "market_cap": "Small Cap"
    },
    "SU2.F": {
        "short_name": "SUMITOMO OSAKA CEM.",
        "long_name": "Sumitomo Osaka Cement Co., Ltd.",
        "summary": "Sumitomo Osaka Cement Co., Ltd. engages in the cement production business in Japan and internationally. The company's Cement segment offers assorted cement, ready-mix concrete, and cement-related solidification materials; supplies electrical power; and recycles raw materials and fuels. Its Mineral Resources segment supplies limestone to the steel, chemical, and cement industries, as well as electric power companies; calcium carbonate powder for thermal power stations; aggregates for cement and civil engineering; limestone and silica powder for flue-gas desulfurization or construction materials; and dolomite, slag, etc. for steel, construction materials, fertilizers, paper, and ready mixed concrete. This segment also exports its products to Taiwan and South Korea, as well as countries in Southeast Asia. The company's Cement-Related Products segment manufactures and sells repairing and reinforcing products for concrete structures. It is also involved in the development of materials for coping with heavy metal pollution; protection for concrete structures; and artificial marine reefs. Its Optoelectronics segment manufactures and sells optical communications devices and components, optical measurement equipment, and optical transceivers. The company's Advanced Materials segment offers ceramic components for semiconductor manufacturing equipment; nanoparticle materials; antibacterial agents; cosmetics; and functional paints. Its Battery Materials segment provides rechargeable battery cathode materials. The company's Other segment leases real estate properties; provides engineering services; and develops software. Sumitomo Osaka Cement Co., Ltd. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8465",
        "website": "http://www.soc.co.jp",
        "market_cap": "Small Cap"
    },
    "THYCF": {
        "short_name": "TAIHEIYO CEMENT CORP",
        "long_name": "Taiheiyo Cement Corporation",
        "summary": "Taiheiyo Cement Corporation engages in cement, mineral resources, environmental, and construction materials businesses in Japan and internationally. The company's Cement segment offers ordinary Portland cement, specialty cement, soil stabilizers, and ready-mixed concrete. Its Mineral Resources segment sells limestone aggregate products comprising course and fine aggregate used in ready-mixed concrete, and aggregate used in concrete products and civil engineering; sandstone and andesite as aggregate materials; quicklime, slaked lime, filler, silica, and silica powder; and hollow ceramics, sepiolite, wollastonite, and kaolin, as well as recycles surplus construction soil. The company's Environmental segment recycles used tires, waste plastics, paper sludge, waste casting sand, other industrial waste, surplus soil from water purification, sewage sludge, dredging sludge, and other wastes discarded from municipalities, as well as engages in the CFC treatment and building waste treatment plants; develops and commercializes environmental recycling technologies, including ash washing system and applied kiln system; supplies flue gas desulfurization materials, such as calcium carbonate to coal-fired power plants; and sells slag powder and other inorganic materials, coal, heavy oil, and other fuels, as well as chemicals and gypsum. Its Construction Materials segment produces precast concrete products; promenades, interlocking blocks, and concrete housing products; acoustic panels used to reduce construction noise; and fireproof covering materials used in tunnels. The company's Other Businesses segment leases land for office buildings, commercial stores, leisure facilities, distribution warehouses, and other structures, as well as develops land for residential housing; and engages in data processing, transportation and warehouse, engineering, chemical products, and sports businesses. Taiheiyo Cement Corporation was founded in 1881 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8503",
        "website": "http://www.taiheiyo-cement.co.jp",
        "market_cap": "Mid Cap"
    },
    "THYCY": {
        "short_name": "TAIHEIYO CEMENT CORP",
        "long_name": "Taiheiyo Cement Corporation",
        "summary": "Taiheiyo Cement Corporation engages in cement, mineral resources, environmental, and construction materials businesses in Japan and internationally. The company's Cement segment offers ordinary Portland cement, specialty cement, soil stabilizers, and ready-mixed concrete. Its Mineral Resources segment sells limestone aggregate products comprising course and fine aggregate used in ready-mixed concrete, and aggregate used in concrete products and civil engineering; sandstone and andesite as aggregate materials; quicklime, slaked lime, filler, silica, and silica powder; and hollow ceramics, sepiolite, wollastonite, and kaolin, as well as recycles surplus construction soil. The company's Environmental segment recycles used tires, waste plastics, paper sludge, waste casting sand, other industrial waste, surplus soil from water purification, sewage sludge, dredging sludge, and other wastes discarded from municipalities, as well as engages in the CFC treatment and building waste treatment plants; develops and commercializes environmental recycling technologies, including ash washing system and applied kiln system; supplies flue gas desulfurization materials, such as calcium carbonate to coal-fired power plants; and sells slag powder and other inorganic materials, coal, heavy oil, and other fuels, as well as chemicals and gypsum. Its Construction Materials segment produces precast concrete products; promenades, interlocking blocks, and concrete housing products; acoustic panels used to reduce construction noise; and fireproof covering materials used in tunnels. The company's Other Businesses segment leases land for office buildings, commercial stores, leisure facilities, distribution warehouses, and other structures, as well as develops land for residential housing; and engages in data processing, transportation and warehouse, engineering, chemical products, and sports businesses. Taiheiyo Cement Corporation was founded in 1881 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8503",
        "website": "http://www.taiheiyo-cement.co.jp",
        "market_cap": "Mid Cap"
    },
    "TIE.F": {
        "short_name": "TAIHEIYO CEMENT",
        "long_name": "Taiheiyo Cement Corporation",
        "summary": "Taiheiyo Cement Corporation engages in cement, mineral resources, environmental, and construction materials businesses in Japan and internationally. The company's Cement segment offers ordinary Portland cement, specialty cement, soil stabilizers, and ready-mixed concrete. Its Mineral Resources segment sells limestone aggregate products comprising course and fine aggregate used in ready-mixed concrete, and aggregate used in concrete products and civil engineering; sandstone and andesite as aggregate materials; quicklime, slaked lime, filler, silica, and silica powder; and hollow ceramics, sepiolite, wollastonite, and kaolin, as well as recycles surplus construction soil. The company's Environmental segment recycles used tires, waste plastics, paper sludge, waste casting sand, other industrial waste, surplus soil from water purification, sewage sludge, dredging sludge, and other wastes discarded from municipalities, as well as engages in the CFC treatment and building waste treatment plants; develops and commercializes environmental recycling technologies, including ash washing system and applied kiln system; supplies flue gas desulfurization materials, such as calcium carbonate to coal-fired power plants; and sells slag powder and other inorganic materials, coal, heavy oil, and other fuels, as well as chemicals and gypsum. Its Construction Materials segment produces precast concrete products; promenades, interlocking blocks, and concrete housing products; acoustic panels used to reduce construction noise; and fireproof covering materials used in tunnels. The company's Other Businesses segment leases land for office buildings, commercial stores, leisure facilities, distribution warehouses, and other structures, as well as develops land for residential housing; and engages in data processing, transportation and warehouse, engineering, chemical products, and sports businesses. Taiheiyo Cement Corporation was founded in 1881 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "112-8503",
        "website": "http://www.taiheiyo-cement.co.jp",
        "market_cap": "Mid Cap"
    }
}