{
    "3405.T": {
        "short_name": "KURARAY CO",
        "long_name": "Kuraray Co., Ltd.",
        "summary": "Kuraray Co., Ltd. engages in resins, chemicals, fibers, and others businesses worldwide. The company's Vinyl Acetate segment offers polyvinyl alcohol (PVA) resins for paper/fiber processing agents, adhesives, and stabilizers; optical-use PVA films for liquid crystal displays and others; water-soluble PVA films for detergents and others; PVB film and Ionoplast interlayer for safety glass; EVOH resins for food packaging, automotive fuel tanks, stain-resistant wallpaper, vacuum insulation panels, and others; EVAL, a food packaging materials; and PLANTIC, a bio-based barrier material for food packaging materials. Its Isoprene segment produces isoprene chemicals; thermoplastic elastomers; heat-resistant polyamide resins; liquid rubber as additive agent for automobile tires and others; and acrylic thermoplastic elastomers. The company's Functional Materials segment offers methacrylic resins for LCDs, automobile parts, signboards, construction materials, and others; dental materials; and activated carbons. Its Fibers and Textile segment provides man made leather products; PVA fibers, which are reinforcing materials for cement, concrete, automotive brake hoses, and others; non-woven fabrics for everyday goods, industrial products, and others; hook and loop fasteners for clothing, sporting goods, industrial materials, and others; and polyarylate fibers for aerospace, composites, electronic components, ropes, sporting goods, and others. The company's Trading segment engages in the import, export, and wholesale of resin and chemical products. Its Others segment offers membranes and liquid crystalline polymer films. This segment also engages in water purification, wastewater treatment, ballast water management system, and other businesses. In addition, the company provides yarn and fabric for clothing and materials, sportswear, uniforms, and others. Kuraray Co., Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8115",
        "website": "http://www.kuraray.co.jp",
        "market_cap": 382787420160
    },
    "3407.T": {
        "short_name": "ASAHI KASEI CORP",
        "long_name": "Asahi Kasei Corporation",
        "summary": "Asahi Kasei Corporation manufactures, processes, and sells chemical products in Japan and internationally. The company operates through three segments: Material, Homes, and Health Care. It offers cupro fiber, lining fabric, stretch fiber, spunbond nonwoven, cupro nonwoven fabric, microfiber suede, oil-water separator, multifunctional nonwoven, deodorizing nonwoven, heat-press formable thermoplastic nonwoven, noise suppression sheet, filament, flame-resistant fiber, honeycomb fabric, and cellulose nanobead products. The company also provides caustic soda, chemical fertilizers, nitric acid, ammonia, acrylonitrile, methyl methacrylate, styrene, adipic acid, hexamethylene diamine, AH salt, propionitrile, sodium cyanide, acetonitrile, methacrylonitrile, cyclohexyl methacrylate, cyclohexanol, cyclohexane, and cyclohexene; polymers; chemical intermediates; additives; membranes and systems; clads and anchors; optical and printing materials; electronic materials; synthetic rubber and elastomers; kitchen and household products; cleaners; and packaging products. In addition, the company provides lithium-ion battery and lead-acid battery separators, and electronic devices; and autoclaved aerated concrete, foundation systems, insulation materials, and structural systems and components. Further, it involved in the construction of homes and apartments; management of rental units and condominiums; brokerage of used homes; remodeling; and mortgage financing, asset management, and insurance activities. Additionally, the company provides prescription drugs and diagnostic reagents; dialyzers, therapeutic apheresis, leukocyte reduction filters, and virus removal filters; defibrillators, temperature management systems, and data solutions; and UVC LED products. Asahi Kasei Corporation was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.asahi-kasei.com",
        "market_cap": 1756562456576
    },
    "3553.T": {
        "short_name": "KYOWA LEATHER CLOTH CO",
        "long_name": "Kyowa Leather Cloth Co., Ltd.",
        "summary": "Kyowa Leather Cloth Co., Ltd. engages in the manufacturing, processing, and selling of various synthetic resin products Japan and internationally. The company offers automotive products, such as polyurethane products, including LUMISH, Silfie, Le Coeur, and Aquawish for use in seats, door trims, consoles, etc.; olefin products comprising TPO composite materials and sheets used in door trims, instrument panels, consoles, etc.; polyvinyl chloride (PVC) products consisting of Soft leather, PVC leather and sheets, and PVC composite materials for use in seats, door trims, consoles, interior/exterior parts for decoration, etc.; and interior/exterior decorative film for roofs. It also provides housing products, which include interior materials, such as CRONOS, CRONOS EF, Vi-pla S, and Vi-pla OL for interior applications, kitchens, modular bathrooms, wall covering materials, etc.; and exterior materials, such as CRONOS and CRONOS EF for entrance doors, closets, rooftop waterproofing, etc. In addition, the company offers fashion and lifestyle products, including polyurethane synthetic leather products comprising PVC leather, CARAVEL, and Daphne for use in handbags, tote bags, accessories, women's shoes, boots, sandals, slippers, office chairs, chairs for use in large facilities, reception room furniture sets, etc. Kyowa Leather Cloth Co., Ltd. was founded in 1935 and is headquartered in Hamamatsu, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hamamatsu",
        "zipcode": "430-8510",
        "website": "http://www.kyowale.co.jp",
        "market_cap": 18863613952
    },
    "4004.T": {
        "short_name": "SHOWA DENKO KK",
        "long_name": "Showa Denko K.K.",
        "summary": "Showa Denko K.K. operates as a chemical company in Japan and internationally. It operates through seven segments: Petrochemicals, Chemicals, Electronics, Inorganics, Aluminum, Showa Denko Materials, and Others. The Petrochemicals segment offers olefins, including ethylene, propylene, C4 fraction, cracked fuel oils, etc.; organic chemicals comprising acetaldehyde, acetic acid, vinyl and ethyl acetate, allyl alcohol, and allyl ester resin; and polypropylene. The Chemicals segment offers industrial gases, basic and functional chemicals, electronic chemicals, and coating materials. The Inorganics segment manufactures and sells polishing materials, abrasives, and refractories; and supplies graphite electrodes for electric steel making furnaces. The Aluminum segment offers aluminum capacitor foils and aluminum sheets; extruded and forged products, aluminum cylinders, cast rods of aluminum alloys, automobile molded products, heat exchangers, and power semiconductor cooling devices; and aluminum beverage cans. The Electronics segment offers HD media and SiC epitaxial wafers for power devices, aluminum and glass based hard disks, and aluminum substrates for hard disks; LED chips; and lithium ion batteries and fuel cell materials. The Showa Denko Materials segment provides electronics materials, printed wiring board materials, mobility components, and automotive and industrial batteries; and diagnostics services, as well as engages in the contracted manufacturing of regenerative medicine products. The Others segment sells chemicals, resins, metals, and electronic materials, as well as provides building materials. The company was incorporated in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8518",
        "website": "http://www.sdk.co.jp",
        "market_cap": 535390650368
    },
    "4021.T": {
        "short_name": "NISSAN CHEMICAL CORPORATION",
        "long_name": "Nissan Chemical Corporation",
        "summary": "Nissan Chemical Corporation engages in the chemicals, performance materials, agricultural chemicals, pharmaceuticals, and advanced materials and planning businesses in Japan and internationally. Its chemical products include MELAMINE, an adhesive agent; high purity chemicals; AdBlue, an urea solution; FINEOXOCOL, a saturated fatty alcohol and acid; ammonia, sulfuric, and nitric acid; TEPIC, an epoxy compound; Melamine Cyanurate, a salt of melamine and iso cyanuric acid; Nissan Reishi, a health food; phenylphosphonic acid; HI-LITE, a chlorinated isocyanulate; and OPTBEADS, a melamine-formaldehyde resin and silica. The company offers performance materials comprising display, semiconductor, and inorganic materials; agricultural chemicals, such as herbicides, insecticides, fungicides, etc. for use on agricultural land, as well as in golf courses, parks, etc.; and drug substances for veterinary pharmaceuticals. It also provides pharmaceutical products, such as LIVALO, a cholesterol reduction agent; LANDEL and FINTE, a dual type calcium antagonist that blocks calcium channels; and custom manufacturing and process researching services for pharmaceutical ingredients. In addition, the company offers advanced materials comprising ECOPROMOTE, an environmental harmony material; coating solutions for printable thermoelectric materials; soluble hole transport materials for organic photoelectric conversion devices; NANOFIBERGEL, a life science material; FP001, a cell culture ingredient; and SUNCONNECT, an optical material. Further, it engages in the landscaping, engineering, fertilizer, plant engineering, environmental analysis, and transportation businesses. The company was formerly known as Nissan Chemical Industries, Ltd. and changed its name to Nissan Chemical Corporation in July 2018. Nissan Chemical Corporation was founded in 1887 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6119",
        "website": "http://www.nissanchem.co.jp",
        "market_cap": 795809939456
    },
    "4025.T": {
        "short_name": "TAKI CHEMICAL CO",
        "long_name": "Taki Chemical Co., Ltd.",
        "summary": "Taki Chemical Co., Ltd. engages in the agri, chemicals, and real estate businesses in Japan. The company offers fertilizers and soil conditioners. It also provides water treatment chemicals, including polyaluminum chloride for drinking and industrial water treatment, urban sewage treatment, civil and factory wastewater treatment, and coagulation sedimentation and organic sludge filtration dehydrating agents. In addition, the company offers functional chemical materials, such as water-soluble aluminum salts, such as taxeram, aluminum phosphate binders, and takibine; chixosil; high-purity metal oxide consisting of high-purity tantalum and niobium pentaoxide; and functional nanomaterials. Further, it engages in the real estate business. The company serves customers in various fields, including agriculture, chemicals, functional materials, and biotechnology. The company was formerly known as Taki Fertilizer Manufacturing Co., Ltd. and changed its name to Taki Chemical Co., Ltd. in 1974. Taki Chemical Co., Ltd. was founded in 1885 and is headquartered in Kakogawa, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kakogawa",
        "zipcode": "675-0124",
        "website": "http://www.takichem.co.jp",
        "market_cap": 47046098944
    },
    "4041.T": {
        "short_name": "NIPPON SODA CO LTD",
        "long_name": "Nippon Soda Co., Ltd.",
        "summary": "Nippon Soda Co., Ltd. develops, produces, and sells chemicals, agrochemicals, and other products in Japan and internationally. It operates through Chemicals, Agro Products, Trading, Construction, Transportation/Warehousing, and Other divisions. The company offers agrochemicals, including fungicides, insecticides, acaricides, and herbicides. It also provides organic titanate; magnesium ethylate; liquid-1, 2-polybutadiene; o-tolidine diisocyanate; adhesive agents for film lamination; photo resist base resins; developers for thermal paper; epoxy catalyst; permethyl polysilane; crown ethers; photo catalysts; 2, 2' - dichlorodiethy ether; triglycol dichloride; ethylene dichloride; bactericides; fungicides/algaecides; fungicides for wood; insecticides; and termiticide. In addition, the company offers pharmaceutical ingredients, intermediates, and additives comprising diaminomaleonitril, 5-methyl pyrazine-2-canboxylic acid, imidazoles, pyrazines, and hydroxypropyl cellulose; and eco business and consumer chemicals, such as calcium hypochlorite, uroliths removers, and chelating agents for heavy metal, as well as treatment systems by dechlorination for PCBs. Further, it provides chlor-alkali products comprising caustic soda, caustic potash, potassium carbonate, hydrochloric acid, chlorine, sodium hypochlorite, sodium metal, sodium alcoholates, sodium cyanide, potassium cyanide, sulphur monochloride, aluminum chloride anhydrous, phosphorus oxychloride, phosphorus trichloride, sodium sulfite, sulfur trioxide, and sulfuric acid. Additionally, the company engages in the trade of chemicals, functional products, synthetic resins, industrial machines and devices, and construction products; transportation and warehousing of chemicals and hazardous items; plant construction and civil engineering activities; and provision of non-ferrous metals and industrial waste treatment solutions. Nippon Soda Co., Ltd. was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8165",
        "website": "http://www.nippon-soda.co.jp",
        "market_cap": 94684807168
    },
    "4042.T": {
        "short_name": "TOSOH CORP",
        "long_name": "Tosoh Corporation",
        "summary": "Tosoh Corporation manufactures and sells basic chemicals, petrochemicals, specialty products, and fine chemicals worldwide. It operates through four segments: Petrochemical, Chlor-Alkali, Specialty, and Engineering. The company provides materials, including battery, fabricated quartzware, silica glass, thin film depositions, zeolites for catalysts and molecular sieves, zirconia injection mold components and compounds, zirconia grinding and dispersion media, and zirconia fine beads and powders. It also offers chromatographic columns, and media and diagnostic systems; clinical diagnostic systems; Portland cement and blast-furnace slag cement; and caustic soda, vinyl chloride monomer, calcium hypochlorite, and sodium bicarbonate. In addition, the company provides ethylene, propylene, C4 fraction, tertiary butyl alcohol, cumene, and aromatic compounds; and ethyleneamines, bromine, hydrobromic acids, flame retardants, non-aqueous solvents, chelating agents, ethylene dichloride, and sodium styrenesulfonate. Further, it offers polymers, such as ethylene vinyl-acetate copolymers, adhesive polymers, low and high-density polyethylene products, synthetic rubbers, functional polymers, and polyvinyl chloride pastes; and polyurethanes (PU), including methylene diphenyl diisocyanate, toluene diisocyanate, hexamethylene diisocyanate, adhesives, coating resins, elastomers, polyisocyanates for PU paints, and polyols. Additionally, it manufactures and sells water treatment systems; and engages in the construction and repair businesses. It also offers logistics, analytic, personnel management, and information technology services.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8623",
        "website": "http://www.tosoh.com",
        "market_cap": 617600974848
    },
    "4045.T": {
        "short_name": "TOAGOSEI CO LTD",
        "long_name": "Toagosei Co., Ltd.",
        "summary": "Toagosei Co., Ltd., together with its subsidiaries, manufactures, distributes, and sells chemical products in Japan and internationally. The company operates through Commodity Chemicals, Polymer & Oligomer, Adhesive Material, Performance Chemicals, and Plastics segment. It offers inorganic products, including liquid caustic soda, liquid chlorine, synthetic hydrochloric acid, sodium hypochlorite, caustic and super potash, sulfuric acid, sodium sulfite, potassium pyrophosphate, and copper oxide, as well as iron (III) chloride, copper pyrophosphate, and copper potassium pyrophosphate solutions; organic products, such as trichlorethylene and tetrachlorethylene; and ammonium sulfate and potassium bicarbonate fertilizers. The company also provides acrylic monomers, such as dispersants, thickeners, scale inhibitors, pressure sensitive adhesives, binders, paint vehicles, and gelling agents; special polymers; solvent-free acrylic polymers; special acrylic monomers; polymer flocculants; and UV-curable resins. Further, the company provides instant glues and functional adhesives; inorganic chemicals, such as liquid hydrogen chloride, EL sulfuric acid, and hexachlorodisilane, as well as potassium hydroxide and carbonate aqueous solutions; and inorganic functional materials, including electronic materials and amenity care materials. Additionally, it offers piping equipment and nursing care products, elastomer compounds, environmental related products, etc.; and products for the construction and civil engineering. The company was founded in 1933 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8419",
        "website": "http://www.toagosei.co.jp",
        "market_cap": 149880504320
    },
    "4061.T": {
        "short_name": "DENKA COMPANY LIMITED",
        "long_name": "Denka Company Limited",
        "summary": "Denka Company Limited manufactures and sells organic and inorganic materials in Japan and internationally. The company's Elastomers & Performance Plastics division offers synthetic rubber, styrene-based synthetic resins, styrene monomer, chloroprene rubber, polystyrene resin, ABS resin, CLEAREN, heat-resistant resin, transparent resin, POVAL, acetyl chemicals, and other products. Its Infrastructure & Social Solutions division provides cement, special cement additives, fertilizers, calcium carbide, alumina fiber, fire resistant and environmental materials, and underground drainpipes and irrigation system-related products. The company's Electronics & Innovative Products division offers ceramics, inorganic fillers, resin sheets and films, electronic circuit substrates, adhesives, fused silica, electron guns for electron microscopes, acetylene black and other products. Its Living & Environment Products division provides rain gutters and other construction materials, food packaging materials, industrial tapes, synthetic fiber for wigs and hairpieces, and other products. The company's Life Innovation division offers influenza vaccines; bacteria, latex immunoserologica, and virus diagnostic reagents; reagents for HDL and LDL cholesterol products; macromolecular sodium hyaluronate; and skin care products. Denka Company Limited offers its products for automobiles, electric and electronic devices, aircraft and spacecraft, rolling stocks, marine vessels, the environment and energy, communication, power, civil engineering, construction, agriculture, iron-making, ceramics, transmission belts, adhesives, home appliances, office equipment, food packaging materials, household goods for daily use, medical and nursing care, logistics, etc. The company was formerly known as Denki Kagaku Kogyo Kabushiki Kaisha and changed its name to Denka Company Limited in October 2015. Denka Company Limited was incorporated in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8338",
        "website": "http://www.denka.co.jp",
        "market_cap": 319674810368
    },
    "4080.T": {
        "short_name": "TANAKA CHEMICAL CORP",
        "long_name": "Tanaka Chemical Corporation",
        "summary": "Tanaka Chemical Corporation manufactures and sells positive electrode materials for rechargeable batteries in Japan. The company offers positive electrode materials for lithium-ion batteries and nickel-metal hydride batteries. It also manufactures and sells inorganic chemical products. The company was founded in 1956 and is headquartered in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "910-3131",
        "website": "http://www.tanaka-chem.co.jp",
        "market_cap": 32011388928
    },
    "4091.T": {
        "short_name": "NIPPON SANSO HOLDINGS CORPORATI",
        "long_name": "Nippon Sanso Holdings Corporation",
        "summary": "Nippon Sanso Holdings Corporation engages in the gas business in Japan, the United States, Europe, Asia, and Oceania. It operates through five segments: Gas Business in Japan; Gas Business in the United States; Gas Business in Europe; Gas Business in Asia and Oceania; and Thermos Business. The company offers oxygen, nitrogen, argon, carbon dioxide, helium, hydrogen, acetylene, and specialty gases; gas-related equipment; electronics-related equipment and installation; semiconductor manufacturing equipment; cutting and welding equipment; welding materials; plants and machinery; liquid petroleum gas and related equipment; medical-use gases, such as oxygen, nitrous oxide, etc.; medical equipment; and stable isotopes. It also manufactures and sells housewares, such as stainless-steel vacuum-insulated bottles and vacuum-insulated tumblers. The company was formerly known as Taiyo Nippon Sanso Corporation and changed its name to Nippon Sanso Holdings Corporation in October 2020. Nippon Sanso Holdings Corporation was founded in 1910 and is headquartered in Tokyo, Japan. Nippon Sanso Holdings Corporation is a subsidiary of Mitsubishi Chemical Holdings Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "142-0062",
        "website": "http://www.nipponsanso-hd.co.jp",
        "market_cap": 903157579776
    },
    "4093.T": {
        "short_name": "TOHO ACETYLENE CO",
        "long_name": "Toho Acetylene Co., Ltd.",
        "summary": "Toho Acetylene Co., Ltd. provides gas and equipment related products in Japan. The company offers high pressure gases, including acetylene, oxygen, nitrogen, argon, carbon dioxide, hydrogen, mixed gas, ammonia, semiconductor material gas, freon, helium gas, and standard gas, as well as nitrous oxide for food additives; LP gas and related equipment, and oil and gas related products; and eco energy related products, such as solar power generation systems, household fuel cells, and solar power LED street lights. It also provides industrial machinery products comprising acetylene, seamless, and ultra-low temperature liquefied gas containers; welding materials; welding fusion equipment consisting of welding machines, welding robots, laser processing machines, gas fusing-related products, and safety protection equipment; and cleaning equipment and agents. In addition, the company offers medical gases, such as oxygen, nitrogen, nitrous oxide, carbon dioxide, sterilized gas, and liquid helium; medical equipment; home treatment-related services; and medical related services. Its gas products are used in the environmental and chemical, steel and machinery, and food sectors. Toho Acetylene Co., Ltd. was founded in 1948 and is headquartered in Tagajo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tagajo",
        "zipcode": "985-0833",
        "website": "http://www.toho-ace.co.jp",
        "market_cap": 8421943808
    },
    "4097.T": {
        "short_name": "KOATSU GAS KOGYO CO",
        "long_name": "Koatsu Gas Kogyo Co., Ltd.",
        "summary": "Koatsu Gas Kogyo Co., Ltd., together with its subsidiaries, produces and sells industrial gases and chemical products in Japan and internationally. It offers dissolved acetylene gas for welding, cutting, heating, removing glass and copper wire from molds, pharmaceutical synthesis, and carbon raw materials applications; laser gas/mixed gas for various applications, such as laser processing, welding, sterilization, biotechnology, and food products; separated gas/hydrogen/carbon dioxide for medical, food products, cryogenic refrigerant, electronics, space and marine development, welding/cutting, and fire extinguishers applications; LP gas/LNG for cutting/heating and fuel applications; gas cylinders; and safety systems. The company also offers chemical products, such as adhesives for household and industrial applications; and PEGAR, a synthetic resin emulsion for various applications, such as adhesives, pressure sensitive adhesives, paint binders, and additives for construction materials. In addition, it offers information systems, such as LSI cards and reader writers for various industrial fields, such as construction, civil engineering, transportation, and production equipment; and GNSS receiver modules. Koatsu Gas Kogyo Co., Ltd. was founded in 1958 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8411",
        "website": "http://www.koatsugas.co.jp",
        "market_cap": 35717312512
    },
    "4102.T": {
        "short_name": "MARUO CALCIUM CO",
        "long_name": "Maruo Calcium Co., Ltd.",
        "summary": "Maruo Calcium Co., Ltd. manufactures and sells various calcium carbonate and other industrial raw materials in Japan. Its products include various type of colloidal calcium carbonates; light calcium carbonates; ground calcium carbonates; food-additive calcium carbonates; animal pharmaceutical calcium carbonates; hydrated lime and wet silica products; and minerals, including talc, clay, and silica sand, polishing powder, calcium carbonate, and others. The company also imports and distributes wet silica products. Its products are used in sealants/adhesives/plastisols, films, plastics, paints, inks, rubber, food additives, and other applications. The company was formerly known as Maruo Seifun Goshi Company and changed its name to Maruo Calcium Co., Ltd. in August 1963. Maruo Calcium Co., Ltd. was founded in 1926 and is based in Akashi, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Akashi",
        "zipcode": "674-0084",
        "website": "http://www.maruo-cal.co.jp",
        "market_cap": 3279768832
    },
    "4114.T": {
        "short_name": "NIPPON SHOKUBAI CO",
        "long_name": "Nippon Shokubai Co., Ltd.",
        "summary": "Nippon Shokubai Co., Ltd. provides various chemical products in Japan. It operates through three segments: Basic Chemicals, Functional Chemicals, and Environment and Catalysts. The Basic Chemicals segment offers acrylic acids, acrylates, ethylene oxides, ethylene glycols, ethanolamine, and secondary alcohol ethoxylates. The Functional Chemicals segment provides superabsorbent polymers, specialty acrylates, specialty methacrylates, polycarboxylate ether polymers, water-soluble polymers, maleic anhydride and derivatives, resins for adhesives and paints, and acrylic resins for optical films. The Environment and Catalysts segment offers process, automotive, De-NOx, dioxins decomposition, and waste gas and wastewater treatment catalysts; electrolyte sheets for SOFC; and electrolyte for lithium-ion batteries. Nippon Shokubai Co., Ltd. also provides organic solvent soluble polymers and thermoplastics resins; inorganic fine particles, organic-inorganic complex particles, and organic fine particles; and liquid argon and liquid carbon dioxide. The company was formerly known as Nippon Shokubai Kagaku Kogyo Co., Ltd. and changed its name to Nippon Shokubai Co., Ltd. in 1991. Nippon Shokubai Co., Ltd. was founded in 1941 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0043",
        "website": "http://www.shokubai.co.jp",
        "market_cap": 222114889728
    },
    "4124.T": {
        "short_name": "OSAKA YUKA INDUSTRY LTD",
        "long_name": "Osaka Yuka Industry Ltd.",
        "summary": "Osaka Yuka Industry Ltd. engages in precision distillation/refining services in Japan. It undertakes various project works, including small scale distillation for research; precision distillation of various kinds of chemical substances; and support for the introduction of small distillation apparatuses and other items at plants. The company was founded in 1948 and is based in Hirakata, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hirakata",
        "zipcode": "573-1191",
        "website": "http://www.osaka-yuka.co.jp",
        "market_cap": 2108687104
    },
    "4189.T": {
        "short_name": "KH NEOCHEM CO LTD",
        "long_name": "KH Neochem Co., Ltd.",
        "summary": "KH Neochem Co., Ltd. researches, manufactures, and sells petrochemical products in Japan and internationally. It offers a range of chemical products, such as alcohols, esters, ketones, glycol ethers, synthetic fatty acids, aldehydes, diols, hydrocarbons, and functional monomers. The company provides basic chemicals, including butyl alcohol and acetate, 2-ethyl hexyl alcohol, and isononyl alcohol for use in paints, inks, thinners, detergents, plasticizer raw materials, and resin raw materials. It also offers performance materials, such as 2-ethyl hexanoic and isononanoic acid, diacetone acrylamide, and 1,3-butylene glycol for use in lubricants, water-borne paints, and cosmetics. In addition, the company provides electronic materials comprising propylene glycol monomethyl ether acetateÂ\u0096P, and propylene glycol monomethyl ether-P for LCD panels and semiconductors. KH Neochem Co., Ltd. was founded in 1966 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0022",
        "website": "http://www.khneochem.co.jp",
        "market_cap": 99892609024
    },
    "4220.T": {
        "short_name": "RIKEN TECHNOS CORPORATION",
        "long_name": "Riken Technos Corporation",
        "summary": "Riken Technos Corporation engages in compound, film, and food wrapping film businesses in Japan and internationally. It offers polyvinyl chloride compounds, thermoplastic elastomers, electro-conductive compounds, anti-static compounds, biomass plastics compounds, etc. for use in extrusion and injection molding applications. The company also provides building and decorative, commercial and advertisement, steel plate, window, and car films, as well as films for optics and semiconductors, electrical materials, medical supplies, agriculture, etc. In addition, it offers food wrap films made from polyvinyl chloride resin for the consumer and commercial uses, as well as heat-resistant cooking sheets, plastic bags, cooking papers, cooking gloves, etc. Its products have applications in transportation, building and construction, electronics, and daily life and healthcare sectors. The company was formerly known as Riken Vinyl Industry Co., Ltd. and changed its name to Riken Technos Corporation in October 2001. Riken Technos Corporation was founded in 1951 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8336",
        "website": "http://www.rikentechnos.co.jp",
        "market_cap": 33257426944
    },
    "4249.T": {
        "short_name": "MORIROKU HOLDINGS CO LTD",
        "long_name": "Moriroku Holdings Company, Ltd.",
        "summary": "Moriroku Holdings Company, Ltd. develops, manufactures, and distributes resin-moulded components for 4-wheeled and 2-wheeled vehicles and high-performance components in Japan. Its products include exterior and interior parts, as well as precision machinery and electric tool components. The company also manufactures, distributes, imports and exports, and sells chemical and synthetic resin products, such as films/sheets, oil absorbents, bonding agents, LED materials, heat dissipation materials, damping coats, and semiconductor process materials, as well as raw materials for coatings and adhesives, friction materials, pharmaceutical and agricultural intermediates, and cosmetics. In addition, it imports, exports, and sells electronic materials, composite materials, industrial materials, foods, etc. The company was formerly known as Moriroku Company Ltd. and changed its name to Moriroku Holdings Company, Ltd. in 2008. Moriroku Holdings Company, Ltd. was founded in 1663 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.moriroku.co.jp",
        "market_cap": 38604374016
    },
    "4272.T": {
        "short_name": "NIPPON KAYAKU CO",
        "long_name": "Nippon Kayaku Co., Ltd.",
        "summary": "Nippon Kayaku Co., Ltd., together with its subsidiaries, develops, manufactures, and sells functional chemicals, pharmaceuticals, safety systems, and agrochemicals and other products in Japan and internationally. The company's Functional Chemicals Business segment offers functional materials, such as epoxy resins, UV-curable resins, sealants for LCD and LED, touch panel adhesives, and microelectromechanical systems. This segment also provides color materials, including inkjet colorants, dyes for textiles and papers, and materials for thermal paper; catalysts for the production of acrylic and methacrylic acid; and polarizing films, inorganic polarizing plates, LCD projector parts, x-ray analytical equipment, and application products. Its Pharmaceuticals Business segment offers anti-cancer and cancer-related drugs, biosimilars, generic drugs, interventional radiology products, cardiovascular drugs, bulk drugs and intermediates of pharmaceuticals, and drugs for diagnosing cancer, as well as GlycoMark, a product as a marker of blood sugar control used for diabetes. The company's Safety Systems Business segment provides airbag inflators, micro gas generators for seatbelt pretensioners, and squibs. Its Other segment offers agricultural insecticides, herbicides, soil fumigants, and insanitary insecticides; and real estate leasing services. The company was formerly known as Nihon Kayaku Seizou Co., Ltd. and changed its name to Nippon Kayaku Co., Ltd. in 1945. Nippon Kayaku Co., Ltd. was incorporated in 1916 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.nipponkayaku.co.jp",
        "market_cap": 177967349760
    },
    "4274.T": {
        "short_name": "HOSOYA PYRO-ENGINEERING CO LTD",
        "long_name": "Hosoya Pyro-Engineering Co., Ltd.",
        "summary": "Hosoya Pyro-Engineering Co., Ltd. researches, develops, manufactures, tests, evaluates, and sells pyrotechnic products for leisure and space industries in Japan. The company offers smoke and lighting products, signal cylinders, inflators, cartridges, signal bullets, etc. It is also involved in the combustion disposal of explosives; and research and development of liquid energy substances for space and defense. The company was formerly known as Hosoya Bussan Co., Ltd. and changed its name to Hosoya Pyro-Engineering Co., Ltd. in January 1954. Hosoya Pyro-Engineering Co., Ltd. was founded in 1906 and is headquartered in Akiruno, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Akiruno",
        "zipcode": "197-0801",
        "website": "http://www.hosoya-pyro.co.jp",
        "market_cap": 4791590912
    },
    "4366.T": {
        "short_name": "DAITO CHEMIX CORP",
        "long_name": "Daito Chemix Corporation",
        "summary": "Daito Chemix Corporation manufactures and sells specialty and fine chemicals in Japan. The company offers photosensitive materials for LCD and semiconductor production. It also provides printing and photographic materials, functional dyes, pharmaceutical intermediates, and other chemical products. The company was founded in 1938 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "538-0031",
        "website": "http://www.daitochemix.co.jp",
        "market_cap": 11004399616
    },
    "4368.T": {
        "short_name": "FUSO CHEMICAL CO",
        "long_name": "Fuso Chemical Co.,Ltd.",
        "summary": "Fuso Chemical Co.,Ltd. manufactures and sells life science, electronic material, and functional chemical products worldwide. Its life science products include malic acid and derivatives, citric acid and derivatives, L-tartaric acid and derivatives, lactic acid and derivatives, gluconic acid and derivatives, other acid derivatives, ascorbic and isoascorbic acids, and amino acid and derivatives, as well as water soluble rust proof agents/water soluble grinding and cutting fluids. The company's electronic material products comprise ultra-high purity colloidal silica and high purity organo silica sol; and functional chemical products that consist of oxidation and reduction products, as well as benzoic acid derivatives. It also exports its products. Fuso Chemical Co.,Ltd. was founded in 1952 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0043",
        "website": "http://www.fusokk.co.jp",
        "market_cap": 146274828288
    },
    "4463.T": {
        "short_name": "NICCA CHEMICAL CO",
        "long_name": "Nicca Chemical Co.,Ltd.",
        "summary": "Nicca Chemical Co.,Ltd. manufactures and sells surfactants for textile chemicals, metals, pulp and paper, paints, dyes, synthetic resins, and dry cleaning and professional cleaning agents in Japan and internationally. The company offers textile chemicals, including oiling, scouring, chelating and dispersing, penetrant and antifoam, carrier, leveling, oligomer control, improving color fastness to rubbing and light, printing, antistatic, soil-release finishing, flame retarding, napping, and life care agents, as well as bleaching stabilizer, in-bath quality improver, machine cleaner, water and oil repellent, softener, and stiffener. It also provides specialty chemicals comprising metal processing chemicals, such as spray cleaner, and cleaning agents for various application; paper and pulp chemicals, including delinking and dryer release softener, felt cleaner, flameproof, and defoamer; color developer for thermal paper; and nonionic, anionic, cationic and amphoteric surfactants. In addition, the company offers advanced materials comprising functional artificial nucleic acid, carbon fiber composite material, femto reactor, and nanodiamond applied products. Further, it provides cleaning chemicals for laundry, wet system, and dry cleaning; and agents for linen supply and dust control, and facilities. Additionally, the company designs, develops, manufactures, and sells hair beauty products for the professional salon industry; and pharmaceutical products. Nicca Chemical Co.,Ltd. was founded in 1938 and is headquartered in Fukui, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "910-8670",
        "website": "http://www.nicca.co.jp",
        "market_cap": 19845617664
    },
    "4531.T": {
        "short_name": "YUKI GOSEI KOGYO CO",
        "long_name": "Yuki Gosei Kogyo Co., Ltd.",
        "summary": "Yuki Gosei Kogyo Co., Ltd. researches, develops, manufactures, and markets fine chemical products in Japan and internationally. It offers food additives, pharmaceuticals, and industrial and agricultural chemicals; and glycine, glycine compounds, nicotinic acid amide, isoniazid, drug intermediates, and cosmetic ingredients. The company also provides amino acid, pyridine, piperidine, silicon, and other compounds; DNA, nucleoside, and protamine; and active pharmaceutical ingredients. In addition, it engages in the contract manufacturing of pharmaceuticals and chemical products. Yuki Gosei Kogyo Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0013",
        "website": "http://www.yuki-gosei.co.jp",
        "market_cap": 6351482368
    },
    "4885.T": {
        "short_name": "MUROMACHI CHEMICALS INC",
        "long_name": "Muromachi Chemicals Inc.",
        "summary": "Muromachi Chemicals Inc. engages in the planning, production, import, and distribution of active pharmaceutical ingredients and radioisotopes in Japan and internationally. The company also processes and distributes ion-exchange resins and fibers, separation membranes, water treatment systems and other applications, and chemicals; and produces and distributes health foods. In addition, it processes and sells functional adhesives and pastes; secondary materials for plant use; clean rollers and adhesive dust removal mats; clean creams and mats; functional film pouches; screen printers; chemical products and secondary materials; and liquid-and water-draining rolls. The company was formerly known as Tenyosya Pharmaceutical Manufacturing Business Corporation and changed its name to Muromachi Chemicals Inc. in September 1998. Muromachi Chemicals Inc. was founded in 1917 and is headquartered in Omuta, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Omuta",
        "zipcode": "836-0895",
        "website": "http://www.muro-chem.co.jp",
        "market_cap": 4658850304
    },
    "4960.T": {
        "short_name": "CHEMIPROKASEI KAISHA",
        "long_name": "Chemipro Kasei Kaisha, Ltd.",
        "summary": "Chemipro Kasei Kaisha, Ltd. manufactures and sells chemicals and household products in Japan. The company offers plastic additives, including UV absorbers and anti-oxidants; additives for use in commodities and industrial products; developers and functional pigments for use in thermal paper; and pharmaceutical and agricultural intermediates, as well as photographic intermediates. It also provides organic electronic materials (organic EL) and other products used in the development of peripheral materials, such as hole-transporting, electron-transporting, and emitting materials, as well as chemical agents used for organic EL. In addition, the company offers wood preservatives under the ALISIS name, as well as insecticides under the XAMOX name for home termite control; and wood protective coating materials for home centers applications, as well as for treating electricity poles and railroad ties used by Japanese National Railways. Chemipro Kasei Kaisha, Ltd. was founded in 1982 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0034",
        "website": "http://www.chemipro.co.jp",
        "market_cap": 4145050880
    },
    "4970.T": {
        "short_name": "TOYO GOSEI CO LTD",
        "long_name": "Toyo Gosei Co.,Ltd.",
        "summary": "Toyo Gosei Co.,Ltd. manufactures and sells photosensitive materials for photolithography primarily in Japan. The company offers photosensitive materials primarily for use in the microfabrication of semiconductor integrated circuits and liquid crystal displays, and manufacture of color filters; and a range of high-purity photo acid generators and resins that are used in chemical amplifiers. It is also involved in the recovery of waste solvents and volatile organic compounds through its distillation plants; marketing of various synthetic products; and the supply of electrolytes and ionic liquids used in electric double-layer capacitors. In addition, the company produces aroma chemicals for daily-use products, including shampoos and body soaps, as well as for the flavors of food products; and researches and develops, manufactures, and sells materials for batteries and electrical double layer capacitors. Further, it provides logistics services, such as receiving and shipping systems, storage facilities, and analysis equipment; photosensitive materials for use in the culturing of cells and protein enzymes; and warehousing and goods transportation services. The company was formerly known as Nihon Acetylene Chemical Engineering Co., Ltd. and changed its name to Toyo Gosei Co.,Ltd. in May 1961. Toyo Gosei Co.,Ltd. was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-0053",
        "website": "http://www.toyogosei.co.jp",
        "market_cap": 91594252288
    },
    "5013.T": {
        "short_name": "YUSHIRO CHEMICAL INDUSTRY CO",
        "long_name": "Yushiro Chemical Industry Co., Ltd.",
        "summary": "Yushiro Chemical Industry Co., Ltd., together with its subsidiaries, manufactures and sells metalworking oils and fluids, and chemicals for building maintenance in Japan, China, India, North and South America, and Southeast Asia. The company provides cutting and grinding oils and fluids, including water miscible cutting and grinding fluids, and straight cutting and grinding oils; forming oils and fluids comprising water miscible cold rolling oils, straight rolling oils, hot rolling oils for seamless pipes, and non-graphite hot forging oils, as well as drawing pressing oils and cold forging oils; and surface treatment agents, such as rust preventives, metal cleaners, car paint protective coatings, and car body protective waxes. It also offers water miscible cutting fluids for inner diamond blade saws; straight slurry bases for multi blade and multi wire saws, fire resistant water miscible slurry bases for multi wire saws, and water miscible slurry bases for multi wire saws; grinding fluids for aluminum and glass disks, and diamond slurries for magnetic heads; die lubricants and others consisting of aluminum and magnesium diecast lubricants, urethane foam mold release agents, and plunger tip lubricants; aquaous quenchant products; fire resistant hydraulic fluids; and deodorant products. In addition, the company provides building maintenance chemicals, including floor polishing chemicals, such as urethane and acrylic resin waxes, and water based and oil based floor waxes; floor cleaners comprising surface cleaners, stripping agents, and carpet cleaners; hand soaps; and floor maintenance equipment, including maintenance riding carts. It serves automobile, precision machine processing, steel, electric equipment, and other machine processing companies. Yushiro Chemical Industry Co., Ltd. was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "146-8510",
        "website": "http://www.yushiro.co.jp",
        "market_cap": 16387680256
    },
    "5142.T": {
        "short_name": "ACHILLES CORP",
        "long_name": "Achilles Corporation",
        "summary": "Achilles Corporation manufactures and sells shoes, plastic products, and industrial materials in Japan. It offers walking and sports shoes for kids, women, and men under the Achilles SORBO, SYUNSOKU, SYUNSOKU Baby, SYUNSOKU Junior, SYUNSOKU DANCE, and SYUNSOKU Kizuna names, as well as provides a range of shoes through tie-ups with other international brands. The company also provides synthetic leather under the Cabron name; casting leather under the Partner name; PVC and PU leathers, which are used as the materials of furniture and shoes; housing materials, such as floor and wall coverings; and rubberized cloth products for the manufacture of rainwear, inflatable boats, and air tents. In addition, it offers rigid fluorocarbon-free urethane foam insulating materials; polystyrene foam products; flexible urethane products; ST polymer used in the production of parts for personal computers and electronics; various electronics-related items, including EMI shields, heat conductive sheets, etc.; RIM molds; and paint masking tools. The company also exports its products to the United States, Europe, Asia, Oceania, and Africa. The company was formerly known as Kohkoku Chemical Industry and changed its name to Achilles Corporation in February 1982. Achilles Corporation was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "169-8885",
        "website": "http://www.achilles.jp",
        "market_cap": 21773643776
    },
    "5KF.SG": {
        "short_name": "TANAKA CHEMICAL CORP. Registere",
        "long_name": "Tanaka Chemical Corporation",
        "summary": "Tanaka Chemical Corporation manufactures and sells positive electrode materials for rechargeable batteries in Japan. The company offers positive electrode materials for lithium-ion batteries and nickel-metal hydride batteries. It also manufactures and sells inorganic chemical products. The company was founded in 1956 and is headquartered in Fukui, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Fukui",
        "zipcode": "910-3131",
        "website": "http://www.tanaka-chem.co.jp",
        "market_cap": 241583776
    },
    "7925.T": {
        "short_name": "MAEZAWA KASEI INDUSTRIES CO",
        "long_name": "Maezawa Kasei Industries Co., Ltd.",
        "summary": "Maezawa Kasei Industries Co., Ltd. produces and sells water and sewerage related products, and environmental equipment. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.maezawa-k.co.jp",
        "market_cap": 18538192896
    },
    "8012.T": {
        "short_name": "NAGASE & CO",
        "long_name": "Nagase & Co., Ltd.",
        "summary": "Nagase & Co., Ltd. manufactures, imports/exports, and sells chemicals, plastics, electronics materials, cosmetics, and health foods worldwide. It offers resins; pigments; solvents; additives; urethane and plastic materials; flame retardants; release agents; petrochemical products; paper manufacturing, plating, electronics, and silicone chemicals; resins, industrial oil solution, and surfactant raw materials; surfactants; fluorochemicals; and polymer filters. The company also provides digital print processing, organic transparent conductive, and photolithography materials; functional sheets and films; dyestuffs; fiber processing agents; auto body repair paints; auxiliaries; plastic-related equipment; devices; moldings; chemical management and semiconductor equipment; and bumping services. In addition, it offers flexible display, organic light-emitting, silicon wafer and liquid crystal glass processing, and electronic paper materials; touch panel components; materials for smartphone and tablet cases; flame-resistant insulation/thermal conductive sheets; lenses; LED chips; and precision abrasives. Further, the company provides automotive interior, exterior, and functional components; and raw materials for lithium ion battery (LiB); photovoltaic (PV) and wireless communications modules; LiB systems; PV materials; powered systems; LED optical communications equipment; functional food ingredients; fragrances/cosmetics and household product, pharmaceutical, in-vitro diagnostics, and medical materials; materials for agriculture, fisheries, and livestock; and cosmetics and health foods. Additionally, it offers warehousing and distribution, kitting/logistics, online catalog sale, recordable media, RFID, software development and maintenance, radiation measuring, office administration, insurance agency, equipment maintenance and engineering, and print quality management consulting services. Nagase & Co., Ltd. was founded in 1832 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-8668",
        "website": "http://www.nagase.co.jp",
        "market_cap": 199410515968
    },
    "8158.T": {
        "short_name": "SODA NIKKA CO LTD",
        "long_name": "Soda Nikka Co., Ltd.",
        "summary": "Soda Nikka Co., Ltd. engages in the trade of soda products in Japan. It also trades in inorganic/organic chemicals, petrochemical products, and synthetic resin products, as well as supplies caustic soda and other products. In addition, the company offers various industrial chemicals, electronic materials, processed products, facilities/equipment, and containers. Soda Nikka Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8322",
        "website": "http://www.sodanikka.co.jp",
        "market_cap": 14335821824
    },
    "AHKSF": {
        "short_name": "ASAHI KASEI CORP",
        "long_name": "Asahi Kasei Corporation",
        "summary": "Asahi Kasei Corporation manufactures, processes, and sells chemical products in Japan and internationally. The company operates through three segments: Material, Homes, and Health Care. It offers cupro fiber, lining fabric, stretch fiber, spunbond nonwoven, cupro nonwoven fabric, microfiber suede, oil-water separator, multifunctional nonwoven, deodorizing nonwoven, heat-press formable thermoplastic nonwoven, noise suppression sheet, filament, flame-resistant fiber, honeycomb fabric, and cellulose nanobead products. The company also provides caustic soda, chemical fertilizers, nitric acid, ammonia, acrylonitrile, methyl methacrylate, styrene, adipic acid, hexamethylene diamine, AH salt, propionitrile, sodium cyanide, acetonitrile, methacrylonitrile, cyclohexyl methacrylate, cyclohexanol, cyclohexane, and cyclohexene; polymers; chemical intermediates; additives; membranes and systems; clads and anchors; optical and printing materials; electronic materials; synthetic rubber and elastomers; kitchen and household products; cleaners; and packaging products. In addition, the company provides lithium-ion battery and lead-acid battery separators, and electronic devices; and autoclaved aerated concrete, foundation systems, insulation materials, and structural systems and components. Further, it involved in the construction of homes and apartments; management of rental units and condominiums; brokerage of used homes; remodeling; and mortgage financing, asset management, and insurance activities. Additionally, the company provides prescription drugs and diagnostic reagents; dialyzers, therapeutic apheresis, leukocyte reduction filters, and virus removal filters; defibrillators, temperature management systems, and data solutions; and UVC LED products. Asahi Kasei Corporation was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.asahi-kasei.com",
        "market_cap": 15810049024
    },
    "AHKSY": {
        "short_name": "ASAHI KASEI CORP",
        "long_name": "Asahi Kasei Corporation",
        "summary": "Asahi Kasei Corporation manufactures, processes, and sells chemical products in Japan and internationally. The company operates through three segments: Material, Homes, and Health Care. It offers cupro fiber, lining fabric, stretch fiber, spunbond nonwoven, cupro nonwoven fabric, microfiber suede, oil-water separator, multifunctional nonwoven, deodorizing nonwoven, heat-press formable thermoplastic nonwoven, noise suppression sheet, filament, flame-resistant fiber, honeycomb fabric, and cellulose nanobead products. The company also provides caustic soda, chemical fertilizers, nitric acid, ammonia, acrylonitrile, methyl methacrylate, styrene, adipic acid, hexamethylene diamine, AH salt, propionitrile, sodium cyanide, acetonitrile, methacrylonitrile, cyclohexyl methacrylate, cyclohexanol, cyclohexane, and cyclohexene; polymers; chemical intermediates; additives; membranes and systems; clads and anchors; optical and printing materials; electronic materials; synthetic rubber and elastomers; kitchen and household products; cleaners; and packaging products. In addition, the company provides lithium-ion battery and lead-acid battery separators, and electronic devices; and autoclaved aerated concrete, foundation systems, insulation materials, and structural systems and components. Further, it involved in the construction of homes and apartments; management of rental units and condominiums; brokerage of used homes; remodeling; and mortgage financing, asset management, and insurance activities. Additionally, the company provides prescription drugs and diagnostic reagents; dialyzers, therapeutic apheresis, leukocyte reduction filters, and virus removal filters; defibrillators, temperature management systems, and data solutions; and UVC LED products. Asahi Kasei Corporation was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.asahi-kasei.com",
        "market_cap": 14984848384
    },
    "ASAA.F": {
        "short_name": "ASAHI KASEI",
        "long_name": "Asahi Kasei Corporation",
        "summary": "Asahi Kasei Corporation manufactures, processes, and sells chemical products in Japan and internationally. The company operates through three segments: Material, Homes, and Health Care. It offers cupro fiber, lining fabric, stretch fiber, spunbond nonwoven, cupro nonwoven fabric, microfiber suede, oil-water separator, multifunctional nonwoven, deodorizing nonwoven, heat-press formable thermoplastic nonwoven, noise suppression sheet, filament, flame-resistant fiber, honeycomb fabric, and cellulose nanobead products. The company also provides caustic soda, chemical fertilizers, nitric acid, ammonia, acrylonitrile, methyl methacrylate, styrene, adipic acid, hexamethylene diamine, AH salt, propionitrile, sodium cyanide, acetonitrile, methacrylonitrile, cyclohexyl methacrylate, cyclohexanol, cyclohexane, and cyclohexene; polymers; chemical intermediates; additives; membranes and systems; clads and anchors; optical and printing materials; electronic materials; synthetic rubber and elastomers; kitchen and household products; cleaners; and packaging products. In addition, the company provides lithium-ion battery and lead-acid battery separators, and electronic devices; and autoclaved aerated concrete, foundation systems, insulation materials, and structural systems and components. Further, it involved in the construction of homes and apartments; management of rental units and condominiums; brokerage of used homes; remodeling; and mortgage financing, asset management, and insurance activities. Additionally, the company provides prescription drugs and diagnostic reagents; dialyzers, therapeutic apheresis, leukocyte reduction filters, and virus removal filters; defibrillators, temperature management systems, and data solutions; and UVC LED products. Asahi Kasei Corporation was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.asahi-kasei.com",
        "market_cap": 12645279744
    },
    "DIK.F": {
        "short_name": "DENKA CO., LTD.",
        "long_name": "Denka Company Limited",
        "summary": "Denka Company Limited manufactures and sells organic and inorganic materials in Japan and internationally. The company's Elastomers & Performance Plastics division offers synthetic rubber, styrene-based synthetic resins, styrene monomer, chloroprene rubber, polystyrene resin, ABS resin, CLEAREN, heat-resistant resin, transparent resin, POVAL, acetyl chemicals, and other products. Its Infrastructure & Social Solutions division provides cement, special cement additives, fertilizers, calcium carbide, alumina fiber, fire resistant and environmental materials, and underground drainpipes and irrigation system-related products. The company's Electronics & Innovative Products division offers ceramics, inorganic fillers, resin sheets and films, electronic circuit substrates, adhesives, fused silica, electron guns for electron microscopes, acetylene black and other products. Its Living & Environment Products division provides rain gutters and other construction materials, food packaging materials, industrial tapes, synthetic fiber for wigs and hairpieces, and other products. The company's Life Innovation division offers influenza vaccines; bacteria, latex immunoserologica, and virus diagnostic reagents; reagents for HDL and LDL cholesterol products; macromolecular sodium hyaluronate; and skin care products. Denka Company Limited offers its products for automobiles, electric and electronic devices, aircraft and spacecraft, rolling stocks, marine vessels, the environment and energy, communication, power, civil engineering, construction, agriculture, iron-making, ceramics, transmission belts, adhesives, home appliances, office equipment, food packaging materials, household goods for daily use, medical and nursing care, logistics, etc. The company was formerly known as Denki Kagaku Kogyo Kabushiki Kaisha and changed its name to Denka Company Limited in October 2015. Denka Company Limited was incorporated in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8338",
        "website": "http://www.denka.co.jp",
        "market_cap": 2898568192
    },
    "KURRF": {
        "short_name": "KURARAY CO",
        "long_name": "Kuraray Co., Ltd.",
        "summary": "Kuraray Co., Ltd. engages in resins, chemicals, fibers, and others businesses worldwide. The company's Vinyl Acetate segment offers polyvinyl alcohol (PVA) resins for paper/fiber processing agents, adhesives, and stabilizers; optical-use PVA films for liquid crystal displays and others; water-soluble PVA films for detergents and others; PVB film and Ionoplast interlayer for safety glass; EVOH resins for food packaging, automotive fuel tanks, stain-resistant wallpaper, vacuum insulation panels, and others; EVAL, a food packaging materials; and PLANTIC, a bio-based barrier material for food packaging materials. Its Isoprene segment produces isoprene chemicals; thermoplastic elastomers; heat-resistant polyamide resins; liquid rubber as additive agent for automobile tires and others; and acrylic thermoplastic elastomers. The company's Functional Materials segment offers methacrylic resins for LCDs, automobile parts, signboards, construction materials, and others; dental materials; and activated carbons. Its Fibers and Textile segment provides man made leather products; PVA fibers, which are reinforcing materials for cement, concrete, automotive brake hoses, and others; non-woven fabrics for everyday goods, industrial products, and others; hook and loop fasteners for clothing, sporting goods, industrial materials, and others; and polyarylate fibers for aerospace, composites, electronic components, ropes, sporting goods, and others. The company's Trading segment engages in the import, export, and wholesale of resin and chemical products. Its Others segment offers membranes and liquid crystalline polymer films. This segment also engages in water purification, wastewater treatment, ballast water management system, and other businesses. In addition, the company provides yarn and fabric for clothing and materials, sportswear, uniforms, and others. Kuraray Co., Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8115",
        "website": "http://www.kuraray.co.jp",
        "market_cap": 3535691520
    },
    "KURRY": {
        "short_name": "KURARAY CO",
        "long_name": "Kuraray Co., Ltd.",
        "summary": "Kuraray Co., Ltd. engages in resins, chemicals, fibers, and others businesses worldwide. The company's Vinyl Acetate segment offers polyvinyl alcohol (PVA) resins for paper/fiber processing agents, adhesives, and stabilizers; optical-use PVA films for liquid crystal displays and others; water-soluble PVA films for detergents and others; PVB film and Ionoplast interlayer for safety glass; EVOH resins for food packaging, automotive fuel tanks, stain-resistant wallpaper, vacuum insulation panels, and others; EVAL, a food packaging materials; and PLANTIC, a bio-based barrier material for food packaging materials. Its Isoprene segment produces isoprene chemicals; thermoplastic elastomers; heat-resistant polyamide resins; liquid rubber as additive agent for automobile tires and others; and acrylic thermoplastic elastomers. The company's Functional Materials segment offers methacrylic resins for LCDs, automobile parts, signboards, construction materials, and others; dental materials; and activated carbons. Its Fibers and Textile segment provides man made leather products; PVA fibers, which are reinforcing materials for cement, concrete, automotive brake hoses, and others; non-woven fabrics for everyday goods, industrial products, and others; hook and loop fasteners for clothing, sporting goods, industrial materials, and others; and polyarylate fibers for aerospace, composites, electronic components, ropes, sporting goods, and others. The company's Trading segment engages in the import, export, and wholesale of resin and chemical products. Its Others segment offers membranes and liquid crystalline polymer films. This segment also engages in water purification, wastewater treatment, ballast water management system, and other businesses. In addition, the company provides yarn and fabric for clothing and materials, sportswear, uniforms, and others. Kuraray Co., Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8115",
        "website": "http://www.kuraray.co.jp",
        "market_cap": 3545226496
    },
    "KUY.F": {
        "short_name": "KURARAY CO. LTD  YN 50",
        "long_name": "Kuraray Co., Ltd.",
        "summary": "Kuraray Co., Ltd. engages in resins, chemicals, fibers, and others businesses worldwide. The company's Vinyl Acetate segment offers polyvinyl alcohol (PVA) resins for paper/fiber processing agents, adhesives, and stabilizers; optical-use PVA films for liquid crystal displays and others; water-soluble PVA films for detergents and others; PVB film and Ionoplast interlayer for safety glass; EVOH resins for food packaging, automotive fuel tanks, stain-resistant wallpaper, vacuum insulation panels, and others; EVAL, a food packaging materials; and PLANTIC, a bio-based barrier material for food packaging materials. Its Isoprene segment produces isoprene chemicals; thermoplastic elastomers; heat-resistant polyamide resins; liquid rubber as additive agent for automobile tires and others; and acrylic thermoplastic elastomers. The company's Functional Materials segment offers methacrylic resins for LCDs, automobile parts, signboards, construction materials, and others; dental materials; and activated carbons. Its Fibers and Textile segment provides man made leather products; PVA fibers, which are reinforcing materials for cement, concrete, automotive brake hoses, and others; non-woven fabrics for everyday goods, industrial products, and others; hook and loop fasteners for clothing, sporting goods, industrial materials, and others; and polyarylate fibers for aerospace, composites, electronic components, ropes, sporting goods, and others. The company's Trading segment engages in the import, export, and wholesale of resin and chemical products. Its Others segment offers membranes and liquid crystalline polymer films. This segment also engages in water purification, wastewater treatment, ballast water management system, and other businesses. In addition, the company provides yarn and fabric for clothing and materials, sportswear, uniforms, and others. Kuraray Co., Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8115",
        "website": "http://www.kuraray.co.jp",
        "market_cap": 2909593600
    },
    "M3C.F": {
        "short_name": "MITSUBISHI CHEM. HLDGS",
        "long_name": "Mitsubishi Chemical Holdings Corporation",
        "summary": "Mitsubishi Chemical Holdings Corporation provides performance products, chemicals, industrial gases, health care products, and other products in Japan and internationally. The company's performance products include specialty chemicals, functional food materials, inorganic materials, electronic and electrical components and products, molding and processed products, film and sheet products, synthetic paper and fiber, carbon fiber, equipment, instruments and systems, materials and products for industrial use, construction materials, civil engineering materials, aqua-related materials and products, leisure, sports, and daily goods. Its health care products comprise pharmaceuticals, pharmaceutical formulation materials and related products, drug discovery solutions, diagnostic reagents and instruments, health apparatus and instruments for medical use, medical support, nursing care and health support, and clinical examination and service. The company also offers industrial materials, such as basic chemicals, carbon materials, synthetic resins, and industrial gases; and engineering, information systems, analysis and inspection, packaging and logistics, and survey, consulting, and other services. In addition, it manufactures and markets plastic films, house and building materials, infrastructure materials, food and pharmaceutical ingredients, electrolytes for lithium-ion batteries, thermoplastic compounds and functional polyolefin, polyester films, coke, polyethylene, polypropylene, and stainless steel thermoses. Further, the company is involved in the environmental and recycling-related activities, as well as provides warehousing and semiconductor-related services. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8251",
        "website": "http://www.mitsubishichem-hd.co.jp",
        "market_cap": 9502218240
    },
    "MTLHF": {
        "short_name": "MITSUBISHI CHEMICAL HOLDINGS CO",
        "long_name": "Mitsubishi Chemical Holdings Corporation",
        "summary": "Mitsubishi Chemical Holdings Corporation provides performance products, chemicals, industrial gases, health care products, and other products in Japan and internationally. The company's performance products include specialty chemicals, functional food materials, inorganic materials, electronic and electrical components and products, molding and processed products, film and sheet products, synthetic paper and fiber, carbon fiber, equipment, instruments and systems, materials and products for industrial use, construction materials, civil engineering materials, aqua-related materials and products, leisure, sports, and daily goods. Its health care products comprise pharmaceuticals, pharmaceutical formulation materials and related products, drug discovery solutions, diagnostic reagents and instruments, health apparatus and instruments for medical use, medical support, nursing care and health support, and clinical examination and service. The company also offers industrial materials, such as basic chemicals, carbon materials, synthetic resins, and industrial gases; and engineering, information systems, analysis and inspection, packaging and logistics, and survey, consulting, and other services. In addition, it manufactures and markets plastic films, house and building materials, infrastructure materials, food and pharmaceutical ingredients, electrolytes for lithium-ion batteries, thermoplastic compounds and functional polyolefin, polyester films, coke, polyethylene, polypropylene, and stainless steel thermoses. Further, the company is involved in the environmental and recycling-related activities, as well as provides warehousing and semiconductor-related services. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8251",
        "website": "http://www.mitsubishichem-hd.co.jp",
        "market_cap": 11489741824
    },
    "MTLHY": {
        "short_name": "MITSUBISHI CHEMICAL HOLDINGS CO",
        "long_name": "Mitsubishi Chemical Holdings Corporation",
        "summary": "Mitsubishi Chemical Holdings Corporation provides performance products, chemicals, industrial gases, health care products, and other products in Japan and internationally. The company's performance products include specialty chemicals, functional food materials, inorganic materials, electronic and electrical components and products, molding and processed products, film and sheet products, synthetic paper and fiber, carbon fiber, equipment, instruments and systems, materials and products for industrial use, construction materials, civil engineering materials, aqua-related materials and products, leisure, sports, and daily goods. Its health care products comprise pharmaceuticals, pharmaceutical formulation materials and related products, drug discovery solutions, diagnostic reagents and instruments, health apparatus and instruments for medical use, medical support, nursing care and health support, and clinical examination and service. The company also offers industrial materials, such as basic chemicals, carbon materials, synthetic resins, and industrial gases; and engineering, information systems, analysis and inspection, packaging and logistics, and survey, consulting, and other services. In addition, it manufactures and markets plastic films, house and building materials, infrastructure materials, food and pharmaceutical ingredients, electrolytes for lithium-ion batteries, thermoplastic compounds and functional polyolefin, polyester films, coke, polyethylene, polypropylene, and stainless steel thermoses. Further, the company is involved in the environmental and recycling-related activities, as well as provides warehousing and semiconductor-related services. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8251",
        "website": "http://www.mitsubishichem-hd.co.jp",
        "market_cap": 11895581696
    },
    "N76.F": {
        "short_name": "NIPPON SODA CO.LTD",
        "long_name": "Nippon Soda Co., Ltd.",
        "summary": "Nippon Soda Co., Ltd. develops, produces, and sells chemicals, agrochemicals, and other products in Japan and internationally. It operates through Chemicals, Agro Products, Trading, Construction, Transportation/Warehousing, and Other divisions. The company offers agrochemicals, including fungicides, insecticides, acaricides, and herbicides. It also provides organic titanate; magnesium ethylate; liquid-1, 2-polybutadiene; o-tolidine diisocyanate; adhesive agents for film lamination; photo resist base resins; developers for thermal paper; epoxy catalyst; permethyl polysilane; crown ethers; photo catalysts; 2, 2' - dichlorodiethy ether; triglycol dichloride; ethylene dichloride; bactericides; fungicides/algaecides; fungicides for wood; insecticides; and termiticide. In addition, the company offers pharmaceutical ingredients, intermediates, and additives comprising diaminomaleonitril, 5-methyl pyrazine-2-canboxylic acid, imidazoles, pyrazines, and hydroxypropyl cellulose; and eco business and consumer chemicals, such as calcium hypochlorite, uroliths removers, and chelating agents for heavy metal, as well as treatment systems by dechlorination for PCBs. Further, it provides chlor-alkali products comprising caustic soda, caustic potash, potassium carbonate, hydrochloric acid, chlorine, sodium hypochlorite, sodium metal, sodium alcoholates, sodium cyanide, potassium cyanide, sulphur monochloride, aluminum chloride anhydrous, phosphorus oxychloride, phosphorus trichloride, sodium sulfite, sulfur trioxide, and sulfuric acid. Additionally, the company engages in the trade of chemicals, functional products, synthetic resins, industrial machines and devices, and construction products; transportation and warehousing of chemicals and hazardous items; plant construction and civil engineering activities; and provision of non-ferrous metals and industrial waste treatment solutions. Nippon Soda Co., Ltd. was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8165",
        "website": "http://www.nippon-soda.co.jp",
        "market_cap": 704298688
    },
    "NNCHY": {
        "short_name": "NISSAN CHEMICAL CORPORATION",
        "long_name": "Nissan Chemical Corporation",
        "summary": "Nissan Chemical Corporation engages in the chemicals, performance materials, agricultural chemicals, pharmaceuticals, and advanced materials and planning businesses in Japan and internationally. Its chemical products include MELAMINE, an adhesive agent; high purity chemicals; AdBlue, an urea solution; FINEOXOCOL, a saturated fatty alcohol and acid; ammonia, sulfuric, and nitric acid; TEPIC, an epoxy compound; Melamine Cyanurate, a salt of melamine and iso cyanuric acid; Nissan Reishi, a health food; phenylphosphonic acid; HI-LITE, a chlorinated isocyanulate; and OPTBEADS, a melamine-formaldehyde resin and silica. The company offers performance materials comprising display, semiconductor, and inorganic materials; agricultural chemicals, such as herbicides, insecticides, fungicides, etc. for use on agricultural land, as well as in golf courses, parks, etc.; and drug substances for veterinary pharmaceuticals. It also provides pharmaceutical products, such as LIVALO, a cholesterol reduction agent; LANDEL and FINTE, a dual type calcium antagonist that blocks calcium channels; and custom manufacturing and process researching services for pharmaceutical ingredients. In addition, the company offers advanced materials comprising ECOPROMOTE, an environmental harmony material; coating solutions for printable thermoelectric materials; soluble hole transport materials for organic photoelectric conversion devices; NANOFIBERGEL, a life science material; FP001, a cell culture ingredient; and SUNCONNECT, an optical material. Further, it engages in the landscaping, engineering, fertilizer, plant engineering, environmental analysis, and transportation businesses. The company was formerly known as Nissan Chemical Industries, Ltd. and changed its name to Nissan Chemical Corporation in July 2018. Nissan Chemical Corporation was founded in 1887 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6119",
        "website": "http://www.nissanchem.co.jp",
        "market_cap": 7055087104
    },
    "NP7.F": {
        "short_name": "NIPPON KAYAKU",
        "long_name": "Nippon Kayaku Co., Ltd.",
        "summary": "Nippon Kayaku Co., Ltd., together with its subsidiaries, develops, manufactures, and sells functional chemicals, pharmaceuticals, safety systems, and agrochemicals and other products in Japan and internationally. The company's Functional Chemicals Business segment offers functional materials, such as epoxy resins, UV-curable resins, sealants for LCD and LED, touch panel adhesives, and microelectromechanical systems. This segment also provides color materials, including inkjet colorants, dyes for textiles and papers, and materials for thermal paper; catalysts for the production of acrylic and methacrylic acid; and polarizing films, inorganic polarizing plates, LCD projector parts, x-ray analytical equipment, and application products. Its Pharmaceuticals Business segment offers anti-cancer and cancer-related drugs, biosimilars, generic drugs, interventional radiology products, cardiovascular drugs, bulk drugs and intermediates of pharmaceuticals, and drugs for diagnosing cancer, as well as GlycoMark, a product as a marker of blood sugar control used for diabetes. The company's Safety Systems Business segment provides airbag inflators, micro gas generators for seatbelt pretensioners, and squibs. Its Other segment offers agricultural insecticides, herbicides, soil fumigants, and insanitary insecticides; and real estate leasing services. The company was formerly known as Nihon Kayaku Seizou Co., Ltd. and changed its name to Nippon Kayaku Co., Ltd. in 1945. Nippon Kayaku Co., Ltd. was incorporated in 1916 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.nipponkayaku.co.jp",
        "market_cap": 1340295296
    },
    "NPX.F": {
        "short_name": "NIPPON SANSO HOLDINGS",
        "long_name": "Nippon Sanso Holdings Corporation",
        "summary": "Nippon Sanso Holdings Corporation engages in the gas business in Japan, the United States, Europe, Asia, and Oceania. It operates through five segments: Gas Business in Japan; Gas Business in the United States; Gas Business in Europe; Gas Business in Asia and Oceania; and Thermos Business. The company offers oxygen, nitrogen, argon, carbon dioxide, helium, hydrogen, acetylene, and specialty gases; gas-related equipment; electronics-related equipment and installation; semiconductor manufacturing equipment; cutting and welding equipment; welding materials; plants and machinery; liquid petroleum gas and related equipment; medical-use gases, such as oxygen, nitrous oxide, etc.; medical equipment; and stable isotopes. It also manufactures and sells housewares, such as stainless-steel vacuum-insulated bottles and vacuum-insulated tumblers. The company was formerly known as Taiyo Nippon Sanso Corporation and changed its name to Nippon Sanso Holdings Corporation in October 2020. Nippon Sanso Holdings Corporation was founded in 1910 and is headquartered in Tokyo, Japan. Nippon Sanso Holdings Corporation is a subsidiary of Mitsubishi Chemical Holdings Corporation.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "142-0062",
        "website": "http://www.nipponsanso-hd.co.jp",
        "market_cap": 6801163264
    },
    "NSC.F": {
        "short_name": "NISSAN CHEMICAL CORP.",
        "long_name": "Nissan Chemical Corporation",
        "summary": "Nissan Chemical Corporation engages in the chemicals, performance materials, agricultural chemicals, pharmaceuticals, and advanced materials and planning businesses in Japan and internationally. Its chemical products include MELAMINE, an adhesive agent; high purity chemicals; AdBlue, an urea solution; FINEOXOCOL, a saturated fatty alcohol and acid; ammonia, sulfuric, and nitric acid; TEPIC, an epoxy compound; Melamine Cyanurate, a salt of melamine and iso cyanuric acid; Nissan Reishi, a health food; phenylphosphonic acid; HI-LITE, a chlorinated isocyanulate; and OPTBEADS, a melamine-formaldehyde resin and silica. The company offers performance materials comprising display, semiconductor, and inorganic materials; agricultural chemicals, such as herbicides, insecticides, fungicides, etc. for use on agricultural land, as well as in golf courses, parks, etc.; and drug substances for veterinary pharmaceuticals. It also provides pharmaceutical products, such as LIVALO, a cholesterol reduction agent; LANDEL and FINTE, a dual type calcium antagonist that blocks calcium channels; and custom manufacturing and process researching services for pharmaceutical ingredients. In addition, the company offers advanced materials comprising ECOPROMOTE, an environmental harmony material; coating solutions for printable thermoelectric materials; soluble hole transport materials for organic photoelectric conversion devices; NANOFIBERGEL, a life science material; FP001, a cell culture ingredient; and SUNCONNECT, an optical material. Further, it engages in the landscaping, engineering, fertilizer, plant engineering, environmental analysis, and transportation businesses. The company was formerly known as Nissan Chemical Industries, Ltd. and changed its name to Nissan Chemical Corporation in July 2018. Nissan Chemical Corporation was founded in 1887 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-6119",
        "website": "http://www.nissanchem.co.jp",
        "market_cap": 5960373760
    },
    "SEH.F": {
        "short_name": "SHIN-ETSU CHEM.",
        "long_name": "Shin-Etsu Chemical Co., Ltd.",
        "summary": "Shin-Etsu Chemical Co., Ltd. manufactures and sells polyvinyl chloride (PVC), semiconductor devices, silicones, and rare earth magnets worldwide. The company operates through PVC/Chlor-Alkali; Semiconductor Silicon; Silicones; Electronics and Functional Materials; Specialty Chemicals; and Processing, Trading & Specialized Services segments. It offers PVC for use in PVC pipes, plastic greenhouses, electric wire coating materials, vinyl windows, and siding materials; caustic soda for use in alumina, paper and pulp, soap and detergents, and super-absorbent polymers; and sodium hypochlorite. The company also provides semiconductor silicon wafers for use as substrate materials in smartphones, personal computers, electronic devices, data centers, and automobiles; and compound semiconductor products for outdoor displays, traffic lights, in-vehicle stop lamps, and sensor light sources. It offers silicone products for use in electric and electronic, automobile, construction, cosmetic, health care, and food industries; rare earth magnets used in automobile motors, power generators, industrial robots, home appliances, and hard disk drives; photoresists, photomask blanks, encapsulation materials, and pellicles; synthetic quartz products; and liquid fluoroelastomers. The company provides cellulose derivatives for use in various applications, such as pharmaceuticals, food, construction and civil engineering works, coatings, ceramics, paper processing, cosmetics, and toiletries applications; synthetic pheromones for agricultural pest control; POVAL, a functional resin; and silicon metal. Additionally, it offers automobile dashboard audio and air conditioners, silicon rubber glasses and catheters, wafer cases, various rollers for OA equipment, and vacuum assembling equipment. The company was formerly known as Shin-Etsu Nitrogen Fertilizer Co., Ltd. and changed its name to Shin-Etsu Chemical Co., Ltd. in 1940. The company was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.shinetsu.co.jp",
        "market_cap": 57695404032
    },
    "SHECF": {
        "short_name": "SHIN-ETSU CHEMICAL CO",
        "long_name": "Shin-Etsu Chemical Co., Ltd.",
        "summary": "Shin-Etsu Chemical Co., Ltd. manufactures and sells polyvinyl chloride (PVC), semiconductor devices, silicones, and rare earth magnets worldwide. The company operates through PVC/Chlor-Alkali; Semiconductor Silicon; Silicones; Electronics and Functional Materials; Specialty Chemicals; and Processing, Trading & Specialized Services segments. It offers PVC for use in PVC pipes, plastic greenhouses, electric wire coating materials, vinyl windows, and siding materials; caustic soda for use in alumina, paper and pulp, soap and detergents, and super-absorbent polymers; and sodium hypochlorite. The company also provides semiconductor silicon wafers for use as substrate materials in smartphones, personal computers, electronic devices, data centers, and automobiles; and compound semiconductor products for outdoor displays, traffic lights, in-vehicle stop lamps, and sensor light sources. It offers silicone products for use in electric and electronic, automobile, construction, cosmetic, health care, and food industries; rare earth magnets used in automobile motors, power generators, industrial robots, home appliances, and hard disk drives; photoresists, photomask blanks, encapsulation materials, and pellicles; synthetic quartz products; and liquid fluoroelastomers. The company provides cellulose derivatives for use in various applications, such as pharmaceuticals, food, construction and civil engineering works, coatings, ceramics, paper processing, cosmetics, and toiletries applications; synthetic pheromones for agricultural pest control; POVAL, a functional resin; and silicon metal. Additionally, it offers automobile dashboard audio and air conditioners, silicon rubber glasses and catheters, wafer cases, various rollers for OA equipment, and vacuum assembling equipment. The company was formerly known as Shin-Etsu Nitrogen Fertilizer Co., Ltd. and changed its name to Shin-Etsu Chemical Co., Ltd. in 1940. The company was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.shinetsu.co.jp",
        "market_cap": 69794004992
    },
    "SHECY": {
        "short_name": "SHIN-ETSU CHEMICAL CO",
        "long_name": "Shin-Etsu Chemical Co., Ltd.",
        "summary": "Shin-Etsu Chemical Co., Ltd. manufactures and sells polyvinyl chloride (PVC), semiconductor devices, silicones, and rare earth magnets worldwide. The company operates through PVC/Chlor-Alkali; Semiconductor Silicon; Silicones; Electronics and Functional Materials; Specialty Chemicals; and Processing, Trading & Specialized Services segments. It offers PVC for use in PVC pipes, plastic greenhouses, electric wire coating materials, vinyl windows, and siding materials; caustic soda for use in alumina, paper and pulp, soap and detergents, and super-absorbent polymers; and sodium hypochlorite. The company also provides semiconductor silicon wafers for use as substrate materials in smartphones, personal computers, electronic devices, data centers, and automobiles; and compound semiconductor products for outdoor displays, traffic lights, in-vehicle stop lamps, and sensor light sources. It offers silicone products for use in electric and electronic, automobile, construction, cosmetic, health care, and food industries; rare earth magnets used in automobile motors, power generators, industrial robots, home appliances, and hard disk drives; photoresists, photomask blanks, encapsulation materials, and pellicles; synthetic quartz products; and liquid fluoroelastomers. The company provides cellulose derivatives for use in various applications, such as pharmaceuticals, food, construction and civil engineering works, coatings, ceramics, paper processing, cosmetics, and toiletries applications; synthetic pheromones for agricultural pest control; POVAL, a functional resin; and silicon metal. Additionally, it offers automobile dashboard audio and air conditioners, silicon rubber glasses and catheters, wafer cases, various rollers for OA equipment, and vacuum assembling equipment. The company was formerly known as Shin-Etsu Nitrogen Fertilizer Co., Ltd. and changed its name to Shin-Etsu Chemical Co., Ltd. in 1940. The company was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.shinetsu.co.jp",
        "market_cap": 71413448704
    },
    "SHWDF": {
        "short_name": "SHOWA DENKO KK",
        "long_name": "Showa Denko K.K.",
        "summary": "Showa Denko K.K. operates as a chemical company in Japan and internationally. It operates through seven segments: Petrochemicals, Chemicals, Electronics, Inorganics, Aluminum, Showa Denko Materials, and Others. The Petrochemicals segment offers olefins, including ethylene, propylene, C4 fraction, cracked fuel oils, etc.; organic chemicals comprising acetaldehyde, acetic acid, vinyl and ethyl acetate, allyl alcohol, and allyl ester resin; and polypropylene. The Chemicals segment offers industrial gases, basic and functional chemicals, electronic chemicals, and coating materials. The Inorganics segment manufactures and sells polishing materials, abrasives, and refractories; and supplies graphite electrodes for electric steel making furnaces. The Aluminum segment offers aluminum capacitor foils and aluminum sheets; extruded and forged products, aluminum cylinders, cast rods of aluminum alloys, automobile molded products, heat exchangers, and power semiconductor cooling devices; and aluminum beverage cans. The Electronics segment offers HD media and SiC epitaxial wafers for power devices, aluminum and glass based hard disks, and aluminum substrates for hard disks; LED chips; and lithium ion batteries and fuel cell materials. The Showa Denko Materials segment provides electronics materials, printed wiring board materials, mobility components, and automotive and industrial batteries; and diagnostics services, as well as engages in the contracted manufacturing of regenerative medicine products. The Others segment sells chemicals, resins, metals, and electronic materials, as well as provides building materials. The company was incorporated in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8518",
        "website": "http://www.sdk.co.jp",
        "market_cap": 4425708032
    },
    "SHWDY": {
        "short_name": "SHOWA DENKO KK",
        "long_name": "Showa Denko K.K.",
        "summary": "Showa Denko K.K. operates as a chemical company in Japan and internationally. It operates through seven segments: Petrochemicals, Chemicals, Electronics, Inorganics, Aluminum, Showa Denko Materials, and Others. The Petrochemicals segment offers olefins, including ethylene, propylene, C4 fraction, cracked fuel oils, etc.; organic chemicals comprising acetaldehyde, acetic acid, vinyl and ethyl acetate, allyl alcohol, and allyl ester resin; and polypropylene. The Chemicals segment offers industrial gases, basic and functional chemicals, electronic chemicals, and coating materials. The Inorganics segment manufactures and sells polishing materials, abrasives, and refractories; and supplies graphite electrodes for electric steel making furnaces. The Aluminum segment offers aluminum capacitor foils and aluminum sheets; extruded and forged products, aluminum cylinders, cast rods of aluminum alloys, automobile molded products, heat exchangers, and power semiconductor cooling devices; and aluminum beverage cans. The Electronics segment offers HD media and SiC epitaxial wafers for power devices, aluminum and glass based hard disks, and aluminum substrates for hard disks; LED chips; and lithium ion batteries and fuel cell materials. The Showa Denko Materials segment provides electronics materials, printed wiring board materials, mobility components, and automotive and industrial batteries; and diagnostics services, as well as engages in the contracted manufacturing of regenerative medicine products. The Others segment sells chemicals, resins, metals, and electronic materials, as well as provides building materials. The company was incorporated in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8518",
        "website": "http://www.sdk.co.jp",
        "market_cap": 4932702208
    },
    "SMM.F": {
        "short_name": "SUMITOMO CHEM.",
        "long_name": "Sumitomo Chemical Company, Limited",
        "summary": "Sumitomo Chemical Company, Limited engages in the petrochemicals and plastics, energy and functional materials, IT-related chemicals, health and crop sciences, pharmaceuticals, and other businesses worldwide. Its Petrochemicals & Plastics segment offers synthetic resins, such as polyethylene, polypropylene, and polymethyl methacrylate resins; raw materials for synthetic fibers; and various industrial chemicals. The company's Energy & Functional Materials segment provides alumina and aluminum products used for energy products; polymer additives and rubber chemicals; synthetic rubber for tires, shoes, construction materials, and other applications; and engineering plastics and lithium-ion secondary battery materials for use in electronic components and next-generation vehicles. Its IT-Related Chemicals segment provides polarizing films, touch screen sensor panels, and color resists for LC and OLED displays; photoresists and high-purity chemicals for semiconductor manufacturing process; and compound semiconductor materials for antenna switches and other components of communication terminal equipment. The company's Health & Crop Sciences segment offers crop protection chemicals, fertilizers, feed additives, and household insecticides; active pharmaceutical ingredients and intermediates; and products to control infectious diseases. Its Pharmaceuticals segment provides prescription and diagnostic pharmaceuticals. The company's Others segment supplies electric power and steam; designs, constructs, and supervises chemical plants; provides transportation and warehousing services; and conducts physical property and environmental analysis. Sumitomo Chemical Company, Limited was founded in 1913 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8260",
        "website": "http://www.sumitomo-chem.co.jp",
        "market_cap": 7519692800
    },
    "SOMMY": {
        "short_name": "SUMITOMO CHEMICAL COMPANY",
        "long_name": "Sumitomo Chemical Company, Limited",
        "summary": "Sumitomo Chemical Company, Limited engages in the petrochemicals and plastics, energy and functional materials, IT-related chemicals, health and crop sciences, pharmaceuticals, and other businesses worldwide. Its Petrochemicals & Plastics segment offers synthetic resins, such as polyethylene, polypropylene, and polymethyl methacrylate resins; raw materials for synthetic fibers; and various industrial chemicals. The company's Energy & Functional Materials segment provides alumina and aluminum products used for energy products; polymer additives and rubber chemicals; synthetic rubber for tires, shoes, construction materials, and other applications; and engineering plastics and lithium-ion secondary battery materials for use in electronic components and next-generation vehicles. Its IT-Related Chemicals segment provides polarizing films, touch screen sensor panels, and color resists for LC and OLED displays; photoresists and high-purity chemicals for semiconductor manufacturing process; and compound semiconductor materials for antenna switches and other components of communication terminal equipment. The company's Health & Crop Sciences segment offers crop protection chemicals, fertilizers, feed additives, and household insecticides; active pharmaceutical ingredients and intermediates; and products to control infectious diseases. Its Pharmaceuticals segment provides prescription and diagnostic pharmaceuticals. The company's Others segment supplies electric power and steam; designs, constructs, and supervises chemical plants; provides transportation and warehousing services; and conducts physical property and environmental analysis. Sumitomo Chemical Company, Limited was founded in 1913 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8260",
        "website": "http://www.sumitomo-chem.co.jp",
        "market_cap": 9173070848
    },
    "SWD.F": {
        "short_name": "SHOWA DENKO K.K.",
        "long_name": "Showa Denko K.K.",
        "summary": "Showa Denko K.K. operates as a chemical company in Japan and internationally. It operates through seven segments: Petrochemicals, Chemicals, Electronics, Inorganics, Aluminum, Showa Denko Materials, and Others. The Petrochemicals segment offers olefins, including ethylene, propylene, C4 fraction, cracked fuel oils, etc.; organic chemicals comprising acetaldehyde, acetic acid, vinyl and ethyl acetate, allyl alcohol, and allyl ester resin; and polypropylene. The Chemicals segment offers industrial gases, basic and functional chemicals, electronic chemicals, and coating materials. The Inorganics segment manufactures and sells polishing materials, abrasives, and refractories; and supplies graphite electrodes for electric steel making furnaces. The Aluminum segment offers aluminum capacitor foils and aluminum sheets; extruded and forged products, aluminum cylinders, cast rods of aluminum alloys, automobile molded products, heat exchangers, and power semiconductor cooling devices; and aluminum beverage cans. The Electronics segment offers HD media and SiC epitaxial wafers for power devices, aluminum and glass based hard disks, and aluminum substrates for hard disks; LED chips; and lithium ion batteries and fuel cell materials. The Showa Denko Materials segment provides electronics materials, printed wiring board materials, mobility components, and automotive and industrial batteries; and diagnostics services, as well as engages in the contracted manufacturing of regenerative medicine products. The Others segment sells chemicals, resins, metals, and electronic materials, as well as provides building materials. The company was incorporated in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8518",
        "website": "http://www.sdk.co.jp",
        "market_cap": 3844391680
    },
    "TOS.F": {
        "short_name": "TOSOH CORP.",
        "long_name": "Tosoh Corporation",
        "summary": "Tosoh Corporation manufactures and sells basic chemicals, petrochemicals, specialty products, and fine chemicals worldwide. It operates through four segments: Petrochemical, Chlor-Alkali, Specialty, and Engineering. The company provides materials, including battery, fabricated quartzware, silica glass, thin film depositions, zeolites for catalysts and molecular sieves, zirconia injection mold components and compounds, zirconia grinding and dispersion media, and zirconia fine beads and powders. It also offers chromatographic columns, and media and diagnostic systems; clinical diagnostic systems; Portland cement and blast-furnace slag cement; and caustic soda, vinyl chloride monomer, calcium hypochlorite, and sodium bicarbonate. In addition, the company provides ethylene, propylene, C4 fraction, tertiary butyl alcohol, cumene, and aromatic compounds; and ethyleneamines, bromine, hydrobromic acids, flame retardants, non-aqueous solvents, chelating agents, ethylene dichloride, and sodium styrenesulfonate. Further, it offers polymers, such as ethylene vinyl-acetate copolymers, adhesive polymers, low and high-density polyethylene products, synthetic rubbers, functional polymers, and polyvinyl chloride pastes; and polyurethanes (PU), including methylene diphenyl diisocyanate, toluene diisocyanate, hexamethylene diisocyanate, adhesives, coating resins, elastomers, polyisocyanates for PU paints, and polyols. Additionally, it manufactures and sells water treatment systems; and engages in the construction and repair businesses. It also offers logistics, analytic, personnel management, and information technology services.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8623",
        "website": "http://www.tosoh.com",
        "market_cap": 4753088512
    },
    "TOSCF": {
        "short_name": "TOSOH CORP",
        "long_name": "Tosoh Corporation",
        "summary": "Tosoh Corporation manufactures and sells basic chemicals, petrochemicals, specialty products, and fine chemicals worldwide. It operates through four segments: Petrochemical, Chlor-Alkali, Specialty, and Engineering. The company provides materials, including battery, fabricated quartzware, silica glass, thin film depositions, zeolites for catalysts and molecular sieves, zirconia injection mold components and compounds, zirconia grinding and dispersion media, and zirconia fine beads and powders. It also offers chromatographic columns, and media and diagnostic systems; clinical diagnostic systems; Portland cement and blast-furnace slag cement; and caustic soda, vinyl chloride monomer, calcium hypochlorite, and sodium bicarbonate. In addition, the company provides ethylene, propylene, C4 fraction, tertiary butyl alcohol, cumene, and aromatic compounds; and ethyleneamines, bromine, hydrobromic acids, flame retardants, non-aqueous solvents, chelating agents, ethylene dichloride, and sodium styrenesulfonate. Further, it offers polymers, such as ethylene vinyl-acetate copolymers, adhesive polymers, low and high-density polyethylene products, synthetic rubbers, functional polymers, and polyvinyl chloride pastes; and polyurethanes (PU), including methylene diphenyl diisocyanate, toluene diisocyanate, hexamethylene diisocyanate, adhesives, coating resins, elastomers, polyisocyanates for PU paints, and polyols. Additionally, it manufactures and sells water treatment systems; and engages in the construction and repair businesses. It also offers logistics, analytic, personnel management, and information technology services.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8623",
        "website": "http://www.tosoh.com",
        "market_cap": 5766774784
    }
}