{
    "7426.T": {
        "short_name": "YAMADAI CORP",
        "long_name": "Yamadai Corporation",
        "summary": "Yamadai Corporation provides residential materials. Its residential materials include wood, building materials, residential equipment, plywood, etc. The company is also involved in the wood processing; anti-corrosion processing; manual drying processing; forest plantation; real estate rental; and residential buildings design, construction, and supervision businesses. Yamadai Corporation was founded in 1964 and is based in Ishinomaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ishinomaki",
        "zipcode": "986-0842",
        "website": "http://www.yamadai.com",
        "market_cap": "Small Cap"
    },
    "7808.T": {
        "short_name": "C.S. LUMBER CO INC",
        "long_name": "C.S. Lumber Co., Inc",
        "summary": "C.S. Lumber Co., Inc manufactures and sells timber, building materials, and sub-materials in Japan. It also operates as a general wooden building contractor; constructs standard wooden houses; transports pre-cut products; leases and manages real estate properties; and provides real estate brokerage services. The company was founded in 1984 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "262-0033",
        "website": "http://www.c-s-lumber.co.jp",
        "market_cap": "Mid Cap"
    },
    "7815.T": {
        "short_name": "TOKYO BOARD INDUSTRIES CO LTD",
        "long_name": "Tokyo Board Industries Co., Ltd.",
        "summary": "Tokyo Board Industries Co., Ltd. processes, manufactures, and sells wood chips using industrial and general waste in Japan. The company offers particle boards and plywood products. It is also involved in the collection and transportation of industrial waste; and general freight vehicle transportation business, as well as development and operation of commercial facilities. The company was founded in 1942 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "136-0082",
        "website": "http://www.t-b-i.co.jp",
        "market_cap": "Small Cap"
    },
    "7897.T": {
        "short_name": "HOKUSHIN CO LTD",
        "long_name": "Hokushin Co., Ltd.",
        "summary": "Hokushin Co., Ltd. manufactures and sells wood materials. The company was founded in 1931 and is headquartered in Kishiwada, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kishiwada",
        "zipcode": "596-8521",
        "website": "http://www.hokushinmdf.co.jp",
        "market_cap": "Mid Cap"
    },
    "7961.T": {
        "short_name": "KANEMATSU SUSTECH CORPORATION",
        "long_name": "Kanematsu Sustech Corporation",
        "summary": "Kanematsu Sustech Corporation provides ground stabilization services through various methods of construction. The company operates through Geo-Tech, Wood & Housing Materials, and CCTV System divisions. The Geo-Tech division offers ground stabilization services, such as ground resurfacing, cement foundation pile repairs, steel foundation pile repairs, and ecological lumber piles. This division also provides various types of ground inspections and sinkage repair services. The Wood & Housing Materials division offers preservative treated wood foundations, structural laminated lumber, and structural plywood, as well as outdoor products, support lumber, and LC-polyphenol treated lumber. This division also provides wood preservation treatment services; eco wood piles that are wooden piles to stabilize the foundations of structures; and household matchboxes. The CCTV System division distributes security monitoring devices and others under the WISENET name in Japan. The company was formerly known as Kanematsu-NNK Corporation and changed its name to Kanematsu Sustech Corporation in October 2016. Kanematsu Sustech Corporation was founded in 1934 and is headquartered in Tokyo, Japan. Kanematsu Sustech Corporation is a subsidiary of Kanematsu Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Lumber & Wood Production",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0007",
        "website": "http://www.knn.co.jp",
        "market_cap": "Mid Cap"
    }
}