{
    "1515.T": {
        "short_name": "NITTETSU MINING CO",
        "long_name": "Nittetsu Mining Co., Ltd.",
        "summary": "Nittetsu Mining Co., Ltd. engages in mining activities in Japan. The company operates through Non-Metallic Minerals, Metallic Minerals, Machinery & Environmental Engineering, Real Estate, and Renewable Energy segments. It mines for non-metallic minerals, including limestone, dolomite, crushed stone, calcium carbonate, silica rock, quicklime, hydrated lime, cement, gypsum, ready-mixed concrete and concrete products, petroleum products, coal, LPG, chips for pulp, and granulates; and metallic minerals, such as electrolytic copper, gold, silver, and copper concentrate. The company also offers mineral water and specialty papers; handles and transports mineral products; and provides technological consulting for mining and civil engineering. In addition, it develops and distributes machinery engineering products comprising dust collectors; crushing and grinding equipment; mining, construction-related, civil engineering, electric, and powder/fluid-related machinery; monorail for passenger transportation; ball valves; and environmental engineering products consisting of water treatment agents, deodorizers, and others, as well as offers maintenance/repair services for baryta machinery. Further, it rents office buildings, condominiums, commercial spaces, factories, and warehouses; sells real estate properties; generates solar and hydroelectric power; and supplies geothermal steam. Additionally, the company provides consulting services for geological surveys, geophysical exploration, test boring, and construction. Nittetsu Mining Co., Ltd. was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8377",
        "website": "http://www.nittetsukou.co.jp",
        "market_cap": "Large Cap"
    },
    "3023.T": {
        "short_name": "RASA CORPORATION",
        "long_name": "Rasa Corporation",
        "summary": "Rasa Corporation, a trading company, engages in supplying resources, metallic materials, industrial machinery, construction equipment, and other products in Japan. The company imports mineral sand products, such as zircon sand, rutile sand, ilmenite, etc.; and industrial materials, including phosphoric acid, anhydrous phosphoric acid, phosphorous acid, second phosphorus finished goods, malp, aluminum hydroxide, polychlorinated aluminum, aluminum sulfate, metallic manganese, metallic silicon and nickel, talc, China clay, silica, boron carbide, electrolytic manganese, etc. It also imports refractory raw materials comprising stabilized zirconia, fused zirconia mullite, zirconium oxychloride, silica sand, black lead like natural scale, spherical graphite, silicon carbide, brown and white alumina, TEL magnesia and spin flannel, melted silica, silica flower, temporary scorch alumina, brick crushing, boron carbide, sillimanite, etc. In addition, the company supplies industrial machineries, including pumps, valves, mixers, crushers, strainers, cyclones, pressure washers, etc.; and construction equipment, such as pipe jacking machines, hand held gas powered breakers, pipe cutting machines, concrete pumps/mixers, mini crawler cranes, etc. Further, it supplies environmental equipment comprising RASA slag granulation systems and PARA-ECO-recycling systems. Additionally, the company is involved in the supply of plastic resins and chemical products; manufacture of various plastic compounds and masterbatches, including PVC compounds; plant engineering and construction activities; and corporate real estate business. It also exports its products to China, Korea, Taiwan, and Australia. Rasa Corporation was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.rasaco.co.jp",
        "market_cap": "Large Cap"
    },
    "3036.T": {
        "short_name": "ALCONIX CORPORATION",
        "long_name": "ALCONIX Corporation",
        "summary": "ALCONIX Corporation imports, exports, and sells non-ferrous metal products or resources in Japan and internationally. The company is involved in the import, export, processing, and intermediate trading of rare metals and materials, such as tungsten, tantalum, titanium, molybdenum, rare earth and other rare metals, tin, nickel, and other LME metals, as well as scrapping of rare and noble metals. It also offers copper tubes and tanks for water supply/drains, heat exchangers, refrigerant, heating oil, and gas materials and equipment; aluminum coils and other aluminum products; plastic tubes; freon gas and other industrial gases; electronic materials for semiconductors; copper and copper-base alloy products; aluminum and office finished products; copper bands and plates; aluminum and copper scraps; and stainless steel and plastic products. In addition, the company manufactures and sells copper anodes and cathodes, copper sulfate, oxygen-free copper wire, bus bars and copper chloride/nickel anodes, nickel sulfate and acetate, nickel bromide, nickel chloride/potassium cyanide, boric acid and sulfamate, and sulfamic acid compounds; welding materials; tools and devices for non-destructive inspection; printing and marking equipment; and carbon and powder metallurgy products, and electrical components and materials. Further, it provides semiconductor packaging machines; prototype parts for automobiles; industrial robots, and machining tools and parts; electromagnetic valve parts; heater core parts; machined metal parts; housing construction materials; solar power generation equipment; and various types of brackets. The company was formerly known as Nissho Iwai Alconix Corporation and changed its name to ALCONIX Corporation in April 2005. ALCONIX Corporation was founded in 1981 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6112",
        "website": "http://www.alconix.com",
        "market_cap": "Large Cap"
    },
    "3168.T": {
        "short_name": "KUROTANI CORPORATION",
        "long_name": "Kurotani Corporation",
        "summary": "Kurotani Corporation collects, processes, manufactures, and sells various metals in Japan. The company operates through two segments, Nonferrous Metals; and Arts and Crafts. It recycles and sells industrial materials and metal scraps, as well as produces base metals that are used as raw materials to manufacture electrical wires and semiconductor base plates. The company also manufactures and sells copper alloy ingots, which are used in marine propellers, plumbing hardware, valves, and industrial machinery parts; and produces and sells works of fine arts, miniature gold statues, and bronze Buddha statues. Kurotani Corporation was founded in 1946 and is headquartered in Imizu, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Imizu",
        "zipcode": "934-8501",
        "website": "http://www.kurotani.co.jp",
        "market_cap": "Large Cap"
    },
    "5714.T": {
        "short_name": "DOWA HOLDINGS",
        "long_name": "Dowa Holdings Co., Ltd.",
        "summary": "Dowa Holdings Co., Ltd. engages in the environmental management and recycling, nonferrous metals, electronic materials, metal processing, and heat treatment businesses worldwide. The company's Environmental Management & Recycling segment offers intermediate waste treatment, controlled landfilling, and soil remediation services; metal, household appliance, and automobile recycling services; consulting on environmental matters; and environmental logistics services. Its Nonferrous Metals segment produces and sells gold, silver, copper, lead, zinc, zinc alloys, indium, platinum, palladium, rhodium, tin, antimony, nickel sulfate, bismuth, tellurium, and sulfuric acid. The company's Electronic Materials segment offers high-purity materials, GaAs substrate wafers, and light-emitting diodes, as well as silver, copper, metal, carrier, and ferrite powders. Its Metal Processing segment provides copper, brass, copper and nickel alloy strips, reflow tin plated strips, brass rods, forged brass products, precious metal plating products, and metal-ceramics substrates. The company's Heat Treatment segment is involved in the design, manufacture, and maintenance of various types of industrial furnaces and ancillary equipment, as well as heat and surface treatment. It also constructs and maintains plants and machinery, as well as heavy weight concrete work; manages golf courses and real estate; and provides general business, technological development support, analysis and evaluation, and environmental measurement services. The company was formerly known as Dowa Mining Co., Ltd. and changed its name to Dowa Holdings Co., Ltd. in October 2006. Dowa Holdings Co., Ltd. was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.dowa.co.jp",
        "market_cap": "Large Cap"
    },
    "5724.T": {
        "short_name": "ASAKA RIKEN CO LTD",
        "long_name": "Asaka Riken Co., Ltd.",
        "summary": "Asaka Riken Co., Ltd. engages in the precious metal, environmental, and other businesses in Japan. It collects precious metals, such as gold, silver, platinum, palladium, etc. from substrate scraps, defective products, and disposed products; provides precision cleaning services for shield plates and masks; regenerates and recycles components from defective products in the production process; and collects and evaluates valuable metals from dental scraps. The company also collects and recycles waste solutions of ferric chloride and cupric chloride, as well as offers coagulant for drainage treatment in the sewer system and coagulation/precipitation agent for treatment of various types of factory effluent and animal manure. In addition, it offers filter materials for purified water, as well as designs/constructs filter systems; and develops, manufactures, and sells photocatalyst materials for environmental purification. Further, the company develops and sells various data measurement processing systems and automatic measuring systems; and develops other network systems, such as Intranet/Internet application systems. Asaka Riken Co., Ltd. was founded in 1969 and is headquartered in Koriyama, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Koriyama",
        "zipcode": "963-0725",
        "website": "http://www.asaka.co.jp",
        "market_cap": "Mid Cap"
    },
    "5726.T": {
        "short_name": "OSAKA TITANIUM TECHNOLOGIES",
        "long_name": "OSAKA Titanium technologies Co.,Ltd.",
        "summary": "OSAKA Titanium technologies Co.,Ltd. manufactures and sells titanium products. The company offers titanium sponges, titanium ingots, titanium tetrachloride, titanium tetrachloride aqueous solutions, and ferro-titanium products; and high-purity titanium, silicon monoxide, and photocatalysts, as well as gas-atomized titanium powder and titanium hydride-dehydride powder. Its products are used in various applications, such as aircraft engine components, power plants, petrochemical and seawater desalination plants, and sheets for heat exchangers used in ships and LNG manufacturing plants; medical parts, packaging materials, negative electrode materials, sintered parts, personal computers, tablets/smartphones, and liquid crystal televisions; digital home appliances; and semiconductors and other materials in the electronics industry. The company was formerly known as Sumitomo Titanium Corporation and changed its name to OSAKA Titanium technologies Co.,Ltd. in 2007. OSAKA Titanium technologies Co.,Ltd. was founded in 1952 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-8533",
        "website": "http://www.osaka-ti.co.jp",
        "market_cap": "Large Cap"
    },
    "5727.T": {
        "short_name": "TOHO TITANIUM CO",
        "long_name": "Toho Titanium Co., Ltd.",
        "summary": "Toho Titanium Co., Ltd. manufactures and sells titanium metals, catalysts for propylene polymerization, and electronic materials in Japan. It offers titanium metals, such as titanium sponge, titanium ingots, titanium powder, and titanium products. The company also provides propylene polymerization catalysts for producing polypropylene. In addition, it offers electronic materials, including titanium dioxide for use in multi-layered ceramic capacitors (MLCC), positive temperature coefficient thermistors, dielectric filters, and piezo injector products, as well as an additive for optical lenses, and medicines and food; and ultra-fine nickel powder for use as an internal electrodes of MLCCs. Further, the company offers chemicals, such as titanium tetrachloride for the manufacture of titanium sponge, high purity titanium dioxide, barium titanate, polymerization catalyst, and titanium tetrachloride aqueous solutions; titanium tetrachloride aqueous solutions for use in cosmetics, pigments, and barium titanate applications; and potassium titanates. Additionally, it provides lanthanum lithium titanate ceramics for next generation battery application; and WEBTi, a porous titanium sheet for use in filter, electrode, noise absorber, and photocatalyst applications. The company was incorporated in 1948 and is headquartered in Chigasaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-0005",
        "website": "http://www.toho-titanium.co.jp",
        "market_cap": "Large Cap"
    },
    "5781.T": {
        "short_name": "TOHO KINZOKU(METAL)",
        "long_name": "Toho Kinzoku Co., Ltd.",
        "summary": "Toho Kinzoku Co., Ltd. manufactures and sells tungsten, molybdenum, and refractory metal products in Japan. Its products include tungsten/molybdenum products, such as wires, rods, plates, sheet processed products, discharge lamp electrodes, electron tube electrodes, discharge needles, and high temperature atmosphere parts; molybdenum parts for magnetron; copper tungsten heat sinks; tungsten and molybdenum alloy products; TIG welding rods; and welding tungsten electrode rods. The company also offers cemented carbide products, electrical contact products, civil engineering tools, product manufacturing machinery and equipment, and rare metal alloy products. Its products are primarily used for powder metallurgy and machining. Toho Kinzoku Co. was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0051",
        "website": "http://www.tohokinzoku.co.jp",
        "market_cap": "Mid Cap"
    },
    "DMI.F": {
        "short_name": "DOWA HOLDINGS INC.",
        "long_name": "Dowa Holdings Co., Ltd.",
        "summary": "Dowa Holdings Co., Ltd. engages in the environmental management and recycling, nonferrous metals, electronic materials, metal processing, and heat treatment businesses worldwide. The company's Environmental Management & Recycling segment offers intermediate waste treatment, controlled landfilling, and soil remediation services; metal, household appliance, and automobile recycling services; consulting on environmental matters; and environmental logistics services. Its Nonferrous Metals segment produces and sells gold, silver, copper, lead, zinc, zinc alloys, indium, platinum, palladium, rhodium, tin, antimony, nickel sulfate, bismuth, tellurium, and sulfuric acid. The company's Electronic Materials segment offers high-purity materials, GaAs substrate wafers, and light-emitting diodes, as well as silver, copper, metal, carrier, and ferrite powders. Its Metal Processing segment provides copper, brass, copper and nickel alloy strips, reflow tin plated strips, brass rods, forged brass products, precious metal plating products, and metal-ceramics substrates. The company's Heat Treatment segment is involved in the design, manufacture, and maintenance of various types of industrial furnaces and ancillary equipment, as well as heat and surface treatment. It also constructs and maintains plants and machinery, as well as heavy weight concrete work; manages golf courses and real estate; and provides general business, technological development support, analysis and evaluation, and environmental measurement services. The company was formerly known as Dowa Mining Co., Ltd. and changed its name to Dowa Holdings Co., Ltd. in October 2006. Dowa Holdings Co., Ltd. was founded in 1884 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.dowa.co.jp",
        "market_cap": "Mid Cap"
    },
    "MUJ.F": {
        "short_name": "MITSUBISHI MAT.",
        "long_name": "Mitsubishi Materials Corporation",
        "summary": "Mitsubishi Materials Corporation, together with its subsidiaries, manufactures and sells cement products, metals, materials and tools, and electronic materials. It produces and sells cement, soil stabilizing cement, concrete repair materials, premixed grouting mortars for semi-flexible, water-retaining pavement, non-shrink grout mortars, aggregates, and tools. The company also engages in mining, smelting, and refining copper, copper alloy products, gold, silver, precious metal clay and functional materials. In addition, it provides cemented carbide products and sintering parts for automotive components; and functional materials, chemical products, and electronic devices, as well as polycrystalline silicon and chlorosilane gas. Further, the company offers aluminum sheets, plates, foils, extruded products, cans, and bottles; and engages in the renewable energy activities comprising geothermal, solar, and hydraulic power generation, as well as sells coal and recycles radioactive waste. It has operations in Europe, East Asia, North America, Southeast Asia, Japan, South America, and Oceania. The company was founded in 1871 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8117",
        "website": "http://www.mmc.co.jp",
        "market_cap": "Mid Cap"
    },
    "S19.F": {
        "short_name": "SUMITOMO MET.MNG",
        "long_name": "Sumitomo Metal Mining Co., Ltd.",
        "summary": "Sumitomo Metal Mining Co., Ltd., together with its subsidiaries, engages in mining, smelting, and refining non-ferrous metals in Japan and internationally. It operates through three segments: Mineral Resources, Smelting & Refining, and Materials. The company provides metal products, including copper, nickel/cobalt, gold/precious metal, and other deposits. It also offers Battery Materials, such as nickel hydroxides and lithium nickel-cobalt-aluminum oxides; crystal materials, including lithium tantalates/lithium niobates, optical isolators, and faraday rotators; powder materials comprising thick film pastes, nickel powders, fine copper powders, nickel oxides, near-infrared shielding materials, deep-tinting materials, sputtering targets/tablets, electromagnetic sheets and coils, rare earth magnetic materials, and lubricants; package materials consisting of copper-clad polyimide films and printed wiring boards; automotive/chemical, hydro processing (HPC), rejuvenation and regeneration of HPC, and petrochemical catalysts products; construction materials; and terminal and connectors, and lens barrels. In addition, the company is involved in the water and precious recycling; water treatment and environment-related engineering; sterilization and property modification by irradiation; and domestic marine transportation businesses. Additionally, it engages in the real estate and technical engineering businesses. The company was formerly known as Seika Kogyo (Mining) Co., Ltd. and changed its name to Sumitomo Metal Mining Co., Ltd. in June 1952. Sumitomo Metal Mining Co., Ltd. was founded in 1590 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8716",
        "website": "http://www.smm.co.jp",
        "market_cap": "Mid Cap"
    },
    "S5M.F": {
        "short_name": "OSAKA TITANIUM TECHNO.CO.",
        "long_name": "OSAKA Titanium technologies Co.,Ltd.",
        "summary": "OSAKA Titanium technologies Co.,Ltd. manufactures and sells titanium products. The company offers titanium sponges, titanium ingots, titanium tetrachloride, titanium tetrachloride aqueous solutions, and ferro-titanium products; and high-purity titanium, silicon monoxide, and photocatalysts, as well as gas-atomized titanium powder and titanium hydride-dehydride powder. Its products are used in various applications, such as aircraft engine components, power plants, petrochemical and seawater desalination plants, and sheets for heat exchangers used in ships and LNG manufacturing plants; medical parts, packaging materials, negative electrode materials, sintered parts, personal computers, tablets/smartphones, and liquid crystal televisions; digital home appliances; and semiconductors and other materials in the electronics industry. The company was formerly known as Sumitomo Titanium Corporation and changed its name to OSAKA Titanium technologies Co.,Ltd. in 2007. OSAKA Titanium technologies Co.,Ltd. was founded in 1952 and is headquartered in Amagasaki, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-8533",
        "website": "http://www.osaka-ti.co.jp",
        "market_cap": "Small Cap"
    },
    "SMMYY": {
        "short_name": "SUMITOMO METAL MINING CO",
        "long_name": "Sumitomo Metal Mining Co., Ltd.",
        "summary": "Sumitomo Metal Mining Co., Ltd., together with its subsidiaries, engages in mining, smelting, and refining non-ferrous metals in Japan and internationally. It operates through three segments: Mineral Resources, Smelting & Refining, and Materials. The company provides metal products, including copper, nickel/cobalt, gold/precious metal, and other deposits. It also offers Battery Materials, such as nickel hydroxides and lithium nickel-cobalt-aluminum oxides; crystal materials, including lithium tantalates/lithium niobates, optical isolators, and faraday rotators; powder materials comprising thick film pastes, nickel powders, fine copper powders, nickel oxides, near-infrared shielding materials, deep-tinting materials, sputtering targets/tablets, electromagnetic sheets and coils, rare earth magnetic materials, and lubricants; package materials consisting of copper-clad polyimide films and printed wiring boards; automotive/chemical, hydro processing (HPC), rejuvenation and regeneration of HPC, and petrochemical catalysts products; construction materials; and terminal and connectors, and lens barrels. In addition, the company is involved in the water and precious recycling; water treatment and environment-related engineering; sterilization and property modification by irradiation; and domestic marine transportation businesses. Additionally, it engages in the real estate and technical engineering businesses. The company was formerly known as Seika Kogyo (Mining) Co., Ltd. and changed its name to Sumitomo Metal Mining Co., Ltd. in June 1952. Sumitomo Metal Mining Co., Ltd. was founded in 1590 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8716",
        "website": "http://www.smm.co.jp",
        "market_cap": "Large Cap"
    },
    "T62.F": {
        "short_name": "TOHO ZINC",
        "long_name": "Toho Zinc Co., Ltd.",
        "summary": "Toho Zinc Co., Ltd. engages in the smelting and refining, mineral resources, electronic components and materials, environment and recycling, and building materials businesses in Japan. The company offers electrolytic zinc, die-casting zinc alloys, zinc powder, cadmium oxide, sulfuric acid, electrolytic lead, lead alloys, and electrolytic silver and bismuth. It also operates zinc and lead mines; and produces iron and amorphous powders, as well as Fe-Al-Si based powder core materials for use in automotive electronics, office automation equipment, and industrial equipment. In addition, the company provides MAIRON and ATOMIRON electrolytic irons; gold, silver, nickel, tin, and reflow tin electro plates; and machine parts, such as balancing weights, powdered metallurgy products, molds, etc. Further, it recycles zinc oxide from electric furnace dust and small rechargeable batteries; and offers SOFT CALM sound insulation materials. Additionally, the company provides X-ray protection and shielding lead-based building materials for use by housing manufacturers, and medical and industrial fields. Toho Zinc Co., Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8207",
        "website": "http://www.toho-zinc.co.jp",
        "market_cap": "Small Cap"
    }
}