{
    "3513.T": {
        "short_name": "ICHIKAWA CO LTD",
        "long_name": "Ichikawa Co., Ltd.",
        "summary": "Ichikawa Co., Ltd. manufactures and sells paper making equipment and industrial felts in Japan and internationally. It offers paper making press felts and belts, and shoe press and transfer belts; industrial products, such as heat-resistant conveyance equipment and cushioning material for use in the manufacture of car bodies, aluminum parts, wall materials, carports, consumer electronics, smartphones, tablets, aluminum sash products, printed circuit boards, flexible boards, and clothing; and felts for slate. The company was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3708.T": {
        "short_name": "TOKUSHU TOKAI PAPER CO LTD",
        "long_name": "Tokushu Tokai Paper Co., Ltd.",
        "summary": "Tokushu Tokai Paper Co., Ltd. manufactures, processes, and sells paper products in Japan. It offers special material products, such as fancy, high-grade printer, canvas, functional, security, and information-use papers, as well as papers for protection and preservation. The company also provides industrial material products comprising containerboards, kraft papers, and converting papers. In addition, it offers household products, including paper towels, paper for food material, paper wipers, gifts, toilet papers, and laminated products. Further, the company is involved in manufacturing and sale of paper pulps, special functional papers, protective papers, and other papers used in electronics industry; purchase and sale of paper stocks, etc.; transportation and work in rail yard services; collection, processing, transport, and sale/purchase of waste materials; production of whisky; and warehousing, leasing, transportation, and selling of liquor products. Additionally, it engages in the civil engineering, building, landscape gardening, forestry, sightseeing, and other businesses. Tokushu Tokai Paper Co., Ltd. was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3861.T": {
        "short_name": "OJI HOLDINGS CORP",
        "long_name": "Oji Holdings Corporation",
        "summary": "Oji Holdings Corporation, together with its subsidiaries, engages in the pulp and paper business Japan and internationally. It operates in four segments: Household and Industrial Materials, Functional Materials, Forest Resources and Environment Marketing, and Printing and Communications Media. The Household and Industrial Materials segment offers containerboards, corrugated containers, boxboard and corrugated cartons, packaging papers, paper bags, household paper, and disposable papers. It also provides tissue, toilet tissue, paper diapers, and wet wipes. The Functional Materials segment offers specialty paper, thermal paper, adhesive products, and films. The Forest Resources and Environment Marketing segment engages in the pulp, energy, plantation, and lumber processing. The Printing and Communications Media segment provides newsprint, printing, publication, and communication paper. The company also engages in the real estate, engineering, trading, logistics, businesses, etc. The company was formerly known as Oji Paper Co., Ltd. and changed its name to Oji Holdings Corporation in October 2012. Oji Holdings Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3865.T": {
        "short_name": "HOKUETSU CORPORATION",
        "long_name": "Hokuetsu Corporation",
        "summary": "Hokuetsu Corporation manufactures and sells paper products in Japan, the United State, China, rest of Asia, and internationally. It operates in two segments, Paper and Pulp Business, and Packaging and Paper Processing Business. The company offers printing and communication papers for books, magazines, catalogs, and brochures; and uncoated printing papers and colored wood-free papers. It also provides white paperboard, coated duplex board, cast coated paper, etc. for various packages, catalogs, POP advertising, and postcards, as well as the covers of publications and others. In addition, the company offers premium printing papers, fancy papers, communication papers, papers for industrial use, specialty processed products, specialty fiber boards, and others; decorative and functional papers; and wood products and glass fiber sheets. Further, it offers paper, food, and liquid package cartons containers, as well as confectionery boxes; processed paper for cosmetics and OTC pharmaceutical packaging; milk and drink cartons under the Tohei Pak brand name; and adhesive postcard papers, abrasive-coated base papers, chip carrier tape base paper, mark sheet paper, business forms, and communication media products. Additionally, the company engages in waste paper wholesale, construction, transportation, warehousing, investment, data processing service, and other businesses. The company was formerly known as Hokuetsu Kishu Paper Co., Ltd. and changed its name to Hokuetsu Corporation in July 2018. Hokuetsu Corporation was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3877.T": {
        "short_name": "CHUETSU PULP & PAPER",
        "long_name": "Chuetsu Pulp & Paper Co., Ltd.",
        "summary": "Chuetsu Pulp & Paper Co., Ltd. engages in the production, processing, and sales of paper, pulp, and related by-products. It provides printing, information, wrapping, processing, and bamboo papers, as well as newspapers and paperboards. The company is also involved in the forestry, lumbering, and timber processing activities; manufacture, processing, and sales of chemicals; selling, management, brokerage, and leasing of real estate properties; management of sports facilities; and mining, warehousing, and transportation activities, as well as electricity supply activities. In addition, it engages in the trading and greening business construction. The company was founded in 1947 and is headquartered in Takaoka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Takaoka"
    },
    "3878.T": {
        "short_name": "TOMOEGAWA PAPER CO",
        "long_name": "Tomoegawa Co., Ltd.",
        "summary": "Tomoegawa Co., Ltd. manufactures, processes, and sells electronics parts, display parts, fine particles, functional sheets, and specialty paper products primarily in Japan. It offers heat/electricity/electromagnetic wave control related products, such as high frequency support electromagnetic wave absorption sheets, high insulation/heat conduction/heat resistant adhesive sheets, low-induction/low-dielectric tangent adhesive sheets, adhesive and re-affixable heat conduction sheets, and conductive adhesive sheets, as well as functional sheets for engineering plastic integral molding; and electronics parts, including lead frame fixing tapes, adhesive tapes, and electrostatic chucks, as well as lids for hermetic seal packages. The company also provides display components, such as optical adhesive, light control, and hard coat films. In addition, it offers fine particle materials, such as magnetic toners, non-magnetic toners, full color toners, and lower energy fixable type toners; information printing materials comprising inkjet, laser printer, and thermal recording papers; magnetic sheet materials consisting of magnetic tickets and prepaid cards; and special fiber sheets, including stainless fiber and fluorine fiber sheets, as well as distributes polyethylene non-woven fabrics under the TYVEK name. Further, the company provides electrical insulating, telecommunications, disinfecting, and ultra-lightweight printing papers; Tomoe River FP, information recording sheets, and tracing papers for use in printing; conductive, absorbing, sterilization bag, handling release, and insulating papers for industrial use; and impact-absorption films, optical fiber sheet optical plug assembly cleaners, copper fiber sheets, and light parts and related products. Tomoegawa Co., Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3880.T": {
        "short_name": "DAIO PAPER CORP",
        "long_name": "Daio Paper Corporation",
        "summary": "Daio Paper Corporation operates as a paper manufacturer in Japan and internationally. The company operates through two segments, Paper and Paperboard business, and Home and Personal Care business. It manufactures, processes, and sells paper, paperboard, pulp, and their by-products, as well as commodities and miscellaneous goods. The company also offers newsprint, publication, printing, communication, wrapping, recycled-content colored construction, and self-adhesive papers; containerboard and corrugated container products; functional materials for use in a range of fields, including food packaging, industrial materials, medical care, construction, agriculture, and electrical and electronic sectors; and home and personal care products, such as facial and toilet tissues, diapers, paper towels, sanitary napkins, kitchen papers and towel, paper napkins, disposable diapers, wet wipes, specialty papers, household papers, processed paper products, etc. In addition, it is involved in the manufacture, processing, and sale of functional added films, adhesive sheets, and synthetic resin material, including adhesives; and design, installation, purchase, and sale of plants; buying and selling of raw materials and fuel; and cellulose nanofiber business. The company was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3892.T": {
        "short_name": "OKAYAMA PAPER INDUSTRIES",
        "long_name": "Okayama Paper Industries Co., Ltd.",
        "summary": "Okayama Paper Industries Co., Ltd. manufactures and sells paper products. It offers cardboard, medium core paper, paper tube base paper, and decorative corrugated cardboard products. The company was founded in 1907 and is headquartered in Okayama, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Okayama"
    },
    "3895.T": {
        "short_name": "HAVIX CORP",
        "long_name": "Havix Corporation",
        "summary": "Havix Corporation engages in non-woven fabric and paper related businesses in Japan. It offers pulp nonwoven fabrics; processed pulp nonwoven fabrics for business use and home use; synthetic composite nonwoven fabrics; and sanitary paper, such as disposable diapers and sanitary supplies. It serves sanitary materials and food service industries. The company was founded in 1950 and is headquartered in Gifu, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Gifu"
    },
    "3955.T": {
        "short_name": "IMURA ENVELOPE",
        "long_name": "Imura Envelope Co., Inc.",
        "summary": "Imura Envelope Co., Inc. engages in the manufacture and sale of paper, stationery, and other products in Japan. The company offers paper products, such as envelopes and bags. It is also involved in the planning and production of print and direct mail; and provision of sealing products, shipping, storage, and information processing businesses. In addition, the company engages in the advertising agency business; sale of computers and peripheral equipment; and development and production of software, as well as provides inkjet printing services. Imura Envelope Co., Inc. was founded in 1917 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "57T.F": {
        "short_name": "LINTEC CORP.",
        "long_name": "LINTEC Corporation",
        "summary": "LINTEC Corporation develops, manufactures, and sells adhesive-related products in Japan and internationally. It operates through three segments: Printing and Industrial Materials Products, Electronic and Optical Products, and Paper and Converted Products. The company's Printing and Industrial Materials Products segment offers adhesive products for seals and labels, labeling machines, automobile-use adhesive products, industrial-use adhesive tapes, window films, films for outdoor signs and advertising, and interior finishing mounting films. Its Electronic and Optical Products segment provides semiconductor-related adhesive tapes and equipment, multilayer ceramic capacitor related tapes, and optical display-related adhesive products. The company's Paper and Converted Products segment offers color papers for envelopes, colored construction papers, special function papers, high-grade printing papers, high-grade papers for paper products, release papers for adhesive products, release films for optical-related products, casting papers for synthetic leather, and casting papers for carbon fiber composite materials. The company was formerly known as FSK Corporation and changed its name to LINTEC Corporation in 1990. LINTEC Corporation was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7487.T": {
        "short_name": "OZU CORP",
        "long_name": "Ozu Corporation",
        "summary": "Ozu Corporation imports, processes, sells, and exports nonwoven fabrics for electronics, medical use, cosmetics, and industrial materials in Japan and internationally. It also offers paper and paper products. The company was founded in 1653 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7966.T": {
        "short_name": "LINTEC CORP",
        "long_name": "LINTEC Corporation",
        "summary": "LINTEC Corporation develops, manufactures, and sells adhesive-related products in Japan and internationally. It operates through three segments: Printing and Industrial Materials Products, Electronic and Optical Products, and Paper and Converted Products. The company's Printing and Industrial Materials Products segment offers adhesive products for seals and labels, labeling machines, automobile-use adhesive products, industrial-use adhesive tapes, window films, films for outdoor signs and advertising, and interior finishing mounting films. Its Electronic and Optical Products segment provides semiconductor-related adhesive tapes and equipment, multilayer ceramic capacitor related tapes, and optical display-related adhesive products. The company's Paper and Converted Products segment offers color papers for envelopes, colored construction papers, special function papers, high-grade printing papers, high-grade papers for paper products, release papers for adhesive products, release films for optical-related products, casting papers for synthetic leather, and casting papers for carbon fiber composite materials. The company was formerly known as FSK Corporation and changed its name to LINTEC Corporation in 1990. LINTEC Corporation was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9274.T": {
        "short_name": "KOKUSAI PULP & PAPER CO LTD",
        "long_name": "Kokusai Pulp&Paper Co.,Ltd.",
        "summary": "Kokusai Pulp & Paper Co., Ltd., a paper-trading company, engages in buying, selling, importing, and exporting papers, paperboards, paper processed products, pulp, recovered papers, chemical products, machines related to paper, packaging and wrapping materials, and other related products. It provides papers for newspapers, printing, and communications; packing materials for protecting products and wrapping paper; pulp and recovered paper; and functional paper and other related products. The company also engages in the collection and sale of waste paper; and possession and lease of real estate and warehousing. In addition, it offers Office ecomo, a recycling system for confidential documents generated in corporate offices; Town ecomo, a recycling system in which the paper waste generated by households is collected and recycled; web solutions for business solutions that utilize the Internet; and planning and proposing package design to filling and distributing coffee beans to customers. Kokusai Pulp & Paper Co., Ltd. was founded in 1924 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9929.T": {
        "short_name": "HEIWA PAPER CO LTD",
        "long_name": "Heiwa Paper Co.,Ltd.",
        "summary": "Heiwa Paper Co.,Ltd. engages in paper trading activities in Japan and internationally. It imports, develops, sells, and exports specialty papers, high-grade papers, industrial papers, and other paper materials. The company also provides fancy papers, fine boards, printing papers, and basic papers; and engages in the development and commercialization of paper products. Heiwa Paper Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DPR.F": {
        "short_name": "DAIO PAPER CORP.",
        "long_name": "Daio Paper Corporation",
        "summary": "Daio Paper Corporation operates as a paper manufacturer in Japan and internationally. The company operates through two segments, Paper and Paperboard business, and Home and Personal Care business. It manufactures, processes, and sells paper, paperboard, pulp, and their by-products, as well as commodities and miscellaneous goods. The company also offers newsprint, publication, printing, communication, wrapping, recycled-content colored construction, and self-adhesive papers; containerboard and corrugated container products; functional materials for use in a range of fields, including food packaging, industrial materials, medical care, construction, agriculture, and electrical and electronic sectors; and home and personal care products, such as facial and toilet tissues, diapers, paper towels, sanitary napkins, kitchen papers and towel, paper napkins, disposable diapers, wet wipes, specialty papers, household papers, processed paper products, etc. In addition, it is involved in the manufacture, processing, and sale of functional added films, adhesive sheets, and synthetic resin material, including adhesives; and design, installation, purchase, and sale of plants; buying and selling of raw materials and fuel; and cellulose nanofiber business. The company was founded in 1943 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "HPE.F": {
        "short_name": "HOKUETSU",
        "long_name": "Hokuetsu Corporation",
        "summary": "Hokuetsu Corporation manufactures and sells paper products in Japan, the United State, China, rest of Asia, and internationally. It operates in two segments, Paper and Pulp Business, and Packaging and Paper Processing Business. The company offers printing and communication papers for books, magazines, catalogs, and brochures; and uncoated printing papers and colored wood-free papers. It also provides white paperboard, coated duplex board, cast coated paper, etc. for various packages, catalogs, POP advertising, and postcards, as well as the covers of publications and others. In addition, the company offers premium printing papers, fancy papers, communication papers, papers for industrial use, specialty processed products, specialty fiber boards, and others; decorative and functional papers; and wood products and glass fiber sheets. Further, it offers paper, food, and liquid package cartons containers, as well as confectionery boxes; processed paper for cosmetics and OTC pharmaceutical packaging; milk and drink cartons under the Tohei Pak brand name; and adhesive postcard papers, abrasive-coated base papers, chip carrier tape base paper, mark sheet paper, business forms, and communication media products. Additionally, the company engages in waste paper wholesale, construction, transportation, warehousing, investment, data processing service, and other businesses. The company was formerly known as Hokuetsu Kishu Paper Co., Ltd. and changed its name to Hokuetsu Corporation in July 2018. Hokuetsu Corporation was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "LNTEF": {
        "short_name": "LINTEC CORP",
        "long_name": "LINTEC Corporation",
        "summary": "LINTEC Corporation develops, manufactures, and sells adhesive-related products in Japan and internationally. It operates through three segments: Printing and Industrial Materials Products, Electronic and Optical Products, and Paper and Converted Products. The company's Printing and Industrial Materials Products segment offers adhesive products for seals and labels, labeling machines, automobile-use adhesive products, industrial-use adhesive tapes, window films, films for outdoor signs and advertising, and interior finishing mounting films. Its Electronic and Optical Products segment provides semiconductor-related adhesive tapes and equipment, multilayer ceramic capacitor related tapes, and optical display-related adhesive products. The company's Paper and Converted Products segment offers color papers for envelopes, colored construction papers, special function papers, high-grade printing papers, high-grade papers for paper products, release papers for adhesive products, release films for optical-related products, casting papers for synthetic leather, and casting papers for carbon fiber composite materials. The company was formerly known as FSK Corporation and changed its name to LINTEC Corporation in 1990. LINTEC Corporation was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MPX.F": {
        "short_name": "MITSUBISHI PAPER M.",
        "long_name": "Mitsubishi Paper Mills Limited",
        "summary": "Mitsubishi Paper Mills Limited, together with its subsidiaries, produces, processes, and sells paper, pulp, and photosensitive materials in Japan, Europe, rest of Asia, North America, and internationally. The company operates in four segments: Paper and Pulp, Imaging Media, Speciality Materials, and Warehouse and Transportation. It offers writing and printing papers, photo-sensitive printing plates, inkjet papers, photographic materials, direct platemaking systems and graphic arts film materials, inkjet media, rewritable thermal recording materials, battery separators, air filters, production inkjet papers, electronic materials, silver nano particle inks, SF films, dye sensitized solar cells, and functional papers. The company also provides warehousing and carrying services; thermal engineering, heat management, and cooling solutions; Mydome, a thick nonwoven fabric; and SaiVis, a screen film. In addition, it is involved in engineering business. The company was formerly known as Mitsubishi Paper Mills Company and changed its name to Mitsubishi Paper Mills Limited in November 1917. Mitsubishi Paper Mills Limited was founded in 1898 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OJI.F": {
        "short_name": "OJI HOLDINGS CORP.",
        "long_name": "Oji Holdings Corporation",
        "summary": "Oji Holdings Corporation, together with its subsidiaries, engages in the pulp and paper business Japan and internationally. It operates in four segments: Household and Industrial Materials, Functional Materials, Forest Resources and Environment Marketing, and Printing and Communications Media. The Household and Industrial Materials segment offers containerboards, corrugated containers, boxboard and corrugated cartons, packaging papers, paper bags, household paper, and disposable papers. It also provides tissue, toilet tissue, paper diapers, and wet wipes. The Functional Materials segment offers specialty paper, thermal paper, adhesive products, and films. The Forest Resources and Environment Marketing segment engages in the pulp, energy, plantation, and lumber processing. The Printing and Communications Media segment provides newsprint, printing, publication, and communication paper. The company also engages in the real estate, engineering, trading, logistics, businesses, etc. The company was formerly known as Oji Paper Co., Ltd. and changed its name to Oji Holdings Corporation in October 2012. Oji Holdings Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "OJIPY": {
        "short_name": "OJI HOLDINGS CORP",
        "long_name": "Oji Holdings Corporation",
        "summary": "Oji Holdings Corporation, together with its subsidiaries, engages in the pulp and paper business Japan and internationally. It operates in four segments: Household and Industrial Materials, Functional Materials, Forest Resources and Environment Marketing, and Printing and Communications Media. The Household and Industrial Materials segment offers containerboards, corrugated containers, boxboard and corrugated cartons, packaging papers, paper bags, household paper, and disposable papers. It also provides tissue, toilet tissue, paper diapers, and wet wipes. The Functional Materials segment offers specialty paper, thermal paper, adhesive products, and films. The Forest Resources and Environment Marketing segment engages in the pulp, energy, plantation, and lumber processing. The Printing and Communications Media segment provides newsprint, printing, publication, and communication paper. The company also engages in the real estate, engineering, trading, logistics, businesses, etc. The company was formerly known as Oji Paper Co., Ltd. and changed its name to Oji Holdings Corporation in October 2012. Oji Holdings Corporation was founded in 1873 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}