{
    "0K1.F": {
        "short_name": "KUREHA CORP.",
        "long_name": "Kureha Corporation",
        "summary": "Kureha Corporation manufactures and sells functional materials, specialty chemicals, and plastics in Japan, Asia, Europe, and internationally. It operates through five segments: Advanced Materials, Specialty Chemicals, Specialty Plastics, Construction, and Other Operations. The Advanced Materials segment offers polyphenylene sulphide, polyvinylidene fluoride (PVDF), processed polyglycolic acid products, carbon fibers, and bead-shaped activated carbon products. The Specialty Chemicals segment provides therapeutic agents for chronic renal failure, agricultural and horticultural fungicides, caustic soda, hydrochloric acid, sodium hypochlorite, monochlorobenzene, para-dichlorobenzene, and ortho-dichlorobenzene. The Specialty Plastics segment offers household plastic wraps, garbage bags for kitchen sinks, plastic food containers, cooking papers, PVDF fishing lines, polyvinylidene chloride films, multilayer heat-shrinkable films, multilayer bottles, and machinery for auto-pack food packaging. The Construction segment is involved in the civil engineering and construction contracting businesses; and the provision of construction and management activities. The Other Operations segment provides industrial waste management and environmental processing facilities; transport and warehousing; physiochemical and biochemical testing, analysis, and measurement services; and medical services. The company was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8552",
        "website": "http://www.kureha.co.jp",
        "market_cap": "Small Cap"
    },
    "3101.T": {
        "short_name": "TOYOBO CO",
        "long_name": "Toyobo Co., Ltd.",
        "summary": "Toyobo Co., Ltd. provides films and functional polymers, industrial materials, and healthcare and textile products worldwide. It offers industrial films, including PET films for liquid crystal display, optical, and other industrial uses; and synthetic paper. The company also provides packaging films, such as PET, polyolefin, and nylon for food packaging, as well as heat-shrink PET films; functional polymers comprising engineering plastics, industrial adhesives, coatings, photo sensitive printing plates, acrylate polymers, and electronic materials; rubber and coat processing; and pharmaceuticals intermediates. In addition, it offers functional fibers consisting of airbag fabrics; polyethylene and PBO fibers; functional filters for automobiles, indoor, and anti-pollution solvent adsorption materials and units; and fiber materials for automobile parts. Further, the company provides bio products, including enzymes for diagnostics, diagnostic systems, and reagents for research; artificial kidney hollow fibers; anti-clotting materials; seawater desalination modules; functional textiles for sports clothing, underwear, and uniforms; synthetic filaments; apparel under the Munsingwear brand; acrylic fibers under the Exlan brand; and acrylate fibers under the eks brand, as well as trades in textile products. Additionally, it operates as a contract manufacturer of injections and raw pharmaceuticals. The company was founded in 1882 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8230",
        "website": "http://www.toyobo-global.com",
        "market_cap": "Large Cap"
    },
    "3103.T": {
        "short_name": "UNITIKA LTD",
        "long_name": "Unitika Ltd.",
        "summary": "Unitika Ltd. manufactures and sells polymers, advanced materials, and fibers and textiles in Japan and internationally. The company offers polymers, including nylon and polyester films; nylon, polyester, and polyarylate plastic products; polyester, nylon spunbonded, and cotton spunlace nonwoven products; and biodegradable plastic materials. It also provides advanced materials comprising activated carbon fibers, glass fabrics, glass beads, and porous plates, as well as industrial and biomass-based materials. In addition, the company offers fibers and textiles, such as garments, lifestyle materials, and bedding products. Unitika Ltd. was founded in 1889 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8566",
        "website": "http://www.unitika.co.jp",
        "market_cap": "Large Cap"
    },
    "3355.T": {
        "short_name": "KURIYAMA HOLDINGS CORP",
        "long_name": "Kuriyama Holdings Corporation",
        "summary": "Kuriyama Holdings Corporation, through its subsidiaries, engages in industrial, construction, sports facility, and other materials businesses in Japan and internationally. It offers beverage, hydraulic, sewer, gasoline drop, metal, general water and air, chemical, fire, and long and large-diameter hoses; sheet rubber, couplings, and accessories; and nozzles and other peripheral items. The company also provides industrial materials, such as ABA hose clamps, hydraulic rubber hoses, heat resistant hoses, vibration-proof rubber and molded plastic products, sealing gaskets and O-rings, vacuum/blow molding products, mats, engineering plastic materials, deck covering adjusters, rubber and polyurethane molding parts, radiator hoses, and extrusions; and rubber and flake linings, rubber and non-metal expansion joints, flooring materials of ships, and water-sealing rubber. In addition, it offers construction materials, including rubber bearings, bridge support mechanisms, expansion rubber joints, and molded packing products; fenders, bollards, joint sealers, rubber-flexible joints, and water sealing and resin concrete products; non-slip, design printed, and ceramic tiles; plastic materials for pavements, safety equipment for visually impaired people, and others; and aluminum shelters, decorative handrails, bridge railings, etc. Further, the company provides sports facility materials comprising indoor sports resilient floors, floating floor and shock absorbing wall systems, movable partition walls, etc.; and outdoor sports facility materials consisting of prefabricated rubber athletic floorings, long pile artificial turf and seating systems, shock absorbing wall systems, and others. Additionally, it offers outdoor sport goods and dust control related-items. The company was formerly known as Kuriyama Corporation and changed its name to Kuriyama Holdings Corporation in 2012. Kuriyama Holdings Corporation was founded in 1939 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-6325",
        "website": "http://www.kuriyama-holdings.com",
        "market_cap": "Large Cap"
    },
    "3401.T": {
        "short_name": "TEIJIN LTD",
        "long_name": "Teijin Limited",
        "summary": "Teijin Limited engages in the fibers, films and sheets, composites, healthcare, and IT businesses worldwide. It offers para-aramid and meta-aramid fibers for friction materials, tire and rubber reinforcements, optical fiber reinforcements, ballistics protection, protective clothing, firefighting uniforms, and heat-resistant filters. The company also provides polycarbonate, PEN, and PPS resins, as well as flame retardants for use in electrical and electronic components, audiovisual and office automation equipment, personal computer casings, automotive components, and smartphone camera lenses; and polycarbonate films and sheets for organic electroluminescent display anti-reflective films and automotive instrument panels. In addition, it offers carbon fibers and intermediate materials, and oxidized PAN fibers for aircraft structural and interior components, pressure vessels, compounds, and sports and leisure goods; glass fiber composites and carbon fiber composites for use in automotive filed. Further, the company provides pharmaceuticals for bone and joint, respiratory, cardiovascular and metabolic, and other diseases; home oxygen therapy, non-invasive positive pressure ventilation, rehabilitation, and sleep disordered breathing related devices, as well as sonic accelerated fracture healing system and community-based integrated care system; and orthopedic implantable devices, functional food ingredients, digital healthcare products, and other medical devices. Additionally, it offers fiber materials and apparel for threads, textiles, sports clothing, heavy clothing, fashion apparel, and uniforms; industrial textiles and materials; and wearable sensors. The company also provides GRANDIT, a web-based enterprise resource planning software package; IT services for the healthcare and other enterprises; and e-comics distribution services. Teijin Limited was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8585",
        "website": "http://www.teijin.com",
        "market_cap": "Large Cap"
    },
    "3537.T": {
        "short_name": "SHOEI YAKUHIN CO LTD",
        "long_name": "Shoei Yakuhin Co.,Ltd.",
        "summary": "Shoei Yakuhin Co.,Ltd. engages in the trading of chemicals, daily necessities, and civil engineering and construction materials in Japan, China, Thailand, Singapore, and internationally. The company offers oleo chemicals, surfactants, solvents/mineral oils, synthetic resins, anti-termite related products, petrochemicals, and other chemicals; and daily necessities, including soaps, shampoos, cleaning agents, insect repellents, sterilization products, desiccants, air fresheners/deodorants, wax, polishing agents, functional insoles, household repair agents, and other molded products. It also offers civil engineering and construction materials, such as ground improvement materials, building civil structure repair and reinforcement materials, environmental improvement drugs, and other civil engineering and construction materials. The company was founded in 1937 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0052",
        "website": "http://www.shoei-yakuhin.co.jp",
        "market_cap": "Mid Cap"
    },
    "4008.T": {
        "short_name": "SUMITOMO SEIKA CHEMICALS CO",
        "long_name": "Sumitomo Seika Chemicals Company, Limited.",
        "summary": "Sumitomo Seika Chemicals Company, Limited manufactures and sells absorbent polymers, functional chemicals, and gases in Japan and internationally. The company offers sodium polyacrylate-based super absorbent polymer for use in hygiene products, industrial materials, and other applications; and functional chemicals, such as water-soluble and water-absorbent polymers, emulsions, latex products, powdered plastics, fine chemicals, functional polymers, and polar solvents for use in personal care products, performance adhesives and rubber products, and battery and energy materials. It also provides fine gases, including electronic and specialty gases, as well as precision pressure regulators; industrial chemicals and chemical gases; pressure swing adsorption (PSA) system PSA gas generators; various chemical plants; and storage equipment. The company was founded in 1944 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://www.sumitomoseika.co.jp",
        "market_cap": "Large Cap"
    },
    "4022.T": {
        "short_name": "RASA INDUSTRIES",
        "long_name": "Rasa Industries, Ltd.",
        "summary": "Rasa Industries, Ltd. engages in chemicals, machinery, and electronic materials businesses in Japan. Its Chemicals division manufactures and sells phosphoric acid, phosphoric anhydride, and polyphosphate, condenser materials, high-grade copper powder, and other electronic grade products for use in semiconductors and liquid crystals. The company's Electronic Materials division is involved in manufacturing and selling high purity inorganic materials, including gallium, red phosphorus, indium, and boric oxide; and resist remover, spin-on-dielectrics, and other products that are used in the semiconductor and liquid crystal panel manufacturing. Its Machinery division develops and manufactures excavating, crushing, and sorting machines; and pipe jacking machines. The company was formerly known as Rasa Island Phosphate Ore, Ltd. and changed its name to Rasa Industries, Ltd. in 1934. Rasa Industries, Ltd. was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.rasa.co.jp",
        "market_cap": "Large Cap"
    },
    "4023.T": {
        "short_name": "KUREHA CORPORATION",
        "long_name": "Kureha Corporation",
        "summary": "Kureha Corporation manufactures and sells functional materials, specialty chemicals, and plastics in Japan, Asia, Europe, and internationally. It operates through five segments: Advanced Materials, Specialty Chemicals, Specialty Plastics, Construction, and Other Operations. The Advanced Materials segment offers polyphenylene sulphide, polyvinylidene fluoride (PVDF), processed polyglycolic acid products, carbon fibers, and bead-shaped activated carbon products. The Specialty Chemicals segment provides therapeutic agents for chronic renal failure, agricultural and horticultural fungicides, caustic soda, hydrochloric acid, sodium hypochlorite, monochlorobenzene, para-dichlorobenzene, and ortho-dichlorobenzene. The Specialty Plastics segment offers household plastic wraps, garbage bags for kitchen sinks, plastic food containers, cooking papers, PVDF fishing lines, polyvinylidene chloride films, multilayer heat-shrinkable films, multilayer bottles, and machinery for auto-pack food packaging. The Construction segment is involved in the civil engineering and construction contracting businesses; and the provision of construction and management activities. The Other Operations segment provides industrial waste management and environmental processing facilities; transport and warehousing; physiochemical and biochemical testing, analysis, and measurement services; and medical services. The company was founded in 1944 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8552",
        "website": "http://www.kureha.co.jp",
        "market_cap": "Large Cap"
    },
    "4027.T": {
        "short_name": "TAYCA CORP",
        "long_name": "Tayca Corporation",
        "summary": "Tayca Corporation manufactures and sells various industrial chemical products in Japan. It operates through Business Related to Titanium Dioxide, and Other Business. The company offers general purpose products, including titanium dioxide, surfactants, and sulfuric acid; and specialty products, such as micro titanium dioxide, micro zinc oxide, surface treatment products, photocatalytic titanium dioxide, aluminum triphosphate, and titanium dioxide for shielding from infrared rays. It also provides electronic industry materials and other products comprising conductive polymers and related products, and electro-ceramic products, as well as anti-corrosive pigments. The company was formerly known as Teikoku Kako Co., Ltd. and changed its name to Tayca Corporation in August 1989. Tayca Corporation was founded in 1919 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://www.tayca.co.jp",
        "market_cap": "Large Cap"
    },
    "4028.T": {
        "short_name": "ISHIHARA SANGYO KAISHA",
        "long_name": "Ishihara Sangyo Kaisha, Ltd.",
        "summary": "Ishihara Sangyo Kaisha, Ltd. manufactures and sells organic and inorganic chemicals in Japan, Asia, the United States, Europe, and internationally. It operates through three segments: Inorganic Chemicals, Organic Chemicals, and Other Businesses. The company offers titanium dioxide (TiO2) products, including white pigments under the TIPAQUE trade name for applications in paints, inks, plastics, paper, and other products; yellow pigments; and functional materials, such as ultrafine TiO2, ultrafine ZnO, electro-conductive materials, photocatalytic TiO2, high purity TiO2, titanium tetrachride, TiO2 for catalytic use, acicular type TiO2, and glass coating. It also provides environmental products, including gypsander, a gypsum-based neutral soil adjustment agent; Fix-All, a heavy metal absorber and insobilizer; and MT-V3, an iron oxide-based volatile organic compounds decomposer, as well as active materials for lithium ion battery titanate. In addition, the company offers agrochemicals, including herbicides, fungicides, insecticides, and nematicides; animal health products; pharmaceutical reagents; and CF3-Pyridine organic intermediates for use in the pharmaceutical research. Further, it is involved in construction and trading businesses. Ishihara Sangyo Kaisha, Ltd. was founded in 1920 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0002",
        "website": "http://www.iskweb.co.jp",
        "market_cap": "Large Cap"
    },
    "4043.T": {
        "short_name": "TOKUYAMA CORP",
        "long_name": "Tokuyama Corporation",
        "summary": "Tokuyama Corporation produces and sells various chemical products in Japan. The company operates in four segments: Chemicals, Specialty Products, Cement, and Life & Amenity. The Chemicals segment offers caustic soda, soda ash, calcium chloride, sodium silicate, vinyl chloride monomer, polyvinyl chloride resin, propylene oxide, isopropyl alcohol, chlorinated solvents, and hydrogen. The Specialty Products segment provides polycrystalline silicon; fumed silica and tetrachlorosilane; aluminum nitride; high-purity chemicals for electronics manufacturing and photoresist developer; and methylene chloride for metal cleaning. The Cement segment offers cement, ready-mixed concrete, and cement-type soil solidifier, as well as engages in the recycling and environment businesses. The Life & Amenity segment provides polyolefin film, plastic window sashes, medical diagnosis systems, dental materials and equipment, ion exchange membranes, pharmaceutical ingredients and intermediates, plastic lens-related materials, and microporous film. The company was formerly known as Tokuyama Soda Co., Ltd. and changed its name to Tokuyama Corporation in April 1994. Tokuyama Corporation was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8618",
        "website": "http://www.tokuyama.co.jp",
        "market_cap": "Large Cap"
    },
    "4046.T": {
        "short_name": "OSAKA SODA CO LTD",
        "long_name": "Osaka Soda Co., Ltd.",
        "summary": "Osaka Soda Co., Ltd. manufactures and sells specialty chemical products. Its products include caustic soda, chlorine gas, liquid chlorine, hydrogen gas, caustic potash, hydrochloric acid, sodium hypochlorite, low salt sodium hypochlorite, ferric chloride, sodium chlorate, sodium chlorite, stabilized chlorine dioxide, allyl chloride, epichlorohydrin, trichloropropane, 1,3-dichloropropene, paint materials, adhesive materials, etc. The company also provides epichlorohydrin and acrylic rubber products, as well as diallyl phthalate resins non-phthalate allyl, and epoxy resins. In addition, it offers silica gel used for liquid chromatography; active pharmaceutical ingredients and their intermediates; polysulfide silane coupling agents; electrodes; and lens materials. Further, the company offers DAP decorative boards, products for housing facilities, and health foods; and mercury reclamation services, as well as recycles fluorescent lights, mercury lamps, electrical discharge tubes, LCD backlights, glass and metal products, and plastic products. Additionally, it is involved in the transportation and storage of chemical products; and provision of environmental preservation facilities, etc., as well as operates chemical plants. The company was formerly known as DAISO Co., Ltd. and changed its name to Osaka Soda Co., Ltd. in October 2015. Osaka Soda Co., Ltd. was founded in 1915 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0011",
        "website": "http://www.osaka-soda.co.jp",
        "market_cap": "Large Cap"
    },
    "4047.T": {
        "short_name": "KANTO DENKA KOGYO CO",
        "long_name": "Kanto Denka Kogyo Co., Ltd.",
        "summary": "Kanto Denka Kogyo Co., Ltd. manufactures and sells various chemical products in Japan and internationally. It operates through Fundamental Chemicals and Fine Chemicals divisions. The Fundamental Chemicals division offers inorganic products, including caustic soda, hydrochloric acid, sodium hypochlorite, aluminum chloride, etc. that are used in the manufacture of pulp and paper, bar soap/detergent, various chemicals, aluminum electrolytic capacitors, and pharmaceutical and agricultural intermediates; for the treatment of water and metal surfaces; and as food additives, sterilizer, bleach and an oxidizing agent, and catalyst for the friedelÂ\u0096crafts reaction. This division also provides organic products comprising trichloroethylene, perchloroethylene, vinylidene chloride, and cyclohexanol for use in the cleaning of metal parts; production of hydrofluorocarbon, pharmaceutical and agricultural intermediates, fire-resistant fibers, resins for food wraps and packages, organic solvents, and various organic products; reproduction of catalysts for oil refining; and dry cleaning. The Fine Chemicals division offers ferrochemicals, such as reprographics carriers, magnetite, etc. that are used in printers, and reprographics and environmentally friendly carriers. This division also provides fluorochemcials, such as sulfur hexafluoride, carbon tetrafluoride, trifluoromethane, hexafluoroethane, nitrogen trifluoride, octafluoropropane, tungsten hexafluoride, silicon tetrafluoride, chlorine trifluoride, octafluorocyclobutane, hexafluoro-1, 3-butadiene, iodine pentafluoride, and lithium hexafluorophosphate for use in semiconductors, liquid crystals and liquid crystal displays, rechargeable batteries, optical fibers, and high capacity transformers. In addition, the company offers lithium tetrafluoroborate and hexafluorophosphate for use in lithium-ion rechargeable battery electrolytes and additives. Kanto Denka Kogyo Co., Ltd. was founded in 1938 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.kantodenka.co.jp",
        "market_cap": "Large Cap"
    },
    "4064.T": {
        "short_name": "NIPPON CARBIDE INDUSTRIES CO IN",
        "long_name": "Nippon Carbide Industries Co., Inc.",
        "summary": "Nippon Carbide Industries Co., Inc. engages in the electronic and functional products, and films and sheetings business. It offers functional chemicals, such as electronic materials, special functional coatings, agrochemicals, metal surface treatment agents, pharmaceutical products, and biochemistry; and specialty polymers, including thickening and adhesive agents, ingredients of toner ink and coating materials, and melamine resin for tableware. The company also provides semiconductor mold cleaners and conditioners; and ceramic substrates, such as alumina substrates, thick-film printing substrates, and green sheetings. In addition, it offers marking films, laser markable labels, and packaging materials; graphic and 3D-emblem stickers; retroreflective sheetings and aluminum connected sign substrates; and aerial display reflectors. The company was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8466",
        "website": "http://www.carbide.co.jp",
        "market_cap": "Large Cap"
    },
    "4078.T": {
        "short_name": "SAKAI CHEMICAL INDUSTRY CO",
        "long_name": "Sakai Chemical Industry Co., Ltd.",
        "summary": "Sakai Chemical Industry Co., Ltd. provides various chemical products in Japan. It offers titanium dioxide used in a range of applications, including paints, printer inks, paper manufacturing, plastics, chemical fibers, rubbers, and porcelain enamel, as well as in optical glasses and capacitors; and barium and strontium products used in compound form in electronic materials, paints, inks, plastics, glasses, and cosmetics. The company also provides zinc products, including zinc oxide used in various applications, such as rubber and paints, plastics, electronic materials, and cosmetics, as well as zinc dust used in anticorrosive paints; and plastic additives, such as stabilizers, lubricants, light stabilizers, and flame retardants used in pipes, joints, electrical wires, atypical extrusions, industrial films, flexible plastic films, and wall papers. In addition, the company offers catalysts comprising De-NOx catalysts/De-DXN catalysts, hydrogenation catalysts, ozone decomposition catalysts, polyester polymerization catalysts, and photo catalysts; electronic materials consisting of dielectric ceramics and piezoelectric ceramics; and pharmaceuticals, including prescription and OTC drugs, health foods, active pharmaceutical ingredients, and pharmaceutical intermediates. Additionally, the company provides organic chemical products for use in the electronics, resin materials, healthcare, lubricants, and water treatment materials sectors; and road marking materials used for various traffic restrictions, guides, information, warnings, and assistance. Sakai Chemical Industry Co., Ltd. was founded in 1918 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sakai",
        "zipcode": "590-8502",
        "website": "http://www.sakai-chem.co.jp",
        "market_cap": "Large Cap"
    },
    "4082.T": {
        "short_name": "DAIICHI KIGENSO KAGAKU-KOGYO CO",
        "long_name": "Daiichi Kigenso Kagaku Kogyo Co., Ltd.",
        "summary": "Daiichi Kigenso Kagaku Kogyo Co., Ltd. engages in the research and development, manufacture, and sale of zirconium compounds and other inorganic compounds in Japan and internationally. The company offers products, such as zirconium oxides; electro-melting stabilized zirconium oxides; complex oxides; zirconium compounds; cesium compounds and cesium flux, wires, and rings; rare earth compounds; zirconium silicate; various other sol products; and developed products. Its products are used in automobile and industrial; kitchen knives, dental materials, and machine parts; lithium-ion batteries and fuel cells; bricks, crucibles, and nozzles; flux, flux cored wires, and flux cored rings; lenses, coatings, and film to adjust refractivity; oxygen sensors, capacitors, piezoelectric elements, and fluorescent substances; cross linking agents and metal surface treatments; frictional materials; and thermal spraying materials and other products. Daiichi Kigenso Kagaku Kogyo Co., Ltd. was founded in 1956 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "5410041",
        "website": "http://www.dkkk.co.jp",
        "market_cap": "Large Cap"
    },
    "4094.T": {
        "short_name": "NIHON KAGAKU SANGYO CO",
        "long_name": "Nihon Kagaku Sangyo Co., Ltd.",
        "summary": "Nihon Kagaku Sangyo Co., Ltd. produces and sells industrial chemicals and building materials in Japan and internationally. The company offers various inorganic metal products, including copper, tin, nickel, cobalt, bismuth, chromium, manganese, antimony, zinc, iron, and lithium compounds, as well as other products; organic metal compounds, such as metal acetylacetonate complex, metallic soap, PUCAT, and PA series products; and surface treatment agents, including anodized aluminum treatment, electro plating, electro plating brightener/additives, electroless plating, etchant agent, and rust prevention. Its chemical products are used in various applications, such as plastics, textiles, paints and inks, and electronics, as well as in cutting-edge industries, including optical communications, and secondary and fuel cell batteries. The company also develops fireproof, waterproof, and ventilation construction materials; and Cool Fin heat exchangers, as well as offers stainless-steel handrails and mailboxes; fabricated metal products for industrial use; and materials used in roof eaves. Nihon Kagaku Sangyo Co., Ltd. was founded in 1924 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-0004",
        "website": "http://www.nihonkagakusangyo.co.jp",
        "market_cap": "Large Cap"
    },
    "4095.T": {
        "short_name": "NIHON PARKERIZING CO",
        "long_name": "Nihon Parkerizing Co., Ltd.",
        "summary": "Nihon Parkerizing Co., Ltd. manufactures and supplies surface treatment chemicals in Japan and internationally. The company offers conversion coating, lubricant for deformation, solid lubricant and rust proof coatings, salt-bath nitriding and carburizing, austempering treatment, composite plating, and plasma electrolytic oxidation products. It also provides WEATHERCOAT, a surface treatment technology to develop rust layer on weathering steel. In addition, the company supplies surface treatment chemicals for cleaning substrates, adding corrosion resistance, creating a base for painting, and providing lubrications; emulsion type rolling oil for rolling steel and cooling applications; heat exchangers, as well as offers technical support services. Further, it provides various surface treatments, such as rust preventive treatment of metals and multi-functional surface treatments; and heat treatments. The company was founded in 1928 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.parker.co.jp",
        "market_cap": "Large Cap"
    },
    "4099.T": {
        "short_name": "SHIKOKU CHEMICAL CORP",
        "long_name": "Shikoku Chemicals Corporation",
        "summary": "Shikoku Chemicals Corporation researches and develops, manufactures, and sells chemical products and housing materials in Japan and internationally. It offers inorganic chemicals, such as insoluble sulfur, carbon disulfide, sodium sulfate, and sodium carbonate; organic chemicals, including chlorinated isocyanurates, automatic chlorine feeders, bacteria enzymes, and urinary calculus removers. The company also provides fine chemicals comprising imidazole derivatives; CUREZOL range of epoxy resin curing agents; pharmaceutical raw materials; advanced materials, such as glycoluril derivatives; organic solderability preservatives; and benzoxazine, adhesion improvers, cross-linking agents, imidazoles and other heterocycles, and microetching solutions. In addition, it offers housing materials consisting of interior, exterior finishes, and paving materials; and exterior products, including gates, fences, carports, decks, and terraces. Further, the company is involved in the IT systems, fast-food sales, and other service operations. Shikoku Chemicals Corporation was founded in 1947 and is headquartered in Marugame, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Marugame",
        "zipcode": "763-8504",
        "website": "http://www.shikoku.co.jp",
        "market_cap": "Large Cap"
    },
    "4100.T": {
        "short_name": "TODA KOGYO CORP",
        "long_name": "Toda Kogyo Corp.",
        "summary": "Toda Kogyo Corp. manufactures and sells functional pigments and electronic materials in Japan and internationally. It offers electronic printing materials, including toner materials for printers and copying machines, carriers for color printers and copying machines, and magnetic materials for printers and copying machines, as well as high-chroma pigments for use in cosmetics. The company also provides metal-compatible IC/NFC tags, flexible ferrite sheets, complex noise suppression sheets, multi-functional compounds, noise suppression compound for electric wires and cables, wireless power charger coils for wearable devices, and ultra-thin flexible ferrite sheets; and flexible ferrite sheets for RFID, WPC, digitizers, noise suppression, and NFC antennas. In addition, it offers lithium cobaltate, lithium-nickel oxide, and lithium manganate battery materials for personal computers, mobile phones, hybrid cars, and industrial applications; and electronic materials for inductors and capacitors, magnetic recording materials for magnetic cards, and magnetic materials for general purpose and advanced applications. Further, the company provides environmentally functional and remediation materials comprising raw materials for lead-free vinyl chloride stabilizers; anion catchers for various resins; dioxin reduction and functional compounds for crow-repellent garbage bags, etc.; ligneous biomass hydrogen production systems; and CO2 reduction systems. Additionally, it offers pigments for colored pavements, reflective pigments to combat the heat island phenomenon, non-lead pigments for center lines, and pigments for coatings and resins; magnetic recording materials for digital recording media used with computers and video tapes for broadcasting; and electromagnetic wave shielding materials for displays and catalysts for fuel cells. The company was founded in 1823 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": "732-0828",
        "website": "http://www.todakogyo.co.jp",
        "market_cap": "Large Cap"
    },
    "4109.T": {
        "short_name": "STELLA CHEMIFA",
        "long_name": "Stella Chemifa Corporation",
        "summary": "Stella Chemifa Corporation manufactures and sells inorganic fluorine compounds in Japan and internationally. It offers hydrofluoric acid, buffered hydrofluoric acid, and etching solutions used in semiconductors, liquid crystal products, and solar batteries; calcium, aluminum, lithium, strontium, barium, magnesium, zinc, and lead fluoride used in optical materials; and lithium hexafluorophosphate for batteries. The company also provides boron trifluoride, boron trifluoride diethyl ether, boron trifluoride dimethyl ether, boron trifluoride n-butyl ether, boron trifluoride tetrahydrofuran, boron trifluoride phenol, boron trifluoride monoethyl amine, boron trifluoride piperidine, and triethylamine 3HF used in reactive catalysts; and anhydrous hydrofluoric acid and 55% hydrofluoric acid used in surface treatment and alternatives for CFCs. In addition, it offers potassium fluoroborate and boric acid for nuclear energy applications; tin fluoride (II) USP used in GMP-compliant products; and other products, such as fluorosilicic acid, potassium fluorosilicate, ammonium fluorosilicate, fluoroboric acid, tin fluoroborate, copper fluoroborate, lead fluoroborate, zinc fluoroborate, sodium fluoroborate, potassium fluoroborate, ammonium hydrogenfluoride, sodium fluoride, potassium fluoride, ammonium fluoride, potassium hexafluorozirconate, potassium hexafluorotitanate, refined calcium fluoride, and potassium hexafluorophosphate. Further, the company transports a range of special chemical substances, high-pressure gas, hazardous materials, and related products. Additionally, it develops Boron Neutron Capture therapy for the treatment of cancer. The company was formerly known as Hashimoto Chemical Corporation and changed its name to Stella Chemifa Corporation in 1997. Stella Chemifa Corporation was founded in 1916 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0044",
        "website": "http://www.stella-chemifa.co.jp",
        "market_cap": "Large Cap"
    },
    "4112.T": {
        "short_name": "HODOGAYA CHEMICAL CO",
        "long_name": "Hodogaya Chemical Co., Ltd.",
        "summary": "Hodogaya Chemical Co., Ltd. manufactures and sells functional colorants, specialty polymers, basic chemicals, and agro-science products in Japan. Its Functional Colorants segment offers OLED materials that are used in smartphone display panels; imaging materials for copiers and laser printers to function, helping to enhance precision in the office automation environment; dyes and colors for aluminum colorings, stationery inks, and hair dyes; and food additives used in making food more look appetizing by adding color to food products. The company's Specialty Polymers segment consists of polymer materials and construction materials businesses, as well as specialty chemicals, such as intermediates and additives for use in pharmaceuticals and cosmetics. Its primary products are PTG, an ingredient of spandex; urethane is used in a wide range of fields, including clothing, automotive parts, and leisure products. This segment's urethane coating waterproof materials are used to waterproof the roofs of office buildings, schools, and multi-story parking buildings for large-scale retail facilities. Its Basic Chemicals segment engages in the development, manufacture, and sale of hydrogen peroxide and its derivatives. The company's Agro-Science segment offers herbicides for use in lawn, weeding of rail lines and mega solar sites. Its Logistic segment provides logistics solutions, such as outdoor and hazardous materials warehousing and forwarding and customs clearance. The company was formerly known as Hodogaya Soda Co., Ltd. and changed its name to Hodogaya Chemical Co., Ltd. in 1939. Hodogaya Chemical Co., Ltd. was founded in 1916 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0028",
        "website": "http://www.hodogaya.co.jp",
        "market_cap": "Large Cap"
    },
    "4113.T": {
        "short_name": "TAOKA CHEMICAL CO",
        "long_name": "Taoka Chemical Company, Limited",
        "summary": "Taoka Chemical Company, Limited manufactures and sells various chemicals in Japan and internationally. It provides raw material for resists; one-component epoxy-based adhesives for bonding various materials; cyanoacrylate-based instant adhesives; and materials for electronic components, as well as amide and ester imide, nylon, polyester, and polyimide varnishes. The company also manufactures paper processing resin/water-soluble polymer products; raw materials for pharmaceuticals and diagnostics; and rubber additives, such as resin cross-linking agents, tackifiers, and kneading type vulcanizing adhesives. In addition, it offers plasticizer for food packaging films, flooring materials, footwear, hoses, ink rubber gloves, food cans, etc.; methyl ester used as a base material for industrial detergents, shell molds, and fine chemical intermediates, including fragrances and chemicals; dye-related products used for textiles, paper, leather, and plastics. Further, the company develops and produces bisphenol derivatives; TBIS, an epoxy derivative; TBIS, an acid dianhydride; episulfide derivatives; and indole derivatives for various compounds for medical and agrochemical applications. Taoka Chemical Company, Limited was formerly known as Taoka Dystuffs Manufacturing Co., Ltd. and changed its name to Taoka Chemical Company, Limited in 1972. The company was founded in 1919 and is headquartered in Osaka, Japan. Taoka Chemical Company, Limited is a subsidiary of Sumitomo Chemical Company, Limited.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "532-0033",
        "website": "http://www.taoka-chem.co.jp",
        "market_cap": "Large Cap"
    },
    "4115.T": {
        "short_name": "HONSHU CHEMICAL INDUSTRY CO",
        "long_name": "Honshu Chemical Industry Co., Ltd.",
        "summary": "Honshu Chemical Industry Co., Ltd. manufactures and sells various chemical products in Japan. The company offers cresol derivatives for the use in pharmaceuticals, agricultural chemicals, electronic chemicals, and phenol antioxidants, as well as materials for vitamin E for animal feeds; biphenol, a material for liquid-crystal polymers and polyphenylsulfone for the use in telecommunications, electronics, and medical industries; and bisphenol F, a material for low-viscosity epoxy resins for the use in paints, electronic chemicals, civil engineering, construction materials, and adhesive agents. It also provides high performance materials consisting of photo resist products, which are used in the production processes for semiconductors and flat panel displays; and special bisphenol, a material used in the manufacturing of specialty polycarbonates and epoxy resins for the use in high performance components in electronics and automobile industries. The company was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.honshuchemical.co.jp",
        "market_cap": "Large Cap"
    },
    "4116.T": {
        "short_name": "DAINICHISEIKA COLOR & CHEM MFG ",
        "long_name": "Dainichiseika Color & Chemicals Mfg. Co., Ltd.",
        "summary": "Dainichiseika Color & Chemicals Mfg. Co., Ltd. manufactures and sells a range of pigments and colorants. It provides inorganic, organic, and processed pigments for applications, including paints, printing inks, and information display and recording materials; colorants for industries comprising mass colorants for synthetic fibers, pigmented printing agents, and colorants for paper and construction materials; and functional materials for polyvinyl chloride, high-performance fluororesin, and various thermoplastic and thermosetting resins, as well as for electronics and information materials, automotive, and interior construction materials fields. The company also offers UV and EB curable coating materials, decorative, and functional coating materials; and polyurethane and colorants used in synthetic leather and molded products, coating agents, and adhesives, as well as imide-based resins. In addition, it provides Chitosan, a polymer product made from crab shells, as well as its derivatives; functional inks and offset printing inks used in paper media, such as flyers, books, and packaging materials; gravure inks; and coating agents and flexographic printing inks. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8383",
        "website": "http://www.daicolor.co.jp",
        "market_cap": "Large Cap"
    },
    "4118.T": {
        "short_name": "KANEKA CORP",
        "long_name": "Kaneka Corporation",
        "summary": "Kaneka Corporation manufactures and sells chemicals, functional and expandable plastics and, foodstuffs, life science, electronic, and synthetic fibers products in Japan and internationally. The company offers polyvinyl chloride (PVC), crosslinked PVC, PVC-PVAc polymers, paste PVC, acryl grafted-vinyl chloride copolymer, and chlorinated PVC. It also provides impact modifiers, processing aids, specialty additives, toughener for thermosetting resins, silyl-terminated polyether, acrylic silicon, terminally reactive liquid acrylic, and biodegradable polymer, engineering resin for injection molding, zero birefringence, acrylic film, and isobutylene-based thermoplastic elastomer products. In addition, the company offers polypropylene and kanelite foams, extruded polystyrene foam insulation, polyimide film, transparent film for optical use, high thermal conductive graphite sheets, bonded magnets, multi-layer insulation, transparent conductive film, and thermo-resistant, and light-resistant transparent resin products. Further, it provides photovoltaic power generation systems for residences, public, and industrial installations; eco fur, flame-retardant, hair accessory, and new materials; organic EL lighting panels; and biosurfactant. Additionally, the company offers intervention, blood purification, gastroenterology intervention, ophthalmic medical device, testing equipment, regenerative medicine and cell therapy, and genetic diagnostic products; and low molecular pharmaceutical materials, affinity chromatography resin for purification of monoclonal antibody, biopharmaceuticals, transdermal medicine, and innerwear. It offers dairy products, margarine, fat and oils, whipping cream, filling, baker's yeast/ dough improver, processed fruits, butter, shortening, cacao butter, cream for kneading and other uses, frozen dough, spices, antifreeze materials, and pharma and supplemental nutrition solutions. Kaneka Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6028",
        "website": "http://www.kaneka.co.jp",
        "market_cap": "Large Cap"
    },
    "4119.T": {
        "short_name": "NIPPON PIGMENT CO",
        "long_name": "Nippon Pigment Company Limited",
        "summary": "Nippon Pigment Company Limited manufactures and sells liquid dispersion products, colorants, and resin compounds. It primarily offers various resin compounds, such as olefin and styrene resins, and engineering plastic products; coloring agents for automobile interior skin materials, sealing materials, and floor materials; processed colors; colorants for resins; and liquid dispersions for FPD color filters. Nippon Pigment Company Limited was founded in 1925 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0054",
        "website": "http://www.pigment.co.jp",
        "market_cap": "Mid Cap"
    },
    "4120.T": {
        "short_name": "SUGAI CHEMICAL INDUSTRY CO",
        "long_name": "Sugai Chemical Industry Co., Ltd.",
        "summary": "Sugai Chemical Industry Co., Ltd. manufactures and sells various chemicals in Japan. The company offers pharmaceutical intermediates and bulks that are used in manufacturing medical treatments for circulatory system, respiratory system, antiviral, and central nervous system agents; and agrochemical intermediates and bulks, such as fungicides, insecticides, and herbicides. It also provides functional chemicals that are used in manufacturing of electronic materials, resins, information recording materials, and others; dye and pigment intermediaries; and surfactants. The company was formerly known as Sugai Chemical Factory and changed its name to Sugai Chemical Industry Co., Ltd. in 1952. Sugai Chemical Industry Co., Ltd. was founded in 1928 and is headquartered in Wakayama, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Wakayama",
        "zipcode": "641-0043",
        "website": "http://www.sugai-chem.co.jp",
        "market_cap": "Mid Cap"
    },
    "4185.T": {
        "short_name": "JSR CORP",
        "long_name": "JSR Corporation",
        "summary": "JSR Corporation engages in the elastomers, plastics, digital solutions, and life sciences business in Japan and internationally. The company's Elastomers Business segment offers general purpose synthetic rubbers, including emulsion polymerization styrene-butadiene (SB), solution polymerization SB, polybutadiene and isoprene rubbers, etc.; special-purpose synthetic rubbers, such as acrylonitrile, butyl, ethylene propylene, NV and NE polymer blend rubbers, etc.; and thermoplastic elastomers comprising butadiene type TPE, hydrogenated polymer, styrene-butadiene type TPE, styrene-isoprene type TPE, olefin type TPE, etc. This segment also provides thermoplastic elastomers and compounded products, paper coating latex, industrial latex, natural latex compounded products, SB latex, acrylic emulsions, binders for batteries, asphalt pavement modifiers, water-based emulsions, etc.; and dispersants, industrial particles, materials for heat insulation paints, materials for batteries, butadiene monomers, etc. Its Plastics Business segment offers synthetic resins, such as ABS, AES, AS, and ASA resins; and polymer alloys. The company's Digital Solutions segment provides semiconductor materials comprising lithography materials, chemical mechanical planarization materials, packaging materials, and mounting materials; display materials consisting of liquid crystal display materials; functional coating materials; heat-resistant transparent resins and functional films; and photo fabrication and photo molding systems, etc. Its Life Sciences segment offers in-vitro diagnostic and life science research reagents, and bioprocess materials, as well as drug discovery and development services. The company was formerly known as Japan Synthetic Rubber Co., Ltd. JSR Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8640",
        "website": "http://www.jsr.co.jp",
        "market_cap": "Large Cap"
    },
    "4202.T": {
        "short_name": "DAICEL CORPORATION",
        "long_name": "Daicel Corporation",
        "summary": "Daicel Corporation manufactures and sells cellulosic derivatives, organic chemicals, plastics, pyrotechnic devices, and other products in Japan, Asia, North America, Latin America, and Europe. The company offers 1,3-Butylene glycol, polyglycerin, and other raw materials for cosmetics; natural health food materials and supplements, including equol and konjac ceramide; chiral columns, chiral reagents, and analysis services for CPI; cellulose acetate for LCD optical and high-performance optical films; resist materials and solvents for electronic materials and semiconductors; and lens modules, silver nano inks, and organic semiconductor devices for use in sensors. It also provides automobile airbag inflators and resin compound products for use in cars; gas generators for seat belt pretensioners and civilian-use pyrotechnics, such as pyro-fuses; acetic acid, ethyl acetate, other cellulose acetate, and acetate tow materials; and chemical materials, such as cycloaliphatic epoxy, caprolactone derivatives, alkylamines, and ketene derivatives. In addition, the company offers engineering plastics, including polyoxymethylene, polybutylene terephthalate, polyphenylene sulfide, liquid crystal polymer, and cyclic olefin copolymer; resin compounds for non-car use, which includes AS resin, ASB resin, and long fiber-reinforced plastics compounds; barrier films for packaging, polystyrene sheets, and molded containers; carboxymethyl cellulose for use in batteries; reverse osmosis membranes, ultrafiltration membrane products, and water treatment systems; and defense-related products for aerospace and defense systems. Its products are used in transportation, electronics, medical care, personal care, everyday life, and environment and energy applications. The company was formerly known as Daicel Chemical Industries, Ltd. and changed its name to Daicel Corporation in October 2011. Daicel Corporation was founded in 1919 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0011",
        "website": "http://www.daicel.com",
        "market_cap": "Large Cap"
    },
    "4203.T": {
        "short_name": "SUMITOMO BAKELITE CO",
        "long_name": "Sumitomo Bakelite Company Limited",
        "summary": "Sumitomo Bakelite Company Limited engages in the manufacture and sale of semiconductor materials and plastic products in Japan and internationally. The company offers epoxy resin molding compounds for encapsulation of semiconductor devices, photosensitive coating resins for semiconductor wafers, liquid resins for semiconductor devices, substrate materials for semiconductor packages; and high performance plastic products, such as phenolic molding compounds, resins for industrial use, and resin copper-clad laminates, molded parts, synthetic resin adhesives, epoxy resin copper-clad laminates, and aircraft interior components. The company also provides vinyl resin and multilayer sheets, freshness preserving films, melamine resin decorative laminates and sheets, polycarbonate and PVC resin plates, and biotechnology related products, as well as engages in the design and contracting of waterproofing work. In addition, it offers packaging products for producers and vegetable factories and freshness keeping zipper bags for household use; halogen-free, flame retardant, and heat resistant sheets and aluminum based decorative laminates; and medical devices, such as endoscopic device, surgery/drainage, and circulation/IVR. Further, the company provides healthcare products, which include low protein adsorption products and ELISA, glycan analysis, and three-dimensional cell culture; polymer waveguide with micro-mirror; and waterproofing products. It serves automotive/railways/aircraft, electrical and electronic equipment, construction/residence, industrial material, medical institution/laboratory, bio, agriculture, and functional packaging sectors, as well as interior decoration for stores. Sumitomo Bakelite Company Limited was founded in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.sumibe.co.jp",
        "market_cap": "Large Cap"
    },
    "4205.T": {
        "short_name": "ZEON CORPORATION",
        "long_name": "Zeon Corporation",
        "summary": "Zeon Corporation engages in the elastomers, specialty materials, and other businesses. The company offers synthetic rubbers, such as general-purpose rubbers for use in automobile tire applications; and various specialty rubbers, including NBR and hydrogenated NBR. It also provides synthetic latex comprising styrene-butadiene copolymer latex, polybutadiene, acrylonitrile butadiene copolymer latex, acrylate latex, and soap-free latex for use in processed paper, fiber treatment agents, adhesives, paints, and rubber gloves; and materials for adhesive tapes and hot melt adhesives, binder for traffic paints, and concrete admixtures. In addition, the company offers specialty chemicals, such as synthetic aroma chemicals for flavors and fragrances; cyclopentene, cyclopentanone, and other derivatives for chemical synthesis; intermediates for pharmaceuticals and agrochemicals; and solvents and cleaning agents. Further, it provides electronic materials, rechargeable battery materials, and toners for the production of semiconductors, etching gas, and materials used in rechargeable battery production; and specialty plastics that include cyclo olefin polymers and fine processed products with cyclo olefin polymer for use in optical lenses, medical devices, and various general-purpose engineering plastics. Additionally, the company develops, manufactures, and sells cardiovascular and gastrointestinal medical equipment, as well as nutritional products; and licenses butadiene recovery and butene purification process technologies in approximately 23 countries worldwide. It also offers PENTAM, a resource- and energy-saving molded product. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8246",
        "website": "http://www.zeon.co.jp",
        "market_cap": "Large Cap"
    },
    "4208.T": {
        "short_name": "UBE INDUSTRIES",
        "long_name": "Ube Industries, Ltd.",
        "summary": "Ube Industries, Ltd., together with its subsidiaries, engages in the chemicals, construction materials, and machinery businesses in Japan, Asia, Europe, and internationally. The company operates through four segments: Chemicals, Construction Materials, Machinery, and Others. It offers synthetic rubber, engineering plastics, caprolactam, industrial chemicals, liquefied gas, polyethylene, ammonium sulfate, polyimide, battery materials, telecommunication parts, separation membranes, fine chemicals, ceramics, phosphor products, high purity chemicals, polyurethane and related materials, aerospace materials, inorganic fiber, and high temperature paints. The company also provides contract manufacturing services for APIs and intermediates; aromatic SF5 compounds; FLUOLEAD, a novel nucleophilic fluorinating agent; and drug discovery and pipeline services. In addition, it offers cement products, such as ordinary and specialized cement; and building materials, including interior and exterior materials, waterproofing materials, floor underlayment materials, plastering materials, and foundation materials, as well as sells imported coal. Further, the company is involved in the wholesale power. Additionally, it provides die-casting and injection molding machines, and extrusion presses, UBE vertical mills, kilins, furnaces, dryers, water screening equipment, storage and transportation systems, and bridges and steel structures. The company also manufactures and sells nylon, ready-mixed concrete, ammonia and industrial gases, plastic films, polypropylene molded products, fibers, fiber-reinforced plastics, magnesia clinker, quicklime, slaked lime, concrete piles, and cast iron and rolled steel billets; and offers domestic shipping, harbor transportation, shipping-agency, and customs clearing services. Ube Industries, Ltd. was founded in 1897 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8449",
        "website": "http://www.ube-ind.co.jp",
        "market_cap": "Large Cap"
    },
    "4215.T": {
        "short_name": "C I TAKIRON CORPORATION",
        "long_name": "C.I.TAKIRON Corporation",
        "summary": "C.I.TAKIRON Corporation engages in the construction materials, environmental materials, high functional materials, and specialty films businesses in Japan. The company's products include polycarbonate building materials, housing materials, piping and plumbing equipment, flooring materials, decorative materials, evacuation and derivative products, luminous materials, and water damage prevention materials; agricultural materials, binding materials, civil engineering products, liquid chemical tanks, and infrastructure materials; and plastic sheets, machining materials, magnetic materials, and micro motors. It also offers heat shrinkable films for bottled beverages, food, spices, cosmetics, toiletry goods, and medical items; and zipper tapes and bags for food, pharmaceutical, and miscellaneous products applications. The company was formerly known as Takiron Co., Ltd. and changed its name to C.I.TAKIRON Corporation in April 2017. The company was founded in 1919 and is headquartered in Osaka, Japan. C.I.TAKIRON Corporation is a subsidiary of ITOCHU Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0001",
        "website": "http://www.takiron-ci.co.jp",
        "market_cap": "Large Cap"
    },
    "4221.T": {
        "short_name": "OKURA INDUSTRIAL CO",
        "long_name": "Okura Industrial Co., Ltd.",
        "summary": "Okura Industrial Co., Ltd. manufactures and sells polyethylene and polypropylene products in Japan. It offers automotive films, drum can interior films, adhesives for metal parts, tray food films, livestock packaging films, shrink films for food packaging, liquid filling films, laminated films for food, commercial transport films, wrapping films, mail order films, logistics films, liquid transport films, functional garbage bags, flexographic printing related films, laminate-related films, environmentally friendly products, base films for packaging, phase difference films/polarizing plate protection films, self-adhesive protective films, optical films, OA equipment parts, and parts adhesives. The company also provides curing films, architectural films, films for laminating steel plates, films for integrated packaging, particle boards, soil insulation films, soil temperature rise suppression films, pest repellent films, color scheme films, antibacterial agricultural films, biodegradable films, stretch films for grass, house films, liquid fertilizer filling films, environment friendly films, films of tunnels, and sanitary materials and daily necessities films. It serves automobile, food, medical/pharmaceutical, general packaging, optics/information electronics, architecture, agriculture, and livingware industries. The company was formerly known as Shikoku Industry Co., Ltd. and changed its name to Okura Industrial Co., Ltd. in November 1955. Okura Industrial Co., Ltd. was founded in 1947 and is headquartered in Marugame, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Marugame",
        "zipcode": "763-8508",
        "website": "http://www.okr-ind.co.jp",
        "market_cap": "Large Cap"
    },
    "4228.T": {
        "short_name": "SEKISUI KASEI CO LTD",
        "long_name": "Sekisui Kasei Co., Ltd.",
        "summary": "Sekisui Kasei Co., Ltd. manufactures and sells plastic products in Japan, Asia, the United States, Latin America, Europe, and internationally. The company's Human Life segment offers ESLEN Beads, ESLEN Sheet, ESLEN Wood, INTERFOAM, and other foamed/molded products for use in agricultural and marine product containers, food containers, distribution materials, construction materials, and civil engineering materials. Its Industry segment provides PIOCELAN, LIGHTLON, NEOMICROLEN, CELPET, TECHPOLYMER, ST-gel, TECHEATER, ELASTIL, FOAMAC, ST-LAYER, and other foamed/molded products for use in automotive components, packaging materials for transporting automotive parts, industrial components, industrial packaging, electric part materials, and medical and health care materials. The company was formerly known as Sekisui Plastics Co., Ltd. and changed its name to Sekisui Kasei Co., Ltd. in June 2020. Sekisui Kasei Co., Ltd. was incorporated in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0727",
        "website": "http://www.sekisuikasei.com",
        "market_cap": "Large Cap"
    },
    "4231.T": {
        "short_name": "TIGERS POLYMER CORP",
        "long_name": "Tigers Polymer Corporation",
        "summary": "Tigers Polymer Corporation manufactures and sells rubber hose and industrial rubber products primarily to automotive, electrics, construction and housing, and industrial materials markets worldwide. It offers home appliance hoses for vacuum cleaners, washing machines, and air conditioners; and industrial hoses for use in general industrial, civil engineering and construction, residential, and other fields. The company also provides sheets for use in packing materials, cushioning materials, etc., as well as mats for entrances. In addition, it offers rubber and resin molded products. The company was formerly known as Tigers Rubber Inc. and changed its name to Tigers Polymer Corporation in June 1973. Tigers Polymer Corporation was founded in 1938 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "560-0082",
        "website": "http://www.tiger-poly.com",
        "market_cap": "Mid Cap"
    },
    "4234.T": {
        "short_name": "SUN A. KAKEN CO LTD",
        "long_name": "Sun A.Kaken Company,Limited",
        "summary": "Sun A.Kaken Company,Limited manufactures and sells various plastic composite products, and packaging and industrial materials in Japan. The company offers flexible packaging materials for food products, liquids, pharmaceuticals, and sundry goods industries. It also provides functional materials, such as functional films to protect delicate components of optoelectronics and multimedia devices from scratches, dust, and contamination during manufacture, shipping, and storage. In addition, the company offers industrial materials comprising adhesive tapes for use in the distribution industry and home applications. The company was founded in 1942 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.sun-a-kaken.co.jp",
        "market_cap": "Mid Cap"
    },
    "4242.T": {
        "short_name": "TAKAGI SEIKO CORPORATION",
        "long_name": "Takagi Seiko Corporation",
        "summary": "Takagi Seiko Corporation manufactures and sells plastic products, molds for manufacturing plastic products, and metal stamping products in Japan, China, Indonesia, and Thailand. The company provides automotive parts, such as fuel tanks, spoilers, and cowlings, as well as exterior parts for cars; office automation parts, including mechanism/exterior parts for photocopiers and printers, and note book computer cases; and communication equipment comprising mobile phone covers and cases, and decorative accessories. It also offers various plastic products for mobile phones, IT products, office equipment, vehicles, motorcycles, power products, agricultural machinery, construction equipment, and household appliances. In addition, it provides engineering services for product design and technical support. Takagi Seiko Corporation was founded in 1931 and is headquartered in Takaoka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takaoka",
        "zipcode": "933-8628",
        "website": "http://www.takagi-seiko.co.jp",
        "market_cap": "Mid Cap"
    },
    "4243.T": {
        "short_name": "NIX INC",
        "long_name": "Nix, Inc.",
        "summary": "Nix, Inc. develops, manufactures, and sells precision engineering plastics parts, mechanical products, and fasteners primarily in Japan and internationally. The company offers wiring clamps, including recycle fasteners, wiring clamps for single/bundled cables, wiring clamps for flat cables, cable extracting area fixtures, edge treatment products, harness protection tubes, print circuit board accessories, connecting parts, case legs, and locking hole plugs; and mechanical plastic components, such as door latches, dampers, pop in-out mechanisms for IH/microwave oven, racks and pinions, gear units, and torque hinges, log catch mags, and catch mags. It also provides cable markers comprising clip sleeves for UTP cables and general purpose cable markers; and header CCH type and CCH fitting straight series products, as well as protection cap, elbow fitting, pi-type split flow T-S shape, Y-type split flow T-S shape, and U-type header products under the MAXIN JOINT name. In addition, the company offers magazine racks, PCB cleaners, magazine washers, and traceability solutions for SMT lines; and JIGs, as well as ARINIX, an insect repellent for ants, spiders, and cockroaches. Further, it develops and sells labels, label printers, software, and labeling devices. The company was formerly known as Nikko Kogyo Corporation and changed its name to Nix, Inc. in 2001. Nix, Inc. was founded in 1953 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-6108",
        "website": "http://www.nix.co.jp",
        "market_cap": "Small Cap"
    },
    "4275.T": {
        "short_name": "CARLIT HOLDINGS CO LTD",
        "long_name": "Carlit Holdings Co., Ltd.",
        "summary": "Carlit Holdings Co., Ltd., through its subsidiaries, manufactures and sells industrial explosives used in quarrying limestone and other rocks. It also manufactures and sells automotive emergency flares used to protect people's safety during accidents or disasters; sodium chlorate, which is used as bleach in the paper manufacturing and textile industries; ammonium perchlorate for use as a raw material of solid propellants for rockets; electrolytes for electrolytic capacitors; electrolytic solution for electric double-layer capacitors and computers; and abrasive wheels and fireproofing materials for steelmaking and other industries. In addition, the company is involved in the material hazard assessment testing and battery testing businesses; contract manufacture of canned beverages and PET bottle beverages; and manufacture and sale of silicon wafers for semiconductors used in computers and LED lighting, heat-resistant metal hardware for inside furnaces employed in urban waste incineration and petrochemical-related facilities, and springs for automobiles and construction machinery. Further, it is involved in the design and supervision of sewerage, water supply, and wastewater treatment facilities; sale and application of industrial coatings and paints; and provision of construction engineering services on a contract basis. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.carlithd.co.jp",
        "market_cap": "Large Cap"
    },
    "4361.T": {
        "short_name": "KAWAGUCHI CHEMICAL INDUSTRY CO",
        "long_name": "Kawaguchi Chemical Industry Co., Ltd",
        "summary": "Kawaguchi Chemical Industry Co., Ltd manufactures and sells fine chemicals in Japan. The company offers organic rubber chemicals, such as vulcanization accelerators, antioxidants, curing agents, and other rubber chemicals; and synthetic resins, including antioxidants and polymerization inhibitors. It also provides dye pigment, pharmaceutical, and agrochemical intermediates; photo chemicals; and lubricant additives and corrosion inhibitors. Kawaguchi Chemical Industry Co., Ltd was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0047",
        "website": "http://www.kawachem.co.jp",
        "market_cap": "Small Cap"
    },
    "4364.T": {
        "short_name": "MANAC INCORPORATED",
        "long_name": "Manac Incorporated",
        "summary": "Manac Incorporated develops and supplies flame retardants, and inorganic and organic chemicals to the technological industries of various fields. It offers flame retardants added to plastics that are used in televisions, video and audio equipment, personal computers, cell phones, other IT equipment, automobiles, special applications, etc.; and pharmaceutical raw materials for dialysis, transfusion raw materials, reagents, and ion-balanced beverage raw materials. The company also provides functional materials comprising polyimide materials and films for use in electronic parts; raw materials used in the photoconductor drums of copiers, printers, etc.; raw materials for information recording materials, such as organic EL materials for displays, etc.; and purified seawater components to the fields of pharmaceuticals, food, etc. In addition, it develops, manufactures, and supplies pharmaceutical raw materials and investigational bulk drugs. Further, the company offers inorganic chloride and bromine compounds; organic bromine and iodine compounds; pharmaceuticals for animals; food additives; photosensitized materials; high performance materials; dyes; fragrances; and other ingredient materials. Manac Incorporated was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.manac-inc.co.jp",
        "market_cap": "Mid Cap"
    },
    "4365.T": {
        "short_name": "MATSUMOTO YUSHI SEIYAKU CO",
        "long_name": "Matsumoto Yushi-Seiyaku Co.,Ltd.",
        "summary": "Matsumoto Yushi-Seiyaku Co.,Ltd. manufactures and markets fiber and textile chemicals, microcapsules, various surfactants, and high polymer based products in Japan. The company provides spin finishes for extrusion spinning, textile spinning, and functional surface treatment of fibers; sizing chemicals for weaving; lubricating oils for knitting and weaving; textile scouring agents and detergents; and textile dyeing and processing auxiliaries. It also offers thermo-expandable microcapsules; microbeads; three dimensional copying systems; anti-tack powder for batch off and inner parting lubricants for bladder-tire parting for processing rubber compounds; and modifiers, antistatic agents, anti-fogging agents, and lubricants for plastic products. In addition, the company provides various emulsifiers, base materials for shampoo and body soaps, fragrance and oil solubilizing agents, and pearl forming agents for use in cosmetics and toiletries; civil engineering and construction chemicals; and environment conservation products for treating and de-foaming nonionic surfactants. It also exports its products. The company's products are used in various industries and applications, including information and electronics, automobile, precision instruments, civil engineering, construction, rubber, plastics, cosmetics, toiletries, and agriculture. Matsumoto Yushi-Seiyaku Co.,Ltd. was founded in 1926 and is headquartered in Yao, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yao",
        "zipcode": "581-0075",
        "website": "http://www.mtmtys.co.jp",
        "market_cap": "Large Cap"
    },
    "4367.T": {
        "short_name": "KOEI CHEMICAL CO",
        "long_name": "Koei Chemical Company, Limited",
        "summary": "Koei Chemical Company, Limited manufactures and sells various chemical products worldwide. Its products include ionic liquids; amines; methanol; pyridines and pyrazines; and formalin products and polyols, such as pentaerythritol, dipentaerythritol, and trimethylolpropane. The company was formerly known as Koei Co., Ltd. and changed its name to Koei Chemical Company, Limited in 1950. The company was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0016",
        "website": "http://www.koeichem.com",
        "market_cap": "Large Cap"
    },
    "4401.T": {
        "short_name": "ADEKA CORPORATION",
        "long_name": "Adeka Corporation",
        "summary": "Adeka Corporation engages in chemicals, food products, and life science businesses. The company offers polymer additives, such as antioxidants, UV absorbers/hindered amine light stabilizers, nucleating agents/clarifiers, metal deactivators, flame retardants, epoxy type stabilizers/lubricants, and permanent antistatic agents; plasticizers/PVC stabilizers; and light/thermal curing materials, initiators/polymer materials/resist materials, thermal paper materials, semiconductor materials, and circuit materials. Its chemical products also comprise functional polymers, including water borne, epoxy, low chlorine epoxy, and urethane resins; surface specialties, such as general-purpose and functional surfactants, functional cosmetic ingredients, lubricant additives, and base materials for lubricants; propylene glycol, peroxygen chemicals, metal soaps, and inorganic chemicals; and inducing joint fillers and sealing materials. The company offers its chemical products to electronics and IT, plastics and rubber, personal care, industrial, liquid crystal display, automotive, and building and construction industries, as well as paints, coatings, and adhesives industries. In addition, it provides food products, such as margarines, shortening products, oils and fats for chocolate, frying oil, whipping cream, creams for mixing, fillings, frozen pie crusts, mayonnaise dressing, functional foods, and others under the RISU BRAND name. Further, the company engages in various businesses, such as plant facility design; construction and construction management; and facility maintenance, logistics, warehousing, vehicles leasing, real estate, and insurance agency. Additionally, it offers agrochemicals, agricultural materials, pharmaceuticals and veterinary products, wood preservatives, and others. The company was formerly known as Asahi Denka Co., Ltd. and changed its name to Adeka Corporation in May 2006. The company was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "116-8554",
        "website": "http://www.adeka.co.jp",
        "market_cap": "Large Cap"
    },
    "4403.T": {
        "short_name": "NOF CORP",
        "long_name": "NOF Corporation",
        "summary": "NOF Corporation manufactures chemicals Japan, rest of Asia, and internationally. The company operates through Functional Chemicals, Life Science, and Explosive & Propulsion segments. The Functional Chemicals segment offers fatty acids and glycerin, fatty acid derivatives, and surfactants, ethylene oxide and propylene oxide derivatives, organic peroxides, functional polymers, functional films, and electronic materials, as well as materials for anti-corrosion. The Life Science segment provides MPC-related products, raw materials for DDS drug formulation, edible oils, and functional foods. The Explosive & Propulsion segment offers industrial explosives, defense-related explosives, rocket propellant, automotive safety devices, and metal manufactured products. The company is also involved in logistics, insurance agency, and real estate businesses. NOF Corporation was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-6019",
        "website": "http://www.nof.co.jp",
        "market_cap": "Large Cap"
    },
    "4410.T": {
        "short_name": "HARIMA CHEMICALS GROUP INC",
        "long_name": "Harima Chemicals Group, Inc.",
        "summary": "Harima Chemicals Group, Inc. primarily manufactures and sells various chemicals and electronic materials in Japan, China, rest of Asia, South and North America, Europe, and internationally. It operates through Resin & Tall Oil Products, Paper Chemicals, Electronics Materials, and Lawter segments. The Resin & Tall Oil Products segment offers resin and tail oil products, including printing ink resins that are used to display information and colors in newspapers, magazines, flyers, and posters; paint resins to protect various objects from rust and deterioration, and enhance the appearance of man-made objects, such as automobiles, industrial products, buildings, and everyday items; adhesive resins; and synthetic rubber emulsifiers that are used in automobile tires. The Paper Chemicals segment provides paper chemicals comprising sizing agents for preventing water-based inks from bleeding; paper strengthening agents for structural fortification; and coating agents and chemical specialties that are used for enhancing and reinforcing paper surfaces. The Electronics Materials segment offers electronic materials, which include solder pastes and conductive pastes that are used to mount microchips and form electronic circuits; and aluminum brazing materials for use in the manufacture of aluminum products. The Lawter segment is involved in the research, development, manufacture, and sale of rosin related products, including resin for printing inks and adhesives, synthetic rubber emulsifier, and rectified (aromatic) turpentine. The company also manufactures and sells industrial detergents, etc.; and provides real estate management services. The company was formerly known as Harima Chemicals, Inc. and changed its name to Harima Chemicals Group, Inc. in October 2012. Harima Chemicals Group, Inc. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.harima.co.jp",
        "market_cap": "Large Cap"
    },
    "4461.T": {
        "short_name": "DKS CO. LTD.",
        "long_name": "DKS Co. Ltd.",
        "summary": "DKS Co. Ltd. produces and sells surfactants and other industrial chemicals for various industries in Japan and internationally. It operates through six segments: Surfactants, Amenity Materials, Polyurethane Materials, Functional Materials, Electronic Device Materials, and Life Sciences. The company offers nonionic, anionic, cationic, polymerizable, and amphoteric surfactants, as well as formulated surfactant blends; and amenity materials, including sucrose fatty acid esters, sodium carboxymethyl celluloses, cellulose nanofibers and polymers, polyvinyl pyrrolidone, polyacrylamide and polyacrylate, industrial deodorants, and other products. It also provides polyurethane materials, such as polyether polyol, urethane prepolymer, and urethane systems; functional materials comprising radiation-curable monomers and oligomers, waterborne polyurethanes, flame retardants, and amide-based lubricants; and electronic device materials that include ionic liquids, ion-conductive polymers, and ceramic/metal injection molding materials, as well as conductive pastes for electronics, injection molding pellets, and functional inorganic materials. Further, the company supplies health food products that include an I. Japonica-Bombyx Fungus dietary supplement; and Sudachin, a peel extract powder made from citrus fruit. DKS Co. Ltd was formerly known as Dai-ichi Kogyo Seiyaku Co., Ltd. and changed its name to DKS Co. Ltd. in 2013. The company was founded in 1909 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8391",
        "website": "http://www.dks-web.co.jp",
        "market_cap": "Large Cap"
    },
    "4462.T": {
        "short_name": "ISHIHARA CHEMICAL CO LTD",
        "long_name": "Ishihara Chemical Co., Ltd.",
        "summary": "Ishihara Chemical Co., Ltd. engages in the manufacture and sale of chemical products in Japan and internationally. The company provides plating chemicals that are used in the production of electronic components for use in household appliances, communications devices, office equipment, and other products; and analytical equipment for surface treatment solutions utilized in production processes for printed circuit boards and display panels used in flat-panel televisions, mobile phones, game consoles, and other media devices, as well as provides reagents for use with these devices, and after-sales services. It also offers electronic materials, such as submicron nickel powders that are used in the manufacture of capacitor electrodes; ceramic products, including machinable and engineering ceramics; and ceramic parts, which are used in various components and fixtures, such as semiconductor and LCD manufacturing equipment. In addition, the company develops, manufactures, and sells automotive chemicals under the Unicon brand, including car wash detergents for use at gas stations; maintenance chemicals for use at automotive inspection and repair shops; FMC compounds and repair chemicals for use at automotive sheet metal painting plants; and anti-spatter agents for welding, as well as consumer products for resale at automotive and other shops. Further, it distributes inorganic compounds and fine chemicals, including acids, alkalis, catalysts, etc. to steel, chemical, and heavy industries, as well as to government agencies. Ishihara Chemical Co., Ltd. was founded in 1900 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "652-0806",
        "website": "http://www.unicon.co.jp",
        "market_cap": "Large Cap"
    },
    "4464.T": {
        "short_name": "SOFT99 CORPORATION",
        "long_name": "SOFT99corporation",
        "summary": "SOFT99corporation manufactures and sells chemical products for auto and home care in Japan. The company offers car care products, including body care products, such as car coating, waxing, cleaning, shampoo, and car wash tools; coating agents and cleaning products for exterior parts; and glass and mirror care products, which include water repellents, wipers, and cleaning and anti-fog products; and care products for tires, wheels, seats, and car interior. It also provides brush, spray, and other paint products; and car repair tools, such as putty, compound, sandpaper, adhesives and tapes, rust, muffler, rubber and unpainted plastic, radiator, belt, wipers, cleaning, and degreasing agents and other products. In addition, the company offers car maintenance and accessories products, including wiper rubbers and blades; tire chains and TPMS; maintenance chemicals, radiators, and oil related products for engine bay; and fragrances and deodorants, seat cushions and covers, handle covers, cushions, and other products. Further, it provides household products, such as cleaning and repair products used in kitchens, bathrooms, leather, interior, and other applications, as well as coating and cleaning products for electronics; cleaning and other products used for windows; and coating agents, rust removers, and other products. Additionally, the company offers glasses care products, including cleaners and anti-fog products, as well as related products. It exports its products to China, Taiwan, Singapore, Thailand, Malaysia, Indonesia, Vietnam, South Korea, Sri Lanka, Brunei, Myanmar, Russia, Ukraine, Germany, Poland, the United Kingdom, the United Arab Emirates, Saudi Arabia, the United States, Brazil, Paraguay, Australia, and internationally. The company was founded in 1954 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-0012",
        "website": "http://www.soft99.co.jp",
        "market_cap": "Large Cap"
    },
    "4471.T": {
        "short_name": "SANYO CHEMICAL INDUSTRIES",
        "long_name": "Sanyo Chemical Industries Ltd.",
        "summary": "Sanyo Chemical Industries Ltd. manufactures and sells chemical products in Japan. The company offers superabsorbent polymers; industrial agents for pulp and paper, paints, latex, ceramics, and electronics; raw materials for polyurethane foams and polyethylene glycols; super base compounds, urethane catalysts, curing accelerators for epoxy resins, photo-acid generators, watersoluble rust inhibitors, etc.; ethylidene norbornen; textile chemicals, surfactants, papermaking chemicals, paint and ink resins, etc.; and thermoplastic polyurethane beads for slush molding. It is also involved in warehousing, insurance, and real estate businesses. The company was formerly known as Sanyo Chemical Industry Co. and changed its name to Sanyo Chemical Industries Ltd. in 1966. Sanyo Chemical Industries Ltd. was founded in 1949 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "605-0995",
        "website": "http://www.sanyo-chemical.co.jp",
        "market_cap": "Large Cap"
    },
    "4611.T": {
        "short_name": "DAI NIPPON TORYO",
        "long_name": "Dai Nippon Toryo Company, Limited",
        "summary": "Dai Nippon Toryo Company, Limited manufactures and sells coatings and jet inks in Japan and internationally. It offers anticorrosive coatings for steel frames of buildings, bridges, industrial plants, and concrete structures; and decorative coatings, such as water-based coatings free of volatile organic compounds for interiors and thermal insulation coatings that reflect sunlight and radiate heat when applied on roofs and walls. The company also provides coatings for automotive components, such as bumpers, door mirrors, and other interior and exterior components; and coating workshops to educate coating workers. In addition, it offers coatings for industrial applications, such as curtain walls, aluminum sashes, steel furniture, agricultural and construction machinery, heavy and light electrical equipment, PCM, and exterior materials. Further, the company provides nanoparticle series products, including metal and inorganic oxides that exhibit optical, electrical, and other functions; and inkjet coating systems, as well as sells coating equipment. The company was founded in 1929 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0081",
        "website": "http://www.dnt.co.jp",
        "market_cap": "Large Cap"
    },
    "4615.T": {
        "short_name": "SHINTO PAINT CO",
        "long_name": "Shinto Paint Company, Limited",
        "summary": "Shinto Paint Company, Limited manufactures, processes, and sells paints, pigments, synthetic fats/oils, fats/oils, and chemicals in Japan. It also provides electronic equipment, optical communication equipment, magnetic equipment, parts, components, and their materials; painting facilities, related machinery equipment, tools, devices, and materials; and civil engineering and construction materials, as well as housing materials. In addition, the company designs, implements, and supervises painting and other construction works, as well as offers related technical supervision services. Further, it is involved in the provision of contract installation works for painting facilities and related machinery equipment, tools, and devices, as well as designs and supervises related installation works. It also imports and exports its products. The company was founded in 1901 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "661-8511",
        "website": "http://www.shintopaint.co.jp",
        "market_cap": "Mid Cap"
    },
    "4616.T": {
        "short_name": "KAWAKAMI PAINT MFG CO",
        "long_name": "Kawakami Paint Mfg.Co.,Ltd.",
        "summary": "Kawakami Paint Mfg.Co.,Ltd. manufactures and sells various paints in Japan. Its products include thermal barrier, formaldehyde regulation, and water-based paints; and ultra-low temperature powder, general-purpose building paints and materials, and rust preventive paints. The company is also involved in the management and contract of painting work. Kawakami Paint Mfg.Co.,Ltd. was founded in 1901 and is based in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "661-0001",
        "website": "http://www.kawakami-paint.co.jp",
        "market_cap": "Small Cap"
    },
    "4617.T": {
        "short_name": "CHUGOKU MARINE PAINTS",
        "long_name": "Chugoku Marine Paints, Ltd.",
        "summary": "Chugoku Marine Paints, Ltd. manufactures and sells marine, industrial, and container paints worldwide. The company offers paints for vessels, yachts and pleasure boats, and marine containers; protective paints for bridges and other steel structures; paints for building materials and wooden floors, as well as construction coatings and functional paints; and functional compounds. It is also involved in the sale of painting related equipment; undertaking of management and contract work for coating; inspection of surface treatment and coating; and other activities. The company supplies its products to the shipbuilding, shipping, power generation, steel, wood, and general construction industries. Chugoku Marine Paints, Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://www.cmp.co.jp",
        "market_cap": "Large Cap"
    },
    "4619.T": {
        "short_name": "NIHON TOKUSHU TORYO",
        "long_name": "Nihon Tokushu Toryo Co., Ltd.",
        "summary": "Nihon Tokushu Toryo Co., Ltd. manufactures and sells automobile products, and paints and coatings worldwide. The company offers soundproofing materials for automobiles, trains, household appliances, and buildings, as well as for housing, schools, music halls, and noise abatement measures for various factories; sealants, which prevent leakage of water; anti-chipping coatings that prevent chipping damage; anti-salt coatings that reduce the damage from rock salt on winter roads; and rust-proof coatings. It also provides exterior wall paints; coatings for the roof; and paints with photocatalytic function. Nihon Tokushu Toryo Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "114-8584",
        "website": "http://www.nttoryo.co.jp",
        "market_cap": "Large Cap"
    },
    "4620.T": {
        "short_name": "FUJIKURA KASEI CO",
        "long_name": "Fujikura Kasei Co., Ltd.",
        "summary": "Fujikura Kasei Co., Ltd. manufactures and sells specialty chemical products in Japan and internationally. It provides plastic coatings for use in automotive interior and exterior products, automotive electronics, cosmetic containers, household appliances, mobile terminals, and automotive electronics components; and film paintings for use in agriculture, optic, and other industries, as well as paintings for hobby fields. The company also offers architectural coatings for use in detached housing exterior finishing materials; polymers and resins for use in adhesives, printer toners, molding materials, stationery materials, electronic component materials, and others; medical materials for in-vitro diagnostic pharmaceutical and research reagents fields; and synthetic resins. In addition, it provides electronic materials, such as adhesives for welding and soldering; wiring for printed circuit boards, electrodes, and contact materials; paste materials for flexible base materials; conductive and insulation paste materials for touch panels; and electromagnetic wave shields. The company was formerly known as Fujikura Kagaku Mfg. Co., Ltd. and changed its name to Fujikura Kasei Co., Ltd. in December 1958. Fujikura Kasei Co., Ltd. was founded in 1938 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://www.fkkasei.co.jp",
        "market_cap": "Large Cap"
    },
    "4623.T": {
        "short_name": "ASAHIPEN CORP",
        "long_name": "Asahipen Corporation",
        "summary": "Asahipen Corporation manufactures, imports, and sells various paints and painting supplies, and household supplies in Japan. The company offers aqueous, oil, and spray paints, as well as paint auxiliary materials; painting supplies, including brushes, rollers, kotebakes, roller trays, painting machines/compressors, painting aids, curing supplies, containers, and polishing supplies; repair materials for cover, floor, joints, metal products, wood parts, base adjustment, and concrete; and repair tape and pale bucket, as well as insulation and waterproofing materials for roofs. It also provides interior goods, such as shoji paper, bran paper, cover paper, adhesive sheets, glass decoration and condensation products, floor material, glue and double-sided tapes, repair maintenance materials, and various tools; home care products comprising, floor waxes, cleaning agents, bleaching and fungicides, home detergent and cleaners, kitchen detergents and hygiene management supplies, waterproof/water repellents, graffiti droppings, polishing/removers, and lubricants; and gardening supplies consisting of garden furniture, deck panels, flower stands, planters, lattice peripheral products, and other wood products, as well as fence, arch, and trellis products. The company was formerly known as Asahi Paint Company and changed its name to Asahipen Corporation in January 1965. Asahipen Corporation was founded in 1940 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "538-8666",
        "website": "http://www.asahipen.jp",
        "market_cap": "Mid Cap"
    },
    "4624.T": {
        "short_name": "ISAMU PAINT CO",
        "long_name": "Isamu Paint Co., Ltd.",
        "summary": "Isamu Paint Co., Ltd. manufactures and sells paints, solvents, and building materials in Japan and internationally. The company provides automotive, aerosol, industrial, general purpose, and building paints. It also manufactures and sells painting machinery and equipment, and painting rooms, as well as attached raw materials; designs, constructs, and contracts waterproofing and painting works; and leases and manages real estate properties. The company was founded in 1927 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "553-0002",
        "website": "http://www.isamu.co.jp",
        "market_cap": "Mid Cap"
    },
    "4625.T": {
        "short_name": "ATOMIX CO LTD",
        "long_name": "Atomix Co.,Ltd.",
        "summary": "Atomix Co.,Ltd. manufactures and sells paints in Japan. The company offers road paints; and building paints, such as floors, roofs, waterproofing, household paints, and concrete structures. It also develops and sells software related to the maintenance and management of traffic safety and living environment infrastructure; purchases and sells paint-related products and home care products; manufactures construction machines for road paints; and provides logistics services. In addition, the company engages in the contracting construction business. Atomix Co.,Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.atomix.co.jp",
        "market_cap": "Mid Cap"
    },
    "4626.T": {
        "short_name": "TAIYO HLDG CO LTD",
        "long_name": "Taiyo Holdings Co., Ltd.",
        "summary": "Taiyo Holdings Co., Ltd., through its subsidiaries, engages in the electronics materials business. The company offers printed wiring materials, such as rigid board materials comprising liquid solder resist, legend ink, plating resist, and etching resist; PKG board materials including liquid and dry film solder resists; flexible printed circuit board materials, which consists of liquid and dry film solder resists, and dry film photoimageable coverlay; and build-up materials. The company also provides FPD materials; manufactures and sells prescription drugs and pharmaceuticals; manufactures and markets dyes, pigments, and other chemical products; and operates solar power plants. In addition, it engages in the provision of systems engineering services; developments of systems; and food businesses. The company was formerly known as Taiyo Ink Mfg. Co., Ltd. and changed its name to Taiyo Holdings Co., Ltd. in October 2010. Taiyo Holdings Co., Ltd. was founded in 1953 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": "355-0222",
        "website": "http://www.taiyo-hd.co.jp",
        "market_cap": "Large Cap"
    },
    "4627.T": {
        "short_name": "NATOCO CO LTD",
        "long_name": "Natoco Co., Ltd.",
        "summary": "Natoco Co., Ltd. manufactures and sells paints, inks, plastics, fine chemicals, and related products in Japan and internationally. It offers functional materials; industrial coatings; paintings of sidings; and painting for interior floors, as well as CCMs, thinners, environmental care apparatus, etc. The company was formerly known as Natoco Paint Co., Ltd. and changed its name to Natoco Co., Ltd. in November 1998. Natoco Co., Ltd. was founded in 1948 and is headquartered in Miyoshi, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Miyoshi",
        "zipcode": "470-0213",
        "website": "http://www.natoco.co.jp",
        "market_cap": "Large Cap"
    },
    "4628.T": {
        "short_name": "SK KAKEN CO LTD",
        "long_name": "Sk Kaken Co.,Ltd.",
        "summary": "Sk Kaken Co.,Ltd. manufactures and sells organic and inorganic water-based coating materials, synthetic resin paints, inorganic coating materials, and inorganic building materials in Japan and internationally. It is also involved in the contracting of special finishing works and fireproof insulation works; and manufacture and sale of heat insulation materials, fireproof coating materials, and fireproof paints, as well as various chemical products. In addition, the company's products include exterior finishes, top coating materials, interior finishes, roof paints, iron paints, floor coverings, rooftop waterproofing materials, base adjustment coating materials, fireproof coating/insulation materials. The company was formerly known as Shikoku Kaken Industry Co., Ltd. and changed its name to Sk Kaken Co.,Ltd. in April 1991. Sk Kaken Co.,Ltd. was founded in 1955 and is headquartered in Ibaraki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ibaraki",
        "zipcode": "567-0034",
        "website": "http://www.sk-kaken.co.jp",
        "market_cap": "Large Cap"
    },
    "4629.T": {
        "short_name": "DAISHIN CHEMICAL",
        "long_name": "Daishin Chemical Co.,Ltd.",
        "summary": "Daishin Chemical Co.,Ltd. manufactures and sells various paints and chemicals in Japan. The company's products include lacquer thinners, synthetic resin paint thinners, cleaning thinners, special thinners, printing ink solvents, paint removers, and printing and single solvents, as well as ethanol and other products. It also offers reagents to support various tests, basic research, analysis, and environment, as well as product development, including pharmaceutical, textile, food, and electric products development. In addition, the company is involved in the sale of various materials ancillary to paint manufacturing; manufacture and sale of external substances and poisons for pharmaceutical industry; and related ancillary businesses. It sells its products to paint manufacturers, and printing ink and other industrial sectors through a network of sales agents. Daishin Chemical Co.,Ltd. was founded in 1952 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0012",
        "website": "http://www.daishin-chemical.co.jp",
        "market_cap": "Mid Cap"
    },
    "4633.T": {
        "short_name": "SAKATA INX CORP",
        "long_name": "Sakata INX Corporation",
        "summary": "Sakata INX Corporation manufactures and sells various printing inks and auxiliary agents in Japan and internationally. It offers newspaper inks, dampening water, sheet-fed inks, Web offset inks, varnish coatings, dampening water, etc.; inks and varnishes for corrugated boxes, paper containers, paper bags, etc.; and flexo inks for flexible packaging, solvent and water based gravure inks, etc. The company also provides digital and specialty products, such as powder toners, inkjet inks and toners, pigment dispersions for color filters, functional coating agents, etc. In addition, it is involved in the sale of graphic art materials for use in printing and plate-making; and electronic apparatus and information-related equipment, as well as in the import and export business. The company was founded in 1896 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0002",
        "website": "http://www.inx.co.jp",
        "market_cap": "Large Cap"
    },
    "4914.T": {
        "short_name": "TAKASAGO INTERNATIONAL CORP",
        "long_name": "Takasago International Corporation",
        "summary": "Takasago International Corporation manufactures and sells flavors, fragrances, aroma ingredients, and other fine chemicals. The company offers flavors for use in various beverages comprising fruit juices, carbonated drinks, coffee and tea flavored drinks, sports and energy drinks, dairy drinks, alcoholic/ non-alcoholic beverages, powder mixes, protein meal replacement drinks, and others; confectionery products, including candies, chewing gums, compresses mints/tablets, chocolates, cereal/cereal bars, and others; processed meats, seasoning blends and marinades, soups and sauces, bouillons and broths, and surimi and other seafood; breads, donuts and pastries, cookies and crackers, cakes and mixes, pretzels, prep fillings, and others; yogurt, flavored milk, ice cream, frozen desserts, cottage cheese, savor yogurt dips and spreads, fruit preparations, and others; and mint and gums, toothpaste, mouthwash, breath fresheners, medicinal, and other products. It also offers fragrances for use in perfumes and colognes; and various consumer products, such as soaps and shampoos, bath products, cosmetics, laundry detergents, cleansers, air fresheners, and other products, as well as aroma ingredients that are used to create fragrances. In addition, the company provides fine chemicals comprising intermediates of pharmaceuticals and electronics industries. It operates in Japan, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Takasago International Corporation was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "144-8721",
        "website": "http://www.takasago.com",
        "market_cap": "Large Cap"
    },
    "4956.T": {
        "short_name": "KONISHI CO LTD",
        "long_name": "Konishi Co., Ltd.",
        "summary": "Konishi Co., Ltd. manufactures and sells synthetic adhesives in Japan. The company also trades in chemical products. Its products are used in chemicals, paints, electronics/electrics, automobiles, and housing related products. In addition, the company is involved in the constructing, repairing, renovating, and maintaining social infrastructure and buildings. Konishi Co., Ltd. was founded in 1870 and is based in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.bond.co.jp",
        "market_cap": "Large Cap"
    },
    "4957.T": {
        "short_name": "YASUHARA CHEMICAL CO",
        "long_name": "Yasuhara Chemical Co.,Ltd.",
        "summary": "Yasuhara Chemical Co.,Ltd. manufactures and sells terpene-derived products in Japan. The company offers terpene, aromatic modified terpene, terpene phenolic, liquid, styrene, hydrogenated terpene, hydrogenated aromatic modified terpene, and hydrogenated terpene phenolic resins for use in tires, pharmaceuticals, molded plastic products, water-permeable asphalt pavements, adhesives, sealants, inks, and paints. It also provides various chemicals, including turpentine oil solvents and fragrance ingredients; and low-molecular-weight polyethylene waxes for use in the fragrance, solvent, electronic, road marking paint, hot melt adhesive, and PVC lubricant industries. In addition, the company offers hot melt adhesives for use in peelable lids, air filters, sealing cartons and cardboard boxes, and bonding cushioning materials, as well as rubber-based and stick-type hot melt adhesives. Yasuhara Chemical Co.,Ltd. was founded in 1947 and is headquartered in Fuchu, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fuchu",
        "zipcode": "726-8632",
        "website": "http://www.yschem.co.jp",
        "market_cap": "Mid Cap"
    },
    "4958.T": {
        "short_name": "T.HASEGAWA CO",
        "long_name": "T. Hasegawa Co., Ltd.",
        "summary": "T. Hasegawa Co., Ltd. produces, sells, imports, and exports fragrances, flavors, aromatic chemicals, food additives, and foods primarily in Japan, rest of Asia, and the United States. It offers flavors for use in a range of processed foods, such as beverages and confectionaries; and fragrances for use in fine fragrances, cosmetics, and household items. The company was founded in 1903 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8431",
        "website": "http://www.t-hasegawa.co.jp",
        "market_cap": "Large Cap"
    },
    "4966.T": {
        "short_name": "C. UYEMURA & CO.LTD",
        "long_name": "C.Uyemura & Co.,Ltd.",
        "summary": "C.Uyemura & Co.,Ltd. engages in the manufacture and sale of plating chemicals, industrial chemicals, non-ferrous metals, and other products in Japan and internationally. The company operates in four segments: Surface Finishing Materials, Surface Finishing Machinery, Plating Job, and Real Estate Rental. It offers plating machinery for PWBs and aluminum magnetic disks; and plastic and PWB plating services. The company is also involved in the rental of office buildings and apartment houses. C.Uyemura & Co.,Ltd. was founded in 1848 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.uyemura.co.jp",
        "market_cap": "Large Cap"
    },
    "4968.T": {
        "short_name": "ARAKAWA CHEMICAL INDUSTRIES",
        "long_name": "Arakawa Chemical Industries, Ltd.",
        "summary": "Arakawa Chemical Industries, Ltd. manufactures and sells chemicals for paper manufacturing, resins for printing inks and adhesives, intermediate materials for electronic materials, etc. in Asia, China, Europe, and the United States. The company offers various paper chemicals, including water-repellents, sizing agents, paper surface improving agents, and paper strengthening agents for the manufacture of books, newspapers, tissues, and other types of papers. It also provides coating chemicals and adhesive materials, such as printing inks for offset printing; book (magazine)-gravures and food-package-gravures; tackifiers for adhesive agents or tapes; release agents for the separation of release paper; polymerization emulsifiers for producing synthetic rubber tires; ester gums that enhance chewing sensations; and resins as a raw material of paint or film coating, as well as hydrogenated petroleum resins and colorless rosin derivatives under the ARKON and PINECRYSTAL names. In addition, the company offers electronic materials, including rosins for use as raw material of chemicals and electronic components; provides solutions for solder jointing processes, including the soldering and post-soldering cleaning process; and develops flux-removing agents for electronic or semiconductor devices, as well as cleaning systems using flux-removing agent, and its peripheral equipment. Further, it provides photo-curing polymers, organic-inorganic hybrid resins, and hybrid polyimide films. The company was formerly known as Arakawa Forest Chemical Industries, Ltd. and changed its name to Arakawa Chemical Industries, Ltd. in April 1977. Arakawa Chemical Industries, Ltd. was founded in 1876 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0046",
        "website": "http://www.arakawachem.co.jp",
        "market_cap": "Large Cap"
    },
    "4972.T": {
        "short_name": "SOKEN CHEMICAL & ENGINEERING CO",
        "long_name": "Soken Chemical & Engineering Co., Ltd.",
        "summary": "Soken Chemical & Engineering Co., Ltd. manufactures and sells acrylic pressure-sensitive adhesives, functional polymers, organic fine particles, and adhesive tapes in Japan, China, and internationally. Its pressure-sensitive adhesives are used for a range of applications in industrial fields, including IT devices, automobiles, building materials, and electronics and optical devices, as well as in household products, such as double-sided and packing tapes, and adhesive plasters. The company's functional materials are used in the field of electronic substrate materials, inks, paints, displays, and multipurpose copy machines; and functional fine particles for use in LCD light diffusion agent, paint, toner, anti-blocking film agent, cosmetic, and fiber reinforced plastic applications. It also offers specialty coated products comprising double-sided acrylic foam-based adhesive tapes and sheets; and nanoimprinting molds and films. In addition, the company provides organic conductive materials for antistatic and conductive coating, capacitors, solar cell electrodes, hole transport materials for OPV, and hole injection materials for organic EL devices. Further, it is involved in heating media, thermal boiler, and plant engineering and maintenance businesses. The company was formerly known as Sogo Kako Laboratories, Ltd. and changed its name to Soken Chemical & Engineering Co., Ltd. in 1953. Soken Chemical & Engineering Co., Ltd. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-8531",
        "website": "http://www.soken-ce.co.jp",
        "market_cap": "Large Cap"
    },
    "4975.T": {
        "short_name": "JCU CORPORATION",
        "long_name": "JCU Corporation",
        "summary": "JCU Corporation produces and sells chemicals, machines, and auxiliary equipment for surface treatment in Japan. It offers chemicals for the decoration and rust-proofing of automobile parts, faucet parts, construction materials, etc.; and for use in the manufacturing processes of printed circuit boards (PCBs), electronic components and semiconductors, etc. The company also provides full automatic plating and processing machines; and vertical batch, panel to panel, and roll-to-roll type etching and washing devices for PCBs. In addition, it designs, installs, and operates solar photovoltaic generation facilities. The company was formerly known as Ebara-Udylite Co., Ltd. and changed its name to JCU Corporation in October 2012. JCU Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-0015",
        "website": "http://www.jcu-i.com",
        "market_cap": "Large Cap"
    },
    "4976.T": {
        "short_name": "TOYO DRILUBE CO LTD",
        "long_name": "Toyo Drilube Co., Ltd.",
        "summary": "Toyo Drilube Co., Ltd. engages in the research and development, manufacture, coating processing, and sale of solid film lubricants and function film coating agents in Japan and internationally. Its solid film lubricants are formulated with solid lubricants, such as molybdenum disulfide, fluorine resin, or graphite; and dispersed in binders. The company offers its products under the DRILUBE brand name. Its products have applications in the fields of automotive equipment, electric home appliances, optical instruments, and technology. The company was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "155-0032",
        "website": "http://www.drilube.co.jp",
        "market_cap": "Mid Cap"
    },
    "4977.T": {
        "short_name": "NITTA GELATIN INC",
        "long_name": "Nitta Gelatin Inc.",
        "summary": "Nitta Gelatin Inc. engages in the production and sale of edible gelatin, pharmaceutical gelatin, and photographic gelatin in Japan and internationally. The company manufactures and sells related products made from collagen for animal bones and skin, and fish scales and skin; gelatin for applications in industrial sectors comprising food and pharmaceutical markets; collagen peptide, which is recognized as a bioactive compound and a material that has bioregulatory functions, produced using its proteolytic technology; and edible collagen casings, which uses sausage manufacturing as an alternative to natural casings for sheep and pig intestines. It also manufactures and sells hot-melt adhesives for packaging, bookbinding, building materials, and hygiene products; and gaskets that are used as a sealant for electronic devices, household electrical appliances, etc., as well as food formulations, such as edible gelling agents; other food materials; and stabilizers for confectionery, desserts, delicatessen items, chilled foods, etc. In addition, the company manufactures and sells collagen and medical gelatin for medical device manufacturers, research institutions, and others that are used as a biomaterial for artificial skin and bone. Nitta Gelatin Inc. was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "556-0022",
        "website": "http://www.nitta-gelatin.co.jp",
        "market_cap": "Large Cap"
    },
    "4987.T": {
        "short_name": "TERAOKA SEISAKUSHO CO",
        "long_name": "Teraoka Seisakusho Co., Ltd.",
        "summary": "Teraoka Seisakusho Co., Ltd. manufactures, processes, and sells various adhesive tapes in Japan and internationally. The company offers flame retardant, conductive/shielding, optic, shade, kapton film, thermal conduction, silicone rubber, anti-electric charge, removable film, epoxy prepreg, and other adhesive tapes for electrical insulation and electronic equipment. It also provides film base transparent, film base black and white, film base other colors, silicone-based, thermal conduction, optics baseless, metal foil base, and nomex base double-coated adhesive tapes for electrical insulation and electronic equipment; and low VOC product solvent free, low VOC product toluene and xylene free, non-woven fabric base, form base, baseless general purpose type, and cloth and tissue base double-coated adhesive tapes for industrial applications. In addition, the company offers masking polyethylene cloth adhesive, masking cloth, line, vinyl adhesive, masking, polyethylene protection, aluminum foil adhesive, waterproof adhesive, waterproof double-coated adhesive, corrosion protection, harness fixing, safety sign, splicing, and other tapes for industrial applications; and cloth, polyethylene cloth, polypropylene film, Kraft paper, and other adhesive tapes for packing and packaging applications. Teraoka Seisakusho Co., Ltd. was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-8711",
        "website": "http://www.teraokatape.co.jp",
        "market_cap": "Mid Cap"
    },
    "4999.T": {
        "short_name": "CEMEDINE CO LTD",
        "long_name": "Cemedine Co., Ltd.",
        "summary": "Cemedine Co., Ltd. manufactures and sells glues, sealing materials, adhesives, special paints, coating materials, and processed goods based on adhesives in Japan. The company's products include elastic, epoxy resin, instantaneous, solvent based, second generation acrylic, emulsion, hot melt, peelable, and automobiles adhesives. In addition, it undertakes construction and contract works related to bonding, waterproofing, and other such functions. The company was founded in 1923 and is headquartered in Tokyo, Japan. Cemedine Co., Ltd. is a subsidiary of Kaneka Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8620",
        "website": "http://www.cemedine.co.jp",
        "market_cap": "Large Cap"
    },
    "5018.T": {
        "short_name": "MORESCO CORP",
        "long_name": "MORESCO Corporation",
        "summary": "MORESCO Corporation, together with its subsidiaries, develops, manufactures, and sells chemicals in Japan and internationally. The company offers functional fluids, such as high vacuum pump oils, fire resistant hydraulic fluids, die-casting lubricants, cutting fluids, brake fluids, antifreeze products, heat-conducting media, and lubricants for hot forging; synthetic lubricants, including high temperature lubricating oils, hard disk surface lubricants, and radiation-resistant lubricants; and liquid paraffin and sulfonates. It also provides hot melt adhesives, organic device sealants, gas/water vapor transmission rate analyzers, organic photovoltaics, plunger lubricants, grease products, and wastewater-treatment equipment, as well as chemical analysis testing services. In addition, the company is involved in the building rental business. Its products are used in automobiles, iron and steel, construction materials, electronic equipment and home electric appliances, sanitary and daily goods, plastic, fiber, food, packaging materials, nuclear power related, cosmetics/pharmaceuticals, aircraft, factory and equipment related, industrial machinery, wastewater treatment, and other applications. The company was formerly known as Matsumura Oil Reserch Corp. and changed its name to MORESCO Corporation in 2009. MORESCO Corporation was founded in 1958 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0047",
        "website": "http://www.moresco.co.jp",
        "market_cap": "Large Cap"
    },
    "5103.T": {
        "short_name": "SHOWA HOLDINGS CO LTD",
        "long_name": "Showa Holdings Co., Ltd.",
        "summary": "Showa Holdings Co., Ltd., through its subsidiaries, engages in the digital finance business in Japan and internationally. The company offers loans for motorcycles and agricultural equipment. It also produces and sells Japanese sweets, such as rice cakes and dumplings comprises daifuku mocha; and rubber linings, molds, cleaning equipment, food packing, etc. In addition, the company manufactures and sells tennis balls and sportswear, as well as operates tennis clubs. Further, it is involved in the content planning, production, editing, design, wholesale, retail, distribution, and related rights businesses for music, magazines, books, trading card games, web, etc. The company was founded in 1937 and is headquartered in Kashiwa, Japan. Showa Holdings Co., Ltd. is a subsidiary of A.P.F.Group Co., Ltd.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kashiwa",
        "zipcode": "277-8556",
        "website": "http://www.showa-holdings.co.jp",
        "market_cap": "Mid Cap"
    },
    "5122.T": {
        "short_name": "OKAMOTO INDUSTRIES INC",
        "long_name": "Okamoto Industries, Inc.",
        "summary": "Okamoto Industries, Inc. manufactures and sells industrial and household products in Japan and internationally. The company's industrial products include plastic films; wallpaper for housing, decorative films, moldable ABS and acrylic sheets, and synthetic leather for furniture; automotive materials; agricultural films/work materials; and food wrapping films, dehydrant/absorbent sheets, gloves, and other food sanitation materials. It also provides adhesive tape and rubber bands; flexible container bags; medical/welfare products comprising wound dressing materials, medical gloves, autoclaves, masks, and other sanitary materials; and industrial products, such as cleanroom gloves, adhesive mats for entrances, partition films, safety shoes, and other products. In addition, the company offers household products consisting of condoms/lubricants, heat patches/heating pads/hot water bags, health goods, portable sanitary products, and gloves; dehumidifiers, cockroach control products, and cleaning agents for living spaces; absorbent/dehydrant sheets, food wrapping films, and sheets for cooking; boots, short boots, and safety shoes for working or outdoor activities; and rainwear for rainy days, as well as windbreakers for use at workplaces. Further, it engages in the solar power generation business. The company was founded in 1934 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "113-8710",
        "website": "http://www.okamoto-inc.jp",
        "market_cap": "Large Cap"
    },
    "5199.T": {
        "short_name": "FUJI LATEX CO",
        "long_name": "Fuji Latex Co., Ltd.",
        "summary": "Fuji Latex Co., Ltd. designs, develops, and sells motion controlling devices in Japan. The company offers shock absorbers for use in industrial machines; rotary dampers to control motion; and vane dampers for use in consumer products, as well as helical vibration absorbers, speed controllers, electrically controlled dampers, and plastic dampers. The company also provides healthcare products, including condoms, probe covers, balloons, and other related latex products. The company was formerly known as Japan Latex Industry Co., Ltd and changed its name to Fuji Latex Co., Ltd. in July 1961. Fuji Latex Co., Ltd. was incorporated in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0054",
        "website": "http://www.fujilatex.co.jp",
        "market_cap": "Mid Cap"
    },
    "5301.T": {
        "short_name": "TOKAI CARBON CO",
        "long_name": "Tokai Carbon Co., Ltd.",
        "summary": "Tokai Carbon Co., Ltd. manufactures and sells carbon-related products and services in Japan. It offers graphite electrodes for use in electric furnaces, such as direct current, alternating current, and refining furnaces; and carbon black, including SEAST, TOKABLACK, Aqua Black, and Thermal black varieties, which are used to reinforce the rubber in tires, as well as used as a black pigment in various black-colored products. It also provides fine carbon products comprising special graphite products that include isotropic graphite G/HK series, extruded graphite, SiC coated carbon, C/C composite, glassy carbon, solid SiC, carbon brush, and resin-impregnated graphite products, as well as furnace materials for silicon semiconductor, solar cell manufacturing, and other applications; and industrial furnaces and related products, which comprise silicon carbide heating elements, resistors, recryte SiC structural materials, and industrial furnaces for heat treatment of ceramics, electronic components, metals, glass, and others. In addition, it provides carbon and graphite products and solutions for various smelting applications; and friction materials, including sintered metal friction, paper friction, carbonaceous friction, sliding, resin, woven, and soft mold materials to regulate power transmission in industrial and construction machinery, as well as for use in brake and clutch parts of vehicles, such as motorbikes, trucks, buses, and trains. Further, the company offers anode materials for secondary lithium-ion batteries that are used in smartphones and electric cars. The company was formerly known as Tokai Electrode Mfg. Co. Ltd. and changed its name to Tokai Carbon Co., Ltd. in 1975. Tokai Carbon Co., Ltd. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8636",
        "website": "http://www.tokaicarbon.co.jp",
        "market_cap": "Large Cap"
    },
    "5381.T": {
        "short_name": "MIPOX CORPORATION",
        "long_name": "Mipox Corporation",
        "summary": "Mipox Corporation provides polishing products in Japan and internationally. It offers polishing films, abrasive papers and cloths, functional films, polishing slurries, fiber discs, abrasive non-woven fabrics, flap wheels, fine diamonds, fine super pellets, detergents/lubricants, polishing machines, inspection equipment, cleaning products, VARIO products, 3D printed objects, and retroreflective materials. The company also provides quality measurement, contracted polishing, research and development, and consulting services. Its products are used in hard-disk, optical fiber and connector, flat-panel display, semiconductor, compound semiconductor, automobile and other products, sample and shaft polishing, hoop material and wire rod, 3D printed structure, other surface processing and polishing, automobile and its repair, sheet and metal, aircraft, shipbuilding, printed circuit board, architecture, wood and finishing hardware, and stone and glasses. The company was formerly known as Nihon Micro Coating Co., Ltd and changed its name to Mipox Corporation in August 2013. Mipox Corporation was founded in 1925 and is headquartered in Shinjuku-ku, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shinjuku",
        "zipcode": "160-0023",
        "website": "http://www.mipox.co.jp",
        "market_cap": "Mid Cap"
    },
    "5395.T": {
        "short_name": "RIKEN CORUNDUM CO",
        "long_name": "Riken Corundum Company Limited.",
        "summary": "Riken Corundum Company Limited. engages in the manufacture and sale of coated abrasive papers, abrasive cloths and powders, OA equipment parts, and merchandise for personal use in Japan and internationally. It is also involved in the management and rental of real estate properties. The company was founded in 1935 and is headquartered in Konosu, Japan. Riken Corundum Company Limited. is a subsidiary of Okamoto Industries, Inc.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Konosu",
        "zipcode": "365-0051",
        "website": "http://www.rikencorundum.co.jp",
        "market_cap": "Small Cap"
    },
    "5695.T": {
        "short_name": "POWDERTECH CO LTD",
        "long_name": "Powdertech Co., Ltd.",
        "summary": "Powdertech Co., Ltd. manufactures and sells carriers for electrophotography in Japan and internationally. The company offers ferrite carrier materials for electrophotographic applications, such as copiers, printers, and multi-function printers; and iron powders for various applications, including chemical reduction, steel plate cutting, shot blasting, and powder metallurgy, as well as for disposable pocket warmer application. It also provides oxygen absorbers and oxygen sensors; and magnetic ferrite powders. The company was founded in 1952 and is based in Kashiwa, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kashiwa",
        "zipcode": "277-8557",
        "website": "http://www.powder-tech.co.jp",
        "market_cap": "Mid Cap"
    },
    "6036.T": {
        "short_name": "KEEPER TECHNICAL LABORATORY CO ",
        "long_name": "KeePer Technical Laboratory Co., Ltd.",
        "summary": "KeePer Technical Laboratory Co., Ltd. engages in the development, manufacture, and sale of car coatings, car washing chemicals and equipment, and other products in Japan. The company also provides interior cleaning products and sheet metal paints. It operates approximately 5500 stores under the KeePer PROSHOP name, and 59 directly managed service centers for car washing and coating under the KeePer LABO name. The company was founded in 1985 and is headquartered in Obu, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Obu",
        "zipcode": "474-0046",
        "website": "http://www.keepercoating.jp",
        "market_cap": "Large Cap"
    },
    "6988.T": {
        "short_name": "NITTO DENKO CORP",
        "long_name": "Nitto Denko Corporation",
        "summary": "Nitto Denko Corporation primarily engages in the adhesive tapes business in Japan and internationally. It provides double sided tapes, surface protective films, sealing materials/NVH related products, masking tapes, membranes, FPD/touch panel related products, gasket materials, semiconductor manufacturing process products, flexible printed circuit boards, porous films/breathable materials, and packaging tapes. The company also offers functional thermal transfer systems, such as labels, barcode label printers, and label printing software; tapes for electrical and electronic equipment; dust removal products for clean rooms; fluoroplastic sheets and tapes, and fluoroplastic porous films; and materials for housing and construction, as well as packaging machines. In addition, it provides medical products, including transdermal drug delivery patches, medical surgical products/supportive items, athletic tapes, medical surgical products/adhesive plasters sheets, adhesive tapes, and particles for nucleic acid synthesis. The company offers its products to automotive and transportation, housing/housing equipment, infrastructure, material, home appliance and electrical, display, electronic device, medical, packaging, and consumer/personal care industries. It has a research and development agreement with CAGE Bio Inc. for a transdermal formulation of undisclosed molecules. Nitto Denko Corporation was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0011",
        "website": "http://www.nitto.com",
        "market_cap": "Large Cap"
    },
    "7446.T": {
        "short_name": "TOHOKU CHEMICAL CO",
        "long_name": "Tohoku Chemical Co., Ltd.",
        "summary": "Tohoku Chemical Co., Ltd., a trading company, sells pesticides, food additives, and industrial chemicals and reagents in Japan. The company offers chemical industrial reagents/chemical industrial reagent-related apparatus. It also provides clinical diagnostic reagents/clinical diagnostic reagent-related equipment, such as kits inspecting for blood or bacteria helpful for medical examination and diagnosis of various diseases; medical devices that include clinical inspection apparatus and medical imaging systems; and external body diagnosing medicines, medical devices, medical materials, etc. In addition, the company offers food additives/food processing apparatus; and reagents for product inspection analysis hygiene materials, detergents, pesticides, and water treatment, as well as materials for transfer, analytical inspection, and product development. Further, it offers agricultural materials, such as pesticides, soil improvement materials, and agriculture-related materials; agricultural facilities, including steel greenhouses for floriculture; and healthcare products. In addition, the company engages in the sale and repair of computers, scientific instruments, medical equipment, educational devices, and measuring equipment; and cultivation and sale of flowers. Tohoku Chemical Co., Ltd. was founded in 1953 and is headquartered in Hirosaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hirosaki",
        "zipcode": "036-8655",
        "website": "http://www.t-kagaku.co.jp",
        "market_cap": "Mid Cap"
    },
    "7877.T": {
        "short_name": "EIDAI KAKO CO LTD",
        "long_name": "Eidai Kako Co.,Ltd.",
        "summary": "Eidai Kako Co.,Ltd. manufactures, imports, exports, and sells synthetic resin sheets and molded products. The company offers synthetic resin deformed molded products, including interior/exterior parts for home appliances, building materials of homes, and office furniture products; and floor mats for vehicles, bath lids, kitchen supplies, and pipe hangers. It also provides semiconductor-related parts, such as IC containers; laboratory benches and partition parts for office furniture parts; industrial related parts that are used in the field of terminal block covers, LED lighting covers, aircraft parts, and escalator sliding parts; and sewer pipe rehabilitation materials, concrete block flexible joints, landscape materials, bamboo panels, etc.; and various car accessories. The company was founded in 1949 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "547-0041",
        "website": "http://www.eidaikako.co.jp",
        "market_cap": "Mid Cap"
    },
    "7886.T": {
        "short_name": "YAMATO INDUSTRY CO",
        "long_name": "Yamato Industry Co., Ltd.",
        "summary": "Yamato Industry Co., Ltd. manufactures, processes, and sells OA equipment parts, SP products, logistics equipment, housing and automotive equipment, amusement related parts, household goods, information communication goods, and home appliance parts in Japan and internationally. The company offers various OA products, such as copier, fax, printer, sorter, and liquid crystal display device parts; livingware, including refrigerator and washing machine parts, housing garbage disposers, battery cases for power tools, and various food containers; and water purifier filters. It also provides automotive parts comprising thermo sensor parts, mudguards, and fog light garnishes; housing equipment related products consisting of unit bath parts, mirror cabinets, civil engineering and construction materials, acrylic processed products, polycarbonate plates, and fence parts; and resin materials, such as resin pellets and plastic plate materials. In addition, the company offers logistics equipment parts, including roll box palettes, box pallets, hand tracks, mesh pallets, storage racks, dolly products, hand truck products, plastic containers, foil trays, and part transport trays, as well as various pallets; and premium products comprising mobile phone goods, clocks, stationery, and other amenity goods. Further, it provides display products consisting of display wagons, cosmetic trays, pamphlet stands, illumination and moving signs, and PM vans; and faÃ§ade, pole, stand, and protruding signboards. The company was founded in 1937 and is headquartered in Kawagoe, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawagoe",
        "zipcode": "350-0001",
        "website": "http://www.yamato-in.co.jp",
        "market_cap": "Small Cap"
    },
    "7940.T": {
        "short_name": "WAVELOCK HLDGS CO LTD",
        "long_name": "Wavelock Holdings Co., Ltd.",
        "summary": "Wavelock Holdings Co., Ltd., through its subsidiaries, provides interior, material, and technology solutions in Japan and internationally. The company manufactures and sells plastic sheets/films, synthetic fiber net products, other processed products, and related products; and processes, manufactures, markets, sells, and consults synthetic resins and various materials, as well as produces and sells wallpapers, household goods, and related products. It also processes, manufactures, markets, and sells, and consults insect repellent products and various other materials; imports and sells synthetic resin or miscellaneous materials; and markets various electronic materials, plastic products, etc. The company was founded in 1964 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0044",
        "website": "http://www.wavelock-holdings.com",
        "market_cap": "Mid Cap"
    },
    "7958.T": {
        "short_name": "TENMA CORPORATION",
        "long_name": "Tenma Corporation",
        "summary": "Tenma Corporation manufactures and sells plastic products in Japan and internationally. It provides houseware products for use in kitchens, living rooms, and bathrooms; and household products used for interior storage in closets. The company also offers office automation equipment parts, including precision molded items, such as weak electric current parts and plastic molded parts; automobile parts comprising door trims, console boxes, instrument panels, heating cases, bumpers, etc.; and media cases consisting of CD/DVD cases and double cases, as well as CD/DVD/BD trays. In addition, it provides industrial plastic products, including materials for agricultural and marine products, packaging and preservation of food and beverages, and logistics; resin products and frame panels; and construction materials. The company was formerly known as Tenma Plastic Co., Ltd. and changed its name to Tenma Corporation in 1987. Tenma Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "115-0045",
        "website": "http://www.tenmacorp.co.jp",
        "market_cap": "Large Cap"
    },
    "8098.T": {
        "short_name": "INABATA & CO",
        "long_name": "Inabata & Co.,Ltd.",
        "summary": "Inabata & Co.,Ltd. provides solutions and services for information and electronics, chemicals, life industry, and plastics businesses worldwide. The company offers polarizing films, alignment layer materials, materials for backlights and touch screens, chemical products for LCD manufacturing, and materials and equipment for OLEDs; and LED encapsulants, special use tape materials, chemical products for LCDs, connectors, and devices related to LCDs and OLEDs. It also provides materials for toners and peripheral components; 3D printer-related products and film-related materials; inkjet ingredients and other products; materials and equipment for imaging, semiconductors, automobiles, and life science; industrial, electronics, and optics materials; materials for energy-related fields; semiconductor and electronics peripheral, and processing equipment components; and biotechnology. In addition, the company offers vinyl chloride plastics, plasticizers, additives, commodity resins, compounds, elastomers, engineering plastics, synthetic rubbers, plastic products, machinery, molding machines and auxiliary equipment, laser welding machines, recycling materials, heat dissipating products, printed circuit boards, aluminum products, cellulose nanofiber and plastic composites, polyolefin resins and film products, resin sheets and molded products, sporting goods, and plastic compounds. Further, it sells materials and intermediates for the plastic, super engineering plastic, urethane, fiber, and papermaking and cardboard industries, as well as data recording papers; coating materials; and materials for automobile parts and chemicals, housing, housing material, housing equipment manufacturers, pharmaceutical, advanced medication, chemical, insect repellent, insecticide, and home product industries. Additionally, it offers frozen fruits and vegetables; and fish slices, shrimps, crabs, shellfish, squids, etc. Inabata & Co.,Ltd. was founded in 1890 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-8558",
        "website": "http://www.inabata.co.jp",
        "market_cap": "Large Cap"
    },
    "8138.T": {
        "short_name": "SANKYO KASEI CORP",
        "long_name": "Sankyo Kasei Corporation",
        "summary": "Sankyo Kasei Corporation sells various chemicals in Japan. It manufactures synthetic resins, dyes, pigments, paints, dyeing auxiliary poisons, and deleterious substances; sells and imports/exports building materials, electrical equipment and parts, machines, tools, and other general goods; processes chemicals and natural fibers; researches and develops alcoholic beverages, drinking water, condiments, The company provides additives for concrete/cement mortar improvement, asphalt modification, and soil improvement; residential interior building materials, fixtures and furniture, kitchen, various doors for storage, hospital furniture, surface materials for building, adhesive, and plastic molded products. In addition, it offers information terminals, such as displays; functional coating agent; molded products, including CFRP; films for food and general packaging, and various printing process; and various surfactants for textile materials and processing, as well as private brand products comprises stucment, HS miracle putty, and miracone. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0057",
        "website": "http://www.sankyokasei-corp.co.jp",
        "market_cap": "Mid Cap"
    },
    "8152.T": {
        "short_name": "SOMAR CORPORATION",
        "long_name": "SOMAR Corporation",
        "summary": "SOMAR Corporation manufactures and trades in chemical materials in Japan and internationally. The company offers films and SMD/sealing materials for use in circuit boards; high functional films, outer protection/moisture-proof materials, and related materials for use in electric/electronic parts; and high light-shading/non-light reflection films for use in optical instruments. It also provides insulation materials for motors, as well as sealing materials for electronic control devices that are used in automotive electric/electronic parts; ink-jet printing films and large copy machine printing films for sign/graphic designs; and slime control agents, preservatives, and water retention aids for use in the paper manufacturing. In addition, the company offers food ingredients, such as thickeners or stabilizers; dehydrated onions, garlic, and vegetables; adhesive/ weak adhesive, UV releasing, and thermal expansion releasing films; high heat-resistant electrical insulation materials; resins for electronic parts, and motors/electronic components; black and ppc films; nonwoven fabric cloth; and cleaning agents. The company was formerly known as Marusho Industrial Co., Ltd. and changed its name to SOMAR Corporation in 1984. SOMAR Corporation was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8109",
        "website": "http://www.somar.co.jp",
        "market_cap": "Mid Cap"
    },
    "86S.F": {
        "short_name": "SEIKO PMC CORP.",
        "long_name": "Seiko PMC Corporation",
        "summary": "Seiko PMC Corporation produces and sells chemicals for use in the paper and board industry, and ink resin products for use in inks and recording materials in Japan and internationally. It provides paper making chemicals, such as surface and internal sizing agents, surface strength agents, dry and wet strength agents, retention aids/coagulants, printability aids/inkjet water resistance aids, creping aids/softeners, microbial products, and moisture-proof coating agents; and other functional chemicals, including water repellent agents and paper thickness improvers. The company's paper making chemicals are used in newsprint, printing, communication, and household papers; liner and corrugated mediums; boxboards; and wastewater treatment. It also offers resin products, such as rosin modified phenolic resin, and styrene-acrylic resin/styrene-maleic acid resin/acrylic resin in solid, varnish, and emulsion forms for use in water-based printing ink, recording materials for laser beam printers and copiers, coating materials, adhesives, clear coating, and paper processed products. It also offers biofilm control agents, silver nanowires, and cellulose nanofiber compound resin. The company was founded in 1951 and is headquartered in Tokyo, Japan. Seiko PMC Corporation is a subsidiary of DIC Corporation.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.seikopmc.co.jp",
        "market_cap": "Small Cap"
    },
    "9DC.SG": {
        "short_name": "Daicel Corp. Registered Shares ",
        "long_name": "Daicel Corporation",
        "summary": "Daicel Corporation manufactures and sells cellulosic derivatives, organic chemicals, plastics, pyrotechnic devices, and other products in Japan, Asia, North America, Latin America, and Europe. The company offers 1,3-Butylene glycol, polyglycerin, and other raw materials for cosmetics; natural health food materials and supplements, including equol and konjac ceramide; chiral columns, chiral reagents, and analysis services for CPI; cellulose acetate for LCD optical and high-performance optical films; resist materials and solvents for electronic materials and semiconductors; and lens modules, silver nano inks, and organic semiconductor devices for use in sensors. It also provides automobile airbag inflators and resin compound products for use in cars; gas generators for seat belt pretensioners and civilian-use pyrotechnics, such as pyro-fuses; acetic acid, ethyl acetate, other cellulose acetate, and acetate tow materials; and chemical materials, such as cycloaliphatic epoxy, caprolactone derivatives, alkylamines, and ketene derivatives. In addition, the company offers engineering plastics, including polyoxymethylene, polybutylene terephthalate, polyphenylene sulfide, liquid crystal polymer, and cyclic olefin copolymer; resin compounds for non-car use, which includes AS resin, ASB resin, and long fiber-reinforced plastics compounds; barrier films for packaging, polystyrene sheets, and molded containers; carboxymethyl cellulose for use in batteries; reverse osmosis membranes, ultrafiltration membrane products, and water treatment systems; and defense-related products for aerospace and defense systems. Its products are used in transportation, electronics, medical care, personal care, everyday life, and environment and energy applications. The company was formerly known as Daicel Chemical Industries, Ltd. and changed its name to Daicel Corporation in October 2011. Daicel Corporation was founded in 1919 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0011",
        "website": "http://www.daicel.com",
        "market_cap": "Small Cap"
    },
    "ASGLY": {
        "short_name": "AGC INC",
        "long_name": "AGC Inc.",
        "summary": "AGC Inc. manufactures and sells glass, electronics, chemicals, and ceramics worldwide. The company offers architectural glass products, including laminated, insulating, wired, solar control, toughened, decorative, sound insulation, float and patterned, and industrial glasses; structural glazing systems; and automotive glass, such as laminated, tempered, and privacy glasses, as well as integrated glass antennas, patterned glazing products, and module assembly windows. It also provides glass substrates used for thin-film-transistor liquid crystal displays and OLEDs; synthetic fused silica glass, synthetic quartz crystal, silicon carbide, CMP slurry, through glass Vias, high refractive index glass, DOE diffuser, glass ceramics substrate, optical planar device, IR cut filter, aspherical glass and molded lens, micro lens array, and fly eye and condenser lens products; polycarbonate and optical sheets, thin sheets, and films; and glass frits and paste, as well as glass substrate for semiconductor packaging, and other electronic materials. In addition, the company offers cover glass for smartphones and tablet devices; glass substrates for photovoltaic devices and touch panels; specialty glass; extra clear float glass; transparent conductive oxide glass for a-Si type solar module; and ultra-thin glass for electronics devices. Further, it provides chlor-alkali, polyurethanes, fluoro, and specialty chemical products; high thermal insulation ceramics wall for furnaces; and ceramic beads, sputtering targets, abrasion resistant ceramics, alumina cement, engineering fine ceramics, and ceramics molding agent for 3D printers. Additionally, the company engages in the digital signage on glass, copper clad laminate, and plastic optical fiber businesses; and gas and solvents, and life Science business. The company was formerly known as Asahi Glass Co., Ltd. and changed its name to AGC Inc. in July 2018. AGC Inc. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8405",
        "website": "http://www.agc.com",
        "market_cap": "Large Cap"
    },
    "AWTRF": {
        "short_name": "AIR WATER INC",
        "long_name": "Air Water Inc.",
        "summary": "Air Water Inc. engages in the industrial gas, chemical, medical, energy, agriculture and food products, and other businesses in Japan. The company offers oxygen, nitrogen, argon, carbon dioxide, hydrogen, and helium; air separation systems; gas equipment and systems; argon-based shielding gases; special gases; and integrated engineering solutions. It also provides quinone and organic acid products, fine chemicals, custom synthesis services, pharmaceutical and agricultural chemical intermediates, electronic materials and printed circuit boards, and carbon materials. In addition, the company offers medical oxygen, nitric oxide, and liquefied helium; operates hospital facilities; offers endoscope systems, hyperbaric oxygen chambers, and respiratory-related equipment and operation equipment; provides medical supply inventory management and medical instruments sterilization; and offers oxygen concentrators and infusion pumps, hygiene materials, injection needles, dental technical equipment and materials, and nursing care products and equipment. Further, it provides liquefied petroleum (LP) gas, kerosene, and natural gas (LNG); water heaters, stoves, boilers, kitchens, toilets, unit baths, garages, and carports; LP gas-type mobile power source cars; LNG transport equipment; LP gas/kerosene lorries; hams and sausages; frozen food; sweets; fresh vegetables; agricultural machinery; and soft drinks, vegetable beverages, and fruit beverages, as well as offers fruit and vegetable wholesale, processing, and retail services. Additionally, the company offers high-pressure gas transport, general cargo transport, food logistics, and bodywork services; salt, environmental products, food and agriculture and electricity services, and magnesia; aerosol products; and electronics materials, phenolic resins, O-rings, metal surface treatment services, artificial recycled wood, SiC substrates, and engineering services. Air Water Inc. was founded in 1929 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0081",
        "website": "http://www.awi.co.jp",
        "market_cap": "Mid Cap"
    },
    "DPN.F": {
        "short_name": "DIC CORP.",
        "long_name": "DIC Corporation",
        "summary": "DIC Corporation manufactures and sells printing inks, organic pigments, and polyphenylene sulfide (PPS) compounds worldwide. It operates through three segments: Packaging & Graphic, Color & Display, and Functional Products. The Packaging & Graphic segment offers printing materials, including gravure, flexo, metal decoration, security, jet, offset, and other inks; printing supplies; packaging adhesives; coextruded multilayer films; and polystyrene, as well as other products and solutions for packaging applications. The Color & Display segment provides color material products, such as organic pigments, pigments for color filters, effect pigments, pigments for cosmetics, health foods, and natural colorants; and display materials comprising thin-film transistor, nano-pase separated, and polymer-network liquid crystal materials. The Functional Products segment offers performance materials that include waterborne, ultraviolet-curable, acrylic, epoxy, phenolic, polyurethane, polyester, and unsaturated polyester resins, as well as fluorochemicals, plasticizers, alkylphenols, metal carboxylates, and sulphur chemicals. It also provides PPS compounds, firefighting foam, leather colorants, coatings, industrial adhesive tapes, magnetic tapes, hollow-fiber membrane modules, decorative boards and interior housing products, decorative sheets and decorative films, coatings for building materials, processed sheet molding compounds, and molded plastic products. The company offers its products and services to packaging, housing, automotive, cosmetics, electronics, and healthcare industries. The company was formerly known as Dainippon Ink and Chemicals, Incorporated and changed its name to DIC Corporation in April 2008. DIC Corporation was founded in 1908 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8233",
        "website": "http://www.dic-global.com",
        "market_cap": "Mid Cap"
    },
    "JSCPF": {
        "short_name": "JSR CORP",
        "long_name": "JSR Corporation",
        "summary": "JSR Corporation engages in the elastomers, plastics, digital solutions, and life sciences business in Japan and internationally. The company's Elastomers Business segment offers general purpose synthetic rubbers, including emulsion polymerization styrene-butadiene (SB), solution polymerization SB, polybutadiene and isoprene rubbers, etc.; special-purpose synthetic rubbers, such as acrylonitrile, butyl, ethylene propylene, NV and NE polymer blend rubbers, etc.; and thermoplastic elastomers comprising butadiene type TPE, hydrogenated polymer, styrene-butadiene type TPE, styrene-isoprene type TPE, olefin type TPE, etc. This segment also provides thermoplastic elastomers and compounded products, paper coating latex, industrial latex, natural latex compounded products, SB latex, acrylic emulsions, binders for batteries, asphalt pavement modifiers, water-based emulsions, etc.; and dispersants, industrial particles, materials for heat insulation paints, materials for batteries, butadiene monomers, etc. Its Plastics Business segment offers synthetic resins, such as ABS, AES, AS, and ASA resins; and polymer alloys. The company's Digital Solutions segment provides semiconductor materials comprising lithography materials, chemical mechanical planarization materials, packaging materials, and mounting materials; display materials consisting of liquid crystal display materials; functional coating materials; heat-resistant transparent resins and functional films; and photo fabrication and photo molding systems, etc. Its Life Sciences segment offers in-vitro diagnostic and life science research reagents, and bioprocess materials, as well as drug discovery and development services. The company was formerly known as Japan Synthetic Rubber Co., Ltd. JSR Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8640",
        "website": "http://www.jsr.co.jp",
        "market_cap": "Mid Cap"
    },
    "JSCPY": {
        "short_name": "JSR CORP",
        "long_name": "JSR Corporation",
        "summary": "JSR Corporation engages in the elastomers, plastics, digital solutions, and life sciences business in Japan and internationally. The company's Elastomers Business segment offers general purpose synthetic rubbers, including emulsion polymerization styrene-butadiene (SB), solution polymerization SB, polybutadiene and isoprene rubbers, etc.; special-purpose synthetic rubbers, such as acrylonitrile, butyl, ethylene propylene, NV and NE polymer blend rubbers, etc.; and thermoplastic elastomers comprising butadiene type TPE, hydrogenated polymer, styrene-butadiene type TPE, styrene-isoprene type TPE, olefin type TPE, etc. This segment also provides thermoplastic elastomers and compounded products, paper coating latex, industrial latex, natural latex compounded products, SB latex, acrylic emulsions, binders for batteries, asphalt pavement modifiers, water-based emulsions, etc.; and dispersants, industrial particles, materials for heat insulation paints, materials for batteries, butadiene monomers, etc. Its Plastics Business segment offers synthetic resins, such as ABS, AES, AS, and ASA resins; and polymer alloys. The company's Digital Solutions segment provides semiconductor materials comprising lithography materials, chemical mechanical planarization materials, packaging materials, and mounting materials; display materials consisting of liquid crystal display materials; functional coating materials; heat-resistant transparent resins and functional films; and photo fabrication and photo molding systems, etc. Its Life Sciences segment offers in-vitro diagnostic and life science research reagents, and bioprocess materials, as well as drug discovery and development services. The company was formerly known as Japan Synthetic Rubber Co., Ltd. JSR Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8640",
        "website": "http://www.jsr.co.jp",
        "market_cap": "Mid Cap"
    },
    "JYR.F": {
        "short_name": "JSR CORP.",
        "long_name": "JSR Corporation",
        "summary": "JSR Corporation engages in the elastomers, plastics, digital solutions, and life sciences business in Japan and internationally. The company's Elastomers Business segment offers general purpose synthetic rubbers, including emulsion polymerization styrene-butadiene (SB), solution polymerization SB, polybutadiene and isoprene rubbers, etc.; special-purpose synthetic rubbers, such as acrylonitrile, butyl, ethylene propylene, NV and NE polymer blend rubbers, etc.; and thermoplastic elastomers comprising butadiene type TPE, hydrogenated polymer, styrene-butadiene type TPE, styrene-isoprene type TPE, olefin type TPE, etc. This segment also provides thermoplastic elastomers and compounded products, paper coating latex, industrial latex, natural latex compounded products, SB latex, acrylic emulsions, binders for batteries, asphalt pavement modifiers, water-based emulsions, etc.; and dispersants, industrial particles, materials for heat insulation paints, materials for batteries, butadiene monomers, etc. Its Plastics Business segment offers synthetic resins, such as ABS, AES, AS, and ASA resins; and polymer alloys. The company's Digital Solutions segment provides semiconductor materials comprising lithography materials, chemical mechanical planarization materials, packaging materials, and mounting materials; display materials consisting of liquid crystal display materials; functional coating materials; heat-resistant transparent resins and functional films; and photo fabrication and photo molding systems, etc. Its Life Sciences segment offers in-vitro diagnostic and life science research reagents, and bioprocess materials, as well as drug discovery and development services. The company was formerly known as Japan Synthetic Rubber Co., Ltd. JSR Corporation was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8640",
        "website": "http://www.jsr.co.jp",
        "market_cap": "Mid Cap"
    },
    "KANKF": {
        "short_name": "KANEKA CORP",
        "long_name": "Kaneka Corporation",
        "summary": "Kaneka Corporation manufactures and sells chemicals, functional and expandable plastics and, foodstuffs, life science, electronic, and synthetic fibers products in Japan and internationally. The company offers polyvinyl chloride (PVC), crosslinked PVC, PVC-PVAc polymers, paste PVC, acryl grafted-vinyl chloride copolymer, and chlorinated PVC. It also provides impact modifiers, processing aids, specialty additives, toughener for thermosetting resins, silyl-terminated polyether, acrylic silicon, terminally reactive liquid acrylic, and biodegradable polymer, engineering resin for injection molding, zero birefringence, acrylic film, and isobutylene-based thermoplastic elastomer products. In addition, the company offers polypropylene and kanelite foams, extruded polystyrene foam insulation, polyimide film, transparent film for optical use, high thermal conductive graphite sheets, bonded magnets, multi-layer insulation, transparent conductive film, and thermo-resistant, and light-resistant transparent resin products. Further, it provides photovoltaic power generation systems for residences, public, and industrial installations; eco fur, flame-retardant, hair accessory, and new materials; organic EL lighting panels; and biosurfactant. Additionally, the company offers intervention, blood purification, gastroenterology intervention, ophthalmic medical device, testing equipment, regenerative medicine and cell therapy, and genetic diagnostic products; and low molecular pharmaceutical materials, affinity chromatography resin for purification of monoclonal antibody, biopharmaceuticals, transdermal medicine, and innerwear. It offers dairy products, margarine, fat and oils, whipping cream, filling, baker's yeast/ dough improver, processed fruits, butter, shortening, cacao butter, cream for kneading and other uses, frozen dough, spices, antifreeze materials, and pharma and supplemental nutrition solutions. Kaneka Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6028",
        "website": "http://www.kaneka.co.jp",
        "market_cap": "Mid Cap"
    },
    "KAP.F": {
        "short_name": "KANSAI PAINT CO.LTD",
        "long_name": "Kansai Paint Co., Ltd.",
        "summary": "Kansai Paint Co., Ltd. manufactures and sells paints in Japan, India, Asia, Africa, Europe, and internationally. The company offers decorative coatings for protecting exterior and interior of buildings; protective coatings; automotive refinish paints; automotive coatings; industrial coatings that are used in construction machinery, industrial vehicles, steel furniture, external building materials, electronics, and internal coatings and external designs of beverage cans; and marine and protective coatings. It also designs, manufactures, and sells coating equipment; controls and undertakes painting works; and designs color schemes. Kansai Paint Co., Ltd. was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8523",
        "website": "http://www.kansai.co.jp",
        "market_cap": "Mid Cap"
    },
    "KK2.F": {
        "short_name": "SUN A. KAKEN CO.",
        "long_name": "Sun A.Kaken Company,Limited",
        "summary": "Sun A.Kaken Company,Limited manufactures and sells various plastic composite products, and packaging and industrial materials in Japan. The company offers flexible packaging materials for food products, liquids, pharmaceuticals, and sundry goods industries. It also provides functional materials, such as functional films to protect delicate components of optoelectronics and multimedia devices from scratches, dust, and contamination during manufacture, shipping, and storage. In addition, the company offers industrial materials comprising adhesive tapes for use in the distribution industry and home applications. The company was founded in 1942 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.sun-a-kaken.co.jp",
        "market_cap": "Small Cap"
    },
    "KKA.F": {
        "short_name": "KANEKA CORP.",
        "long_name": "Kaneka Corporation",
        "summary": "Kaneka Corporation manufactures and sells chemicals, functional and expandable plastics and, foodstuffs, life science, electronic, and synthetic fibers products in Japan and internationally. The company offers polyvinyl chloride (PVC), crosslinked PVC, PVC-PVAc polymers, paste PVC, acryl grafted-vinyl chloride copolymer, and chlorinated PVC. It also provides impact modifiers, processing aids, specialty additives, toughener for thermosetting resins, silyl-terminated polyether, acrylic silicon, terminally reactive liquid acrylic, and biodegradable polymer, engineering resin for injection molding, zero birefringence, acrylic film, and isobutylene-based thermoplastic elastomer products. In addition, the company offers polypropylene and kanelite foams, extruded polystyrene foam insulation, polyimide film, transparent film for optical use, high thermal conductive graphite sheets, bonded magnets, multi-layer insulation, transparent conductive film, and thermo-resistant, and light-resistant transparent resin products. Further, it provides photovoltaic power generation systems for residences, public, and industrial installations; eco fur, flame-retardant, hair accessory, and new materials; organic EL lighting panels; and biosurfactant. Additionally, the company offers intervention, blood purification, gastroenterology intervention, ophthalmic medical device, testing equipment, regenerative medicine and cell therapy, and genetic diagnostic products; and low molecular pharmaceutical materials, affinity chromatography resin for purification of monoclonal antibody, biopharmaceuticals, transdermal medicine, and innerwear. It offers dairy products, margarine, fat and oils, whipping cream, filling, baker's yeast/ dough improver, processed fruits, butter, shortening, cacao butter, cream for kneading and other uses, frozen dough, spices, antifreeze materials, and pharma and supplemental nutrition solutions. Kaneka Corporation was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6028",
        "website": "http://www.kaneka.co.jp",
        "market_cap": "Mid Cap"
    },
    "KPTCY": {
        "short_name": "KANSAI PAINT CO LTD SPON ADS EA",
        "long_name": "Kansai Paint Co., Ltd.",
        "summary": "Kansai Paint Co., Ltd. manufactures and sells paints in Japan, India, Asia, Africa, Europe, and internationally. The company offers decorative coatings for protecting exterior and interior of buildings; protective coatings; automotive refinish paints; automotive coatings; industrial coatings that are used in construction machinery, industrial vehicles, steel furniture, external building materials, electronics, and internal coatings and external designs of beverage cans; and marine and protective coatings. It also designs, manufactures, and sells coating equipment; controls and undertakes painting works; and designs color schemes. Kansai Paint Co., Ltd. was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8523",
        "website": "http://www.kansai.co.jp",
        "market_cap": "Mid Cap"
    },
    "KSANF": {
        "short_name": "KANSAI PAINT CO LTD",
        "long_name": "Kansai Paint Co., Ltd.",
        "summary": "Kansai Paint Co., Ltd. manufactures and sells paints in Japan, India, Asia, Africa, Europe, and internationally. The company offers decorative coatings for protecting exterior and interior of buildings; protective coatings; automotive refinish paints; automotive coatings; industrial coatings that are used in construction machinery, industrial vehicles, steel furniture, external building materials, electronics, and internal coatings and external designs of beverage cans; and marine and protective coatings. It also designs, manufactures, and sells coating equipment; controls and undertakes painting works; and designs color schemes. Kansai Paint Co., Ltd. was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8523",
        "website": "http://www.kansai.co.jp",
        "market_cap": "Mid Cap"
    },
    "MITUF": {
        "short_name": "MITSUI CHEMICALS INC",
        "long_name": "Mitsui Chemicals, Inc.",
        "summary": "Mitsui Chemicals, Inc. engages in the mobility, health care, food and packaging, basic materials, and other businesses. The company's Mobility segment develops elastomers, performance compounds, functional polymers, polypropylene compounds, and performance polymers; and offers services related to the development of automotive and industrial products. Its Health Care segment offers vision care materials, nonwoven fabrics, dental materials, and personal care materials. The Food & Packaging segment provides coating and engineering materials, performance films and sheets, and agrochemical products. The Basic Materials segment provides ethylene, propylene, polyethylene, polypropylene, catalysts, phenols, purified terephthalic acid, PET, polyurethane materials, and industrial chemical products. The company also offers civil engineering and construction materials; cosmetics; wood adhesives, paper resins, foliar activator, and other chemical products; polyolefin, urethanes, and synthetic resins and resin films; injection molds and presses; phosphoric acid and fertilizers; spunbonded nonwoven fabrics and synthetic fibers; monomers for optical lenses; and fine chemical products and inorganic chemicals. In addition, it is involved in performance analysis, physical property measurements, and safety tests on chemicals; and placements, temporary works, and insurance and travel services, and consignments, as well as the sale of electronics and information materials. The company sells its products in Japan, China, Asia, the Americas, Europe, and internationally. Mitsui Chemicals, Inc. was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-7122",
        "website": "http://www.mitsuichemicals.com",
        "market_cap": "Mid Cap"
    },
    "MITUY": {
        "short_name": "MITSUI CHEMICALS INC",
        "long_name": "Mitsui Chemicals, Inc.",
        "summary": "Mitsui Chemicals, Inc. engages in the mobility, health care, food and packaging, basic materials, and other businesses. The company's Mobility segment develops elastomers, performance compounds, functional polymers, polypropylene compounds, and performance polymers; and offers services related to the development of automotive and industrial products. Its Health Care segment offers vision care materials, nonwoven fabrics, dental materials, and personal care materials. The Food & Packaging segment provides coating and engineering materials, performance films and sheets, and agrochemical products. The Basic Materials segment provides ethylene, propylene, polyethylene, polypropylene, catalysts, phenols, purified terephthalic acid, PET, polyurethane materials, and industrial chemical products. The company also offers civil engineering and construction materials; cosmetics; wood adhesives, paper resins, foliar activator, and other chemical products; polyolefin, urethanes, and synthetic resins and resin films; injection molds and presses; phosphoric acid and fertilizers; spunbonded nonwoven fabrics and synthetic fibers; monomers for optical lenses; and fine chemical products and inorganic chemicals. In addition, it is involved in performance analysis, physical property measurements, and safety tests on chemicals; and placements, temporary works, and insurance and travel services, and consignments, as well as the sale of electronics and information materials. The company sells its products in Japan, China, Asia, the Americas, Europe, and internationally. Mitsui Chemicals, Inc. was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-7122",
        "website": "http://www.mitsuichemicals.com",
        "market_cap": "Mid Cap"
    },
    "MSI.F": {
        "short_name": "MITSUI CHEMICALS",
        "long_name": "Mitsui Chemicals, Inc.",
        "summary": "Mitsui Chemicals, Inc. engages in the mobility, health care, food and packaging, basic materials, and other businesses. The company's Mobility segment develops elastomers, performance compounds, functional polymers, polypropylene compounds, and performance polymers; and offers services related to the development of automotive and industrial products. Its Health Care segment offers vision care materials, nonwoven fabrics, dental materials, and personal care materials. The Food & Packaging segment provides coating and engineering materials, performance films and sheets, and agrochemical products. The Basic Materials segment provides ethylene, propylene, polyethylene, polypropylene, catalysts, phenols, purified terephthalic acid, PET, polyurethane materials, and industrial chemical products. The company also offers civil engineering and construction materials; cosmetics; wood adhesives, paper resins, foliar activator, and other chemical products; polyolefin, urethanes, and synthetic resins and resin films; injection molds and presses; phosphoric acid and fertilizers; spunbonded nonwoven fabrics and synthetic fibers; monomers for optical lenses; and fine chemical products and inorganic chemicals. In addition, it is involved in performance analysis, physical property measurements, and safety tests on chemicals; and placements, temporary works, and insurance and travel services, and consignments, as well as the sale of electronics and information materials. The company sells its products in Japan, China, Asia, the Americas, Europe, and internationally. Mitsui Chemicals, Inc. was founded in 1892 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-7122",
        "website": "http://www.mitsuichemicals.com",
        "market_cap": "Mid Cap"
    },
    "MUG.F": {
        "short_name": "MITSUBISHI GAS CHEMICAL",
        "long_name": "Mitsubishi Gas Chemical Company, Inc.",
        "summary": "Mitsubishi Gas Chemical Company, Inc. manufactures and sells basic and fine chemicals, and functional materials in Japan and internationally. It operates through Natural Gas Chemicals, Aromatic Chemicals, Specialty Chemicals, and Information & Advanced Materials segments. The Natural Gas Chemicals segment offers methanol and organic chemicals, and life science products. This segment is also involved in the mining and exploration of natural gas and oil, and development of geothermal energy. The Aromatic Chemicals segment provides aromatic chemicals and foamed plastics. The Specialty Chemicals segment offers inorganic chemicals, engineering plastics, and optical materials. The Information & Advanced Materials segment provides electronic materials and oxygen absorbers. Additionally, the company engages in the sale, leasing, management, and brokerage of real estate properties; shipping, freight transportation, and warehouse and tourist operations; civil engineering work and various other construction assignments; and research and development, sale, and consulting related to various technologies related to chemical industries. It also designs, manufactures, sells, operates, and supervises and consults machinery used in chemical industries and environmental preservation; and conducts various tests, analyses, and consults to environmental measurements and safety of chemical products. Mitsubishi Gas Chemical Company, Inc. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8324",
        "website": "http://www.mgc.co.jp",
        "market_cap": "Mid Cap"
    },
    "ND5.F": {
        "short_name": "NITTO DENKO",
        "long_name": "Nitto Denko Corporation",
        "summary": "Nitto Denko Corporation primarily engages in the adhesive tapes business in Japan and internationally. It provides double sided tapes, surface protective films, sealing materials/NVH related products, masking tapes, membranes, FPD/touch panel related products, gasket materials, semiconductor manufacturing process products, flexible printed circuit boards, porous films/breathable materials, and packaging tapes. The company also offers functional thermal transfer systems, such as labels, barcode label printers, and label printing software; tapes for electrical and electronic equipment; dust removal products for clean rooms; fluoroplastic sheets and tapes, and fluoroplastic porous films; and materials for housing and construction, as well as packaging machines. In addition, it provides medical products, including transdermal drug delivery patches, medical surgical products/supportive items, athletic tapes, medical surgical products/adhesive plasters sheets, adhesive tapes, and particles for nucleic acid synthesis. The company offers its products to automotive and transportation, housing/housing equipment, infrastructure, material, home appliance and electrical, display, electronic device, medical, packaging, and consumer/personal care industries. It has a research and development agreement with CAGE Bio Inc. for a transdermal formulation of undisclosed molecules. Nitto Denko Corporation was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0011",
        "website": "http://www.nitto.com",
        "market_cap": "Mid Cap"
    },
    "NDEKF": {
        "short_name": "NITTO DENKO CORP",
        "long_name": "Nitto Denko Corporation",
        "summary": "Nitto Denko Corporation primarily engages in the adhesive tapes business in Japan and internationally. It provides double sided tapes, surface protective films, sealing materials/NVH related products, masking tapes, membranes, FPD/touch panel related products, gasket materials, semiconductor manufacturing process products, flexible printed circuit boards, porous films/breathable materials, and packaging tapes. The company also offers functional thermal transfer systems, such as labels, barcode label printers, and label printing software; tapes for electrical and electronic equipment; dust removal products for clean rooms; fluoroplastic sheets and tapes, and fluoroplastic porous films; and materials for housing and construction, as well as packaging machines. In addition, it provides medical products, including transdermal drug delivery patches, medical surgical products/supportive items, athletic tapes, medical surgical products/adhesive plasters sheets, adhesive tapes, and particles for nucleic acid synthesis. The company offers its products to automotive and transportation, housing/housing equipment, infrastructure, material, home appliance and electrical, display, electronic device, medical, packaging, and consumer/personal care industries. It has a research and development agreement with CAGE Bio Inc. for a transdermal formulation of undisclosed molecules. Nitto Denko Corporation was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0011",
        "website": "http://www.nitto.com",
        "market_cap": "Large Cap"
    },
    "NDEKY": {
        "short_name": "NITTO DENKO CORP",
        "long_name": "Nitto Denko Corporation",
        "summary": "Nitto Denko Corporation primarily engages in the adhesive tapes business in Japan and internationally. It provides double sided tapes, surface protective films, sealing materials/NVH related products, masking tapes, membranes, FPD/touch panel related products, gasket materials, semiconductor manufacturing process products, flexible printed circuit boards, porous films/breathable materials, and packaging tapes. The company also offers functional thermal transfer systems, such as labels, barcode label printers, and label printing software; tapes for electrical and electronic equipment; dust removal products for clean rooms; fluoroplastic sheets and tapes, and fluoroplastic porous films; and materials for housing and construction, as well as packaging machines. In addition, it provides medical products, including transdermal drug delivery patches, medical surgical products/supportive items, athletic tapes, medical surgical products/adhesive plasters sheets, adhesive tapes, and particles for nucleic acid synthesis. The company offers its products to automotive and transportation, housing/housing equipment, infrastructure, material, home appliance and electrical, display, electronic device, medical, packaging, and consumer/personal care industries. It has a research and development agreement with CAGE Bio Inc. for a transdermal formulation of undisclosed molecules. Nitto Denko Corporation was founded in 1918 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0011",
        "website": "http://www.nitto.com",
        "market_cap": "Large Cap"
    },
    "NI7.F": {
        "short_name": "NIPPON PAINT HLDGS CO.LTD",
        "long_name": "Nippon Paint Holdings Co., Ltd.",
        "summary": "Nippon Paint Holdings Co., Ltd. engages in the paint and fine chemicals businesses. The company offers automotive coatings, including paints for use in bumpers and plastic components; trade-use paints for homes, buildings, and bridges; and industrial coatings that are used in a range of products, including construction and farming machinery, exterior building materials, office equipment, and household electrical appliances. It also provides marine coatings, such as antifouling paints for fuel-saving; and paints for automobiles refinish, DIY, and road surface markings. In addition, the company offers surface treatment products comprising hydrophilic surface treatment and eco-friendly surface treatment agents; and fine products that include functional interlayer coatings, as well as coatings for display films. It has operations in Japan, Asia, the Americas, Oceania, and internationally. The company was formerly known as Nippon Paint Co., Ltd. and changed its name to Nippon Paint Holdings Co., Ltd. in October 2014. Nippon Paint Holdings Co., Ltd. was founded in 1881 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-8511",
        "website": "http://www.nipponpaint-holdings.com",
        "market_cap": "Large Cap"
    },
    "NNC.F": {
        "short_name": "NIPPON CARBIDE IND.",
        "long_name": "Nippon Carbide Industries Co., Inc.",
        "summary": "Nippon Carbide Industries Co., Inc. engages in the electronic and functional products, and films and sheetings business. It offers functional chemicals, such as electronic materials, special functional coatings, agrochemicals, metal surface treatment agents, pharmaceutical products, and biochemistry; and specialty polymers, including thickening and adhesive agents, ingredients of toner ink and coating materials, and melamine resin for tableware. The company also provides semiconductor mold cleaners and conditioners; and ceramic substrates, such as alumina substrates, thick-film printing substrates, and green sheetings. In addition, it offers marking films, laser markable labels, and packaging materials; graphic and 3D-emblem stickers; retroreflective sheetings and aluminum connected sign substrates; and aerial display reflectors. The company was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8466",
        "website": "http://www.carbide.co.jp",
        "market_cap": "Small Cap"
    },
    "NOF.MU": {
        "short_name": "NOF CORP.",
        "long_name": "NOF Corporation",
        "summary": "NOF Corporation manufactures chemicals Japan, rest of Asia, and internationally. The company operates through Functional Chemicals, Life Science, and Explosive & Propulsion segments. The Functional Chemicals segment offers fatty acids and glycerin, fatty acid derivatives, and surfactants, ethylene oxide and propylene oxide derivatives, organic peroxides, functional polymers, functional films, and electronic materials, as well as materials for anti-corrosion. The Life Science segment provides MPC-related products, raw materials for DDS drug formulation, edible oils, and functional foods. The Explosive & Propulsion segment offers industrial explosives, defense-related explosives, rocket propellant, automotive safety devices, and metal manufactured products. The company is also involved in logistics, insurance agency, and real estate businesses. NOF Corporation was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-6019",
        "website": "http://www.nof.co.jp",
        "market_cap": "Mid Cap"
    },
    "NPCPF": {
        "short_name": "NIPPON PAINT HOLDINGS CO LTD",
        "long_name": "Nippon Paint Holdings Co., Ltd.",
        "summary": "Nippon Paint Holdings Co., Ltd. engages in the paint and fine chemicals businesses. The company offers automotive coatings, including paints for use in bumpers and plastic components; trade-use paints for homes, buildings, and bridges; and industrial coatings that are used in a range of products, including construction and farming machinery, exterior building materials, office equipment, and household electrical appliances. It also provides marine coatings, such as antifouling paints for fuel-saving; and paints for automobiles refinish, DIY, and road surface markings. In addition, the company offers surface treatment products comprising hydrophilic surface treatment and eco-friendly surface treatment agents; and fine products that include functional interlayer coatings, as well as coatings for display films. It has operations in Japan, Asia, the Americas, Oceania, and internationally. The company was formerly known as Nippon Paint Co., Ltd. and changed its name to Nippon Paint Holdings Co., Ltd. in October 2014. Nippon Paint Holdings Co., Ltd. was founded in 1881 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "531-8511",
        "website": "http://www.nipponpaint-holdings.com",
        "market_cap": "Large Cap"
    },
    "NPV.F": {
        "short_name": "NIPPON CARBON",
        "long_name": "Nippon Carbon Co., Ltd.",
        "summary": "Nippon Carbon Co., Ltd. engages in the manufacture and sale of carbon products in Japan. It offers carbon fiber products, including molded heat insulating materials for high temperature furnaces; CARBORON, a soft felt used in a range of heat insulators for high temperature furnaces; C/C Composite, a lightweight carbon material used in heat resistant composite structural members, high temperature furnace materials, trays, jigs, etc.; and CARBEST, a carbon fiber packing material. The company also provides specialty carbon products, such as isotropic graphite, a graphite material; high purity treatment graphite used for manufacturing device components for silicon semiconductors, compound semiconductors, and optical fibers; carbon products for mechanical components that are used in various fields of science, including electronics, machinery, and the metallurgy industry; VESCOAT, a silicon carbide coated product used for silicon semiconductor, LED, and manufacturing device components for optical fibers; and SC CARBON sliding composites. In addition, it offers artificial graphite electrodes for use in high-power electric arc furnaces; silicon carbide continuous fibers, such as Nicalon, Hi-Nicalon, and Hi-Nicalon TypeS for use as reinforcement fibers in ceramic composite materials, plastic composite materials, and others; and lithium ion secondary batteries used for cellular and smart phones, NBPC, tablet terminals, power tools, hybrid automobiles, and electric automobiles. Further, the company provides impervious graphite RESBON, a corrosion-resistant material; NICABEADS, which are surface-coated micro bead-shape materials; and NICAFILM, a flexible graphite sheet made from natural graphite. The company was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0032",
        "website": "http://www.carbon.co.jp",
        "market_cap": "Small Cap"
    },
    "NZE.F": {
        "short_name": "ZEON CORP.",
        "long_name": "Zeon Corporation",
        "summary": "Zeon Corporation engages in the elastomers, specialty materials, and other businesses. The company offers synthetic rubbers, such as general-purpose rubbers for use in automobile tire applications; and various specialty rubbers, including NBR and hydrogenated NBR. It also provides synthetic latex comprising styrene-butadiene copolymer latex, polybutadiene, acrylonitrile butadiene copolymer latex, acrylate latex, and soap-free latex for use in processed paper, fiber treatment agents, adhesives, paints, and rubber gloves; and materials for adhesive tapes and hot melt adhesives, binder for traffic paints, and concrete admixtures. In addition, the company offers specialty chemicals, such as synthetic aroma chemicals for flavors and fragrances; cyclopentene, cyclopentanone, and other derivatives for chemical synthesis; intermediates for pharmaceuticals and agrochemicals; and solvents and cleaning agents. Further, it provides electronic materials, rechargeable battery materials, and toners for the production of semiconductors, etching gas, and materials used in rechargeable battery production; and specialty plastics that include cyclo olefin polymers and fine processed products with cyclo olefin polymer for use in optical lenses, medical devices, and various general-purpose engineering plastics. Additionally, the company develops, manufactures, and sells cardiovascular and gastrointestinal medical equipment, as well as nutritional products; and licenses butadiene recovery and butene purification process technologies in approximately 23 countries worldwide. It also offers PENTAM, a resource- and energy-saving molded product. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8246",
        "website": "http://www.zeon.co.jp",
        "market_cap": "Mid Cap"
    },
    "SHJ.F": {
        "short_name": "AGC INC.",
        "long_name": "AGC Inc.",
        "summary": "AGC Inc. manufactures and sells glass, electronics, chemicals, and ceramics worldwide. The company offers architectural glass products, including laminated, insulating, wired, solar control, toughened, decorative, sound insulation, float and patterned, and industrial glasses; structural glazing systems; and automotive glass, such as laminated, tempered, and privacy glasses, as well as integrated glass antennas, patterned glazing products, and module assembly windows. It also provides glass substrates used for thin-film-transistor liquid crystal displays and OLEDs; synthetic fused silica glass, synthetic quartz crystal, silicon carbide, CMP slurry, through glass Vias, high refractive index glass, DOE diffuser, glass ceramics substrate, optical planar device, IR cut filter, aspherical glass and molded lens, micro lens array, and fly eye and condenser lens products; polycarbonate and optical sheets, thin sheets, and films; and glass frits and paste, as well as glass substrate for semiconductor packaging, and other electronic materials. In addition, the company offers cover glass for smartphones and tablet devices; glass substrates for photovoltaic devices and touch panels; specialty glass; extra clear float glass; transparent conductive oxide glass for a-Si type solar module; and ultra-thin glass for electronics devices. Further, it provides chlor-alkali, polyurethanes, fluoro, and specialty chemical products; high thermal insulation ceramics wall for furnaces; and ceramic beads, sputtering targets, abrasion resistant ceramics, alumina cement, engineering fine ceramics, and ceramics molding agent for 3D printers. Additionally, the company engages in the digital signage on glass, copper clad laminate, and plastic optical fiber businesses; and gas and solvents, and life Science business. The company was formerly known as Asahi Glass Co., Ltd. and changed its name to AGC Inc. in July 2018. AGC Inc. was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8405",
        "website": "http://www.agc.com",
        "market_cap": "Mid Cap"
    },
    "SLO.F": {
        "short_name": "STELLA CHEMIFA CORP",
        "long_name": "Stella Chemifa Corporation",
        "summary": "Stella Chemifa Corporation manufactures and sells inorganic fluorine compounds in Japan and internationally. It offers hydrofluoric acid, buffered hydrofluoric acid, and etching solutions used in semiconductors, liquid crystal products, and solar batteries; calcium, aluminum, lithium, strontium, barium, magnesium, zinc, and lead fluoride used in optical materials; and lithium hexafluorophosphate for batteries. The company also provides boron trifluoride, boron trifluoride diethyl ether, boron trifluoride dimethyl ether, boron trifluoride n-butyl ether, boron trifluoride tetrahydrofuran, boron trifluoride phenol, boron trifluoride monoethyl amine, boron trifluoride piperidine, and triethylamine 3HF used in reactive catalysts; and anhydrous hydrofluoric acid and 55% hydrofluoric acid used in surface treatment and alternatives for CFCs. In addition, it offers potassium fluoroborate and boric acid for nuclear energy applications; tin fluoride (II) USP used in GMP-compliant products; and other products, such as fluorosilicic acid, potassium fluorosilicate, ammonium fluorosilicate, fluoroboric acid, tin fluoroborate, copper fluoroborate, lead fluoroborate, zinc fluoroborate, sodium fluoroborate, potassium fluoroborate, ammonium hydrogenfluoride, sodium fluoride, potassium fluoride, ammonium fluoride, potassium hexafluorozirconate, potassium hexafluorotitanate, refined calcium fluoride, and potassium hexafluorophosphate. Further, the company transports a range of special chemical substances, high-pressure gas, hazardous materials, and related products. Additionally, it develops Boron Neutron Capture therapy for the treatment of cancer. The company was formerly known as Hashimoto Chemical Corporation and changed its name to Stella Chemifa Corporation in 1997. Stella Chemifa Corporation was founded in 1916 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0044",
        "website": "http://www.stella-chemifa.co.jp",
        "market_cap": "Small Cap"
    },
    "SOQ.MU": {
        "short_name": "SOKEN CHEMICAL + EN.",
        "long_name": "Soken Chemical & Engineering Co., Ltd.",
        "summary": "Soken Chemical & Engineering Co., Ltd. manufactures and sells acrylic pressure-sensitive adhesives, functional polymers, organic fine particles, and adhesive tapes in Japan, China, and internationally. Its pressure-sensitive adhesives are used for a range of applications in industrial fields, including IT devices, automobiles, building materials, and electronics and optical devices, as well as in household products, such as double-sided and packing tapes, and adhesive plasters. The company's functional materials are used in the field of electronic substrate materials, inks, paints, displays, and multipurpose copy machines; and functional fine particles for use in LCD light diffusion agent, paint, toner, anti-blocking film agent, cosmetic, and fiber reinforced plastic applications. It also offers specialty coated products comprising double-sided acrylic foam-based adhesive tapes and sheets; and nanoimprinting molds and films. In addition, the company provides organic conductive materials for antistatic and conductive coating, capacitors, solar cell electrodes, hole transport materials for OPV, and hole injection materials for organic EL devices. Further, it is involved in heating media, thermal boiler, and plant engineering and maintenance businesses. The company was formerly known as Sogo Kako Laboratories, Ltd. and changed its name to Soken Chemical & Engineering Co., Ltd. in 1953. Soken Chemical & Engineering Co., Ltd. was founded in 1948 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "171-8531",
        "website": "http://www.soken-ce.co.jp",
        "market_cap": "Small Cap"
    },
    "SZ8.MU": {
        "short_name": "SUMITOMO BAKELITE",
        "long_name": "Sumitomo Bakelite Company Limited",
        "summary": "Sumitomo Bakelite Company Limited engages in the manufacture and sale of semiconductor materials and plastic products in Japan and internationally. The company offers epoxy resin molding compounds for encapsulation of semiconductor devices, photosensitive coating resins for semiconductor wafers, liquid resins for semiconductor devices, substrate materials for semiconductor packages; and high performance plastic products, such as phenolic molding compounds, resins for industrial use, and resin copper-clad laminates, molded parts, synthetic resin adhesives, epoxy resin copper-clad laminates, and aircraft interior components. The company also provides vinyl resin and multilayer sheets, freshness preserving films, melamine resin decorative laminates and sheets, polycarbonate and PVC resin plates, and biotechnology related products, as well as engages in the design and contracting of waterproofing work. In addition, it offers packaging products for producers and vegetable factories and freshness keeping zipper bags for household use; halogen-free, flame retardant, and heat resistant sheets and aluminum based decorative laminates; and medical devices, such as endoscopic device, surgery/drainage, and circulation/IVR. Further, the company provides healthcare products, which include low protein adsorption products and ELISA, glycan analysis, and three-dimensional cell culture; polymer waveguide with micro-mirror; and waterproofing products. It serves automotive/railways/aircraft, electrical and electronic equipment, construction/residence, industrial material, medical institution/laboratory, bio, agriculture, and functional packaging sectors, as well as interior decoration for stores. Sumitomo Bakelite Company Limited was founded in 1932 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-0002",
        "website": "http://www.sumibe.co.jp",
        "market_cap": "Small Cap"
    },
    "TBT.F": {
        "short_name": "TOKUYAMA CORP.",
        "long_name": "Tokuyama Corporation",
        "summary": "Tokuyama Corporation produces and sells various chemical products in Japan. The company operates in four segments: Chemicals, Specialty Products, Cement, and Life & Amenity. The Chemicals segment offers caustic soda, soda ash, calcium chloride, sodium silicate, vinyl chloride monomer, polyvinyl chloride resin, propylene oxide, isopropyl alcohol, chlorinated solvents, and hydrogen. The Specialty Products segment provides polycrystalline silicon; fumed silica and tetrachlorosilane; aluminum nitride; high-purity chemicals for electronics manufacturing and photoresist developer; and methylene chloride for metal cleaning. The Cement segment offers cement, ready-mixed concrete, and cement-type soil solidifier, as well as engages in the recycling and environment businesses. The Life & Amenity segment provides polyolefin film, plastic window sashes, medical diagnosis systems, dental materials and equipment, ion exchange membranes, pharmaceutical ingredients and intermediates, plastic lens-related materials, and microporous film. The company was formerly known as Tokuyama Soda Co., Ltd. and changed its name to Tokuyama Corporation in April 1994. Tokuyama Corporation was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8618",
        "website": "http://www.tokuyama.co.jp",
        "market_cap": "Small Cap"
    },
    "TIJ.F": {
        "short_name": "TEIJIN LTD",
        "long_name": "Teijin Limited",
        "summary": "Teijin Limited engages in the fibers, films and sheets, composites, healthcare, and IT businesses worldwide. It offers para-aramid and meta-aramid fibers for friction materials, tire and rubber reinforcements, optical fiber reinforcements, ballistics protection, protective clothing, firefighting uniforms, and heat-resistant filters. The company also provides polycarbonate, PEN, and PPS resins, as well as flame retardants for use in electrical and electronic components, audiovisual and office automation equipment, personal computer casings, automotive components, and smartphone camera lenses; and polycarbonate films and sheets for organic electroluminescent display anti-reflective films and automotive instrument panels. In addition, it offers carbon fibers and intermediate materials, and oxidized PAN fibers for aircraft structural and interior components, pressure vessels, compounds, and sports and leisure goods; glass fiber composites and carbon fiber composites for use in automotive filed. Further, the company provides pharmaceuticals for bone and joint, respiratory, cardiovascular and metabolic, and other diseases; home oxygen therapy, non-invasive positive pressure ventilation, rehabilitation, and sleep disordered breathing related devices, as well as sonic accelerated fracture healing system and community-based integrated care system; and orthopedic implantable devices, functional food ingredients, digital healthcare products, and other medical devices. Additionally, it offers fiber materials and apparel for threads, textiles, sports clothing, heavy clothing, fashion apparel, and uniforms; industrial textiles and materials; and wearable sensors. The company also provides GRANDIT, a web-based enterprise resource planning software package; IT services for the healthcare and other enterprises; and e-comics distribution services. Teijin Limited was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8585",
        "website": "http://www.teijin.com",
        "market_cap": "Mid Cap"
    },
    "TINLY": {
        "short_name": "TEIJIN LTD",
        "long_name": "Teijin Limited",
        "summary": "Teijin Limited engages in the fibers, films and sheets, composites, healthcare, and IT businesses worldwide. It offers para-aramid and meta-aramid fibers for friction materials, tire and rubber reinforcements, optical fiber reinforcements, ballistics protection, protective clothing, firefighting uniforms, and heat-resistant filters. The company also provides polycarbonate, PEN, and PPS resins, as well as flame retardants for use in electrical and electronic components, audiovisual and office automation equipment, personal computer casings, automotive components, and smartphone camera lenses; and polycarbonate films and sheets for organic electroluminescent display anti-reflective films and automotive instrument panels. In addition, it offers carbon fibers and intermediate materials, and oxidized PAN fibers for aircraft structural and interior components, pressure vessels, compounds, and sports and leisure goods; glass fiber composites and carbon fiber composites for use in automotive filed. Further, the company provides pharmaceuticals for bone and joint, respiratory, cardiovascular and metabolic, and other diseases; home oxygen therapy, non-invasive positive pressure ventilation, rehabilitation, and sleep disordered breathing related devices, as well as sonic accelerated fracture healing system and community-based integrated care system; and orthopedic implantable devices, functional food ingredients, digital healthcare products, and other medical devices. Additionally, it offers fiber materials and apparel for threads, textiles, sports clothing, heavy clothing, fashion apparel, and uniforms; industrial textiles and materials; and wearable sensors. The company also provides GRANDIT, a web-based enterprise resource planning software package; IT services for the healthcare and other enterprises; and e-comics distribution services. Teijin Limited was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8585",
        "website": "http://www.teijin.com",
        "market_cap": "Mid Cap"
    },
    "TKCBY": {
        "short_name": "TOKAI CARBON CO",
        "long_name": "Tokai Carbon Co., Ltd.",
        "summary": "Tokai Carbon Co., Ltd. manufactures and sells carbon-related products and services in Japan. It offers graphite electrodes for use in electric furnaces, such as direct current, alternating current, and refining furnaces; and carbon black, including SEAST, TOKABLACK, Aqua Black, and Thermal black varieties, which are used to reinforce the rubber in tires, as well as used as a black pigment in various black-colored products. It also provides fine carbon products comprising special graphite products that include isotropic graphite G/HK series, extruded graphite, SiC coated carbon, C/C composite, glassy carbon, solid SiC, carbon brush, and resin-impregnated graphite products, as well as furnace materials for silicon semiconductor, solar cell manufacturing, and other applications; and industrial furnaces and related products, which comprise silicon carbide heating elements, resistors, recryte SiC structural materials, and industrial furnaces for heat treatment of ceramics, electronic components, metals, glass, and others. In addition, it provides carbon and graphite products and solutions for various smelting applications; and friction materials, including sintered metal friction, paper friction, carbonaceous friction, sliding, resin, woven, and soft mold materials to regulate power transmission in industrial and construction machinery, as well as for use in brake and clutch parts of vehicles, such as motorbikes, trucks, buses, and trains. Further, the company offers anode materials for secondary lithium-ion batteries that are used in smartphones and electric cars. The company was formerly known as Tokai Electrode Mfg. Co. Ltd. and changed its name to Tokai Carbon Co., Ltd. in 1975. Tokai Carbon Co., Ltd. was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8636",
        "website": "http://www.tokaicarbon.co.jp",
        "market_cap": "Mid Cap"
    },
    "TKYMY": {
        "short_name": "TOKUYAMA CORP",
        "long_name": "Tokuyama Corporation",
        "summary": "Tokuyama Corporation produces and sells various chemical products in Japan. The company operates in four segments: Chemicals, Specialty Products, Cement, and Life & Amenity. The Chemicals segment offers caustic soda, soda ash, calcium chloride, sodium silicate, vinyl chloride monomer, polyvinyl chloride resin, propylene oxide, isopropyl alcohol, chlorinated solvents, and hydrogen. The Specialty Products segment provides polycrystalline silicon; fumed silica and tetrachlorosilane; aluminum nitride; high-purity chemicals for electronics manufacturing and photoresist developer; and methylene chloride for metal cleaning. The Cement segment offers cement, ready-mixed concrete, and cement-type soil solidifier, as well as engages in the recycling and environment businesses. The Life & Amenity segment provides polyolefin film, plastic window sashes, medical diagnosis systems, dental materials and equipment, ion exchange membranes, pharmaceutical ingredients and intermediates, plastic lens-related materials, and microporous film. The company was formerly known as Tokuyama Soda Co., Ltd. and changed its name to Tokuyama Corporation in April 1994. Tokuyama Corporation was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8618",
        "website": "http://www.tokuyama.co.jp",
        "market_cap": "Small Cap"
    },
    "TO5.F": {
        "short_name": "TOYO INK SC HLDGS CO.LTD.",
        "long_name": "Toyo Ink SC Holdings Co., Ltd.",
        "summary": "Toyo Ink SC Holdings Co., Ltd. engages in colorants and functional materials, polymers and coatings, printing and information, and packaging materials related businesses in Japan, China, and internationally. The company's colorants and functional materials include general purpose pigments, functional and pigment dispersions, plastic colorants, and color filter materials; and polymers and coatings comprise coating materials, adhesives, laminating adhesives, hot-melt adhesives, water-based resins, can and functional hard coatings, medical products, and natural extracts, as well as electronic materials, adhesives tapes and films, and marking films. Its printing and information product include offset, ultraviolet curable, screen printing, and inkjet inks; and packaging materials comprise gravure inks and flexo inks, as well as water-based solvents for gravure packaging. The company also provides printing materials and machinery; prepress systems; gravure cylinders; ink-jet materials; and others. Toyo Ink SC Holdings Co., Ltd. was founded in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8377",
        "website": "http://schd.toyoinkgroup.com",
        "market_cap": "Small Cap"
    },
    "TO7.F": {
        "short_name": "TOYOBO CO.",
        "long_name": "Toyobo Co., Ltd.",
        "summary": "Toyobo Co., Ltd. provides films and functional polymers, industrial materials, and healthcare and textile products worldwide. It offers industrial films, including PET films for liquid crystal display, optical, and other industrial uses; and synthetic paper. The company also provides packaging films, such as PET, polyolefin, and nylon for food packaging, as well as heat-shrink PET films; functional polymers comprising engineering plastics, industrial adhesives, coatings, photo sensitive printing plates, acrylate polymers, and electronic materials; rubber and coat processing; and pharmaceuticals intermediates. In addition, it offers functional fibers consisting of airbag fabrics; polyethylene and PBO fibers; functional filters for automobiles, indoor, and anti-pollution solvent adsorption materials and units; and fiber materials for automobile parts. Further, the company provides bio products, including enzymes for diagnostics, diagnostic systems, and reagents for research; artificial kidney hollow fibers; anti-clotting materials; seawater desalination modules; functional textiles for sports clothing, underwear, and uniforms; synthetic filaments; apparel under the Munsingwear brand; acrylic fibers under the Exlan brand; and acrylate fibers under the eks brand, as well as trades in textile products. Additionally, it operates as a contract manufacturer of injections and raw pharmaceuticals. The company was founded in 1882 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-8230",
        "website": "http://www.toyobo-global.com",
        "market_cap": "Small Cap"
    },
    "UBE.F": {
        "short_name": "UBE IND. LTD",
        "long_name": "Ube Industries, Ltd.",
        "summary": "Ube Industries, Ltd., together with its subsidiaries, engages in the chemicals, construction materials, and machinery businesses in Japan, Asia, Europe, and internationally. The company operates through four segments: Chemicals, Construction Materials, Machinery, and Others. It offers synthetic rubber, engineering plastics, caprolactam, industrial chemicals, liquefied gas, polyethylene, ammonium sulfate, polyimide, battery materials, telecommunication parts, separation membranes, fine chemicals, ceramics, phosphor products, high purity chemicals, polyurethane and related materials, aerospace materials, inorganic fiber, and high temperature paints. The company also provides contract manufacturing services for APIs and intermediates; aromatic SF5 compounds; FLUOLEAD, a novel nucleophilic fluorinating agent; and drug discovery and pipeline services. In addition, it offers cement products, such as ordinary and specialized cement; and building materials, including interior and exterior materials, waterproofing materials, floor underlayment materials, plastering materials, and foundation materials, as well as sells imported coal. Further, the company is involved in the wholesale power. Additionally, it provides die-casting and injection molding machines, and extrusion presses, UBE vertical mills, kilins, furnaces, dryers, water screening equipment, storage and transportation systems, and bridges and steel structures. The company also manufactures and sells nylon, ready-mixed concrete, ammonia and industrial gases, plastic films, polypropylene molded products, fibers, fiber-reinforced plastics, magnesia clinker, quicklime, slaked lime, concrete piles, and cast iron and rolled steel billets; and offers domestic shipping, harbor transportation, shipping-agency, and customs clearing services. Ube Industries, Ltd. was founded in 1897 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8449",
        "website": "http://www.ube-ind.co.jp",
        "market_cap": "Small Cap"
    },
    "UBEOY": {
        "short_name": "UBE INDUSTRIES",
        "long_name": "Ube Industries, Ltd.",
        "summary": "Ube Industries, Ltd., together with its subsidiaries, engages in the chemicals, construction materials, and machinery businesses in Japan, Asia, Europe, and internationally. The company operates through four segments: Chemicals, Construction Materials, Machinery, and Others. It offers synthetic rubber, engineering plastics, caprolactam, industrial chemicals, liquefied gas, polyethylene, ammonium sulfate, polyimide, battery materials, telecommunication parts, separation membranes, fine chemicals, ceramics, phosphor products, high purity chemicals, polyurethane and related materials, aerospace materials, inorganic fiber, and high temperature paints. The company also provides contract manufacturing services for APIs and intermediates; aromatic SF5 compounds; FLUOLEAD, a novel nucleophilic fluorinating agent; and drug discovery and pipeline services. In addition, it offers cement products, such as ordinary and specialized cement; and building materials, including interior and exterior materials, waterproofing materials, floor underlayment materials, plastering materials, and foundation materials, as well as sells imported coal. Further, the company is involved in the wholesale power. Additionally, it provides die-casting and injection molding machines, and extrusion presses, UBE vertical mills, kilins, furnaces, dryers, water screening equipment, storage and transportation systems, and bridges and steel structures. The company also manufactures and sells nylon, ready-mixed concrete, ammonia and industrial gases, plastic films, polypropylene molded products, fibers, fiber-reinforced plastics, magnesia clinker, quicklime, slaked lime, concrete piles, and cast iron and rolled steel billets; and offers domestic shipping, harbor transportation, shipping-agency, and customs clearing services. Ube Industries, Ltd. was founded in 1897 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8449",
        "website": "http://www.ube-ind.co.jp",
        "market_cap": "Mid Cap"
    },
    "UTN.F": {
        "short_name": "UNITIKA LTD",
        "long_name": "Unitika Ltd.",
        "summary": "Unitika Ltd. manufactures and sells polymers, advanced materials, and fibers and textiles in Japan and internationally. The company offers polymers, including nylon and polyester films; nylon, polyester, and polyarylate plastic products; polyester, nylon spunbonded, and cotton spunlace nonwoven products; and biodegradable plastic materials. It also provides advanced materials comprising activated carbon fibers, glass fabrics, glass beads, and porous plates, as well as industrial and biomass-based materials. In addition, the company offers fibers and textiles, such as garments, lifestyle materials, and bedding products. Unitika Ltd. was founded in 1889 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8566",
        "website": "http://www.unitika.co.jp",
        "market_cap": "Small Cap"
    },
    "XSI.F": {
        "short_name": "SANYO CHEMICAL IND.",
        "long_name": "Sanyo Chemical Industries Ltd.",
        "summary": "Sanyo Chemical Industries Ltd. manufactures and sells chemical products in Japan. The company offers superabsorbent polymers; industrial agents for pulp and paper, paints, latex, ceramics, and electronics; raw materials for polyurethane foams and polyethylene glycols; super base compounds, urethane catalysts, curing accelerators for epoxy resins, photo-acid generators, watersoluble rust inhibitors, etc.; ethylidene norbornen; textile chemicals, surfactants, papermaking chemicals, paint and ink resins, etc.; and thermoplastic polyurethane beads for slush molding. It is also involved in warehousing, insurance, and real estate businesses. The company was formerly known as Sanyo Chemical Industry Co. and changed its name to Sanyo Chemical Industries Ltd. in 1966. Sanyo Chemical Industries Ltd. was founded in 1949 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Specialty Chemicals",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "605-0995",
        "website": "http://www.sanyo-chemical.co.jp",
        "market_cap": "Small Cap"
    }
}