{
    "5406.T": {
        "short_name": "KOBE STEEL",
        "long_name": "Kobe Steel, Ltd.",
        "summary": "Kobe Steel, Ltd. engages in the materials, machinery, and electric power businesses in Japan, North and South Americas, Europe, the Middle East, rest of Asia, and Oceania. The company offers steel sheet products, including high-tensile strength, hot rolled, cold rolled, electro-galvanized, and hot-dipped galvanized steel sheets; steel wire rods and bars; and aluminum and steel plates. It also provides steel casting and forging products, such as crankshafts, marine parts, chemical processing equipment, and rolls, as well as materials for plastic molding; and titanium products, copper sheets and strips, and steel powders. In addition, the company offers robots and electric power sources, and welding materials; and machinery products, such as standard compressors, tire and rubber machinery products, rotating machinery products, plastic processing machinery products, advanced technology equipment, rolling mill products, and ultra high pressure equipment, as well as LNG vaporizers, pressure vessels, brazed aluminum heat exchangers, and micro channel heat exchanger and reactors. Further, it provides signaling, communication, power supply, automatic fare collection, and platform screen door systems; hydraulic and mini hydraulic excavators, mini wheel loaders, and road machinery; construction, metal, forestry, and industrial waste recycling machinery; and crawler and wheel cranes. Additionally, the company generates and supplies electric power; offers material and structural analysis, testing, physical analysis, and other services; manufactures and sells target materials and test equipment; sells and rents detached homes; and provides brokerage, renovation, insurance, and other services, as well as operational management services of public facilities. It also offers services in the field of iron units; and water treatment, waste incineration, PCB detoxification, and soil remediation services. The company was founded in 1905 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-8585",
        "website": "http://www.kobelco.co.jp",
        "market_cap": "Mid Cap"
    },
    "5408.T": {
        "short_name": "NAKAYAMA STEEL WORKS",
        "long_name": "Nakayama Steel Works, Ltd.",
        "summary": "Nakayama Steel Works, Ltd. engages in the steel, engineering, and real estate businesses in Japan. It offers steel coil products, including hot, pickling, plating, slit, and striped /pattern coils; and steel sheet products, such as thick steel and NP steel plates, leveler sheets, and checkered steel and pattern steel plates, as well as hot rolled steel products. The company also provides bars and wire rod products comprising steel bars, burn-in- coils, and wire rods, as well as lightweight C-shaped steel products, steel pipes, steel sheets, secondary products, and by-products. In addition, it offers steel reefs to marine businesses; casting machine engineering products, including rolls, valves, and casting and processing equipment; and plans, designs, and constructs factories, warehouses, offices, etc. Further, the company engages in processing and selling of construction related products; selling of building materials; selling, brokerage, and rental of real estate properties; and port transportation and freight vehicle transportation services. Additionally, it provides general shipping and shipping brokerage services; and environmental services. The company was founded in 1923 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "551-8551",
        "website": "http://www.nakayama-steel.co.jp",
        "market_cap": "Small Cap"
    },
    "5410.T": {
        "short_name": "GODO STEEL LTD",
        "long_name": "Godo Steel, Ltd.",
        "summary": "Godo Steel, Ltd. manufactures and sells steel products in Japan and internationally. The company offers wire rods for tire chains, stapler needles, and fencing applications; H-beams and channels that are used in construction, civil engineering, and other sectors; structural bars, which are used as materials for making parts of construction and industrial machinery, ships, and other equipment; and rails. It also provides deformed bars that are used as construction and civil engineering materials; EG joints and anchor plates; and billets. In addition, the company offers reinforcing bars, wire products, firebricks, and ballasts; trucking services; and industrial waste disposal services, as well as sells steel products, machinery, and raw materials for steel making. Further, it designs, manufactures, and sells industrial machinery and equipment; provides design and contract services for civil engineering and construction works; and purchases, sells, manages, and leases real estate properties. The company was founded in 1937 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0004",
        "website": "http://www.godo-steel.co.jp",
        "market_cap": "Small Cap"
    },
    "5411.T": {
        "short_name": "JFE HOLDINGS INC",
        "long_name": "JFE Holdings, Inc.",
        "summary": "JFE Holdings, Inc., through its subsidiaries, engages in steel, engineering, and trading businesses in Japan and internationally. The company's Steel segment produces and sells various steel products, processed steel products, and raw materials, as well as operates in the transportation, facility maintenance, and construction businesses. Its Engineering segment engages in the construction of energy, urban environment, steel structures and industrial machinery, recycling, and electricity retailing projects. The company's Trading segment purchases, processes, and sells steel products, raw materials for steel production, nonferrous metal products, food, etc. JFE Holdings, Inc. was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.jfe-holdings.co.jp",
        "market_cap": "Mid Cap"
    },
    "5440.T": {
        "short_name": "KYOEI STEEL LTD",
        "long_name": "Kyoei Steel Ltd.",
        "summary": "Kyoei Steel Ltd. engages in the manufacture, processing, and sale of billets and steel products. The company operates through Domestic Steel Business, Overseas Steel Business, and Material Recycling Business segments. It is also involved in the collection, transportation, and treatment of general, industrial, and medical waste; recycling of automobiles and industrial waste; processing, construction, and assembly of rebars and threaded rebars; designing of steel production plants; and sale of steelmaking technology, as well as planning, import, and sale of castings. In addition, the company manufactures and sells recycled crushed ballast, construction materials, steel products and raw/secondary materials, concrete reinforcing bars, threaded rebars, flat bars, I-beams, equal angle bars, and structural round bars. Further, it engages in the contracting business for in-plant loading, unloading, collection, and transportation; automobile transportation and insurance agency business; collection, processing, and sales of iron, aluminum, and nonferrous metal scraps; and construction and operation of multi-purposed seaport, as well as fuel gas production. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0004",
        "website": "http://www.kyoeisteel.co.jp",
        "market_cap": "Small Cap"
    },
    "5444.T": {
        "short_name": "YAMATO KOGYO CO",
        "long_name": "Yamato Kogyo Co., Ltd.",
        "summary": "Yamato Kogyo Co., Ltd., through its subsidiaries, manufactures and sells steel products in Japan, the United States, South Korea, Thailand, the Kingdom of Bahrain, the Kingdom of Saudi Arabia, Vietnam, and internationally. The company offers steel products and heavy-duty processing goods, railway track accessories, reinforcing bars, steel billets, and structural steel products. It is also involved in the transportation; medical waste treatment; and real estate leasing activities, as well as industrial waste refining; and material handling at ports. It also manufactures counterweights and storage tanks. The company was founded in 1944 and is headquartered in Himeji, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "671-1192",
        "website": "http://www.yamatokogyo.co.jp",
        "market_cap": "Mid Cap"
    },
    "5445.T": {
        "short_name": "TOKYO TEKKO CO LTD",
        "long_name": "Tokyo Tekko Co., Ltd.",
        "summary": "Tokyo Tekko Co., Ltd. manufactures and sells steel products for the construction industry in Japan and internationally. The company offers high-tensile threaded rebar and joint products that support the construction of high-rise buildings; and High-tensile deformed rebars. Its products include steel bar for concrete reinforcement; threaded rebar joints; mechanical anchorage for threaded rebar and shear reinforcement; mortar-grouted joints; mechanical joints; and rebar processing products. The company was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0071",
        "website": "http://www.tokyotekko.co.jp",
        "market_cap": "Small Cap"
    },
    "5446.T": {
        "short_name": "HOKUETSU METAL CO",
        "long_name": "HOKUETSU METAL Co., Ltd.",
        "summary": "HOKUETSU METAL Co., Ltd. manufactures, processes, and sells iron and steel products in Japan. It offers steel bars for reinforced concrete; rolled steel materials for general structures; rolled steel bars for building structures; and mild steel wires rod and burn-in coils, as well as shaped steel products, such as general and building structural shaped steel, and deformed steel. The company also provides construction/civil engineering materials, including UN, self-drilling, and steel pipe expansion type bolts; UHY hoops and U-CON rings; mechanical fixing hardware; mesh; reinforcing bar assembly processed; fab deck; structural anchor bolts; turnbuckles; TH pieces; and automobile tire chains, as well as bolt metal fittings for various construction and civil engineering. In addition, the company is involved in the manufacture, processing, and sale of machinery and equipment; and collecting, transporting, processing, and selling of general industrial wastes and recycling products, as well as warehousing, and cargo transportation and retrieval businesses. HOKUETSU METAL Co., Ltd. was incorporated in 1942 and is headquartered in Nagaoka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagaoka",
        "zipcode": "940-0028",
        "website": "http://www.hokume.co.jp",
        "market_cap": "Small Cap"
    },
    "5449.T": {
        "short_name": "OSAKA STEEL CO LTD",
        "long_name": "Osaka Steel Co., Ltd.",
        "summary": "Osaka Steel Co., Ltd. produces and sells steel products for the construction, industrial, and civil engineering applications in Japan. It offers equal and unequal angles, channels, I-beams, round and deformed bars, mechanical joints for reinforcing bars, rails, elevator guide rails, colored angles and channels, deformed and round joints, flat and square bars, billets, and other semi-finished steel products. The company was founded in 1978 and is headquartered in Osaka, Japan. Osaka Steel Co., Ltd. is a subsidiary of Nippon Steel Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0045",
        "website": "http://www.osaka-seitetu.co.jp",
        "market_cap": "Small Cap"
    },
    "5451.T": {
        "short_name": "YODOGAWA STEEL WORKS",
        "long_name": "Yodogawa Steel Works, Ltd.",
        "summary": "Yodogawa Steel Works, Ltd. manufactures and sells steel products for industrial and consumer products in Japan. The company offers steel sheets products comprising pre-painted and galvanized steel sheets, chromate-free treated steel sheets, cold rolled steel strips, special steel strips, steel strapping, and cold rolled steel sheets, as well as plated steel sheets, colored plated and printed steel sheets, and other types of steel sheets. It also provides exterior products for storage sheds, garages, carports, bicycle parks, warehouses, lodges, and trash bins; and building materials comprising roofing and siding, and environmental products. In addition, the company offers rolls for section steel, including plate and hot strip mill work rolls; paper manufacturing rolls; drilled rolls for rubber and vinyl; calender equipment for paper making; and cast iron rollers and other types of rollers. Further, it provides high-function grating products, as well as other gratings products, including pit and U-shaped covers. Additionally, the company is involved in the design and contracting of construction work; warehousing, packaging, and shipping activities; and sale, purchase, and lease of real estate, as well as building of facilities and landscaping activities. Yodogawa Steel Works, Ltd. was founded in 1935 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0054",
        "website": "http://www.yodoko.co.jp",
        "market_cap": "Small Cap"
    },
    "5458.T": {
        "short_name": "TAKASAGO TEKKO KK",
        "long_name": "Takasago Tekko K.K.",
        "summary": "Takasago Tekko K.K. manufactures and sells various products developed primarily from stainless steel in Japan. The company offers cold rolled steel products, including cold rolled steel and cold rolled special steel strips; and electromagnetic plates and sheets, such as soft magnetic iron plates and 1% silicon iron sheets. It also provides embossed stainless steel products comprising runner stainless, ordinary embossed stainless steel, and coated stainless steel products, as well as SUBERANNAR products; and processed stainless steel products that include stainless steel hard plates, high precision pipes, and molded stainless steel products. The company was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "175-0081",
        "website": "http://www.takasago-t.co.jp",
        "market_cap": "Small Cap"
    },
    "5463.T": {
        "short_name": "MARUICHI STEEL TUBE",
        "long_name": "Maruichi Steel Tube Ltd.",
        "summary": "Maruichi Steel Tube Ltd. produces and sells steel tubes and steel sheet coating in Japan, North America, and Asia. It offers water pipes, OCTGs, and electrical conduits for use in construction projects and power generation plants; mechanical tubes; lamp posts, road signs, traffic lights, security barriers, and other fabricated products; and welded steel tubes for machine structure, construction and piping, hot dip galvanized steel sheet, pre-painted steel sheet, etc. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0076",
        "website": "http://www.maruichikokan.co.jp",
        "market_cap": "Small Cap"
    },
    "5464.T": {
        "short_name": "MORY INDUSTRIES",
        "long_name": "Mory Industries Inc.",
        "summary": "Mory Industries Inc. manufactures and sells stainless steel and welded carbon steel products in Japan. It offers round stainless steel pipes and tubes; square and modified stainless steel tubes; stainless-steel-clad tubes; stainless steel joint parts, etc.; stainless steel flat bars, angle bars, and round bars; flexible stainless steel tubes; stainless steel household products; and various products from stainless steel tubes. The company also provides welded carbon steel tubes for machine and general structural purposes, and welded carbon steel square pipes for general structural purposes; and tube cutting machines and others. Its products are used in construction materials, hardware, furniture, and automotive parts. The company was founded in 1929 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0076",
        "website": "http://www.mory.co.jp",
        "market_cap": "Small Cap"
    },
    "5471.T": {
        "short_name": "DAIDO STEEL CO",
        "long_name": "Daido Steel Co., Ltd.",
        "summary": "Daido Steel Co., Ltd. manufactures and sells steel products in Japan, rest of Asia, North America, and internationally. The company's Specialty Steel segment manufactures specialty steel for automotive parts, industrial machinery parts, electrical machinery parts, construction, tool steel, etc. Its High Performance Materials and Magnetic Materials segment offers stainless steel products, nickel-based alloys, electrical and electronics parts, magnetic material products, alloy powders, titanium products, and welding wires. The company's Parts For Automobile and Industrial Equipment segment provides die forgings, precise hot forgings, and welded parts, including automotive parts and bearing races; open die forgings, such as parts for boats and ships, industrial machines, heavy electric machines, steel making equipment, chemical equipment, oil drilling rigs, and spacecraft and aircraft; and castings that comprise manganese railway rails, components for automobiles, industrial machines, electric machines and furnaces, cast steel products, etc. This segment also offers precision castings, which include automotive, industrial machines, electric machines, telecommunications equipment, etc.; and engine valves, compressors, hydraulic equipment, and machine tool parts. Its Engineering segment provides steel making equipment; industrial furnaces and facilities; environmental equipment for drainage, exhaust, waste disposal, and treatment facilities; machine tools; and machine maintenance services. The company's Trading and Service segment engages in the provision of welfare services; real estate and insurance business; and golf course management, analysis, and outside software sales businesses. Daido Steel Co., Ltd. was founded in 1916 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "461-8581",
        "website": "http://www.daido.co.jp",
        "market_cap": "Mid Cap"
    },
    "5476.T": {
        "short_name": "NIPPON KOSHUHA STEEL CO",
        "long_name": "Nippon Koshuha Steel Co.,Ltd.",
        "summary": "Nippon Koshuha Steel Co.,Ltd. manufactures and sells special steels and super alloys in Japan. The company offers tool steel products, such as cold and hot work, high speed, and plastic mold steel products; and super alloy steel for various general applications, including heat resistant, corrosion resisting, electric heating, low thermal expansion, sealing, high tension, constant elasticity, welding, and electromagnetic materials. It also provides stainless steel comprising martensitic, ferritic, austenitic, two phase, and precipitation hardening products; and precise cold forging steel products; and information processing and communication systems, as well as develops, sells, and leases related software products. In addition, Nippon Koshuha Steel Co.,Ltd. is involved in the sale, leasing, and brokerage of real estate. The company was founded in 1936 and is headquartered in Tokyo, Japan. Nippon Koshuha Steel Co.,Ltd. is a subsidiary of Kobe Steel, Ltd.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0032",
        "website": "http://www.koshuha.co.jp",
        "market_cap": "Small Cap"
    },
    "5480.T": {
        "short_name": "NIPPON YAKIN KOGYO CO",
        "long_name": "Nippon Yakin Kogyo Co., Ltd.",
        "summary": "Nippon Yakin Kogyo Co., Ltd. manufactures and sells stainless steel products in Japan and internationally. The company offers corrosion resistant alloys, heat resistant alloys, high strength stainless steels, controlled expansion alloys, soft magnetic alloys, non-magnetic alloys, corrosion resistant pure nickel, and neutron absorbing stainless steel, as well as stainless steel floor plates. Its products have applications in precision electronics, green technologies, marine structures, automotive, precision astronomical instruments, manufacturing and processing plants, and high temperature environments, as well as in the energy and food industry. The company was formerly known as Nippon Kako Co., Ltd. and changed its name to Nippon Yakin Kogyo Co., Ltd. in 1942. Nippon Yakin Kogyo Co., Ltd. was founded in 1925 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8365",
        "website": "http://www.nyk.co.jp",
        "market_cap": "Small Cap"
    },
    "5481.T": {
        "short_name": "SANYO SPECIAL STEEL CO LTD",
        "long_name": "Sanyo Special Steel Co., Ltd.",
        "summary": "Sanyo Special Steel Co., Ltd., together with its subsidiaries, manufactures and sells special steel products in Japan and internationally. The company operates through Specialty Steel, Metal Powder, Formed and Fabricated Materials, and Others segments. The Specialty Steel segment provides various special steel products, including bearing, engineering, stainless, heat resistant, and tool steel products. The Metal Powder segment manufactures and sells metal powders and powder metallurgy products. The Formed and Fabricated Materials segment offers cut rings, die-forged/rolled, forged rings, and cold-rolled ring products made from special steel bars and tubes. The Other segment provides information processing services. The company also engages in the trading of special steel products, steelmaking raw materials, and other materials; and the provision of security and facilities maintenance services, and machinery maintenance services. Its steel products are used in a range of automobiles, railroads, construction machines, electronics products, and information communication devices. The company was formerly known as Sanyo Steel Works and changed its name to Sanyo Special Steel Co., Ltd. in 1959. The company was founded in 1933 and is headquartered in Himeji, Japan. Sanyo Special Steel Co., Ltd. is a subsidiary of Nippon Steel Corporation.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "672-8677",
        "website": "http://www.sanyo-steel.co.jp",
        "market_cap": "Small Cap"
    },
    "5482.T": {
        "short_name": "AICHI STEEL CORP",
        "long_name": "Aichi Steel Corporation",
        "summary": "Aichi Steel Corporation manufactures and sells steel, forged products, and electro-magnetic products in Japan and internationally. The company offers specialty steel, including carbon, alloy, H-shaped, micro alloyed, boron, spring, and high carbon chrome bearing steel, as well as alloy steel bolting materials; and stainless steel products, such as angle and unequal angle bars, channel bars, compression bars, round bars, flat and square bars, H-beams and T-bars, and custom welded shaped steel products, as well as stainless steel products for high-pressure hydrogen, blades, building structures, and water sluices. It also provides titanium round, angle, and flat bars; engine components, steering/chassis components, transmission components, drive components, hot extruded products, and hot/cold composite forgings; cold and hot work tool steel products; electromagnetic components comprising MI sensors, Nd-Fe-B resin bonded magnets, dental magnetic attachments, and electronic materials and components; amorphous wire; and TetsuRiki agri/aqua, which are iron ions used for plants. In addition, the company is involved in the production and sale of flame retardant materials; design and installation of industrial furnaces; mining, processing, and sale of limestone and other minerals; cargo transportation, handling, and storage activities; development of software; and sale and maintenance of computers and accessories devices. Further, it engages in the sale of daily commodities, as well as provision of restaurant services, lunch catering services, travel agency services, gardening services, etc.; design, development, manufacture, and sales of forging dies; and manufacture and sales of crude specialty steel. Aichi Steel Corporation was founded in 1940 and is headquartered in Tokai, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokai",
        "zipcode": "476-8666",
        "website": "http://www.aichi-steel.co.jp",
        "market_cap": "Small Cap"
    },
    "5484.T": {
        "short_name": "TOHOKU STEEL CO",
        "long_name": "Tohoku Steel Co., Ltd.",
        "summary": "Tohoku Steel Co., Ltd. manufactures, processes, and distributes various types of special steel products in Japan. It offers heat resistant and stainless steel materials, magnetic materials, and low thermal expansion alloys; special alloys, including ferrous and nonferrous alloys; precision processed products, such as cold-/warm-forged NNS and machined products, machined products, and processed composite products; heat treatment products; and automatic coercive force meters. The company was incorporated in 1937 and is based in Shibata, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shibata",
        "zipcode": "989-1393",
        "website": "http://www.tohokusteel.com",
        "market_cap": "Small Cap"
    },
    "5486.T": {
        "short_name": "HITACHI METALS",
        "long_name": "Hitachi Metals, Ltd.",
        "summary": "Hitachi Metals, Ltd. manufacture and sell specialty steel products, functional components and equipment, magnetic materials and applications/power electronics materials, wires and cables, and related products in Japan and internationally. The company's Specialty Steel Products segment offers molds and tool steels, rolls for steel mills, injection molding machine parts, structural ceramic products, and steel-frame joints for construction; automobile-related materials, razor and blade materials, precision cast components, and aircraft- and energy-related materials; and display-related materials, semiconductor and other package materials, and battery-related materials. Its Functional Components and Equipment segment provides high-grade ductile cast iron products and cast iron products for transportation equipment; and piping and infrastructure components. The company's Magnetic Materials and Applications/Power Electronics Materials segment offers rare-earth magnets, ferrite magnets, and other magnets and applied products; and amorphous metals, nanocrystalline magnetic materials, soft ferrite, and applied products, as well as ceramic components. Its Wires, Cables, and Related Products segment provides industrial cables, electronic wires, electric equipment materials, cable assemblies, and industrial rubber products; and automotive electronic components and brake hoses. The company was founded in 1910 and is headquartered in Tokyo, Japan. Hitachi Metals, Ltd. is a subsidiary of Hitachi, Ltd.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8224",
        "website": "http://www.hitachi-metals.co.jp",
        "market_cap": "Mid Cap"
    },
    "5491.T": {
        "short_name": "NIPPON KINZOKU CO",
        "long_name": "Nippon Kinzoku Co., Ltd.",
        "summary": "Nippon Kinzoku Co., Ltd. manufactures and sells stainless steel precision rolling/processing products in Japan and internationally. The company offers steel foils, such as cold-rolled stainless and special steel strips; processed products, including precision profile rolled steel products, precision pipes, and stainless steel sections/roll forming products; grain and non-grain oriented electrical steel foils, wound iron cores/reactors, etc.; and magnesium alloy foils, as well as foil silicon steel products. Nippon Kinzoku Co., Ltd. was founded in 1930 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0014",
        "website": "http://www.nipponkinzoku.co.jp",
        "market_cap": "Small Cap"
    },
    "5542.T": {
        "short_name": "SHINHOKOKU STEEL CORP",
        "long_name": "Shinhokoku Steel Corporation",
        "summary": "Shinhokoku Steel Corporation develops, manufactures, and sells special steel products in Japan. It offers low thermal expansion alloys for semiconductor and FPD parts for manufacturing equipment; durable steel and heat resistance steel for steel works; and low thermal expansion alloy precision polishing plates for various wafers. The company also provides various alloys, such as rolling materials, drawing materials, welding rods; piercing plugs for seamless steel pipes; and nonferrous alloys, including Ti lapping and Sn alloys for lapping plates. Shinhokoku Steel Corporation was founded in 1939 and is headquartered in Kawagoe, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawagoe",
        "zipcode": null,
        "website": "http://www.shst.co.jp",
        "market_cap": "Small Cap"
    },
    "5563.T": {
        "short_name": "NIPPON DENKO CO LTD",
        "long_name": "Nippon Denko Co., Ltd.",
        "summary": "Nippon Denko Co., Ltd., together with its subsidiaries, manufactures and sells ferroalloys, functional materials, and environmental recycling systems in Japan. Its ferroalloys include high-carbon ferromanganese, medium-and low-carbon ferromanganese, ferrosilicomanganese, ferrosilicon, high-carbon ferrochromium, ferrovanadium, and ferroniobium. The company also offers functional materials, such as ferro boron, metal hydride alloys, cathode materials, zirconium oxides, manganese inorganic chemical products, boron oxide, boric acid, and electrolytic metal manganese. In addition, it provides environmental recycling systems, including chromic acid recovery systems for the production of industrial chemicals; boron recovery systems to absorb and eliminate the boron contained in wastewater; nickel recovery systems to recover nickel from nickel-containing drainage; AQUA PACK, a cartridge demineralizer; and MR-PACK, an integral pure water production unit. Further, the company produces and sells fertilizers; industrial chemicals, synthetic resins, special metals, packaging materials, high-pressure gases, abrasives, and pollution control equipment; polyethylene pipes, bags, nets, sheets, and PVC pipes; and roadbed building materials and solar panel installation materials, as well as generates renewable energy power. Additionally, it engages in transportation, warehousing, and sale of materials for steelmaking; recycling of general and industrial waste by melting; collection and haulage of industrial waste; provision of ship agency services; and sale of fuels. Nippon Denko Co., Ltd. was founded in 1925 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8282",
        "website": "http://www.nippondenko.co.jp",
        "market_cap": "Small Cap"
    },
    "5602.T": {
        "short_name": "KURIMOTO LTD",
        "long_name": "Kurimoto, Ltd.",
        "summary": "Kurimoto, Ltd. manufactures and sells ductile iron pipes, valves, and construction materials in Japan and internationally. The company offers ductile iron pipes related products and disaster prevention products; resilient seated gate, butterfly, emergency shutting-off, water level control and pressure regulating auto, orifice, float type, air, reversing, spherical, sleeve, slide gate, hot blast, link seal, goggle, and blow off valves; and sewerage, agricultural water, and well pipes. It also provides pit cover plates, brake discs, and power cable protection pipes, as well as automotive related manufacturing equipment; electricity, gas, petroleum, coal, and energy products comprising industrial valves, sound proof and noise reduction products, secondary battery related manufacturing equipment, plant engineering, crushers, pulverizers/mills, classifiers, dryers, calciners/kilns, heat/abrasion-resistant casting products, and fiber reinforced plastic products; mixers, kneaders, reactors, granulators, dryers, solvent recovery, deodoridising, and flue gas treatment equipment; forging and other presses, peripheral devices, and bending rolls; and high function casting products. In addition, the company offers separating and conveying products; dredge pumps; sanitary and air conditioning equipment, civil engineering material products, and construction materials; winding core pipes; fiber reinforced plastics; and pharmaceutical equipment. Further, it provides railroad car brake components, crushers, pulverizers, conveyors, wear/heat-resistant castings for industrial equipment, wear-resistant pumps, and classifiers; fiberglass-reinforced plastic mortar (FRPM) pipes, fiberglass-reinforced plastic (FRP) pipes, FRPM panels, FRP pultrusion products, various synthetic resin molded products FRP core; and FRP parts for machinery, equipment, and vehicles. The company was founded in 1909 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-8580",
        "website": "http://www.kurimoto.co.jp",
        "market_cap": "Small Cap"
    },
    "5609.T": {
        "short_name": "NIPPON CHUZO KK",
        "long_name": "Nippon Chuzo K. K.",
        "summary": "Nippon Chuzo K. K. engages in industrial castings, engineering, and construction materials business in Japan. The company provides large casting, special casting, cast iron compounds, and casting technology products, as well as formed and fabricated materials for casting machinery. It also offers low thermal expansion LEX, construction machinery, energy systems, waste incinerations, industrial presses, iron production, mighty bars, hydraulic components, gears, metal molds, stainless steel components, steel and rubber bearings, damper units, cable bands, saddles, construction hardware and landscaping products, and construction material sections. In addition, the company offers NC base plate products and structures. Further, the company designs and manufactures bridge bearings and expansion joints, and joining brackets for construction applications, as well as supplies fixed pedestal materials. Nippon Chuzo K. K. was founded in 1920 and is headquartered in Kawasaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-9567",
        "website": "http://www.nipponchuzo.co.jp",
        "market_cap": "Small Cap"
    },
    "5632.T": {
        "short_name": "MITSUBISHI STEEL MFG CO",
        "long_name": "Mitsubishi Steel Mfg. Co., Ltd.",
        "summary": "Mitsubishi Steel Mfg. Co., Ltd. manufactures and sells steel products, construction machinery parts, automotive parts, and machinery and equipment. Its steel products include hot-rolled special steel bars for construction machinery parts and automotive parts; special steel bars for industrial machinery; non-heat treated steel products; coil, heavy-duty coil, leaf, coiled wave, flat, super alloy, and wire springs; stabilizer bars; insert molded parts; high-precision assemblies; press and multi-forming machines; precision and wear-resistant castings; special steel forgings; special materials and machined products. The company also offers forging presses, forging manipulators, ring rolling mills, cold forging presses, magnetic separators, link conveyors, buckets, vibration isolators, scaling systems, other industrial machineries, outer casings for gas turbines, pressure vessels, and steel working products. In addition, it offers research and development services; and sells automotive parts, construction machinery parts, wear resistant teeth for shellfish harvesting, and wood processor tire chains. Mitsubishi Steel Mfg. Co., Ltd. was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8550",
        "website": "http://www.mitsubishisteel.co.jp",
        "market_cap": "Small Cap"
    },
    "5660.T": {
        "short_name": "KOBELCO WIRE CO LTD",
        "long_name": "Kobelco Wire Company,Ltd.",
        "summary": "Shinko Wire Company, Ltd. manufactures and sells a range of wire rod products. The company offers PC steel products that are used in bridges, buildings, and other constructions; steel wires that support a range of products, such as automotive products and office automation equipment; and wire ropes that support various industries, including industrial machinery, national land development projects, construction, fishery, and forestry. It also provides stainless steel, titanium, titanium alloy, and special alloy steel wires for the housing, automotive, machine tools, telecommunications, medical, and household products industries; and engineering services for bridges and buildings. The company was incorporated in 1954 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Amagasaki",
        "zipcode": "660-0091",
        "website": "http://www.shinko-wire.co.jp",
        "market_cap": "Small Cap"
    },
    "5697.T": {
        "short_name": "SANYU CO LTD",
        "long_name": "Sanyu Co., Ltd.",
        "summary": "Sanyu Co., Ltd. produces and sells steel products in Japan. It offers polished steel bars and cold-forging steel wires for the use in, electrical automobiles, bicycles, industrial equipment products, printing equipment, spinning machinery, automatic equipment, hydraulic pneumatic equipment, and construction machinery parts, as well as press molds, hydraulics, turbine and rotary shafts, motors, sewing machine parts, furniture, bolts, nuts, rivets, screws, and tapping. Sanyu Co., Ltd. was incorporated in 1957 and is headquartered in Hirakata, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hirakata",
        "zipcode": "573-0137",
        "website": "http://www.sanyu-cfs.co.jp",
        "market_cap": "Small Cap"
    },
    "5921.T": {
        "short_name": "KAWAGISHI BRIDGE WORKS CO LTD",
        "long_name": "Kawagishi Bridge Works Co., Ltd.",
        "summary": "Kawagishi Bridge Works Co., Ltd. engages in the production and construction of steel frames in Japan. The company also manufactures and sells precast concrete products. Its products are used in the construction of high-rise buildings and large space structures. The company was founded in 1922 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.kawagishi.co.jp",
        "market_cap": "Small Cap"
    },
    "5973.T": {
        "short_name": "TOAMI CORP",
        "long_name": "Toami Corporation",
        "summary": "Toami Corporation manufactures and sells welded wire mesh products under the TOAMI brand name in Japan. The company offers special welded wire mesh products, reinforcing bar processed products, mesh fences, etc., as well as C-panel wall and C-panel construction products. Its products are primarily used in architectural houses, civil engineering, building earthquake resistance, beast damage measures, and others. The company was founded in 1887 and is headquartered in Shijonawate, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shijonawate",
        "zipcode": "575-0054",
        "website": "http://www.toami.co.jp",
        "market_cap": "Small Cap"
    },
    "5976.T": {
        "short_name": "NETUREN CO LTD",
        "long_name": "Neturen Co., Ltd.",
        "summary": "Neturen Co., Ltd., together with its subsidiaries, manufactures and sells specialty steel and wire products in Japan and internationally. The company offers prestressing steel bars, PC bar spring steel wires and machining equipment, and pre-hardened wires; and induction heating equipment and high-frequency power supplies, as well as induction heat treatment services for mechanical parts. It also leases movables and immovable properties. In addition, the company engages in the development of technical products business. Neturen Co., Ltd. was incorporated in 1940 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8639",
        "website": "http://www.k-neturen.co.jp",
        "market_cap": "Small Cap"
    },
    "5986.T": {
        "short_name": "MOLITEC STEEL CO",
        "long_name": "Molitec Steel Co., Ltd.",
        "summary": "Molitec Steel Co., Ltd. processes and sells steel strips primarily in Japan. It offers press worked products, including automotive parts, household electrical appliances, agricultural machine parts, dies fabrication products, integrated drive plates, power springs, combine augers, and oil level gauges. The company also provides heat-treated products, such as hardened and tempered carbon steel strips and sheets; and metal materials comprising cold and hot rolled steel strips and sheets, spring and cold-rolled stainless steel strips, cold-rolled carbon steel strips and sheets, hot rolled mild steel sheets and strips, electrolytic zinc-coated steel sheets, and color coated steel sheets. In addition, it manufactures and sells various machinery tools, steel parts, and plastic products and parts, as well as imports and exports various merchandise. The company was formerly known as Mori&Co. and changed its name to Molitec Steel Co., Ltd. in January 1990. Molitec Steel Co., Ltd. was founded in 1943 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0012",
        "website": "http://www.molitec.co.jp",
        "market_cap": "Small Cap"
    },
    "7305.T": {
        "short_name": "ARAYA INDUSTRIAL CO",
        "long_name": "Araya Industrial Co., Ltd.",
        "summary": "Araya Industrial Co., Ltd. manufactures and sells steel products in Japan and internationally. The company offers ordinary steel pipes, stainless steel pipes, special-shaped steel pipes, various sections, and precision parts for OA machines for use in automobiles, motorcycles, bicycles, construction, furniture products, industrial machinery, welfare equipment, and logistics equipment. It also offers suspensions for wheelchairs, wheel chairs, industrial absolex, and wing arms for toilet, as well as bicycles and rims. The company was founded in 1903 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-0081",
        "website": "http://www.araya-kk.co.jp",
        "market_cap": "Small Cap"
    },
    "7425.T": {
        "short_name": "HATSUHO SHOUJI CO",
        "long_name": "Hatsuho Shouji Co.,Ltd.",
        "summary": "Hatsuho Shouji Co.,Ltd. operates as a general trading company in Japan. It sells construction hardware and steel base materials, and non-combustible materials; and architectural interior and exterior materials. The company is also involved in the sheet metal processing and sheet metal work business; roofing and interior finishing business; fly, earthwork, and exterior work business; steel structure construction and rebar construction business; straight line processing, bending processing, screw processing and sale of wire; installation and sale of solar power generation panels, and lighting equipment; and sale of architectural stud guns. Hatsuho Shouji Co.,Ltd. was founded in 1946 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0003",
        "website": "http://www.hatsuho.co.jp",
        "market_cap": "Small Cap"
    },
    "7531.T": {
        "short_name": "SEIWA CHUO HOLDINGS CORPORATION",
        "long_name": "Seiwa Chuo Holdings Corporation",
        "summary": "Seiwa Chuo Holdings Corporation engages in the wholesale of general steel products in Japan. It also undertakes processing and related contract works; and cargo handling works. The company was founded in 1954 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.seiwa-chuo-holdings.co.jp",
        "market_cap": "Small Cap"
    },
    "8015.T": {
        "short_name": "TOYOTA TSUSHO CORP",
        "long_name": "Toyota Tsusho Corporation",
        "summary": "Toyota Tsusho Corporation engages in the metals, parts and logistics, automotive, machinery, energy and project, chemicals and electronics, and food and consumer services businesses worldwide. The company manufactures steel products, steel construction materials, non-ferrous metal ingots, precious metals, aluminum products, copper and Ferro alloy products, waste catalysts, pig iron, and rare earth resources and metals; and iron, steel, and nonferrous metals scraps, as well as recycles vehicles and auto parts. It also offers component parts for automotives; runs logistics and tire assembly business; and sells passenger, commercial, and light vehicles, as well as motorcycles, trucks, buses, and automotive parts. In addition, the company is sells machine tools; testing and measuring instruments; medical and environmental equipment; coal, crude oil, natural gas, petroleum products, and liquefied petroleum gas; and construction, industrial, and textile machinery, as well as engages in water treatment, infrastructure projects, and energy and electric power supply businesses. Further, it offers semiconductors, plastics and rubber products, modular products, batteries and electronic materials, electronic equipment, specialty and inorganic chemicals, fat and oil products, chemical additives, and pharmaceuticals and pharmaceutical ingredients; PCs, and PC peripherals and software; intelligent transport systems; automotive embedded software development; network integration and support services; property, casualty, and life insurance; and securities brokerage services. Additionally, the company manufactures agricultural, marine, and livestock products; feed and oilseeds; grains, processed foods, and food ingredients; and alcoholic beverages. It also sells textile products, construction and housing materials, apparel, and furniture; develops nursing care facilities; and operates general hospitals and hotels. The company was founded in 1948 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-8575",
        "website": "http://www.toyota-tsusho.com",
        "market_cap": "Large Cap"
    },
    "8046.T": {
        "short_name": "MARUFUJI SHEET PILING CO",
        "long_name": "Marufuji Sheet Piling Co.,Ltd.",
        "summary": "Marufuji Sheet Piling Co.,Ltd., together with its subsidiaries, engages in the sale, rental, and repair processing of temporary materials for construction work in Japan. It offers steel sheet piles, corner piles, H-section steel products, shaped sheets, lining boards, road surface lining plates, steel retaining materials, and gantry and pier related products; temporary bridge and pier, and guardrail products; and multi-anchor type reinforced soil wall method, and PC-ATM products, as well as wireless axial force monitoring systems. The company also undertakes contract work for design and construction of civil engineering projects; and constructs jumping/earthworks and steel structures, as well as provides steel frame processing services. In addition, it provides underground obstacle removal and deep ground improvement works. The company was formerly known as Marufuji Shoten Corporation and changed its name to Marufuji Sheet Piling Co.,Ltd. in March 1963. Marufuji Sheet Piling Co.,Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0023",
        "website": "http://www.mrfj.co.jp",
        "market_cap": "Small Cap"
    },
    "8065.T": {
        "short_name": "SATO SHOJI CORP",
        "long_name": "Sato Shoji Corporation",
        "summary": "Sato Shoji Corporation sells iron and steel products, non-ferrous metals, machines, electronic materials, industrial tools, lifestyle goods, precious metals and jewelry, construction materials, and environment-related goods in Japan. It provides ordinary and specialty steel sheets, wire rods, steel pipes, processed products, building materials, and bar steel and section steel products for industries, such as automobiles, construction machinery, bridge building, construction, electrical machinery, ship building, and molds. The company also sells and imports non-ferrous metals, manufacturing equipment, die-casting machines, and sub-materials; and offers laminated board materials of printed circuit boards used in mobile phones and household appliances, sub-materials, equipment, and machines related to manufacturing. In addition, it offers machinery and tools products, such as machining tools, various types of equipment and devices, imported machinery, gear cutting tools, grinding tools, grinding wheels, measurement equipment, and other products. Further, the company provides the Martian, DANSK, and Sori Yanagi branded Western crockery and cutlery, as well as tableware, precious metals, and accessories. Additionally, it sells organic vegetables and fruits, canned goods and natural water, and various dishes through its mail order businesses, such as Sato Direct and Zenkoku Umaimonbin, as well as through SAYA stores; sells and handles AED and ozone generators; and designs, manufactures, and sells uniforms. Sato Shoji Corporation was founded in 1930 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8285",
        "website": "http://www.satoshoji.co.jp",
        "market_cap": "Small Cap"
    },
    "8075.T": {
        "short_name": "SHINSHO CORP",
        "long_name": "Shinsho Corporation",
        "summary": "Shinsho Corporation imports, exports, and trades in iron and steel, ferrous raw material, nonferrous metal, machinery, information industry, and welding products worldwide. The company offers iron and steel products, including half-finished steel, special steel, construction material, casting and forging, carbon steel, wire rod, titanium and nickel alloy, and casting material and cast products; ferrous raw materials, such as materials for making iron and steel, and other products comprising titanium sponge, coke breeze, slag products, slag powder for blast furnaces, cement, refuse paper and plastic fuel, secondary cement products, iron sand, plastics, chemical products, titanium scrap, new materials, and other auxiliary materials; and nonferrous metals, which includes aluminum, cast, aluminum and copper material, copper, and processed aluminum and copper products. It also provides machinery and electronics that include chemicals and food processing equipment; iron and steel, and non-ferrous metal related equipment; electronic and IT equipment; environment and energy-related equipment; and general industrial equipment. In addition, the company offers welding products, such as welding materials and welding-related equipment, and production materials for use in steel frame, construction machinery, and chemical engineering installation industries, including shipbuilding, steel frames, bridges, construction machinery, automotive, heavy electrical, chemical engineering, fabrication, welding material, and other applications. Shinsho Corporation was founded in 1946 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-8557",
        "website": "http://www.shinsho.co.jp",
        "market_cap": "Small Cap"
    },
    "9888.T": {
        "short_name": "UEX LTD",
        "long_name": "UEX, Ltd.",
        "summary": "UEX, Ltd. distributes stainless steel, titanium, and other metals in Japan. The company offers stainless steel plates, strips, tubes, pipes, bars, and shapes; building materials; stainless steel for hydrogen stations; and duplex stainless steel, processed, and titanium products, as well as machinery and engineering products. It also provides cutting services. The company was formerly known as Ueno Metalex, Ltd. and changed its name to UEX, Ltd. in 1998. UEX, Ltd. was founded in 1872 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "140-8630",
        "website": "http://www.uex-ltd.co.jp",
        "market_cap": "Small Cap"
    },
    "9964.T": {
        "short_name": "ITEC CORPORATION",
        "long_name": "Itec Corporation",
        "summary": "ITEC Corporation processes, manufactures, and trades in steel products in Japan. It offers shape steel products, such as H type steel, external H type steel, equilateral and unequal angle steel, channel steel, I shaped steel, flat steel, lip-shaped steel, lightweight H-shaped steel, light channel steel, steel sheet pile, lightweight steel sheet pile, and stainless steel. The company also provides round, deformed round, and square steel bars; steel plates for building steel and pressure vessels; steel sheets for general structure, welding structure, machine structure, and shipbuilding; and striped and stainless-steel plates. In addition, it offers steel pipes, such as columns, medium diameter square steel pipes, steel pipe piles, steel pipe sheet, and stainless-steel pipes, as well as steel pipes for general and mechanical structural products. Further, the company provides base packs, NC base products, high base products, various bolts, welding wires, flux tabs, gouging lots, liner plates, and corrugated products. Additionally, it is involved in transportation business; construction, steel construction, and architectural drawing contract works; and the production and sale of industrial machines. The company was founded in 1923 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "424-8510",
        "website": "http://www.itec-c.co.jp",
        "market_cap": "Small Cap"
    },
    "9TO.F": {
        "short_name": "TOYOTA TSUSHO",
        "long_name": "Toyota Tsusho Corporation",
        "summary": "Toyota Tsusho Corporation engages in the metals, parts and logistics, automotive, machinery, energy and project, chemicals and electronics, and food and consumer services businesses worldwide. The company manufactures steel products, steel construction materials, non-ferrous metal ingots, precious metals, aluminum products, copper and Ferro alloy products, waste catalysts, pig iron, and rare earth resources and metals; and iron, steel, and nonferrous metals scraps, as well as recycles vehicles and auto parts. It also offers component parts for automotives; runs logistics and tire assembly business; and sells passenger, commercial, and light vehicles, as well as motorcycles, trucks, buses, and automotive parts. In addition, the company is sells machine tools; testing and measuring instruments; medical and environmental equipment; coal, crude oil, natural gas, petroleum products, and liquefied petroleum gas; and construction, industrial, and textile machinery, as well as engages in water treatment, infrastructure projects, and energy and electric power supply businesses. Further, it offers semiconductors, plastics and rubber products, modular products, batteries and electronic materials, electronic equipment, specialty and inorganic chemicals, fat and oil products, chemical additives, and pharmaceuticals and pharmaceutical ingredients; PCs, and PC peripherals and software; intelligent transport systems; automotive embedded software development; network integration and support services; property, casualty, and life insurance; and securities brokerage services. Additionally, the company manufactures agricultural, marine, and livestock products; feed and oilseeds; grains, processed foods, and food ingredients; and alcoholic beverages. It also sells textile products, construction and housing materials, apparel, and furniture; develops nursing care facilities; and operates general hospitals and hotels. The company was founded in 1948 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-8575",
        "website": "http://www.toyota-tsusho.com",
        "market_cap": "Large Cap"
    },
    "DDL.F": {
        "short_name": "DAIDO STEEL",
        "long_name": "Daido Steel Co., Ltd.",
        "summary": "Daido Steel Co., Ltd. manufactures and sells steel products in Japan, rest of Asia, North America, and internationally. The company's Specialty Steel segment manufactures specialty steel for automotive parts, industrial machinery parts, electrical machinery parts, construction, tool steel, etc. Its High Performance Materials and Magnetic Materials segment offers stainless steel products, nickel-based alloys, electrical and electronics parts, magnetic material products, alloy powders, titanium products, and welding wires. The company's Parts For Automobile and Industrial Equipment segment provides die forgings, precise hot forgings, and welded parts, including automotive parts and bearing races; open die forgings, such as parts for boats and ships, industrial machines, heavy electric machines, steel making equipment, chemical equipment, oil drilling rigs, and spacecraft and aircraft; and castings that comprise manganese railway rails, components for automobiles, industrial machines, electric machines and furnaces, cast steel products, etc. This segment also offers precision castings, which include automotive, industrial machines, electric machines, telecommunications equipment, etc.; and engine valves, compressors, hydraulic equipment, and machine tool parts. Its Engineering segment provides steel making equipment; industrial furnaces and facilities; environmental equipment for drainage, exhaust, waste disposal, and treatment facilities; machine tools; and machine maintenance services. The company's Trading and Service segment engages in the provision of welfare services; real estate and insurance business; and golf course management, analysis, and outside software sales businesses. Daido Steel Co., Ltd. was founded in 1916 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "461-8581",
        "website": "http://www.daido.co.jp",
        "market_cap": "Small Cap"
    },
    "HMTLY": {
        "short_name": "HITACHI METALS",
        "long_name": "Hitachi Metals, Ltd.",
        "summary": "Hitachi Metals, Ltd. manufacture and sell specialty steel products, functional components and equipment, magnetic materials and applications/power electronics materials, wires and cables, and related products in Japan and internationally. The company's Specialty Steel Products segment offers molds and tool steels, rolls for steel mills, injection molding machine parts, structural ceramic products, and steel-frame joints for construction; automobile-related materials, razor and blade materials, precision cast components, and aircraft- and energy-related materials; and display-related materials, semiconductor and other package materials, and battery-related materials. Its Functional Components and Equipment segment provides high-grade ductile cast iron products and cast iron products for transportation equipment; and piping and infrastructure components. The company's Magnetic Materials and Applications/Power Electronics Materials segment offers rare-earth magnets, ferrite magnets, and other magnets and applied products; and amorphous metals, nanocrystalline magnetic materials, soft ferrite, and applied products, as well as ceramic components. Its Wires, Cables, and Related Products segment provides industrial cables, electronic wires, electric equipment materials, cable assemblies, and industrial rubber products; and automotive electronic components and brake hoses. The company was founded in 1910 and is headquartered in Tokyo, Japan. Hitachi Metals, Ltd. is a subsidiary of Hitachi, Ltd.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8224",
        "website": "http://www.hitachi-metals.co.jp",
        "market_cap": "Mid Cap"
    },
    "JFEEF": {
        "short_name": "JFE HOLDINGS INC",
        "long_name": "JFE Holdings, Inc.",
        "summary": "JFE Holdings, Inc., through its subsidiaries, engages in steel, engineering, and trading businesses in Japan and internationally. The company's Steel segment produces and sells various steel products, processed steel products, and raw materials, as well as operates in the transportation, facility maintenance, and construction businesses. Its Engineering segment engages in the construction of energy, urban environment, steel structures and industrial machinery, recycling, and electricity retailing projects. The company's Trading segment purchases, processes, and sells steel products, raw materials for steel production, nonferrous metal products, food, etc. JFE Holdings, Inc. was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.jfe-holdings.co.jp",
        "market_cap": "Mid Cap"
    },
    "JFR.F": {
        "short_name": "JFE HOLDINGS INC.",
        "long_name": "JFE Holdings, Inc.",
        "summary": "JFE Holdings, Inc., through its subsidiaries, engages in steel, engineering, and trading businesses in Japan and internationally. The company's Steel segment produces and sells various steel products, processed steel products, and raw materials, as well as operates in the transportation, facility maintenance, and construction businesses. Its Engineering segment engages in the construction of energy, urban environment, steel structures and industrial machinery, recycling, and electricity retailing projects. The company's Trading segment purchases, processes, and sells steel products, raw materials for steel production, nonferrous metal products, food, etc. JFE Holdings, Inc. was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.jfe-holdings.co.jp",
        "market_cap": "Mid Cap"
    },
    "KBSTF": {
        "short_name": "KOBE STEEL",
        "long_name": "Kobe Steel, Ltd.",
        "summary": "Kobe Steel, Ltd. engages in the materials, machinery, and electric power businesses in Japan, North and South Americas, Europe, the Middle East, rest of Asia, and Oceania. The company offers steel sheet products, including high-tensile strength, hot rolled, cold rolled, electro-galvanized, and hot-dipped galvanized steel sheets; steel wire rods and bars; and aluminum and steel plates. It also provides steel casting and forging products, such as crankshafts, marine parts, chemical processing equipment, and rolls, as well as materials for plastic molding; and titanium products, copper sheets and strips, and steel powders. In addition, the company offers robots and electric power sources, and welding materials; and machinery products, such as standard compressors, tire and rubber machinery products, rotating machinery products, plastic processing machinery products, advanced technology equipment, rolling mill products, and ultra high pressure equipment, as well as LNG vaporizers, pressure vessels, brazed aluminum heat exchangers, and micro channel heat exchanger and reactors. Further, it provides signaling, communication, power supply, automatic fare collection, and platform screen door systems; hydraulic and mini hydraulic excavators, mini wheel loaders, and road machinery; construction, metal, forestry, and industrial waste recycling machinery; and crawler and wheel cranes. Additionally, the company generates and supplies electric power; offers material and structural analysis, testing, physical analysis, and other services; manufactures and sells target materials and test equipment; sells and rents detached homes; and provides brokerage, renovation, insurance, and other services, as well as operational management services of public facilities. It also offers services in the field of iron units; and water treatment, waste incineration, PCB detoxification, and soil remediation services. The company was founded in 1905 and is headquartered in Kobe, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-8585",
        "website": "http://www.kobelco.co.jp",
        "market_cap": "Mid Cap"
    },
    "KST.F": {
        "short_name": "KOBE STEEL",
        "long_name": "Kobe Steel, Ltd.",
        "summary": "Kobe Steel, Ltd. engages in the materials, machinery, and electric power businesses in Japan, North and South Americas, Europe, the Middle East, rest of Asia, and Oceania. The company offers steel sheet products, including high-tensile strength, hot rolled, cold rolled, electro-galvanized, and hot-dipped galvanized steel sheets; steel wire rods and bars; and aluminum and steel plates. It also provides steel casting and forging products, such as crankshafts, marine parts, chemical processing equipment, and rolls, as well as materials for plastic molding; and titanium products, copper sheets and strips, and steel powders. In addition, the company offers robots and electric power sources, and welding materials; and machinery products, such as standard compressors, tire and rubber machinery products, rotating machinery products, plastic processing machinery products, advanced technology equipment, rolling mill products, and ultra high pressure equipment, as well as LNG vaporizers, pressure vessels, brazed aluminum heat exchangers, and micro channel heat exchanger and reactors. Further, it provides signaling, communication, power supply, automatic fare collection, and platform screen door systems; hydraulic and mini hydraulic excavators, mini wheel loaders, and road machinery; construction, metal, forestry, and industrial waste recycling machinery; and crawler and wheel cranes. Additionally, the company generates and supplies electric power; offers material and structural analysis, testing, physical analysis, and other services; manufactures and sells target materials and test equipment; sells and rents detached homes; and provides brokerage, renovation, insurance, and other services, as well as operational management services of public facilities. It also offers services in the field of iron units; and water treatment, waste incineration, PCB detoxification, and soil remediation services. The company was founded in 1905 and is headquartered in Kobe, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "651-8585",
        "website": "http://www.kobelco.co.jp",
        "market_cap": "Mid Cap"
    },
    "NISTF": {
        "short_name": "NIPPON STEEL CORPORATION",
        "long_name": "Nippon Steel Corporation",
        "summary": "Nippon Steel Corporation, together with its subsidiaries, engages in steelmaking and steel fabrication, engineering and construction, chemicals and materials, and system solutions businesses in Japan and internationally. The company offers hot and cold rolled, electrical, and galvanized steel sheets; electrolytic tinplates; flat products; bar and wire rods; steel pipe piles, rails, structural shapes, and steel sheet piles; welded and seamless pipes and tubes; railway, automotive, and machinery parts, such as bogie trucks, railway wheels, and crankshafts; titanium sheets, ingots, and foils; and stainless steel sheets, plates, and bar and rod materials. It also provides engineering and construction services for urban infrastructure, environment and energy, and steel making plants; coal chemicals, chemicals, and functional and composite materials; and IT consulting and outsourcing services. The company was formerly known as Nippon Steel & Sumitomo Metal Corporation and changed its name to Nippon Steel Corporation in April 2019. Nippon Steel Corporation was founded in 1949 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8071",
        "website": "http://www.nipponsteel.com",
        "market_cap": "Large Cap"
    },
    "NJ5.F": {
        "short_name": "NIPPON DENKO CO.LTD",
        "long_name": "Nippon Denko Co., Ltd.",
        "summary": "Nippon Denko Co., Ltd., together with its subsidiaries, manufactures and sells ferroalloys, functional materials, and environmental recycling systems in Japan. Its ferroalloys include high-carbon ferromanganese, medium-and low-carbon ferromanganese, ferrosilicomanganese, ferrosilicon, high-carbon ferrochromium, ferrovanadium, and ferroniobium. The company also offers functional materials, such as ferro boron, metal hydride alloys, cathode materials, zirconium oxides, manganese inorganic chemical products, boron oxide, boric acid, and electrolytic metal manganese. In addition, it provides environmental recycling systems, including chromic acid recovery systems for the production of industrial chemicals; boron recovery systems to absorb and eliminate the boron contained in wastewater; nickel recovery systems to recover nickel from nickel-containing drainage; AQUA PACK, a cartridge demineralizer; and MR-PACK, an integral pure water production unit. Further, the company produces and sells fertilizers; industrial chemicals, synthetic resins, special metals, packaging materials, high-pressure gases, abrasives, and pollution control equipment; polyethylene pipes, bags, nets, sheets, and PVC pipes; and roadbed building materials and solar panel installation materials, as well as generates renewable energy power. Additionally, it engages in transportation, warehousing, and sale of materials for steelmaking; recycling of general and industrial waste by melting; collection and haulage of industrial waste; provision of ship agency services; and sale of fuels. Nippon Denko Co., Ltd. was founded in 1925 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8282",
        "website": "http://www.nippondenko.co.jp",
        "market_cap": "Small Cap"
    },
    "NPS.F": {
        "short_name": "NIPPON STEEL CORP.",
        "long_name": "Nippon Steel Corporation",
        "summary": "Nippon Steel Corporation, together with its subsidiaries, engages in steelmaking and steel fabrication, engineering and construction, chemicals and materials, and system solutions businesses in Japan and internationally. The company offers hot and cold rolled, electrical, and galvanized steel sheets; electrolytic tinplates; flat products; bar and wire rods; steel pipe piles, rails, structural shapes, and steel sheet piles; welded and seamless pipes and tubes; railway, automotive, and machinery parts, such as bogie trucks, railway wheels, and crankshafts; titanium sheets, ingots, and foils; and stainless steel sheets, plates, and bar and rod materials. It also provides engineering and construction services for urban infrastructure, environment and energy, and steel making plants; coal chemicals, chemicals, and functional and composite materials; and IT consulting and outsourcing services. The company was formerly known as Nippon Steel & Sumitomo Metal Corporation and changed its name to Nippon Steel Corporation in April 2019. Nippon Steel Corporation was founded in 1949 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8071",
        "website": "http://www.nipponsteel.com",
        "market_cap": "Large Cap"
    },
    "NPSA.F": {
        "short_name": "NIPPON STEEL SPONS.ADR 10",
        "long_name": "Nippon Steel Corporation",
        "summary": "Nippon Steel Corporation, together with its subsidiaries, engages in steelmaking and steel fabrication, engineering and construction, chemicals and materials, and system solutions businesses in Japan and internationally. The company offers hot and cold rolled, electrical, and galvanized steel sheets; electrolytic tinplates; flat products; bar and wire rods; steel pipe piles, rails, structural shapes, and steel sheet piles; welded and seamless pipes and tubes; railway, automotive, and machinery parts, such as bogie trucks, railway wheels, and crankshafts; titanium sheets, ingots, and foils; and stainless steel sheets, plates, and bar and rod materials. It also provides engineering and construction services for urban infrastructure, environment and energy, and steel making plants; coal chemicals, chemicals, and functional and composite materials; and IT consulting and outsourcing services. The company was formerly known as Nippon Steel & Sumitomo Metal Corporation and changed its name to Nippon Steel Corporation in April 2019. Nippon Steel Corporation was founded in 1949 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8071",
        "website": "http://www.nipponsteel.com",
        "market_cap": "Large Cap"
    },
    "NPSCY": {
        "short_name": "NIPPON STEEL CORPORATION SPON A",
        "long_name": "Nippon Steel Corporation",
        "summary": "Nippon Steel Corporation, together with its subsidiaries, engages in steelmaking and steel fabrication, engineering and construction, chemicals and materials, and system solutions businesses in Japan and internationally. The company offers hot and cold rolled, electrical, and galvanized steel sheets; electrolytic tinplates; flat products; bar and wire rods; steel pipe piles, rails, structural shapes, and steel sheet piles; welded and seamless pipes and tubes; railway, automotive, and machinery parts, such as bogie trucks, railway wheels, and crankshafts; titanium sheets, ingots, and foils; and stainless steel sheets, plates, and bar and rod materials. It also provides engineering and construction services for urban infrastructure, environment and energy, and steel making plants; coal chemicals, chemicals, and functional and composite materials; and IT consulting and outsourcing services. The company was formerly known as Nippon Steel & Sumitomo Metal Corporation and changed its name to Nippon Steel Corporation in April 2019. Nippon Steel Corporation was founded in 1949 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-8071",
        "website": "http://www.nipponsteel.com",
        "market_cap": "Large Cap"
    },
    "PYV.F": {
        "short_name": "PAC. MET. CO. LTD",
        "long_name": "Pacific Metals Co., Ltd.",
        "summary": "Pacific Metals Co., Ltd. produces and sells ferro-nickel and ferro-nickel slag products in Japan and internationally. The company offers ferro-nickel that is used as a raw material for stainless steel; and mineral slag products. It is also involved in waste recycling business. In addition, the company purchases and sells cast forged steel products and various industrial machinery. Pacific Metals Co., Ltd. was founded in 1949 and is based in Hachinohe, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Hachinohe",
        "zipcode": "031-8617",
        "website": "http://www.pacific-metals.co.jp",
        "market_cap": "Small Cap"
    },
    "TOK.F": {
        "short_name": "TOKYO STEEL MFG",
        "long_name": "Tokyo Steel Manufacturing Co.,Ltd.",
        "summary": "Tokyo Steel Manufacturing Co., Ltd. manufactures and sells various steel products in Japan. The company offers various long products, such as H beams, U-shaped steel-sheet piles, I-beams, checkered H-beams, channels, and reinforcing bars for use in various construction and civil engineering projects, as well as in automobile and machinery components. It also provides flat products comprising heavy plates, hot rolled coils, pickled and oiled coils, hot-dip galvanized coils, checkered coils, and steel sheets for use in construction, industrial equipment, plant equipment, bridges, and ship-buildings. The company was founded in 1934 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://www.tokyosteel.co.jp",
        "market_cap": "Small Cap"
    },
    "YGW.F": {
        "short_name": "YODOGAWA STEEL WKS",
        "long_name": "Yodogawa Steel Works, Ltd.",
        "summary": "Yodogawa Steel Works, Ltd. manufactures and sells steel products for industrial and consumer products in Japan. The company offers steel sheets products comprising pre-painted and galvanized steel sheets, chromate-free treated steel sheets, cold rolled steel strips, special steel strips, steel strapping, and cold rolled steel sheets, as well as plated steel sheets, colored plated and printed steel sheets, and other types of steel sheets. It also provides exterior products for storage sheds, garages, carports, bicycle parks, warehouses, lodges, and trash bins; and building materials comprising roofing and siding, and environmental products. In addition, the company offers rolls for section steel, including plate and hot strip mill work rolls; paper manufacturing rolls; drilled rolls for rubber and vinyl; calender equipment for paper making; and cast iron rollers and other types of rollers. Further, it provides high-function grating products, as well as other gratings products, including pit and U-shaped covers. Additionally, the company is involved in the design and contracting of construction work; warehousing, packaging, and shipping activities; and sale, purchase, and lease of real estate, as well as building of facilities and landscaping activities. Yodogawa Steel Works, Ltd. was founded in 1935 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0054",
        "website": "http://www.yodoko.co.jp",
        "market_cap": "Small Cap"
    },
    "YMT.F": {
        "short_name": "YAMATO KOGYO CO.LTD",
        "long_name": "Yamato Kogyo Co., Ltd.",
        "summary": "Yamato Kogyo Co., Ltd., through its subsidiaries, manufactures and sells steel products in Japan, the United States, South Korea, Thailand, the Kingdom of Bahrain, the Kingdom of Saudi Arabia, Vietnam, and internationally. The company offers steel products and heavy-duty processing goods, railway track accessories, reinforcing bars, steel billets, and structural steel products. It is also involved in the transportation; medical waste treatment; and real estate leasing activities, as well as industrial waste refining; and material handling at ports. It also manufactures counterweights and storage tanks. The company was founded in 1944 and is headquartered in Himeji, Japan.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Steel",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "671-1192",
        "website": "http://www.yamatokogyo.co.jp",
        "market_cap": "Mid Cap"
    }
}