{
  "0143.HK": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Guoan International Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "GUOAN INTL",
    "state": null,
    "summary": "Guoan International Limited, an investment holding company, provides repair services for telecommunication products in Hong Kong. The company also trades in telecommunications, electronic, and other products; and invests in financial assets. In addition, it engages in the money lending and property holding business; and trading of wine. The company was formerly known as Global Tech (Holdings) Limited and changed its name to Guoan International Limited in September 2017. Guoan International Limited was incorporated in 1998 and is headquartered in Hong Kong, Hong Kong. Guoan International Limited is a subsidiary of Road Shine Developments Limited.",
    "website": "http://www.guoanintl.com",
    "zipcode": null
  },
  "0248.HK": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "HKC International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "HKC INT'L HOLD",
    "state": null,
    "summary": "HKC International Holdings Limited, an investment holding company, provides information communication technology solutions in Hong Kong, Mainland China, Singapore, and other countries in South East Asia. The company distributes and sells mobile phones and other electronic products, and Internet of Things solutions. It provides a range of intelligent systems comprising home automation systems, including smart display user interface, home energy consumption information, waste management information, home health and wellness information, and building management systems, as well as security products; office automation systems, such as sensor, video conferencing, IP-based security surveillance, IP telephony, LED lighting control, and e-booking and customer relationship management systems; and security systems, such as intercom/video door phone, face recognition solutions, and access control and biometric systems, as well as network security and solutions, and directional infrared sensors. The company's intelligent systems also include ageing in place systems consisting of anti-wandering system, instant indications of patients' real time status, and alert trigger for sleeping belts and smart diapers, as well as wearable Wi-Fi Tags. In addition, it offers carrot home solutions; RFID solutions comprising library management, logistics management, and asset management solutions, as well as real time location tracking systems; AI service robot solutions; and UVC disinfection products. Further, the company distributes and retails mobile phones, digital cameras, and other related accessories; and provides smart mirror solutions, as well as people and asset location tracking solutions. Additionally, it is involved in the property investment activities. HKC International Holdings Limited was founded in 1970 and is based in Hong Kong, Hong Kong.",
    "website": "http://www.hkc.com.hk",
    "zipcode": null
  },
  "0261.HK": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "GBA Holdings Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GBA HOLDINGS",
    "state": null,
    "summary": "GBA Holdings Limited, an investment holding company, designs, develops, sells, and supplies telecom, electronic, and infant and child products in Mainland China, Hong Kong, North America, the Asia Pacific, Europe, and internationally. It offers cordless products, such as DECT cordless, digital cordless, corded/cordless combo phone systems, and designer phones; and design phones, corded phones, and Qi charging pads, as well as family radio systems and Bluetooth products. The company's infant and child products include baby monitoring products, feeding and grooming products, nursing kits and safety products, and home appliances. It is also involved in the development and sale of properties; trading of telecom, electronic, and child products; and finance business. The company was formerly known as Greater Bay Area Investments Group Holdings Limited and changed its name to GBA Holdings Limited in August 2020. The company is headquartered in Shatin, Hong Kong.",
    "website": "http://www.gbaholdings.com",
    "zipcode": null
  },
  "0303.HK": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Vtech Holdings Limited",
    "market": "hk_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VTECH HOLDINGS",
    "state": null,
    "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.vtech.com/index.html",
    "zipcode": null
  },
  "0482.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Sandmartin International Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SANDMARTIN INTL",
    "state": null,
    "summary": "Sandmartin International Holdings Limited, an investment holding company, engages in the manufacture and trading of satellite TV equipment products and other electronic goods. It operates through Media Entertainment Platform Related Products; Other Multimedia Products; and Satellite TV Equipment and Antenna Products segments. The company manufactures and trades in media entertainment platform related products used for satellite products equipment; components of audio and video electronic products, such as cable lines; and satellite TV equipment and antenna products. It has operations in Asia, Europe, North America, the Middle East, Africa, South America, and internationally. Sandmartin International Holdings Limited was founded in 1987 and is headquartered in Kowloon, Hong Kong.",
    "website": "http://www.sandmartin.com.hk",
    "zipcode": null
  },
  "1473.HK": {
    "city": "Wan Chai",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Pangaea Connectivity Technology Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PANGAEA CONNECT",
    "state": null,
    "summary": "Pangaea Connectivity Technology Limited operates as a distributor of connectivity products for telecom infrastructure, data center, internet of things (IoT) and network connectivity products, and commercial lasers in the People's Republic of china, Hong Kong, and internationally. The company engages in sourcing and distribution of components, such as amplifiers, diodes, front-end modules, integrated circuit, industrial lasers, modulators/demodulators, phase-locked loop, receivers/transmitters, reconfigurable optical add-drop multiplexer, semiconductor lasers, and switches. It also offers solution and application support, which includes identification of customers' specifications, technical design support, multiple functions integration, and technical analysis and support. In addition, the company provides consultancy services; and trades in connectivity products. It serves communications module manufacturers, network system equipment providers, providers of IoT and connectivity solutions and products, and other distributors. The company was founded in 1990 and is headquartered in Wan Chai, Hong Kong.",
    "website": "http://www.pangaea.com.hk",
    "zipcode": null
  },
  "1523.HK": {
    "city": "Lai Chi Kok",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Plover Bay Technologies Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PLOVER BAY TECH",
    "state": null,
    "summary": "Plover Bay Technologies Limited, an investment holding company, designs, develops, markets, and sells software defined wide area network (SD-WAN) routers worldwide. It also provides software licences, and warranty and support services. The company markets and sells its products under the Peplink and Pepwave brands through distributors and resellers. In addition, it is involved in property holding activities. The company serves maritime and ground transport, public safety, education, and retail sectors, as well as enterprises. Plover Bay Technologies Limited was incorporated in 2006 and is headquartered in Lai Chi Kok, Hong Kong.",
    "website": "http://www.ploverbay.com",
    "zipcode": null
  },
  "1613.HK": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Synertone Communication Corporation",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SYNERTONE",
    "state": null,
    "summary": "Synertone Communication Corporation engages in the design, research and development, production, and sale of automation control and intelligent building systems in the People's Republic of China and internationally. It operates through Building Intelligence and Control System segments. The Building Intelligence segment provides video intercom system, security alarm solutions, and surveillance systems under the MOX brand for residential complexes; and smart home automation systems for new and existing households. Its Control System segment offers automation hardware and software products, information systems platforms, as well as the industrial, monitoring, and scheduling management system solutions for municipal utilities industry. Synertone Communication Corporation was founded in 2001 and is headquartered in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.synertone.net",
    "zipcode": null
  },
  "2342.HK": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Comba Telecom Systems Holdings Limited",
    "market": "hk_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "COMBA",
    "state": null,
    "summary": "Comba Telecom Systems Holdings Limited, an investment holding company, researches, develops, manufactures, assembles, and sells wireless telecommunications network system equipment and related engineering services. It operates through two segments, Wireless Telecommunications Network System Equipment and Services, and Operator Telecommunication Services. The company offers base station and indoor antennas; RET systems; RF products, such as filters, combiners and couplers, dummy loads, power splitters, and modular multiple operator combiners. It also provides network products, including small cell, RRU, BBU, high power RX repeater, middle and low power repeater, public safety repeater, and distributed antennas system (DAS); and smart city solutions. In addition, the company offers consultancy, DAS network design, drive test and benchmarking, maintenance, managed, network data analysis and optimization, and training services; and software technology and technical support and repairing services; and operates telecommunication and provides value-added services. Further, it engages in the trading and marketing of wireless telecommunications network system equipment; research and development, and trading of digital microwave system equipment; and provision of hardware and software solutions and services. The company serves the airport, education, government and public safety, healthcare, hospitality, retail, stadium, and transportation industries. It operates in Mainland China, rest of Asia Pacific, the Americas, the European Union, the Middle East, and internationally. The company was founded in 1995 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.comba-telecom.com",
    "zipcode": null
  },
  "8043.HK": {
    "city": "Kowloon Bay",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Atlinks Group Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ATLINKS",
    "state": null,
    "summary": "Atlinks Group Limited, an investment holding company, designs, develops, and sells home and office telecommunication products to retailers, telecommunication operators, and distributors worldwide. The company develops and distributes telephones, monitoring solutions, baby monitors, and conferencing phones under the Alcatel brand; and landline phones, smart home accessories, mobile phones, and various services to support and reassure senior users under the Swissvoice brand. It also provides sound telephones, headphones, accessories, and mobile phones under the Amplicomms brand. In addition, the company develops and trades in electrical equipment, including radio communication equipment; and manages trademarks. The company was founded in 2013 and is based in Kowloon Bay, Hong Kong. Atlinks Group Limited is a subsidiary of Eiffel Global Limited.",
    "website": "http://www.atlinks.com",
    "zipcode": null
  },
  "8287.HK": {
    "city": "Sha Tin",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Zioncom Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ZIONCOM",
    "state": null,
    "summary": "Zioncom Holdings Limited, an investment holding company, manufactures and sells networking and non-networking products for home use and small scale commercial applications. It offers routers for wired and wireless transmission of data; and wired and wireless networking products, such as Ethernet switches, LAN cards, Wi-Fi modules, and access points, as well as non-networking products, including power banks and USB hubs. The company offers products through distributors in Korea, the People's Republic of China, Vietnam, other Asian countries, Europe, South America, Africa, and North America. The company was founded in 1999 and is headquartered in Shatin, Hong Kong. Zioncom Holdings Limited is a subsidiary of Lincats (BVI) Limited.",
    "website": "http://www.zioncom.net",
    "zipcode": null
  },
  "9963.HK": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Transtech Optelecom Science Holdings Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TRANSTECH",
    "state": null,
    "summary": "Transtech Optelecom Science Holdings Limited, an investment holding company, manufactures and sells optical fiber, optical fiber cables, and other products. The company offers optical fiber for use in telecommunication, medical, military, aerospace and various other applications; optical fiber cables under the Futong trademark; and optical fiber core and other related products, such as optical fiber coloring, secondary coating, and stranded cabling, as well as the tests. It has operations in the People's Republic of China, Thailand, Vietnam, Singapore, Laos, the Philippines, Burma, and internationally. The company was founded in 2003 and is headquartered in Tai Po, Hong Kong. Transtech Optelecom Science Holdings Limited is a subsidiary of Futong Group Co., Ltd.",
    "website": "http://www.transtechoptel.com",
    "zipcode": null
  },
  "C5K.F": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "China All Access (Holdings) Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "CHINA ALL ACCESS HLDGS",
    "state": null,
    "summary": "China All Access (Holdings) Limited, an investment holding company, provides communication application solutions and services in the People's Republic of China. It operates through ICT, New Energy, and Investment Activities segments. The company researches and develops, manufactures, and distributes wireless terminals and equipment, including display modules, casings, and keyboards. Its information communication solutions comprise command center solutions, such as All Access platform, a multi-media audio and video command and control system; emergency communication solutions for government and public security departments; and mobile office solutions to access the cloud data base to transmit, review, and control operations. The company's information communication solutions also include broadband machine-to-machine (M2M) systems that allow to control household appliances and to monitor the interior of property from remote locations; M2M wireless data communication for telemetering, and remote control and adjustment in the field of public utilities, such as social public security, municipal comprehensive management, and others; and call center solutions, including the maintenance of system devices, as well as their operation, development/maintenance/upgrade of application software and personnel training. It is also involved in the research and development, installation, and application of device for photovoltaic plants; investment activities; provision of communication equipment, and supply chain management and cargo agency services; manufacture of handset screens and shells; and development and provision of new energy, new material technology, technology service, and technology transfer activities. The company was incorporated in 2007 and is headquartered in Kowloon, Hong Kong.",
    "website": "http://www.chinaallaccess.com",
    "zipcode": null
  },
  "COA1.F": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Comba Telecom Systems Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "COMBA TELECOM  HD-,10",
    "state": null,
    "summary": "Comba Telecom Systems Holdings Limited, an investment holding company, researches, develops, manufactures, assembles, and sells wireless telecommunications network system equipment and related engineering services. It operates through two segments, Wireless Telecommunications Network System Equipment and Services, and Operator Telecommunication Services. The company offers base station and indoor antennas; RET systems; RF products, such as filters, combiners and couplers, dummy loads, power splitters, and modular multiple operator combiners. It also provides network products, including small cell, RRU, BBU, high power RX repeater, middle and low power repeater, public safety repeater, and distributed antennas system (DAS); and smart city solutions. In addition, the company offers consultancy, DAS network design, drive test and benchmarking, maintenance, managed, network data analysis and optimization, and training services; and software technology and technical support and repairing services; and operates telecommunication and provides value-added services. Further, it engages in the trading and marketing of wireless telecommunications network system equipment; research and development, and trading of digital microwave system equipment; and provision of hardware and software solutions and services. The company serves the airport, education, government and public safety, healthcare, hospitality, retail, stadium, and transportation industries. It operates in Mainland China, rest of Asia Pacific, the Americas, the European Union, the Middle East, and internationally. The company was founded in 1995 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.comba-telecom.com",
    "zipcode": null
  },
  "G11.SI": {
    "city": "Hong Kong",
    "country": "Hong Kong",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Guoan International Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Guoan Intl",
    "state": null,
    "summary": "Guoan International Limited, an investment holding company, provides repair services for telecommunication products in Hong Kong. The company also trades in telecommunications, electronic, and other products; and invests in financial assets. In addition, it engages in the money lending and property holding business; and trading of wine. The company was formerly known as Global Tech (Holdings) Limited and changed its name to Guoan International Limited in September 2017. Guoan International Limited was incorporated in 1998 and is headquartered in Hong Kong, Hong Kong. Guoan International Limited is a subsidiary of Road Shine Developments Limited.",
    "website": "http://www.guoanintl.com",
    "zipcode": null
  },
  "IMNG": {
    "city": "Mongkok",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Communication Equipment",
    "long_name": "iMing Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "IMING CORP",
    "state": null,
    "summary": "iMing Corp. engages in the provision of set-top boxes in China, North America, and Europe. Its products include the IMING Web TV HD Box, a home entertainment center that supplies approximately 10,000 HD movies, live TV channels, pre-recorded TV programs, and high demand streams of content. The company was formerly known as China Career Builder Corp. and changed its name to iMing Corp. in June 2012 to reflect the changes in its principal business. iMing Corp. is based in Mongkok, Hong Kong.",
    "website": "http://www.imingcorp.com",
    "zipcode": null
  },
  "S0Y2.F": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Synertone Communication Corporation",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SYNERTONE COMMUNIC.HD-,05",
    "state": null,
    "summary": "Synertone Communication Corporation engages in the design, research and development, production, and sale of automation control and intelligent building systems in the People's Republic of China and internationally. It operates through Building Intelligence and Control System segments. The Building Intelligence segment provides video intercom system, security alarm solutions, and surveillance systems under the MOX brand for residential complexes; and smart home automation systems for new and existing households. Its Control System segment offers automation hardware and software products, information systems platforms, as well as the industrial, monitoring, and scheduling management system solutions for municipal utilities industry. Synertone Communication Corporation was founded in 2001 and is headquartered in Tsim Sha Tsui, Hong Kong.",
    "website": "http://www.synertone.net",
    "zipcode": null
  },
  "STRH": {
    "city": "Tsimshatsui",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Communication Equipment",
    "long_name": "Star8 Corp.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "STAR8 CORP",
    "state": null,
    "summary": "Star8 Corporation, a development stage company, provides mobile smart phones and related accessories. It principally targets the pre-paid mobile phone market delivering mobile email and messaging phone. The company would market its phones under the name Axiom. Star8 Corporation markets its products through mobile phone distributors in south east Asia, Africa, and Latin America. The company was formerly known as Immunis Holding Corp and changed its name to Star8 Corporation in September 2010. Star8 Corporation was founded in 1987 and is headquartered in Tsimshatsui, Hong Kong.",
    "website": "http://www.star8corp.com",
    "zipcode": null
  },
  "TQG.F": {
    "city": "Kowloon",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Sandmartin International Holdings Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "SANDMARTIN INTL  HD-,10",
    "state": null,
    "summary": "Sandmartin International Holdings Limited, an investment holding company, engages in the manufacture and trading of satellite TV equipment products and other electronic goods. It operates through Media Entertainment Platform Related Products; Other Multimedia Products; and Satellite TV Equipment and Antenna Products segments. The company manufactures and trades in media entertainment platform related products used for satellite products equipment; components of audio and video electronic products, such as cable lines; and satellite TV equipment and antenna products. It has operations in Asia, Europe, North America, the Middle East, Africa, South America, and internationally. Sandmartin International Holdings Limited was founded in 1987 and is headquartered in Kowloon, Hong Kong.",
    "website": "http://www.sandmartin.com.hk",
    "zipcode": null
  },
  "VTCB.F": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Vtech Holdings Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VTECH HLDGS (BL100) DL-05",
    "state": null,
    "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.vtech.com/index.html",
    "zipcode": null
  },
  "VTKLF": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Communication Equipment",
    "long_name": "Vtech Holdings Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VTECH HLDGS",
    "state": null,
    "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.vtech.com/index.html",
    "zipcode": null
  },
  "VTKLY": {
    "city": "Tai Po",
    "country": "Hong Kong",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Communication Equipment",
    "long_name": "Vtech Holdings Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VTECH HLDGS",
    "state": null,
    "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.",
    "website": "http://www.vtech.com/index.html",
    "zipcode": null
  }
}
