{"0143.HK": {"short_name": "GUOAN INTL", "long_name": "Guoan International Limited", "summary": "Guoan International Limited, an investment holding company, provides repair services for telecommunication products in Hong Kong. The company also trades in telecommunications, electronic, and other products; and invests in financial assets. In addition, it engages in the money lending and property holding business; and trading of wine. The company was formerly known as Global Tech (Holdings) Limited and changed its name to Guoan International Limited in September 2017. Guoan International Limited was incorporated in 1998 and is headquartered in Hong Kong, Hong Kong. Guoan International Limited is a subsidiary of Road Shine Developments Limited.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "0248.HK": {"short_name": "HKC INT'L HOLD", "long_name": "HKC International Holdings Limited", "summary": "HKC International Holdings Limited, an investment holding company, provides information communication technology solutions in Hong Kong, Mainland China, Singapore, and other countries in South East Asia. The company distributes and sells mobile phones and other electronic products, and Internet of Things solutions. It provides a range of intelligent systems comprising home automation systems, including smart display user interface, home energy consumption information, waste management information, home health and wellness information, and building management systems, as well as security products; office automation systems, such as sensor, video conferencing, IP-based security surveillance, IP telephony, LED lighting control, and e-booking and customer relationship management systems; and security systems, such as intercom/video door phone, face recognition solutions, and access control and biometric systems, as well as network security and solutions, and directional infrared sensors. The company's intelligent systems also include ageing in place systems consisting of anti-wandering system, instant indications of patients' real time status, and alert trigger for sleeping belts and smart diapers, as well as wearable Wi-Fi Tags. In addition, it offers carrot home solutions; RFID solutions comprising library management, logistics management, and asset management solutions, as well as real time location tracking systems; AI service robot solutions; and UVC disinfection products. Further, the company distributes and retails mobile phones, digital cameras, and other related accessories; and provides smart mirror solutions, as well as people and asset location tracking solutions. Additionally, it is involved in the property investment activities. HKC International Holdings Limited was founded in 1970 and is based in Hong Kong, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "0261.HK": {"short_name": "GBA HOLDINGS", "long_name": "GBA Holdings Limited", "summary": "GBA Holdings Limited designs, develops, sells, and supplies telecom, electronic, and infant and child products in Mainland China, Hong Kong, North America, the Asia Pacific, Europe, and internationally. It offers cordless products, such as DECT cordless, digital cordless, corded/cordless combo photo systems, and designer phones; and design phones, corded phones, and Qi charging pads, as well as family radio systems and Bluetooth products. The company's infant and child products include baby monitoring products, feeding and grooming products, nursing kits and safety products, and home appliances. It is also involved in the development and sale of properties; and finance business, as well as electric vehicle business. The company was formerly known as Greater Bay Area Investments Group Holdings Limited and changed its name to GBA Holdings Limited in August 2020. The company is headquartered in Shatin, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sha Tin"}, "0303.HK": {"short_name": "VTECH HOLDINGS", "long_name": "Vtech Holdings Limited", "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tai Po"}, "0482.HK": {"short_name": "SANDMARTIN INTL", "long_name": "Sandmartin International Holdings Limited", "summary": "Sandmartin International Holdings Limited, an investment holding company, engages in the manufacture and trading of satellite TV equipment products and other electronic goods. It operates through Media Entertainment Platform Related Products; Other Multimedia Products; Integration of Signal System and Traffic Communication Network; Satellite TV Equipment and Antenna Products; and Satellite TV Broadcasting segments. The company manufactures and trades in media entertainment platform related products used for satellite products equipment; components of audio and video electronic products, such as cable lines; and satellite TV equipment and antenna products. It is also involved in the installation and integration of signal systems and traffic communication networks. The company has operations in Asia, Europe, North America, the Middle East, Africa, South America, and internationally. Sandmartin International Holdings Limited was founded in 1987 and is headquartered in Kowloon, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon"}, "1523.HK": {"short_name": "PLOVER BAY TECH", "long_name": "Plover Bay Technologies Limited", "summary": "Plover Bay Technologies Limited, an investment holding company, designs, develops, markets, and sells software defined wide area network (SD-WAN) routers worldwide. It also provides software licences, and warranty and support services. The company markets and sells its products under the Peplink and Pepwave brands through third party distributors, and resellers. In addition, it is involved in property holding activities. The company serves maritime and ground transport, public safety, education, and retail sectors, as well as enterprises. Plover Bay Technologies Limited was founded in 2006 and is headquartered in Lai Chi Kok, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Lai Chi Kok"}, "2342.HK": {"short_name": "COMBA", "long_name": "Comba Telecom Systems Holdings Limited", "summary": "Comba Telecom Systems Holdings Limited, an investment holding company, researches, develops, manufactures, and sells wireless telecommunications network system equipment and related engineering services. It operates through two segments, Wireless Telecommunications Network System Equipment and Services, and Operator Telecommunication Services. The company offers base station and indoor antennas; RET systems; RF products, such as filters, combiners and couplers, dummy loads, power splitters, and modular multiple operator combiners. It also provides network products, including small cell, RRU, BBU, NMS, outdoor and indoor CPE, high power RX repeater, middle and low power repeater, public safety repeater, and distributed antennas system (DAS); and smart city solution. In addition, the company offers wireless transmission systems, including portable, vehicle, and shipboard satellite antennas; and microwave transmission systems comprising couplers, full outdoor and split systems, microwave antennas, OMT, outdoor units, and radio frequency units. Further, it offers consultancy, DAS network design, drive test and benchmarking, maintenance, managed, network data analysis and optimization, and training services; and software technology and marketing, technical support, repair, trading, general, assembly, and related value-added services. The company serves the airport, education, government and public safety, healthcare, hospitality, retail, stadium, and transportation industries. It operates in Mainland China, rest of Asia Pacific, the Americas, the European Union, the Middle East, and internationally. The company was founded in 1995 and is headquartered in Tai Po, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tai Po"}, "8043.HK": {"short_name": "ATLINKS", "long_name": "Atlinks Group Limited", "summary": "Atlinks Group Limited, an investment holding company, designs, develops, and sells home and office telecommunication products to retailers, telecommunication operators, and distributors primarily in Europe and Latin America. The company develops and distributes telephones, monitoring solutions, baby monitors, and conferencing phones under the Alcatel brand; and landline phones, smart home accessories, mobile phones, and various services to support and reassure senior users under the Swissvoice brand. It also provides sound telephones, headphones, accessories, and mobile phones under the Amplicomms brand. In addition, the company develops and trades in electrical equipment, including radio communication equipment; and manages trademarks. The company was founded in 2013 and is based in Kowloon Bay, Hong Kong. Atlinks Group Limited is a subsidiary of Eiffel Global Limited.", "currency": "HKD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "COA1.F": {"short_name": "COMBA TELECOM  HD-,10", "long_name": "Comba Telecom Systems Holdings Limited", "summary": "Comba Telecom Systems Holdings Limited, an investment holding company, researches, develops, manufactures, and sells wireless telecommunications network system equipment and related engineering services. It operates through two segments, Wireless Telecommunications Network System Equipment and Services, and Operator Telecommunication Services. The company offers base station and indoor antennas; RET systems; RF products, such as filters, combiners and couplers, dummy loads, power splitters, and modular multiple operator combiners. It also provides network products, including small cell, RRU, BBU, NMS, outdoor and indoor CPE, high power RX repeater, middle and low power repeater, public safety repeater, and distributed antennas system (DAS); and smart city solution. In addition, the company offers wireless transmission systems, including portable, vehicle, and shipboard satellite antennas; and microwave transmission systems comprising couplers, full outdoor and split systems, microwave antennas, OMT, outdoor units, and radio frequency units. Further, it offers consultancy, DAS network design, drive test and benchmarking, maintenance, managed, network data analysis and optimization, and training services; and software technology and marketing, technical support, repair, trading, general, assembly, and related value-added services. The company serves the airport, education, government and public safety, healthcare, hospitality, retail, stadium, and transportation industries. It operates in Mainland China, rest of Asia Pacific, the Americas, the European Union, the Middle East, and internationally. The company was founded in 1995 and is headquartered in Tai Po, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Tai Po"}, "G11.SI": {"short_name": "Guoan Intl", "long_name": "Guoan International Limited", "summary": "Guoan International Limited, an investment holding company, provides repair services for telecommunication products in Hong Kong. The company also trades in telecommunications, electronic, and other products; and invests in financial assets. In addition, it engages in the money lending and property holding business; and trading of wine. The company was formerly known as Global Tech (Holdings) Limited and changed its name to Guoan International Limited in September 2017. Guoan International Limited was incorporated in 1998 and is headquartered in Hong Kong, Hong Kong. Guoan International Limited is a subsidiary of Road Shine Developments Limited.", "currency": "SGD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Hong Kong"}, "IMNG": {"short_name": "IMING CORP", "long_name": "iMing Corp.", "summary": "iMing Corp. engages in the provision of set-top boxes in China, North America, and Europe. Its products include the IMING Web TV HD Box, a home entertainment center that supplies approximately 10,000 HD movies, live TV channels, pre-recorded TV programs, and high demand streams of content. The company was formerly known as China Career Builder Corp. and changed its name to iMing Corp. in June 2012 to reflect the changes in its principal business. iMing Corp. is based in Mongkok, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Mongkok"}, "SIMTF": {"short_name": "SIM TECHNOLOGY GROUP LIMITED", "long_name": "SIM Technology Group Limited", "summary": "SIM Technology Group Limited, an investment holding company, primarily designs, develops, manufactures, and sells handsets and Internet of Things (IOT) terminals. It operates through six segments: Handsets and IOT Terminals Business, Electronic Manufacturing Services Business, IOT System and Online-to-Offline Business, Intelligent Manufacturing Business, Property Development, and Property Management. The company also offers electronic manufacturing services; and intelligent manufacturing products. In addition, it provides goods to vending machine customers and franchisees; and procurement agency and equipment finance lease services. Further, the company develops automated test equipment; trades in snacks; and holds land use rights. Additionally, it engages in the property development and management activities; and design and construction of smart homes. The company has operations in the People's Republic of China, Europe, the United States, Hong Kong, and other Asian countries. SIM Technology Group Limited was founded in 1986 and is headquartered in Kwun Tong, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kwun Tong"}, "STRH": {"short_name": "STAR8 CORP", "long_name": "Star8 Corp.", "summary": "Star8 Corporation, a development stage company, provides mobile smart phones and related accessories. It principally targets the pre-paid mobile phone market delivering mobile email and messaging phone. The company would market its phones under the name Axiom. Star8 Corporation markets its products through mobile phone distributors in south east Asia, Africa, and Latin America. The company was formerly known as Immunis Holding Corp and changed its name to Star8 Corporation in September 2010. Star8 Corporation was founded in 1987 and is headquartered in Tsimshatsui, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsimshatsui"}, "TQG.F": {"short_name": "SANDMARTIN INTL  HD-,10", "long_name": "Sandmartin International Holdings Limited", "summary": "Sandmartin International Holdings Limited, an investment holding company, engages in the manufacture and trading of satellite TV equipment products and other electronic goods. It operates through Media Entertainment Platform Related Products; Other Multimedia Products; Integration of Signal System and Traffic Communication Network; Satellite TV Equipment and Antenna Products; and Satellite TV Broadcasting segments. The company manufactures and trades in media entertainment platform related products used for satellite products equipment; components of audio and video electronic products, such as cable lines; and satellite TV equipment and antenna products. It is also involved in the installation and integration of signal systems and traffic communication networks. The company has operations in Asia, Europe, North America, the Middle East, Africa, South America, and internationally. Sandmartin International Holdings Limited was founded in 1987 and is headquartered in Kowloon, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kowloon"}, "VTCB.F": {"short_name": "VTECH HLDGS (BL100) DL-05", "long_name": "Vtech Holdings Limited", "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Tai Po"}, "VTKLF": {"short_name": "VTECH HLDGS", "long_name": "Vtech Holdings Limited", "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tai Po"}, "VTKLY": {"short_name": "VTECH HLDGS", "long_name": "Vtech Holdings Limited", "summary": "Vtech Holdings Limited designs, manufactures, and distributes consumer electronic products in North America, Europe, the Asia Pacific, and internationally. The company offers electronic learning toys for infancy, toddler, and preschool under the Vtech and Leap Frog brands; platform products; and learning programs. It also provides telecommunication products, such as residential and commercial phones; and other telecommunication products, including integrated access devices, baby monitors, handsets, wireless monitoring systems, and baby soothers. In addition, the company offers contract manufacturing services for customers in the areas of professional audio equipment, hearables, medical and health, and Internet of Things products. Further, it is involved in the property holding activities; development of broadband connectivity software; sale of electronic and telecommunication products; and manufacture of plastic products, as well as group financing and procurement activities. The company was founded in 1976 and is headquartered in Tai Po, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tai Po"}}