{
    "0176.HK": {
        "short_name": "SUPERACTIVE GP",
        "long_name": "Superactive Group Company Limited",
        "summary": "Superactive Group Company Limited, an investment holding company, designs, manufactures, and distributes consumer electronic products. It also provides nursery education, money lending, property development and management, and regulated financial services. The company sells its products primarily in the People's Republic of China, Mainland China, Hong Kong, the United States, the United Kingdom, Europe, and internationally. The company was formerly known as United Pacific Industries Limited and changed its name to Superactive Group Company Limited July 2017. The company is headquartered in Central, Hong Kong. Superactive Group Company Limited is a subsidiary of Super Fame Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.superactive.com.hk",
        "market_cap": "Small Cap"
    },
    "0320.HK": {
        "short_name": "COMPUTIME",
        "long_name": "Computime Group Limited",
        "summary": "Computime Group Limited, an investment holding company, engages in the research, development, design, manufacture, and trading of electronic control products in the Americas, Europe, and Asia. It operates through two segments, Smart Solutions and Contract Manufacturing Services. The company researches, designs, develops, manufactures, trades in, and distributes building and home control; appliance control; and commercial and industrial control products. It also offers a range of services, including software, electronics, PCB layout, mechanical design, front-end interface development, mechanical package design, advanced test development, product industrialization, assembly, and mass production. In addition, the company provides original equipment and design manufacturing services in various market segments, such as appliance controls; heating, ventilating, air conditioning, and refrigeration; and commercial, industrial, and medical applications. Further, it offers technology solutions; and thermostatic controls, home automation, and sensor products under the SALUS brand. Computime Group Limited was founded in 1974 and is headquartered in Sha Tin, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.computime.com",
        "market_cap": "Small Cap"
    },
    "0684.HK": {
        "short_name": "ALLAN INT'L",
        "long_name": "Allan International Holdings Limited",
        "summary": "Allan International Holdings Limited, an investment holding company, manufactures and trades in household electrical appliances in Europe, Asia, the Americas, and internationally. The company offers food processors and mixers, juicing and blending products, deep frying products, kettles, and electric knives. It is also involved in the manufacture and trading of plastic injection moulds and plastic parts; property investment and holding activities; and securities investment activities. The company is headquartered in Chai Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Chai Wan",
        "zipcode": null,
        "website": "http://www.allan.com.hk",
        "market_cap": "Small Cap"
    },
    "0732.HK": {
        "short_name": "TRULY INT'L",
        "long_name": "Truly International Holdings Limited",
        "summary": "Truly International Holdings Limited, an investment holding company, manufactures, sells, and trades in liquid crystal display products and electronic consumer products. It operates through two segments, LCD Products and Electronic Consumer Products. The company offers touch panel products and modules; compact camera modules; personal care products, including electric toothbrushes, blood glucose monitors, and blood pressure monitors; calculators and electronic components; printed and flexible circuit board panels, and plastic injection molding products for various applications; cover lens; health care products; and fingerprint identification modules and electrical devices. It serves in the People's Republic of China, South Korea, Japan, Hong Kong, Europe, and internationally. Truly International Holdings Limited is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.truly.com.hk",
        "market_cap": "Small Cap"
    },
    "0751.HK": {
        "short_name": "SKYWORTH GROUP",
        "long_name": "Skyworth Group Limited",
        "summary": "Skyworth Group Limited, an investment holding company, researches and develops, manufactures, and sells consumer electronic products in People's Republic of China, rest of Asia, Europe, the Middle East, the United States, Oceania, and Africa. It operates through Multimedia Business, Smart Systems Technology Business, and Smart Appliances Business segments. The company offers smart TV systems; home access systems, such as digital set-top boxes; smart white appliances, including refrigerators, washing machines, air conditioners, and kitchen appliances; LCD modules; automotive electronic systems; lighting products; security systems; and other electronic products, as well as internet value-added services. It is also involved in the property development and holding; and trading of consumer electronic products, as well as financing and treasury management activities. In addition, the company engages in the maintenance and repair of home appliances; construction development business; and logistics services, as well as operates industrial parks. It also exports its products. The company was formerly known as Skyworth Digital Holdings Limited and changed its name to Skyworth Group Limited in June 2019. Skyworth Group Limited was founded in 1988 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.skyworth.com",
        "market_cap": "Small Cap"
    },
    "0927.HK": {
        "short_name": "FUJIKON IND",
        "long_name": "Fujikon Industrial Holdings Limited",
        "summary": "Fujikon Industrial Holdings Limited, an investment holding company, designs, manufactures, markets, and trades in electro-acoustic products, accessories, and other electronic products in Hong Kong and Mainland China. It offers Bluetooth headsets, headphones, and active noise cancelling headphones, as well as speaker drivers. The company is also involved in the manufacture and trade of precision metal parts, and packaging materials; and property holding activities. In addition, it provides management services. Fujikon Industrial Holdings Limited was founded in 1982 and is headquartered in Shatin, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.fujikon.com",
        "market_cap": "Small Cap"
    },
    "1143.HK": {
        "short_name": "LINKASIA MEDTEC",
        "long_name": "Link-Asia International MedTech Group Limited",
        "summary": "Link-Asia International MedTech Group Limited, an investment holding company, provides electronics manufacturing services for telecommunications, security, car electronics, home appliances, other consumer, and industrial electronic products. The company operates through four segments: Electronic Manufacturing Services, Distribution of Communications Products, Securities and Other Assets Investment, and Real Estate Supply Chain Services. It is also involved in the trading of personal care products, business telephone systems, and telecommunication products; manufacture and sale of telecommunications and other products, and consumable electronic products; sale of audio equipment; and provision of consultancy services. In addition, the company offers equity investment and property agency services; and real estate advisory and purchase services. It operates in the People's Republic of China, the United States, Switzerland, France, Poland, the United Kingdom, and internationally. The company was formerly known as Link-Asia International Co. Ltd. and changed its name to Link-Asia International MedTech Group Limited in December 2020. Link-Asia International MedTech Group Limited was founded in 1992 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.link-asia.com.hk",
        "market_cap": "Small Cap"
    },
    "FTQ0.F": {
        "short_name": "CHINA FORTUNE HLDG.HD0,01",
        "long_name": "China Fortune Holdings Limited",
        "summary": "China Fortune Holdings Limited, an investment holding company, engages in the distribution and trading of mobile phones and related accessories in the People's Republic of China. The company operates through Mobile Phone Business and Mining Business segments. It also offers telecommunication equipment, wireless solutions, network equipment, software, and other equipment. In addition, the company is involved in the development of marketing and after-sales service network; and mining and processing of celestite, zinc, and lead minerals located in Huangshi City, Hubei Province. Further, it engages in the provision of management services. The company was formerly known as Fortune Telecom Holdings Limited and changed its name to China Fortune Holdings Limited in October 2007. China Fortune Holdings Limited was founded in 1992 and is based in Kwai Chung, Hong Kong. China Fortune Holdings Limited is a subsidiary of Future 2000 Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.fortunetele.com",
        "market_cap": "Small Cap"
    },
    "FUK.F": {
        "short_name": "FUJIKON INDS HLDGS HD-,10",
        "long_name": "Fujikon Industrial Holdings Limited",
        "summary": "Fujikon Industrial Holdings Limited, an investment holding company, designs, manufactures, markets, and trades in electro-acoustic products, accessories, and other electronic products in Hong Kong and Mainland China. It offers Bluetooth headsets, headphones, and active noise cancelling headphones, as well as speaker drivers. The company is also involved in the manufacture and trade of precision metal parts, and packaging materials; and property holding activities. In addition, it provides management services. Fujikon Industrial Holdings Limited was founded in 1982 and is headquartered in Shatin, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://www.fujikon.com",
        "market_cap": "Small Cap"
    },
    "KY5.SG": {
        "short_name": "KIN YAT HOLDINGS LTD. Registere",
        "long_name": "Kin Yat Holdings Limited",
        "summary": "Kin Yat Holdings Limited, an investment holding company, engages in the design, manufacture, sale, and trading of electrical and electronic products, motor drives, encoder films, and other products. The company operates through Electrical and Electronic Products, Motors, and Real Estate Development segments. It designs, develops, manufactures, sells artificial intelligence robotics products, IoT and smart home products, electronic entertainment products, and small home appliances; designs, manufactures, and installs curtain wall systems; trades in toys; sources materials; and holds properties. The company also develops residential and commercial property projects located at Dushan Economic Development Zone. It serves in the United States, Europe, Asia, and internationally. Kin Yat Holdings Limited was founded in 1981 and is headquartered in San Po Kong, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "San Po Kong",
        "zipcode": null,
        "website": "http://www.kinyat.com.hk",
        "market_cap": "Small Cap"
    },
    "KYW.F": {
        "short_name": "SKYWORTH GROUP LTD.HD-,10",
        "long_name": "Skyworth Group Limited",
        "summary": "Skyworth Group Limited, an investment holding company, researches and develops, manufactures, and sells consumer electronic products in People's Republic of China, rest of Asia, Europe, the Middle East, the United States, Oceania, and Africa. It operates through Multimedia Business, Smart Systems Technology Business, and Smart Appliances Business segments. The company offers smart TV systems; home access systems, such as digital set-top boxes; smart white appliances, including refrigerators, washing machines, air conditioners, and kitchen appliances; LCD modules; automotive electronic systems; lighting products; security systems; and other electronic products, as well as internet value-added services. It is also involved in the property development and holding; and trading of consumer electronic products, as well as financing and treasury management activities. In addition, the company engages in the maintenance and repair of home appliances; construction development business; and logistics services, as well as operates industrial parks. It also exports its products. The company was formerly known as Skyworth Digital Holdings Limited and changed its name to Skyworth Group Limited in June 2019. Skyworth Group Limited was founded in 1988 and is headquartered in Quarry Bay, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Quarry Bay",
        "zipcode": null,
        "website": "http://www.skyworth.com",
        "market_cap": "Small Cap"
    },
    "TC2A.F": {
        "short_name": "TCL ELECTRONICS HLDGS HD1",
        "long_name": "TCL Electronics Holdings Limited",
        "summary": "TCL Electronics Holdings Limited, an investment holding company, operates as a consumer electronics company in the People's Republic of China, Europe, North America, and internationally. It operates through four segments: TV; Internet Business; Smart Mobile, Connective Devices, and Service; and Smart Commercial Display, Smart Home, and Other Businesses. The company manufactures and sells color television (TV) sets under the TCL brand; provides advertising, video-on-demand, and membership card services. It also engages in the manufacture and sale of smart mobile, smart connective devices, smart commercial display, smart home products, and other household products; trading of TV products, components, and white goods; research and development of software on smart TV devices, and mobile devices; and operation of the Internet platform, as well as distribution of mobile devices and components. The company was formerly known as TCL Multimedia Technology Holdings Limited and changed its name to TCL Electronics Holdings Limited in June 2018. The company is based in Sha Tin, Hong Kong. TCL Electronics Holdings Limited is a subsidiary of TCL Technology Group Corporation.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://electronics.tcl.com",
        "market_cap": "Small Cap"
    },
    "TCLHF": {
        "short_name": "TCL ELECTRONICS HOLDINGS LTD",
        "long_name": "TCL Electronics Holdings Limited",
        "summary": "TCL Electronics Holdings Limited, an investment holding company, operates as a consumer electronics company in the People's Republic of China, Europe, North America, and internationally. It operates through four segments: TV; Internet Business; Smart Mobile, Connective Devices, and Service; and Smart Commercial Display, Smart Home, and Other Businesses. The company manufactures and sells color television (TV) sets under the TCL brand; provides advertising, video-on-demand, and membership card services. It also engages in the manufacture and sale of smart mobile, smart connective devices, smart commercial display, smart home products, and other household products; trading of TV products, components, and white goods; research and development of software on smart TV devices, and mobile devices; and operation of the Internet platform, as well as distribution of mobile devices and components. The company was formerly known as TCL Multimedia Technology Holdings Limited and changed its name to TCL Electronics Holdings Limited in June 2018. The company is based in Sha Tin, Hong Kong. TCL Electronics Holdings Limited is a subsidiary of TCL Technology Group Corporation.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sha Tin",
        "zipcode": null,
        "website": "http://electronics.tcl.com",
        "market_cap": "Small Cap"
    },
    "TRUHF": {
        "short_name": "TRULY INTERNATIONAL HLDGS",
        "long_name": "Truly International Holdings Limited",
        "summary": "Truly International Holdings Limited, an investment holding company, manufactures, sells, and trades in liquid crystal display products and electronic consumer products. It operates through two segments, LCD Products and Electronic Consumer Products. The company offers touch panel products and modules; compact camera modules; personal care products, including electric toothbrushes, blood glucose monitors, and blood pressure monitors; calculators and electronic components; printed and flexible circuit board panels, and plastic injection molding products for various applications; cover lens; health care products; and fingerprint identification modules and electrical devices. It serves in the People's Republic of China, South Korea, Japan, Hong Kong, Europe, and internationally. Truly International Holdings Limited is headquartered in Kwai Chung, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.truly.com.hk",
        "market_cap": "Small Cap"
    },
    "TRUHY": {
        "short_name": "TRULY INTERNATIONAL HLDGS",
        "long_name": "Truly International Holdings Limited",
        "summary": "Truly International Holdings Limited, an investment holding company, manufactures, sells, and trades in liquid crystal display products and electronic consumer products. It operates through two segments, LCD Products and Electronic Consumer Products. The company offers touch panel products and modules; compact camera modules; personal care products, including electric toothbrushes, blood glucose monitors, and blood pressure monitors; calculators and electronic components; printed and flexible circuit board panels, and plastic injection molding products for various applications; cover lens; health care products; and fingerprint identification modules and electrical devices. It serves in the People's Republic of China, South Korea, Japan, Hong Kong, Europe, and internationally. Truly International Holdings Limited is headquartered in Kwai Chung, Hong Kong.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.truly.com.hk",
        "market_cap": "Small Cap"
    },
    "TYU2.F": {
        "short_name": "TRULY INTL HLDGS  HD-,02",
        "long_name": "Truly International Holdings Limited",
        "summary": "Truly International Holdings Limited, an investment holding company, manufactures, sells, and trades in liquid crystal display products and electronic consumer products. It operates through two segments, LCD Products and Electronic Consumer Products. The company offers touch panel products and modules; compact camera modules; personal care products, including electric toothbrushes, blood glucose monitors, and blood pressure monitors; calculators and electronic components; printed and flexible circuit board panels, and plastic injection molding products for various applications; cover lens; health care products; and fingerprint identification modules and electrical devices. It serves in the People's Republic of China, South Korea, Japan, Hong Kong, Europe, and internationally. Truly International Holdings Limited is headquartered in Kwai Chung, Hong Kong.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.truly.com.hk",
        "market_cap": "Small Cap"
    }
}