{
    "0186.HK": {
        "short_name": "NIMBLE HOLDINGS",
        "long_name": "Nimble Holdings Company Limited",
        "summary": "Nimble Holdings Company Limited, an investment holding company, distributes houseware and audio products in the People's Republic of China, rest of Asia, the United States, Canada, and Europe. The company also holds and licenses brands and trademarks, such as Akai, Sansui, and Nakamichi worldwide. In addition, it trades in household appliances, wires, and cables; provides management, corporate finance, and information technology system development and related services; and engages in the property development and operation activities. The company was formerly known as The Grande Holdings Limited and changed its name to Nimble Holdings Company Limited in February 2018. The company is based in Tsuen Wan, Hong Kong. Nimble Holdings Company Limited is a subsidiary of Wealth Warrior Global Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.nimbleholding.com",
        "market_cap": "Small Cap"
    },
    "0471.HK": {
        "short_name": "CMMB VISION",
        "long_name": "CMMB Vision Holdings Limited",
        "summary": "CMMB Vision Holdings Limited, an investment holding company, engages in the convergent mobile multimedia broadcasting (CMMB) business in the United States and Taiwan. The company operates through CMMB Business and Trading Business segments. It delivers digital mobile television (TV) and multimedia contents through terrestrial and satellite networks directly to mobile and wireless devices, such as smartphones, tablets, pocket TVs, laptops, automobile digital receivers, and personal media players. The company also engages in the free-to-air digital TV programming activities; and procurement and distribution of PCB materials. In addition, it provides convergent satellite-mobile multimedia infotainment broadcasting services. The company was formerly known as Global Flex Holdings Limited and changed its name to CMMB Vision Holdings Limited in May 2010. CMMB Vision Holdings Limited was incorporated in 2004 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cmmbvision.com",
        "market_cap": "Nano Cap"
    },
    "0854.HK": {
        "short_name": "WILLAS-ARRAY",
        "long_name": "Willas-Array Electronics (Holdings) Limited",
        "summary": "Willas-Array Electronics (Holdings) Limited, an investment holding company, distributes electronic components for industrial, audio and video, telecommunication, home appliances, lighting, electronic manufacturing, and automotive segments. The company distributes automotive, infotainment, internet of things, motor control, SMPS, smart LED products, etc. It also provides technical solutions, including wireless module, automotive, motor control, smart meter, white goods, power/LED lighting, and audio solutions. In addition, the company engages in the property holding activities; and provision of transportation, and management and consultancy services. The company operates in the Northern China Region, Southern China Region, and Taiwan. Willas-Array Electronics (Holdings) Limited was founded in 1981 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.willas-array.com",
        "market_cap": "Nano Cap"
    },
    "0856.HK": {
        "short_name": "VSTECS",
        "long_name": "VSTECS Holdings Limited",
        "summary": "VSTECS Holdings Limited, an investment holding company, develops information technology (IT) product channel and provides technical solution integration services in North Asia and South East Asia. It operates through three segments: Enterprise Systems, Consumer Electronics, and Cloud Computing. The Enterprise Systems segment provides enterprise system tools, such as middleware, operating systems, Unix/NT servers, databases, and storage equipment for IT infrastructure; and IT infrastructure design and implementation, training, maintenance, and support services. The Consumer Electronics segment offers finished IT products, including computers, mobile phones, drones, smart sports watches, 3D printers, game consoles, etc. The Cloud Computing segment provides cloud computing solutions and services. The company is also involved in the retail of IT products, equipment, and accessories; import and export of IT products; and provision of supply chains management and warehouse transport, electronic settlement business center, and project investment and marketing research services. It serves individuals, small and medium enterprises, large corporations, and government entities through a distribution network of resellers comprising retailers, system integrators, and corporate dealers. The company was formerly known as VST Holdings Limited and changed its name to VSTECS Holdings Limited in June 2017. VSTECS Holdings Limited was founded in 1991 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.vstecs.com",
        "market_cap": "Small Cap"
    },
    "0997.HK": {
        "short_name": "CHINLINK INTL",
        "long_name": "Chinlink International Holdings Limited",
        "summary": "Chinlink International Holdings Limited, an investment holding company, engages in the trading of consumer goods and electronic products in the People's Republic of China. It also trades in furniture and fixtures, and chinese medicine; and provides interior decoration, logistics, finance lease and guarantee, and advisory services. In addition, the company is involved in the property investment business, including the leasing of properties; and provision of property management and asset management services. Further, it offers corporate financing guarantee services and related consultancy services; factoring; and supply chain finance to small and medium-sized enterprises. The company was formerly known as Decca Holdings Limited and changed its name to Chinlink International Holdings Limited in February 2012. The company was founded in 1973 and is headquartered in Central, Hong Kong. Chinlink International Holdings Limited is a subsidiary of Wealth Keeper International Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.chinlinkint.com",
        "market_cap": "Nano Cap"
    },
    "1213.HK": {
        "short_name": "MOBICON GROUP",
        "long_name": "Mobicon Group Limited",
        "summary": "Mobicon Group Limited, an investment holding company, trades in and distributes electronic components, automation parts, and equipment in Hong Kong and other Asia-Pacific countries, South Africa, Europe, and internationally. The company operates through three segments: Electronic Trading Business, Computer Business, and Cosmetic and Online Retail Business. It is also involved in the trading and distribution, and retail of computer products, smartphone accessories, and consumer products; and provision of information technology outsourcing and solution services. In addition, the company trades in, distributes, and retails cosmetic products through a network of 10 retail shops, as well as online channels. Mobicon Group Limited offers its products under the brand name of MOBICON, VideoCom, APower, and wishh brand names. Mobicon Group Limited was founded in 1983 and is based in San Po Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "San Po Kong",
        "zipcode": null,
        "website": "http://www.mobicon.com",
        "market_cap": "Nano Cap"
    },
    "1632.HK": {
        "short_name": "MSCTECH",
        "long_name": "Minshang Creative Technology Holdings Limited",
        "summary": "Minshang Creative Technology Holdings Limited operates a chain of restaurants. It operates through two segments, Vietnamese-Style Restaurant Business and Trading Business. As of March 31, 2020, the company operated 15 restaurants under the Viet's Choice brand name, and 1 restaurant under the Five Spice brand name in Hong Kong. It also trades in 3C electronic products, including smartphones; frozen foods, including dumplings, glutinous rice balls, seafood, and agricultural products, as well as meat, such as poultry, pork, beef, and lamb; and grains and oil products in the People's Republic of China. The company was formerly known as Food Wise Holdings Limited and changed its name to Minshang Creative Technology Holdings Limited in October 2018. The company was founded in 2003 and is headquartered in Admiralty, Hong Kong. Minshang Creative Technology Holdings Limited is a subsidiary of MSEC Holdings Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.minshangct.com",
        "market_cap": "Micro Cap"
    },
    "2302.HK": {
        "short_name": "CNNC INT'L",
        "long_name": "CNNC International Limited",
        "summary": "CNNC International Limited, an investment holding company, explores for and trades in mineral properties in Mongolia and the People's Republic of China. It operates through Trading of Mineral Property, Exploration and Selling of Mineral Properties, and Supply Chain segments. The company holds interests in uranium projects located in Mongolia. It also sells electronics and other products, including liquid crystal displays, flash drives, memory cards, metal raw materials, etc.; and offers supply chain services. The company was formerly known as United Metals Holdings Limited and changed its name to CNNC International Limited in August 2008. The company was incorporated in 2002 and is headquartered in Hong Kong, Hong Kong. CNNC International Limited is a subsidiary of CNNC Overseas Uranium Holding Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cnncintl.com",
        "market_cap": "Micro Cap"
    },
    "3991.HK": {
        "short_name": "CHANGHONG JH",
        "long_name": "Changhong Jiahua Holdings Limited",
        "summary": "Changhong Jiahua Holdings Limited, an investment holding company, distributes information technology (IT) consumer products, IT corporate products, and other products in the People's Republic of China. The company's IT Consumer Products segment distributes personal computers, digital products, and IT accessories. Its IT Corporate Products segment distributes storage products, minicomputers, networking products, personal computer servers, intelligent building management system products, and unified communication and contact center products. The company's Others segment distributes smartphones; develops own brand products, such as mobile location-based service products; sells warranty packages; and provides professional integrated IT solutions and services. The company was formerly known as China Data Broadcasting Holdings Limited and changed its name to Changhong Jiahua Holdings Limited in January 2013. Changhong Jiahua Holdings Limited is headquartered in Central, Hong Kong. Changhong Jiahua Holdings Limited is a subsidiary of Sichuan Changhong Electronic Co., Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://en.changhongit.com",
        "market_cap": "Micro Cap"
    },
    "6036.HK": {
        "short_name": "APEX ACE HLDG",
        "long_name": "Apex Ace Holding Limited",
        "summary": "Apex Ace Holding Limited, an investment holding company, distributes semiconductors and other electronic components the People's Republic of China and internationally. The company operates through two segments: Digital Storage Products and General Components. It supplies digital storage products, including DRAM, flash, and MCP memory products for multimedia and mobile devices, such as set-top boxes, smart TVs, wearables devices, mobile phones, etc. The company also offers general electronic components comprising switches, connectors, passive components, main chips, sensors, power semiconductors, and analog-to-digital converters for use in the mobile and multimedia devices. In addition, it provides property holding, technical development, and related supporting services, as well as sells computer hardware and software, and accessories. The company was founded in 2005 and is headquartered in Kowloon, Hong Kong. Apex Ace Holding Limited is a subsidiary of Best Sheen Limited.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kowloon",
        "zipcode": null,
        "website": "http://apexace.com",
        "market_cap": "Nano Cap"
    },
    "BDR.SI": {
        "short_name": "Willas-Array",
        "long_name": "Willas-Array Electronics (Holdings) Limited",
        "summary": "Willas-Array Electronics (Holdings) Limited, an investment holding company, distributes electronic components for industrial, audio and video, telecommunication, home appliances, lighting, electronic manufacturing, and automotive segments. The company distributes automotive, infotainment, internet of things, motor control, SMPS, smart LED products, etc. It also provides technical solutions, including wireless module, automotive, motor control, smart meter, white goods, power/LED lighting, and audio solutions. In addition, the company engages in the property holding activities; and provision of transportation, and management and consultancy services. The company operates in the Northern China Region, Southern China Region, and Taiwan. Willas-Array Electronics (Holdings) Limited was founded in 1981 and is headquartered in Kwai Chung, Hong Kong.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.willas-array.com",
        "market_cap": "Nano Cap"
    },
    "U7MA.F": {
        "short_name": "CNNC INTL LTD  HD -,01",
        "long_name": "CNNC International Limited",
        "summary": "CNNC International Limited, an investment holding company, explores for and trades in mineral properties in Mongolia and the People's Republic of China. It operates through Trading of Mineral Property, Exploration and Selling of Mineral Properties, and Supply Chain segments. The company holds interests in uranium projects located in Mongolia. It also sells electronics and other products, including liquid crystal displays, flash drives, memory cards, metal raw materials, etc.; and offers supply chain services. The company was formerly known as United Metals Holdings Limited and changed its name to CNNC International Limited in August 2008. The company was incorporated in 2002 and is headquartered in Hong Kong, Hong Kong. CNNC International Limited is a subsidiary of CNNC Overseas Uranium Holding Limited.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.cnncintl.com",
        "market_cap": "Micro Cap"
    }
}