{"0076.HK": {"short_name": "ELATE HOLDINGS", "long_name": "Elate Holdings Limited", "summary": "Elate Holdings Limited, an investment holding company, manufactures and sells graphite products worldwide. It also provides electronic products to the medical, defense, transportation, aerospace, security, maritime, natural gas, and other sectors. In addition, the company is involved in securities trading, properties investment; and oil properties subletting. Further, it develops a cultural industry business and multi-media products, including making movies, TV shows, and Internet programs. The company was formerly known as South Sea Petroleum Holdings Limited and changed its name to Elate Holdings Limited in October 2019. Elate Holdings Limited is based in Central, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0117.HK": {"short_name": "TIANLI HOLDINGS", "long_name": "Tianli Holdings Group Limited", "summary": "Tianli Holdings Group Limited, an investment holding company, manufactures and sells multi-layer ceramic chips (MLCC) in Mainland China, Hong Kong, and internationally. It operates through three segments: Manufacture and Sale of MLCC, Investment and Financial Services, and Other General Trading. The company also offers investment and financial services, including direct investments in debt and equity assets; asset and fund management; financial advisory services; and financial technologies. In addition, it trades in electronic components and commodities, such as metals, minerals, and petroleum products, as well as holds properties. The company was formerly known as EYANG Holdings (Group) Co., Limited and changed its name to Tianli Holdings Group Limited in July 2016. Tianli Holdings Group Limited was incorporated in 2007 and is headquartered in Admiralty, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Admiralty"}, "0259.HK": {"short_name": "YEEBO (INT'L H)", "long_name": "Yeebo (International Holdings) Limited", "summary": "Yeebo (International Holdings) Limited, an investment holding company, manufactures, trades in, and sells liquid crystal displays (LCDs) and liquid crystal displays modules (LCMs). The company operates through four segments: LCDs, LCMs, LCD-Related Products, and LCD-Related Optical Products. It also offers thin film transistor modules, capacitive touch panels, and organic light-emitting diode display products; and manufactures and trades in aluminum electrolytic capacitors. The company serves customers in the electronic market sectors comprising automotive indumenta, telecommunications, and medical equipment, as well as electronic consumable products, including audio, white products, watches, and electronic notebooks. It operates in Hong Kong and Mainland China; Japan, Taiwan, and other Asian countries; the United States; Germany, Spain, and other European countries; and internationally. The company was founded in 1988 and is headquartered in Kwai Chung, Hong Kong. Yeebo (International Holdings) Limited is a subsidiary of Antrix Investment Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwai Chung"}, "0710.HK": {"short_name": "BOE VARITRONIX", "long_name": "BOE Varitronix Limited", "summary": "BOE Varitronix Limited, an investment holding company, designs, manufactures, and sells liquid crystal display and related products in the People's Republic of China, Europe, the United States, South Korea, and internationally. It primarily provides thin film transistor modules. The company offers display products for use in automotive applications in audio/navigation, passive display audio, cluster, passive display cluster, E-mirror, HUD, and customized display products; and products for use in industrial applications in white goods, medical equipment, and other products. It also engages in property holding; and marketing and sales consulting activities. The company was formerly known as Varitronix International Limited and changed its name to BOE Varitronix Limited in July 2017. BOE Varitronix Limited was founded in 1978 and is headquartered in Kwun Tong, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "0833.HK": {"short_name": "ALLTRONICS", "long_name": "Alltronics Holdings Limited", "summary": "Alltronics Holdings Limited, an investment holding company, manufactures and trades in electronic products, plastic moulds, and plastics and other components for electronic products primarily in the United States, Hong Kong, Europe, Mainland China, and internationally. The company operates through three segments: Electronic Products, Biodiesel Products, and Energy Saving Business. It engages in the research, development, manufacture, and sale of home improvement electronic products, including irrigation controllers, carbon monoxide detectors, audio equipment, smart cards and readers, radio-controlled clocks and clock movement units, and battery chargers. The company also offers electronic product components, such as solenoids, conventional adapters, and transformers. In addition, it is involved in trading of biodiesel products, and the provision of energy saving business solutions, including energy efficient gas stoves. The company was founded in 1993 and is headquartered in Hong Kong. Alltronics Holdings Limited is a subsidiary of Profit International Holdings Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "0889.HK": {"short_name": "DATRONIX HOLD", "long_name": "Datronix Holdings Limited", "summary": "Datronix Holdings Limited, an investment holding company, manufactures and trades in electronic components. The company designs, manufactures, and sells magnetics that are used in consumer electronics, data processing appliances, and other electronics systems for coupling, isolation, filtering, interfacing, and timing control applications. It offers standard and customized magnetic components for various products, including transformers, LAN filter modules, digital delay modules, inductors/chokes, and ASDL transformers; planar magnetics; magnetics for aviation applications, hybrid network assemblies, power conversion, energy savings, medical devices/equipment, Internet equipment, and data acquisition/transmitter and signal conditioning; and magnetics components for DC/DC converters. The company also trades in electronic components; and holds properties. It serves telecommunications, communications, aerospace, instrumentation, industrial equipment, computers and networking, Internet equipment, medical devices/equipment, and automotive markets. The company sells its products under the Datatronics brand name. It operates in the People's Republic of China, the United States, Vietnam, Europe, and internationally. The company was incorporated in 2000 and is headquartered in North Point, Hong Kong. Datronix Holdings Limited is a subsidiary of Onboard Technology Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "North Point"}, "1611.HK": {"short_name": "HUOBI TECH", "long_name": "Huobi Technology Holdings Limited", "summary": "Huobi Technology Holdings Limited, an investment holding company, manufactures and sells power-related and electrical/electronic products. It offers electronic power supplies; battery chargers; coils; solenoids; and optical products, including LED lighting, as well as technology solution services. The company also provides data center related services, such as data storage and backup; data center operation and maintenance; and cloud-related services comprising cloud migration, environment construction, and introduction support services for Amazon Web Service and other cloud services. In addition, it offers after-sales support, management, management consultancy, asset management, and consulting/property holding services. Further, the company provides network technical support, technical consultancy, and information technical services. It operates in the People's Republic of China, the United Kingdom, the United States, Japan, Europe, and internationally. The company was formerly known as Pantronics Holdings Limited and changed its name to Huobi Technology Holdings Limited in October 2019. Huobi Technology Holdings Limited was founded in 1983 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1639.HK": {"short_name": "AKM INDUSTRIAL", "long_name": "AKM Industrial Company Limited", "summary": "AKM Industrial Company Limited, an investment holding company, manufactures and sells flexible printed circuits (FPC), flexible packaging substrates, and related components in the People's Republic of China, Hong Kong, and internationally. It provides various FPC materials, including single-sided, double-sided, multi-layer FPC, rigid flex board FPC, etc. for use in various consumer electronics, such as mobile phones, cameras, notebooks, printer e-books, etc., as well as to optic-fiber communication infrastructure modules, medical devices, and automotive industries. The company also sources and sells electronic components, as well as trades in raw materials and FPCs. In addition, it offers semiconductor testing and assembly services. The company was founded in 1993 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1888.HK": {"short_name": "KB LAMINATES", "long_name": "Kingboard Laminates Holdings Limited", "summary": "Kingboard Laminates Holdings Limited, an investment holding company, operates as a vertically-integrated electronic materials manufacturer in the People's Republic of China, other Asian countries, Europe, and America. The company manufactures and sells laminates, including glass epoxy laminates, paper laminates, and composite epoxy material laminates. It also provides upstream component materials, such as copper foils, glass yarn, glass fabrics, bleached Kraft paper, epoxy resin, Kraft paper for copper-clad laminates, and polyvinyl butyral products, as well as chemicals; and offers drilling services. In addition, the company invests in and rents properties; and provides hotel accommodation services, and food and beverage and other ancillary services. Its investment property portfolio comprises commercial, residential, and industrial properties. The company is headquartered in Shatin, Hong Kong. Kingboard Laminates Holdings Limited is a subsidiary of Jamplan (BVI) Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sha Tin"}, "2363.HK": {"short_name": "TONGDA HONG TAI", "long_name": "Tongda Hong Tai Holdings Limited", "summary": "Tongda Hong Tai Holdings Limited, an investment holding company, manufactures and sells casings for notebook and tablet in Mainland China. It also offers accessories for electrical appliance products. The company was founded in 2010 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "2788.HK": {"short_name": "YORKEY OPTICAL", "long_name": "Yorkey Optical International (Cayman) Ltd.", "summary": "Yorkey Optical International (Cayman) Ltd., an investment holding company, manufactures and sells plastic and metallic parts, components of optical and opto-electronic products, and molds and cases in Japan, the People's Republic of China, and internationally. Its precision processing products include pressing molds; pressing parts of micro motors; processing components of cameras, and electronic and optical products; and processing components of lead wires, etc. The company also offers plastic injection molding products, such as plastic components of cameras, video cameras, audio products, office machines, microscopes, CD-ROMs, HDDs and FDDs, game players, range finders, binoculars, electronic locks, micro motors, cellular phones, beep pagers, and battery chargers, as well as their components; and precision tooling molds and metal pressing molds for cameras, office machines, optical instruments, etc. In addition, it is involved in the printing and painting of components for cameras, copiers, optical instruments, computer HDDs and FDDs, and other communication equipment; and provision of soft/hard cases and wrist/shoulder strips for photographic equipment, as well as cases for portable computers, mobile phones, and optical appliances. Further, the company provides technical training and after-sales services, as well as holds properties. Yorkey Optical International (Cayman) Ltd. was founded in 1995 and is based in Shatin, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sha Tin"}, "4EY.F": {"short_name": "TIANLI HLDGS GRP CO.", "long_name": "Tianli Holdings Group Limited", "summary": "Tianli Holdings Group Limited, an investment holding company, manufactures and sells multi-layer ceramic chips (MLCC) in Mainland China, Hong Kong, and internationally. It operates through three segments: Manufacture and Sale of MLCC, Investment and Financial Services, and Other General Trading. The company also offers investment and financial services, including direct investments in debt and equity assets; asset and fund management; financial advisory services; and financial technologies. In addition, it trades in electronic components and commodities, such as metals, minerals, and petroleum products, as well as holds properties. The company was formerly known as EYANG Holdings (Group) Co., Limited and changed its name to Tianli Holdings Group Limited in July 2016. Tianli Holdings Group Limited was incorporated in 2007 and is headquartered in Admiralty, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Admiralty"}, "8070.HK": {"short_name": "KEEN OCEAN", "long_name": "Keen Ocean International Holding Limited", "summary": "Keen Ocean International Holding Limited, an investment holding company, designs, develops, manufactures, trades in, and sells transformers, switching mode power supplies, enameled copper wires, electronic parts and components, electric healthcare products, and inverters. The company offers toroidal and EI transformers; chokes, coils, and inductors; and original equipment manufacturer (OEM) products, such as OEM chargers, emergency ballasts, exit signs, handheld controllers, OEM PCB assemblies, and SMPS open flames. It is also involved in Construction and investment activities. The company sells its power supply products under the Keen Ocean brand name. It primarily serves manufacturers and trading entities. The company operates in Hong Kong, the People's Republic of China, Europe, the United States, and internationally. The company was founded in 2000 and is headquartered in Tsuen Wan, Hong Kong. Keen Ocean International Holding Limited is a subsidiary of Cyber Goodie Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "8113.HK": {"short_name": "HI-LEVEL TECH", "long_name": "Hi-Level Technology Holdings Limited", "summary": "Hi-Level Technology Holdings Limited, an independent design house (IDH), engages in the sale of electronic components in the People's Republic of China, Hong Kong, Taiwan, Korea, and internationally. It offers integrated circuit and panels for consumer electronic products, such as mobile Internet devices, electronic learning aids, multi-media players, smartphone panel modules, set-top boxes, video image devices, tablets, CVRs, Wi-Fi modules and connectors, digital cameras, sport and drone cameras, e-books, wearable devices, and other products. The company offers its IDH services to original design manufacturers and original brand manufacturers. Hi-Level Technology Holdings Limited was founded in 2000 and is based in Hung Hom, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hung Hom"}, "8150.HK": {"short_name": "SEAMLESS GREEN", "long_name": "Seamless Green China (Holdings) Limited", "summary": "Seamless Green China (Holdings) Limited, an investment holding company, manufactures and trades in LED and related products in the People's Republic of China, Hong Kong, and the Philippines. The company operates through LED, Optoelectronic, Liquor, and Sapphire segments. It supplies optoelectronic products and watch crystals for use in the watch products. The company also engages in the trading of wine and optoelectronic products; and property investment activities. Seamless Green China (Holdings) Limited was incorporated in 2001 and is headquartered in Sheung Wan, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sheung Wan"}, "8249.HK": {"short_name": "RUIYUAN IC TECH", "long_name": "Zhejiang RuiYuan Intelligent Control Technology Company Limited", "summary": "Zhejiang RuiYuan Intelligent Control Technology Company Limited designs, manufactures, and sells intelligent controller systems for consumer electrical and electronic appliances in the People's Republic of China. It is also involved in the original equipment manufacturing and electronic subassembly activities; and trade of electronic components, industrial electronic intelligent control equipment, and electronic automation digital control systems. The company was formerly known as Ningbo WanHao Holdings Company Limited and changed its name to Zhejiang RuiYuan Intelligent Control Technology Company Limited in January 2017. The company is based in Wan Chai, Hong Kong. Zhejiang RuiYuan Intelligent Control Technology Company Limited is a subsidiary of Zhejiang Ruiyuan Intelligent Robot Company Limited.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "9188.TW": {"short_name": "YORKEY OPTICAL INTERNATIONAL", "long_name": "Yorkey Optical International (Cayman) Ltd.", "summary": "Yorkey Optical International (Cayman) Ltd., an investment holding company, manufactures and sells plastic and metallic parts, components of optical and opto-electronic products, and molds and cases in Japan, the People's Republic of China, and internationally. Its precision processing products include pressing molds; pressing parts of micro motors; processing components of cameras, and electronic and optical products; and processing components of lead wires, etc. The company also offers plastic injection molding products, such as plastic components of cameras, video cameras, audio products, office machines, microscopes, CD-ROMs, HDDs and FDDs, game players, range finders, binoculars, electronic locks, micro motors, cellular phones, beep pagers, and battery chargers, as well as their components; and precision tooling molds and metal pressing molds for cameras, office machines, optical instruments, etc. In addition, it is involved in the printing and painting of components for cameras, copiers, optical instruments, computer HDDs and FDDs, and other communication equipment; and provision of soft/hard cases and wrist/shoulder strips for photographic equipment, as well as cases for portable computers, mobile phones, and optical appliances. Further, the company provides technical training and after-sales services, as well as holds properties. Yorkey Optical International (Cayman) Ltd. was founded in 1995 and is based in Shatin, Hong Kong.", "currency": "TWD", "sector": "Technology", "industry": "Electronic Components", "exchange": "TAI", "market": "tw_market", "country": "Hong Kong", "city": "Sha Tin"}, "9918.HK": {"short_name": "WISE ALLY INTL", "long_name": "Wise Ally International Holdings Limited", "summary": "Wise Ally International Holdings Limited, through its subsidiaries, manufactures and sells of electronic products. The company provides a range of services, including design development and enhancement, technical advice and engineering solution, selection and procurement of materials, production, quality control, and logistics management solutions. It's manufacturing services include printed circuit board assembly, multifunctional modules, and finished electronic products for a range of product applications, such as vapour products; appliances; commercial controls; and heating, ventilation and air-conditionings. The company also trades in electronic products. Wise Ally International Holdings Limited was founded in 1978 and is headquartered in Kowloon Bay, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Electronic Components", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "CIOC.F": {"short_name": "CHINA AEROSPACE NEW", "long_name": "China Aerospace International Holdings Limited", "summary": "China Aerospace International Holdings Limited, an investment holding company, engages in hi-tech manufacturing business in the People's Republic of China. The company distributes plastic and metal products and molds, liquid crystal displays and modules, printed circuit boards, intelligent battery chargers, and electronic components. It is also involved in the provision of property investment and management, treasury, and warehouse and logistics services; electroplating of metals; distribution of packing products; and development and sale of software and related products. The company is based in Hung Hom, Hong Kong, and is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Hung Hom"}, "IMTE": {"short_name": "Integrated Media Technology Lim", "long_name": "Integrated Media Technology Limited", "summary": "Integrated Media Technology Limited develops, sells, and distributes 3D autostereoscopic display (ASD) technology products and services in Australia, Hong Kong, and China. It offers 3D conversion equipment and software; ASD video walls, ASD digital signage displays, ASD PC monitors, and ASD mobile phones and tablets; and 2D/3D content management and distribution systems. The company also provides 3D super workstations for content conversion of 2D videos to 3D mode for the TV and movie industry; and VisuMotion, a set of software designed for 2D to 3D conversion, as well as 3D content creation. In addition, it sells and distributes switchable glasses; and offers 3D consultancy, management, and trading services. The company was formerly known as China Integrated Media Corporation Limited and changed its name to Integrated Media Technology Limited in October 2016. The company was incorporated in 2008 and is headquartered in Wan Chai, Hong Kong. Integrated Media Technology Limited is a subsidiary of Marvel Finance Limited.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NCM", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "KLN.F": {"short_name": "KINGB.LAMINATES H. HD-,10", "long_name": "Kingboard Laminates Holdings Limited", "summary": "Kingboard Laminates Holdings Limited, an investment holding company, operates as a vertically-integrated electronic materials manufacturer in the People's Republic of China, other Asian countries, Europe, and America. The company manufactures and sells laminates, including glass epoxy laminates, paper laminates, and composite epoxy material laminates. It also provides upstream component materials, such as copper foils, glass yarn, glass fabrics, bleached Kraft paper, epoxy resin, Kraft paper for copper-clad laminates, and polyvinyl butyral products, as well as chemicals; and offers drilling services. In addition, the company invests in and rents properties; and provides hotel accommodation services, and food and beverage and other ancillary services. Its investment property portfolio comprises commercial, residential, and industrial properties. The company is headquartered in Shatin, Hong Kong. Kingboard Laminates Holdings Limited is a subsidiary of Jamplan (BVI) Limited.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Sha Tin"}, "LTSC": {"short_name": "LIGHTSCAPE TECHNOLOGIES INC", "long_name": "Lightscape Technologies, Inc.", "summary": "Lightscape Technologies, Inc., through its subsidiaries, develops digital media and light-emitting diode (LED) solutions in Asia. The company designs, installs, and operates digital out-of-home LED billboards and LCD screens; and markets advertising space on its digital out-of-home media network to advertisers. It also designs and installs LED systems, including LED hardware components for interior and exterior applications in hospitality, entertainment, retail, high-end residential, architectural, and special exhibits markets. In addition, the company manufactures original equipment, as well as licenses its digital controller software product primarily to LED manufacturers and LED system designers. Further, it rents LED-based hardware, such as LED video panels and LED video walls, as well as individual LED fixtures, LED flood lights, and spotlights primarily for corporate events, advertising companies, television and film productions, government, and live-performance markets. Lightscape Technologies, Inc. was formerly known as Global Innovative Systems Inc. and changed its name to Lightscape Technologies, Inc. in April 2007. The company was incorporated in 1995 and is based in Wan Chai, Hong Kong with additional offices in China and Macau.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "TJC.F": {"short_name": "TONGDA GROUP HLDGS HD-,01", "long_name": "Tongda Group Holdings Limited", "summary": "Tongda Group Holdings Limited, an investment holding company, provides high-precision components for smart mobile communications and consumer electronic products in People's Republic of China, rest of Asia Pacific, the United States, and internationally. The company operates through Handset Casings and High-Precision Components; Smart Electrical Appliances Casings; Household and Sports Goods; and Network Communications Facilities and Others segments. The Handset Casings and High-Precision Components segment provides various handset casings, tri-proof high precision components, high-precision insert molding parts, and high-precision rubber molding parts. The Smart Electrical Appliances Casings segment manufactures and sells control panels; and metal accessories and casings for electrical appliances, as well as smart home appliances that include air-conditioners, washing machines, and refrigerators. The Household and Sports Goods segment offers durable household goods and utensils, and sports goods. The Network Communications Facilities and Others segment produces set-top box casings and interior decorations for automotive. The company is also involved in the manufacture and sale of resistors; accessories for electrical appliance products; and precise and plastic injection, and printing parts. In addition, it engages in the trading of electrical appliance and ironware products. Tongda Group Holdings Limited was founded in 1978 and is headquartered in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "VTX.F": {"short_name": "BOE VARITRONIX  HD-,25", "long_name": "BOE Varitronix Limited", "summary": "BOE Varitronix Limited, an investment holding company, designs, manufactures, and sells liquid crystal display and related products in the People's Republic of China, Europe, the United States, South Korea, and internationally. It primarily provides thin film transistor modules. The company offers display products for use in automotive applications in audio/navigation, passive display audio, cluster, passive display cluster, E-mirror, HUD, and customized display products; and products for use in industrial applications in white goods, medical equipment, and other products. It also engages in property holding; and marketing and sales consulting activities. The company was formerly known as Varitronix International Limited and changed its name to BOE Varitronix Limited in July 2017. BOE Varitronix Limited was founded in 1978 and is headquartered in Kwun Tong, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kwun Tong"}, "YIH.F": {"short_name": "YEEBO INTL HLDGS HD 0,20", "long_name": "Yeebo (International Holdings) Limited", "summary": "Yeebo (International Holdings) Limited, an investment holding company, manufactures, trades in, and sells liquid crystal displays (LCDs) and liquid crystal displays modules (LCMs). The company operates through four segments: LCDs, LCMs, LCD-Related Products, and LCD-Related Optical Products. It also offers thin film transistor modules, capacitive touch panels, and organic light-emitting diode display products; and manufactures and trades in aluminum electrolytic capacitors. The company serves customers in the electronic market sectors comprising automotive indumenta, telecommunications, and medical equipment, as well as electronic consumable products, including audio, white products, watches, and electronic notebooks. It operates in Hong Kong and Mainland China; Japan, Taiwan, and other Asian countries; the United States; Germany, Spain, and other European countries; and internationally. The company was founded in 1988 and is headquartered in Kwai Chung, Hong Kong. Yeebo (International Holdings) Limited is a subsidiary of Antrix Investment Limited.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Kwai Chung"}}