{"0085.HK": {"short_name": "CE HUADA TECH", "long_name": "China Electronics Huada Technology Company Limited", "summary": "China Electronics Huada Technology Company Limited, an investment holding company, designs, produces, and sells integrated circuit chips in the People's Republic of China. Its products are primarily used in RFID, ID cards, social security cards, fuel cards, telecommunication cards, electric cards, transportation cards, wireless networks equipment, etc. The company was formerly known as China Electronics Corporation Holdings Company Limited and changed its name to China Electronics Huada Technology Company Limited in August 2017. The company is based in Wanchai, Hong Kong. China Electronics Huada Technology Company Limited is a subsidiary of Huada Semiconductor Co., Ltd. The company is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductors", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0243.HK": {"short_name": "QPL INT'L", "long_name": "QPL International Holdings Limited", "summary": "QPL International Holdings Limited, an investment holding company, manufactures and sells integrated circuit leadframes, heatsinks, stiffeners, and related products for semiconductor enterprises. Its products include small outline integrated circuits, quad flat packages, thin quad flat packages, plastic dual in to packages, plastic leaded chip carriers, thin small outline packages, and thermal enhanced products, as well as HD-BU, HDL, and QFN products. The company also trades in securities; invests in properties; and distributes stamped leadframes and molds, as well as provides financial assistance and advance services. It primarily serves customers in the United States, Hong Kong, Europe, the People's Republic of China, the Philippines, Malaysia, Singapore, and Thailand. The company was founded in 1982 and is headquartered in Tsuen Wan, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductors", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "1010.HK": {"short_name": "PACRAY INT'L", "long_name": "PacRay International Holdings Limited", "summary": "PacRay International Holdings Limited, an investment holding company, designs, distributes, and trades in integrated circuits and semiconductor parts. The company offers agency services related to integrated circuits and semiconductor parts. Its integrated circuits are used in industrial and household measuring tools and display products. In addition, the company offers finance leasing and money lending services; aircraft business management and yacht management services; and distributes and sells construction materials. It has operations in the People's Republic of China, Hong Kong, and Taiwan. The company was formerly known as PacMOS Technologies Holdings Limited and changed its name to PacRay International Holdings Limited in December 2015. PacRay International Holdings Limited is based in Central, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductors", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "2878.HK": {"short_name": "SOLOMON SYSTECH", "long_name": "Solomon Systech (International) Limited", "summary": "Solomon Systech (International) Limited, an investment holding company, operates as a fabless semiconductor company worldwide. The company primarily designs, develops, and sells display integrated circuits (IC) products and system solutions. It offers advanced display products, including passive matrix organic light emitting diode (PMOLED) display ICs; active matrix organic light emitting diode (AMOLED) display ICs; organic light emitting diode (OLED) display and lighting driver ICs; and bistable display and driver ICs. The company also provides large display products, such as large panel thin film transistor (TFT) liquid crystal display (LCD) driver ICs; and other products, including mobile display and mobile touch ICs. Its products enable a range of display and touch applications for smartphones, tablets, smart TVs/monitors, notebooks, and other smart devices, including wearables, healthcare devices, and smart home devices, as well as industrial appliances, etc. In addition, the company provides market research services; and customized IC design services, such as analog, mixed-signal, and high-voltage IC design services. Solomon Systech (International) Limited was founded in 1999 and is headquartered in Shatin, Hong Kong.", "currency": "HKD", "sector": "Technology", "industry": "Semiconductors", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sha Tin"}, "RZF.F": {"short_name": "SOLOMON SYSTECH INTL", "long_name": "Solomon Systech (International) Limited", "summary": "Solomon Systech (International) Limited, an investment holding company, operates as a fabless semiconductor company worldwide. The company primarily designs, develops, and sells display integrated circuits (IC) products and system solutions. It offers advanced display products, including passive matrix organic light emitting diode (PMOLED) display ICs; active matrix organic light emitting diode (AMOLED) display ICs; organic light emitting diode (OLED) display and lighting driver ICs; and bistable display and driver ICs. The company also provides large display products, such as large panel thin film transistor (TFT) liquid crystal display (LCD) driver ICs; and other products, including mobile display and mobile touch ICs. Its products enable a range of display and touch applications for smartphones, tablets, smart TVs/monitors, notebooks, and other smart devices, including wearables, healthcare devices, and smart home devices, as well as industrial appliances, etc. In addition, the company provides market research services; and customized IC design services, such as analog, mixed-signal, and high-voltage IC design services. Solomon Systech (International) Limited was founded in 1999 and is headquartered in Shatin, Hong Kong.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductors", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Sha Tin"}, "SIMO": {"short_name": "Silicon Motion Technology Corpo", "long_name": "Silicon Motion Technology Corporation", "summary": "Silicon Motion Technology Corporation, together with its subsidiaries, designs, develops, and markets NAND flash controllers for solid-state storage devices. It offers solid-state drive (SSDs) used in PCs and other devices, as well as embedded multimediacard (eMMC) and UFS mobile embedded storage used in smartphones. The company also provides enterprise-grade SSDs used in data centers; and small form-factor specialized SSDs used in industrial, commercial, and automotive applications. It sells its controllers under the SMI brand; data center SSDs under the Shannon brand; and single-chip industrial-grade SSDs under the Ferri SSD and Ferri-eMMC brands. The company markets and sells its products through direct sales personnel and independent electronics distributors to flash makers, module makers, hyperscalers, and OEMs. It operates in Taiwan, the United States, Korea, China, Malaysia, Singapore, and internationally. Silicon Motion Technology Corporation was founded in 1995 and is based in Kowloon, Hong Kong.", "currency": "USD", "sector": "Technology", "industry": "Semiconductors", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Kowloon"}}