{
  "AGIL.MC": {
    "city": "Barcelona",
    "country": "Spain",
    "currency": "EUR",
    "exchange": "MCE",
    "industry": "Software - Infrastructure",
    "long_name": "Agile Content, S.A.",
    "market": "es_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "AGILE CONTENT, S.A.",
    "state": null,
    "summary": "Agile Content, S.A. provides tools that enables publishers and brands to curate, deliver, and monetize their contents, audiences, videos, and other contents online in Spain. The company offers solutions, such as digital-first content management and delivery services; optimized and personalized mobile experience for reading and watching content; identity and relationships management; and video cloud for video management and distribution platform. It also provides sales automation with integrated audience data; content based value added services; and multimedia platform that allows managed service providers to build and maintain relationship tools for customers. The company was founded in 2007 and is based in Barcelona, Spain.",
    "website": "http://www.agilecontent.com",
    "zipcode": "08036"
  },
  "GIGA.MC": {
    "city": "Alcobendas",
    "country": "Spain",
    "currency": "EUR",
    "exchange": "MCE",
    "industry": "Software - Infrastructure",
    "long_name": "Gigas Hosting, S.A.",
    "market": "es_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "GIGAS HOSTING, S.A.",
    "state": null,
    "summary": "Gigas Hosting, S.A., a cloud computing company, provides cloud hosting solutions. It offers Cloud Datacenter, a solution that allows users to create, modify, re-distribute, and manage its virtual data center through web control panel in real time. The company also provides Gigas Cloud Contingency service that enables companies to implement and integrate automatic protection; Cloud Virtual Private Server; SAP cloud solutions; and cloud server for Oracle, as well as firewall, load balancer, and VPN solutions. Gigas Hosting, S.A. was founded in 2011 and is based in Alcobendas, Spain.",
    "website": "http://gigas.com",
    "zipcode": "28108"
  }
}
