{
    "TGH.BK": {
        "short_name": "THAI GROUP HOLDINGS PUBLIC COMP",
        "long_name": "Thai Group Holdings Public Company Limited",
        "summary": "Thai Group Holdings Public Company Limited engages in the underwriting of life and non-life insurance business principally in Thailand. The company operates through Life insurance, Non-life insurance, Financial service, and Others segments. It offers life insurance products, including ordinary life insurance, group life insurance, and life insurance and credit protection insurance of financial institutions, as well as non-life insurance products, such as motor insurance. The company also provides property insurance that include fire insurance and all risks insurance; and miscellaneous insurance products comprising burglary insurance, plate glass insurance, money insurance, neon sign and sign board insurance, contractor's all risk insurance, erection all risk insurance, boiler and pressure vessel insurance, electronic equipment insurance, contractors' plant and equipment insurance, machinery breakdown insurance, public liability insurance, directors' and officers' liability, workmen's compensation insurance, fidelity guarantee insurance, bail bond insurance, golfer's indemnity insurance, and other insurance products. In addition, it offers marine and transportation insurance, including accident insurance for individuals and groups, travel insurance, and health insurance, as well as outward treaty and outward facultative reinsurance products. Additionally, the company operates leasing and financing business that provides operating lease for vehicle assets; new car and used car hire purchase services, collateral assets loans, revolving loans, factoring loans, project finance, and others loan services. Further, it develops and rents real estate properties; offers management, consulting, and training services; provides investing consultant; and develops insurance technology. The company was incorporated in 2018 and is based in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Financial Services",
        "industry": "Insurance - Diversified",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "state": null,
        "city": "Bangkok",
        "zipcode": "10500",
        "website": "http://www.segroup.co.th",
        "market_cap": "Small Cap"
    }
}