{"0011.HK": {"short_name": "HANG SENG BANK", "long_name": "Hang Seng Bank Limited", "summary": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance and wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment, and corporate wealth management services, as well as general banking, interest rate, money market, structured, derivative products, etc. In addition, the company offers trustee, nominee, fund management, stock broking, and property management services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 290 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, operates a mainland China network with outlets in the Pearl River delta, the Yangtze River delta, the Bohai Rim region, and Midwest China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0030.HK": {"short_name": "BAN LOONG HOLD", "long_name": "Ban Loong Holdings Limited", "summary": "Ban Loong Holdings Limited, an investment holding company, engages in the money lending, and trading of goods and commodities in Hong Kong and the People's Republic of China. The company operates through Money Lending and Trading Segments. It provides short-term personal and corporate loans; and trades in refined edible oil, sugar, cosmetic, and personal care products. The company was formerly known as ABC Communications (Holdings) Limited and changed its name to Ban Loong Holdings Limited in October 2015. Ban Loong Holdings Limited is based in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wanchai"}, "0033.HK": {"short_name": "AMBER HILL FIN", "long_name": "Amber Hill Financial Holdings Limited", "summary": "Amber Hill Financial Holdings Limited, an investment holding company, primarily engages in the trading of party products, and metals and minerals in Hong Kong and North America. It trades in party accessories, decorations, cutlery, and eatery wares. The company also provides securities brokerage and asset management services. In addition, it is involved in the personal and corporate loans business; credit guarantee and investment activities; and trading of security products and provision of security services, as well as advancing business. The company was formerly known as China Cloud Copper Company Limited and changed its name to Amber Hill Financial Holdings Limited in July 2020. Amber Hill Financial Holdings Limited was founded in 1996 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0111.HK": {"short_name": "CINDA INTL HLDG", "long_name": "Cinda International Holdings Limited", "summary": "Cinda International Holdings Limited, an investment holding company, provides asset management services in Hong Kong and Mainland China. The company operates through Asset Management, Sales and Trading Business, and Corporate Finance segments. The Asset Management segment provides advisory service and related auxiliary services on fund management, as well as other related proprietary investment services; and manages private funds. The Sales and Trading Business segment offers broking services in securities, equity linked products, unit trusts, stock options, and commodities and futures contracts, as well as underwriting, placing, and margin financing services to broking clients. This segment also acts as an agent for the sale of savings plans, general and life insurance, and other investment linked insurance products. The Corporate Finance segment offers corporate finance and advisory services on equity and debt financing to companies listed or seeking listing on Hong Kong or other stock exchanges; and other unlisted corporates. The company also offers fund management, financial planning, and private equity investment services; and administrative support, research, and consultancy services, as well as acts as a money lender. It serves individuals, corporates, enterprises, and institutional customers. The company was formerly known as Hantec Investment Holdings Limited and changed its name to Cinda International Holdings Limited in November 2008. Cinda International Holdings Limited was incorporated in 2000 and is headquartered in Central, Hong Kong. Cinda International Holdings Limited is a subsidiary of Cinda Securities Co., Ltd.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0165.HK": {"short_name": "CHINA EB LTD", "long_name": "China Everbright Limited", "summary": "China Everbright Limited, through its subsidiaries, engages in the investment activities and provision of financial services in Hong Kong and Mainland China. The company invests in unlisted equity securities or equity derivatives, as well as in the areas of new economy, artificial intelligence and advanced manufacturing, new energy, medical care and senior healthcare, overseas acquisition and infrastructure, real estate, aircraft industry chain, mezzanine fund, and others. It also focuses on investing in aircraft leasing, artificial intelligence of things, and elderly care industry platforms; and investing in equity, debts, structured products, and other products. In addition, the company provides a range of financial services, including asset management, investment management, and investment advisory services related to absolute return funds, bond funds, and equity funds, as well as offers management, treasury management, secretarial, money lending, fund management, venture capital, leasing, and consultancy services. The company was founded in 1997 and is headquartered in Hong Kong. China Everbright Limited is a subsidiary of Honorich Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "0174.HK": {"short_name": "GEMINI INV", "long_name": "Gemini Investments (Holdings) Limited", "summary": "Gemini Investments (Holdings) Limited, an investment holding company, engages in fund platform, property investment and development, fund investments, and securities investment businesses. It is also involved in provision of project management; securities investment and trading; fund management; and real estate consultancy services. In addition, the company invests in real estate fund platform; leases office properties and residential condominium; and provides management and administration services for property development project. It has operations in Hong Kong, the United States, Australia, the People's Republic of China, and internationally. The company was formerly known as Gemini Property Investments Limited and changed its name to Gemini Investments (Holdings) Limited in July 2011. The company was incorporated in 1987 and is based in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0188.HK": {"short_name": "SUNWAH KINGSWAY", "long_name": "Sunwah Kingsway Capital Holdings Limited", "summary": "Sunwah Kingsway Capital Holdings Limited, an investment holding company, provides various financial services in Hong Kong, the People's Republic of China, and internationally. It operates through Proprietary Investment, Property Investment, Brokerage and Financing, Corporate Finance and Capital Markets, Asset Management, and Others segments. The Proprietary Investment segment invests in securities for treasury and liquidity management, as well as in structured deals, including listed and unlisted equities, debt securities, and investment funds. The Property Investment segment invests in properties for rental income. The Brokerage and Financing segment offers securities, options, funds, futures, and commodities brokerage services; and margin and other financing, factoring, and other related services. The Corporate Finance and Capital Markets segment provides financial advisory services to corporate clients; and acts as an underwriting and placing agent in the equity capital market. The Asset Management segment offers asset management and related advisory services to private equity funds and private clients. The Others segment provides management, administrative, and corporate secretarial services, as well as loan financing and leasing services. The company was formerly known as SW Kingsway Capital Holdings Limited and changed its name to Sunwah Kingsway Capital Holdings Limited in September 2011. The company was founded in 1990 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0211.HK": {"short_name": "STYLAND HOLD", "long_name": "Styland Holdings Limited", "summary": "Styland Holdings Limited, an investment holding company, engages in the financial services, mortgage financing, property development and investment, and securities trading businesses in Hong Kong. The company's Financial Services segment offers securities and futures dealing, brokerage financing, corporate finance, asset management, and other financing services, as well as other equity and debt financing solutions. This segment also provides margin financing services for trading stocks and other listed securities, and for subscribing to new shares in initial public offerings; and stock broking and online stock trading services for Hong Kong listed companies, institutional investors, professionals, and individual investors. Its Mortgage Financing segment provides loans to individuals, corporations, and institutions that are secured by real properties. The company's Property Development and Investment segment is involved in the property redevelopment activities, as well as properties letting business. Its Securities Trading segment trades in securities and derivative products. The company also provides management and strategic investment services. Styland Holdings Limited was founded in 1977 and is based in Kwun Tong, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kwun Tong"}, "0218.HK": {"short_name": "SWHYHK", "long_name": "Shenwan Hongyuan (H.K.) Limited", "summary": "Shenwan Hongyuan (H.K.) Limited, an investment holding company, engages in brokerage, corporate finance, asset management, financing and loan, and investment and other businesses in Hong Kong. The company operates in five segments: Enterprise Finance, Personal Finance and Wealth Management, Institutional Services and Trading, Investment Management, and Others. It offers stock underwriting sponsor, bond underwriting, and financial advisory services for corporate clients; and external equity investment, debt investment, other investments, and structured financing solutions. The company also provides securities, futures, and options brokerage services; and wealth management, OTC, and securities margin financing products to individual customers and non-professional institutional investors. In addition, it provides stock brokerage and trading services; research advisory, and investment and financing solutions; and sales, trading, hedging, and over-the-counter derivative services to institutional clients, as well as sells and trades in fixed income bonds, currencies, and commodities. Further, the company offers asset management, investment advisory, and public and private fund management services. Additionally, it offers management and treasury, and share custodian and nominee services; leases computer equipment; and holds properties. The company was formerly known as Shenyin Wanguo (H.K.) Limited and changed its name to Shenwan Hongyuan (H.K.) Limited in May 2015. Shenwan Hongyuan (H.K.) Limited was incorporated in 1972 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0223.HK": {"short_name": "ELIFE HLDGS", "long_name": "Elife Holdings Limited", "summary": "Elife Holdings Limited, an investment holding company, provides commodities trading and esmart digital services in China, Hong Kong, and internationally. The company operates through three segments: Unconventional Gas Business, Commodities Trading Business, and Esmart Digital Services. It offers unconventional gas related services, as well as imports technical equipment for the unconventional gas industry; and commodities trading and agency services. The company also provides cloud data smart platform and commercial terminals for shop management. It serves retail stores, convenience stores, small-to-medium sized supermarkets, gas stations, pharmacies, tobacco and wine specialty shops, China Post network, small servicing spots, apparel chain stores, etc. The company was formerly known as Sino Resources Group Limited and changed its name to Elife Holdings Limited in November 2016. Elife Holdings Limited was incorporated in 2001 and is headquartered in Hong Kong, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "0245.HK": {"short_name": "CHINA VERED FIN", "long_name": "China Vered Financial Holding Corporation Limited", "summary": "China Vered Financial Holding Corporation Limited, an investment holding company, provides asset management, consultancy, financing, and securities advisory and brokerage services. It also provides insurance agency and money lending services. The company was formerly known as China Minsheng Financial Holding Corporation Limited and changed its name to China Vered Financial Holding Corporation Limited in July 2020. China Vered Financial Holding Corporation Limited is based in Causeway Bay, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "0299.HK": {"short_name": "GLORY SUN LAND", "long_name": "Glory Sun Land Group Limited", "summary": "Glory Sun Land Group Limited, an investment holding company, engages in property development and investment business in the People's Republic of China. It operates through seven segments: Yacht Club; Education; Real Estates and Property Investment; Trading of Commodities; Construction; Provision of Online Game Services; and Others. The company also operates a yacht club and golf practice court; provides education and training services; designs, develops, and operates mobile and web games, as well as platform services; and trades in commodities and seafood. It also involved in the provision of construction works. The company was formerly known as New Sports Group Limited and changed its name to Glory Sun Land Group Limited in September 2015. Glory Sun Land Group Limited was founded in 1995 and is based in Admiralty, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Admiralty"}, "0335.HK": {"short_name": "UPBEST GROUP", "long_name": "Upbest Group Limited", "summary": "Upbest Group Limited, an investment holding company, provides a range of financial services primarily in Hong Kong and Macau. The company operates through seven segments: Broking, Financing, Corporate Finance, Assets Management, Property Investment, Precious Metal Trading, and Investment Holding. Its activities include securities and futures brokerage; securities margin financing and money lending; corporate finance advisory, placing, and underwriting; assets management for listed and unlisted companies, and high net worth individuals; precious metal trading; and share investments. The company is also involved in the property rental, management, and related businesses. Upbest Group Limited was founded in 1988 and is based in Central, Hong Kong. Upbest Group Limited is a subsidiary of CCAA Group Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0376.HK": {"short_name": "YUNFENG FIN", "long_name": "Yunfeng Financial Group Limited", "summary": "Yunfeng Financial Group Limited, an investment holding company, provides insurance products in Hong Kong and Macau. The company operates in two segments, Insurance Products, and Other Financial Services and Corporate. It provides a range of insurance products, including life insurance, medical insurance, annuities, pension, and mandatory provident fund schemes. The company also provides fund and asset management services, as well as financing and investing solutions; and corporate advisory, and securities placing and underwriting advisory services. In addition, it engages in financial technology activities; and provision of employee stock ownership plan administration and principal investment. Further, the company provides administrative, trustee, and general services; agency services to non-life insurers; marketing and promoting products, and public relations services; Internet and multimedia systems, and application development services; and technological development of computer software and hardware, technical consulting, technology services, and database and computer network services. The company was formerly known as REORIENT GROUP LIMITED and changed its name to Yunfeng Financial Group Limited in October 2016. The company is based in Central, Hong Kong. Yunfeng Financial Group Limited is a subsidiary of Yunfeng Financial Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0412.HK": {"short_name": "CSFG", "long_name": "China Shandong Hi-Speed Financial Group Limited", "summary": "China Shandong Hi-Speed Financial Group Limited, an investment holding company, provides various financial services in the People's Republic of China. The company operates through four segments: Investments in Securities, Money Lending, Financial Leasing, and Financial Technology. The Investments in Securities segment purchases and sells securities and derivatives; and holds equity and debt investments. The Money Lending segment provides money lending and advisory services. The Financial Leasing segment primarily is involved in the provision of direct financial leasing and advisory services, as well as operation of an asset trading platform. The Financial Technology segment offers online investment and technology enabled lending services; and online new media services. It also provides corporate, business factoring, securities brokerage, asset management, financial investments, investment management, and related financial services; and issues guaranteed bonds and perpetual securities. The company was formerly known as China Innovative Finance Group Limited and changed its name to China Shandong Hi-Speed Financial Group Limited in October 2017. China Shandong Hi-Speed Financial Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0428.HK": {"short_name": "COCOON HOLDINGS", "long_name": "Cocoon Holdings Limited", "summary": "Cocoon Holdings Limited is a principal investment firm specializing in investments in listed and unlisted companies. The firm typically invests in the fields of resources, technology enabled manufacturing, food and retail and healthcare. It also offers other investment services that include money market instruments, capital syndication, and arranging strategic corporate deals, with an emphasis on financial restructuring and capital infusion. The firm invests in Asia and the Greater China region. Cocoon Holdings Limited, formerly known as Huge China Holdings Limited, was founded in 1993 and is based in Hong Kong with additional office in Hamilton, Bermuda.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0440.HK": {"short_name": "DAH SING", "long_name": "Dah Sing Financial Holdings Limited", "summary": "Dah Sing Financial Holdings Limited, an investment holding company, provides banking, insurance, financial, and other related services in the People's Republic of China. The company operates through Personal Banking, Commercial Banking, Treasury, Overseas Banking, and Insurance segments. The Personal Banking segment accepts various deposits from individual customers; and provides residential mortgage loans, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts various deposits; and offers loans and working capital financing to commercial, industrial, and institutional customers, as well as trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services. It also manages investment in securities. The Overseas Banking segment offers personal and commercial banking products and services. The Insurance Business segment is involved in the insurance and pension fund management business. The company also provides insurance agency, nominee, and securities dealing services; and invest in properties. The company was formerly known as Fivetech Investments Limited and changed its name to Dah Sing Financial Holdings Limited in July 1987. Dah Sing Financial Holdings Limited was incorporated in 1987 and is based in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0508.HK": {"short_name": "DINGYI GP INV", "long_name": "Dingyi Group Investment Limited", "summary": "Dingyi Group Investment Limited, an investment holding company, engages in the loan financing and financial leasing businesses in the Mainland China and Hong Kong. The company is also involved in the sale of food and beverages; securities trading; and properties development businesses. In addition, it engages in the trading of wine; investment advisory; and restaurant operation businesses. The company was formerly known as Chevalier Pacific Holdings Limited and changed its name to Dingyi Group Investment Limited in February 2012. The company is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0612.HK": {"short_name": "CHINA DYF", "long_name": "China Ding Yi Feng Holdings Limited", "summary": "China Ding Yi Feng Holdings Limited is a publicly owned investment manager. The firm invests in the private equity, and venture capital markets across the globe. The firm also invests in e-commerce & internet services and high technology industry. The firm seeks to invest in listed and unlisted companies in the PRC and Hong Kong. The firm employs a combination of quantitative and qualitative analysis to create its investment portfolios. It was formerly known as China Investment Fund International Holdings Limited. China Ding Yi Feng Holdings Limited was established in 2001 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon"}, "0622.HK": {"short_name": "OSHIDORI", "long_name": "Oshidori International Holdings Limited", "summary": "Oshidori International Holdings Limited, an investment holding company, provides financial services in Hong Kong. It offers securities brokerage, placing and underwriting, consultancy and corporate finance advisory, money lending, investment advisory, asset management, margin financing, and proprietary trading services, as well as engages in trading and investment of securities. The company also provides nominee and management services; and holds yachts and motor vehicles. The company was formerly known as Enerchina Holdings Limited and changed its name to Oshidori International Holdings Limited in April 2019. Oshidori International Holdings Limited is based in North Point, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "North Point"}, "0628.HK": {"short_name": "GOME FIN TECH", "long_name": "Gome Finance Technology Co., Ltd.", "summary": "Gome Finance Technology Co., Ltd., an investment holding company, provides various financial services in Hong Kong and People's Republic of China. The company offers commercial factoring, financial leasing, personal property pawn loans, real estate mortgage loans, and money lending services. It also provides consultancy and technical advisory services. The company was formerly known as Sino Credit Holdings Limited and changed its name to Gome Finance Technology Co., Ltd. in February 2017. The company is headquartered in Central, Hong Kong. Gome Finance Technology Co., Ltd. is a subsidiary of Swiree Capital Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0665.HK": {"short_name": "HAITONG INT'L", "long_name": "Haitong International Securities Group Limited", "summary": "Haitong International Securities Group Limited provides financial products and services to corporate, institutional, and retail clients worldwide. The Wealth Management segment offers financial services and investment solutions to retail and high net-worth clients. This segment engages in securities broking and dealing, futures, and options contracts; foreign exchange trading; over the counter products and risk management instruments sales; securities margin financing; and the provision of investment advisory, financial planning, and investment funds distribution services, as well and custodian services. The Corporate Finance segment provides sponsoring and underwriting services for fund raising activities in equity and debt capital markets. This segment also offers advisory services and financing solutions for corporate actions, such as mergers and acquisitions, assets restructuring, etc. The Asset Management segment offers investment management services, including public funds, private funds, and mandatory provident funds to individual, corporate, and institutional clients. The Institutional Clients segment provides cash equities sales and trading; brokerage; stock borrowing and lending; equity research; investment and financing solutions; and financial instruments, such as fixed income products, currency and commodity products, futures and options, exchange traded funds, and derivative products in financial centers for institutional clients. The Investment segment invests in investment funds and private equity investments. The company was formerly known as Taifook Securities Group Limited and changed its name to Haitong International Securities Group Limited in November 2010. The company was founded in 1973 and is headquartered in Central, Hong Kong. Haitong International Securities Group Limited operates as a subsidiary of Haitong International Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0666.HK": {"short_name": "SHK HK IND", "long_name": "SHK Hong Kong Industries Limited", "summary": "SHK Hong Kong Industries Limited is a publicly owned investment manager. The company invests primarily in telecommunications, properties for sale and rent, infrastructure and logistics, hotel operation, food and beverage, and transportation sectors. It prefers to invest in Hong Kong, Singapore, United States, Japan, Malaysia, Taiwan, and China. SHK Hong Kong Industries Limited was formerly known as Yu Ming Investments Limited. SHK Hong Kong Industries Limited was founded in 1990 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wanchai"}, "0668.HK": {"short_name": "DOYEN INTL HOLD", "long_name": "Doyen International Holdings Limited", "summary": "Doyen International Holdings Limited, an investment holding company, engages in the provision of loan financing services in the People's Republic of China. The company operates through Investment Property Holding, Dongkui Business, and Sales of Flowers and Plants segments. It is also involved in the investment and rental of properties. The company owns Dong Dong Mall, a shopping arcade with a total gross floor area of 18,043.45 square meters located in Chongqing. In addition, it provides management services; and sells flowers, seedlings, and plants. The company was formerly known as Dowell Property Holdings Limited and changed its name to in Doyen International Holdings Limited in June 2016. Doyen International Holdings Limited is based in Wanchai, Hong Kong. Doyen International Holdings Limited is a subsidiary of Money Success Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0717.HK": {"short_name": "EMPEROR CAPITAL", "long_name": "Emperor Capital Group Limited", "summary": "Emperor Capital Group Limited, an investment holding company, provides a range of financial services in Hong Kong, the United States, and internationally. The company operates through Financing, Brokerage, Placing and Underwriting, and Corporate Finance segments. It offers commercial and personal loans comprising short-term unsecured loans, such as tax loans, bridging loans, term loans, and personal loans, as well as long-term secured loans, including property mortgage loans; and margin and initial public offering (IPO) financing. The company also provides brokerage services for securities, futures, and options traded on the exchanges in Hong Kong, Mainland China, and overseas countries; wealth management services, such as providing advice regarding an array of investment services, including securities, mutual funds, insurance-linked products, and real estate investment; asset management services; and discretionary investment services. In addition, it offers placing and underwriting services, as well as acts as a placing agents and underwriters for various Hong Kong listed companies; and corporate finance advisory services on takeovers code related transactions and undertakes sponsor work for IPOs, as well as provides advisory for corporate transactions, including placing, rights issue, corporate restructuring, and merger and acquisition services. Further, the company provides promotion and marketing, and insurance and other brokerage services. Emperor Capital Group Limited was founded in 1993 and is headquartered in Wanchai, Hong Kong. Emperor Capital Group Limited is a subsidiary of Emperor Capital Group Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wanchai"}, "0730.HK": {"short_name": "SHOUGANG GRAND", "long_name": "Shougang Concord Grand (Group) Limited", "summary": "Shougang Concord Grand (Group) Limited, an investment holding company, provides finance leasing and other financial services in Mainland China and Hong Kong. It operates through three divisions: Finance Leasing and Other Financial Services, Property Leasing and Building Management Services, and Assets Management. The company offers finance leasing for various sectors, including energy, transport, printing equipment, medical equipment, scientific and technical equipment, industrial equipment, etc. It is also involved in the investment, leasing, sale, and management of properties, such as industrial, office, and residential buildings; provision of property consultant, administrative and management, and referral and corporate financial advisory services; and investment and management of industrial funds. Shougang Concord Grand (Group) Limited has a strategic cooperation agreement with Jingdong Digits Technology Holding Co., Ltd. for cooperation in the field of supply chain business. The company is based in Wan Chai, Hong Kong. Shougang Concord Grand (Group) Limited is a subsidiary of Wheeling Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0764.HK": {"short_name": "ETERNITY INV", "long_name": "Eternity Investment Limited", "summary": "Eternity Investment Limited, an investment holding company, primarily engages in the sale of financial assets and money lending businesses. The company operates in four segments: Property Investment, Sale of Financial Assets, Money Lending, and Sale of Jewelry Products. It also designs and sells jewelry products; sells precious stones; and leases rental properties. In addition, the company manages membership-based golf club and resort that provides recreational and wellness services; provides property development and property management services; and manages and operates cultural forum and related cultural activities. It operates in Hong Kong, the People's Republic of China, Australia, Europe, and the United States. The company was formerly known as China Star Investment Holdings Limited and changed its name to Eternity Investment Limited in June 2010. Eternity Investment Limited is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0804.HK": {"short_name": "PINESTONE", "long_name": "Pinestone Capital Limited", "summary": "Pinestone Capital Limited, an investment holding company, provides financial services to individual and corporate clients in Hong Kong. It offers securities brokerage services; securities-backed lending services, including margin financing and money lending services; and placing and underwriting services. The company was founded in 2015 and is headquartered in Central, Hong Kong. Pinestone Capital Limited is a subsidiary of HCC & Co. Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0900.HK": {"short_name": "AEON CREDIT", "long_name": "AEON Credit Service (Asia) Company Limited", "summary": "AEON Credit Service (Asia) Company Limited, together with its subsidiaries, engages in the consumer finance business primarily in Hong Kong. The company operates through three segments: Credit Card, Personal Loans, and Insurance. The Credit Card segment offers credit card services to individuals; and acquiring services for member stores. The Personal Loans segment provides personal loan financing services to individuals. The Insurance segment offers insurance agency and brokerage services. The company was incorporated in 1990 and is based in Tsim Sha Tsui, Hong Kong. AEON Credit Service (Asia) Company Limited is a subsidiary of AEON Financial Service (Hong Kong) Co., Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "0913.HK": {"short_name": "UNITY INV HOLD", "long_name": "Unity Investments Holdings Limited", "summary": "Unity Investments Holdings, Ltd. and its subsidiaries engage primarily in investment holding in listed and unlisted companies. The firm invests in both listed and unlisted companies, and the current core portfolio comprises of mainly small to medium sized listed companies. It invests in a wide array of industries and sectors like securities investment companies and companies engaging in the businesses of infrastructure, manufacturing, trading, information technologies, media, energy, property investment and securities investment. Unity Investments Holdings, Ltd. is based in Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0952.HK": {"short_name": "TONGHAI FIN", "long_name": "China Tonghai International Financial Limited", "summary": "China Tonghai International Financial Limited, an investment holding company, provides various financial services in Hong Kong. It operates through Brokerage and Interest Income, Corporate Finance, Asset Management, Investments, and Others segments. The Brokerage and Interest Income segment provides discretionary and non-discretionary dealing services for securities, futures, and options; margin financing and money lending services; and insurance broking and wealth management services, as well as earns interest income from debt instruments. The corporate finance offers securities placing, underwriting, and corporate finance and general advisory services. The Asset Management segment provides fund management, discretionary portfolio management, and portfolio management advisory services. The Investments segment invests in and trades in various investment products. The Others segment offers financial media services. It also provides import/export trading, and Website management and other related services. The company was formerly known as China Oceanwide International Financial Limited and changed its name to China Tonghai International Financial Limited in May 2018. China Tonghai International Financial Limited was incorporated in 1997 and is headquartered in Central, Hong Kong. China Tonghai International Financial Limited is a subsidiary of Oceanwide Holdings International Financial Development Co., Ltd.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0966.HK": {"short_name": "CHINA TAIPING", "long_name": "China Taiping Insurance Holdings Company Limited", "summary": "China Taiping Insurance Holdings Company Limited, an investment holding company, underwrites direct life insurance, property and casualty insurance, and various classes of reinsurance products in People's Republic of China and internationally. It operates through Life Insurance Business, PRC Property and Casualty Insurance Business, Overseas Property and Casualty Insurance Business, Reinsurance Business, Pension and Group Life Insurance Business, and Other Businesses segments. The company's life insurance products include individual and group life insurance, health insurance, accident insurance, and annuity. Its property and casualty insurance products comprise compulsory motor insurance; and liability insurance, credit insurance, guarantee insurance, and short-term accident and health insurance, as well as related reinsurance products. The company's reinsurance portfolio covers property damage, life, marine cargo and hull, and miscellaneous non-marine classes. The company is also involved in the pension, assets management, insurance intermediary, financial leasing, property investment, securities dealing and broking, and elderly care investment businesses; and manages investment funds. In addition, it provides back to back financing arrangement, and insurance broking and agency services. The company was formerly known as China Insurance International Holdings Company Limited and changed its name to China Taiping Insurance Holdings Company Limited in August 2009. The company was incorporated in 2000 and is headquartered in North Point, Hong Kong. China Taiping Insurance Holdings Company Limited is a subsidiary of China Taiping Insurance Group (HK) Company Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "North Point"}, "0993.HK": {"short_name": "HUARONG INT FIN", "long_name": "Huarong International Financial Holdings Limited", "summary": "Huarong International Financial Holdings Limited, an investment holding company, provides financial services in Hong Kong and the People's Republic of China. The company operates through Securities, Corporate Finance, and Asset Management and Direct Investment segments. The Securities segment engages in the broking and dealing of securities, futures, and options contracts; and provision of margin financing services. The Corporate Finance segment offers securities underwriting and sponsoring, and financial advisory services to institutional clients. The Asset Management and Direct Investment segment provides asset management services; and makes direct investments in equities, bonds, funds, derivative instruments, and other financial products. Huarong International Financial Holdings Limited also offers sub-leasing arrangement, money lending, and consultancy services. The company was formerly known as Simsen International Corporation Limited and changed its name to Huarong International Financial Holdings Limited in October 2015. The company is headquartered in Central, Hong Kong. Huarong International Financial Holdings Limited is a subsidiary of Camellia Pacific Investment Holding Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1051.HK": {"short_name": "G-RESOURCES", "long_name": "G-Resources Group Limited", "summary": "G-Resources Group Limited, an investment holding company, engages in the principal investment, financial services, and real property businesses. The company is involved in the provision of various financial services, including securities brokerage services, placing and underwriting services, corporate finance advisory services, provision of margin financing, money lending business, investment advisory and management services, and asset management services, as well as securities investment business. It also provides trust and company services; and fund investment services. The company operates in Singapore, Hong Kong, the United States, Europe, and internationally. The company was formerly known as Smart Rich Energy Finance (Holdings) Limited and changed its name to G-Resources Group Limited in June 2009. G-Resources Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "1141.HK": {"short_name": "CMBC CAPITAL", "long_name": "CMBC Capital Holdings Limited", "summary": "CMBC Capital Holdings Limited, an investment holding company, provides loan financing services primarily in Hong Kong. It operates through Securities; Investment and Financing; and Asset Management, Corporate Finance and Advisory segments. The Securities segment offers brokerage, securities margin financing, futures and options contracts dealing, and securities underwriting/placing services. The Investment and Financing segment invests and trades in equity and debt securities, bonds, and funds. The Asset Management and Advisory segment provides asset management, sponsorship, and financial advisory and arrangement services. It also offers corporate financing services. The company was formerly known as Skyway Securities Group Limited and changed its name to CMBC Capital Holdings Limited in May 2017. The company is headquartered in Kowloon, Hong Kong. CMBC Capital Holdings Limited is a subsidiary of CMBC International Investment Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1319.HK": {"short_name": "OIWAHPAWN", "long_name": "Oi Wah Pawnshop Credit Holdings Limited", "summary": "Oi Wah Pawnshop Credit Holdings Limited, an investment holding company, engages in the provision of secured financing services to high-net-worth customers in Hong Kong. It offers mortgage and pawn loans, and money lending services, as well as consulting services. The company was founded in 1975 and is headquartered in Wan Chai, Hong Kong. Oi Wah Pawnshop Credit Holdings Limited is a subsidiary of Kwan Lik Holding Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Mortgage Finance", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "1469.HK": {"short_name": "GET NICE FIN", "long_name": "Get Nice Financial Group Limited", "summary": "Get Nice Financial Group Limited, an investment holding company, provides financial services in Hong Kong. It operates through three segments: Broking, Securities Margin Financing, and Corporate Finance. The company offers securities dealing and broking, futures and options broking, and underwriting and placement services; securities margin financing; and corporate finance and advisory services. In addition, it is involved in the provision of asset management services, as well as property and yacht holding activities. The company is based in Central, Hong Kong. Get Nice Financial Group Limited operates as a subsidiary of Get Nice Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1788.HK": {"short_name": "GUOTAI JUNAN I", "long_name": "Guotai Junan International Holdings Limited", "summary": "Guotai Junan International Holdings Limited, an investment holding company, provides wealth management, brokerage, corporate finance, asset management, loans and financing, financial products, and market making and investment services in Hong Kong and internationally. The company's Brokerage segment is involved in securities, futures, options, and leveraged foreign exchange dealing and brokerage; and the provision of insurance brokerage services. Its Corporate Finance segment provides advisory services; and placing and underwriting services of debt and equity securities. The company's Asset Management segment offers asset management services comprising fund management and investment advisory services. Its Loans and Financing segment provides margin financing products, securities borrowing and lending to margin customers, initial public offering loans, other loans to customers, and bank deposits. The company's Financial Products, Market Making and Investments segment offers funds, fixed income securities, and equity investments, as well as structuring of financial products; and trades in and markets debt securities, exchange traded funds, and derivatives. Its Other segment provides information channel services. The company was founded in 1995 and is based in Central, Hong Kong. Guotai Junan International Holdings Limited is a subsidiary of Guotai Junan Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "2003.HK": {"short_name": "VCREDIT", "long_name": "VCREDIT Holdings Limited", "summary": "VCREDIT Holdings Limited, an investment holding company, provides online consumer finance services to prime and near-prime borrowers in China. The company offers credit card balance transfer and consumption credit products. It also provides loan facilitation, guarantee, micro credit, and financial leasing services, as well as technology services. The company was formerly known as Vision Capital Group Limited. VCREDIT Holdings Limited was founded in 2006 and is headquartered in Admiralty, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Admiralty"}, "2263.HK": {"short_name": "FU SHEK FIN", "long_name": "Fu Shek Financial Holdings Limited", "summary": "Fu Shek Financial Holdings Limited, through its subsidiary, Sinomax Securities Limited provides securities trading, placing, and underwriting services in the People's Republic of China. It offers securities dealing, brokerage, and ancillary services; and margin financing and investment advisory services. The company was founded in 2001 and is headquartered in Admiralty, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Admiralty"}, "2323.HK": {"short_name": "RENCO HOLDINGS", "long_name": "Renco Holdings Group Limited", "summary": "Renco Holdings Group Limited, an investment holding company, manufactures and sells printed circuit boards. The company operates through three segments: Manufacturing, Treasury Investments, and Financial Services. It is also involved in the investment and trading of securities and related treasury activities; and provision of securities advisory and asset management services. In addition, the company engages in the provision of information system management services; consultancy and corporate solution services; fund management and investment services; and equity and debt investments. It operates in the People's Republic of China, Singapore, Thailand, Malaysia, Germany, Poland, other European countries, the United States, Korea, Japan, and internationally. The company was formerly known as HKBridge Financial Holdings Limited and changed its name to Renco Holdings Group Limited in July 2020. Renco Holdings Group Limited was founded in 1985 and is based in Hong Kong, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "2356.HK": {"short_name": "DAHSING BANKING", "long_name": "Dah Sing Banking Group Limited", "summary": "Dah Sing Banking Group Limited, an investment holding company, provides banking, financial, and other related services in Hong Kong, Macau, and the People's Republic of China. It operates through Personal Banking, Commercial Banking, Treasury, and Overseas Banking segments. The Personal Banking segment accepts deposits from individual customers; and provides residential mortgage lending, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts deposits; offers loans and working capital financing to commercial, industrial, and institutional customers; and provides trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services, as well as manages investments in securities. The Overseas Banking segment engages in the personal banking and commercial banking business activities in Macau and the People's Republic of China. The company is also involved in the property investment and securities dealing activities; and provision of nominee services. As of December 31, 2018, it had a branch network of 45 retail branches, 23 VIP centers, and 36 securities trading centers. The company was incorporated in 2004 and is based in Wan Chai, Hong Kong. Dah Sing Banking Group Limited operates as a subsidiary of Dah Sing Financial Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "3329.HK": {"short_name": "BOCOM INTL", "long_name": "BOCOM International Holdings Company Limited", "summary": "BOCOM International Holdings Company Limited, together with its subsidiaries, provides securities and related financial services in Hong Kong and Mainland China. The company operates through Brokerage, Corporate Finance and Underwriting, Asset Management and Advisory, Margin Financing, and Investment and Loans segments. The Brokerage segment trades in stocks, bonds, futures, options, and other marketable securities. The Corporate Finance and Underwriting segment provides corporate finance services, including equity underwriting, debt underwriting, sponsor services, and financial advisory services to institutional clients. The Asset Management and Advisory segment offers traditional asset management products and services to third party clients; and investment advisory, portfolio management, and transaction execution services. The Margin Financing segment provides securities-backed financial leverage for retail and institutional clients. The Investment and Loans segment engages in direct investment business, including investments in various debt and equity securities, investment in companies, and investment in loans. The company was formerly known as BOCOM Securities Company Limited and changed its name to BOCOM International Holdings Company Limited in May 2007. BOCOM International Holdings Company Limited was founded in 1998 and is headquartered in Central, Hong Kong. BOCOM International Holdings Company Limited operates as a subsidiary of Bank of Communications Co., Ltd.", "currency": "HKD", "sector": "Financial Services", "industry": "Financial Conglomerates", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "3618.HK": {"short_name": "CQRC BANK", "long_name": "Chongqing Rural Commercial Bank Co., Ltd.", "summary": "Chongqing Rural Commercial Bank Co., Ltd., together with its subsidiaries, provides a range of banking and related financial services in the People's Republic of China. It operates in three segments: Corporate Banking, Personal Banking, and Financial Market Operations. The Corporate Banking segment offers financial products and services, including deposit takings, corporate loans, trade financing, financial leasing, and other corporate intermediary services to corporations, government agencies, and financial institutions. The Personal Banking segment provides financial products and services, such as deposit products, personal loans, cards, personal wealth management services, and other types of personal intermediary services to individual customers. The Financial Market Operations segment conducts money market or repurchase transactions; and invests in debt instruments on behalf of customers. The company also provides mobile banking, Internet banking, and telephone banking services. As of 31 December 2019, it operated 1,774 branches including the headquarter and business department, 6 branches, 35 first-level sub-branches, 117 second-level sub-branches, 2 community branch outlets, and 1,612 branch outlets; and 4,911 ATMs and self-service inquiry terminals. The company was formerly known as Chongqing Rural Credit Union and changed its name to Chongqing Rural Commercial Bank Co., Ltd. in 2008. Chongqing Rural Commercial Bank Co., Ltd. was founded in 1951 and is based in Causeway Bay, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "3623.HK": {"short_name": "C SUCCESS FIN", "long_name": "China Success Finance Group Holdings Limited", "summary": "China Success Finance Group Holdings Limited, an investment holding company, provides financial and non-financial guarantee, financial leasing, and financial consultancy services in the People's Republic of China. The company offers financial guarantees, such as corporate financial, individual credit, financial leasing equipment, trusteeship, joint bond, corporate bond issuance, non-financing, and performance guarantees, as well as letter of guarantee for construction, and financing/financial consultancy and financial technology services. It also provides asset management services, including investment and financing management, asset/debt restructuring, special asset acquisition, corporate financial management, and financial consultancy services. In addition, the company offers fund management services for asset management, investment advisories, and private equity funds; investment and acquisition; capital; real estate finance; and micro credit services. Further, it provides financial leasing services comprising direct leasing, sale-leaseback, trusted leasing, joint leasing, and bank factoring. China Success Finance Group Holdings Limited was founded in 1996 and is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Financial Conglomerates", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "4C3.F": {"short_name": "CMBC CAP. HLDGS CONS.", "long_name": "CMBC Capital Holdings Limited", "summary": "CMBC Capital Holdings Limited, an investment holding company, provides loan financing services primarily in Hong Kong. It operates through Securities; Investment and Financing; and Asset Management, Corporate Finance and Advisory segments. The Securities segment offers brokerage, securities margin financing, futures and options contracts dealing, and securities underwriting/placing services. The Investment and Financing segment invests and trades in equity and debt securities, bonds, and funds. The Asset Management and Advisory segment provides asset management, sponsorship, and financial advisory and arrangement services. It also offers corporate financing services. The company was formerly known as Skyway Securities Group Limited and changed its name to CMBC Capital Holdings Limited in May 2017. The company is headquartered in Kowloon, Hong Kong. CMBC Capital Holdings Limited is a subsidiary of CMBC International Investment Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "597.F": {"short_name": "BOCOM INT.HLDGS CO. LTD", "long_name": "BOCOM International Holdings Company Limited", "summary": "BOCOM International Holdings Company Limited, together with its subsidiaries, provides securities and related financial services in Hong Kong and Mainland China. The company operates through Brokerage, Corporate Finance and Underwriting, Asset Management and Advisory, Margin Financing, and Investment and Loans segments. The Brokerage segment trades in stocks, bonds, futures, options, and other marketable securities. The Corporate Finance and Underwriting segment provides corporate finance services, including equity underwriting, debt underwriting, sponsor services, and financial advisory services to institutional clients. The Asset Management and Advisory segment offers traditional asset management products and services to third party clients; and investment advisory, portfolio management, and transaction execution services. The Margin Financing segment provides securities-backed financial leverage for retail and institutional clients. The Investment and Loans segment engages in direct investment business, including investments in various debt and equity securities, investment in companies, and investment in loans. The company was formerly known as BOCOM Securities Company Limited and changed its name to BOCOM International Holdings Company Limited in May 2007. BOCOM International Holdings Company Limited was founded in 1998 and is headquartered in Central, Hong Kong. BOCOM International Holdings Company Limited operates as a subsidiary of Bank of Communications Co., Ltd.", "currency": "EUR", "sector": "Financial Services", "industry": "Financial Conglomerates", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "616A.F": {"short_name": "DIGINEX LTD", "long_name": "Diginex Limited", "summary": "Diginex Limited, a digital asset financial services and advisory company, provides products, architecture, and infrastructure for the financial markets in the areas of digital asset ecosystem in Singapore and internationally. The company operates EQUOS, a cryptocurrency exchange for the professional and individual investors; an over-the-counter trading platform; Digivault, a hot and cold custodian platform for the custody of digital assets for institutional investors; and Diginex Access, a front-to-back integrated trading platform that provides trading and portfolio management solutions to institutional and professional retail clients. It also provides asset management services under the Bletchley Park Asset Management name; and securitization advisory, origination, and distribution services. The company was founded in 2017 and is headquartered in Central, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "6877.HK": {"short_name": "CLSA PREMIUM", "long_name": "CLSA Premium Limited", "summary": "CLSA Premium Limited, an investment holding company, provides leveraged foreign exchange, trading, cash dealing, and other services. It offers commodity and index trading, and margin dealing services, as well as precious metals trading and settlement services. The company also provides securities brokerage and management services. It primarily operates in Hong Kong, New Zealand, Australia, and the People's Republic of China. The company was formerly known as KVB Kunlun Financial Group Limited and changed its name to CLSA Premium Limited in November 2019. The company was incorporated in 2010 and is headquartered in Kowloon, Hong Kong. CLSA Premium Limited is a subsidiary of Citic Securities Overseas Investment Company Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon"}, "8019.HK": {"short_name": "HAO WEN HLDGS", "long_name": "Hao Wen Holdings Limited", "summary": "Hao Wen Holdings Limited, an investment holding company, engages in money lending business in the People's Republic of China, Hong Kong, and internationally. The company also engages in the processing and trading of electronic parts; and manufacture and trading of biomass fuel products. Hao Wen Holdings Limited was incorporated in 2000 and is headquartered in Sheung Wan, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Sheung Wan"}, "8071.HK": {"short_name": "CH NETCOMTECH", "long_name": "China Netcom Technology Holdings Limited", "summary": "China Netcom Technology Holdings Limited, an investment holding company, provides financial technology services in the People's Republic of China. It operates through Financial Technology Services Business, Apartment leasing Business, Lottery Business, and Sports Training Business segments. The Financial Technology Services Business segment offers credit referral and services, such as credit facilitation, post-origination, and financial guarantee services. The Apartment leasing Business segment manages and leases apartments for property owners and lessees. The Lottery Business segment develops computer software, hardware, and application system, as well as provides self-developed technology and related technical consultancy services to the operating system sector of lottery market. The Sports Training Business segment provides sports training services. The company also offers asset management services; and consultation and result transfer on network technology and computer network engineering services. The company was formerly known as China Metal Resources Holdings Limited and changed its name to China Netcom Technology Holdings Limited in January 2011. China Netcom Technology Holdings Limited is headquartered in Hong Kong, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "8072.HK": {"short_name": "ROMA GROUP", "long_name": "Roma Group Limited", "summary": "Roma Group Limited, an investment holding company, provides valuation and technical advisory services in Hong Kong. The company offers valuation services for business and intangible assets, such as business contracts, mining and exploration rights, customer relationships, franchises, distribution and publicity rights, technology and software applications, trademarks, patents, copyrights, domain names, Websites, and publication rights; and natural resources valuation and technical advisory services, including exploration planning, project feasibility study, resource estimation, evaluation, environmental and social, and risk management services. It also provides valuation services for financial instruments comprising accumulators/decumulators, call and put options, convertible bonds, convertible preference shares, equity-linked investments, financial guarantees, forward/futures contracts, share options, structured products, swap contracts, and warrants; property valuation services for various types of properties; credit and risk evaluation services; biological assets valuation services; and purchase price allocation services, as well as various services for clients' antiques, work of art, and collectables. In addition, the company offers machineries and equipment valuation services for manufacturing processes and industrial facility installations; various technical advisory services; and corporate advisory services, such as business planning, feasibility studies, fairness opinions, risk control and management, alliance with other professional parties, advisory before issuance of financial instruments, and advisory on regulatory and accounting standards, as well as valuation-related consultancy services related to mergers and acquisitions, initial public offerings, private placements, and others. It provides marketing and event organization, financing, property investment, and ESG and credit reporting services. The company is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8088.HK": {"short_name": "AID LIFE SCI", "long_name": "AID Life Science Holdings Limited", "summary": "AID Life Science Holdings Limited is a publicly owned investment manager. Through its subsidiaries, it provides asset management services in Hong Kong and internationally. The company offers investment advisory and corporate services, as well as provides fund administration and management, asset management, and wealth management services. It also holds available-for-sale investments. The company was formerly known as Healthoo International Technology Holdings Limited. AID Life Science Holdings Limited was founded in 1998 and is based in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8123.HK": {"short_name": "SINOFORTUNE FIN", "long_name": "Sinofortune Financial Holdings Limited", "summary": "Sinofortune Financial Holdings Limited, an investment holding company, engages in the selling of motor vehicles and provision of agency services in the People's Republic of China and Hong Kong. The company offers securities and futures brokerage, and securities margin financing services; and precious metals spot trading and brokerage services. It also provides securities and futures contract trading and wealth management services; trading platform; and stock information and research services. In addition, the company is involved in the trading and principal investment activities; and provision of education information and consultancy service. Further, it sells medicines, and calligraphy and painting. The company was formerly known as First China Financial Network Holdings Limited and changed its name to Sinofortune Financial Holdings Limited in June 2017. Sinofortune Financial Holdings Limited was incorporated in 2001 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8168.HK": {"short_name": "AMASSE CAPITAL", "long_name": "Amasse Capital Holdings Limited", "summary": "Amasse Capital Holdings Limited, an investment holding company, provides corporate finance advisory services in Hong Kong. The company offers financial advisory services to listed companies and investors seeking to control or invest in public listed companies, as well as independent board committees and/or independent shareholders of public listed companies. It also acts as an underwriter and/or placing agent not holding client assets in fund raising activities for its clients. The company was incorporated in 2017 and is headquartered in Central, Hong Kong. Amasse Capital Holdings Limited is a subsidiary of Access Cheer Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8210.HK": {"short_name": "DLC ASIA", "long_name": "DLC Asia Limited", "summary": "DLC Asia Limited, an investment holding company, operates as an interdealer broker in Hong Kong. It provides derivatives brokerage services to professional investors for SGX listed derivatives and Hong Kong Exchanges and Clearing Limited (HKEx) listed single stock options, as well as non-listed derivatives products executed on over-the-counter (OTC) market. The company was founded in 2009 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8226.HK": {"short_name": "KOALA FIN GP", "long_name": "KOALA Financial Group Limited", "summary": "KOALA Financial Group Limited, an investment holding company, engages in securities brokerage, share placements, underwriting services, and money lending activities in Hong Kong. The company operates in four segments: Securities Brokerage, Underwriting and Placements; Money Lending; Securities Investment; and Investment in Properties. It is involved in the trading of commodities; leasing of investment properties; and asset management, as well as money lending activities. The company was formerly known as Sunrise (China) Technology Group Limited and changed its name to KOALA Financial Group Limited in June 2017. KOALA Financial Group Limited is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8333.HK": {"short_name": "ASTRUM FIN", "long_name": "Astrum Financial Holdings Limited", "summary": "Astrum Financial Holdings Limited, an investment holding company, provides securities brokerage services in Hong Kong. It offers securities dealing and brokerage services; placing and underwriting services; corporate finance advisory services; financing services, including securities and initial public offering financing; and asset management services, as well as futures contracts dealing services, as well as online brokerage services. The company was incorporated in 2015 and is headquartered in Hong Kong, Hong Kong. Astrum Financial Holdings Limited is a subsidiary of Autumn Ocean Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "8340.HK": {"short_name": "VINCO FINANCIAL", "long_name": "Vinco Financial Group Limited", "summary": "Vinco Financial Group Limited, an investment holding company, provides various financial services in Hong Kong. The company offers its clients with initial public offerings (IPO) on the Main Board and GEM Board of The Stock Exchange of Hong Kong Limited; underwriting and distribution of IPO's shares; corporate finance advisory; mergers and acquisitions; corporate restructuring; arranging loan syndication; and convertible bonds issuance. It also facilitates corporate fund raising in equity capital market and debt market; provides professional advice on the structure of the fund raising; and assists private companies in pre-IPO private placement activities. In addition, the company assists clients on various transactions comprising fundraising activities of share placements, rights issues, and warrants issuance; share split/consolidation, privatization, and scheme of arrangement; capital restructuring; convertible bonds issuance; and formation of strategic partnership. Further, it acts as a financial advisor and independent financial advisor for transactions related to takeovers codes, connected transactions, and notifiable transactions; and as a financial advisor for corporate mergers and acquisitions, and asset and business acquisition/disposal transactions for listed and non-listed companies. The company was incorporated in 2008 and is headquartered in Central, Hong Kong. Vinco Financial Group Limited is a subsidiary of Vinco Asia Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8350.HK": {"short_name": "EXCALIBURGLOBAL", "long_name": "Excalibur Global Financial Holdings Limited", "summary": "Excalibur Global Financial Holdings Limited, through its subsidiaries, provides brokerage services for futures, securities, and options traded on the exchanges in Hong Kong, the United States, Japan, Singapore, and the United Kingdom. It also engages in the money lending business; and provision of investment consulting services. The company was founded in 1993 and is headquartered in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8657.HK": {"short_name": "TRUE PARTNER", "long_name": "True Partner Capital Holding Limited", "summary": "True Partner Capital Holding Limited operates as a fund management company in the United States and Hong Kong. The company manages funds and provides managed accounts on a discretionary basis using a proprietary trading platform. It offers investment management and consultancy services. The company also develops and supports its trading platform and related software; and provides management services for a portfolio of securities or futures contracts. It manages investors of funds primarily professional investors, including collective investment undertakings, family offices, pension funds, high-net-worth individuals, endowments/foundations, and financial institutions. The company was founded in 2010 and is headquartered in Tsim Sha Tsui, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "9AM1.F": {"short_name": "AMTD INT.  SP.ADR/1 CL.A", "long_name": "AMTD International Inc.", "summary": "AMTD International Inc., an investment holding company, engages in investment banking activities in Hong Kong, Mainland China, the United States, and internationally. The company operates through three segments: Investment Banking, Asset Management, and Strategic Investment. It offers a range of investment banking services, including equity underwriting, debt underwriting, securities brokerage, institutional sales and distribution, and research, as well as advisory services on credit rating, financing, and mergers and acquisitions transactions. The company also provides professional investment management and advisory services primarily to corporate and other institutional clients. In addition, it makes long-term strategic investments focusing on Asia's financial and new economy sectors. The company was formerly known as AMTD Inc. AMTD International Inc. was incorporated in 2019 and is headquartered in Central, Hong Kong. AMTD International Inc. is as subsidiary of AMTD Group Company Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "AA7B.F": {"short_name": "AGBA ACQUISITION  DL-,001", "long_name": "AGBA Acquisition Limited", "summary": "AGBA Acquisition Limited does not have significant operations. It intends to enter into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or other similar business combination with one or more businesses or entities. The company focuses on operating businesses in the healthcare, education, entertainment, and financial services sectors operating in China. AGBA Acquisition Limited was founded in 2018 and is based in Tsim Sha Tsui, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "AAGIY": {"short_name": "AIA GROUP LIMITED", "long_name": "AIA Group Limited", "summary": "AIA Group Limited, together with its subsidiaries, provides insurance products and services. The company offers life, medical, accident protection, critical illness protection, and disability income protection insurance products, as well as savings plans for individuals; and employee benefit, Asia benefits network, credit insurance, and retirement solutions for businesses. It also distributes investment and other financial services products. The company distributes its products and services through agents; distribution partners; other intermediated channels, including independent financial advisers, brokers, private banks, and specialist advisers; and direct channel. It operates in Hong Kong, Macau, Thailand, Singapore, Brunei, Malaysia, China, Korea, Australia, New Zealand, Cambodia, Indonesia, Myanmar, the Philippines, South Korea, Sri Lanka, Taiwan, Vietnam, and India. AIA Group Limited was founded in 1919 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "AAIGF": {"short_name": "AIA GROUP LIMITED", "long_name": "AIA Group Limited", "summary": "AIA Group Limited, together with its subsidiaries, provides insurance products and services. The company offers life, medical, accident protection, critical illness protection, and disability income protection insurance products, as well as savings plans for individuals; and employee benefit, Asia benefits network, credit insurance, and retirement solutions for businesses. It also distributes investment and other financial services products. The company distributes its products and services through agents; distribution partners; other intermediated channels, including independent financial advisers, brokers, private banks, and specialist advisers; and direct channel. It operates in Hong Kong, Macau, Thailand, Singapore, Brunei, Malaysia, China, Korea, Australia, New Zealand, Cambodia, Indonesia, Myanmar, the Philippines, South Korea, Sri Lanka, Taiwan, Vietnam, and India. AIA Group Limited was founded in 1919 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "ABVN": {"short_name": "ABV CONSULTING INC", "long_name": "ABV Consulting, Inc.", "summary": "ABV Consulting, Inc. does not have significant operations. It focuses on acquiring target companies with operations located primarily in Southeast Asia, the Pacific Islands, Taiwan, and the People's Republic of China. Previously, the company provided consulting services. ABV Consulting, Inc. was founded in 2013 and is headquartered in Tsim Sha Tsui, Hong Kong. ABV Consulting, Inc. is a subsidiary of Kang Min Global Holdings Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "AEEX": {"short_name": "ASIA EQUITY EXCHANGE GROUP INC", "long_name": "Asia Equity Exchange Group, Inc.", "summary": "Asia Equity Exchange Group, Inc. provides listing assistance, equity investment financing information, and public relationship services to the enterprises primarily in China. The company offers its services through an international equity assistance and information service platform. It also provides investment and corporate management consulting services. The company is based in Kowloon Bay, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "AGBA": {"short_name": "AGBA Acquisition Limited", "long_name": "AGBA Acquisition Limited", "summary": "AGBA Acquisition Limited does not have significant operations. It intends to enter into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or other similar business combination with one or more businesses or entities. The company focuses on operating businesses in the healthcare, education, entertainment, and financial services sectors operating in China. AGBA Acquisition Limited was founded in 2018 and is based in Tsim Sha Tsui, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NCM", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "AGBAU": {"short_name": "AGBA Acquisition Limited", "long_name": "AGBA Acquisition Limited", "summary": "AGBA Acquisition Limited does not have significant operations. It intends to enter into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization, or other similar business combination with one or more businesses or entities. The company focuses on operating businesses in the healthcare, education, entertainment, and financial services sectors operating in China. AGBA Acquisition Limited was founded in 2018 and is based in Tsim Sha Tsui, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NCM", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "ALAC": {"short_name": "Alberton Acquisition Corporatio", "long_name": "Alberton Acquisition Corporation", "summary": "Alberton Acquisition Corporation does not have significant operations. It intends to engage in a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more target businesses. The company was formerly known as Wisdom Resources Group Limited and changed its name to Alberton Acquisition Corporation in July 2018. Alberton Acquisition Corporation was founded in 2005 and is based in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "ALACU": {"short_name": "Alberton Acquisition Corporatio", "long_name": "Alberton Acquisition Corporation", "summary": "Alberton Acquisition Corporation does not have significant operations. It intends to engage in a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination with one or more target businesses. The company was formerly known as Wisdom Resources Group Limited and changed its name to Alberton Acquisition Corporation in July 2018. Alberton Acquisition Corporation was founded in 2005 and is based in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NCM", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "ASASF": {"short_name": "ASIA STANDARD INTL GROUP", "long_name": "Asia Standard International Group Limited", "summary": "Asia Standard International Group Limited, an investment holding company, invests in, develops, and manages commercial, residential, retail, and hotel properties in Hong Kong, China, and internationally. It operates through four segments: Property Sales, Property Leasing, Hotel and Travel, and Financial Investments. The company also owns and operates five hotels under the Empire brand name in Hong Kong. In addition, it provides real estate agency, financing, management, project management, securities investment, travel agency, catering, and construction services. The company was founded in 1984 and is based in Wan Chai, Hong Kong. Asia Standard International Group Limited is a subsidiary of Asia Orient Holdings Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wanchai"}, "BHKLY": {"short_name": "BOC HONG KONG(HLDGS) LTD", "long_name": "BOC Hong Kong (Holdings) Limited", "summary": "BOC Hong Kong (Holdings) Limited, an investment holding company, provides banking and related financial services to corporate and individual customers in Hong Kong, Mainland China, and internationally. The company operates through four segments: Personal Banking, Corporate Banking, Treasury, and Insurance. It offers savings, current, and time deposit accounts; mortgage plans; overdrafts; personal loans; personal life, medical and accident, travel and leisure, business protection, home, domestic helper, motor, and golfer insurance products; wealth management services; and Internet, phone, and mobile banking services. The company also provides cross-border services for corporate customers; business banking, trade finance and services, investment, treasury, corporate collection and payment, e-commerce, and card services; small business, asset-pledge, machinery and equipment financing, and project financing and syndicated loans; payroll, custody, and cash management services; and business comprehensive, property, liability, group, and retailer comprehensive insurance plans. In addition, it provides investment products and services, including securities, foreign exchange, fund, precious metals and FX margin, bonds, currency linked investment, structured products, bonds, and savings plans. The company operates approximately 190 branches, 280 automated banking centers, and approximately 1,000 self-service machines. BOC Hong Kong (Holdings) Limited was founded in 1917 and is based in Central, Hong Kong. The company is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. BOC Hong Kong (Holdings) Limited is a subsidiary of BOC Hong Kong (BVI) Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BKEAF": {"short_name": "BANK OF EAST ASIA LIMITED", "long_name": "The Bank of East Asia, Limited", "summary": "The Bank of East Asia, Limited, together with its subsidiaries, provides various banking and related financial services. The company operates through seven segments: Personal Banking, Corporate Banking, Treasury Markets, Wealth Management, Other Hong Kong Operations, Mainland China Operations, and Overseas Operations. It offers personal banking products and services, including deposits accounts; consumer loans; and mortgage loans, including refinancing and residential property valuation. The company also provides corporate banking products and services, such as corporate lending and syndication, including project finance, asset-based finance, cash flow finance, construction loans, onshore and offshore package facility, working capital facility, overdraft facility, share financing, bank guarantees, and performance bonds; commercial, cross-border, and enterprise financing; and business development solutions. In addition, it offers wealth management services, including private banking, trust, and portfolio management services, as well as investment solutions; treasury services and securities dealing services; data processing and other back office services; and insurance products and services. Further, the company provides securities and futures broking, and corporate financial advisory; asset management/investment management, property investment, facility management, trustees service, e-payment solutions, cyber banking, credit cards, ATM and I-teller network, foreign currency deposits, remittance, and safe deposit boxes. It operates approximately 200 outlets in Hong Kong and the rest of Greater China, Southeast Asia, the United Kingdom, and the United States. The Bank of East Asia, Limited was incorporated in 1918 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BKEAY": {"short_name": "BANK OF EAST ASIA LIMITED", "long_name": "The Bank of East Asia, Limited", "summary": "The Bank of East Asia, Limited, together with its subsidiaries, provides various banking and related financial services. The company operates through seven segments: Personal Banking, Corporate Banking, Treasury Markets, Wealth Management, Other Hong Kong Operations, Mainland China Operations, and Overseas Operations. It offers personal banking products and services, including deposits accounts; consumer loans; and mortgage loans, including refinancing and residential property valuation. The company also provides corporate banking products and services, such as corporate lending and syndication, including project finance, asset-based finance, cash flow finance, construction loans, onshore and offshore package facility, working capital facility, overdraft facility, share financing, bank guarantees, and performance bonds; commercial, cross-border, and enterprise financing; and business development solutions. In addition, it offers wealth management services, including private banking, trust, and portfolio management services, as well as investment solutions; treasury services and securities dealing services; data processing and other back office services; and insurance products and services. Further, the company provides securities and futures broking, and corporate financial advisory; asset management/investment management, property investment, facility management, trustees service, e-payment solutions, cyber banking, credit cards, ATM and I-teller network, foreign currency deposits, remittance, and safe deposit boxes. It operates approximately 200 outlets in Hong Kong and the rest of Greater China, Southeast Asia, the United Kingdom, and the United States. The Bank of East Asia, Limited was incorporated in 1918 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BNKHF": {"short_name": "BOC HONG KONG(HLDGS) LTD", "long_name": "BOC Hong Kong (Holdings) Limited", "summary": "BOC Hong Kong (Holdings) Limited, an investment holding company, provides banking and related financial services to corporate and individual customers in Hong Kong, Mainland China, and internationally. The company operates through four segments: Personal Banking, Corporate Banking, Treasury, and Insurance. It offers savings, current, and time deposit accounts; mortgage plans; overdrafts; personal loans; personal life, medical and accident, travel and leisure, business protection, home, domestic helper, motor, and golfer insurance products; wealth management services; and Internet, phone, and mobile banking services. The company also provides cross-border services for corporate customers; business banking, trade finance and services, investment, treasury, corporate collection and payment, e-commerce, and card services; small business, asset-pledge, machinery and equipment financing, and project financing and syndicated loans; payroll, custody, and cash management services; and business comprehensive, property, liability, group, and retailer comprehensive insurance plans. In addition, it provides investment products and services, including securities, foreign exchange, fund, precious metals and FX margin, bonds, currency linked investment, structured products, bonds, and savings plans. The company operates approximately 190 branches, 280 automated banking centers, and approximately 1,000 self-service machines. BOC Hong Kong (Holdings) Limited was founded in 1917 and is based in Central, Hong Kong. The company is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. BOC Hong Kong (Holdings) Limited is a subsidiary of BOC Hong Kong (BVI) Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BTNB": {"short_name": "BRIDGETOWN 2 HLDGS LTD", "long_name": "Bridgetown 2 Holdings Limited Class A Ordinary Shares", "summary": "Bridgetown 2 Holdings Limited focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. The company was founded in 2020 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BTWN": {"short_name": "Bridgetown Holdings Limited", "long_name": "Bridgetown Holdings Limited", "summary": "Bridgetown Holdings Limited focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses in the technology, financial services, or media sectors. The company was founded in 2020 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BTWNU": {"short_name": "Bridgetown Holdings Limited", "long_name": "Bridgetown Holdings Limited", "summary": "Bridgetown Holdings Limited focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses in the technology, financial services, or media sectors. The company was founded in 2020 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NCM", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "CEVIF": {"short_name": "CHINA EVERBRIGHT LIMITED", "long_name": "China Everbright Limited", "summary": "China Everbright Limited, through its subsidiaries, engages in the investment activities and provision of financial services in Hong Kong and Mainland China. The company invests in unlisted equity securities or equity derivatives, as well as in the areas of new economy, artificial intelligence and advanced manufacturing, new energy, medical care and senior healthcare, overseas acquisition and infrastructure, real estate, aircraft industry chain, mezzanine fund, and others. It also focuses on investing in aircraft leasing, artificial intelligence of things, and elderly care industry platforms; and investing in equity, debts, structured products, and other products. In addition, the company provides a range of financial services, including asset management, investment management, and investment advisory services related to absolute return funds, bond funds, and equity funds, as well as offers management, treasury management, secretarial, money lending, fund management, venture capital, leasing, and consultancy services. The company was founded in 1997 and is headquartered in Hong Kong. China Everbright Limited is a subsidiary of Honorich Holdings Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Hong Kong"}, "CFOO": {"short_name": "CHINA FOODS HOLDINGS LTD", "long_name": "China Foods Holdings Ltd.", "summary": "China Foods Holdings Ltd., a healthcare product distributing and marketing company, develops, markets, promotes, and distributes customized health and wellness care products and services to consumers in China. Its products and services include supplements, healthy snacks, meal replacements, skincare products, and nutritional consultation services. The company is based in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "CGG.F": {"short_name": "SHOUGANG CON.GR.GRP HD-01", "long_name": "Shougang Concord Grand (Group) Limited", "summary": "Shougang Concord Grand (Group) Limited, an investment holding company, provides finance leasing and other financial services in Mainland China and Hong Kong. It operates through three divisions: Finance Leasing and Other Financial Services, Property Leasing and Building Management Services, and Assets Management. The company offers finance leasing for various sectors, including energy, transport, printing equipment, medical equipment, scientific and technical equipment, industrial equipment, etc. It is also involved in the investment, leasing, sale, and management of properties, such as industrial, office, and residential buildings; provision of property consultant, administrative and management, and referral and corporate financial advisory services; and investment and management of industrial funds. Shougang Concord Grand (Group) Limited has a strategic cooperation agreement with Jingdong Digits Technology Holding Co., Ltd. for cooperation in the field of supply chain business. The company is based in Wan Chai, Hong Kong. Shougang Concord Grand (Group) Limited is a subsidiary of Wheeling Holdings Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Credit Services", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "CHWE": {"short_name": "CHINAWE.COM INC", "long_name": "Chinawe.com Inc.", "summary": "Chinawe.com Inc. does not have significant operations. Previously, it was involved in the provision of professional management services relating to non-performing loans, as well as other consulting services in the People's Republic of China. The company was formerly known as Neo Modern Entertainment Corp. Chinawe.com Inc. was founded in 1997 and is headquartered in Kowloon, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kowloon"}, "CQT1.F": {"short_name": "DA YU FINANCI.HLD.HD -,10", "long_name": "Da Yu Financial Holdings Limited", "summary": "Da Yu Financial Holdings Limited provides corporate finance advisory and asset management services. It acts as a financial adviser to advise listed issuers, shareholders, and investors of listed issuers, as well as entities on specific transactions. The company also acts as independent financial adviser to listed issuers to provide independent advice required under the listing rules, the takeovers code, or other specific circumstances. In addition, it acts as financial adviser to listed issuers on retainer basis to advise listed issuers on corporate strategies and compliance with the listing rules, the GEM listing rules, and the takeovers code. The company was formerly known as China Agrotech Holdings Limited and changed its name to Da Yu Financial Holdings Limited in June 2019. Da Yu Financial Holdings Limited was incorporated in 1999 and is headquartered in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "CRCBY": {"short_name": "CHONGQING RURAL COMMERCIAL BANK", "long_name": "Chongqing Rural Commercial Bank Co., Ltd.", "summary": "Chongqing Rural Commercial Bank Co., Ltd., together with its subsidiaries, provides a range of banking and related financial services in the People's Republic of China. It operates in three segments: Corporate Banking, Personal Banking, and Financial Market Operations. The Corporate Banking segment offers financial products and services, including deposit takings, corporate loans, trade financing, financial leasing, and other corporate intermediary services to corporations, government agencies, and financial institutions. The Personal Banking segment provides financial products and services, such as deposit products, personal loans, cards, personal wealth management services, and other types of personal intermediary services to individual customers. The Financial Market Operations segment conducts money market or repurchase transactions; and invests in debt instruments on behalf of customers. The company also provides mobile banking, Internet banking, and telephone banking services. As of 31 December 2019, it operated 1,774 branches including the headquarter and business department, 6 branches, 35 first-level sub-branches, 117 second-level sub-branches, 2 community branch outlets, and 1,612 branch outlets; and 4,911 ATMs and self-service inquiry terminals. The company was formerly known as Chongqing Rural Credit Union and changed its name to Chongqing Rural Commercial Bank Co., Ltd. in 2008. Chongqing Rural Commercial Bank Co., Ltd. was founded in 1951 and is based in Causeway Bay, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Causeway Bay"}, "DEH": {"short_name": "D8 Holdings Corp.", "long_name": "D8 Holdings Corp.", "summary": "D8 Holdings Corp. focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses. The company was founded in 2020 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "DEH-UN": {"short_name": "D8 Holdings Corp.", "long_name": "D8 Holdings Corp.", "summary": "D8 Holdings Corp. focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses. The company was founded in 2020 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "DSACU": {"short_name": "Duddell Street Acquisition Corp", "long_name": "Duddell Street Acquisition Corp.", "summary": "Duddell Street Acquisition Corp. is a blank check company. The company was founded in 2020 and is based in Hong Kong, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Hong Kong"}, "DSFGY": {"short_name": "DAH SING FINANCIAL HLDGS", "long_name": "Dah Sing Financial Holdings Limited", "summary": "Dah Sing Financial Holdings Limited, an investment holding company, provides banking, insurance, financial, and other related services in the People's Republic of China. The company operates through Personal Banking, Commercial Banking, Treasury, Overseas Banking, and Insurance segments. The Personal Banking segment accepts various deposits from individual customers; and provides residential mortgage loans, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts various deposits; and offers loans and working capital financing to commercial, industrial, and institutional customers, as well as trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services. It also manages investment in securities. The Overseas Banking segment offers personal and commercial banking products and services. The Insurance Business segment is involved in the insurance and pension fund management business. The company also provides insurance agency, nominee, and securities dealing services; and invest in properties. The company was formerly known as Fivetech Investments Limited and changed its name to Dah Sing Financial Holdings Limited in July 1987. Dah Sing Financial Holdings Limited was incorporated in 1987 and is based in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "DSR.F": {"short_name": "DAH SING FINL HLDGS", "long_name": "Dah Sing Financial Holdings Limited", "summary": "Dah Sing Financial Holdings Limited, an investment holding company, provides banking, insurance, financial, and other related services in the People's Republic of China. The company operates through Personal Banking, Commercial Banking, Treasury, Overseas Banking, and Insurance segments. The Personal Banking segment accepts various deposits from individual customers; and provides residential mortgage loans, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts various deposits; and offers loans and working capital financing to commercial, industrial, and institutional customers, as well as trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services. It also manages investment in securities. The Overseas Banking segment offers personal and commercial banking products and services. The Insurance Business segment is involved in the insurance and pension fund management business. The company also provides insurance agency, nominee, and securities dealing services; and invest in properties. The company was formerly known as Fivetech Investments Limited and changed its name to Dah Sing Financial Holdings Limited in July 1987. Dah Sing Financial Holdings Limited was incorporated in 1987 and is based in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "E9L.SI": {"short_name": "$ Joyas Intl", "long_name": "Joyas International Holdings Limited", "summary": "Joyas International Holdings Limited, an investment holding company, primarily engages in financing business in the People's Republic of China. The company was incorporated in 1899 and is based in Kwai Chung, Hong Kong.", "currency": "SGD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Kwai Chung"}, "EBML": {"short_name": "EBULLION INC", "long_name": "eBullion, Inc.", "summary": "eBullion, Inc. provides precious metals spot contract trading services for gold and silver trading through electronic trading platform located in Hong Kong. The company was incorporated in 2013 and is based in Tsim Sha Tsui, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "EQOS": {"short_name": "Diginex Limited", "long_name": "Diginex Limited", "summary": "Diginex Limited, a digital asset financial services and advisory company, provides products, architecture, and infrastructure for the financial markets in the areas of digital asset ecosystem in Singapore and internationally. The company operates EQUOS, a cryptocurrency exchange for the professional and individual investors; an over-the-counter trading platform; Digivault, a hot and cold custodian platform for the custody of digital assets for institutional investors; and Diginex Access, a front-to-back integrated trading platform that provides trading and portfolio management solutions to institutional and professional retail clients. It also provides asset management services under the Bletchley Park Asset Management brand name; and securitization advisory, origination, and distribution services. The company was founded in 2017 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "FUTU": {"short_name": "Futu Holdings Limited", "long_name": "Futu Holdings Limited", "summary": "Futu Holdings Limited operates digitized brokerage and wealth management platform in Hong Kong, China, the United States, and internationally. The company's platform offers investing services, including trade execution and margin financing which allows to trade securities, such as stocks, warrants, options and exchange-traded funds in various markets; and wealth management services, which offers various leading fund products, including money market, fixed income, and equity funds products. Its margin financing and securities lending services provides real-time and cross-market securities-backed financing services; and market data and information services. The company was founded in 2011 and is headquartered in Admiralty, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Admiralty"}, "FZV1.F": {"short_name": "APAC RES LTD  HD 1", "long_name": "APAC Resources Limited", "summary": "APAC Resources Limited, an investment holding company, engages in commodity trading and natural resource investment businesses in the People's Republic of China. It operates through Commodity Business; Resource Investment; and Principal Investment and Financial Services segments. The company trades and invests in listed and unlisted securities; provides loan financing services; and invest in loan notes, convertible notes, and other financial assets, as well as invests in and develops mineral resources. It also provides management services; consultancy services in corporate management; and metallurgy technology services. APAC Resources Limited is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "GGPXF": {"short_name": "G-RESOURCES GP LTD", "long_name": "G-Resources Group Limited", "summary": "G-Resources Group Limited, an investment holding company, engages in the principal investment, financial services, and real property businesses. The company is involved in the provision of various financial services, including securities brokerage services, placing and underwriting services, corporate finance advisory services, provision of margin financing, money lending business, investment advisory and management services, and asset management services, as well as securities investment business. It also provides trust and company services; and fund investment services. The company operates in Singapore, Hong Kong, the United States, Europe, and internationally. The company was formerly known as Smart Rich Energy Finance (Holdings) Limited and changed its name to G-Resources Group Limited in June 2009. G-Resources Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "GNTW": {"short_name": "GLOBE NET WIRELESS CORP", "long_name": "Globe Net Wireless Corp.", "summary": "Globe Net Wireless Corp. develops an open source application programming interface ecosystem and provides internet for rural communities. It develops TextPro Connect and BizPro utility service apps for the mobile business market. The company was founded in 2009 and is headquartered in Hong Kong, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Hong Kong"}, "GUE.F": {"short_name": "GUOTAI JUNAN INTL.", "long_name": "Guotai Junan International Holdings Limited", "summary": "Guotai Junan International Holdings Limited, an investment holding company, provides wealth management, brokerage, corporate finance, asset management, loans and financing, financial products, and market making and investment services in Hong Kong and internationally. The company's Brokerage segment is involved in securities, futures, options, and leveraged foreign exchange dealing and brokerage; and the provision of insurance brokerage services. Its Corporate Finance segment provides advisory services; and placing and underwriting services of debt and equity securities. The company's Asset Management segment offers asset management services comprising fund management and investment advisory services. Its Loans and Financing segment provides margin financing products, securities borrowing and lending to margin customers, initial public offering loans, other loans to customers, and bank deposits. The company's Financial Products, Market Making and Investments segment offers funds, fixed income securities, and equity investments, as well as structuring of financial products; and trades in and markets debt securities, exchange traded funds, and derivatives. Its Other segment provides information channel services. The company was founded in 1995 and is based in Central, Hong Kong. Guotai Junan International Holdings Limited is a subsidiary of Guotai Junan Holdings Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "HIUC.F": {"short_name": "CN TAIPING INS.HLD.(BL200", "long_name": "China Taiping Insurance Holdings Company Limited", "summary": "China Taiping Insurance Holdings Company Limited, an investment holding company, underwrites direct life insurance, property and casualty insurance, and various classes of reinsurance products in People's Republic of China and internationally. It operates through Life Insurance Business, PRC Property and Casualty Insurance Business, Overseas Property and Casualty Insurance Business, Reinsurance Business, Pension and Group Life Insurance Business, and Other Businesses segments. The company's life insurance products include individual and group life insurance, health insurance, accident insurance, and annuity. Its property and casualty insurance products comprise compulsory motor insurance; and liability insurance, credit insurance, guarantee insurance, and short-term accident and health insurance, as well as related reinsurance products. The company's reinsurance portfolio covers property damage, life, marine cargo and hull, and miscellaneous non-marine classes. The company is also involved in the pension, assets management, insurance intermediary, financial leasing, property investment, securities dealing and broking, and elderly care investment businesses; and manages investment funds. In addition, it provides back to back financing arrangement, and insurance broking and agency services. The company was formerly known as China Insurance International Holdings Company Limited and changed its name to China Taiping Insurance Holdings Company Limited in August 2009. The company was incorporated in 2000 and is headquartered in North Point, Hong Kong. China Taiping Insurance Holdings Company Limited is a subsidiary of China Taiping Insurance Group (HK) Company Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Insurance—Life", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "North Point"}, "HKB.SI": {"short_name": "AMTD IB OV", "long_name": "AMTD International Inc.", "summary": "AMTD International Inc., an investment holding company, engages in investment banking activities in Hong Kong, Mainland China, the United States, and internationally. The company operates through three segments: Investment Banking, Asset Management, and Strategic Investment. It offers a range of investment banking services, including equity underwriting, debt underwriting, securities brokerage, institutional sales and distribution, and research, as well as advisory services on credit rating, financing, and mergers and acquisitions transactions. The company also provides professional investment management and advisory services primarily to corporate and other institutional clients. In addition, it makes long-term strategic investments focusing on Asia's financial and new economy sectors. The company was formerly known as AMTD Inc. AMTD International Inc. was incorporated in 2019 and is headquartered in Central, Hong Kong. AMTD International Inc. is as subsidiary of AMTD Group Company Limited.", "currency": "SGD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "SES", "market": "sg_market", "country": "Hong Kong", "city": "Central"}, "HKIB": {"short_name": "AMTD International Inc.", "long_name": "AMTD International Inc.", "summary": "AMTD International Inc., an investment holding company, engages in investment banking activities in Hong Kong, Mainland China, the United States, and internationally. The company operates through three segments: Investment Banking, Asset Management, and Strategic Investment. It offers a range of investment banking services, including equity underwriting, debt underwriting, securities brokerage, institutional sales and distribution, and research, as well as advisory services on credit rating, financing, and mergers and acquisitions transactions. The company also provides professional investment management and advisory services primarily to corporate and other institutional clients. In addition, it makes long-term strategic investments focusing on Asia's financial and new economy sectors. The company was formerly known as AMTD Inc. AMTD International Inc. was incorporated in 2019 and is headquartered in Central, Hong Kong. AMTD International Inc. is as subsidiary of AMTD Group Company Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HKQ3.F": {"short_name": "CHINA VER.FI.HOLD.(10000)", "long_name": "China Vered Financial Holding Corporation Limited", "summary": "China Vered Financial Holding Corporation Limited, an investment holding company, provides asset management, consultancy, financing, and securities advisory and brokerage services. It also provides insurance agency and money lending services. The company was formerly known as China Minsheng Financial Holding Corporation Limited and changed its name to China Vered Financial Holding Corporation Limited in July 2020. China Vered Financial Holding Corporation Limited is based in Causeway Bay, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "HKXCF": {"short_name": "HONG KONG EXCHANGES & CLEARING", "long_name": "Hong Kong Exchanges and Clearing Limited", "summary": "Hong Kong Exchanges and Clearing Limited, together with its subsidiaries, owns and operates stock exchanges and futures exchanges, and related clearing houses in Hong Kong, Mainland China, and the United Kingdom. It operates in five segments: Cash, Equity and Financial Derivatives, Commodities, Post Trade, and Technology. The Cash segment covers various equity products traded on the cash market platforms, the Shanghai Stock Exchange, and the Shenzhen Stock Exchange; sale of market data relating to the products; and other related activities. The Equity and Financial Derivatives segment provides and maintains trading platforms for a range of equity and financial derivative products, such as stock and equity index futures and options, derivative warrants, and callable bull/bear contracts and warrants, as well as sells related market data. The Commodities segment operates an exchange for the trading of base, ferrous, and precious metals futures and options contracts in the United Kingdom; and operates Qianhai Mercantile Exchange Co., Ltd., a commodity trading platform in the Mainland. This segment also comprises London metal mini futures, and gold and iron ore futures contracts traded on Futures Exchange. The Post Trade segment operates clearing houses that are responsible for clearing, settlement, depository, custodian, and nominee services. The Technology segment offers various services that provide users with access to the platform and infrastructure. The company serves issuers and investors. Hong Kong Exchanges and Clearing Limited is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HKXCY": {"short_name": "HONG KONG EXCHANGES & CLEARING", "long_name": "Hong Kong Exchanges and Clearing Limited", "summary": "Hong Kong Exchanges and Clearing Limited, together with its subsidiaries, owns and operates stock exchanges and futures exchanges, and related clearing houses in Hong Kong, Mainland China, and the United Kingdom. It operates in five segments: Cash, Equity and Financial Derivatives, Commodities, Post Trade, and Technology. The Cash segment covers various equity products traded on the cash market platforms, the Shanghai Stock Exchange, and the Shenzhen Stock Exchange; sale of market data relating to the products; and other related activities. The Equity and Financial Derivatives segment provides and maintains trading platforms for a range of equity and financial derivative products, such as stock and equity index futures and options, derivative warrants, and callable bull/bear contracts and warrants, as well as sells related market data. The Commodities segment operates an exchange for the trading of base, ferrous, and precious metals futures and options contracts in the United Kingdom; and operates Qianhai Mercantile Exchange Co., Ltd., a commodity trading platform in the Mainland. This segment also comprises London metal mini futures, and gold and iron ore futures contracts traded on Futures Exchange. The Post Trade segment operates clearing houses that are responsible for clearing, settlement, depository, custodian, and nominee services. The Technology segment offers various services that provide users with access to the platform and infrastructure. The company serves issuers and investors. Hong Kong Exchanges and Clearing Limited is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Financial Data & Stock Exchanges", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HQF.F": {"short_name": "EMPEROR CAPITAL GRP HD-01", "long_name": "Emperor Capital Group Limited", "summary": "Emperor Capital Group Limited, an investment holding company, provides a range of financial services in Hong Kong, the United States, and internationally. The company operates through Financing, Brokerage, Placing and Underwriting, and Corporate Finance segments. It offers commercial and personal loans comprising short-term unsecured loans, such as tax loans, bridging loans, term loans, and personal loans, as well as long-term secured loans, including property mortgage loans; and margin and initial public offering (IPO) financing. The company also provides brokerage services for securities, futures, and options traded on the exchanges in Hong Kong, Mainland China, and overseas countries; wealth management services, such as providing advice regarding an array of investment services, including securities, mutual funds, insurance-linked products, and real estate investment; asset management services; and discretionary investment services. In addition, it offers placing and underwriting services, as well as acts as a placing agents and underwriters for various Hong Kong listed companies; and corporate finance advisory services on takeovers code related transactions and undertakes sponsor work for IPOs, as well as provides advisory for corporate transactions, including placing, rights issue, corporate restructuring, and merger and acquisition services. Further, the company provides promotion and marketing, and insurance and other brokerage services. Emperor Capital Group Limited was founded in 1993 and is headquartered in Wanchai, Hong Kong. Emperor Capital Group Limited is a subsidiary of Emperor Capital Group Holdings Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wanchai"}, "HSNGF": {"short_name": "HANG SENG BANK", "long_name": "Hang Seng Bank Limited", "summary": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance and wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment, and corporate wealth management services, as well as general banking, interest rate, money market, structured, derivative products, etc. In addition, the company offers trustee, nominee, fund management, stock broking, and property management services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 290 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, operates a mainland China network with outlets in the Pearl River delta, the Yangtze River delta, the Bohai Rim region, and Midwest China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HSNGY": {"short_name": "HANG SENG BANK", "long_name": "Hang Seng Bank Limited", "summary": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance and wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment, and corporate wealth management services, as well as general banking, interest rate, money market, structured, derivative products, etc. In addition, the company offers trustee, nominee, fund management, stock broking, and property management services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 290 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, operates a mainland China network with outlets in the Pearl River delta, the Yangtze River delta, the Bohai Rim region, and Midwest China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "KRBF": {"short_name": "KREIDO BIOFUELS INC", "long_name": "Kreido Biofuels, Inc.", "summary": "Kreido Biofuels, Inc. does not have significant operations. The company intends to seek opportunities to effect a merger, capital stock exchange, asset acquisition, stock purchase, reorganization, or similar business combination with one or more businesses. Previously, it was involved in the development of biodiesel production plants. Kreido Biofuels, Inc. is based in Tsim Sha Tsui, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "LGHL": {"short_name": "Lion Group Holding Ltd.", "long_name": "Lion Group Holding Ltd.", "summary": "Lion Group Holding Ltd., together with its subsidiaries, operates a trading platform in Hong Kong. The company's trading platform offers a range of products and services, including contract-for-difference trading, insurance brokerage, and futures and securities brokerage services for investors and institutional clients. It also provides total return swap (TRS) services, which include A-shares and Hong Kong stock basket-linked TRS. Lion Group Holding Ltd. is headquartered in Kowloon Bay, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "MB01.F": {"short_name": "SCULLY ROYALTY LTD.", "long_name": "Scully Royalty Ltd.", "summary": "Scully Royalty Ltd. operates as a merchant banking company worldwide. The company operates through Iron Ore Royalty, Industrial Equity, and Merkanti Holding segments. The Iron Ore Royalty segment includes interest in a Scully iron ore mine. The Industrial Equity segment consists of various projects in resources and services, including hydrocarbon production and processing assets in Canada, as well as a mining sub-lease of the lands upon which the Scully iron ore mine is situated in Newfoundland and Labrador, Canada. The Merkanti Holding segment regulates trade finance and merchant banking businesses. The company engages in manufacturing, natural resources and medical supplies and services. The company was formerly known as MFC Bancorp Ltd. and changed its name to Scully Royalty Ltd. in June 2019. Scully Royalty Ltd. was incorporated in 2017 and is based in Central, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "MLAC": {"short_name": "Malacca Straits Acquisition Com", "long_name": "Malacca Straits Acquisition Company Limited", "summary": "Malacca Straits Acquisition Company Limited focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on businesses which are part of Southeast Asian business conglomerates in the media, food processing, renewable energy, and healthcare industries. The company was formerly known as Bilbao Street Limited and changed its name to Malacca Straits Acquisition Company Limited in February 2020. Malacca Straits Acquisition Company Limited was incorporated in 2019 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "MLACU": {"short_name": "Malacca Straits Acquisition Com", "long_name": "Malacca Straits Acquisition Company Limited", "summary": "Malacca Straits Acquisition Company Limited focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses. It intends to focus on businesses which are part of Southeast Asian business conglomerates in the media, food processing, renewable energy, and healthcare industries. The company was formerly known as Bilbao Street Limited and changed its name to Malacca Straits Acquisition Company Limited in February 2020. Malacca Straits Acquisition Company Limited was incorporated in 2019 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "MNA1.F": {"short_name": "YUNFENG FINANCIAL GRP LTD", "long_name": "Yunfeng Financial Group Limited", "summary": "Yunfeng Financial Group Limited, an investment holding company, provides insurance products in Hong Kong and Macau. The company operates in two segments, Insurance Products, and Other Financial Services and Corporate. It provides a range of insurance products, including life insurance, medical insurance, annuities, pension, and mandatory provident fund schemes. The company also provides fund and asset management services, as well as financing and investing solutions; and corporate advisory, and securities placing and underwriting advisory services. In addition, it engages in financial technology activities; and provision of employee stock ownership plan administration and principal investment. Further, the company provides administrative, trustee, and general services; agency services to non-life insurers; marketing and promoting products, and public relations services; Internet and multimedia systems, and application development services; and technological development of computer software and hardware, technical consulting, technology services, and database and computer network services. The company was formerly known as REORIENT GROUP LIMITED and changed its name to Yunfeng Financial Group Limited in October 2016. The company is based in Central, Hong Kong. Yunfeng Financial Group Limited is a subsidiary of Yunfeng Financial Holdings Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "NNAX": {"short_name": "NEW MOMENTUM CORP", "long_name": "New Momentum Corporation", "summary": "Gagfare Limited operates an online platform that enables travelers to search flights and airfare, as well as to book online. The company was incorporated in 2015 and is based in North Point, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "North Point"}, "OWH.SG": {"short_name": "Oi Wah Pawnshop Credit Hldgs Re", "long_name": "Oi Wah Pawnshop Credit Holdings Limited", "summary": "Oi Wah Pawnshop Credit Holdings Limited, an investment holding company, engages in the provision of secured financing services to high-net-worth customers in Hong Kong. It offers mortgage and pawn loans, and money lending services, as well as consulting services. The company was founded in 1975 and is headquartered in Wan Chai, Hong Kong. Oi Wah Pawnshop Credit Holdings Limited is a subsidiary of Kwan Lik Holding Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Mortgage Finance", "exchange": "STU", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "PHUP.SG": {"short_name": "Sino Prosper (Group) Hldgs LtdR", "long_name": "Sino Prosper (Group) Holdings Limited", "summary": "Sino Prosper (Group) Holdings Limited, an investment holding company, invests in energy and natural resources related projects in the People's Republic of China. It operates through Investment in Energy and Natural Resources Related Projects, Money Lending, and Food and Beverage segments. The company holds interests in the Aohan Qi gold mine located in Inner Mongolia; and the Heilongjiang project. It also provides loan financing, and investment and management consultation services. In addition, the company imports, distributes, and sells food and beverage products. Further, it is involved in the provision of administrative, investment, management, mining consultation, and micro-financing services; and exploration and mining of gold. The company was formerly known as Sino Prosper State Gold Resources Holdings Limited and changed its name to Sino Prosper (Group) Holdings Limited in January 2014. Sino Prosper (Group) Holdings Limited is headquartered in Admiralty, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Credit Services", "exchange": "STU", "market": "dr_market", "country": "Hong Kong", "city": "Admiralty"}, "PLTYF": {"short_name": "PLASTEC TECHNOLOGIES LTD", "long_name": "Plastec Technologies, Ltd.", "summary": "Plastec Technologies, Ltd. does not have significant business operations. Previously, it offered precision plastic manufacturing services, including mold design and fabrication, and plastic injection. The company was founded in 1993 and is based in Kwun Tong, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kwun Tong"}, "POYN": {"short_name": "PO YUEN CULTURAL HLDGS HK CO LT", "long_name": "Po Yuen Cultural Holdings (Hong Kong) Co., Ltd.", "summary": "Po Yuen Cultural Holdings (Hong Kong) Co., Ltd. does not have significant operations. It intends to engage in business opportunities through a merger or acquisition with an unidentified company or an acquisition of assets. The company was formerly known as Asia Training Institute, Inc. and changed its name to Po Yuen Cultural Holdings (Hong Kong) Co., Ltd. in December 2017. Po Yuen Cultural Holdings (Hong Kong) Co., Ltd. was founded in 2014 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "PV-UN": {"short_name": "Primavera Capital Acquisition C", "long_name": "Primavera Capital Acquisition Corporation", "summary": "Primavera Capital Acquisition Corporation does not have significant operations. It intends to effect a merger, share exchange, asset acquisition, share purchase, reorganization, or other similar business combination with one or more operating businesses. The company was incorporated in 2020 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "PVEG": {"short_name": "PACIFIC VEGAS GLOBAL STRATEGIES", "long_name": "Pacific Vegas Global Strategies, Inc.", "summary": "Pacific Vegas Global Strategies, Inc. does not have significant operations. Previously, it operated as a gaming company that conducted an offshore business of international sportsbook through telecommunications and the Internet. The company was formerly known as Goaltimer International, Inc. Pacific Vegas Global Strategies, Inc. was incorporated in 1990 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "QRC.V": {"short_name": "QUEENS ROAD CAPITAL INVESTMENT ", "long_name": "Queen's Road Capital Investment Ltd.", "summary": "Queen's Road Capital Investment Ltd., a resource focused investment company, invests in privately held and publicly traded resource companies. It acquires and holds securities of long-term capital appreciation and short-term gains with a focus on convertible debt securities and resource projects. The company was formerly known as Lithion Energy Corp. and changed its name to Queen's Road Capital Investment Ltd. in February 2020. Queen's Road Capital Investment Ltd. was incorporated in 2011 and is based in Central, Hong Kong.", "currency": "CAD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "VAN", "market": "ca_market", "country": "Hong Kong", "city": "Central"}, "RIA.F": {"short_name": "RIVERA (HLDGS)LTD", "long_name": "Rivera (Holdings) Limited", "summary": "Rivera (Holdings) Limited, an investment holding company, engages in property development and investment, and securities trading and investment businesses in Hong Kong, Macau, and Mainland China. The company develops, sells, and leases residential and commercial cum-office development projects; and holds, sells, and leases approximately 300 car parking spaces. It also provides investment management services. The company was incorporated in 1964 and is based in Central, Hong Kong. Rivera (Holdings) Limited is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "RPGA.F": {"short_name": "REGENT PAC.GRP NEW DL-,10", "long_name": "Regent Pacific Group Limited", "summary": "Regent Pacific Group Limited, an investment holding company, holds investments in the healthcare and life sciences companies in China, Europe, Hong Kong, and Taiwan. It operates in two segments, Biopharma and Corporate Investment. The company engages in the research, development, manufacture, marketing, and sale of pharmaceutical products for the treatment and management of urological disorders. It focuses on the commercialization of Fortacin, a topical prescription treatment for premature ejaculation. The company also invests in listed and unlisted corporate entities. In addition, it provides management, mill expansion, metallurgical, and corporate finance services. Further, the company focuses on zinc/copper projects in the Pilbara region of Western Australia. Regent Pacific Group Limited was founded in 1991 and is headquartered in Central, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "RPGLF": {"short_name": "REGENT PACIFIC GROUP LIMITED", "long_name": "Regent Pacific Group Limited", "summary": "Regent Pacific Group Limited, an investment holding company, holds investments in the healthcare and life sciences companies in China, Europe, Hong Kong, and Taiwan. It operates in two segments, Biopharma and Corporate Investment. The company engages in the research, development, manufacture, marketing, and sale of pharmaceutical products for the treatment and management of urological disorders. It focuses on the commercialization of Fortacin, a topical prescription treatment for premature ejaculation. The company also invests in listed and unlisted corporate entities. In addition, it provides management, mill expansion, metallurgical, and corporate finance services. Further, the company focuses on zinc/copper projects in the Pilbara region of Western Australia. Regent Pacific Group Limited was founded in 1991 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "SG51.F": {"short_name": "SGOCO GROUP LTD.  DL-,004", "long_name": "SGOCO Group, Ltd.", "summary": "SGOCO Group, Ltd. designs, develops, and manufactures phase change material storage systems for applications on cooling and heating systems in Mainland China and Hong Kong. The company's products include phase change material thermal energy storage products; LCD/LED monitors; and TV product-related and application-specific products. It is also involved in money lending services; and property lease and management activities. In addition, the company provides fintech and IT support services. It sells its products under the SGOCO, No. 10, and POVIZON brand names. The company was formerly known as SGOCO Technology, Ltd. SGOCO Group, Ltd. was founded in 2005 and is headquartered in Tsuen Wan, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Credit Services", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "SGOC": {"short_name": "SGOCO Group, Ltd", "long_name": "SGOCO Group, Ltd.", "summary": "SGOCO Group, Ltd. designs, develops, and manufactures phase change material storage systems for applications on cooling and heating systems in Mainland China and Hong Kong. The company's products include phase change material thermal energy storage products; LCD/LED monitors; and TV product-related and application-specific products. It is also involved in money lending services; and property lease and management activities. In addition, the company provides fintech and IT support services. It sells its products under the SGOCO, No. 10, and POVIZON brand names. The company was formerly known as SGOCO Technology, Ltd. SGOCO Group, Ltd. was founded in 2005 and is headquartered in Tsuen Wan, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Credit Services", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Tsuen Wan"}, "SHK.SG": {"short_name": "SUN HUNG KAI & CO. LTD. Registe", "long_name": "Sun Hung Kai & Co. Limited", "summary": "Sun Hung Kai & Co. Limited, an investment holding company, provides financial services in Hong Kong and Mainland China. It operates through Consumer Finance, Mortgage Loans, Specialty Finance, Investment Management, Strategic Investments, and Group Management and Support segments. The company offers loan products to individuals and businesses through branches and online platforms; and funding solutions to corporates to corporates, investment funds, and high net worth individuals. It also provides structured and specialty financing, consumer SME and other financing, portfolio investments, investments in financial services, and liquidity services. In addition, the company offers secretarial, financial consultancy, and asset management services. The company was founded in 1969 and is headquartered in Causeway Bay, Hong Kong. Sun Hung Kai & Co. Limited is a subsidiary of AP Emerald Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "STU", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "SLCRU": {"short_name": "Silver Crest Acquisition Corpor", "long_name": "Silver Crest Acquisition Corporation", "summary": "Silver Crest Acquisition Corporation focuses on effecting a merger, share exchange, asset acquisition, share purchase, reorganization, or similar business combination with one or more businesses or entities. The company was founded in 2020 and is based Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "SRL": {"short_name": "Scully Royalty Ltd.", "long_name": "Scully Royalty Ltd.", "summary": "Scully Royalty Ltd. operates as a merchant banking company worldwide. The company operates through Iron Ore Royalty, Industrial Equity, and Merkanti Holding segments. The Iron Ore Royalty segment includes interest in a Scully iron ore mine. The Industrial Equity segment consists of various projects in resources and services, including hydrocarbon production and processing assets in Canada, as well as a mining sub-lease of the lands upon which the Scully iron ore mine is situated in Newfoundland and Labrador, Canada. The Merkanti Holding segment regulates trade finance and merchant banking businesses. The company engages in manufacturing, natural resources and medical supplies and services. The company was formerly known as MFC Bancorp Ltd. and changed its name to Scully Royalty Ltd. in June 2019. Scully Royalty Ltd. was incorporated in 2017 and is based in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "TFN4.F": {"short_name": "GOME FINANCE TECH.HD-,10", "long_name": "Gome Finance Technology Co., Ltd.", "summary": "Gome Finance Technology Co., Ltd., an investment holding company, provides various financial services in Hong Kong and People's Republic of China. The company offers commercial factoring, financial leasing, personal property pawn loans, real estate mortgage loans, and money lending services. It also provides consultancy and technical advisory services. The company was formerly known as Sino Credit Holdings Limited and changed its name to Gome Finance Technology Co., Ltd. in February 2017. The company is headquartered in Central, Hong Kong. Gome Finance Technology Co., Ltd. is a subsidiary of Swiree Capital Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Credit Services", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "TFZ.F": {"short_name": "HAITONG INTL SEC.GR.HD-10", "long_name": "Haitong International Securities Group Limited", "summary": "Haitong International Securities Group Limited provides financial products and services to corporate, institutional, and retail clients worldwide. The Wealth Management segment offers financial services and investment solutions to retail and high net-worth clients. This segment engages in securities broking and dealing, futures, and options contracts; foreign exchange trading; over the counter products and risk management instruments sales; securities margin financing; and the provision of investment advisory, financial planning, and investment funds distribution services, as well and custodian services. The Corporate Finance segment provides sponsoring and underwriting services for fund raising activities in equity and debt capital markets. This segment also offers advisory services and financing solutions for corporate actions, such as mergers and acquisitions, assets restructuring, etc. The Asset Management segment offers investment management services, including public funds, private funds, and mandatory provident funds to individual, corporate, and institutional clients. The Institutional Clients segment provides cash equities sales and trading; brokerage; stock borrowing and lending; equity research; investment and financing solutions; and financial instruments, such as fixed income products, currency and commodity products, futures and options, exchange traded funds, and derivative products in financial centers for institutional clients. The Investment segment invests in investment funds and private equity investments. The company was formerly known as Taifook Securities Group Limited and changed its name to Haitong International Securities Group Limited in November 2010. The company was founded in 1973 and is headquartered in Central, Hong Kong. Haitong International Securities Group Limited operates as a subsidiary of Haitong International Holdings Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "TJV.F": {"short_name": "SOUTH.SECS INTL SECS", "long_name": "Southwest Securities International Securities Limited", "summary": "Southwest Securities International Securities Limited provides various financial services in Hong Kong. It operates through Brokerage and Margin Financing, Corporate Finance, Asset Management, and Proprietary Trading segments. It acts as financial advisor for mergers and acquisitions, reorganizations, general offers, acquisition financing, and private equity transactions; and a compliance and independent financial adviser. The company also offers debt products, including investment-grade, high-yield, convertible, preferred stock, and panda bonds; equity capital market services; asset management services and advice on securities for corporations, institutions, and high-net-worth individuals. In addition, it is involved in the stock brokerage, securities margin financing and underwriting, subscription of initial public offering, placement of shares, bonds brokerage, and exchange traded fund activities, as well as the trading of real estate investment trust, stock warrants, stock options, and CBBCs. Further, the company offers consultation and trading services in the futures market, as well as custodian services; cash management and financing, investment management, wealth planning, and insurance planning services; investment products, such as equity, fixed income, and alternative assets; insurance products; investment immigration services; and loan services to allow individuals and corporate clients. Additionally, it distributes unit trusts, mutual funds, investment- linked, and mandatory provident fund products; and provides personal financial consulting and planning, and insurance broking services. The company was formerly known as Tanrich Financial Holdings Limited and changed its name to Southwest Securities International Securities Limited in May 2015. The company was founded in 1990 and is headquartered in Wan Chai, Hong Kong. Southwest Securities International Securities Limited is a subsidiary of Southwest Securities International Investment Limited.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "TWN": {"short_name": "Taiwan Fund, Inc. (The)", "long_name": "The Taiwan Fund, Inc.", "summary": "The Taiwan Fund, Inc. is a closed-ended equity mutual fund launched and managed by JF International Management Inc. It invests in the public equity markets of Taiwan. The fund seeks to invest in stocks of companies operating across diversified sectors. It employs fundamental analysis focusing on such factors as overall growth prospects, competitive position in the respective industry, technology, research, and development, productivity, labor costs, raw material costs and sources, profit margins, return on investment, capital resources, government regulation, and management to create its portfolio. The fund benchmarks the performance of its portfolio against the TAIEX Total Return Index. The Taiwan Fund, Inc. was formed on December 23, 1986 and is domiciled in the United States.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "UOLI": {"short_name": "UONLIVE CORPORATION", "long_name": "Uonlive Corporation", "summary": "Uonlive Corporation focuses on the tea plantation and production related research, development, sale, trading, and consulting businesses primarily in Hong Kong. Its business focus also includes agricultural tourism. The company was formerly known as China World Trade Corporation and changed its name to Uonlive Corporation in July 2008. Uonlive Corporation is headquartered in Admiralty, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Admiralty"}, "VPGLF": {"short_name": "VALUE PARTNERS GROUP LTD", "long_name": "Value Partners Group Limited", "summary": "Value Partners Group Limited is a publicly owned investment manager. The firm manages separate client focused portfolios. The firm manages separate client-focused equity, fixed income, multi-asset, alternative portfolios, and quantitative investment solutions. The firm invests in the public equity and fixed income markets across the globe. It primarily provides investment management services to investment funds and managed accounts. The firm employs fundamental analysis with bottom-up stock picking approach. The firm conducts in-house research to make its investments. Value Partners Group Limited was founded on 1993 and is based in Hong Kong with additional offices in Beijing, Boston, Shanghai, Shenzhen, Kuala Lumpur, Singapore and London.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "WAY.F": {"short_name": "SHENWAN HONGYUAN (HK)LTD.", "long_name": "Shenwan Hongyuan (H.K.) Limited", "summary": "Shenwan Hongyuan (H.K.) Limited, an investment holding company, engages in brokerage, corporate finance, asset management, financing and loan, and investment and other businesses in Hong Kong. The company operates in five segments: Enterprise Finance, Personal Finance and Wealth Management, Institutional Services and Trading, Investment Management, and Others. It offers stock underwriting sponsor, bond underwriting, and financial advisory services for corporate clients; and external equity investment, debt investment, other investments, and structured financing solutions. The company also provides securities, futures, and options brokerage services; and wealth management, OTC, and securities margin financing products to individual customers and non-professional institutional investors. In addition, it provides stock brokerage and trading services; research advisory, and investment and financing solutions; and sales, trading, hedging, and over-the-counter derivative services to institutional clients, as well as sells and trades in fixed income bonds, currencies, and commodities. Further, the company offers asset management, investment advisory, and public and private fund management services. Additionally, it offers management and treasury, and share custodian and nominee services; leases computer equipment; and holds properties. The company was formerly known as Shenyin Wanguo (H.K.) Limited and changed its name to Shenwan Hongyuan (H.K.) Limited in May 2015. Shenwan Hongyuan (H.K.) Limited was incorporated in 1972 and is headquartered in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Capital Markets", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "WSL.L": {"short_name": "WORLDSEC LD ORD USD0.001", "long_name": "Worldsec Limited", "summary": "Worldsec Limited, a closed-ended investment company, invests in small to medium sized trading companies in the Greater China and South East Asian regions. The company was founded in 1991 and is based in Sheung Wan, Hong Kong.", "currency": "GBp", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Hong Kong", "city": "Sheung Wan"}, "YUIA.F": {"short_name": "PLANETREE INTL.DEV.HD-,10", "long_name": "Planetree International Development Limited", "summary": "Planetree International Development Limited, an investment holding company, engages in treasury management, financial, and money lending businesses in Hong Kong. The company is involved in trading and holding debt and equity securities; financing and securities investment activities; property leasing; dealing in futures contracts; and securities investment activities. It also offers corporate management services; securities brokerage and financial services; and asset management services. The company was formerly known as Yugang International Limited and changed its name to Planetree International Development Limited in July 2019. Planetree International Development Limited is headquartered in North Point, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Financial Conglomerates", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "North Point"}, "YUM.F": {"short_name": "SHK HONG KONG INDS.", "long_name": "SHK Hong Kong Industries Limited", "summary": "SHK Hong Kong Industries Limited is a publicly owned investment manager. The company invests primarily in telecommunications, properties for sale and rent, infrastructure and logistics, hotel operation, food and beverage, and transportation sectors. It prefers to invest in Hong Kong, Singapore, United States, Japan, Malaysia, Taiwan, and China. SHK Hong Kong Industries Limited was formerly known as Yu Ming Investments Limited. SHK Hong Kong Industries Limited was founded in 1990 and is based in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wanchai"}, "YUSG": {"short_name": "YUS INTERNATIONAL GROUP LTD", "long_name": "YUS International Group Limited", "summary": "YUS International Group Limited does not have significant operations. The company intends to seek and identify appropriate business opportunity for the development of new line of business. Previously, it provided brainstorming, storyboarding, commercials and advertisement production, and media planning services to advertisers in Hong Kong. The company was formerly known as Asian Trends Media Holdings, Inc. and changed its name to YUS International Group Limited in March 2013. YUS International Group Limited was incorporated in 2002 and is based in Kowloon Bay, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Shell Companies", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Kowloon Bay"}}