{"0033.HK": {"short_name": "AMBER HILL FIN", "long_name": "Amber Hill Financial Holdings Limited", "summary": "Amber Hill Financial Holdings Limited, an investment holding company, primarily engages in the trading of party products, and metals and minerals in Hong Kong and North America. It trades in party accessories, decorations, cutlery, and eatery wares. The company also provides securities brokerage and asset management services. In addition, it is involved in the personal and corporate loans business; credit guarantee and investment activities; and trading of security products and provision of security services, as well as advancing business. The company was formerly known as China Cloud Copper Company Limited and changed its name to Amber Hill Financial Holdings Limited in July 2020. Amber Hill Financial Holdings Limited was founded in 1996 and is headquartered in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "0165.HK": {"short_name": "CHINA EB LTD", "long_name": "China Everbright Limited", "summary": "China Everbright Limited, through its subsidiaries, engages in the investment activities and provision of financial services in Hong Kong and Mainland China. The company invests in unlisted equity securities or equity derivatives, as well as in the areas of new economy, artificial intelligence and advanced manufacturing, new energy, medical care and senior healthcare, overseas acquisition and infrastructure, real estate, aircraft industry chain, mezzanine fund, and others. It also focuses on investing in aircraft leasing, artificial intelligence of things, and elderly care industry platforms; and investing in equity, debts, structured products, and other products. In addition, the company provides a range of financial services, including asset management, investment management, and investment advisory services related to absolute return funds, bond funds, and equity funds, as well as offers management, treasury management, secretarial, money lending, fund management, venture capital, leasing, and consultancy services. The company was founded in 1997 and is headquartered in Hong Kong. China Everbright Limited is a subsidiary of Honorich Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Hong Kong"}, "0174.HK": {"short_name": "GEMINI INV", "long_name": "Gemini Investments (Holdings) Limited", "summary": "Gemini Investments (Holdings) Limited, an investment holding company, engages in fund platform, property investment and development, fund investments, and securities investment businesses. It is also involved in provision of project management; securities investment and trading; fund management; and real estate consultancy services. In addition, the company invests in real estate fund platform; leases office properties and residential condominium; and provides management and administration services for property development project. It has operations in Hong Kong, the United States, Australia, the People's Republic of China, and internationally. The company was formerly known as Gemini Property Investments Limited and changed its name to Gemini Investments (Holdings) Limited in July 2011. The company was incorporated in 1987 and is based in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0245.HK": {"short_name": "CHINA VERED FIN", "long_name": "China Vered Financial Holding Corporation Limited", "summary": "China Vered Financial Holding Corporation Limited, an investment holding company, provides asset management, consultancy, financing, and securities advisory and brokerage services. It also provides insurance agency and money lending services. The company was formerly known as China Minsheng Financial Holding Corporation Limited and changed its name to China Vered Financial Holding Corporation Limited in July 2020. China Vered Financial Holding Corporation Limited is based in Causeway Bay, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "0612.HK": {"short_name": "CHINA DYF", "long_name": "China Ding Yi Feng Holdings Limited", "summary": "China Ding Yi Feng Holdings Limited is a publicly owned investment manager. The firm invests in the private equity, and venture capital markets across the globe. The firm also invests in e-commerce & internet services and high technology industry. The firm seeks to invest in listed and unlisted companies in the PRC and Hong Kong. The firm employs a combination of quantitative and qualitative analysis to create its investment portfolios. It was formerly known as China Investment Fund International Holdings Limited. China Ding Yi Feng Holdings Limited was established in 2001 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Kowloon"}, "0666.HK": {"short_name": "SHK HK IND", "long_name": "SHK Hong Kong Industries Limited", "summary": "SHK Hong Kong Industries Limited is a publicly owned investment manager. The company invests primarily in telecommunications, properties for sale and rent, infrastructure and logistics, hotel operation, food and beverage, and transportation sectors. It prefers to invest in Hong Kong, Singapore, United States, Japan, Malaysia, Taiwan, and China. SHK Hong Kong Industries Limited was formerly known as Yu Ming Investments Limited. SHK Hong Kong Industries Limited was founded in 1990 and is based in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wanchai"}, "0913.HK": {"short_name": "UNITY INV HOLD", "long_name": "Unity Investments Holdings Limited", "summary": "Unity Investments Holdings, Ltd. and its subsidiaries engage primarily in investment holding in listed and unlisted companies. The firm invests in both listed and unlisted companies, and the current core portfolio comprises of mainly small to medium sized listed companies. It invests in a wide array of industries and sectors like securities investment companies and companies engaging in the businesses of infrastructure, manufacturing, trading, information technologies, media, energy, property investment and securities investment. Unity Investments Holdings, Ltd. is based in Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "1051.HK": {"short_name": "G-RESOURCES", "long_name": "G-Resources Group Limited", "summary": "G-Resources Group Limited, an investment holding company, engages in the principal investment, financial services, and real property businesses. The company is involved in the provision of various financial services, including securities brokerage services, placing and underwriting services, corporate finance advisory services, provision of margin financing, money lending business, investment advisory and management services, and asset management services, as well as securities investment business. It also provides trust and company services; and fund investment services. The company operates in Singapore, Hong Kong, the United States, Europe, and internationally. The company was formerly known as Smart Rich Energy Finance (Holdings) Limited and changed its name to G-Resources Group Limited in June 2009. G-Resources Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "8088.HK": {"short_name": "AID LIFE SCI", "long_name": "AID Life Science Holdings Limited", "summary": "AID Life Science Holdings Limited is a publicly owned investment manager. Through its subsidiaries, it provides asset management services in Hong Kong and internationally. The company offers investment advisory and corporate services, as well as provides fund administration and management, asset management, and wealth management services. It also holds available-for-sale investments. The company was formerly known as Healthoo International Technology Holdings Limited. AID Life Science Holdings Limited was founded in 1998 and is based in Central, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "8657.HK": {"short_name": "TRUE PARTNER", "long_name": "True Partner Capital Holding Limited", "summary": "True Partner Capital Holding Limited operates as a fund management company in the United States and Hong Kong. The company manages funds and provides managed accounts on a discretionary basis using a proprietary trading platform. It offers investment management and consultancy services. The company also develops and supports its trading platform and related software; and provides management services for a portfolio of securities or futures contracts. It manages investors of funds primarily professional investors, including collective investment undertakings, family offices, pension funds, high-net-worth individuals, endowments/foundations, and financial institutions. The company was founded in 2010 and is headquartered in Tsim Sha Tsui, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Tsim Sha Tsui"}, "ASASF": {"short_name": "ASIA STANDARD INTL GROUP", "long_name": "Asia Standard International Group Limited", "summary": "Asia Standard International Group Limited, an investment holding company, invests in, develops, and manages commercial, residential, retail, and hotel properties in Hong Kong, China, and internationally. It operates through four segments: Property Sales, Property Leasing, Hotel and Travel, and Financial Investments. The company also owns and operates five hotels under the Empire brand name in Hong Kong. In addition, it provides real estate agency, financing, management, project management, securities investment, travel agency, catering, and construction services. The company was founded in 1984 and is based in Wan Chai, Hong Kong. Asia Standard International Group Limited is a subsidiary of Asia Orient Holdings Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wanchai"}, "CEVIF": {"short_name": "CHINA EVERBRIGHT LIMITED", "long_name": "China Everbright Limited", "summary": "China Everbright Limited, through its subsidiaries, engages in the investment activities and provision of financial services in Hong Kong and Mainland China. The company invests in unlisted equity securities or equity derivatives, as well as in the areas of new economy, artificial intelligence and advanced manufacturing, new energy, medical care and senior healthcare, overseas acquisition and infrastructure, real estate, aircraft industry chain, mezzanine fund, and others. It also focuses on investing in aircraft leasing, artificial intelligence of things, and elderly care industry platforms; and investing in equity, debts, structured products, and other products. In addition, the company provides a range of financial services, including asset management, investment management, and investment advisory services related to absolute return funds, bond funds, and equity funds, as well as offers management, treasury management, secretarial, money lending, fund management, venture capital, leasing, and consultancy services. The company was founded in 1997 and is headquartered in Hong Kong. China Everbright Limited is a subsidiary of Honorich Holdings Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Hong Kong"}, "GGPXF": {"short_name": "G-RESOURCES GP LTD", "long_name": "G-Resources Group Limited", "summary": "G-Resources Group Limited, an investment holding company, engages in the principal investment, financial services, and real property businesses. The company is involved in the provision of various financial services, including securities brokerage services, placing and underwriting services, corporate finance advisory services, provision of margin financing, money lending business, investment advisory and management services, and asset management services, as well as securities investment business. It also provides trust and company services; and fund investment services. The company operates in Singapore, Hong Kong, the United States, Europe, and internationally. The company was formerly known as Smart Rich Energy Finance (Holdings) Limited and changed its name to G-Resources Group Limited in June 2009. G-Resources Group Limited is headquartered in Wanchai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "HKQ3.F": {"short_name": "CHINA VER.FI.HOLD.(10000)", "long_name": "China Vered Financial Holding Corporation Limited", "summary": "China Vered Financial Holding Corporation Limited, an investment holding company, provides asset management, consultancy, financing, and securities advisory and brokerage services. It also provides insurance agency and money lending services. The company was formerly known as China Minsheng Financial Holding Corporation Limited and changed its name to China Vered Financial Holding Corporation Limited in July 2020. China Vered Financial Holding Corporation Limited is based in Causeway Bay, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Causeway Bay"}, "LGHL": {"short_name": "Lion Group Holding Ltd.", "long_name": "Lion Group Holding Ltd.", "summary": "Lion Group Holding Ltd., together with its subsidiaries, operates a trading platform in Hong Kong. The company's trading platform offers a range of products and services, including contract-for-difference trading, insurance brokerage, and futures and securities brokerage services for investors and institutional clients. It also provides total return swap (TRS) services, which include A-shares and Hong Kong stock basket-linked TRS. Lion Group Holding Ltd. is headquartered in Kowloon Bay, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NMS", "market": "us_market", "country": "Hong Kong", "city": "Kowloon Bay"}, "QRC.V": {"short_name": "QUEENS ROAD CAPITAL INVESTMENT ", "long_name": "Queen's Road Capital Investment Ltd.", "summary": "Queen's Road Capital Investment Ltd., a resource focused investment company, invests in privately held and publicly traded resource companies. It acquires and holds securities of long-term capital appreciation and short-term gains with a focus on convertible debt securities and resource projects. The company was formerly known as Lithion Energy Corp. and changed its name to Queen's Road Capital Investment Ltd. in February 2020. Queen's Road Capital Investment Ltd. was incorporated in 2011 and is based in Central, Hong Kong.", "currency": "CAD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "VAN", "market": "ca_market", "country": "Hong Kong", "city": "Central"}, "RPGA.F": {"short_name": "REGENT PAC.GRP NEW DL-,10", "long_name": "Regent Pacific Group Limited", "summary": "Regent Pacific Group Limited, an investment holding company, holds investments in the healthcare and life sciences companies in China, Europe, Hong Kong, and Taiwan. It operates in two segments, Biopharma and Corporate Investment. The company engages in the research, development, manufacture, marketing, and sale of pharmaceutical products for the treatment and management of urological disorders. It focuses on the commercialization of Fortacin, a topical prescription treatment for premature ejaculation. The company also invests in listed and unlisted corporate entities. In addition, it provides management, mill expansion, metallurgical, and corporate finance services. Further, the company focuses on zinc/copper projects in the Pilbara region of Western Australia. Regent Pacific Group Limited was founded in 1991 and is headquartered in Central, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Central"}, "RPGLF": {"short_name": "REGENT PACIFIC GROUP LIMITED", "long_name": "Regent Pacific Group Limited", "summary": "Regent Pacific Group Limited, an investment holding company, holds investments in the healthcare and life sciences companies in China, Europe, Hong Kong, and Taiwan. It operates in two segments, Biopharma and Corporate Investment. The company engages in the research, development, manufacture, marketing, and sale of pharmaceutical products for the treatment and management of urological disorders. It focuses on the commercialization of Fortacin, a topical prescription treatment for premature ejaculation. The company also invests in listed and unlisted corporate entities. In addition, it provides management, mill expansion, metallurgical, and corporate finance services. Further, the company focuses on zinc/copper projects in the Pilbara region of Western Australia. Regent Pacific Group Limited was founded in 1991 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "TWN": {"short_name": "Taiwan Fund, Inc. (The)", "long_name": "The Taiwan Fund, Inc.", "summary": "The Taiwan Fund, Inc. is a closed-ended equity mutual fund launched and managed by JF International Management Inc. It invests in the public equity markets of Taiwan. The fund seeks to invest in stocks of companies operating across diversified sectors. It employs fundamental analysis focusing on such factors as overall growth prospects, competitive position in the respective industry, technology, research, and development, productivity, labor costs, raw material costs and sources, profit margins, return on investment, capital resources, government regulation, and management to create its portfolio. The fund benchmarks the performance of its portfolio against the TAIEX Total Return Index. The Taiwan Fund, Inc. was formed on December 23, 1986 and is domiciled in the United States.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "NYQ", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "VPGLF": {"short_name": "VALUE PARTNERS GROUP LTD", "long_name": "Value Partners Group Limited", "summary": "Value Partners Group Limited is a publicly owned investment manager. The firm manages separate client focused portfolios. The firm manages separate client-focused equity, fixed income, multi-asset, alternative portfolios, and quantitative investment solutions. The firm invests in the public equity and fixed income markets across the globe. It primarily provides investment management services to investment funds and managed accounts. The firm employs fundamental analysis with bottom-up stock picking approach. The firm conducts in-house research to make its investments. Value Partners Group Limited was founded on 1993 and is based in Hong Kong with additional offices in Beijing, Boston, Shanghai, Shenzhen, Kuala Lumpur, Singapore and London.", "currency": "USD", "sector": "Financial Services", "industry": "Asset Management", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "WSL.L": {"short_name": "WORLDSEC LD ORD USD0.001", "long_name": "Worldsec Limited", "summary": "Worldsec Limited, a closed-ended investment company, invests in small to medium sized trading companies in the Greater China and South East Asian regions. The company was founded in 1991 and is based in Sheung Wan, Hong Kong.", "currency": "GBp", "sector": "Financial Services", "industry": "Asset Management", "exchange": "LSE", "market": "gb_market", "country": "Hong Kong", "city": "Sheung Wan"}, "YUM.F": {"short_name": "SHK HONG KONG INDS.", "long_name": "SHK Hong Kong Industries Limited", "summary": "SHK Hong Kong Industries Limited is a publicly owned investment manager. The company invests primarily in telecommunications, properties for sale and rent, infrastructure and logistics, hotel operation, food and beverage, and transportation sectors. It prefers to invest in Hong Kong, Singapore, United States, Japan, Malaysia, Taiwan, and China. SHK Hong Kong Industries Limited was formerly known as Yu Ming Investments Limited. SHK Hong Kong Industries Limited was founded in 1990 and is based in Wanchai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Asset Management", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wanchai"}}