{"0011.HK": {"short_name": "HANG SENG BANK", "long_name": "Hang Seng Bank Limited", "summary": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance and wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment, and corporate wealth management services, as well as general banking, interest rate, money market, structured, derivative products, etc. In addition, the company offers trustee, nominee, fund management, stock broking, and property management services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 290 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, operates a mainland China network with outlets in the Pearl River delta, the Yangtze River delta, the Bohai Rim region, and Midwest China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Central"}, "0440.HK": {"short_name": "DAH SING", "long_name": "Dah Sing Financial Holdings Limited", "summary": "Dah Sing Financial Holdings Limited, an investment holding company, provides banking, insurance, financial, and other related services in the People's Republic of China. The company operates through Personal Banking, Commercial Banking, Treasury, Overseas Banking, and Insurance segments. The Personal Banking segment accepts various deposits from individual customers; and provides residential mortgage loans, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts various deposits; and offers loans and working capital financing to commercial, industrial, and institutional customers, as well as trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services. It also manages investment in securities. The Overseas Banking segment offers personal and commercial banking products and services. The Insurance Business segment is involved in the insurance and pension fund management business. The company also provides insurance agency, nominee, and securities dealing services; and invest in properties. The company was formerly known as Fivetech Investments Limited and changed its name to Dah Sing Financial Holdings Limited in July 1987. Dah Sing Financial Holdings Limited was incorporated in 1987 and is based in Wan Chai, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "2356.HK": {"short_name": "DAHSING BANKING", "long_name": "Dah Sing Banking Group Limited", "summary": "Dah Sing Banking Group Limited, an investment holding company, provides banking, financial, and other related services in Hong Kong, Macau, and the People's Republic of China. It operates through Personal Banking, Commercial Banking, Treasury, and Overseas Banking segments. The Personal Banking segment accepts deposits from individual customers; and provides residential mortgage lending, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts deposits; offers loans and working capital financing to commercial, industrial, and institutional customers; and provides trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services, as well as manages investments in securities. The Overseas Banking segment engages in the personal banking and commercial banking business activities in Macau and the People's Republic of China. The company is also involved in the property investment and securities dealing activities; and provision of nominee services. As of December 31, 2018, it had a branch network of 45 retail branches, 23 VIP centers, and 36 securities trading centers. The company was incorporated in 2004 and is based in Wan Chai, Hong Kong. Dah Sing Banking Group Limited operates as a subsidiary of Dah Sing Financial Holdings Limited.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Wan Chai"}, "3618.HK": {"short_name": "CQRC BANK", "long_name": "Chongqing Rural Commercial Bank Co., Ltd.", "summary": "Chongqing Rural Commercial Bank Co., Ltd., together with its subsidiaries, provides a range of banking and related financial services in the People's Republic of China. It operates in three segments: Corporate Banking, Personal Banking, and Financial Market Operations. The Corporate Banking segment offers financial products and services, including deposit takings, corporate loans, trade financing, financial leasing, and other corporate intermediary services to corporations, government agencies, and financial institutions. The Personal Banking segment provides financial products and services, such as deposit products, personal loans, cards, personal wealth management services, and other types of personal intermediary services to individual customers. The Financial Market Operations segment conducts money market or repurchase transactions; and invests in debt instruments on behalf of customers. The company also provides mobile banking, Internet banking, and telephone banking services. As of 31 December 2019, it operated 1,774 branches including the headquarter and business department, 6 branches, 35 first-level sub-branches, 117 second-level sub-branches, 2 community branch outlets, and 1,612 branch outlets; and 4,911 ATMs and self-service inquiry terminals. The company was formerly known as Chongqing Rural Credit Union and changed its name to Chongqing Rural Commercial Bank Co., Ltd. in 2008. Chongqing Rural Commercial Bank Co., Ltd. was founded in 1951 and is based in Causeway Bay, Hong Kong.", "currency": "HKD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "HKG", "market": "hk_market", "country": "Hong Kong", "city": "Causeway Bay"}, "BHKLY": {"short_name": "BOC HONG KONG(HLDGS) LTD", "long_name": "BOC Hong Kong (Holdings) Limited", "summary": "BOC Hong Kong (Holdings) Limited, an investment holding company, provides banking and related financial services to corporate and individual customers in Hong Kong, Mainland China, and internationally. The company operates through four segments: Personal Banking, Corporate Banking, Treasury, and Insurance. It offers savings, current, and time deposit accounts; mortgage plans; overdrafts; personal loans; personal life, medical and accident, travel and leisure, business protection, home, domestic helper, motor, and golfer insurance products; wealth management services; and Internet, phone, and mobile banking services. The company also provides cross-border services for corporate customers; business banking, trade finance and services, investment, treasury, corporate collection and payment, e-commerce, and card services; small business, asset-pledge, machinery and equipment financing, and project financing and syndicated loans; payroll, custody, and cash management services; and business comprehensive, property, liability, group, and retailer comprehensive insurance plans. In addition, it provides investment products and services, including securities, foreign exchange, fund, precious metals and FX margin, bonds, currency linked investment, structured products, bonds, and savings plans. The company operates approximately 190 branches, 280 automated banking centers, and approximately 1,000 self-service machines. BOC Hong Kong (Holdings) Limited was founded in 1917 and is based in Central, Hong Kong. The company is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. BOC Hong Kong (Holdings) Limited is a subsidiary of BOC Hong Kong (BVI) Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BKEAF": {"short_name": "BANK OF EAST ASIA LIMITED", "long_name": "The Bank of East Asia, Limited", "summary": "The Bank of East Asia, Limited, together with its subsidiaries, provides various banking and related financial services. The company operates through seven segments: Personal Banking, Corporate Banking, Treasury Markets, Wealth Management, Other Hong Kong Operations, Mainland China Operations, and Overseas Operations. It offers personal banking products and services, including deposits accounts; consumer loans; and mortgage loans, including refinancing and residential property valuation. The company also provides corporate banking products and services, such as corporate lending and syndication, including project finance, asset-based finance, cash flow finance, construction loans, onshore and offshore package facility, working capital facility, overdraft facility, share financing, bank guarantees, and performance bonds; commercial, cross-border, and enterprise financing; and business development solutions. In addition, it offers wealth management services, including private banking, trust, and portfolio management services, as well as investment solutions; treasury services and securities dealing services; data processing and other back office services; and insurance products and services. Further, the company provides securities and futures broking, and corporate financial advisory; asset management/investment management, property investment, facility management, trustees service, e-payment solutions, cyber banking, credit cards, ATM and I-teller network, foreign currency deposits, remittance, and safe deposit boxes. It operates approximately 200 outlets in Hong Kong and the rest of Greater China, Southeast Asia, the United Kingdom, and the United States. The Bank of East Asia, Limited was incorporated in 1918 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BKEAY": {"short_name": "BANK OF EAST ASIA LIMITED", "long_name": "The Bank of East Asia, Limited", "summary": "The Bank of East Asia, Limited, together with its subsidiaries, provides various banking and related financial services. The company operates through seven segments: Personal Banking, Corporate Banking, Treasury Markets, Wealth Management, Other Hong Kong Operations, Mainland China Operations, and Overseas Operations. It offers personal banking products and services, including deposits accounts; consumer loans; and mortgage loans, including refinancing and residential property valuation. The company also provides corporate banking products and services, such as corporate lending and syndication, including project finance, asset-based finance, cash flow finance, construction loans, onshore and offshore package facility, working capital facility, overdraft facility, share financing, bank guarantees, and performance bonds; commercial, cross-border, and enterprise financing; and business development solutions. In addition, it offers wealth management services, including private banking, trust, and portfolio management services, as well as investment solutions; treasury services and securities dealing services; data processing and other back office services; and insurance products and services. Further, the company provides securities and futures broking, and corporate financial advisory; asset management/investment management, property investment, facility management, trustees service, e-payment solutions, cyber banking, credit cards, ATM and I-teller network, foreign currency deposits, remittance, and safe deposit boxes. It operates approximately 200 outlets in Hong Kong and the rest of Greater China, Southeast Asia, the United Kingdom, and the United States. The Bank of East Asia, Limited was incorporated in 1918 and is headquartered in Central, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "BNKHF": {"short_name": "BOC HONG KONG(HLDGS) LTD", "long_name": "BOC Hong Kong (Holdings) Limited", "summary": "BOC Hong Kong (Holdings) Limited, an investment holding company, provides banking and related financial services to corporate and individual customers in Hong Kong, Mainland China, and internationally. The company operates through four segments: Personal Banking, Corporate Banking, Treasury, and Insurance. It offers savings, current, and time deposit accounts; mortgage plans; overdrafts; personal loans; personal life, medical and accident, travel and leisure, business protection, home, domestic helper, motor, and golfer insurance products; wealth management services; and Internet, phone, and mobile banking services. The company also provides cross-border services for corporate customers; business banking, trade finance and services, investment, treasury, corporate collection and payment, e-commerce, and card services; small business, asset-pledge, machinery and equipment financing, and project financing and syndicated loans; payroll, custody, and cash management services; and business comprehensive, property, liability, group, and retailer comprehensive insurance plans. In addition, it provides investment products and services, including securities, foreign exchange, fund, precious metals and FX margin, bonds, currency linked investment, structured products, bonds, and savings plans. The company operates approximately 190 branches, 280 automated banking centers, and approximately 1,000 self-service machines. BOC Hong Kong (Holdings) Limited was founded in 1917 and is based in Central, Hong Kong. The company is considered a Red Chip company due to its listing on the Hong Kong Stock Exchange. BOC Hong Kong (Holdings) Limited is a subsidiary of BOC Hong Kong (BVI) Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "CRCBY": {"short_name": "CHONGQING RURAL COMMERCIAL BANK", "long_name": "Chongqing Rural Commercial Bank Co., Ltd.", "summary": "Chongqing Rural Commercial Bank Co., Ltd., together with its subsidiaries, provides a range of banking and related financial services in the People's Republic of China. It operates in three segments: Corporate Banking, Personal Banking, and Financial Market Operations. The Corporate Banking segment offers financial products and services, including deposit takings, corporate loans, trade financing, financial leasing, and other corporate intermediary services to corporations, government agencies, and financial institutions. The Personal Banking segment provides financial products and services, such as deposit products, personal loans, cards, personal wealth management services, and other types of personal intermediary services to individual customers. The Financial Market Operations segment conducts money market or repurchase transactions; and invests in debt instruments on behalf of customers. The company also provides mobile banking, Internet banking, and telephone banking services. As of 31 December 2019, it operated 1,774 branches including the headquarter and business department, 6 branches, 35 first-level sub-branches, 117 second-level sub-branches, 2 community branch outlets, and 1,612 branch outlets; and 4,911 ATMs and self-service inquiry terminals. The company was formerly known as Chongqing Rural Credit Union and changed its name to Chongqing Rural Commercial Bank Co., Ltd. in 2008. Chongqing Rural Commercial Bank Co., Ltd. was founded in 1951 and is based in Causeway Bay, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Causeway Bay"}, "DSFGY": {"short_name": "DAH SING FINANCIAL HLDGS", "long_name": "Dah Sing Financial Holdings Limited", "summary": "Dah Sing Financial Holdings Limited, an investment holding company, provides banking, insurance, financial, and other related services in the People's Republic of China. The company operates through Personal Banking, Commercial Banking, Treasury, Overseas Banking, and Insurance segments. The Personal Banking segment accepts various deposits from individual customers; and provides residential mortgage loans, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts various deposits; and offers loans and working capital financing to commercial, industrial, and institutional customers, as well as trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services. It also manages investment in securities. The Overseas Banking segment offers personal and commercial banking products and services. The Insurance Business segment is involved in the insurance and pension fund management business. The company also provides insurance agency, nominee, and securities dealing services; and invest in properties. The company was formerly known as Fivetech Investments Limited and changed its name to Dah Sing Financial Holdings Limited in July 1987. Dah Sing Financial Holdings Limited was incorporated in 1987 and is based in Wan Chai, Hong Kong.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Wan Chai"}, "DSR.F": {"short_name": "DAH SING FINL HLDGS", "long_name": "Dah Sing Financial Holdings Limited", "summary": "Dah Sing Financial Holdings Limited, an investment holding company, provides banking, insurance, financial, and other related services in the People's Republic of China. The company operates through Personal Banking, Commercial Banking, Treasury, Overseas Banking, and Insurance segments. The Personal Banking segment accepts various deposits from individual customers; and provides residential mortgage loans, personal loans, overdrafts, vehicle financing, and credit card services, as well as insurance sales and investment services. The Commercial Banking segment accepts various deposits; and offers loans and working capital financing to commercial, industrial, and institutional customers, as well as trade financing services. The Treasury segment provides foreign exchange services; cash management services for deposit taking and lending; and interest rate risk management services. It also manages investment in securities. The Overseas Banking segment offers personal and commercial banking products and services. The Insurance Business segment is involved in the insurance and pension fund management business. The company also provides insurance agency, nominee, and securities dealing services; and invest in properties. The company was formerly known as Fivetech Investments Limited and changed its name to Dah Sing Financial Holdings Limited in July 1987. Dah Sing Financial Holdings Limited was incorporated in 1987 and is based in Wan Chai, Hong Kong.", "currency": "EUR", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "FRA", "market": "dr_market", "country": "Hong Kong", "city": "Wan Chai"}, "HSNGF": {"short_name": "HANG SENG BANK", "long_name": "Hang Seng Bank Limited", "summary": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance and wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment, and corporate wealth management services, as well as general banking, interest rate, money market, structured, derivative products, etc. In addition, the company offers trustee, nominee, fund management, stock broking, and property management services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 290 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, operates a mainland China network with outlets in the Pearl River delta, the Yangtze River delta, the Bohai Rim region, and Midwest China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}, "HSNGY": {"short_name": "HANG SENG BANK", "long_name": "Hang Seng Bank Limited", "summary": "Hang Seng Bank Limited, together with its subsidiaries, provides various banking and related financial services to individual, corporate, commercial, small and medium-sized enterprise, and institutional customers in Hong Kong, Mainland China, and internationally. It operates through four segments: Retail Banking and Wealth Management, Commercial Banking, Global Banking and Markets, and Other. The company offers personal banking services, including current and savings accounts, time deposits, mortgages and personal loans, credit cards, and insurance and wealth management services, as well as consumer lending services. It also provides corporate lending, trade and receivable finance, payments and cash management, treasury and foreign exchange, general insurance, key-person insurance, investment, and corporate wealth management services, as well as general banking, interest rate, money market, structured, derivative products, etc. In addition, the company offers trustee, nominee, fund management, stock broking, and property management services, as well as index compilation and licensing; fund raising and sales; and asset management services. It operates approximately 290 service outlets in Hong Kong; branches in Macau and Singapore; and a representative office in Taipei. Hang Seng Bank Limited, through its subsidiary, Hang Seng Bank (China) Limited, operates a mainland China network with outlets in the Pearl River delta, the Yangtze River delta, the Bohai Rim region, and Midwest China. The company was founded in 1933 and is headquartered in Central, Hong Kong. Hang Seng Bank Limited is a subsidiary of The Hongkong and Shanghai Banking Corporation Limited.", "currency": "USD", "sector": "Financial Services", "industry": "Banks—Regional", "exchange": "PNK", "market": "us_market", "country": "Hong Kong", "city": "Central"}}