{
    "0508.HK": {
        "short_name": "DINGYI GP INV",
        "long_name": "Dingyi Group Investment Limited",
        "summary": "Dingyi Group Investment Limited, an investment holding company, engages in the loan financing and financial leasing businesses in the Mainland China and Hong Kong. The company is also involved in the sale of food and beverages; securities trading; and properties development businesses. In addition, it engages in the trading of wine; investment advisory; and restaurant operation businesses. The company was formerly known as Chevalier Pacific Holdings Limited and changed its name to Dingyi Group Investment Limited in February 2012. The company is based in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.dingyi.hk",
        "market_cap": "Small Cap"
    },
    "0628.HK": {
        "short_name": "GOME FIN TECH",
        "long_name": "Gome Finance Technology Co., Ltd.",
        "summary": "Gome Finance Technology Co., Ltd., an investment holding company, provides various financial services in Hong Kong and the People's Republic of China. The company offers commercial factoring, financial leasing, personal property pawn loans, real estate mortgage loans, and money lending services. It also provides consultancy services. The company was formerly known as Sino Credit Holdings Limited and changed its name to Gome Finance Technology Co., Ltd. in February 2017. The company was incorporated in 2002 and is headquartered in Central, Hong Kong. Gome Finance Technology Co., Ltd. is a subsidiary of Swiree Capital Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gomejr.com",
        "market_cap": "Small Cap"
    },
    "0668.HK": {
        "short_name": "DOYEN INTL HOLD",
        "long_name": "Doyen International Holdings Limited",
        "summary": "Doyen International Holdings Limited, an investment holding company, provides loan financing services in the People's Republic of China. The company operates through Investment Property Holding, Dongkui Business, Sales of Flowers and Plants, and Distressed Assets Management segments. It is also involved in the investment and rental of properties. The company owns Dong Dong Mall, a shopping arcade with a total gross floor area of 18,043.45 square meters located in Chongqing. In addition, it provides management and distressed asset management services; and sells flowers, seedlings, and plants. The company was formerly known as Dowell Property Holdings Limited and changed its name to in Doyen International Holdings Limited in June 2016. Doyen International Holdings Limited was incorporated in 1990 and is based in Wanchai, Hong Kong. Doyen International Holdings Limited is a subsidiary of Money Success Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.doyenintl.com",
        "market_cap": "Small Cap"
    },
    "0730.HK": {
        "short_name": "SHOUGANG GRAND",
        "long_name": "Shougang Concord Grand (Group) Limited",
        "summary": "Shougang Concord Grand (Group) Limited, an investment holding company, provides finance leasing and other financial services in Mainland China and Hong Kong. It operates through three divisions: Finance Leasing and Other Financial Services, Property Leasing and Building Management Services, and Assets Management. The company offers finance leasing for various sectors, including energy, transport, printing equipment, medical equipment, scientific and technical equipment, industrial equipment, etc. It is also involved in the investment, leasing, sale, and management of properties, such as industrial, office, and residential buildings; provision of property consultant, administrative and management, and referral and corporate financial advisory services; and investment and management of industrial funds. Shougang Concord Grand (Group) Limited has a strategic cooperation agreement with Jingdong Digits Technology Holding Co., Ltd. for cooperation in the field of supply chain business. The company is based in Wan Chai, Hong Kong. Shougang Concord Grand (Group) Limited is a subsidiary of Wheeling Holdings Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shougang-grand.com.hk",
        "market_cap": "Small Cap"
    },
    "0764.HK": {
        "short_name": "ETERNITY INV",
        "long_name": "Eternity Investment Limited",
        "summary": "Eternity Investment Limited, an investment holding company, primarily engages in the sale of financial assets and money lending businesses. The company operates in four segments: Property Investment, Sale of Financial Assets, Money Lending, and Sale of Jewelry Products. It also designs and sells jewelry products; and leases rental properties. In addition, the company manages membership-based golf club and resort that provides recreational and wellness services; provides property development and property management services; and manages and operates cultural forum and related cultural activities. It operates in Hong Kong, Australia, Europe, the People's Republic of China, and the United States. The company was formerly known as China Star Investment Holdings Limited and changed its name to Eternity Investment Limited in June 2010. Eternity Investment Limited was incorporated in 1999 and is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.eternityinv.com.hk",
        "market_cap": "Small Cap"
    },
    "0900.HK": {
        "short_name": "AEON CREDIT",
        "long_name": "AEON Credit Service (Asia) Company Limited",
        "summary": "AEON Credit Service (Asia) Company Limited, together with its subsidiaries, engages in the consumer finance business primarily in Hong Kong. It operates through three segments: Credit Cards, Personal Loans, and Insurance. The Credit Card segment offers credit card services to individuals; and acquiring services for member stores. The Personal Loans segment provides personal loan financing services to individuals. The Insurance segment offers insurance agency and brokerage services. It also provides card payment processing and microfinance services. The company was founded in 1987 and is headquartered in Tsim Sha Tsui, Hong Kong. AEON Credit Service (Asia) Company Limited is a subsidiary of AEON Financial Service (Hong Kong) Co., Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsim Sha Tsui",
        "zipcode": null,
        "website": "http://www.aeon.com.hk",
        "market_cap": "Small Cap"
    },
    "2003.HK": {
        "short_name": "VCREDIT",
        "long_name": "VCREDIT Holdings Limited",
        "summary": "VCREDIT Holdings Limited, an investment holding company, provides online consumer finance services to prime and near-prime borrowers in China. The company offers credit card balance transfer and consumption credit products. It also provides loan facilitation, guarantee, micro credit, and financial leasing services, as well as technology services. The company was formerly known as Vision Capital Group Limited. VCREDIT Holdings Limited was founded in 2006 and is headquartered in Admiralty, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.vcredit.com",
        "market_cap": "Small Cap"
    },
    "3848.HK": {
        "short_name": "WEALTHY WAY",
        "long_name": "Wealthy Way Group Limited",
        "summary": "Wealthy Way Group Limited, an investment holding company, provides financial leasing, factoring, and advisory services to individual and companies in the People's Republic of China and Hong Kong. The company operates through Money Lending and Securities Dealing segments. It offers small loans and related loan facilitation, asset management, investment management and advisory, and securities dealing and broking, as well as money lending services. The company also offers sale-leaseback services. It serves airline companies, health care service providers, and energy saving equipment providers. The company was founded in 2012 and is headquartered in Wanchai, Hong Kong. Wealthy Way Group Limited is a subsidiary of Wealthy Rise Investment Limited.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.cwl.com",
        "market_cap": "Small Cap"
    },
    "8019.HK": {
        "short_name": "HAO WEN HLDGS",
        "long_name": "Hao Wen Holdings Limited",
        "summary": "Hao Wen Holdings Limited, an investment holding company, engages in money lending business in the People's Republic of China, Hong Kong, and internationally. The company also engages in the processing and trading of electronic parts; and manufacture and trading of biomass fuel products. It is also involved in the sale of burial plots and related services; and provision of cemetery maintenance services. Hao Wen Holdings Limited was incorporated in 2000 and is headquartered in Sheung Wan, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Sheung Wan",
        "zipcode": null,
        "website": "http://www.tricor.com.hk/webservice/008019/index_en.asp",
        "market_cap": "Small Cap"
    },
    "8063.HK": {
        "short_name": "GLOBAL M HLDG",
        "long_name": "Global Mastermind Holdings Limited",
        "summary": "Global Mastermind Holdings Limited, an investment holding company, engages in the travel business in Singapore, Hong Kong, and Malaysia. It operates through six segments: Travel Business, Treasury Management Business, Money Lending Business, Brokerage Business, Asset Management Business, and Corporate Finance Advisory Business. The company offers travel-related products and services, including reservation of air tickets and hotel rooms, as well as arrangement of packaged tours. It also provides money lending, treasury management, property holding, and management services; and financial services, such as securities brokerage, margin financing, initial public offering (IPO) financing, asset management, and corporate finance advisory services, as well as deals in futures and securities. The company was formerly known as Well Way Group Limited and changed its name to Global Mastermind Holdings Limited in December 2015. Global Mastermind Holdings Limited is headquartered in Central, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.globalmholdings.com",
        "market_cap": "Small Cap"
    },
    "8071.HK": {
        "short_name": "CH NETCOMTECH",
        "long_name": "China Netcom Technology Holdings Limited",
        "summary": "China Netcom Technology Holdings Limited, an investment holding company, provides financial technology services in the People's Republic of China. It operates through Smart Retail Business, Financial Technology Services, Lottery Business, and Sports Training Business segments. The Financial Technology Services Business segment offers credit referral and services, such as credit facilitation, post-origination, and financial guarantee services. The Smart Retail Business segment provides distribution, maintenance, and technical support for omni-channel payment devices and software applications; software development services; and technical consultancy services for cloud server service, internet of things and SMS traffic service. The Lottery Business segment develops computer software, hardware, and application system, as well as provides self-developed technology and related technical consultancy services to the operating system sector of lottery market. The Sports Training Business segment provides sports training services. The company also offers asset management services; and consultation and result transfer on network technology and computer network engineering services. The company was formerly known as China Metal Resources Holdings Limited and changed its name to China Netcom Technology Holdings Limited in January 2011. China Netcom Technology Holdings Limited was incorporated in 2001 and is headquartered in Hong Kong, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Hong Kong",
        "zipcode": null,
        "website": "http://www.chinanetcomtech.com",
        "market_cap": "Small Cap"
    },
    "CGG.F": {
        "short_name": "SHOUGANG CON.GR.GRP HD-01",
        "long_name": "Shougang Concord Grand (Group) Limited",
        "summary": "Shougang Concord Grand (Group) Limited, an investment holding company, provides finance leasing and other financial services in Mainland China and Hong Kong. It operates through three divisions: Finance Leasing and Other Financial Services, Property Leasing and Building Management Services, and Assets Management. The company offers finance leasing for various sectors, including energy, transport, printing equipment, medical equipment, scientific and technical equipment, industrial equipment, etc. It is also involved in the investment, leasing, sale, and management of properties, such as industrial, office, and residential buildings; provision of property consultant, administrative and management, and referral and corporate financial advisory services; and investment and management of industrial funds. Shougang Concord Grand (Group) Limited has a strategic cooperation agreement with Jingdong Digits Technology Holding Co., Ltd. for cooperation in the field of supply chain business. The company is based in Wan Chai, Hong Kong. Shougang Concord Grand (Group) Limited is a subsidiary of Wheeling Holdings Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.shougang-grand.com.hk",
        "market_cap": "Small Cap"
    },
    "E9L.SI": {
        "short_name": "$ Joyas Intl",
        "long_name": "Joyas International Holdings Limited",
        "summary": "Joyas International Holdings Limited, an investment holding company, primarily engages in financing business in the People's Republic of China. The company was incorporated in 1899 and is based in Kwai Chung, Hong Kong.",
        "currency": "SGD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Kwai Chung",
        "zipcode": null,
        "website": "http://www.joyasint.com",
        "market_cap": "Small Cap"
    },
    "PHUP.SG": {
        "short_name": "Sino Prosper (Group) Hldgs LtdR",
        "long_name": "Sino Prosper (Group) Holdings Limited",
        "summary": "Sino Prosper (Group) Holdings Limited, an investment holding company, invests in energy and natural resources related projects in the People's Republic of China. It operates through Investment in Energy and Natural Resources Related Projects, Money Lending, and Food and Beverage segments. The company holds interests in the Aohan Qi gold mine located in Inner Mongolia; and the Heilongjiang project. It also provides loan financing, and investment and management consultation services. In addition, the company imports, distributes, and sells food and beverage products. Further, it is involved in the provision of administrative, investment, management, mining consultation, and micro-financing services; and exploration and mining of gold. The company was formerly known as Sino Prosper State Gold Resources Holdings Limited and changed its name to Sino Prosper (Group) Holdings Limited in January 2014. Sino Prosper (Group) Holdings Limited is headquartered in Admiralty, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Admiralty",
        "zipcode": null,
        "website": "http://www.sinoprosper.com",
        "market_cap": "Small Cap"
    },
    "SG51.F": {
        "short_name": "SGOCO GROUP LTD.  DL-,004",
        "long_name": "SGOCO Group, Ltd.",
        "summary": "SGOCO Group, Ltd. designs, develops, and manufactures phase change material storage systems for applications on cooling and heating systems in Mainland China and Hong Kong. The company's products include phase change material thermal energy storage products; LCD/LED monitors; and TV product-related and application-specific products. It is also involved in money lending services; and property lease and management activities. In addition, the company provides fintech and IT support services. It sells its products under the SGOCO, No. 10, and POVIZON brand names. The company was formerly known as SGOCO Technology, Ltd. SGOCO Group, Ltd. was founded in 2005 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.sgocogroup.com",
        "market_cap": "Small Cap"
    },
    "SGOC": {
        "short_name": "SGOCO Group, Ltd",
        "long_name": "SGOCO Group, Ltd.",
        "summary": "SGOCO Group, Ltd. designs, develops, and manufactures phase change material storage systems for applications on cooling and heating systems in Mainland China and Hong Kong. The company's products include phase change material thermal energy storage products; LCD/LED monitors; and TV product-related and application-specific products. It is also involved in money lending services; and property lease and management activities. In addition, the company provides fintech and IT support services. It sells its products under the SGOCO, No. 10, and POVIZON brand names. The company was formerly known as SGOCO Technology, Ltd. SGOCO Group, Ltd. was founded in 2005 and is headquartered in Tsuen Wan, Hong Kong.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Tsuen Wan",
        "zipcode": null,
        "website": "http://www.sgocogroup.com",
        "market_cap": "Small Cap"
    },
    "TFN4.F": {
        "short_name": "GOME FINANCE TECH.HD-,10",
        "long_name": "Gome Finance Technology Co., Ltd.",
        "summary": "Gome Finance Technology Co., Ltd., an investment holding company, provides various financial services in Hong Kong and the People's Republic of China. The company offers commercial factoring, financial leasing, personal property pawn loans, real estate mortgage loans, and money lending services. It also provides consultancy services. The company was formerly known as Sino Credit Holdings Limited and changed its name to Gome Finance Technology Co., Ltd. in February 2017. The company was incorporated in 2002 and is headquartered in Central, Hong Kong. Gome Finance Technology Co., Ltd. is a subsidiary of Swiree Capital Limited.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.gomejr.com",
        "market_cap": "Small Cap"
    }
}