{
    "0613.HK": {
        "short_name": "PLANETREE INT'L",
        "long_name": "Planetree International Development Limited",
        "summary": "Planetree International Development Limited, an investment holding company, engages in treasury management, financial, and money lending businesses in Hong Kong. The company is involved in trading and holding debt and equity securities; financing and securities investment activities; property leasing; dealing in futures contracts; and securities investment activities. It also offers corporate management services; securities brokerage and financial services; and asset management services. The company was formerly known as Yugang International Limited and changed its name to Planetree International Development Limited in July 2019. Planetree International Development Limited is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.planetreeintl.com",
        "market_cap": 657669568
    },
    "3329.HK": {
        "short_name": "BOCOM INTL",
        "long_name": "BOCOM International Holdings Company Limited",
        "summary": "BOCOM International Holdings Company Limited, an investment holding company, provides securities and related financial services in Hong Kong and Mainland China. It operates through Brokerage, Corporate Finance and Underwriting, Asset Management and Advisory, Margin Financing, and Investment and Loans segments. The Brokerage segment trades in stocks, bonds, futures, options, and other marketable securities. The Corporate Finance and Underwriting segment provides corporate finance services, including equity underwriting, debt underwriting, sponsor services, and financial advisory services to institutional clients. The Asset Management and Advisory segment offers traditional asset management products and services to third party clients; and investment advisory, portfolio management, and transaction execution services. The Margin Financing segment provides securities-backed financial leverage for retail and institutional clients. The Investment and Loans segment engages in direct investment business, including investments in various debt and equity securities, investment in companies, and investment in loans. The company was formerly known as BOCOM Securities Company Limited and changed its name to BOCOM International Holdings Company Limited in May 2007. BOCOM International Holdings Company Limited was incorporated in 1998 and is headquartered in Central, Hong Kong. BOCOM International Holdings Company Limited is a subsidiary of Bank of Communications Co., Ltd.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.bocomgroup.com",
        "market_cap": 5195340800
    },
    "3623.HK": {
        "short_name": "C SUCCESS FIN",
        "long_name": "China Success Finance Group Holdings Limited",
        "summary": "China Success Finance Group Holdings Limited, an investment holding company, provides financial and non-financial guarantee, financial leasing, and financial consultancy services in the People's Republic of China. The company offers financial guarantees, such as corporate financial, individual credit, financial leasing equipment, trusteeship, joint bond, corporate bond issuance, non-financing, and performance guarantees, as well as letter of guarantee for construction, and financing/financial consultancy and financial technology services. It also provides asset management services, including investment and financing management, asset/debt restructuring, special asset acquisition, corporate financial management, and financial consultancy services. In addition, the company offers fund management services for asset management, investment advisories, and private equity funds; investment and acquisition; capital; real estate finance; and micro credit services. Further, it provides financial leasing services comprising direct leasing, sale-leaseback, trusted leasing, joint leasing, and bank factoring. China Success Finance Group Holdings Limited was founded in 1996 and is headquartered in Wanchai, Hong Kong.",
        "currency": "HKD",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Wan Chai",
        "zipcode": null,
        "website": "http://www.chinasuccessfinance.com",
        "market_cap": 543014016
    },
    "597.F": {
        "short_name": "BOCOM INT.HLDGS CO. LTD",
        "long_name": "BOCOM International Holdings Company Limited",
        "summary": "BOCOM International Holdings Company Limited, an investment holding company, provides securities and related financial services in Hong Kong and Mainland China. It operates through Brokerage, Corporate Finance and Underwriting, Asset Management and Advisory, Margin Financing, and Investment and Loans segments. The Brokerage segment trades in stocks, bonds, futures, options, and other marketable securities. The Corporate Finance and Underwriting segment provides corporate finance services, including equity underwriting, debt underwriting, sponsor services, and financial advisory services to institutional clients. The Asset Management and Advisory segment offers traditional asset management products and services to third party clients; and investment advisory, portfolio management, and transaction execution services. The Margin Financing segment provides securities-backed financial leverage for retail and institutional clients. The Investment and Loans segment engages in direct investment business, including investments in various debt and equity securities, investment in companies, and investment in loans. The company was formerly known as BOCOM Securities Company Limited and changed its name to BOCOM International Holdings Company Limited in May 2007. BOCOM International Holdings Company Limited was incorporated in 1998 and is headquartered in Central, Hong Kong. BOCOM International Holdings Company Limited is a subsidiary of Bank of Communications Co., Ltd.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "Central",
        "zipcode": null,
        "website": "http://www.bocomgroup.com",
        "market_cap": 548366592
    },
    "BOI7.F": {
        "short_name": "IMAGI INTL NEW  HD-,04",
        "long_name": "Imagi International Holdings Limited",
        "summary": "Imagi International Holdings Limited, an investment holding company, engages in the financial services, computer graphic imaging (CGI), and cultural and entertainment businesses in Hong Kong. The company operates through Securities Brokerage and Asset Management, Trading of Securities, Provision of Finance, and Entertainment segments. It offers financial services, such as securities investments and proprietary trading, securities brokerage, margin financing, and money lending services; and invests in movie business and film rights. The company also holds and licenses intellectual property rights of CGI animation picture; and provides administrative services. Imagi International Holdings Limited is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.imagi.hk",
        "market_cap": 53312260
    },
    "BOI7.SG": {
        "short_name": "Imagi Intl Holdings Ltd. Regist",
        "long_name": "Imagi International Holdings Limited",
        "summary": "Imagi International Holdings Limited, an investment holding company, engages in the financial services, computer graphic imaging (CGI), and cultural and entertainment businesses in Hong Kong. The company operates through Securities Brokerage and Asset Management, Trading of Securities, Provision of Finance, and Entertainment segments. It offers financial services, such as securities investments and proprietary trading, securities brokerage, margin financing, and money lending services; and invests in movie business and film rights. The company also holds and licenses intellectual property rights of CGI animation picture; and provides administrative services. Imagi International Holdings Limited is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.imagi.hk",
        "market_cap": 53949904
    },
    "YUIA.F": {
        "short_name": "PLANETREE INTL.DEV.HD-,10",
        "long_name": "Planetree International Development Limited",
        "summary": "Planetree International Development Limited, an investment holding company, provides various financial services in Hong Kong. It operates through Financial Services, Credit and Lending Services, Other Financial Services, Property Investment and Leasing, and Tactical and Strategic Investment segments. The Financial Services segment deals in securities and futures contracts; and offers corporate finance and asset management advisory, and margin financing services. The Credit and Lending Services segment provides money lending services. The Other Financial Services segment offers corporate advisory related services. The Property Investment and Leasing segment engages in properties leasing activities. The Tactical and Strategic Investment segment trades in and holds debt and equity securities. It also provides securities brokerage and investment services. The company was formerly known as Yugang International Limited and changed its name to Planetree International Development Limited in July 2019. Planetree International Development Limited was incorporated in 1993 and is headquartered in North Point, Hong Kong.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Financial Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Hong Kong",
        "state": null,
        "city": "North Point",
        "zipcode": null,
        "website": "http://www.planetreeintl.com",
        "market_cap": 66224400
    }
}