{"15XC.F": {"short_name": "VISLINK TECHS  DL-,00001", "long_name": "Vislink Technologies, Inc.", "summary": "Vislink Technologies, Inc. designs, develops, and delivers wireless communications solutions in North and South America, Europe, Asia, and internationally. It develops, manufactures, and sells microwave communications equipment and video transmission products under the Nucomm, RF Central, and IMT brand names for broadcast, sports and entertainment, and government/surveillance markets. The company also offers satellite communication, cellular, and wireless camera systems and associated amplifier items, as well as microwave radio components under the Vislink brand to broadcasters, network owners and station groups, sports and live broadcasters, hosted service providers, and defense agencies and organizations, as well as metropolitan, regional, and national law enforcement agenciesIts products portfolio consists of HCAM, an on-camera wireless video transmitter; HDX-1100, an aircraft downlink transmitter; ViewBack, a dual channel diversity receiver-decoder; SatWare, an embedded computing and routing system; and AirPro-75, an IP satellite data terminal, as well as various types of receivers. The company was formerly known as xG Technology, Inc. and changed its name to Vislink Technologies, Inc. in February 2019. Vislink Technologies, Inc. was founded in 2002 and is headquartered in Sarasota, Florida.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Sarasota"}, "17X.F": {"short_name": "ACACIA COMMUNIC. DL-,0001", "long_name": "Acacia Communications, Inc.", "summary": "Acacia Communications, Inc. develops, manufactures, and sells high-speed coherent optical interconnect products in the United States, China, Germany, Thailand, and internationally. The company offers embedded and pluggable module products consisting of optical interconnect modules with transmission speeds ranging from 100 to 1,200 gigabits per second for use in long-haul, metro, and inter-data center markets. It also provides semiconductor products, such as low-power coherent digital signal processor application-specific integrated circuits and silicon photonic integrated circuits that are integrated into embedded and pluggable modules. The company sells its products through a direct sales force to network equipment manufacturers, network operators, and cloud service providers. Acacia Communications, Inc. was founded in 2009 and is headquartered in Maynard, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Maynard"}, "1K3.F": {"short_name": "KNOWLES CORP.  DL-,01", "long_name": "Knowles Corporation", "summary": "Knowles Corporation designs, manufactures, and sells micro-acoustic, audio processing, and precision device solutions for the mobile consumer electronics, communications, medtech, defense, automotive, and industrial markets worldwide. It operates in two segments, Audio and Precision Devices (PD). The Audio segment designs and manufactures audio products, including microphones and balanced armature speakers, audio processors, and software and algorithms used in applications that serve the mobile, ear, and Internet of Things markets. The PD segment designs and delivers capacitor products and radio frequency solutions that are used in applications, such as power supplies and medical implants, satellite communication, and radar systems, as well as our telecommunications infrastructure customers. The company also provides single layer electronic components to the telecommunication, fiber optics, and defense markets. It sells its products directly to original equipment manufacturers and to their contract manufacturers and suppliers, as well as through distributors. The company was founded in 1946 and is headquartered in Itasca, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Itasca"}, "27J.F": {"short_name": "IMPINJ INC.  DL-,001", "long_name": "Impinj, Inc.", "summary": "Impinj, Inc. operates a platform that enables wireless connectivity to various everyday items to business and consumer applications. Its integrated platform connects everyday items to applications, delivering real-time information to businesses about items they create, manage, transport, and sell. The company's platform includes endpoint integrated circuits (ICs), a miniature radios-on-a-chip that attach-to and identify their host items; and connectivity products that comprise reader ICs and modules, readers, and gateways to wirelessly identify, locate, authenticate, and engage items, as well as provide power to and communicate bidirectionally with endpoint ICs. Its platform also consists of software offerings that include ItemSense, a system software that comprises enterprise-class RAIN deployment management, software-defined algorithms for transition detection, and APIs that enable application developers to build powerful IoT solutions. The company primarily serves retail, supply chain and logistics, aviation, automotive, healthcare, industrial and manufacturing, sports, food, datacenter, travel, banking, and linen and uniform tracking sectors through distributors, system integrators, value-added resellers, and software solution partners in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Impinj, Inc. was founded in 2000 and is headquartered in Seattle, Washington.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Seattle"}, "2HP.DE": {"short_name": "HEWLETT PACKARD ENT.", "long_name": "Hewlett Packard Enterprise Company", "summary": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE BladeSystem, HPE Synergy, and HPE ProLiant; storage solutions; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE Modular Storage Arrays and HPE XP. It also offers HPE Apollo and Cray products; and HPE Superdome Flex, HPE Nonstop, HPE Integrity, HPE Moonshot, and HPE Edgeline products. Additionally, the company provides mobility and Internet of Things solutions under the Aruba brand, which include wired and wireless local area network products, such as Wi-Fi access points, switches, routers, and sensors; software products, such as cloud-based management, network management, network access control, analytics and assurance, and location services; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. In addition, it offers various investment solutions, which comprise leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Further, the company invests in communications and media solutions, Hewlett Packard labs, and various business incubation projects. It serves commercial and large enterprise groups, including business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Houston"}, "2HP.F": {"short_name": "HEWLETT PACKARD ENT.", "long_name": "Hewlett Packard Enterprise Company", "summary": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE BladeSystem, HPE Synergy, and HPE ProLiant; storage solutions; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE Modular Storage Arrays and HPE XP. It also offers HPE Apollo and Cray products; and HPE Superdome Flex, HPE Nonstop, HPE Integrity, HPE Moonshot, and HPE Edgeline products. Additionally, the company provides mobility and Internet of Things solutions under the Aruba brand, which include wired and wireless local area network products, such as Wi-Fi access points, switches, routers, and sensors; software products, such as cloud-based management, network management, network access control, analytics and assurance, and location services; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. In addition, it offers various investment solutions, which comprise leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Further, the company invests in communications and media solutions, Hewlett Packard labs, and various business incubation projects. It serves commercial and large enterprise groups, including business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Houston"}, "2IU.F": {"short_name": "BOXLIG.CORP CL.A DL-,0001", "long_name": "Boxlight Corporation", "summary": "Boxlight Corporation, an education technology company, develops, sells, and services interactive classroom solutions for the education market worldwide. The company provides a range of interactive classroom technology products primarily targeted at the K-12 education market. Its products include interactive projectors, interactive flat panel displays, interactive touch projectors, touchboards, and MimioTeach that could turn any whiteboard interactive; and accessory document cameras, teacher pads for remote control, and assessment systems. The company also offers MimioStudio Interactive Instructional Software that enables the creation, editing, and presentation of interactive instructional lessons and activities; MimioMobile, a software accessory for MimioStudio; Oktopus Instructional and Whiteboarding Software that enables the creation, editing, and presentation of interactive instructional lessons and activities; Notes+, a software accessory for use with Oktopus software; and GameZones and MimioInteract, which are multi-student interactive gaming software. In addition, it offers interactive touch tables and whiteboards; and peripherals and accessories, such as amplified speaker systems, mobile carts, installation accessories, and wall-mount accessories for interactive and standard projectors, and LED flat panels. Further, the company distributes interactive projectors and LED flat panels; and science, technology, engineering, and math data logging and robotics products. It has a strategic partnership with CareHawk for providing audio solutions for the education market. The company was formerly known as Logical Choice Corporation. Boxlight Corporation was incorporated in 2014 and is headquartered in Lawrenceville, Georgia.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Lawrenceville"}, "2JD.F": {"short_name": "MAXAR TECHNOL.INC.  O.N.", "long_name": "Maxar Technologies Inc.", "summary": "Maxar Technologies Inc. provides earth intelligence and space infrastructure solutions in the United States, Asia, South America, Europe, the Middle East, Australia, Canada, and internationally. It operates through Earth Intelligence and Space Infrastructure segments. The Earth Intelligence segment offers Earth imagery and radar data solutions, including orthorectified imagery, mosaic, elevation, and information products; and SecureWatch, a subscription offering that provides online access to imagery and geospatial intelligence platform, as well as geospatial information, applications, and analytic services. This segment serves to the U.S., Canadian, and other international government agencies, such as defense and intelligence, and civil agencies, as well as commercial customers in various markets. The Space Infrastructure segment provides space and ground based infrastructure, robotics, components, and information solutions, including communication and imaging satellites and payloads; space platforms for power, propulsion, and communication; satellite ground systems and support services; space-based and airborne remote sensory solutions; space robotics; and defense systems. This segment serves government agencies and commercial satellite operators. Maxar Technologies Inc. was founded in 1969 and is headquartered in Westminster, Colorado.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Westminster"}, "2W9.F": {"short_name": "SONIM TECHNOLOGIE DL-,001", "long_name": "Sonim Technologies, Inc.", "summary": "Sonim Technologies, Inc. provides ruggedized mobile phones and accessories for task workers. It offers ruggedized mobile phones, such as Sonim XP8, Sonim XP5s, and Sonim XP3 based on the Android platform that are capable of attaching to public and private wireless networks; industrial-grade accessories, including remote speaker microphones, multi-bay charging accessories, and in-vehicle hands-free voice communications solutions; cloud-based software and application services; and Rapid Deployment Kit, a portable communications system. Sonim Technologies, Inc. sells its mobile phones and accessories primarily to wireless carriers in the United States and Canada. The company serves transportation and logistics, construction, manufacturing, facilities management, energy and utility, and public sectors. The company was formerly known as NaviSpin.com, Inc. and changed its name to Sonim Technologies, Inc. in December 2001. Sonim Technologies, Inc. was incorporated in 1999 and is headquartered in Austin, Texas.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Austin"}, "2W9.SG": {"short_name": "Sonim Technologies Inc. Registe", "long_name": "Sonim Technologies, Inc.", "summary": "Sonim Technologies, Inc. provides ruggedized mobile phones and accessories for task workers. It offers ruggedized mobile phones, such as Sonim XP8, Sonim XP5s, and Sonim XP3 based on the Android platform that are capable of attaching to public and private wireless networks; industrial-grade accessories, including remote speaker microphones, multi-bay charging accessories, and in-vehicle hands-free voice communications solutions; cloud-based software and application services; and Rapid Deployment Kit, a portable communications system. Sonim Technologies, Inc. sells its mobile phones and accessories primarily to wireless carriers in the United States and Canada. The company serves transportation and logistics, construction, manufacturing, facilities management, energy and utility, and public sectors. The company was formerly known as NaviSpin.com, Inc. and changed its name to Sonim Technologies, Inc. in December 2001. Sonim Technologies, Inc. was incorporated in 1999 and is headquartered in Austin, Texas.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "STU", "market": "dr_market", "country": "United States", "city": "Austin"}, "5TK.F": {"short_name": "AGJUNCTION INC.", "long_name": "AgJunction Inc.", "summary": "AgJunction Inc. provides guidance and autosteering solutions for precision agriculture applications worldwide. Its products and solutions offer accurate guidance and positioning, autosteering, and machine automation for the agriculture markets and used in various farming operation, including tilling, planting, spraying, and harvesting. The company offers RANGER guidance solution, a GPS guidance solution, which shows visual cues in advance affording farmers the time to focus on farming instead of focusing on a map display; and Wheelman autosteering systems, such as Wheelman Pro and Wheelman Flex, and Whirl software for farmers to steer farm equipment directly to farmers through online. It also provides Wheelman white-label solutions; ECU-S1 hardware controller family; and MDU-G4 and MDU-G5 electronic steering, as well as software modules for integration into manufacturer and supplier systems. The company markets its solutions under the Novariant, Wheelman, Whirl, and Handsfreefarm brands. The company was formerly known as Hemisphere GPS Inc. and changed its name to AgJunction Inc. in May 2013. AgJunction Inc. was incorporated in 1990 and is headquartered in Scottsdale, Arizona.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Scottsdale"}, "6LV.F": {"short_name": "AIRGAIN INC.  DL-,0001", "long_name": "Airgain, Inc.", "summary": "Airgain, Inc. designs, develops, and engineers antenna products for original equipment and design manufacturers, chipset vendors, service providers, and value added resellers and distributors worldwide. The company's products include MaxBeam embedded antennas; profile embedded antennas; profile contour embedded antennas; ultra-embedded antennas; OmniMax high performance external antennas; MaxBeam carrier class antennas; and SmartMax embedded antennas, as well as automotive, fleet, public safety, and M2M antennas. It provides embedded antenna technologies to enable high performance wireless networking across a range of devices and markets, including consumer, enterprise, and automotive. The company was formerly known as AM Group and changed its name to Airgain, Inc. in 2004. Airgain, Inc. was founded in 1995 and is headquartered in San Diego, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Diego"}, "AAPJ": {"short_name": "AAP INC", "long_name": "AAP, Inc.", "summary": "AAP, Inc. provides power, comfort, and control systems for motor coaches, trucks, specialty vehicles, trailers, and other applications worldwide. The company offers air conditioning/heating systems, HVAC accessories, inverters and battery chargers, air purifiers, sound attenuating foams, refrigerators/freezers, icemakers, coolers, automatic computerized voltage disconnect systems, DC electrical systems, electrical start assist devices, and power transfer switches. It serves communication, medical, fire, rescue, race car transporter, recreational vehicle, trucking, and luxury motor coach and special purpose vehicle industries. The company offers its products under the AAP Inc., Dometic, and Vitrifrigo America brands. The company was formerly known as Borneo Energy USA, Inc. and changed its name to AAP, Inc. in September 2011. AAP, Inc. was founded in 1980 and is based in Milford, Virginia.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Milford"}, "AAWCD": {"short_name": "CANNING STR CORP", "long_name": "Canning Str Corp.", "summary": "Canning Str Corp., together with its subsidiaries, engages in the design, development, manufacture, and marketing of wireless communications semiconductors in the United States. It manufactures wireless transmitter and receiver microchips based on its proprietary technology, True Software Radio. The True Software Radio enables communications devices, such as cell phones, PDAs, laptops, and other mobile devices to communicate with other communications devices across various wireless standards, such as CDMA, TDMA, GSM, GPRS, G3, Bluetooth, WiFi, WiMAX, and WiBro. The company also designs and sells products for Internet television, stream media protocol processing, and broadcasting software for Internet television-set-top boxes. In addition, it provides Ethernet networking solutions, including the IntraCore and FriendlyNET product families, which integrate voice, data, and video over wireless and wired networks with unified management and authentication. Canning Str Corp. offers its products to the original design manufacturers and original equipment manufacturers. The company was formerly known as Alexandria Advantage Warranty Company and changed its name to Canning Str Corp. in December 2020. Canning Str Corp. was founded in 1991 and is based in Manhattan Beach, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Manhattan Beach"}, "ACIA": {"short_name": "Acacia Communications, Inc.", "long_name": "Acacia Communications, Inc.", "summary": "Acacia Communications, Inc. develops, manufactures, and sells high-speed coherent optical interconnect products in the United States, China, Germany, Thailand, and internationally. The company offers embedded and pluggable module products consisting of optical interconnect modules with transmission speeds ranging from 100 to 1,200 gigabits per second for use in long-haul, metro, and inter-data center markets. It also provides semiconductor products, such as low-power coherent digital signal processor application-specific integrated circuits and silicon photonic integrated circuits that are integrated into embedded and pluggable modules. The company sells its products through a direct sales force to network equipment manufacturers, network operators, and cloud service providers. Acacia Communications, Inc. was founded in 2009 and is headquartered in Maynard, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Maynard"}, "ADTN": {"short_name": "ADTRAN, Inc.", "long_name": "ADTRAN, Inc.", "summary": "ADTRAN, Inc. provides networking and communications equipment for service providers, cable/multiple system operators, and distributed enterprises in the United States and internationally. The company operates through Network Solutions, and Services & Support segments. It offers fiber to the premises and fiber to the node (FTTN) multi-service access nodes (MSAN); fiber aggregation and FTTN MSAN; network management and subscriber services control and orchestration software; software defined networking -controlled programmable network elements; fiber to the distribution point units; optical line terminals and transport solutions; optical networking edge aggregation; IP digital subscriber line access multiplexers; cabinet and outside-plant enclosures and services; transceivers, cables, and other miscellaneous materials; and other products, software, and services. The company also provides broadband customer premise solutions and point-to-point Ethernet optical network terminals; radio frequency over glass micro nodes; residential gateway products and accessories; Wi-Fi access points; ethernet switches for multi-gigabit local area networking; SmartOS software licensing for residential and enterprise gateway, and Wi-Fi devices; cloud-based SaaS management platforms; Wi-Fi-enabled residential gateway products and accessories; access points and virtual wireless local area networks for business-class Wi-Fi and management; and pre-sale and post-sale technical support. In addition, it offers planning, engineering, program management, maintenance, installation, and commissioning services. Further, the company offers time division multiplexed and asynchronous transfer mode based aggregation systems and customer devices; and high-bit-rate digital subscriber line, asymmetric digital subscriber line, and other technologies to deliver business and residential services. ADTRAN, Inc. was founded in 1985 and is headquartered in Huntsville, Alabama.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Huntsville"}, "AERS": {"short_name": "AERIUS", "long_name": "Aerius International, Inc.", "summary": "Aerius International, Inc. operates as a cell phone engineering, product design, and marketing company in the United States and internationally. The company offers communication technologies for cellular handset and other mobile wireless communication devices for civilian and military applications. It also develops antenna technology for cellular and other mobile wireless communications devices. The company has strategic alliance with RFIC Solutions Inc. Aerius International, Inc. is based in Billings, Montana.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Billings"}, "AIRG": {"short_name": "Airgain, Inc.", "long_name": "Airgain, Inc.", "summary": "Airgain, Inc. designs, develops, and engineers antenna products for original equipment and design manufacturers, chipset vendors, service providers, and value added resellers and distributors worldwide. The company's products include MaxBeam embedded antennas; profile embedded antennas; profile contour embedded antennas; ultra-embedded antennas; OmniMax high performance external antennas; MaxBeam carrier class antennas; and SmartMax embedded antennas, as well as automotive, fleet, public safety, and M2M antennas. It provides embedded antenna technologies to enable high performance wireless networking across a range of devices and markets, including consumer, enterprise, and automotive. The company was formerly known as AM Group and changed its name to Airgain, Inc. in 2004. Airgain, Inc. was founded in 1995 and is headquartered in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Diego"}, "AJX.TO": {"short_name": "AGJUNCTION INC", "long_name": "AgJunction Inc.", "summary": "AgJunction Inc. provides guidance and autosteering solutions for precision agriculture applications worldwide. Its products and solutions offer accurate guidance and positioning, autosteering, and machine automation for the agriculture markets and used in various farming operation, including tilling, planting, spraying, and harvesting. The company offers RANGER guidance solution, a GPS guidance solution, which shows visual cues in advance affording farmers the time to focus on farming instead of focusing on a map display; and Wheelman autosteering systems, such as Wheelman Pro and Wheelman Flex, and Whirl software for farmers to steer farm equipment directly to farmers through online. It also provides Wheelman white-label solutions; ECU-S1 hardware controller family; and MDU-G4 and MDU-G5 electronic steering, as well as software modules for integration into manufacturer and supplier systems. The company markets its solutions under the Novariant, Wheelman, Whirl, and Handsfreefarm brands. The company was formerly known as Hemisphere GPS Inc. and changed its name to AgJunction Inc. in May 2013. AgJunction Inc. was incorporated in 1990 and is headquartered in Scottsdale, Arizona.", "currency": "CAD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Scottsdale"}, "AJXGF": {"short_name": "AGJUNCTION INC", "long_name": "AgJunction Inc.", "summary": "AgJunction Inc. provides guidance and autosteering solutions for precision agriculture applications worldwide. Its products and solutions offer accurate guidance and positioning, autosteering, and machine automation for the agriculture markets and used in various farming operation, including tilling, planting, spraying, and harvesting. The company offers RANGER guidance solution, a GPS guidance solution, which shows visual cues in advance affording farmers the time to focus on farming instead of focusing on a map display; and Wheelman autosteering systems, such as Wheelman Pro and Wheelman Flex, and Whirl software for farmers to steer farm equipment directly to farmers through online. It also provides Wheelman white-label solutions; ECU-S1 hardware controller family; and MDU-G4 and MDU-G5 electronic steering, as well as software modules for integration into manufacturer and supplier systems. The company markets its solutions under the Novariant, Wheelman, Whirl, and Handsfreefarm brands. The company was formerly known as Hemisphere GPS Inc. and changed its name to AgJunction Inc. in May 2013. AgJunction Inc. was incorporated in 1990 and is headquartered in Scottsdale, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "AKOM.PA": {"short_name": "AERKOMM INC", "long_name": "Aerkomm Inc.", "summary": "Aerkomm Inc., together with its subsidiaries, focuses on providing in-flight entertainment and connectivity solutions in the Asian Pacific region. It intends to provide airline passengers with broadband in-flight service options, such as Wi-Fi, cellular, movies, gaming, live TV, and music. The company intends to offer its services through built-in in-flight entertainment systems, such as seat-back displays, as well as on passengers' personal devices. Aerkomm Inc. is based in Incline Village, Nevada.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PAR", "market": "fr_market", "country": "United States", "city": "Incline Village"}, "AKTS": {"short_name": "Akoustis Technologies, Inc.", "long_name": "Akoustis Technologies, Inc.", "summary": "Akoustis Technologies, Inc., through its subsidiary, Akoustis, Inc., develops, designs, manufactures, and sells radio frequency (RF) filter products for the mobile wireless device industry in the United States. It operates through two segments, Foundry Fabrication Services and RF Filters. The Foundry Fabrication Services segment provides engineering review services; and semiconductor wafer-manufacturing and microelectromechanical systems foundry services. The RF Filters segment consists of amplifier and filter products. It offers RF filters for mobile wireless devices, such as smartphones and tablets, cellular infrastructure equipment, Wi-Fi customer premise equipment, military and defense applications. The company was incorporated in 2013 and is headquartered in Huntersville, North Carolina.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Huntersville"}, "AMPG": {"short_name": "AMPLITECH GROUP INC.", "long_name": "AmpliTech Group, Inc.", "summary": "AmpliTech Group, Inc. designs, engineers, and assembles micro-wave component based amplifiers. The company's products include radio frequency amplifiers and related subsystems, such as low noise amplifiers for use in receivers of various communication systems comprise Wi-Fi, radar, satellite, base station, cell phone, radio, etc.; medium power amplifiers to provide increased output power and gain in transceiver chains; oscillators that consist of phase locked oscillators and dielectric resonator oscillators for transceiver applications; and filters that discriminate or block out frequencies in communication systems. It also provides custom assembly designs and non-recurring engineering services on a project-by-project basis. The company serves aerospace, government, defense, and commercial satellite industries. It sells its products through sales representatives or distributors in North America, Europe, and Asia. AmpliTech Group, Inc. was founded in 2002 and is based in Bohemia, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bohemia"}, "ATGN": {"short_name": "ALTIGEN COMMUNICATIONS INC", "long_name": "Altigen Communications, Inc.", "summary": "Altigen Communications, Inc., a Microsoft Cloud Solutions provider, designs, delivers, and supports Voice over Internet Protocol (VoIP) phone systems and call center solutions worldwide. The company offers MaxCommunications Server (MaxCS) IP-PBX, a software-based phone system that provides customers with business communications solutions; MaxACD VoIP Contact Center, a software-based automatic call distribution engine, which offers call routing and call distribution options; MaxMobile that extends a set of business PBX functionality to smart phone devices; and MaxCommunicator, a Windows-based desktop application, which provides call control and visual voice mail management to the desktop. It also offers MaxAgent, a Windows-based desktop application to bring call control and workgroup information to call center agents; MaxSupervisor, a Windows-based desktop application for call center supervisors; and MaxACD for Lync, a call center solution. In addition, the company provides hosted services, which include hosted IP PBX, session initiation protocol trunk, call center solution, voice and video calling, conference calling, and various long-distance services; and software assurance services, which offer customers with software updates, patches, new releases, and technical support for the applications they are licensed to use. It sells its products to small-to-medium sized and multi-site businesses, corporate branch offices, call centers, credit unions, and community banks through a channel of distributors and resellers. The company was founded in 1994 and is headquartered in Milpitas, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Milpitas"}, "ATN.F": {"short_name": "ADTRAN INC.  DL-,01", "long_name": "ADTRAN, Inc.", "summary": "ADTRAN, Inc. provides networking and communications equipment for service providers, cable/multiple system operators, and distributed enterprises in the United States and internationally. The company operates through Network Solutions, and Services & Support segments. It offers fiber to the premises and fiber to the node (FTTN) multi-service access nodes (MSAN); fiber aggregation and FTTN MSAN; network management and subscriber services control and orchestration software; software defined networking -controlled programmable network elements; fiber to the distribution point units; optical line terminals and transport solutions; optical networking edge aggregation; IP digital subscriber line access multiplexers; cabinet and outside-plant enclosures and services; transceivers, cables, and other miscellaneous materials; and other products, software, and services. The company also provides broadband customer premise solutions and point-to-point Ethernet optical network terminals; radio frequency over glass micro nodes; residential gateway products and accessories; Wi-Fi access points; ethernet switches for multi-gigabit local area networking; SmartOS software licensing for residential and enterprise gateway, and Wi-Fi devices; cloud-based SaaS management platforms; Wi-Fi-enabled residential gateway products and accessories; access points and virtual wireless local area networks for business-class Wi-Fi and management; and pre-sale and post-sale technical support. In addition, it offers planning, engineering, program management, maintenance, installation, and commissioning services. Further, the company offers time division multiplexed and asynchronous transfer mode based aggregation systems and customer devices; and high-bit-rate digital subscriber line, asymmetric digital subscriber line, and other technologies to deliver business and residential services. ADTRAN, Inc. was founded in 1985 and is headquartered in Huntsville, Alabama.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Huntsville"}, "AVH.F": {"short_name": "AKOUSTIS TECHN. DL-,001", "long_name": "Akoustis Technologies, Inc.", "summary": "Akoustis Technologies, Inc., through its subsidiary, Akoustis, Inc., develops, designs, manufactures, and sells radio frequency (RF) filter products for the mobile wireless device industry in the United States. It operates through two segments, Foundry Fabrication Services and RF Filters. The Foundry Fabrication Services segment provides engineering review services; and semiconductor wafer-manufacturing and microelectromechanical systems foundry services. The RF Filters segment consists of amplifier and filter products. It offers RF filters for mobile wireless devices, such as smartphones and tablets, cellular infrastructure equipment, Wi-Fi customer premise equipment, military and defense applications. The company was incorporated in 2013 and is headquartered in Huntersville, North Carolina.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Huntersville"}, "AVNW": {"short_name": "Aviat Networks, Inc.", "long_name": "Aviat Networks, Inc.", "summary": "Aviat Networks, Inc. designs, manufactures, and sells a range of wireless networking products, solutions, and services in North America, Africa, the Middle East, Europe, Russia, Latin America, and the Asia Pacific. Its products include broadband wireless access base stations and customer premises equipment for fixed and mobile networks; and point-to-point digital microwave radio systems for access, backhaul, trunking, and license-exempt applications, as well as supporting new network deployments, network expansion, and capacity upgrades. The company also offers software tools and applications to enable deployment, monitoring, network management, and optimization of its systems, as well as to automate network design and procurement; and sources, supplies, and supports third party equipment, such as antennas, routers, optical transmission equipment, and other equipment to build and deploy telecommunications transmission network. In addition, it provides a suite of professional services, including planning, deployment, operation, optimization, and maintenance of customers' networks. The company serves mobile and fixed telecommunications network operators, and broadband and internet service providers and network operators; federal, state, and local government agencies; and transportation, energy, and utility companies, as well as public safety agencies and broadcast network operators. It markets its products through a direct sales, service, and support organization, as well as through original equipment manufacturers and system integrators; indirectly through dealers, resellers, and sales representatives; and through online. The company was formerly known as Harris Stratex Networks, Inc. and changed its name to Aviat Networks, Inc. in January 2010. Aviat Networks, Inc. was incorporated in 2006 and is headquartered in Austin, Texas.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Austin"}, "AVSR": {"short_name": "AVISTAR COMMUNICATIONS CORP", "long_name": "Avistar Communications Corp.", "summary": "Avistar Communications Corporation designs, develops, manufactures, markets, and sells networked video communications products primarily in the United States, western Europe, and Asia. It delivers a suite of video, audio, and collaboration solutions that are designed to support users in the office through the conference room or on-the-go. The company offers Avistar C3, a communication and collaboration platform, which provides an integrated suite of video, audio, and collaboration applications that include on-demand access to interactive video calling and conferencing, content creation and publishing, broadcast origination and video distribution, and video-on-demand, as well as data sharing, presence-based directory services, and network management. Avistar Communications Corporation also provides various services for the implementation and support of its video communications products; and offers software development, maintenance, support, and training services. In addition, it is involved in the development, prosecution, maintenance, support, and licensing of the intellectual property and technology used in the company's video communications systems. Further, the company sells and licenses a set of desktop products and infrastructure products that combine to form an Avistar video-enabled visual communication and collaboration solution. Avistar Communications Corporation offers its products and services through its direct sales force, as well as through strategic partners and value added resellers. The company was formerly known as Avistar Systems Corporation and changed its name to Avistar Communications Corporation in April 2000. Avistar Communications Corporation was founded in 1993 and is headquartered in San Mateo, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Mateo"}, "AWSI": {"short_name": "ARIA WIRELESS SYSTEMS INC", "long_name": "ARIA Wireless Systems, Inc.", "summary": "Wireless data communication, manufactures systems allowing data transmissions between different platforms in an encrypted manner over radio waves; Sells mostly outside of the U.S. (China, Russia, Peru, Turkey)", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Buffalo"}, "BDR": {"short_name": "Blonder Tongue Laboratories, In", "long_name": "Blonder Tongue Laboratories, Inc.", "summary": "Blonder Tongue Laboratories, Inc., a technology-development and manufacturing company, provides television (TV) signal encoding, transcoding, digital transport, and broadband product solutions in the United States. It offers digital video headend products comprising high definition and standard definition, MPEG-2, and MPEG-4/H.264 encoders and transcoders; satellite quadrature phase shift key and eight phase shift key to quadrature amplitude modulation (QAM) transcoders; digital QAM multiplexers; ATSC/QAM-IP transcoders; EdgeQAM devices; and NeXgen Gateway, a digital video signal processing platform to system operators for the acquisition, processing, compression, encoding, and management of digital videos. In addition, the company offers analog video headend products, such as pre-fabricated head ends to accommodate analog TV systems, modulators, demodulators, and processors for system operators for signal acquisition, processing, and manipulation to create an analog channel lineup for further transmission. Further, it provides hybrid-fiber coax distribution products comprising broadband amplifiers, directional taps, splitters, and wall outlets for coax distribution and fiber optic transmitters, receivers, and couplers. Additionally, the company offers Android-based IPTV set top boxes; cable modem termination systems and cable modems to deliver data, video, and voice-over-coaxial in hospitality, multi-dwelling units, and college campuses; and test instruments, contract manufacturing and technical services, reception products, and miscellaneous products and services. It serves TV broadcasters, cable system operators, and lodging/hospitality video and high-speed Internet system operators, as well as commercial/institutional/enterprise system operators, including, correctional facilities, sports stadiums, and airport terminals through its sales force and distributors. Blonder Tongue Laboratories, Inc. was founded in 1950 and is headquartered in Old Bridge, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Old Bridge"}, "BKSD": {"short_name": "BLUEPRINT TECHNOLOGIES INC", "long_name": "BluePrint Technologies, Inc.", "summary": "Blueprint Technologies, Inc., a business communication company, provides telecommunication technologies, and business telecom products and services primarily in the United States. It designs, implements, finances, and supports various communication solutions through its TELEFFICIENCY program. The company offers contact center management software products for call recording, agent evaluation, and quality assurance functionality; contact center solutions to handle various types of media telephone calls, emails, fax, SMS, Web chat, and social media; and voice over Internet protocol phone services for businesses, as well as IP telephony solutions. It also provides surveillance cameras for commercial security system needs, video conferencing equipment, and virtualized voice solutions; and data network cabling, unified communications, mobility, and security solutions. The company was formerly known as Brookside Technology Holdings Corp. and changed its name to Blueprint Technologies, Inc. in February 2011. Blueprint Technologies, Inc. was incorporated in 2005 and is based in Clearwater, Florida.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Clearwater"}, "BKTI": {"short_name": "BK Technologies Corporation", "long_name": "BK Technologies Corporation", "summary": "BK Technologies Corporation, through its subsidiary, BK Technologies, Inc., designs, manufactures, and markets wireless communications products in the United States and internationally. The company offers two-way land mobile radios (LMR), repeaters, base stations, and related components and subsystems under BK Technologies, BK Radio, and RELM brand names. Its BK Technologies and BK Radio branded products include LMR equipment for professional radio users primarily in government, public safety, and military applications, as well as P-25 digital products; and RELM branded products provide two-way communications for commercial and industrial concerns, such as hotels, construction firms, schools, and transportation services. The company was incorporated in 1997 and is headquartered in West Melbourne, Florida.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "West Melbourne"}, "BOGN": {"short_name": "BOGEN COMMUNICATIONS INTL INC", "long_name": "Bogen Communications International, Inc.", "summary": "Bogen Communications International, Inc., together with its subsidiaries, develops, markets, and sells telecommunications software and related hardware primarily in Europe and the Middle East. It also offers services and support for its software and hardware. The company is based in Mahwah, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Mahwah"}, "BOXL": {"short_name": "Boxlight Corporation", "long_name": "Boxlight Corporation", "summary": "Boxlight Corporation, an education technology company, develops, sells, and services interactive classroom solutions for the education market worldwide. The company provides a range of interactive classroom technology products primarily targeted at the K-12 education market. Its products include interactive projectors, interactive flat panel displays, interactive touch projectors, touchboards, and MimioTeach that could turn any whiteboard interactive; and accessory document cameras, teacher pads for remote control, and assessment systems. The company also offers MimioStudio Interactive Instructional Software that enables the creation, editing, and presentation of interactive instructional lessons and activities; MimioMobile, a software accessory for MimioStudio; Oktopus Instructional and Whiteboarding Software that enables the creation, editing, and presentation of interactive instructional lessons and activities; Notes+, a software accessory for use with Oktopus software; and GameZones and MimioInteract, which are multi-student interactive gaming software. In addition, it offers interactive touch tables and whiteboards; and peripherals and accessories, such as amplified speaker systems, mobile carts, installation accessories, and wall-mount accessories for interactive and standard projectors, and LED flat panels. Further, the company distributes interactive projectors and LED flat panels; and science, technology, engineering, and math data logging and robotics products. It has a strategic partnership with CareHawk for providing audio solutions for the education market. The company was formerly known as Logical Choice Corporation. Boxlight Corporation was incorporated in 2014 and is headquartered in Lawrenceville, Georgia.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Lawrenceville"}, "CAMP": {"short_name": "CalAmp Corp.", "long_name": "CalAmp Corp.", "summary": "CalAmp Corp. provides in telematics systems, and software and subscription services in the United States, Europe, the Middle East, Africa, South America, Asia and Pacific Rim, and internationally. The company offers telematics products, including asset tracking units, mobile telematics devices, fixed and mobile wireless gateways, and routers; and stolen vehicle recovery products for the broader connected vehicle and Internet of Things market, which enable customers to optimize their operations by collecting, monitoring, and reporting business-critical information and desired intelligence from remote and mobile assets. It also provides CalAmp Telematics Cloud platform, such as cloud-based application enablement and telematics service platforms that facilitate integration of its own applications, as well as those of third parties, through open application programming interfaces; and software as a service applications. In addition, the company offers professional services, including project management, engineering services, installation services, and an on-going early warning automated notification service. It sells its products and services to customers in the automotive, insurance, transportation and logistics, government, and construction markets through direct sales organization, a channel partner program, and sales representatives, as well as its Websites and digital platform. The company was founded in 1981 and is headquartered in Irvine, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Irvine"}, "CASA": {"short_name": "Casa Systems, Inc.", "long_name": "Casa Systems, Inc.", "summary": "Casa Systems, Inc., a communications technology company, provides solutions for next-generation centralized, distributed, and virtualized architectures for cable broadband, fixed-line broadband, and wireless networks in North America, Latin America, the Asia-Pacific, Europe, the Middle East, and Africa. It offers converged cable access platforms; wireless network core products, such as virtual evolved packet and 5G core products, and security and wireless gateways, as well as small cell solutions and fixed wireless access devices; and optical access solutions, virtualized broadband network gateway router and multiservice routers, fiber-to-the-distribution-point devices, and residential broadband gateways; and machine-to-machine and industrial internet of things routers. The company was founded in 2003 and is headquartered in Andover, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Andover"}, "CC6.F": {"short_name": "COMTECH TELECOMM.  DL-,10", "long_name": "Comtech Telecommunications Corp.", "summary": "Comtech Telecommunications Corp. designs, develops, produces, and markets products, systems, and services for communications solutions in the United States and internationally. It operates in two segments, Commercial Solutions and Government Solutions. The Commercial Solutions segment offers satellite ground station technologies, including modems, amplifiers, frequency converters, and network software to modulate, demodulate, and amplify signals, as well as to carry voice, video, and/or data over networks; and public safety and location technologies covering 911 call routing solutions that allow cellular carriers and over the Internet carriers to deliver emergency calls to public safety emergency call centers. The Government Solutions segment provides mission-critical technologies comprising tactical satellite-based networks, such as satellite modems, ruggedized routers, and solid-state drives; very small aperture terminals; and sustainment services for the secret Internet Protocol router and non-classified Internet Protocol router access point. This segment also offers high-performance transmission technologies that are used in communication systems comprising electronic warfare, radar, and identification friend or foe (IFF); troposcatter technologies for satellite communication; and high-power amplifiers and related switching technologies that are used in electronic warfare, communications, radar, IFF, and medical applications, such as oncology cancer treatment systems. The company serves satellite systems integrators, wireless and other communication service providers, satellite broadcasters, prime contractors and system suppliers, medical equipment companies, aviation industry system integrators, oil companies, and domestic and international defense and government customers, as well as end-customers. Comtech Telecommunications Corp. was founded in 1967 and is headquartered in Melville, New York.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Melville"}, "CIE1.F": {"short_name": "CIENA CORP. NEW  DL-,01", "long_name": "Ciena Corporation", "summary": "Ciena Corporation provides network hardware, software, and services that support the transport, routing, switching, aggregation, service delivery, and management of video, data, and voice traffic on communications networks worldwide. The company's Networking Platforms segment offers hardware networking products and solutions that optimized for the convergence of coherent optical transport, optical transport network switching, and packet switching. Its products include 6500 Packet-Optical Platform, 5430 Reconfigurable Switching System, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as Z-Series Packet-Optical Platform; 3000 family of service delivery switches and service aggregation switches, and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and the Ethernet packet configuration for the 5410 Service Aggregation Switch; and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, network function virtualization orchestration, analytics, and related services. Its Platform Software and Service segment offers OneControl unified management system and platform software services, as well as manage, control, and plan software. The company's Global Services segment provides consulting and network design, installation and deployment, maintenance support, and training services. The company sells its products through direct and indirect sales channels to network operators. Ciena Corporation was founded in 1992 and is headquartered in Hanover, Maryland.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Hanover"}, "CIEN": {"short_name": "Ciena Corporation", "long_name": "Ciena Corporation", "summary": "Ciena Corporation provides network hardware, software, and services that support the transport, routing, switching, aggregation, service delivery, and management of video, data, and voice traffic on communications networks worldwide. The company's Networking Platforms segment offers hardware networking products and solutions that optimized for the convergence of coherent optical transport, optical transport network switching, and packet switching. Its products include 6500 Packet-Optical Platform, 5430 Reconfigurable Switching System, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as Z-Series Packet-Optical Platform; 3000 family of service delivery switches and service aggregation switches, and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and the Ethernet packet configuration for the 5410 Service Aggregation Switch; and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, network function virtualization orchestration, analytics, and related services. Its Platform Software and Service segment offers OneControl unified management system and platform software services, as well as manage, control, and plan software. The company's Global Services segment provides consulting and network design, installation and deployment, maintenance support, and training services. The company sells its products through direct and indirect sales channels to network operators. Ciena Corporation was founded in 1992 and is headquartered in Hanover, Maryland.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Hanover"}, "CIS.BR": {"short_name": "CISCO SYSTEM INC", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "BRU", "market": "be_market", "country": "United States", "city": "San Jose"}, "CIS.DE": {"short_name": "CISCO SYSTEMS  DL-,001", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "GER", "market": "de_market", "country": "United States", "city": "San Jose"}, "CIS.F": {"short_name": "CISCO SYSTEMS  DL-,001", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "CLFD": {"short_name": "Clearfield, Inc.", "long_name": "Clearfield, Inc.", "summary": "Clearfield, Inc. manufactures, markets, and sells standard and custom passive connectivity products to the fiber-to-the-premises, enterprises, and original equipment manufacturers markets in the United States and internationally. The company offers FieldSmart, a series of panels, cabinets, wall boxes, and other enclosures. It also provides WaveSmart, which are optical components integrated for signal coupling, splitting, termination, multiplexing, demultiplexing, and attenuation for integration within its fiber management platform; and outdoor cabinet and fiber active cabinet products. In addition, the company offers StreetSmart, a portfolio of fiber management products; FieldShield, a fiber pathway and protection method for reducing the cost of broadband deployment; and YOURx platform that consists of hardened terminals, test access points, and various drop cable options for portions of the access network across various fiber drop cable media. Further, it provides CraftSmart, a line of optical protection field enclosures, including CraftSmart Fiber Protection Pedestals and CraftSmart Fiber Protection Vaults integrated solutions optimized to house FieldSmart products at the last mile access point of the network in above-grade or below-grade installations. Additionally, the company offers fiber and copper assemblies with an industry-standard or customer-specified configuration; and designs and manufactures custom solutions for in-the-box and network connectivity assemblies specific to that customer's product line. It provides its fiber to anywhere platform for various incumbent local exchange carriers, competitive local exchange carriers, wireless operators, and MSO/cable TV companies, as well as the utility/municipality, enterprise, and data center markets. The company was formerly known as APA Enterprises, Inc. and changed its name to Clearfield, Inc. in January 2008. Clearfield, Inc. was founded in 1979 and is headquartered in Minneapolis, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Minneapolis"}, "CLRO": {"short_name": "ClearOne, Inc.", "long_name": "ClearOne, Inc.", "summary": "ClearOne, Inc., together with its subsidiaries, designs, develops, and sells conferencing, collaboration, and network streaming solutions for voice and visual communications in the United States and internationally. The company offers a range of audio conferencing products, including professional audio conferencing and sound-reinforcement products for use in enterprise, healthcare, education and distance learning, government, legal, and finance organizations; mid-tier premium conferencing products for smaller rooms, and small and medium businesses, which interface with video and Web conferencing systems; USB-based personal and group speakerphones that could be used with PCs, laptops, tablets, smartphones, and other portable devices; and traditional tabletop conferencing phones used in conference rooms and offices. It also provides video products, such as video conferencing and collaboration solutions; and AV networking, which deliver the IP A/V experience by streaming time sensitive high definition audio and video, and control over TCP/IP networks. In addition, the company offers professional microphones consisting of beamforming microphones, ceiling microphones, and wireless microphones. ClearOne, Inc. sells its commercial products to a network of independent professional audiovisual, information technology, and telecommunications distributors, as well as systems integrators, dealers, value-added resellers, and end-users. The company was founded in 1983 and is headquartered in Salt Lake City, Utah.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Salt Lake City"}, "CM9.F": {"short_name": "COMMSCOPE HLDG CO. INC.", "long_name": "CommScope Holding Company, Inc.", "summary": "CommScope Holding Company, Inc. provides infrastructure solutions for communications and entertainment networks worldwide. The company's Connectivity segment offers fiber optic, copper cable, and connectivity solutions for use in data centers, business enterprises, telecommunications, cable television, and residential broadband networks. Its Mobility segment provides building blocks for cellular base station sites and related connectivity; indoor, small cell, and distributed antenna wireless systems; and wireless network backhaul planning and optimization solutions. The company's Customer Premises Equipment segment provides subscriber-based solutions that support broadband and video applications connecting cable, telecommunications, and satellite service providers. This segment offers devices that provide residential connectivity to service provider's network, such as digital subscriber line, cable modems, and telephony and data gateways that incorporate routing and Wi-Fi functionality. It also provides set top boxes that support cable, satellite, and IPTV content delivery, as well as digital video recorders, high definition set top boxes, and hybrid set top devices. Its Network & Cloud Segment offers cable modem termination systems, video infrastructure, distribution and transmission equipment, and cloud solutions that enable facility-based service providers to construct residential and metro distribution network. The company's Ruckus segment provides converged wired and wireless networks for enterprises and service providers. This segment offers indoor and outdoor Wi-Fi and LTE access points, access, and aggregation switches; IoT suite, and on-premises and cloud-based control and management systems; and software and software-as-a-service applications for security, location, reporting, and analytics. The company was formerly known as Cedar I Holding Company, Inc. CommScope Holding Company, Inc. was founded in 1976 and is headquartered in Hickory, North Carolina.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Hickory"}, "CMBM": {"short_name": "Cambium Networks Corporation", "long_name": "Cambium Networks Corporation", "summary": "Cambium Networks Corporation, through its subsidiaries, provides wireless broadband networking infrastructure products and solutions for network operators. Its wireless fabric includes intelligent radios, smart antennas, radio frequency (RF) algorithms, wireless-aware switches, and network management software. The company offers point-to-point solutions that are connected to high-speed, high-bandwidth wireline networks; and wireless broadband backhaul to facilities or point-to-multipoint access points deployed throughout a network over distances of approximately 100 kilometers and at 2 gigabytes per second. Its cnPilot and Xirrus Wi-Fi solution provides distributed access to individual users in indoor settings, such as office complexes, and outdoor settings, such as athletic stadiums; cnReach solutions offer narrow-band connectivity for sensors and devices; embedded proprietary RF technology and software enables automated optimization of data flow at the outermost points in the network; and cnMatrix cloud-managed wireless-aware switching solution provides the interface between wireless and wired networks. The company serves medium-sized wireless Internet service providers, enterprises, and government agencies in North America, Europe, the Middle East, Africa, Central and Latin America, and the Asia-Pacific. The company was formerly known as Vector Cambium Holdings (Cayman), Ltd. and changed its name to Cambium Networks Corporation in 2018. Cambium Networks Corporation was founded in 2011 and is headquartered in Rolling Meadows, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Rolling Meadows"}, "CMTL": {"short_name": "Comtech Telecommunications Corp", "long_name": "Comtech Telecommunications Corp.", "summary": "Comtech Telecommunications Corp. designs, develops, produces, and markets products, systems, and services for communications solutions in the United States and internationally. It operates in two segments, Commercial Solutions and Government Solutions. The Commercial Solutions segment offers satellite ground station technologies, including modems, amplifiers, frequency converters, and network software to modulate, demodulate, and amplify signals, as well as to carry voice, video, and/or data over networks; and public safety and location technologies covering 911 call routing solutions that allow cellular carriers and over the Internet carriers to deliver emergency calls to public safety emergency call centers. The Government Solutions segment provides mission-critical technologies comprising tactical satellite-based networks, such as satellite modems, ruggedized routers, and solid-state drives; very small aperture terminals; and sustainment services for the secret Internet Protocol router and non-classified Internet Protocol router access point. This segment also offers high-performance transmission technologies that are used in communication systems comprising electronic warfare, radar, and identification friend or foe (IFF); troposcatter technologies for satellite communication; and high-power amplifiers and related switching technologies that are used in electronic warfare, communications, radar, IFF, and medical applications, such as oncology cancer treatment systems. The company serves satellite systems integrators, wireless and other communication service providers, satellite broadcasters, prime contractors and system suppliers, medical equipment companies, aviation industry system integrators, oil companies, and domestic and international defense and government customers, as well as end-customers. Comtech Telecommunications Corp. was founded in 1967 and is headquartered in Melville, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Melville"}, "COMM": {"short_name": "CommScope Holding Company, Inc.", "long_name": "CommScope Holding Company, Inc.", "summary": "CommScope Holding Company, Inc. provides infrastructure solutions for communications and entertainment networks worldwide. The company's Connectivity segment offers fiber optic, copper cable, and connectivity solutions for use in data centers, business enterprises, telecommunications, cable television, and residential broadband networks. Its Mobility segment provides building blocks for cellular base station sites and related connectivity; indoor, small cell, and distributed antenna wireless systems; and wireless network backhaul planning and optimization solutions. The company's Customer Premises Equipment segment provides subscriber-based solutions that support broadband and video applications connecting cable, telecommunications, and satellite service providers. This segment offers devices that provide residential connectivity to service provider's network, such as digital subscriber line, cable modems, and telephony and data gateways that incorporate routing and Wi-Fi functionality. It also provides set top boxes that support cable, satellite, and IPTV content delivery, as well as digital video recorders, high definition set top boxes, and hybrid set top devices. Its Network & Cloud Segment offers cable modem termination systems, video infrastructure, distribution and transmission equipment, and cloud solutions that enable facility-based service providers to construct residential and metro distribution network. The company's Ruckus segment provides converged wired and wireless networks for enterprises and service providers. This segment offers indoor and outdoor Wi-Fi and LTE access points, access, and aggregation switches; IoT suite, and on-premises and cloud-based control and management systems; and software and software-as-a-service applications for security, location, reporting, and analytics. The company was formerly known as Cedar I Holding Company, Inc. CommScope Holding Company, Inc. was founded in 1976 and is headquartered in Hickory, North Carolina.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Hickory"}, "CRLI": {"short_name": "CIRCUIT RESEARCH LABORATORIES I", "long_name": "Circuit Research Labs, Inc.", "summary": "Circuit Research Labs, Inc. develops, manufactures, and markets electronic audio processing, transmission encoding, and noise reduction equipment for radio, television, cable, Internet, and professional audio markets worldwide. Its products are used to control the audio quality and range of radio, television, cable, and Internet audio reception, as well as allow radio and television stations to broadcast in mono and stereo. The company sells its products through a network of wholesale distributors and dealers. Circuit Research Labs, Inc. was founded in 1974 and is headquartered in Tempe, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tempe"}, "CRMK": {"short_name": "CERMETEK MICROELECTRONICS INC", "long_name": "Cermetek Microelectronics, Inc.", "summary": "Cermetek Microelectronics, Inc. designs, manufactures, and markets Internet appliance modems, modem components, and telephone line interfaces for the data communications industry. The company offers Internet connectivity devices, embedded device servers, high-speed modems, low-speed modems, modem modules, wireless data modules, embedded wireless devices, modules for wireless sensor networks, Internet protocol equipped modems, data access arrangements, and embedded Ethernet modules; and communications components for embedded communications. Its products are used in Internet appliance, embedded industrial, telecom, security/alarm, remote diagnostic and energy monitor, remote sensor, and conservation applications. The company sells its products to industrial OEMs through sales representatives and distributors in Australia/New Zealand, Mexico, France, Germany, Israel, Korea, Southeast Asia, Spain, Switzerland, Israel, North America, and Italy; and enables users to order online. Cermetek Microelectronics, Inc. was formerly known as Cermetek, Inc. The company was founded in 1968 and is based in Milpitas, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Milpitas"}, "CSCO": {"short_name": "Cisco Systems, Inc.", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "CSCO.BA": {"short_name": "CISCO SYSTEMS", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "ARS", "sector": "Technology", "industry": "Communication Equipment", "exchange": "BUE", "market": "ar_market", "country": "United States", "city": "San Jose"}, "CSCO.MX": {"short_name": "CISCO SYSTEMS INC", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "MXN", "sector": "Technology", "industry": "Communication Equipment", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "San Jose"}, "CSCO.SN": {"short_name": "CISCO SYSTEMS", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "SGO", "market": "cl_market", "country": "United States", "city": "San Jose"}, "CSCO.VI": {"short_name": "CISCO SYSTEMS INC", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "San Jose"}, "CSCO34.SA": {"short_name": "CISCO       DRN", "long_name": "Cisco Systems, Inc.", "summary": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products; and cloud and system management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with Internet2 to deliver next-generation capabilities and software solutions; and Tele2 Iot on connectivity management platform 2CONTROL. Cisco Systems, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "BRL", "sector": "Technology", "industry": "Communication Equipment", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "San Jose"}, "CYBD": {"short_name": "CYBER DIGITAL INCORPORATED", "long_name": "Cyber Digital, Inc.", "summary": "Cyber Digital, Inc., together with its subsidiaries, designs, develops, and manufactures digital voice switching infrastructure systems for public telephone network operators worldwide. It offers digital and wireless telephone exchanges, such as local, tandem, rural, and private branch exchanges; digital broadband systems, including high speed routers, Internet gateways, firewalls, and servers; digital broadband solutions comprising Internet service providers and digital divide; and digital voice solutions. Cyber Digital, Inc. was founded in 1982 and is based in Hauppauge, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Hauppauge"}, "DGII": {"short_name": "Digi International Inc.", "long_name": "Digi International Inc.", "summary": "Digi International Inc. provides business and mission-critical Internet of Things (IoT) products, services, and solutions in the United States and internationally. The company operates in two segments, IoT Products & Services and IoT Solutions. It offers cellular routers for mission-critical wireless connectivity; cellular modules to embed cellular communications abilities into the products to deploy and manage intelligent and secure cellular connected products; console servers to provide secure and remote access to network equipment in data centers and at edge locations; and radio frequency products, including embedded wireless modules, off-the-shelf gateways, modems, and adapters under the Digi XBee brand. The company also provides embedded system products under the Digi Connect, ConnectCore, and Rabbit brands; and infrastructure management products, comprising of serial servers, which offers serial port-to-Ethernet integration of devices into wired Ethernet networks; and universal serial bus solutions. In addition, it offers Digi Remote Manager, a recurring revenue cloud-based service that provides a secure environment for customers to manage their connected device deployment; Digi Wireless Design Services, which offers wireless networking product development, testing, and certification services for a range of wireless technology platforms and applications; and SmartSense by Digi for monitoring wirelessly the temperature of food and other perishable or sensitive goods, facilities or pharmacies by tracking the completion of operating tasks by employees, as well as quality control and incident management for food service, healthcare, and transportation/logistics industries. Further, the company provides professional services, such as site planning, implementation management, application development, and customer training; data plan subscriptions; and enhanced technical support services. The company was founded in 1985 and is headquartered in Hopkins, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Hopkins"}, "DZSI": {"short_name": "DZS Inc.", "long_name": "DZS Inc.", "summary": "DZS Inc. provides network access solutions and communications platforms for service provider and enterprise networks in the United States, Canada, Latin America, Europe, the Middle East, Africa, Korea, and other Asia Pacific Countries. It offers broadband access products, including customer premise equipment, such as digital subscriber line (DSL) modems; Ethernet access demarcation devices; and gigabit passive optical network (GPON) and 10G point-to-point active Ethernet optical network terminals. The company also provides central office products, such as broadband loop carriers for DSL and voice-grade telephone service; DSL access multiplexers (DSLAMs); optical line terminals for passive optical distribution networks like GPONs; and 10G passive optical networks and 10G point-to-point active Ethernet. In addition, it offers Ethernet switching products; mobile backhaul products comprising standard Ethernet/IP or multiprotocol label switching interfaces; software defined networks and network function virtualization tools and building blocks; and passive optical LAN products consisting of integrated power over Ethernet units, as well as broadband copper access based on very-high-bit-rate DSL and G. fast technology. The company was formerly known as DASAN Zhone Solutions, Inc. and changed its name to DZS Inc. in August 2020. The company was founded in 1996 and is based in Plano, Texas. DZS Inc. is a subsidiary of DASAN Networks, Inc.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Plano"}, "ELST": {"short_name": "ELECTRONIC SYSTEM TECHNOLOGY IN", "long_name": "Electronic Systems Technology, Inc.", "summary": "Electronic Systems Technology, Inc., doing business as ESTeem Wireless Modems, designs, develops, manufactures, and markets industrial wireless products and accessories in the United States and internationally. The company's ESTeem industrial wireless products provide communication links between computer networks, network enabled devices, and mobile devices without cables. It also offers data radio products for process automation in commercial, industrial, and government arenas, as well as various accessories, such as antennas, power supplies, and cable assemblies. In addition, the company provides repair and upgrade services; and professional services, such as site survey testing, system start-up, and custom engineering. Its products are used in various applications, including water/wastewater, oil/gas, mining, and industrial automation. The company markets its products through direct sales, sales representatives, and resellers. Electronic Systems Technology, Inc. was founded in 1982 and is based in Kennewick, Washington.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Kennewick"}, "ERFB": {"short_name": "ERF WIRELESS INC", "long_name": "ERF Wireless, Inc.", "summary": "ERF Wireless, Inc. provides wireless broadband access solutions for the energy industry in North America. The company conducts its operations through Energy Broadband, Inc., Wireless Bundled Services Division, and Enterprise Network Services segments. It offers wireless bandwidth and related support services, including nomadic terrestrial wireless broadband circuit connectivity to the wellsite; wellsite communications equipment rental; wellsite IT support services; wellsite IT services over broadband; network monitoring and maintenance:; layer 2 secure communications connectivity products rental and services; fixed site terrestrial wireless broadband connectivity; network design and construction; production field supervisory control and data acquisition; and midstream communications, monitoring, and security solutions for the oil and gas industry. The company also provides enterprise-level wireless bandwidth product and services, such as design and implementation of custom Internet wireless bandwidth solutions, including long-term maintenance and network monitoring; reselling arrangements; and secure connectivity services through its CryptoVue product to the regional banking, healthcare, and educational sectors primarily in the rural areas of North America. In addition, it offers commercial and residential wireless bandwidth products and services comprising -speed Internet, voice over Internet protocol services, network monitoring and maintenance services, and video services to commercial businesses and residential customers. The company was founded in 1986 and is headquartered in League City, Texas.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "League City"}, "ETCIA": {"short_name": "ELECTRONIC TELE-COM INC", "long_name": "Electronic Tele-Communications, Inc.", "summary": "Electronic Tele-Communications, Inc. designs, manufactures, markets, leases, and sells digital voice information systems and related services to the telecommunications industry and other businesses. Its equipment provides a range of audio and computer information, and call handling capabilities through telephone networks, computer networks, and the Internet. The company's digital voice information systems deliver network interoperability, as well as applications, including branding, time and temperature announcements, weather forecasts, automatic callback, changed number with call completion, repeat dialing, and wake-up/reminder services. It offers Digicept Emcee ELF3 and Digicept Emcee ELF that provide applications and services in a single platform for circuit and packet-switched networks; Audichron Z-10, a time-temperature-weather announcer; Audichron Z-10 MCA, a multi-channel announcer; digital announcement systems; and MAX Terminator, which offers disconnect detection to eliminate tied-up lines and annoying tones. The company also provides installation, repair, maintenance, and weather update services, as well as professional recording of announcements; and on-site training and technical support services. It serves regional bell operating companies, competitive local exchange carriers, independent telephone companies, long distance companies, wireless carriers, cable companies, utilities, telecommunications manufacturers, and other businesses and organizations. Electronic Tele-Communications, Inc. was incorporated in 1980 and is based in Waukesha, Wisconsin.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Waukesha"}, "EXM.F": {"short_name": "EXTREME NETWORKS  DL-,001", "long_name": "Extreme Networks, Inc.", "summary": "Extreme Networks, Inc. provides software-driven networking solutions for enterprise, data center, and service provider customers worldwide. It designs, develops, and manufactures wired and wireless network infrastructure equipment; and develops software for network management, policy, analytics, security, and access controls. The company offers ExtremeSwitching portfolio that includes access edge products that offer physical presentations along with options to deliver Ethernet or convergence-friendly Power-over-Ethernet (POE), including high-power universal POE; aggregation/core switches designed to address aggregation, top-of-rack, and campus core environments; and wireless access point products. It also provides ExtremeNAC, a network access control solution that allows the enterprises to unify the security of their wired and wireless networks with visibility and control over users, devices, and applications; and ExtremeAnalytics, a network-powered application analytics and optimization solution, which captures, aggregates, analyses, correlates, and reports network data that enables in decision making and enhancing business performance. In addition, the company offers ExtremeCloud, a wired and wireless cloud network management solution, which offers visibility and control over users, devices, and applications; ExtremeRouting, a cloud-managed access across distributed environment that provides throughput, application-aware traffic shaping and monitoring, end-to-end service, and link prioritization; and an open northbound API for customized integrations to key enterprise platforms. It markets and sells its products through distributors, resellers, and field sales organizations to enterprises and organizations in the education, healthcare, retail, manufacturing, hospitality, transportation and logistics, government agencies, private cloud data centers, universities, and stadiums. Extreme Networks, Inc. was founded in 1996 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "EXTR": {"short_name": "Extreme Networks, Inc.", "long_name": "Extreme Networks, Inc.", "summary": "Extreme Networks, Inc. provides software-driven networking solutions for enterprise, data center, and service provider customers worldwide. It designs, develops, and manufactures wired and wireless network infrastructure equipment; and develops software for network management, policy, analytics, security, and access controls. The company offers ExtremeSwitching portfolio that includes access edge products that offer physical presentations along with options to deliver Ethernet or convergence-friendly Power-over-Ethernet (POE), including high-power universal POE; aggregation/core switches designed to address aggregation, top-of-rack, and campus core environments; and wireless access point products. It also provides ExtremeNAC, a network access control solution that allows the enterprises to unify the security of their wired and wireless networks with visibility and control over users, devices, and applications; and ExtremeAnalytics, a network-powered application analytics and optimization solution, which captures, aggregates, analyses, correlates, and reports network data that enables in decision making and enhancing business performance. In addition, the company offers ExtremeCloud, a wired and wireless cloud network management solution, which offers visibility and control over users, devices, and applications; ExtremeRouting, a cloud-managed access across distributed environment that provides throughput, application-aware traffic shaping and monitoring, end-to-end service, and link prioritization; and an open northbound API for customized integrations to key enterprise platforms. It markets and sells its products through distributors, resellers, and field sales organizations to enterprises and organizations in the education, healthcare, retail, manufacturing, hospitality, transportation and logistics, government agencies, private cloud data centers, universities, and stadiums. Extreme Networks, Inc. was founded in 1996 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "EZEN": {"short_name": "EZENIA INC", "long_name": "Ezenia!, Inc.", "summary": "Ezenia!, Inc. provides real-time communication, conferencing, and collaboration solutions worldwide. It offers InfoWorkSpace, a real-time collaboration solution that provides organizations with the tools to communicate through various options, such as conferences and shared applications, which help in streamlining day-to-day operations. Its products have applications in healthcare, education, government, defense, and commercial environments. The company was formerly known as VideoServer, Inc. Ezenia!, Inc. was founded in 1991 and is headquartered in Weare, New Hampshire.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Weare"}, "FBCE": {"short_name": "FIBERCORE INC", "long_name": "FiberCore, Inc.", "summary": "FiberCore, Inc. develops, manufactures, and markets single-mode and multimode optical fiber, and optical fiber preforms for the telecommunications and data communications industry. The company's principal operating units are FiberCore Jena A.G. (FCJ), its wholly owned subsidiary in Germany; and Xtal FiberCore Brasil S.A. (Xtal), the company's 90% owned subsidiary in Campinas, Brazil. FCJ manufactures both multimode and single-mode fiber and preforms with an emphasis on the multimode market; Xtal manufactures both single-mode and multimode fiber, and single-mode preforms with an emphasis on the single-mode market. Through its subsidiary, FiberCore Systems, Inc., the company designs, installs, and maintains optical fiber networks, wide area networks, and non-fiber optic networks primarily in the Northeast U.S., for local area network applications, such as those used in hospitals, universities, government, and commercial buildings. The company markets its optical fiber products under the trademarks, InfoGlasÂ®, EconoGradeÂ®, and ValuGradeÂ®. Fibercore competes with Corning, Inc.; Furukawa/OFS; Alcatel; Draka; Samsung; and Sumitomo. FiberCore, Inc. was founded in 1987 and is based in Charlton, Massachusetts. On October 6, 2004 the voluntary petition of FiberCore, Inc. for reorganization under Chapter 11 was converted to liquidation under Chapter 7. The Company had filed for Chapter 11 on November 14, 2003.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Charlton"}, "FEIM": {"short_name": "Frequency Electronics, Inc.", "long_name": "Frequency Electronics, Inc.", "summary": "Frequency Electronics, Inc. designs, develops, manufactures, and sells precision time and frequency control products and components for microwave integrated circuit applications. It operates through two segments, FEI-NY and FEI-Zyfer. The FEI-NY segment offers precision time, frequency generation, and synchronization products and subsystems used in communication satellites, terrestrial cellular telephone, or other ground-based telecommunication stations; and other components and systems for the United States military. The FEI-Zyfer segment designs, develops, and manufactures products for precision navigation and timing primarily incorporating global positioning system technologies into radar systems, airborne SIGINT/COMINT platforms, information networks, test equipment, military command and control terminals, and satellite ground stations. The company's products are used in commercial, government satellite payload systems, secure communications, command, control, communication, computer, intelligence, security and reconnaissance, counter measures, UAVs, energy exploration, wireline and wireless networks, and electronic warfare applications for the United States government on land, sea, and air-borne platforms. It markets its products directly and through independent sales representative organizations located in the United States, Europe, and Asia. Frequency Electronics, Inc. was founded in 1961 and is headquartered in Mitchel Field, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "Mitchel Field"}, "FKWL": {"short_name": "FRANKLIN WIRELESS CORPORATION", "long_name": "Franklin Wireless Corp.", "summary": "Franklin Wireless Corp. provides intelligent wireless solutions. The company's products include mobile hotspots, routers, trackers, and other devices, which integrates hardware and software enabling machine-to-machine (M2M) applications and the Internet of Things (IoT). Its M2M and IoT solutions include embedded modules, and modems and gateways built to deliver connectivity supporting various spectrum of applications based on 5G/4G wireless technology. The company directly markets its products to wireless operators, as well as indirectly through strategic partners and distributors located primarily in the United States, Europe, the Middle East, Africa, and Asia. Franklin Wireless Corp. was founded in 1981 and is headquartered in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Diego"}, "FQH.F": {"short_name": "ITERIS INC. (NEW)  DL-,01", "long_name": "Iteris, Inc.", "summary": "Iteris, Inc. provides intelligent transportation systems technology solutions in Canada and Europe. It operates through Roadway Sensors and Transportation Systems segments. The Roadway Sensors segment offers sensors and systems for traffic intersection management, communication systems, and roadway traffic data collection applications. Its products include Vantage, VantageLive!, VantagePegasus, Vantage Next, VantageRadius, Vantage Vector, Velocity, SmartCycle, SmartCycle Bike Indicator, SmartSpan, VersiCam, PedTrax, and P-Series products. It also sells original equipment manufacturer products for the traffic intersection markets, such as traffic signal controllers and traffic signal equipment cabinets. The Transportation Systems segment offers engineering and consulting services, managed services, and traffic analytics solutions, as well as the development of transportation management and traveler information systems for the ITS industry; and planning, design, development, and implementation of software and hardware-based ITS systems that integrate sensors, video surveillance, computers, and advanced communications equipment; and distributes real-time information about traffic conditions. This segment offers iPeMS, a performance measurement and analytic solution; and commercial vehicle operations and vehicle safety compliance platforms under the ClearFleet, CVIEW Plus, Check-Point, UCRLink, and inspect names. The company serves smart transportation, municipalities, government agencies, other transportation infrastructure providers. Iteris, Inc. was incorporated in 1987 and is headquartered in Santa Ana, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Santa Ana"}, "GNRD": {"short_name": "GENERAL DATACOMM INDUSTRIES INC", "long_name": "General Datacomm Industries Inc.", "summary": "General Datacomm Industries Inc., through its subsidiaries, designs, develops, manufactures, and markets high-speed network access and transport equipment to provide audio, video, and data transmissions. It offers DSLware and universal xDSL access systems to extend the copper loop, SNMP-based network management systems, IP dynamic mini-routers, TDM over IP gateways, routers and switches, modem security products, remote control/backup products for railroad wayside devices, broadband ATM/MPLS/hybrid/WAN solutions, remote network maintenance products, transportation and wireless connection application products, and blade adapters. It engages in implementations for distributed control systems, and supervisory control and data acquisition networks; and connectivity and internetworking for the healthcare industry. It offers USDA RUS accepted products, including hybrid multiservice access solutions, IP transport and switching products, integrated access devices to consolidate bandwidth requirements, modems/AES encryption products for high speed remote access, and CSUs/DSUs for narrowband and broadband access. It develops and sells infrastructure solutions to carriers and service providers of various types, including RBOCs, PTTs, IXCs, ILECs, IOCs, ISPs, and CLECs; and provides network installation, maintenance plan, extended warranty, operations, enterprise security management, network outsourcing, factory direct repair, and factory direct customer training services. The company's products enable network access, bandwidth management, multiprotocol label switching, voice over IP, Ethernet, and power over Ethernet. It serves carriers and service providers, governments, business enterprises, and commercial end-users in North America, Latin America, and internationally through distributors and resellers in the United States, Canada, Chile, Vietnam, the Russian Federation, and Hong Kong. The company was founded in 1969 and is headquartered in Naugatuck, Connecticut.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Naugatuck"}, "GTXO": {"short_name": "GTX CORPORATION", "long_name": "GTX Corp", "summary": "GTX Corp, through its subsidiaries, designs, develops, manufactures, and sells various products and services in the personal location services marketplace in the United States and internationally. The company offers global positioning system (GPS), low energy blue tooth (BLE), and cellular location platform that enables subscribers to track in real time the whereabouts of people, pets, or high valued assets through a miniaturized transceiver module, wireless connectivity gateway, middleware, and viewing portal. The company's products include GPS SmartSole, a wearable orthotic insole GPS tracking, monitoring, and recovery solution for those at risk of wandering due to Alzheimer's, dementia, and autism; Take Along Tracker 4G, a miniature tracking and SOS device; Sole Protector for GPS Smartsole; Take Along Friends & the Invisabelt, a GPS cellular tracking and monitoring device for young children and toddlers; GPSS (ground personnel safety system), a real-real time GPS BLE and near field communications (NFC) monitoring system; and VeriTap, an NFC tag and middleware application to monitor logistics and assets in the supply chain. It also develops and owns LOCiMOBILE, a suite of mobile tracking applications that turn smartphones and tablets, such as iPhone, iPad, Google Android, and other GPS enabled handsets into a tracking and location based real-time tracking device, which can be viewed through its tracking portal or on any connected device with Internet access. In addition, the company offers Track My Work Force, which allows employers to track and monitor employees, drivers, sales representatives, and others using their smartphones, tablets, or wireless devices; and other applications. It serves the consumer, enterprise, and military markets. GTX Corp was founded in 2002 and is headquartered in Los Angeles, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "HDIH": {"short_name": "H D INTERNATIONAL HOLDINGS GROU", "long_name": "H-D International Holdings Group", "summary": "H-D International Holdings Group, through its subsidiary, MircoTrakGPS, Inc., designs, develops, manufactures, distributes, and services global positioning system technology and products for asset tracking and vehicle recovery markets. It also develops personal tracking systems for the consumer market through large retailers and catalog outlets. The company offers AutoTRAK, an advanced theft recovery system. The company was formerly known as The Tracking Corporation and changed its name to H-D International Holdings Group in January 2018. H-D International Holdings Group was founded in 2004 and is based in Dallas, Texas.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "HLIT": {"short_name": "Harmonic Inc.", "long_name": "Harmonic Inc.", "summary": "Harmonic Inc., together with its subsidiaries, provide video delivery software, products, system solutions, and services worldwide. Its products enable customers to create, prepare, and deliver a range of video and broadband services to consumer devices, including televisions, personal computers, laptops, tablets, and smart phones. The company operates in two segments, Video and Cable Access. The Video segment sells video processing, and production and playout solutions and services to cable operators, and satellite and telecommunications Pay-Tv service providers, as well as to broadcast and media, including streaming media companies. This segment's video processing solutions include network management and application software, and hardware products, such as appliances, broadcast and over-the-top encoders, contribution encoders, high-density transcoders, multiscreen delivery, decoders and descramblers, and video servers. This segment also provides video-optimized storage systems; and unified video playout and processing software-as-a-service solutions. The Cable Access segment offers cable edge solutions and related services, including CableOS software-based cable access solutions; and narrowcast services gateway products primarily to cable operators. The company also provides technical support and professional services, such as maintenance and support, consulting, implementation, program management, technical design and planning, building and site preparation, integration and equipment installation, end-to-end system testing, and training. Harmonic Inc. sells its products through its direct sales force, as well as through independent resellers and systems integrators. Harmonic Inc. was founded in 1988 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "HPE": {"short_name": "Hewlett Packard Enterprise Comp", "long_name": "Hewlett Packard Enterprise Company", "summary": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE BladeSystem, HPE Synergy, and HPE ProLiant; storage solutions; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE Modular Storage Arrays and HPE XP. It also offers HPE Apollo and Cray products; and HPE Superdome Flex, HPE Nonstop, HPE Integrity, HPE Moonshot, and HPE Edgeline products. Additionally, the company provides mobility and Internet of Things solutions under the Aruba brand, which include wired and wireless local area network products, such as Wi-Fi access points, switches, routers, and sensors; software products, such as cloud-based management, network management, network access control, analytics and assurance, and location services; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. In addition, it offers various investment solutions, which comprise leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Further, the company invests in communications and media solutions, Hewlett Packard labs, and various business incubation projects. It serves commercial and large enterprise groups, including business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in Houston, Texas.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Houston"}, "HPE.MX": {"short_name": "HEWLETT PACKARD ENTERPRISE CO", "long_name": "Hewlett Packard Enterprise Company", "summary": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE BladeSystem, HPE Synergy, and HPE ProLiant; storage solutions; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE Modular Storage Arrays and HPE XP. It also offers HPE Apollo and Cray products; and HPE Superdome Flex, HPE Nonstop, HPE Integrity, HPE Moonshot, and HPE Edgeline products. Additionally, the company provides mobility and Internet of Things solutions under the Aruba brand, which include wired and wireless local area network products, such as Wi-Fi access points, switches, routers, and sensors; software products, such as cloud-based management, network management, network access control, analytics and assurance, and location services; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. In addition, it offers various investment solutions, which comprise leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Further, the company invests in communications and media solutions, Hewlett Packard labs, and various business incubation projects. It serves commercial and large enterprise groups, including business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in Houston, Texas.", "currency": "MXN", "sector": "Technology", "industry": "Communication Equipment", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Houston"}, "HPE.VI": {"short_name": "HEWLETT PACKARD ENTERPRISE", "long_name": "Hewlett Packard Enterprise Company", "summary": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE BladeSystem, HPE Synergy, and HPE ProLiant; storage solutions; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE Modular Storage Arrays and HPE XP. It also offers HPE Apollo and Cray products; and HPE Superdome Flex, HPE Nonstop, HPE Integrity, HPE Moonshot, and HPE Edgeline products. Additionally, the company provides mobility and Internet of Things solutions under the Aruba brand, which include wired and wireless local area network products, such as Wi-Fi access points, switches, routers, and sensors; software products, such as cloud-based management, network management, network access control, analytics and assurance, and location services; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. In addition, it offers various investment solutions, which comprise leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Further, the company invests in communications and media solutions, Hewlett Packard labs, and various business incubation projects. It serves commercial and large enterprise groups, including business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in Houston, Texas.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Houston"}, "HPNN": {"short_name": "HOP-ON INC", "long_name": "Hop-On Inc.", "summary": "Hop-On Inc. develops and manufactures electronic products, distributed software, and telecommunications hardware and services in the United States and China. It offers consumer and commercial electronics. The company also focuses on offering products in the areas of Android and Chrome OS-based devices, smartphones, tablets, televisions, set-top boxes, eReaders, and mobile device applications. Hop-On Inc. was founded in 1993 and is headquartered in Temecula, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Temecula"}, "INFN": {"short_name": "Infinera Corporation", "long_name": "Infinera Corporation", "summary": "Infinera Corporation provides optical transport networking equipment, software, and services worldwide. The company's product portfolio includes Infinera Groove series of modular and sled-based platforms to support a variety of transport network applications; 7300 series, an SDN-ready coherent optical transport system; FlexILS open line system platform that connects various Infinera and third-party terminal equipment platforms over long-distance fiber optic cable providing switching, multiplexing, amplification, and management channels; and 7090 and 7100 series packet transport platforms. It also offers Infinera XTM series packet-optical transport platform that enables high performance metro networks with service-aware, application-specific capabilities; XTC series multi-terabit packet optical transport platforms that integrate digital OTN switching and optical WDM transmission; mTera series universal transport platform; and XT series for long-haul and subsea applications. In addition, the company Infinera Cloud Xpress Family designed to meet the varying needs of ICPs, communication service providers, internet exchange service providers, enterprises, and other large-scale data center operators; DRX series of routers; and 8600 series of SDN-ready Internet Protocol/MPLS routers. Further, it provides transcend software suite; Infinera CNOS, a hardware-independent network operating system; and a range of support services for all hardware and software products. The company also serves telecommunications service providers, internet content providers, cable providers, wholesale carriers, research and education institutions, large enterprises, and government entities. It markets and sells its products and related support services primarily through its direct sales force. The company was formerly known as Zepton Networks. Infinera Corporation was founded in 2000 and is headquartered in Sunnyvale, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Sunnyvale"}, "INFN.MX": {"short_name": "INFINERA CORP", "long_name": "Infinera Corporation", "summary": "Infinera Corporation provides optical transport networking equipment, software, and services worldwide. The company's product portfolio includes Infinera Groove series of modular and sled-based platforms to support a variety of transport network applications; 7300 series, an SDN-ready coherent optical transport system; FlexILS open line system platform that connects various Infinera and third-party terminal equipment platforms over long-distance fiber optic cable providing switching, multiplexing, amplification, and management channels; and 7090 and 7100 series packet transport platforms. It also offers Infinera XTM series packet-optical transport platform that enables high performance metro networks with service-aware, application-specific capabilities; XTC series multi-terabit packet optical transport platforms that integrate digital OTN switching and optical WDM transmission; mTera series universal transport platform; and XT series for long-haul and subsea applications. In addition, the company Infinera Cloud Xpress Family designed to meet the varying needs of ICPs, communication service providers, internet exchange service providers, enterprises, and other large-scale data center operators; DRX series of routers; and 8600 series of SDN-ready Internet Protocol/MPLS routers. Further, it provides transcend software suite; Infinera CNOS, a hardware-independent network operating system; and a range of support services for all hardware and software products. The company also serves telecommunications service providers, internet content providers, cable providers, wholesale carriers, research and education institutions, large enterprises, and government entities. It markets and sells its products and related support services primarily through its direct sales force. The company was formerly known as Zepton Networks. Infinera Corporation was founded in 2000 and is headquartered in Sunnyvale, California.", "currency": "MXN", "sector": "Technology", "industry": "Communication Equipment", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Sunnyvale"}, "INO.F": {"short_name": "INSEEGO CORP.  DL-,001", "long_name": "Inseego Corp.", "summary": "Inseego Corp. engages in the design and development of mobile, Internet of Things (IoT), and cloud solutions for large enterprise verticals, service providers, and small and medium-sized businesses worldwide. The company provides wireless 3G, 4G, and 5G hardware products for vertical markets, including private LTE/5G networks, First responders network authority/Firstnet, SD-WAN, telematics, remote monitoring and surveillance, and fixed wireless access and mobile broadband devices. Its products include 4G and 5G fixed wireless routers and gateways, and mobile hotspots, and wireless gateways and routers for IIoT applications, Gb speed 4G LTE hotspots and USB modems, integrated telematics, and mobile tracking hardware devices, which are supported by applications software and cloud services designed to enable customers to analyze data insights and configure/manage their hardware remotely. The company also sells software-as-a-service (SaaS), software, and services solutions in various mobile and industrial IoT vertical markets comprising fleet management, vehicle telematics, aviation telematics, usage-based insurance, stolen vehicle recovery, asset tracking, monitoring, business connectivity, and subscription management. Its SaaS delivery platforms include Ctrack platforms, which provide fleet, vehicle, aviation, asset, and other telematics applications; and Device Management Solutions, a hosted SaaS platform that helps organizations in managing the selection, deployment, and spend of their wireless assets by helping them to save money on personnel and telecom expenses. Inseego Corp. was founded in 1996 and is headquartered in San Diego, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Diego"}, "INSG": {"short_name": "Inseego Corp.", "long_name": "Inseego Corp.", "summary": "Inseego Corp. engages in the design and development of mobile, Internet of Things (IoT), and cloud solutions for large enterprise verticals, service providers, and small and medium-sized businesses worldwide. The company provides wireless 3G, 4G, and 5G hardware products for vertical markets, including private LTE/5G networks, First responders network authority/Firstnet, SD-WAN, telematics, remote monitoring and surveillance, and fixed wireless access and mobile broadband devices. Its products include 4G and 5G fixed wireless routers and gateways, and mobile hotspots, and wireless gateways and routers for IIoT applications, Gb speed 4G LTE hotspots and USB modems, integrated telematics, and mobile tracking hardware devices, which are supported by applications software and cloud services designed to enable customers to analyze data insights and configure/manage their hardware remotely. The company also sells software-as-a-service (SaaS), software, and services solutions in various mobile and industrial IoT vertical markets comprising fleet management, vehicle telematics, aviation telematics, usage-based insurance, stolen vehicle recovery, asset tracking, monitoring, business connectivity, and subscription management. Its SaaS delivery platforms include Ctrack platforms, which provide fleet, vehicle, aviation, asset, and other telematics applications; and Device Management Solutions, a hosted SaaS platform that helps organizations in managing the selection, deployment, and spend of their wireless assets by helping them to save money on personnel and telecom expenses. Inseego Corp. was founded in 1996 and is headquartered in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Diego"}, "ITI": {"short_name": "Iteris, Inc.", "long_name": "Iteris, Inc.", "summary": "Iteris, Inc. provides intelligent transportation systems technology solutions in Canada and Europe. It operates through Roadway Sensors and Transportation Systems segments. The Roadway Sensors segment offers sensors and systems for traffic intersection management, communication systems, and roadway traffic data collection applications. Its products include Vantage, VantageLive!, VantagePegasus, Vantage Next, VantageRadius, Vantage Vector, Velocity, SmartCycle, SmartCycle Bike Indicator, SmartSpan, VersiCam, PedTrax, and P-Series products. It also sells original equipment manufacturer products for the traffic intersection markets, such as traffic signal controllers and traffic signal equipment cabinets. The Transportation Systems segment offers engineering and consulting services, managed services, and traffic analytics solutions, as well as the development of transportation management and traveler information systems for the ITS industry; and planning, design, development, and implementation of software and hardware-based ITS systems that integrate sensors, video surveillance, computers, and advanced communications equipment; and distributes real-time information about traffic conditions. This segment offers iPeMS, a performance measurement and analytic solution; and commercial vehicle operations and vehicle safety compliance platforms under the ClearFleet, CVIEW Plus, Check-Point, UCRLink, and inspect names. The company serves smart transportation, municipalities, government agencies, other transportation infrastructure providers. Iteris, Inc. was incorporated in 1987 and is headquartered in Santa Ana, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Ana"}, "IZNN": {"short_name": "IZON NETWORK INC", "long_name": "IZON Network, Inc.", "summary": "IZON Network, Inc., a golf-centric technology and information-dissemination company, creates a golf technology platform in Canada and the United States. The company connects golfers to advertisers by installing multifunctional Web-enabled interactive tablets in golf cars that operate on and are owned by golf courses across the United States. Its Internet-connected interactive tablets provides a host of services to golfers and golf courses, such as GPS-based hole/course information, aerial views of fairways and green, accurate yardage information to hazards and greens, messaging, online scoring, and beverage cart ordering. The company also offers a portfolio of course management tools designed to enable course managers to improve player pace of play through GPS-based cart tracking and communications, increased merchandise, and concession sales through real-time on-tablet promotions, as well as access to additional revenue streams, such as sale of local advertising. In addition, it provides online marketing services. The company was formerly known as Digital Caddies, Inc. and changed its name to IZON Network, Inc. in September 2017. IZON Network, Inc. was incorporated in 2011 and is headquartered in Scottsdale, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Scottsdale"}, "JCS": {"short_name": "Communications Systems, Inc.", "long_name": "Communications Systems, Inc.", "summary": "Communications Systems, Inc., through its subsidiaries, manufactures and sells connectivity infrastructure products and services for broadband networks in North America, Europe, the Middle East, Africa, and internationally. It operates through three segments: Transition Networks, JDL Technologies, and Net2Edge. The Transition Networks segment manufactures and sells Power over Ethernet switches, media converters, network interface cards, Ethernet switches, small form factor pluggable modules, and other connectivity and data transmission products. This segment sells its products through distributors, resellers, integrators, and original equipment manufacturers to the federal government, enterprise, service provider, industrial, security, and surveillance markets. The JDL Technologies segment offers information technology managed services, such as network design, deployment, and integration; cloud, hosted, and virtualization services; and remote support and management services to commercial, education, and healthcare markets. Its Net2Edge segment manufactures and markets Ethernet based network access devices. This segment serves government, enterprise, utility, industrial, and surveillance markets, as well as service providers through direct sales model, and approved partners and integrators. Communications Systems, Inc. was founded in 1969 and is headquartered in Minnetonka, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Minnetonka"}, "JNP.DE": {"short_name": "JUNIPER NETWORKS  DL-,01", "long_name": "Juniper Networks, Inc.", "summary": "Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; cloud customer premises equipment; and NorthStar controllers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and mist access points, which provide wireless access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated firewall and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking and cloud platform, which provides an open-source and standards-based platform for SDN and NFV; Contrail Insights, an optimization and management software platform for public, private, and hybrid clouds; and Marvis Actions and AI-driven Virtual Network Assistant, which identifies the root cause of issues across the information technology, domains and automatically resolves issues. Additionally, the company provides technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturer partners to end-users in the cloud, service provider, and enterprise markets. The company was founded in 1996 and is headquartered in Sunnyvale, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Sunnyvale"}, "JNP.F": {"short_name": "JUNIPER NETWORKS  DL-,01", "long_name": "Juniper Networks, Inc.", "summary": "Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; cloud customer premises equipment; and NorthStar controllers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and mist access points, which provide wireless access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated firewall and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking and cloud platform, which provides an open-source and standards-based platform for SDN and NFV; Contrail Insights, an optimization and management software platform for public, private, and hybrid clouds; and Marvis Actions and AI-driven Virtual Network Assistant, which identifies the root cause of issues across the information technology, domains and automatically resolves issues. Additionally, the company provides technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturer partners to end-users in the cloud, service provider, and enterprise markets. The company was founded in 1996 and is headquartered in Sunnyvale, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Sunnyvale"}, "JNPR": {"short_name": "Juniper Networks, Inc.", "long_name": "Juniper Networks, Inc.", "summary": "Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; cloud customer premises equipment; and NorthStar controllers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and mist access points, which provide wireless access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated firewall and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking and cloud platform, which provides an open-source and standards-based platform for SDN and NFV; Contrail Insights, an optimization and management software platform for public, private, and hybrid clouds; and Marvis Actions and AI-driven Virtual Network Assistant, which identifies the root cause of issues across the information technology, domains and automatically resolves issues. Additionally, the company provides technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturer partners to end-users in the cloud, service provider, and enterprise markets. The company was founded in 1996 and is headquartered in Sunnyvale, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Sunnyvale"}, "JUMT": {"short_name": "JUMA TECHNOLOGY CORPORATION", "long_name": "Juma Technology Corp.", "summary": "Juma Technology Corp., through its subsidiary, Nectar Services Corp., provides a suite of software services for the management, monitoring, and call routing of an entity's voice and data systems. The company offers Converged Management Platform, an intelligent distributed platform that converges the monitoring of voice and data equipment, and the remote management of the various layers of a client's network and systems infrastructure to provide a view of the health and status of an entire network. Its Converged Management Platform is provided as a service to managed service providers in enabling them to monitor and manage their end-clients' facilities, as well as sold by managed service providers or channel partners directly to IT buyers within businesses and enterprises. The company also provides Enterprise Session Management, a managed services software solution that enables carrier class routing and session management functionality for enterprise or business customers. In addition, it offers a hosted telephony service that allows small to medium sized businesses to gain the features and functionality larger firms without purchasing a corporate private branch exchange. The company provides its software services for voice and data networks through a sales channel program of voice over Internet protocol and data integration firms. Juma Technology Corp. is headquartered in Farmingdale, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Farmingdale"}, "KN": {"short_name": "Knowles Corporation", "long_name": "Knowles Corporation", "summary": "Knowles Corporation designs, manufactures, and sells micro-acoustic, audio processing, and precision device solutions for the mobile consumer electronics, communications, medtech, defense, automotive, and industrial markets worldwide. It operates in two segments, Audio and Precision Devices (PD). The Audio segment designs and manufactures audio products, including microphones and balanced armature speakers, audio processors, and software and algorithms used in applications that serve the mobile, ear, and Internet of Things markets. The PD segment designs and delivers capacitor products and radio frequency solutions that are used in applications, such as power supplies and medical implants, satellite communication, and radar systems, as well as our telecommunications infrastructure customers. The company also provides single layer electronic components to the telecommunication, fiber optics, and defense markets. It sells its products directly to original equipment manufacturers and to their contract manufacturers and suppliers, as well as through distributors. The company was founded in 1946 and is headquartered in Itasca, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Itasca"}, "KVHI": {"short_name": "KVH Industries, Inc.", "long_name": "KVH Industries, Inc.", "summary": "KVH Industries, Inc. designs, develops, manufactures, and markets mobile connectivity products and services for the marine and land mobile markets in the United States and internationally. The company operates through Mobile Connectivity and Inertial Navigation segments. The company offers mobile satellite TV and communications products; two-way satellite communications systems; onboard TracPhone terminals and hub equipment; data management software for maritime communications; and Iridium OpenPort hardware products and services. It also offers airtime plans that enable customers to obtain Internet and voice services; and value-added, and news and radio content services to retail customers. In addition, the company provides navigation, guidance, and stabilization products for the commercial and defense markets comprising precision fiber optic gyro-based systems that enable platform and optical stabilization, navigation, pointing, and guidance; tactical navigation systems for tactical trucks and light armored vehicles; and commercial products, such as navigation and positioning systems for various applications consisting of precision mapping, dynamic surveying, autonomous vehicles, train location control and track geometry measurement systems, industrial robotics, and optical stabilization applications. Further, it offers content, maritime news, sporting content, and television programming delivery services; movie distribution services; and services and support for the mini-VSAT Broadband solution, as well as IoT connectivity service. The company sells its mobile communications products through a network of independent retailers, chain stores, distributors, and service providers; and navigation products directly to the United States and foreign governments, and government contractors, as well as through authorized independent sales representatives. The company also sells and leases its products directly to end users. KVH Industries, Inc. was founded in 1978 and is headquartered in Middletown, Rhode Island.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Middletown"}, "LA8N.F": {"short_name": "LANTRONIX NEW  DL-,0001", "long_name": "Lantronix, Inc.", "summary": "Lantronix, Inc. provides software as a service (SaaS), engineering services, and hardware for edge computing, the Internet of Things (IoT), and remote environment management (REM) in the Americas, Europe, the Middle East, Africa, and the Asia Pacific Japan. The company's IoT products include IoT Connectivity, which provide wired and wireless connections that enhance the value and utility of modern electronic systems and equipment through secure network connectivity, application hosting, protocol conversion, secure access for distributed IoT deployments, and various other functions; IoT Compute that include application processing delivering compute to meet customer needs for data transformation, computer vision, machine learning, augmented/virtual reality, audio/video aggregation and distribution, and custom applications; and IoT Telematics, which provides power efficient products designed to support communications across interfaces and industrial protocols for vehicle, fleet, and asset tracking and management. It also offers system on module, single board computer, and development kits; and services for mechanical, hardware, and software engineering for camera, audio, and artificial intelligence/machine learning development, as well as xPrintServer. In addition, the company's REM products include out-of-band management, console management, power management, and IP connected keyboard-video-mouse products that provide remote access to IT and networking infrastructure deployed in test labs, data centers, branch offices, remote sites, and server rooms. Further, its SaaS platform enables customers to deploy, monitor, manage, and automate across their global deployments through a single platform login. The company offers its products through value added resellers, systems integrators, distributors, online retailers, and original equipment manufacturers; and an e-commerce site for direct sales. Lantronix, Inc. was founded in 1989 and is headquartered in Irvine, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Irvine"}, "LBAS": {"short_name": "LOCATION BASED TECHNOLOGIES INC", "long_name": "Location Based Technologies, Inc.", "summary": "Location Based Technologies, Inc. designs, develops, and sells commercial and consumer wearable global positioning system (GPS) tracking solutions based on worldwide GSM network. It offers consumer products under the PocketFinder brand, including PocketFinder, PocketFinder luggage, PocketFinder Pet, and PocketFinder Vehicle that displays information to users regarding device location, longitude, latitude, altitude, heading or direction, speed, and 60 days of location history; and set alerts that will trigger an email, text, or push notification to notify them when their device exceeds a pre-determined parameter, such as speed, battery life, or entry/exit of a geo-zone. The company's PocketFinder Personal/Pet or luggage devices include small devices that are ideal for tracking or locating any mobile asset, person, pet, or valuable item; and PocketFinder Vehicle tracker is to be hardwired to any powered asset, such as vehicle, watercraft, or mobile generator to locate and track a mobile assets. It also provides commercial products under the LBT brand, including LBT-886 and LBT Vehicle Tracker. The company's LBT-886 comprises location device that enables a user to locate and track any person or mobile asset; and LBT Vehicle Tracker provides tracking features with capabilities, such as temperature, light and humidity monitoring, engine on/off monitoring, and starter interrupt engine capability or lone worker emergency alerts. It markets and sells its commercial products to small/midsize businesses, enterprise businesses, and governmental organizations that need to track vehicles, mobile equipment, portable assets, and workers through online retailers, as well as through its pocketfinder.com Website. The company is based in Irvine, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Irvine"}, "LITE": {"short_name": "Lumentum Holdings Inc.", "long_name": "Lumentum Holdings Inc.", "summary": "Lumentum Holdings Inc. manufactures and sells optical and photonic products in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. The company operates in two segments, Optical Communications (OpComms) and Commercial Lasers (Lasers). The OpComms segment offers components, modules, and subsystems that enable the transmission and transport of video, audio, and data over high-capacity fiber optic cables. It offers tunable transponders, transceivers, and transmitter modules; tunable lasers, receivers, and modulators; transport products, such as reconfigurable optical add/drop multiplexers, amplifiers, and optical channel monitors, as well as components, including 980nm, multi-mode, and Raman pumps; and switches, attenuators, photodetectors, gain flattening filters, isolators, wavelength-division multiplexing filters, arrayed waveguide gratings, multiplex/de-multiplexers, and integrated passive modules. This segment also provides Super Transport Blade, which integrates optical transport functions into a single-slot blade; vertical-cavity surface-emitting lasers; directly modulated and electro-absorption modulated lasers; and laser illumination sources for 3D sensing systems. It serves customers in telecommunications, data communications, and consumer and industrial markets. The Commercial Lasers segment offers diode-pumped solid-state, fiber, diode, direct-diode, and gas lasers for use in original equipment manufacturer applications. It serves customers in markets and applications, such as sheet metal processing, general manufacturing, biotechnology, graphics and imaging, and remote sensing, as well as in precision machining, such as drilling in printed circuit boards, wafer singulation, glass cutting, and solar cell scribing. Lumentum Holdings Inc. was incorporated in 2015 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "LITE.MX": {"short_name": "LUMENTUM HLDGS INC", "long_name": "Lumentum Holdings Inc.", "summary": "Lumentum Holdings Inc. manufactures and sells optical and photonic products in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. The company operates in two segments, Optical Communications (OpComms) and Commercial Lasers (Lasers). The OpComms segment offers components, modules, and subsystems that enable the transmission and transport of video, audio, and data over high-capacity fiber optic cables. It offers tunable transponders, transceivers, and transmitter modules; tunable lasers, receivers, and modulators; transport products, such as reconfigurable optical add/drop multiplexers, amplifiers, and optical channel monitors, as well as components, including 980nm, multi-mode, and Raman pumps; and switches, attenuators, photodetectors, gain flattening filters, isolators, wavelength-division multiplexing filters, arrayed waveguide gratings, multiplex/de-multiplexers, and integrated passive modules. This segment also provides Super Transport Blade, which integrates optical transport functions into a single-slot blade; vertical-cavity surface-emitting lasers; directly modulated and electro-absorption modulated lasers; and laser illumination sources for 3D sensing systems. It serves customers in telecommunications, data communications, and consumer and industrial markets. The Commercial Lasers segment offers diode-pumped solid-state, fiber, diode, direct-diode, and gas lasers for use in original equipment manufacturer applications. It serves customers in markets and applications, such as sheet metal processing, general manufacturing, biotechnology, graphics and imaging, and remote sensing, as well as in precision machining, such as drilling in printed circuit boards, wafer singulation, glass cutting, and solar cell scribing. Lumentum Holdings Inc. was incorporated in 2015 and is headquartered in San Jose, California.", "currency": "MXN", "sector": "Technology", "industry": "Communication Equipment", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "San Jose"}, "LMSC": {"short_name": "LIVE MICROSYSTEMS INC", "long_name": "Live Microsystems, Inc.", "summary": "Live Microsystems, Inc. does not have significant operations. Previously, it operated as a mobile Internet provider of digital entertainment solutions for network operators, consumer device manufacturers, and brands and media companies in the mobile market. The company was formerly known as Livewire Mobile, Inc. and changed its name to Live Microsystems, Inc. in August 2013. Live Microsystems, Inc. was founded in 1983 and is based in Radnor, Pennsylvania.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Radnor"}, "LTRX": {"short_name": "Lantronix, Inc.", "long_name": "Lantronix, Inc.", "summary": "Lantronix, Inc. provides software as a service (SaaS), engineering services, and hardware for edge computing, the Internet of Things (IoT), and remote environment management (REM) in the Americas, Europe, the Middle East, Africa, and the Asia Pacific Japan. The company's IoT products include IoT Connectivity, which provide wired and wireless connections that enhance the value and utility of modern electronic systems and equipment through secure network connectivity, application hosting, protocol conversion, secure access for distributed IoT deployments, and various other functions; IoT Compute that include application processing delivering compute to meet customer needs for data transformation, computer vision, machine learning, augmented/virtual reality, audio/video aggregation and distribution, and custom applications; and IoT Telematics, which provides power efficient products designed to support communications across interfaces and industrial protocols for vehicle, fleet, and asset tracking and management. It also offers system on module, single board computer, and development kits; and services for mechanical, hardware, and software engineering for camera, audio, and artificial intelligence/machine learning development, as well as xPrintServer. In addition, the company's REM products include out-of-band management, console management, power management, and IP connected keyboard-video-mouse products that provide remote access to IT and networking infrastructure deployed in test labs, data centers, branch offices, remote sites, and server rooms. Further, its SaaS platform enables customers to deploy, monitor, manage, and automate across their global deployments through a single platform login. The company offers its products through value added resellers, systems integrators, distributors, online retailers, and original equipment manufacturers; and an e-commerce site for direct sales. Lantronix, Inc. was founded in 1989 and is headquartered in Irvine, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Irvine"}, "LTTC": {"short_name": "LATTICE INCORPORATED", "long_name": "Lattice Incorporated", "summary": "Lattice Incorporated provides telecommunications services to correctional facilities in the United States. It also provides technology and engineering services to other service providers in the corrections market. The company's products and services include Corrections Operating Platform, a suite of hardware and software solutions designed to deliver benefits to corrections facilities; Nexus inmate telephone system; CellMate, a mobile inmate communications device; and Netvisit, a video visitation solution to reduce corrections staff burden. It also offers NetVisit, a video arraignment technology that enables inmates to remain at the jail facility while a Judge conducts the arraignment over a real-time video connection; and account deposit platform that provides inmates and their families and friends with various phone account types. The company was formerly known as Science Dynamics Corporation and changed its name to Lattice Incorporated in February 2007. Lattice Incorporated was founded in 1973 and is based in Pennsauken, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Pennsauken"}, "LU2.F": {"short_name": "LUMENTUM HLDGS IN.DL-,001", "long_name": "Lumentum Holdings Inc.", "summary": "Lumentum Holdings Inc. manufactures and sells optical and photonic products in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. The company operates in two segments, Optical Communications (OpComms) and Commercial Lasers (Lasers). The OpComms segment offers components, modules, and subsystems that enable the transmission and transport of video, audio, and data over high-capacity fiber optic cables. It offers tunable transponders, transceivers, and transmitter modules; tunable lasers, receivers, and modulators; transport products, such as reconfigurable optical add/drop multiplexers, amplifiers, and optical channel monitors, as well as components, including 980nm, multi-mode, and Raman pumps; and switches, attenuators, photodetectors, gain flattening filters, isolators, wavelength-division multiplexing filters, arrayed waveguide gratings, multiplex/de-multiplexers, and integrated passive modules. This segment also provides Super Transport Blade, which integrates optical transport functions into a single-slot blade; vertical-cavity surface-emitting lasers; directly modulated and electro-absorption modulated lasers; and laser illumination sources for 3D sensing systems. It serves customers in telecommunications, data communications, and consumer and industrial markets. The Commercial Lasers segment offers diode-pumped solid-state, fiber, diode, direct-diode, and gas lasers for use in original equipment manufacturer applications. It serves customers in markets and applications, such as sheet metal processing, general manufacturing, biotechnology, graphics and imaging, and remote sensing, as well as in precision machining, such as drilling in printed circuit boards, wafer singulation, glass cutting, and solar cell scribing. Lumentum Holdings Inc. was incorporated in 2015 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "MAXR": {"short_name": "Maxar Technologies Inc.", "long_name": "Maxar Technologies Inc.", "summary": "Maxar Technologies Inc. provides earth intelligence and space infrastructure solutions in the United States, Asia, South America, Europe, the Middle East, Australia, Canada, and internationally. It operates through Earth Intelligence and Space Infrastructure segments. The Earth Intelligence segment offers Earth imagery and radar data solutions, including orthorectified imagery, mosaic, elevation, and information products; and SecureWatch, a subscription offering that provides online access to imagery and geospatial intelligence platform, as well as geospatial information, applications, and analytic services. This segment serves to the U.S., Canadian, and other international government agencies, such as defense and intelligence, and civil agencies, as well as commercial customers in various markets. The Space Infrastructure segment provides space and ground based infrastructure, robotics, components, and information solutions, including communication and imaging satellites and payloads; space platforms for power, propulsion, and communication; satellite ground systems and support services; space-based and airborne remote sensory solutions; space robotics; and defense systems. This segment serves government agencies and commercial satellite operators. Maxar Technologies Inc. was founded in 1969 and is headquartered in Westminster, Colorado.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Westminster"}, "MAXR.TO": {"short_name": "MAXAR TECHNOLOGIES INC", "long_name": "Maxar Technologies Inc.", "summary": "Maxar Technologies Inc. provides earth intelligence and space infrastructure solutions in the United States, Asia, South America, Europe, the Middle East, Australia, Canada, and internationally. It operates through Earth Intelligence and Space Infrastructure segments. The Earth Intelligence segment offers Earth imagery and radar data solutions, including orthorectified imagery, mosaic, elevation, and information products; and SecureWatch, a subscription offering that provides online access to imagery and geospatial intelligence platform, as well as geospatial information, applications, and analytic services. This segment serves to the U.S., Canadian, and other international government agencies, such as defense and intelligence, and civil agencies, as well as commercial customers in various markets. The Space Infrastructure segment provides space and ground based infrastructure, robotics, components, and information solutions, including communication and imaging satellites and payloads; space platforms for power, propulsion, and communication; satellite ground systems and support services; space-based and airborne remote sensory solutions; space robotics; and defense systems. This segment serves government agencies and commercial satellite operators. Maxar Technologies Inc. was founded in 1969 and is headquartered in Westminster, Colorado.", "currency": "CAD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TOR", "market": "ca_market", "country": "United States", "city": "Westminster"}, "MFCO": {"short_name": "MICROWAVE FILTER CO INC", "long_name": "Microwave Filter Company, Inc.", "summary": "Microwave Filter Company, Inc. designs, develops, manufactures, and sells electronic filters for radio and microwave frequencies primarily in the United States. It manufactures RF filters and related components for eliminating interference and facilitating signal processing for cable television, broadcast, commercial and military communications, avionics, radar, navigation, and defense markets. The company also designs waveguide, stripline/microstrip, transmission line, miniature/subminiature, and lumped constant filters. Its configurations include bandpass, highpass, lowpass, bandstop, multiplexers, tunable notch, tunable bandpass, high power filters, amplitude equalized, delay equalized, and filter networks. Microwave Filter Company, Inc. was founded in 1967 and is based in East Syracuse, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "East Syracuse"}, "MINM": {"short_name": "ZOOM TELEPHONICS INC", "long_name": "Zoom Telephonics, Inc.", "summary": "Zoom Telephonics, Inc., together with its subsidiary, designs, produces, markets, sells, and supports Internet access and other communications-related products in North America and internationally. It provides cable modems and gateways, multimedia over coax adapters, digital subscriber line modems, mobile broadband modems and routers, dial-up modems, local area network products, mobile broadband sensors, wireless and wired networking equipment, phone jacks and AC power adapters, and language-related specifics. The company sells its products through retailers and distributors, Internet and telephone service providers, value-added resellers, PC system integrators, and original equipment manufacturers, as well as through a direct sales force and independent sales agents. ZoomTelephonics, Inc. was founded in 1977 and is headquartered in Boston, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boston"}, "MKRO": {"short_name": "MONKEY ROCK GROUP INC", "long_name": "Monkey Rock Group, Inc.", "summary": "Monkey Rock Group, Inc. focuses on the research, design, development, and mining production of gold, platinum, silver, and copper metals. The company was formerly known as Monkey Rock USA, LLC and changed its name to Monkey Rock Group, Inc. in February 2010. The company was incorporated in 1997 and is based in Yuma, Arizona. Monkey Rock Group, Inc. is a subsidiary of Train Travel Holdings, Inc.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Yuma"}, "MOSI.VI": {"short_name": "MOTOROLA SOLUTIONS INC", "long_name": "Motorola Solutions, Inc.", "summary": "Motorola Solutions, Inc. provides mission-critical communication solutions in the United States, the United Kingdom, Canada, and internationally. The company operates in two segments, Products and Systems Integration, and Services and Software. The Products and Systems Integration segment offers a portfolio of infrastructure, devices, accessories, and video solutions, as well as the implementation, optimization, and integration of networks, devices, software, and applications for government, public safety and first-responder agencies, municipalities, and commercial and industrial customers. Its products include two-way portable and vehicle-mounted radios, accessories, software features, and upgrades; video cameras; radio network core and central processing software, base stations, consoles, and repeaters; and video analytics, network video management hardware and software, and access control solutions. The Services segment provides repair, technical support, and hardware maintenance services. This segment also offers monitoring, software updates, and cybersecurity services; and public safety and enterprise command center software suite, unified communications applications, and video software solutions. It serves for government, public safety, and commercial communication networks. The company was formerly known as Motorola, Inc. and changed its name to Motorola Solutions, Inc. in January 2011. Motorola Solutions, Inc. was founded in 1928 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "VIE", "market": "at_market", "country": "United States", "city": "Chicago"}, "MPEG": {"short_name": "INNOVACOM INC", "long_name": "Innovacom Inc.", "summary": "This record represents the public shell of InnovaCom, Inc. InnovaCom, Inc. provided equipment, and services that utilized the Motion Picture Expert Group first, and second generation standard for video and audio compression known as MPEG-1, and MPEG-2. The company had developed two lines of products TransPEG, and DVDImpact. Its TransPEG system allowed delivery of digital audio, and video content over broadband communication networks for applications such as video broadcasting, distant learning, video calls, videoconferences, and other video networking solutions. Its DVDImpact was a DVD pre-mastering system using its latest MPEG-2 compression technology. The company marketed its system-based TransPEG, and DVDImpact line of products to the professional video industry. InnovaCom is based in Santa Clara, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "MSI": {"short_name": "Motorola Solutions, Inc.", "long_name": "Motorola Solutions, Inc.", "summary": "Motorola Solutions, Inc. provides mission-critical communication solutions in the United States, the United Kingdom, Canada, and internationally. The company operates in two segments, Products and Systems Integration, and Services and Software. The Products and Systems Integration segment offers a portfolio of infrastructure, devices, accessories, and video solutions, as well as the implementation, optimization, and integration of networks, devices, software, and applications for government, public safety and first-responder agencies, municipalities, and commercial and industrial customers. Its products include two-way portable and vehicle-mounted radios, accessories, software features, and upgrades; video cameras; radio network core and central processing software, base stations, consoles, and repeaters; and video analytics, network video management hardware and software, and access control solutions. The Services segment provides repair, technical support, and hardware maintenance services. This segment also offers monitoring, software updates, and cybersecurity services; and public safety and enterprise command center software suite, unified communications applications, and video software solutions. It serves for government, public safety, and commercial communication networks. The company was formerly known as Motorola, Inc. and changed its name to Motorola Solutions, Inc. in January 2011. Motorola Solutions, Inc. was founded in 1928 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Chicago"}, "MTLA.DE": {"short_name": "MOTOROLA SOLUTIONS DL-,01", "long_name": "Motorola Solutions, Inc.", "summary": "Motorola Solutions, Inc. provides mission-critical communication solutions in the United States, the United Kingdom, Canada, and internationally. The company operates in two segments, Products and Systems Integration, and Services and Software. The Products and Systems Integration segment offers a portfolio of infrastructure, devices, accessories, and video solutions, as well as the implementation, optimization, and integration of networks, devices, software, and applications for government, public safety and first-responder agencies, municipalities, and commercial and industrial customers. Its products include two-way portable and vehicle-mounted radios, accessories, software features, and upgrades; video cameras; radio network core and central processing software, base stations, consoles, and repeaters; and video analytics, network video management hardware and software, and access control solutions. The Services segment provides repair, technical support, and hardware maintenance services. This segment also offers monitoring, software updates, and cybersecurity services; and public safety and enterprise command center software suite, unified communications applications, and video software solutions. It serves for government, public safety, and commercial communication networks. The company was formerly known as Motorola, Inc. and changed its name to Motorola Solutions, Inc. in January 2011. Motorola Solutions, Inc. was founded in 1928 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "GER", "market": "de_market", "country": "United States", "city": "Chicago"}, "MTLA.F": {"short_name": "MOTOROLA SOLUTIONS DL-,01", "long_name": "Motorola Solutions, Inc.", "summary": "Motorola Solutions, Inc. provides mission-critical communication solutions in the United States, the United Kingdom, Canada, and internationally. The company operates in two segments, Products and Systems Integration, and Services and Software. The Products and Systems Integration segment offers a portfolio of infrastructure, devices, accessories, and video solutions, as well as the implementation, optimization, and integration of networks, devices, software, and applications for government, public safety and first-responder agencies, municipalities, and commercial and industrial customers. Its products include two-way portable and vehicle-mounted radios, accessories, software features, and upgrades; video cameras; radio network core and central processing software, base stations, consoles, and repeaters; and video analytics, network video management hardware and software, and access control solutions. The Services segment provides repair, technical support, and hardware maintenance services. This segment also offers monitoring, software updates, and cybersecurity services; and public safety and enterprise command center software suite, unified communications applications, and video software solutions. It serves for government, public safety, and commercial communication networks. The company was formerly known as Motorola, Inc. and changed its name to Motorola Solutions, Inc. in January 2011. Motorola Solutions, Inc. was founded in 1928 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Chicago"}, "NGJ.F": {"short_name": "NETGEAR INC.  DL-,001", "long_name": "NETGEAR, Inc.", "summary": "NETGEAR, Inc. designs, develops, and markets networking and Internet connected products for consumers, businesses, and service providers. It operates in two segments, Connected Home, and Small and Medium Business. The company offers smart home/connected home/broadband access products, such as broadband modems, WiFi gateways, WiFi hotspots, WiFi routers and home WiFi systems, WiFi range extenders, Powerline adapters and bridges, WiFi network adapters, and digital canvasses; and value added service offerings, including technical support, parental controls, and cybersecurity protection. It also provides Ethernet switches, wireless controllers and access points, unified storage products, and Internet security appliances for small and medium-sized businesses. The company markets and sells its products through traditional retailers, online retailers, wholesale distributors, direct market resellers, value-added resellers, and broadband service providers in the Americas, Europe, the Middle-East, Africa, and the Asia Pacific. NETGEAR, Inc. was founded in 1996 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "NTGR": {"short_name": "NETGEAR, Inc.", "long_name": "NETGEAR, Inc.", "summary": "NETGEAR, Inc. designs, develops, and markets networking and Internet connected products for consumers, businesses, and service providers. It operates in two segments, Connected Home, and Small and Medium Business. The company offers smart home/connected home/broadband access products, such as broadband modems, WiFi gateways, WiFi hotspots, WiFi routers and home WiFi systems, WiFi range extenders, Powerline adapters and bridges, WiFi network adapters, and digital canvasses; and value added service offerings, including technical support, parental controls, and cybersecurity protection. It also provides Ethernet switches, wireless controllers and access points, unified storage products, and Internet security appliances for small and medium-sized businesses. The company markets and sells its products through traditional retailers, online retailers, wholesale distributors, direct market resellers, value-added resellers, and broadband service providers in the Americas, Europe, the Middle-East, Africa, and the Asia Pacific. NETGEAR, Inc. was founded in 1996 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "NTIP": {"short_name": "Network-1 Technologies, Inc.", "long_name": "Network-1 Technologies, Inc.", "summary": "Network-1 Technologies, Inc. develops, licenses, and protects intellectual property assets. The company owned 84 patents, including the remote power patent covering the delivery of power over Ethernet cables for the purpose of remotely powering network devices, such as wireless access ports, IP phones, and network based cameras; and the Mirror Worlds patent portfolio relating to foundational technologies that enable unified search and indexing, displaying, and archiving of documents in a computer system. Its patents also comprise the Cox patent portfolio relating to enabling technology for identifying media content on the Internet; M2M/IoT patent portfolio related to enabling technology for authenticating, provisioning, and using embedded sim cards in next generation IoT, Machine-to-Machine, and other mobile devices, including smartphones, tablets, and computers; and the quality of service (QoS) patents covering systems and methods for the transmission of audio, video, and data in order to achieve high QoS over computer and telephony networks. The company was formerly known as Network-1 Security Solutions, Inc. and changed its name to Network-1 Technologies, Inc. in October 2013 to reflect the nature of its business. Network-1 Technologies, Inc. was founded in 1990 and is headquartered in New York, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "New York"}, "NWBD": {"short_name": "NEW WORLD BRANDS INC", "long_name": "New World Brands, Inc.", "summary": "New World Brands, Inc. provides telecommunications sales, services, products, and services utilizing voice over Internet protocol (VoIP) technology. New World Brands, Inc. was formerly known as Qualmax, Inc. and changed its name to New World Brands, Inc. in September 2006. The company was founded in 1986 and is based in McKinney, Texas.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "McKinney"}, "OCC": {"short_name": "Optical Cable Corporation", "long_name": "Optical Cable Corporation", "summary": "Optical Cable Corporation, together with its subsidiaries, manufactures and sells fiber optic and copper data communications cabling and connectivity solutions primarily for the enterprise market in the United States and internationally. The company provides fiber optic and hybrid cables for high bandwidth transmission of data, video, and voice communications; and copper datacom cables, including unshielded and shielded twisted pair constructions. It also offers fiber optic connectivity products, including fiber optic wall mounts, cabinet mount and rack mount enclosures, pre-terminated fiber optic enclosures, fiber optic connectors, splice trays, fiber optic jumpers, plug and play cassette modules, pre-terminated fiber optic cable assemblies, adapters, and accessories. In addition, the company provides copper connectivity products comprising category compliant patch panels, jacks, plugs, patch cords, faceplates, surface mounted boxes, distribution and multi-media boxes, copper rack mount and wall mount enclosures, cable assemblies, cable organizers, and other wiring products for equipment rooms, telecommunications closets, data centers, and workstation applications. Further, it offers network, data storage, and telecommunications management systems, such as data cabinets, wall mount enclosures, horizontal and vertical cable management systems, and open frame relay racks for enterprise and residential use; and datacom wiring products, such as various enclosures, modules, and modular outlets for single dwelling and multiple dwelling residential uses. Additionally, the company provides specialty fiber optic connectors and connectivity components, copper datacom connectors, and related systems and solutions for military, other harsh environment, and special applications. It sells its products to distributors, original equipment manufacturers, value-added resellers, and end-users. Optical Cable Corporation was founded in 1983 and is headquartered in Roanoke, Virginia.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NGM", "market": "us_market", "country": "United States", "city": "Roanoke"}, "ONDS": {"short_name": "Ondas Holdings Inc.", "long_name": "Ondas Holdings Inc.", "summary": "Ondas Holdings Inc., through its subsidiaries, designs, develops, manufactures, sells, and supports FullMAX software defined radio (SDR) platform in the United States and internationally. The company provides FullMAX base station and remote radios to create wide-area wireless communication networks; and FullMAX SDR platform that offers a private network for industrial applications, which safeguards critical assets and information, and protects against cyberattacks. It sells its products and services through a direct sales force and value-added sales partners to critical infrastructure providers and applications, such as electric and gas utilities, water and wastewater utilities, transportation, oil and gas producers and pipeline operators, security, commercial/industrial drones, and defense markets. The company is headquartered in Sunnyvale, California. Ondas Holdings Inc. is a subsidiary of Ondas Holdings Inc.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Sunnyvale"}, "OSAT": {"short_name": "ORBSAT CORP", "long_name": "Orbsat Corp.", "summary": "Orbsat Corp., through its subsidiaries, provides various services and solutions in the United States and internationally. The company's services and solutions enable its users to communicate, track assets and personnel, or request SOS assistance through satellite from anywhere. It offers satellite communications services globally through satellite over satellite based simplex data network. The company is also involved in the resale of satellite voice, data, and IoT communications services offered by other networks; operation of e-commerce websites that offer a range of mobile satellite services products and solutions; and making of portable satellite voice, data, and tracking solutions easier to find and buy online through its various third-party e-commerce storefronts. In addition, it operates mapping and tracking portals that display real-time asset location reports, including position, speed, altitude, and heading, as well as provide past location and movement history reports on a range of tracking devices. Further, the company is developing dual-mode asset trackers to address the current technical and service cost challenges facing the global asset management systems market. It serves businesses, governments, non-governmental and charitable organizations, military users, and private individuals. The company was formerly known as Orbital Tracking Corp and changed its name to Orbsat Corp. in August 2019. Orbsat Corp. was incorporated in 1997 and is headquartered in Aventura, Florida.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Aventura"}, "OTOW": {"short_name": "O2 SECURE WIRELESS INC", "long_name": "O2 Secure Wireless, Inc.", "summary": "O2 Secure Wireless, Inc., an Internet communications company, designs and maintains high-speed wireless broadband connection networks in the southeastern United States. The company designs, engineers, deploys, and maintains wireless broadband systems using WiFi, wireless, mobile, fixed, and consulting service technologies for residents with high-density residential communities; mobile professionals; and companies that support residential communities and mobile professionals. It also specializes in wireless tower construction and lease operations. In addition, the company's retail services include Internet, television, home phone, and mobile services; and industrial services comprise engineering, construction, build out-services, site development, and industrial consulting services. Further, it operates a retail store that offers wireless services and prepaid MasterCard cards in Palm Coast, Florida. The company was founded in 2003 and is based in Palm Coast, Florida.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Palm Coast"}, "PCTI": {"short_name": "PCTEL, Inc.", "long_name": "PCTEL, Inc.", "summary": "PCTEL, Inc., together with its subsidiaries, supplies wireless network antenna and testing solutions worldwide. The company designs and manufactures precision antennas that are deployed in small cells, enterprise Wi-Fi access points, fleet management and transit systems, and in equipment and devices for the Industrial Internet of Things. It also offers radio frequency test and measurement tools that enhance the performance of wireless networks. The company serves public and private carriers, wireless infrastructure providers, wireless equipment distributors, and value added resellers, as well as original equipment manufacturers. The company was founded in 1994 and is headquartered in Bloomingdale, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bloomingdale"}, "PDXP": {"short_name": "PDX PARTNERS INC", "long_name": "PDX Partners, Inc.", "summary": "PDX Partners, Inc. provides voice over Internet protocol services. It markets its services through direct sales, as well as online. The company was founded in 1997 and is based in Indianapolis, Indiana.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Indianapolis"}, "PEW.F": {"short_name": "PCTEL INC.  DL-,001", "long_name": "PCTEL, Inc.", "summary": "PCTEL, Inc., together with its subsidiaries, supplies wireless network antenna and testing solutions worldwide. The company designs and manufactures precision antennas that are deployed in small cells, enterprise Wi-Fi access points, fleet management and transit systems, and in equipment and devices for the Industrial Internet of Things. It also offers radio frequency test and measurement tools that enhance the performance of wireless networks. The company serves public and private carriers, wireless infrastructure providers, wireless equipment distributors, and value added resellers, as well as original equipment manufacturers. The company was founded in 1994 and is headquartered in Bloomingdale, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Bloomingdale"}, "PI": {"short_name": "Impinj, Inc.", "long_name": "Impinj, Inc.", "summary": "Impinj, Inc. operates a platform that enables wireless connectivity to various everyday items to business and consumer applications. Its integrated platform connects everyday items to applications, delivering real-time information to businesses about items they create, manage, transport, and sell. The company's platform includes endpoint integrated circuits (ICs), a miniature radios-on-a-chip that attach-to and identify their host items; and connectivity products that comprise reader ICs and modules, readers, and gateways to wirelessly identify, locate, authenticate, and engage items, as well as provide power to and communicate bidirectionally with endpoint ICs. Its platform also consists of software offerings that include ItemSense, a system software that comprises enterprise-class RAIN deployment management, software-defined algorithms for transition detection, and APIs that enable application developers to build powerful IoT solutions. The company primarily serves retail, supply chain and logistics, aviation, automotive, healthcare, industrial and manufacturing, sports, food, datacenter, travel, banking, and linen and uniform tracking sectors through distributors, system integrators, value-added resellers, and software solution partners in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. Impinj, Inc. was founded in 2000 and is headquartered in Seattle, Washington.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Seattle"}, "PLT": {"short_name": "Plantronics, Inc.", "long_name": "Plantronics, Inc.", "summary": "Plantronics, Inc. designs, manufactures, markets, and sells integrated communications and collaborations solutions for corporate customers, small businesses, and individuals worldwide. Its principal product categories include headsets, which comprises wired and wireless communication headsets; voice, video, and content sharing solutions, which includes open session initiation protocol and native ecosystem desktop phones, conference room phones, and video conferencing solutions; peripherals, including cameras, speakers, and microphones designed to work with a range of unified communication and collaboration, unified communication as a service, and video as a service environments, including RealPresence collaboration solutions of infrastructure to endpoints that allows people to connect and collaborate; and support services. The company sells its products through a sales team, as well as through value-added resellers, integrators, direct marketing resellers, service providers, direct and indirect resellers, retailer, enterprise distributors, wireless carriers, and mass merchants under the Poly, Plantronics, and Polycom brands, as well as RIG brand. Plantronics, Inc. was founded in 1961 and is headquartered in Santa Cruz, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Santa Cruz"}, "PMOZ": {"short_name": "PRISMONE GROUP INC", "long_name": "PrismOne Group, Inc.", "summary": "PrismOne Group, Inc. engages in planning, developing, and designing IT based solutions for organizations. It offers a portfolio of lifecycle sustainability tools based on customer requirements. The company was founded in 2006 and is based in Winter Garden, Florida.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Winter Garden"}, "PRXM": {"short_name": "PROXIM WIRELESS CORPORATION", "long_name": "Proxim Wireless Corporation", "summary": "Proxim Wireless Corporation provides Wi-Fi, point-to-point, and point-to-multipoint 4G wireless network technologies for wireless Internet, video surveillance, and backhaul applications. It offers wireless broadband and backhaul products, wireless LAN access products, and network controllers. The company's products have applications in transportation, video surveillance, mobility, Wi-Fi offload, backhaul, wireless broadband/ISP, government, carrier Wi-Fi, retail Wi-Fi, and enterprises WLAN. Its broadband wireless equipment is used by enterprises, service providers, carriers, government entities, educational institutions, healthcare organizations, municipalities and other organizations that need high-performance, secure, and scalable broadband wireless solutions. The company serves customers through online retailers, a network of distributors, value-added resellers, system integrators, and original equipment manufacturers in North America, Africa, the Asia Pacific, Europe, Latin America, and the Middle East. The company was founded in 1982 and is headquartered in San Jose, California. As of July 31, 2018, Proxim Wireless Corporation operates as a subsidiary of SRA Holdings, Inc.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Jose"}, "PWFL": {"short_name": "PowerFleet, Inc.", "long_name": "PowerFleet, Inc.", "summary": "PowerFleet, Inc. develops, markets, and sells wireless Internet-of-Things and machine-to-machine solutions in the United States, Israel, and internationally. The company offers industrial solutions, such as on-premise or in-facility asset and operator management, monitoring, and visibility for industrial trucks, such as forklifts and ground support equipment at airports. It also provides logistic solutions, including bumper-to-bumper asset management, monitoring, and visibility for heavy trucks, dry-van trailers, refrigerated trailers, shipping containers, etc., as well as associated cargos; and mobile-asset tracking and condition-monitoring solutions. In addition, the company offers vehicle solutions to enhance the vehicle fleet management process. Further, it provides hosting, maintenance, and support and consulting services; and Software as a Service covering system monitoring, help desk technical support, escalation procedure development, routine diagnostic data analysis, and software updates services. The company offers its product under the PowerFleet, Pointer and Cellocator brands. It sells its products to commercial and government sectors in automotive manufacturing, retail, food and grocery distribution, logistics, shipping, freight transportation, heavy industry, wholesale distribution, manufacturing, aerospace and defense, homeland security, and vehicle rental markets, as well as through indirect sales channels, such as original equipment manufacturers, vehicle importers, distributors, and industrial equipment dealers. The company was formerly known as I.D. Systems, Inc. PowerFleet, Inc. was incorporated in 1993 and is headquartered in Woodcliff Lake, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Woodcliff Lake"}, "PWFL.TA": {"short_name": "POWERFLEET INC", "long_name": "PowerFleet, Inc.", "summary": "PowerFleet, Inc. develops, markets, and sells wireless Internet-of-Things and machine-to-machine solutions in the United States, Israel, and internationally. The company offers industrial solutions, such as on-premise or in-facility asset and operator management, monitoring, and visibility for industrial trucks, such as forklifts and ground support equipment at airports. It also provides logistic solutions, including bumper-to-bumper asset management, monitoring, and visibility for heavy trucks, dry-van trailers, refrigerated trailers, shipping containers, etc., as well as associated cargos; and mobile-asset tracking and condition-monitoring solutions. In addition, the company offers vehicle solutions to enhance the vehicle fleet management process. Further, it provides hosting, maintenance, and support and consulting services; and Software as a Service covering system monitoring, help desk technical support, escalation procedure development, routine diagnostic data analysis, and software updates services. The company offers its product under the PowerFleet, Pointer and Cellocator brands. It sells its products to commercial and government sectors in automotive manufacturing, retail, food and grocery distribution, logistics, shipping, freight transportation, heavy industry, wholesale distribution, manufacturing, aerospace and defense, homeland security, and vehicle rental markets, as well as through indirect sales channels, such as original equipment manufacturers, vehicle importers, distributors, and industrial equipment dealers. The company was formerly known as I.D. Systems, Inc. PowerFleet, Inc. was incorporated in 1993 and is headquartered in Woodcliff Lake, New Jersey.", "currency": "ILA", "sector": "Technology", "industry": "Communication Equipment", "exchange": "TLV", "market": "il_market", "country": "United States", "city": "Woodcliff Lake"}, "SATS": {"short_name": "EchoStar Corporation", "long_name": "EchoStar Corporation", "summary": "EchoStar Corporation, together with its subsidiaries, provides broadband satellite technologies and broadband Internet services worldwide. It operates in two segments, Hughes and EchoStar Satellite Services (ESS). The Hughes segments offers broadband satellite technologies and Internet services for home and small to medium-sized businesses, and satellite services; and broadband network technologies, managed services, equipment, hardware, satellite services, and communication solutions for aeronautical and government enterprises, as well as consumers. This segment also designs, provides, and installs gateways and terminal equipment for other satellite systems; and provides satellite ground segment systems and terminals to mobile system operators and enterprise customers. The ESS segment provides satellite services using its owned and leased in-orbit satellites and related licenses on a full-time and/or occasional-use basis to the United States government service providers, Internet service providers, broadcast news organizations, content providers, and private enterprise customers. EchoStar Corporation was founded in 2007 and is headquartered in Englewood, Colorado.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Englewood"}, "SIML": {"short_name": "SIMLATUS CORPORATION", "long_name": "Simlatus Corporation", "summary": "Simlatus Corporation develops, manufactures, markets, and owns broadcast equipment and software for broadcast studios worldwide. The company also provides DirecTV services to high-rise apartments, condominiums, and large commercial office buildings in the San Francisco metropolitan area, as well as Internet services. In addition, it manufactures and sells cold-water/alcohol CBD extraction systems for medical grade CBD utilization, as well as climate controlled grow containers for government food-safety programs, and commercial and medical grade CBD. Simlatus Corporation is based in Grass Valley, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Grass Valley"}, "SMRN": {"short_name": "SMARTAG INTERNATIONAL INC", "long_name": "Smartag International, Inc.", "summary": "Smartag International, Inc. provides tracking supply chain and logistics systems in Asia, the Middle East, and North America. The company was formerly known as Art4Love, Inc. and changed its name to Smartag International, Inc. in February 2009. Smartag International, Inc. was founded in 1999 and is headquartered in Las Vegas, Nevada.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "SNWR": {"short_name": "SANWIRE CORP", "long_name": "Sanwire Corporation", "summary": "Sanwire Corporation, through its subsidiaries, provides technology integration, development, and solutions in the artificial intelligence, cryptography, Internet security, and Web software industries. The company is based in Cheyenne, Wyoming.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Cheyenne"}, "SONM": {"short_name": "Sonim Technologies, Inc.", "long_name": "Sonim Technologies, Inc.", "summary": "Sonim Technologies, Inc. provides ruggedized mobile phones and accessories for task workers. It offers ruggedized mobile phones, such as Sonim XP8, Sonim XP5s, and Sonim XP3 based on the Android platform that are capable of attaching to public and private wireless networks; industrial-grade accessories, including remote speaker microphones, multi-bay charging accessories, and in-vehicle hands-free voice communications solutions; cloud-based software and application services; and Rapid Deployment Kit, a portable communications system. Sonim Technologies, Inc. sells its mobile phones and accessories primarily to wireless carriers in the United States and Canada. The company serves transportation and logistics, construction, manufacturing, facilities management, energy and utility, and public sectors. The company was formerly known as NaviSpin.com, Inc. and changed its name to Sonim Technologies, Inc. in December 2001. Sonim Technologies, Inc. was incorporated in 1999 and is headquartered in Austin, Texas.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Austin"}, "TESS": {"short_name": "TESSCO Technologies Incorporate", "long_name": "TESSCO Technologies Incorporated", "summary": "TESSCO Technologies Incorporated architects and delivers product and value chain solutions to support wireless systems in the United States. The company offers base station infrastructure products, including base station antennas, cable and transmission lines, small towers, lightning protection devices, connectors, power systems, enclosures, grounding products, jumpers, miscellaneous hardware products, and mobile antennas to build, repair, and upgrade wireless broadband systems, as well as connector installation, custom jumper assembly, site kitting, and logistics integration services. It also provides network systems products, such as fixed and mobile broadband radio equipment, wireless networking filtering and distributed antenna systems, two-way radios, and security and surveillance products, as well as training classes, technical support, and engineering design services. In addition, the company offers installation, test, and maintenance products comprising analysis equipment; and various frequency, voltage, and power-measuring devices, as well as tools, hardware, GPS and safety products, and replacement and component parts and supplies to install, tune, and maintain wireless communications equipment. Further, it provides mobile devices, such as cellular and smart phones; and data device accessories, including power supplies, cases, screen protectors, speakers, mobile amplifiers, bluetooth and corded headsets, mounts, car antennas, music accessories, and data and memory cards. The company sells its products to carrier and public network operators, tower owners, program managers, contractors and integrators, private system operators, federal governments, state and local governments, manufacturers, value-added resellers, retail carrier stores and their independent agents, and other retailers under the Ventev brand. TESSCO Technologies Incorporated was founded in 1982 and is headquartered in Hunt Valley, Maryland.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Hunt Valley"}, "TPTW": {"short_name": "TPT GLOBAL TECH INC", "long_name": "TPT Global Tech, Inc.", "summary": "TPT Global Tech, Inc. operates as a media content hub for domestic and international syndication technology/telecommunications companies worldwide. It also provides technology solutions for businesses. The company offers software as a service (SaaS), technology platform as a service (PAAS), cloud-based unified communication as a service (UCaaS), and carrier-grade performance and support services for businesses over its private IP MPLS fiber and wireless network. Its cloud-based UCaaS services allow businesses to access voice, data, media, and collaboration in technology markets. In addition, the company distributes pre-paid cellphone services, mobile phones, cellphone accessories, and global roaming cellphones for nationwide mobile virtual network operators and independent sales organization. Additionally, it offers phone, Internet, fiber optic, wireless, hosted PBX, Wi-Fi, Wi-Max, engineering, cabling, wiring, and cloud services; hosted firewall and managed MPLS service technologies; and MaxEXP, a productivity-enabling proprietary e-commerce platform, which enables companies to deploy and manage e-commerce offerings at lower cost and at less time. Further, the company provides cloud unified businesses services that delivers global TV broadcast and social media platform utilizing a mobile app technology on its proprietary content delivery network; and creates original live action and animated content productions. The company was formerly known as Ally Pharma US, Inc. and changed its name to TPT Global Tech, Inc. in December 2014. TPT Global Tech, Inc. is headquartered in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Diego"}, "UI": {"short_name": "Ubiquiti Inc.", "long_name": "Ubiquiti Inc.", "summary": "Ubiquiti Inc. develops networking technology for service providers, enterprises, and consumers. It develops technology platforms for high-capacity distributed Internet access, unified information technology, and consumer electronics for professional, home, and personal use. Its service provider product platforms offer carrier-class network infrastructure for fixed wireless broadband, wireless backhaul systems, and routing; and enterprise product platforms provide wireless LAN infrastructure, video surveillance products, switching and routing solutions, security gateways, and other WLAN products, as well as offers consumer products under the Ubiquiti Labs brand name. The company also provides technology platforms, such as airMAX, which include proprietary protocols that contain technologies for minimizing signal noise; EdgeMAX, a software and system routing platform; airFiber, a point-to-point radio system; and UFiber GPON, a plug and play fiber network technology to build high speed fiber internet networks. In addition, it offers UniFi -Enterprise WLAN, an enterprise Wi-Fi system that allows for on-site and remote management through the cloud; UniFi Protect, a video surveillance system, which provides statistical reporting and advanced analytics; UniFi Switch that deliver performance, switching, and power of Ethernet support for enterprise networks; and UniFi Security Gateway that provide routing and network security, as well as AmpliFi platform, a Wi-Fi system solution for connected homes. Further, Ubiquiti Inc. offers base stations, radios, and customer premise equipment; embedded radio products; antennas; and mounting brackets, cables, and power over Ethernet adapters. It serves customers through a network of approximately 100 distributors and online retailers worldwide. The company was formerly known as Ubiquiti Networks, Inc. and changed its name to Ubiquiti Inc. in August 2019. Ubiquiti Inc. was incorporated in 2003 and is headquartered in New York, New York.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "New York"}, "UNS1.F": {"short_name": "VIAVI SOLUTIONS  DL-,001", "long_name": "Viavi Solutions Inc.", "summary": "Viavi Solutions Inc. provides network test, monitoring, and assurance solutions to communications service providers, enterprises, network equipment manufacturers, government, civil, military, and avionics customers worldwide. The company operates through three segments: Network Enablement (NE), Service Enablement (SE), and Optical Security and Performance Products (OSP) segments. The NE segment offers testing solutions that access the network to perform build-out and maintenance tasks. This segment provides solutions that include instruments, software, and services to design, build, activate, certify, troubleshoot, and optimize networks; and instrumentation for communication and safety. It also offers support and professional services, such as repair, calibration, software support, and technical assistance for the products; and system integration projects, including project management, installation, and implementation, as well as product and technology training, and consulting services. The SE segment provides embedded systems and enterprise performance management solutions for communication service providers, enterprises, and cloud operators with visibility into network, service, and application data. Its solutions include instruments, microprobes, and software, which monitor, collect, and analyze network data to reveal the actual customer experience and to identify opportunities for new revenue streams and network optimization. The OSP segment offers optical products for anti-counterfeiting, government, industrial, automotive, and consumer electronic markets, including 3D sensing applications. The company was formerly known as JDS Uniphase Corporation and changed its name to Viavi Solutions Inc. in August 2015. Viavi Solutions Inc. was founded in 1923 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "UTRK": {"short_name": "UNIVERSAL TRACKING SOLUTIONS IN", "long_name": "Universal Tracking Solutions, Inc.", "summary": "Universal Tracking Solutions, Inc. provides global positioning satellite asset tracking systems to monitor the fleets of motor vehicles primarily in the west and southwest United States. The company's products are used to track the location, speed, and heading of a customer's motor vehicle in real time. It also provides software support tools. The company primarily sells its products to the automotive segment of the GPS market through distributors and internal sales force. Universal Tracking Solutions, Inc. was incorporated in 2006 and is based in Gilbert, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Gilbert"}, "V00.F": {"short_name": "VOCERA COMMUNICAT.DL-0003", "long_name": "Vocera Communications, Inc.", "summary": "Vocera Communications, Inc. provides secure, integrated, and intelligent communication and workflow solutions that empowers mobile workers in healthcare, hospitality, retail, energy, education, and other mission-critical mobile work environments in the United States and internationally. The company's communication solution integrates with other clinical systems, including electronic health records, nurse call systems, and patient monitoring, as well as to provide critical data, alerts, alarms, and clinical context that enable workflow. It also offers Vocera Communication and Workflow System, a software platform, which connects communication devices, such as hands-free, wearable, and voice-controlled Smartbadge and badges, as well as third-party mobile devices; and Vocera Care Experience, a software to improve care quality and safety, patient experience and satisfaction, and simplify and automate manual tasks and procedures. In addition, the company offers Experience Innovation Network, a membership program, which partners with healthcare provider organizations for the development of innovations and solutions that enhance care team and patient experience, as well as clinical and operational performance. Further, it provides professional, software maintenance, and technical support services; and classroom training, distance learning, or customized courseware for systems administrators, IT and industry-specific professionals, and end-user educators. As of December 31, 2019, the company provided its solutions to approximately 1,700 healthcare facilities, including large hospital systems, small and medium-sized local hospitals, and various clinics, surgery centers, and aged-care facilities. It sells its products through direct sales force, resellers, and distributors. The company was founded in 2000 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "VCRA": {"short_name": "Vocera Communications, Inc.", "long_name": "Vocera Communications, Inc.", "summary": "Vocera Communications, Inc. provides secure, integrated, and intelligent communication and workflow solutions that empowers mobile workers in healthcare, hospitality, retail, energy, education, and other mission-critical mobile work environments in the United States and internationally. The company's communication solution integrates with other clinical systems, including electronic health records, nurse call systems, and patient monitoring, as well as to provide critical data, alerts, alarms, and clinical context that enable workflow. It also offers Vocera Communication and Workflow System, a software platform, which connects communication devices, such as hands-free, wearable, and voice-controlled Smartbadge and badges, as well as third-party mobile devices; and Vocera Care Experience, a software to improve care quality and safety, patient experience and satisfaction, and simplify and automate manual tasks and procedures. In addition, the company offers Experience Innovation Network, a membership program, which partners with healthcare provider organizations for the development of innovations and solutions that enhance care team and patient experience, as well as clinical and operational performance. Further, it provides professional, software maintenance, and technical support services; and classroom training, distance learning, or customized courseware for systems administrators, IT and industry-specific professionals, and end-user educators. As of December 31, 2019, the company provided its solutions to approximately 1,700 healthcare facilities, including large hospital systems, small and medium-sized local hospitals, and various clinics, surgery centers, and aged-care facilities. It sells its products through direct sales force, resellers, and distributors. The company was founded in 2000 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Jose"}, "VCTY": {"short_name": "VIDEOLOCITY INTERNATIONAL INC", "long_name": "Videolocity International, Inc.", "summary": "Videolocity International, Inc., through its subsidiaries, operates as a Chinese management education and consulting firm in the People's Republic of China. The company provides consulting, educational, and training curricula focusing on government management training, administrative party cadres training, women cadres training, councilors training, and training of Communist Party members and community neighborhood committee cadres. It also offers business management training, financial management training, training of execution, human resources training, and secretarial staff training; and college student, career guidance, on-the-job, ethics, foreign language, pre-masters degree course, and doctorate preparatory course training. In addition, the company involves in various business activities, including economic zoning, such as regional economic development planning, urban planning, land planning, and plans for the development of industries; and supplying services and planning for conferences by undertaking trade and investment promotion, product exhibitions, and various other forums. Videolocity International, Inc. is based in Henderson, Nevada.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Henderson"}, "VIAV": {"short_name": "Viavi Solutions Inc.", "long_name": "Viavi Solutions Inc.", "summary": "Viavi Solutions Inc. provides network test, monitoring, and assurance solutions to communications service providers, enterprises, network equipment manufacturers, government, civil, military, and avionics customers worldwide. The company operates through three segments: Network Enablement (NE), Service Enablement (SE), and Optical Security and Performance Products (OSP) segments. The NE segment offers testing solutions that access the network to perform build-out and maintenance tasks. This segment provides solutions that include instruments, software, and services to design, build, activate, certify, troubleshoot, and optimize networks; and instrumentation for communication and safety. It also offers support and professional services, such as repair, calibration, software support, and technical assistance for the products; and system integration projects, including project management, installation, and implementation, as well as product and technology training, and consulting services. The SE segment provides embedded systems and enterprise performance management solutions for communication service providers, enterprises, and cloud operators with visibility into network, service, and application data. Its solutions include instruments, microprobes, and software, which monitor, collect, and analyze network data to reveal the actual customer experience and to identify opportunities for new revenue streams and network optimization. The OSP segment offers optical products for anti-counterfeiting, government, industrial, automotive, and consumer electronic markets, including 3D sensing applications. The company was formerly known as JDS Uniphase Corporation and changed its name to Viavi Solutions Inc. in August 2015. Viavi Solutions Inc. was founded in 1923 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "VISL": {"short_name": "Vislink Technologies, Inc.", "long_name": "Vislink Technologies, Inc.", "summary": "Vislink Technologies, Inc. designs, develops, and delivers wireless communications solutions in North and South America, Europe, Asia, and internationally. It develops, manufactures, and sells microwave communications equipment and video transmission products under the Nucomm, RF Central, and IMT brand names for broadcast, sports and entertainment, and government/surveillance markets. The company also offers satellite communication, cellular, and wireless camera systems and associated amplifier items, as well as microwave radio components under the Vislink brand to broadcasters, network owners and station groups, sports and live broadcasters, hosted service providers, and defense agencies and organizations, as well as metropolitan, regional, and national law enforcement agenciesIts products portfolio consists of HCAM, an on-camera wireless video transmitter; HDX-1100, an aircraft downlink transmitter; ViewBack, a dual channel diversity receiver-decoder; SatWare, an embedded computing and routing system; and AirPro-75, an IP satellite data terminal, as well as various types of receivers. The company was formerly known as xG Technology, Inc. and changed its name to Vislink Technologies, Inc. in February 2019. Vislink Technologies, Inc. was founded in 2002 and is headquartered in Sarasota, Florida.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Sarasota"}, "VMNT": {"short_name": "VEMANTI GROUP INC", "long_name": "Vemanti Group, Inc.", "summary": "Vemanti Group, Inc. provides communication network solutions. The company primarily offers business-class voice over IP cloud phone systems; carrier-class domestic/international origination and termination products; and business communications tools and applications, such as fax, SMS, call conferencing, and call center, as well as IP-based communications services to small and medium business customers. Its network provides unified communication, data center, content delivery, and cloud computing services. It also sub-leases telecommunications infrastructure and provides telecommunications and colocation services. The company operates in various industries, including advertising, consulting, finance, healthcare, legal, real estate, retail, and technology industries through its direct sales representatives and resellers. Vemanti Group, Inc. was founded in 2014 and is headquartered in Newport Beach, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Newport Beach"}, "VPTV": {"short_name": "VIDEOPROPULSION INTERACTIVE TEL", "long_name": "VideoPropulsion Interactive Television, Inc.", "summary": "VideoPropulsion Interactive Television, Inc. provides hardware and software for digital content movement. It offers high definition television (HDTV), video on demand, and Internet protocol television products. The company also provides FloodGate satellite and CATV transcription appliances for hospitality and other commercial HDTV markets; turnkey appliances for various applications, including multiplexing, demultiplexing, modulation, demodulation, transcoding, encryption, and splicing MPEG formatted data; and OEM computer modules for DTV applications. Its products include VideoPropulsion MPEG transcoders; FloodGate head-end appliances to support distribution via RF or IPTV; FloodGate Manager that includes channel line-up configuration, channel failover, and troubleshooting features to manage free-to-guest HD content; FloodGate4000 Series of HDTV head end appliances for hospitality and other commercial CATV markets; and QAMs, DVB-ASI transceivers, and digital video networking interfaces that are deployed in hospitality sites, head-ends, satellite links, and media studios around the globe. The company is based in Slinger, Wisconsin.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Slinger"}, "VS1.F": {"short_name": "VIASAT INC.  DL-,0001", "long_name": "Viasat, Inc.", "summary": "Viasat, Inc. provides broadband and communications products and services worldwide. It operates through three segments: Satellite Services, Commercial Networks, and Government Systems. The company's Satellite Services segment offers satellite-based fixed broadband services, including broadband internet access and voice over internet protocol services to consumers and businesses; in-flight entertainment, internet, and aviation software services to commercial airlines; community internet services; and mobile broadband services, including satellite-based internet services to energy offshore vessels, cruise ships, consumer ferries, and yachts. As of March 31, 2020, this segment provided broadband Internet services to approximately 590,000 subscribers. Its Commercial Networks segment offers fixed satellite networks comprising satellite network infrastructure and ground terminals; mobile broadband satellite communication systems; and antenna systems for terrestrial and satellite applications, such as earth imaging, remote sensing, mobile satellite communication, Ka-band earth stations, and other multi-band antennas. This segment also provides design and technology services, including analysis, design, development, and specification of satellites and ground systems; application specific integrated circuit and monolithic microwave integrated circuit design; and network function virtualization. The company's Government Systems segment offers various mobile and fixed broadband modems, terminals, network access control systems, and antenna systems; cybersecurity and information assurance products and services; and tactical radio and information distribution systems to enable voice, and real-time collection and dissemination of video and data using secure, and jam-resistant transmission links. The company was founded in 1986 and is headquartered in Carlsbad, California.", "currency": "EUR", "sector": "Technology", "industry": "Communication Equipment", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Carlsbad"}, "VSAT": {"short_name": "ViaSat, Inc.", "long_name": "Viasat, Inc.", "summary": "Viasat, Inc. provides broadband and communications products and services worldwide. It operates through three segments: Satellite Services, Commercial Networks, and Government Systems. The company's Satellite Services segment offers satellite-based fixed broadband services, including broadband internet access and voice over internet protocol services to consumers and businesses; in-flight entertainment, internet, and aviation software services to commercial airlines; community internet services; and mobile broadband services, including satellite-based internet services to energy offshore vessels, cruise ships, consumer ferries, and yachts. As of March 31, 2020, this segment provided broadband Internet services to approximately 590,000 subscribers. Its Commercial Networks segment offers fixed satellite networks comprising satellite network infrastructure and ground terminals; mobile broadband satellite communication systems; and antenna systems for terrestrial and satellite applications, such as earth imaging, remote sensing, mobile satellite communication, Ka-band earth stations, and other multi-band antennas. This segment also provides design and technology services, including analysis, design, development, and specification of satellites and ground systems; application specific integrated circuit and monolithic microwave integrated circuit design; and network function virtualization. The company's Government Systems segment offers various mobile and fixed broadband modems, terminals, network access control systems, and antenna systems; cybersecurity and information assurance products and services; and tactical radio and information distribution systems to enable voice, and real-time collection and dissemination of video and data using secure, and jam-resistant transmission links. The company was founded in 1986 and is headquartered in Carlsbad, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Carlsbad"}, "WDSL": {"short_name": "WIRELESS DATA SOLUTIONS INC", "long_name": "Wireless Data Solutions, Inc.", "summary": "Wireless Data Solutions, Inc. develops and markets digital mobile data terminals and associated software for vehicle management. The company's equipment is designed, assembled, marketed, and sold by its subsidiary. Its vehicle tracking and GPS location system is its adaptable and programmable Mobile Data Terminal and it is integrated with the customer's existing two way radios providing vehicle status information and solving various vehicle fleet management issues. The company also designs and sells proprietary software, which resides on the customer's central office Windows-based PC. This software translates the digital data received from vehicle fleets; acts as a message-handling center; and provides mapping details as the vehicle's location real time. The data sent and received by proprietary software is archived in the PC, which can be accessed for documentation purposes. The company was formerly known as Products, Services & Technology Corp. and changed its name to Wireless Data Solutions, Inc. in 1997. The company was incorporated in 1984 and is based in St. Cloud, Minnesota. Wireless Data Solutions, Inc. has locations in the United States, South America, Mexico, and Canada.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "St. Cloud"}, "WGNR": {"short_name": "WEGENER CORP", "long_name": "Wegener Corporation", "summary": "Wegener Corporation, through its subsidiary, Wegener Communications, Inc., designs, manufactures, and distributes satellite communications electronics equipment in the United States and internationally. The company offers iPump media servers, which receives and stores television, radio, and other digital files from broadcast, cable, and business network operations; Compel Network Control and Compel Conditional Access for dynamic command, monitoring, and addressing multi-site video, audio, and data networks; and Nielsen Media Research products, such as NAVE IIc and SpoTTrac encoders, which are used to encode Nielsen Media Research identification tags into media for Nielsen program ratings, as well as MediaPlan network control and content management products, which provides digital asset management in an end-to-end multi-site environment. It also provides Unity satellite media receivers, including Unity 552 for private and business television networks; Unity 4600, a digital satellite receiver that is used primarily by program originators to distribute analog and digital programming; and Unity 202 audio receiver for business music providers. In addition, the company offers digital television digital stream processors for cable and telecom headends allowing them to integrate local off-air high definition broadcast television channels and digital programs, and insert them onto their networks; uplink equipment for video and audio distribution; and customized products. It serves business and private networks, broadcast television and program originators, and radio broadcasters through direct sales force, sales representatives, value added resellers, integrators, and independent distributors. The company was founded in 1977 and is headquartered in Johns Creek, Georgia. Wegener Corporation is a subsidiary of Novra Technologies, Inc.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Johns Creek"}, "WIRX": {"short_name": "WIRELESS XCESSORIES GROUP INC", "long_name": "Wireless Xcessories Group, Inc.", "summary": "Wireless Xcessories Group, Inc. designs, manufactures, and distributes accessories for cellular phones primarily in the United States. It offers batteries; and hands free devices, and car and travel chargers, as well as various carrying cases. The company sells its products to dealers and distributors through an in-house sales force, as well as through its Website, wirexgroup.com. Wireless Xcessories Group, Inc. was founded in 1983 and is headquartered in Huntingdon Valley, Pennsylvania.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Huntingdon Valley"}, "WLAN": {"short_name": "WIALAN TECHNOLIGIES INC", "long_name": "Wialan Technologies, Inc.", "summary": "WIALAN Technologies, LLC operates as a software and hardware integrator that manufactures industrial grade wireless equipment to enable the deployment of IP base services. The company provides wireless network solutions through Wi-Gate series access points for applications in the areas of ISP hot zone coverage, 3G offload, video surveillance, municipal security, public safety, public transportation, marinas, parks, hotels and resorts, hospitals, business complexes, small businesses, residential, factories, shipyards, and oil refineries, as well as for Internet, voice-over-IP, early warning systems, multimedia streaming, and other IP applications. The company was incorporated in 2011 and is based in Sunrise, Florida. It has additional offices in Medley and Clearwater, Florida; Newport Beach, California; Santo Domingo, Dominican Republic; Panama City, Panama; and Port-au-Prince, Haiti.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Sunrise"}, "WSTL": {"short_name": "WESTELL TECHNOLOGIES INC", "long_name": "Westell Technologies, Inc.", "summary": "Westell Technologies, Inc., through its subsidiary, Westell, Inc., designs and distributes telecommunications products to telephone companies in the United States. The company operates through three segments: In-Building Wireless (IBW), Intelligent Site Management (ISM), and Communications Network Solutions (CNS). The IBW segment offers distributed antenna system conditioners; digital repeaters; battery backup units; and system components and antennas, including couplers, duplexers, splitters, filters, and tappers for commercial and public safety in-building wireless systems. The ISM segment provides a suite of remote units, which provide machine-to-machine communications that enable operators to remotely monitor, manage, and control site infrastructure and support systems. The CNS segment provides a range of indoor and outdoor network infrastructure, such as integrated cabinets, power distribution products, copper and fiber connectivity products, and T1 network interface units. The company serves wireless and wireline service providers, multiple systems operators, Internet service providers, systems integrators, neutral host operators, and distributors through field sales organization, distributors, and partners. Westell Technologies, Inc. was founded in 1980 and is headquartered in Aurora, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Aurora"}, "WTT": {"short_name": "Wireless Telecom Group,  Inc.", "long_name": "Wireless Telecom Group, Inc.", "summary": "Wireless Telecom Group, Inc., together with its subsidiaries, designs, develops, manufactures, and markets radio frequency (RF) and microwave devices in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company operates in three segments: Network Solutions, Test and Measurement, and Embedded Solutions. The Network Solutions segment designs and manufactures RF components and integrated subsystems, including low passive intermodulation radio frequency and microwave products used in small cell deployments, distributed antenna systems, in-building wireless solutions, and cellular base-stations. This segment also provides power combiners, directional couplers, attenuators, terminators, and filters for broadband applications to support commercial in-building wireless networks, public safety networks, rail and transportation deployments, corrosive salt/fog environment build-outs, and global positioning system (GPS) signal distribution; and GPS digital repeaters and splitters for cellular timing synchronization, as well as a passive systems monitor for real-time diagnostics of an in-building distributed antenna system. The Test and Measurement segment offers power meters, power sensors, voltmeters, and audio and modulation analyzers for radar, avionics, electronic warfare, electromagnetic interference compatibility, and satellite and wireless communications applications; and noise generation instruments, calibrated noise sources, noise modules, and diodes. xThe Embedded Solutions segment provides embedded signal processing and radio frequency modules; and long term evolution physical layer and stack software for 4G and 5G mobile network applications. The company markets its products under the Boonton, Microlab, Noisecom, and CommAgility brands through its in-house sales force, manufacturers' representatives, and distributors. Wireless Telecom Group, Inc. was founded in 1985 and is headquartered in Parsippany, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Parsippany"}, "WWII": {"short_name": "WORLD WIRELESS INTL TELCOM INC", "long_name": "World Of Wireless International Telecom, Inc.", "summary": "WiFi Wireless, Inc., a development stage company, engages in the research, development, and commercialization of technologies for use in the military, maritime, and commercial markets in the United States and internationally. It utilizes global positioning satellites for tracking products used in the shipping and transportation industries, as well as applications using UHF frequencies enabling Wi-Fi hardware to provide a range of service, including Point of Presence and Wi-Fi retail space application. The company was formerly known as Sunburst Resources Inc. and changed its name to WiFi Wireless, Inc. in June 2004. WiFi Wireless, Inc. was founded in 1989 and is based in Dana Point, California.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dana Point"}, "XCOMQ": {"short_name": "XTERA COMMUNICATIONS INC", "long_name": "Xtera Communications, Inc.", "summary": "Xtera Communications, Inc. is in the process of liquidation. Previously, it provided Raman amplification enabled optical transport systems for terrestrial and submarine networks worldwide. The company was founded in 1998 and is headquartered in Allen, Texas. On February 21, 2017, the voluntary petition of Xtera Communications, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on November 15, 2016.", "currency": "USD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Allen"}, "YTY.V": {"short_name": "WI2WI CORPORATION", "long_name": "Wi2Wi Corporation", "summary": "Wi2Wi Corporation designs, integrates, and manufactures wireless technology solutions in the United States and internationally. It offers wireless connectivity solutions, such as multi-protocol, Wi-Fi, and MCU embedded Bluetooth modules; location and navigation products, including GNSS and GPS modules; and timing and frequency control products comprising clock oscillators, crystals, crystal filters, and RF and microwave filters. The company also provides rubber duck antennas, PCB antennas, and antenna connector cables. Its products are primarily used in Internet of Things (IoT), industrial IoT, avionics, space, military, defense, infrastructure, automotive, industrial, communications, mobile-radio, personal navigation devices, consumer, and medical applications. The company sells its products to OEMs, enterprises, and distributors. Wi2Wi Corporation was founded in 2005 and is headquartered in San Jose, California.", "currency": "CAD", "sector": "Technology", "industry": "Communication Equipment", "exchange": "VAN", "market": "ca_market", "country": "United States", "city": "San Jose"}}