{
    "AEY": {
        "short_name": "ADDvantage Technologies Group, ",
        "long_name": "ADDvantage Technologies Group, Inc.",
        "summary": "ADDvantage Technologies Group, Inc., through its subsidiaries, distributes and services electronics and hardware for the telecommunications industry in the United States, Canada, Central America, Asia, Europe, Mexico, South America, and internationally. The company operates through two segments, Wireless Infrastructure Services and Telecommunications. The Wireless Infrastructure Services segment provides turn-key wireless infrastructure services for U.S. wireless carriers, communication tower companies, national integrators, and original equipment manufacturers. This segment also offers installation, upgradation, and maintenance of technology on cell sites; and the construction of new small cells for 5G. The Telecommunications segment provides central office equipment that include optical transport, switching, and data center equipment for communication networks; customer premise equipment, such as integrated access devices, channel banks, Internet protocol private branch exchange phones, and routers; and decommissioning services for surplus and obsolete telecom equipment. The company was formerly known as ADDvantage Media Group, Inc. and changed its name to ADDvantage Technologies Group, Inc. in December 1999. ADDvantage Technologies Group, Inc. was incorporated in 1989 and is headquartered in Carrollton, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Carrollton",
        "zipcode": "75007",
        "website": "http://www.addvantagetechnologies.com",
        "market_cap": "Nano Cap"
    },
    "ARW.DE": {
        "short_name": "ARROW EL. INC.  DL 1",
        "long_name": "Arrow Electronics, Inc.",
        "summary": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products consisting primarily of capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, including data-center, cloud, security, and analytics solutions, as well as access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, as well as manages service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "state": "CO",
        "city": "Centennial",
        "zipcode": "80112",
        "website": "http://www.arrow.com",
        "market_cap": "Mid Cap"
    },
    "ARW.F": {
        "short_name": "ARROW EL. INC.  DL 1",
        "long_name": "Arrow Electronics, Inc.",
        "summary": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products consisting primarily of capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, including data-center, cloud, security, and analytics solutions, as well as access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, as well as manages service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "CO",
        "city": "Centennial",
        "zipcode": "80112",
        "website": "http://www.arrow.com",
        "market_cap": "Mid Cap"
    },
    "ARW": {
        "short_name": "Arrow Electronics, Inc.",
        "long_name": "Arrow Electronics, Inc.",
        "summary": "Arrow Electronics, Inc. provides products, services, and solutions to industrial and commercial users of electronic components and enterprise computing solutions in Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates in two segments, Global Components and Global Enterprise Computing Solutions. The Global Components segment markets and distributes semiconductor products and related services; passive, electro-mechanical, and interconnect products consisting primarily of capacitors, resistors, potentiometers, power supplies, relays, switches, and connectors; and computing and memory products, as well as other products and services. The Global Enterprise Computing Solutions segment offers computing solutions, including data-center, cloud, security, and analytics solutions, as well as access to various services, including engineering and integration support, warehousing and logistics, marketing resources, and authorized hardware and software training. The company serves original equipment manufacturers, value-added resellers, as well as manages service providers, contract manufacturers, and other commercial customers. Arrow Electronics, Inc. was founded in 1935 and is based in Centennial, Colorado.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "CO",
        "city": "Centennial",
        "zipcode": "80112",
        "website": "http://www.arrow.com",
        "market_cap": "Mid Cap"
    },
    "AVT": {
        "short_name": "Avnet, Inc.",
        "long_name": "Avnet, Inc.",
        "summary": "Avnet, Inc., a technology solutions company, markets, sells, and distributes electronic components. The company operates through two segments, Electronic Components and Farnell. The Electronic Components segment markets, sells, and distributes semiconductors; interconnect, passive, and electromechanical devices; and other integrated components from electronic component manufacturers. It also offers design chain support that provides engineers with technical design solutions; engineering and technical resources to support product design, bill of materials development, and technical education and training; and supply chain solutions that provide support and logistical services to original equipment manufacturers, electronic manufacturing service providers, and electronic component manufacturers. In addition, this segment provides integrated solutions, such as technical design, integration, and assembly of embedded products, and systems and solutions primarily for industrial applications, as well as for intelligent embedded and innovative display solutions comprising touch and passive displays. Further, it develops and manufactures standard board and industrial subsystems, and application-specific devices that enable it to produce systems tailored to specific customer requirements. This segment serves various markets, including automotive, medical, defense, aerospace, telecommunications, industrial, and digital editing. The Farnell segment distributes kits, tools, and electronic and industrial automation components, as well as test and measurement products to engineers and entrepreneurs. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Avnet, Inc. was founded in 1921 and is headquartered in Phoenix, Arizona.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85034",
        "website": "http://www.avnet.com",
        "market_cap": "Mid Cap"
    },
    "CNXN": {
        "short_name": "PC Connection, Inc.",
        "long_name": "PC Connection, Inc.",
        "summary": "PC Connection, Inc., together with its subsidiaries, provides a range of information technology (IT) solutions. The company operates through three segments: Business Solutions, Enterprise Solutions, and Public Sector Solutions. It offers IT products, including computer systems, data center solutions, software and peripheral equipment, networking communications, and other products and accessories, as well as provides services, such as design, configuration, and implementation of IT solutions. The company markets its products and services through its websites comprising connection.com, connection.com/enterprise, connection.com/publicsector, and macconnection.com. It serves small to medium-sized businesses (SMBs) that include small office/home office customers; government and educational institutions; and medium-to-large corporate accounts through outbound telemarketing and field sales, and marketing programs targeted to specific customer populations, as well as through digital, web, and print media advertising. The company was founded in 1982 and is headquartered in Merrimack, New Hampshire.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NH",
        "city": "Merrimack",
        "zipcode": "03054-4631",
        "website": "http://www.connection.com",
        "market_cap": "Small Cap"
    },
    "EACO": {
        "short_name": "EACO CORP",
        "long_name": "EACO Corporation",
        "summary": "EACO Corporation, through its wholly owned subsidiary, Bisco Industries, Inc., distributes and sells electronic components and fasteners primarily in the United States and Canada. It offers electronic components, including spacers and standoffs, card guides and ejectors, component holders and fuses, circuit board connectors, and cable components, as well as various fasteners and hardware products. The company also provides customized services and solutions for various production needs comprising special packaging, bin stocking, kitting and assembly, bar coding, electronic requisitioning, integrated supply programs, and others. It supplies parts used in the manufacture of products to a range of industries, including aerospace, circuit board, communication, computer, fabrication, instrumentation, industrial equipment, and marine. The company sells its products primarily to the original equipment manufacturers through its sales representatives and distribution centers. EACO Corporation was founded in 1973 and is headquartered in Anaheim, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Anaheim",
        "zipcode": "92807",
        "website": "http://www.eacocorp.com",
        "market_cap": "Micro Cap"
    },
    "GSPT": {
        "short_name": "GOLDEN STAR ENTERPRISES LTD",
        "long_name": "Golden Star Enterprises Ltd.",
        "summary": "Golden Star Enterprises Ltd. provides alternative renewable fuels. It offers Terralene, an alternative fuel formulation that reduces greenhouse gases and other environmentally damaging emissions in existing gasoline combustion engines. The company offers its products for government, industry, and consumers. The company was formerly known as Terralene Fuels Corporation and changed its name to Golden Star Enterprises Ltd. in July 2013. Golden Star Enterprises Ltd. was founded in 1993 and is based in Patchogue, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Patchogue",
        "zipcode": "11772",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "JACO": {
        "short_name": "JACO ELECTRONICS INC",
        "long_name": "Jaco Electronics Inc.",
        "summary": "Jaco Electronics Inc. distributes displays and embedded systems. It offers high bright displays, touch screen displays, single board computers, TFT displays, LED micro displays, LCD controllers, and LED drivers. The company supplies its products to medical, military, kiosk, digital signage, aerospace, gaming, financial, e-voting, hand held devices, and transportation/automotive industries. Jaco Electronics Inc. was founded in 1961 and is headquartered in Hauppauge, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Hauppauge",
        "zipcode": "11788",
        "website": "http://www.jacoelectronics.com",
        "market_cap": "Nano Cap"
    },
    "KLGG": {
        "short_name": "KLEGG ELECTRONICS INC",
        "long_name": "Klegg Electronics, Inc.",
        "summary": "Klegg Electronics, Inc. manufactures and distributes consumer electronics in the United States. Its product portfolio includes home audio comprising home theater and in-wall\\ceiling speakers; flat panel television consisting of plasma televisions, LCD televisions, and media center PC television; and home and mobile electronics, such as AVR-7100 7.1 receiver, EnteraStream Klegg media server, and mini MP3 player. The company also offers accessories, including remote controls, speaker stands/mounts, and cables and RCA connectors. It has a strategic alliance with Utek Corp. to enhance its new product pipeline with the acquisition of proprietary intellectual capital from universities and laboratory research centers Klegg Electronics, Inc. was incorporated in 2003 and is headquartered in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NV",
        "city": "Las Vegas",
        "zipcode": "89120",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "PCC.F": {
        "short_name": "PC CONNECTION INC  DL-,01",
        "long_name": "PC Connection, Inc.",
        "summary": "PC Connection, Inc., together with its subsidiaries, provides a range of information technology (IT) solutions. The company operates through three segments: Business Solutions, Enterprise Solutions, and Public Sector Solutions. It offers IT products, including computer systems, data center solutions, software and peripheral equipment, networking communications, and other products and accessories, as well as provides services, such as design, configuration, and implementation of IT solutions. The company markets its products and services through its websites comprising connection.com, connection.com/enterprise, connection.com/publicsector, and macconnection.com. It serves small to medium-sized businesses (SMBs) that include small office/home office customers; government and educational institutions; and medium-to-large corporate accounts through outbound telemarketing and field sales, and marketing programs targeted to specific customer populations, as well as through digital, web, and print media advertising. The company was founded in 1982 and is headquartered in Merrimack, New Hampshire.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NH",
        "city": "Merrimack",
        "zipcode": "03054-4631",
        "website": "http://www.connection.com",
        "market_cap": "Small Cap"
    },
    "PGNT": {
        "short_name": "PARAGON TECHNOLOGIES INC",
        "long_name": "Paragon Technologies, Inc.",
        "summary": "Paragon Technologies, Inc., through its subsidiaries, engages in the material handling, distribution, real estate, and investments business activities in North America, Latin America, Europe, and Asia. It provides various productivity enhancing material handling solutions, including complete systems, subsystem technologies, products, software, and services for automated material handling and order processing applications. The company also distributes IT hardware products comprising notebook and desktop computers, TVs, projectors, gaming products, accessories, servers, workstations, storage and networking products, printers, audio visual products, and power protection systems; and offers managed services, printing outsourcing, electronic documents management, electronic invoicing, and internet of things services. In addition, it holds luxury residential condominiums in Las Vegas, Nevada, as well as provides ancillary real estate services; and invests in businesses and securities under the investment management policy. The company was formerly known as SI Handling Systems, Inc. and changed its name to Paragon Technologies, Inc. in April 2000. Paragon Technologies, Inc. was founded in 1958 and is based in Easton, Pennsylvania.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "PA",
        "city": "Easton",
        "zipcode": "18042",
        "website": "http://www.pgntgroup.com",
        "market_cap": "Nano Cap"
    },
    "PSYS": {
        "short_name": "PARADIGM SYS SOLUTIONS INC",
        "long_name": "Paradigm System Solutions Inc.",
        "summary": "Paradigm System Solutions Inc. is based in Burnsville, Minnesota.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "MN",
        "city": "Burnsville",
        "zipcode": "55337",
        "website": null,
        "market_cap": null
    },
    "PYA.F": {
        "short_name": "WAYSIDE TECHNOL.GRP DL-01",
        "long_name": "Wayside Technology Group, Inc.",
        "summary": "Wayside Technology Group, Inc. operates as a value-added information technology (IT) distribution and solutions company in the United States, Canada, Europe, the United Kingdom, and internationally. It operates in two segments, Distribution and Solutions. The company distributes technical software and hardware to corporate and value added resellers, consultants, and systems integrators under the names Climb Channel Solutions and Sigma Software Distribution; and software, hardware, and services under the names TechXtend and Grey Matter. It also resells computer software and hardware developed by others, as well as provides technical services to end user customers. In addition, the company offers a line of products from various software vendors; and tools for virtualization/cloud computing, security, networking, storage and infrastructure management, application lifecycle management, and other technically sophisticated domains, as well as computer hardware. Wayside Technology Group, Inc. markets its products through its own web sites, local and on-line seminars, events, webinars, and social media, as well as direct email and printed materials. It provides IT distribution and solutions for companies in the security, data management, cloud, connectivity, storage and HCI, virtualization, and software and ALM industries. The company was formerly known as Programmer's Paradise, Inc. and changed its name to Wayside Technology Group, Inc. in August 2006. Wayside Technology Group, Inc. was incorporated in 1982 and is headquartered in Eatontown, New Jersey.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "NJ",
        "city": "Eatontown",
        "zipcode": "07724",
        "website": "http://www.waysidetechnology.com",
        "market_cap": "Micro Cap"
    },
    "SC3.F": {
        "short_name": "SCANSOURCE INC.",
        "long_name": "ScanSource, Inc.",
        "summary": "ScanSource, Inc. distributes technology products and solutions in the United States, Canada, and internationally. It operates in two segments, Worldwide Barcode, Networking & Security; and Worldwide Communications & Services. The Worldwide Barcode, Networking & Security segment offers a portfolio of solutions primarily for enterprise mobile computing, data capture, barcode printing, point of sale (POS), payments, networking, electronic physical security, cyber security, and other technologies. This segment offers data capture and POS solutions to automate the collection, processing, and communication of information for commercial and industrial applications, including retail sales, distribution, shipping, inventory control, materials handling, warehouse management, and health care applications. It also provides electronic physical security products, such as identification, access control, video surveillance, intrusion-related, and wireless and networking infrastructure products. The Worldwide Communications & Services segment offers a portfolio of solutions primarily for communications technologies and services comprising voice, video conferencing, wireless, data networking, cable, unified communications and collaboration, cloud, and technology services, as well as IP networks and other solutions for various vertical markets comprising education, healthcare, and government. The company also provides contact center, and infrastructure services. ScanSource, Inc. was founded in 1992 and is headquartered in Greenville, South Carolina.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "SC",
        "city": "Greenville",
        "zipcode": "29615",
        "website": "http://www.scansource.com",
        "market_cap": "Small Cap"
    },
    "SCSC": {
        "short_name": "ScanSource, Inc.",
        "long_name": "ScanSource, Inc.",
        "summary": "ScanSource, Inc. distributes technology products and solutions in the United States, Canada, and internationally. It operates in two segments, Worldwide Barcode, Networking & Security; and Worldwide Communications & Services. The Worldwide Barcode, Networking & Security segment offers a portfolio of solutions primarily for enterprise mobile computing, data capture, barcode printing, point of sale (POS), payments, networking, electronic physical security, cyber security, and other technologies. This segment offers data capture and POS solutions to automate the collection, processing, and communication of information for commercial and industrial applications, including retail sales, distribution, shipping, inventory control, materials handling, warehouse management, and health care applications. It also provides electronic physical security products, such as identification, access control, video surveillance, intrusion-related, and wireless and networking infrastructure products. The Worldwide Communications & Services segment offers a portfolio of solutions primarily for communications technologies and services comprising voice, video conferencing, wireless, data networking, cable, unified communications and collaboration, cloud, and technology services, as well as IP networks and other solutions for various vertical markets comprising education, healthcare, and government. The company also provides contact center, and infrastructure services. ScanSource, Inc. was founded in 1992 and is headquartered in Greenville, South Carolina.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "SC",
        "city": "Greenville",
        "zipcode": "29615",
        "website": "http://www.scansource.com",
        "market_cap": "Small Cap"
    },
    "SEDN": {
        "short_name": "SED INTERNATIONAL HOLDINGS INC",
        "long_name": "SED International Holdings, Inc.",
        "summary": "SED International Holdings, Inc., together with its subsidiaries, distributes information technology (IT) products and solutions, computer systems, and mobility devices in the United States, Latin America, and the Caribbean. The company primarily offers complete notebook and desktop systems, peripherals and accessories, and components, as well as software and related services. It also provides fulfillment services to e-commerce customers and other resellers; IT product procurement services; and system integration and configuration services. The company sells its products through a sales force and Website to reseller customers in retail, e-commerce, value added resellers, system builders, original equipment manufacturers, and various other reseller channels. SED International Holdings, Inc. was founded in 1980 and is based in Lawrenceville, Georgia. On February 24, 2018, an involuntary petition for liquidation under Chapter 7 was filed against SED International Holdings, Inc. in the U.S. Bankruptcy Court for the Northern District of Georgia. On September 13, 2016, the involuntary petition was approved by the Court and the Chapter 7 petition was converted to Chapter 11 reorganization. The plan was later approved as Chapter 11 liquidation on June 20, 2018.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Lawrenceville",
        "zipcode": "30043",
        "website": null,
        "market_cap": "Nano Cap"
    },
    "SPRS": {
        "short_name": "SURGE COMPONENTS INC",
        "long_name": "Surge Components, Inc.",
        "summary": "Surge Components, Inc., together with its subsidiaries, supplies electronic products and components. It offers capacitors, which are electrical energy storage devices; and discrete components, such as semiconductor rectifiers, transistors, diodes, and circuit protection devices. The company also provides audible components, including audible transducers, buzzers, speakers, microphones, resonators, alarms, chimes, filters, and discriminators, as well as fuses, printed circuit boards, and switches. Its products are used in the electronic circuitry of various products, including automobiles, telecomm, audio, cellular telephones, computers, consumer electronics, garage door openers, household appliances, power supplies, communications, utility meters, and security equipment. The company sells its products to original equipment manufacturers and distributors through independent sales representatives or organizations in the United States, Canada, China, other Asian countries, South America, and Europe. Surge Components, Inc. was incorporated in 1981 and is headquartered in Deer Park, New York.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "Deer Park",
        "zipcode": "11729",
        "website": "http://www.surgecomponents.com",
        "market_cap": "Nano Cap"
    },
    "SRSK": {
        "short_name": "STAR STRUCK",
        "long_name": "Star Struck, Ltd.",
        "summary": "Star Struck, Ltd. distributes tools, supplies, and equipment to the jewelry industry. The company offers gold testers, precision jewelry gauges, microscopes, magnifiers and loupes, diamond and gold scales and weights, plating systems and supplies, engraving systems, ultrasonic cleaners, steam cleaners and ionic jewelry cleaning systems, jewelry findings, anti-tarnish liners, cotton filled boxes, bench tools, rolling mills, watch repair parts, watch battery replacement tools, and other jewelry supplies, as well as jewelry repair envelopes, forms, layaway, and appraisal products. It also provides adhesives, batteries, customized merchandise bags, diamond accessories, diamond meters and filters, displays, glass display domes, engravers, gift accessories, miscellaneous jewelry retail items, money detectors counterfeit and money counters, pliers, polish and protect products, retail pricing products, ring sizing products, jeweler's screwdrivers, soldering aids, tweezers, watch parts and tools, watch tools, watch straps, and welding products. The company also offers products through its online store and online catalog. Star Struck, Ltd. was formerly known as SBM Industries, Inc. and changed its name to Star Struck, Ltd. in May 1993. The company was founded in 1981 and is headquartered in Bethel, Connecticut.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CT",
        "city": "Bethel",
        "zipcode": "06801",
        "website": "http://www.starstruckllc.com",
        "market_cap": "Nano Cap"
    },
    "TAIT": {
        "short_name": "Taitron Components Incorporated",
        "long_name": "Taitron Components Incorporated",
        "summary": "Taitron Components Incorporated engages in the supply of original designed and manufactured (ODM) electronic components, and distribution of brand name electronic components. It distributes discrete semiconductors, commodity integrated circuits, optoelectronic devices, and passive components. The company also provides value-added engineering and turn-key solutions focusing on providing contract electronic manufacturers (CEMs) and original equipment manufacturers (OEMs) with ODM products for their turn-key projects. It serves other electronic distributors, CEMs, and OEMs in the United States, South Korea, China, Taiwan, and internationally. The company has strategic alliances with Teamforce Co. Ltd.; Grand Shine Management Limited; and Zowie Technology Corporation. Taitron Components Incorporated was incorporated in 1989 and is headquartered in Valencia, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Valencia",
        "zipcode": "91355",
        "website": "http://www.taitroncomponents.com",
        "market_cap": "Nano Cap"
    },
    "VNI.F": {
        "short_name": "AVNET INC.  DL 1",
        "long_name": "Avnet, Inc.",
        "summary": "Avnet, Inc., a technology solutions company, markets, sells, and distributes electronic components. The company operates through two segments, Electronic Components and Farnell. The Electronic Components segment markets, sells, and distributes semiconductors; interconnect, passive, and electromechanical devices; and other integrated components from electronic component manufacturers. It also offers design chain support that provides engineers with technical design solutions; engineering and technical resources to support product design, bill of materials development, and technical education and training; and supply chain solutions that provide support and logistical services to original equipment manufacturers, electronic manufacturing service providers, and electronic component manufacturers. In addition, this segment provides integrated solutions, such as technical design, integration, and assembly of embedded products, and systems and solutions primarily for industrial applications, as well as for intelligent embedded and innovative display solutions comprising touch and passive displays. Further, it develops and manufactures standard board and industrial subsystems, and application-specific devices that enable it to produce systems tailored to specific customer requirements. This segment serves various markets, including automotive, medical, defense, aerospace, telecommunications, industrial, and digital editing. The Farnell segment distributes kits, tools, and electronic and industrial automation components, as well as test and measurement products to engineers and entrepreneurs. It has operations in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Avnet, Inc. was founded in 1921 and is headquartered in Phoenix, Arizona.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "state": "AZ",
        "city": "Phoenix",
        "zipcode": "85034",
        "website": "http://www.avnet.com",
        "market_cap": "Mid Cap"
    },
    "WSTG": {
        "short_name": "Wayside Technology Group, Inc.",
        "long_name": "Wayside Technology Group, Inc.",
        "summary": "Wayside Technology Group, Inc. operates as a value-added information technology (IT) distribution and solutions company in the United States, Canada, Europe, the United Kingdom, and internationally. It operates in two segments, Distribution and Solutions. The company distributes technical software and hardware to corporate and value added resellers, consultants, and systems integrators under the names Climb Channel Solutions and Sigma Software Distribution; and software, hardware, and services under the names TechXtend and Grey Matter. It also resells computer software and hardware developed by others, as well as provides technical services to end user customers. In addition, the company offers a line of products from various software vendors; and tools for virtualization/cloud computing, security, networking, storage and infrastructure management, application lifecycle management, and other technically sophisticated domains, as well as computer hardware. Wayside Technology Group, Inc. markets its products through its own web sites, local and on-line seminars, events, webinars, and social media, as well as direct email and printed materials. It provides IT distribution and solutions for companies in the security, data management, cloud, connectivity, storage and HCI, virtualization, and software and ALM industries. The company was formerly known as Programmer's Paradise, Inc. and changed its name to Wayside Technology Group, Inc. in August 2006. Wayside Technology Group, Inc. was incorporated in 1982 and is headquartered in Eatontown, New Jersey.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "state": "NJ",
        "city": "Eatontown",
        "zipcode": "07724",
        "website": "http://www.waysidetechnology.com",
        "market_cap": "Micro Cap"
    },
    "ZNCM": {
        "short_name": "ZUNICOM INC",
        "long_name": "Zunicom, Inc.",
        "summary": "Zunicom, Inc., through its wholly-owned subsidiary, AlphaNet Hospitality Systems, Inc., operates as a reseller of point-of-sale software and hardware to restaurants in southern Connecticut, Westchester county, New York, and New York city. The company sells and installs Restaurant Manager, a point-of-sale restaurant software solution for small and mid-size restaurants, including family, fine dining, and table service restaurants; quick service restaurants; and pizza delivery and take-out establishments, as well as bars and clubs. It also provides support services for the system; sells accessories and supplies to customers using the system; and installs software upgrades. Zunicom, Inc. was founded in 1968 and is headquartered in Dallas, Texas.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75209",
        "website": null,
        "market_cap": "Nano Cap"
    }
}