{"A1PH34.SA": {"short_name": "AMPHENOL CORDRN", "long_name": "Amphenol Corporation", "summary": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates in two segments, Interconnect Products and Assemblies, and Cable Products and Solutions. The Interconnect Products and Assemblies segment offers connector and connector systems, including fiber optic, harsh environment, high-speed, and radio frequency interconnect products, as well as antennas; power interconnect products, busbars, and distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; and other products comprising antennas, flexible and rigid printed circuit boards, hinges, molded parts, production-related products, sensors and sensor-based products, and switches. The Cable Products and Solutions segment offers coaxial, power, and specialty cables; cable assemblies; and components, which include combiner/splitter products, connector and connector systems, and fiber optic components. The company sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation has a partnership with PPC Broadband, Inc. in the home networking field. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.", "currency": "BRL", "sector": "Technology", "industry": "Electronic Components", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Wallingford"}, "AHAG": {"short_name": "ALPHA TECHNOLOGIES GROUP INC", "long_name": "Alpha Technologies Group, Inc.", "summary": "Alpha Technologies Group, Inc., through its subsidiaries, manufactures, fabricates, and sells thermal management and non-thermal fabricated products, and aluminum extrusions in the United States. It offers natural convection products, which include thermal extrusions, board level and BGA heatsinks, LED heat sinks, folded fins, bonded and stacked fins, and heat frames; forced convection products, such as skived and zipper fins, and fans; fluid phase change products, including heat pipes; and liquid cooling products, such as liquid cold plates, heat exchangers, and coolant distribution units. The company also provides accessories, such as wedgelocks, front panels, enclosures, precision clamps, thermal interface material, and data center cooling accessories; and universal joints, which include alves blue blocks, solid blocks, hex blocks, double universal joints, needle bearings, and universal joint accessories. In addition, it offers engineering, such as applications engineering and design services; manufacturing, which include extrusion, fabrication, machining services, and quick turn prototyping; supply chain services; and data center cooling services. It serves aerospace/defense, architecture, power conversion, information tech, renewable energy, telecommunications, led lighting, factory automation, consumer, medical, and transportation industries; and construction, sporting goods, and other leisure activity markets. Alpha Technologies Group, Inc. was formerly known as Synercom Technology, Inc. and changed its name to Alpha Technologies Group, Inc. in 1995. The company was founded in 1969 and is based in Los Angeles, California. It has manufacturing locations in Paramount and Temecula, California; and Fall River, Massachusetts. The company has facilities in Withee, Wisconsin; Taipei, Taiwan; Cary, North Carolina; and Dong Guan, China.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Los Angeles"}, "ALPE": {"short_name": "ALPHA-EN CORPORATION", "long_name": "alpha-En Corporation", "summary": "alpha-En Corporation, a development stage company, focuses on developing technologies for manufacturing lithium metal for use in lightweight and high energy density batteries; and battery components and compounds of lithium. The company was formerly known as Avenue Entertainment Group, Inc. and changed its name to alpha-En Corporation in July 2008. alpha-En Corporation was founded in 1969 and is based in Yonkers, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Yonkers"}, "ALPP": {"short_name": "ALPINE 4 TECHNOLOGIES LTD", "long_name": "Alpine 4 Technologies, Ltd.", "summary": "Alpine 4 Technologies, Ltd., a technology holding company, provides electronic contract manufacturing solutions in the United States. The company also offers automotive technologies, including 6th Sense Auto, a connected car technology that provides various advantages to management, sales, finance, and service departments in the automotive dealership industry to enhance productivity, profitability, and customer retention; and BrakeActive, a safety device that enhances vehicle's third brake light's ability to reduce or prevent a rear end collision. In addition, it provides fabricated metal parts, assemblies, and sub-assemblies to original equipment manufacturers; and designs, fabricates, and installs dust collectors, commercial ductwork, kitchen hoods, industrial ventilation systems, machine guards, architectural work, water furnaces, and others, as well as specialized spiral duct work. The company was formerly known as Alpine 4 Automotive Technologies Ltd. and changed its name to Alpine 4 Technologies Ltd. in June 2015. Alpine 4 Technologies, Ltd. was founded in 2014 and is based in Phoenix, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Phoenix"}, "AMOT": {"short_name": "Allied Motion Technologies, Inc", "long_name": "Allied Motion Technologies Inc.", "summary": "Allied Motion Technologies Inc., together with its subsidiaries, designs, manufactures, and sells precision and specialty controlled motion components and systems that are used in a range of industries worldwide. It provides automotive brushless (BL) DC motors, power steering solutions, and special purpose motors; fractional horsepower permanent magnet DC and BLDC motors serving a range of original equipment applications; and high performance BLDC motors, including servo motors, frameless motors, torque motors, slot less motors, high resolution encoders, and motor/encoder assemblies. The company also offers gearing solutions in stand-alone and integrated gearing/motor configurations; advanced electronic motion control products and custom solutions, such as integrated power electronics, digital controls, and network communications for motor control and power conversion; and steering system components. In addition, it provides fractional horsepower BLDC outer rotor motors and traditional BLDC motor part sets; synchronous BLDC servo motor solutions and asynchronous BLDC motors; trolleys for use in medical environments; and active and passive products to monitor and resolve power quality and harmonic distortion issues, as well as electronic controls and platform based integrated steering system solutions. The company sells its products to end customers and original equipment manufacturers in vehicle, medical, aerospace and defense, and industrial markets through direct sales force, as well as authorized manufacturers' representatives, agents, and distributors. Allied Motion Technologies Inc. was founded in 1962 and is headquartered in Amherst, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Amherst"}, "APH": {"short_name": "Amphenol Corporation", "long_name": "Amphenol Corporation", "summary": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates in two segments, Interconnect Products and Assemblies, and Cable Products and Solutions. The Interconnect Products and Assemblies segment offers connector and connector systems, including fiber optic, harsh environment, high-speed, and radio frequency interconnect products, as well as antennas; power interconnect products, busbars, and distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; and other products comprising antennas, flexible and rigid printed circuit boards, hinges, molded parts, production-related products, sensors and sensor-based products, and switches. The Cable Products and Solutions segment offers coaxial, power, and specialty cables; cable assemblies; and components, which include combiner/splitter products, connector and connector systems, and fiber optic components. The company sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation has a partnership with PPC Broadband, Inc. in the home networking field. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Wallingford"}, "APH.MX": {"short_name": "AMPHENOL CORP", "long_name": "Amphenol Corporation", "summary": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates in two segments, Interconnect Products and Assemblies, and Cable Products and Solutions. The Interconnect Products and Assemblies segment offers connector and connector systems, including fiber optic, harsh environment, high-speed, and radio frequency interconnect products, as well as antennas; power interconnect products, busbars, and distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; and other products comprising antennas, flexible and rigid printed circuit boards, hinges, molded parts, production-related products, sensors and sensor-based products, and switches. The Cable Products and Solutions segment offers coaxial, power, and specialty cables; cable assemblies; and components, which include combiner/splitter products, connector and connector systems, and fiber optic components. The company sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation has a partnership with PPC Broadband, Inc. in the home networking field. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.", "currency": "MXN", "sector": "Technology", "industry": "Electronic Components", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Wallingford"}, "BELFA": {"short_name": "Bel Fuse Inc.", "long_name": "Bel Fuse Inc.", "summary": "Bel Fuse Inc. designs, manufactures, markets, and sells products that are used in the networking, telecommunication, high-speed data transmission, commercial aerospace, military, broadcasting, transportation, and consumer electronic industries in the United States, Macao, the United Kingdom, Slovakia, Germany, Switzerland, and internationally. It offers magnetic products, such as integrated connector modules; power transformers; SMD power inductors and SMPS transformers; and telecom discrete components. The company also provides power solutions and protection products comprising front-end power supplies; board-mount power products; industrial power products; external power products; module products; and circuit protection products. In addition, it offers connectivity solutions, which includes expanded beam fiber optic connectors, cable assemblies, and active optical devices; copper-based connectors/cable assemblies; radio frequency connectors, cable assemblies, microwave devices, and low loss cables; and RJ and USB connectors, and cable assemblies. The company sells its products under the Bel, TRP Connector, MagJack, Signal, Bel Power Solutions, Melcher, CUI, Stratos, Fibreco, Cinch, Johnson, Trompeter, Midwest Microwave, Semflex, and Stewart Connector brands through direct strategic account managers, regional sales managers working with independent sales representative organizations, and authorized distributors. Bel Fuse Inc. was founded in 1949 and is headquartered in Jersey City, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Jersey City"}, "BELFB": {"short_name": "Bel Fuse Inc.", "long_name": "Bel Fuse Inc.", "summary": "Bel Fuse Inc. designs, manufactures, markets, and sells products that are used in the networking, telecommunication, high-speed data transmission, commercial aerospace, military, broadcasting, transportation, and consumer electronic industries in the United States, Macao, the United Kingdom, Slovakia, Germany, Switzerland, and internationally. It offers magnetic products, such as integrated connector modules; power transformers; SMD power inductors and SMPS transformers; and telecom discrete components. The company also provides power solutions and protection products comprising front-end power supplies; board-mount power products; industrial power products; external power products; module products; and circuit protection products. In addition, it offers connectivity solutions, which includes expanded beam fiber optic connectors, cable assemblies, and active optical devices; copper-based connectors/cable assemblies; radio frequency connectors, cable assemblies, microwave devices, and low loss cables; and RJ and USB connectors, and cable assemblies. The company sells its products under the Bel, TRP Connector, MagJack, Signal, Bel Power Solutions, Melcher, CUI, Stratos, Fibreco, Cinch, Johnson, Trompeter, Midwest Microwave, Semflex, and Stewart Connector brands through direct strategic account managers, regional sales managers working with independent sales representative organizations, and authorized distributors. Bel Fuse Inc. was founded in 1949 and is headquartered in Jersey City, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Jersey City"}, "BHE": {"short_name": "Benchmark Electronics, Inc.", "long_name": "Benchmark Electronics, Inc.", "summary": "Benchmark Electronics, Inc., together with its subsidiaries, provides product design, engineering services, technology solutions, and advanced manufacturing services in the Americas, Asia, and Europe. The company offers engineering services and technology solutions, including new product design, prototype, testing, and related engineering services; and custom testing, and automation equipment design and build services. It also provides electronics manufacturing and testing services, such as printed circuit board assembly and test solutions, assembly of subsystems, circuitry and functionality testing of printed assemblies, environmental and stress testing, and component reliability testing; component engineering services; manufacturing defect analysis, in-circuit testing, functional testing, life cycle testing services, and environmental stress tests of assemblies of boards or systems; and failure analysis. In addition, the company offers precision machining and electromechanical assembly services; and subsystem and system integration services, including assembly, configuration, and testing services for various industries. Further, it provides value-added support systems; supply chain management solutions; direct order fulfillment; and aftermarket non-warranty services, including repair, replacement, refurbishment, remanufacturing, exchange, systems upgrade, and spare parts manufacturing throughout a product's life cycle. The company serves original equipment manufacturers in the aerospace and defense, medical technologies, complex industrials, test and instrumentation, telecommunications, and high-end computing industries. Benchmark Electronics, Inc. sells its products primarily through direct sales force. The company was formerly known as Electronics, Inc. Benchmark Electronics, Inc. was founded in 1979 and is headquartered in Tempe, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Tempe"}, "BMU.F": {"short_name": "BENCHMARK EL. INC. DL-,10", "long_name": "Benchmark Electronics, Inc.", "summary": "Benchmark Electronics, Inc., together with its subsidiaries, provides product design, engineering services, technology solutions, and advanced manufacturing services in the Americas, Asia, and Europe. The company offers engineering services and technology solutions, including new product design, prototype, testing, and related engineering services; and custom testing, and automation equipment design and build services. It also provides electronics manufacturing and testing services, such as printed circuit board assembly and test solutions, assembly of subsystems, circuitry and functionality testing of printed assemblies, environmental and stress testing, and component reliability testing; component engineering services; manufacturing defect analysis, in-circuit testing, functional testing, life cycle testing services, and environmental stress tests of assemblies of boards or systems; and failure analysis. In addition, the company offers precision machining and electromechanical assembly services; and subsystem and system integration services, including assembly, configuration, and testing services for various industries. Further, it provides value-added support systems; supply chain management solutions; direct order fulfillment; and aftermarket non-warranty services, including repair, replacement, refurbishment, remanufacturing, exchange, systems upgrade, and spare parts manufacturing throughout a product's life cycle. The company serves original equipment manufacturers in the aerospace and defense, medical technologies, complex industrials, test and instrumentation, telecommunications, and high-end computing industries. Benchmark Electronics, Inc. sells its products primarily through direct sales force. The company was formerly known as Electronics, Inc. Benchmark Electronics, Inc. was founded in 1979 and is headquartered in Tempe, Arizona.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Tempe"}, "CPSH": {"short_name": "CPS Technologies Corp.", "long_name": "CPS Technologies Corporation", "summary": "CPS Technologies Corporation produces and sells advanced material solutions to the transportation, automotive, energy, computing/internet, telecommunication, aerospace, defense, and oil and gas markets. Its products are used in applications that involve energy use or energy generation. The company primarily offers metal matrix composites that are a combination of metal and ceramic, such as baseplates for various applications, including motor controllers used in electric trains, subway cars, wind turbines, and hybrid and electric vehicles; baseplates and housings for use in radar, satellite, and avionics applications, as well as in modules built with wide band gap semiconductors; and lids and heatspreaders used with integrated circuits for use in internet switches and routers. It also assembles housings and packages for hybrid circuits. CPS Technologies Corporation primarily sells its products to microelectronics systems companies in the United States, Europe, and Asia. The company was formerly known as Ceramics Process Systems Corporation and changed its name to CPS Technologies Corporation in March 2007. CPS Technologies Corporation was founded in 1984 and is headquartered in Norton, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Norton"}, "CPWY": {"short_name": "CLEAN ENERGY PATHWAYS INC", "long_name": "Clean Energy Pathways, Inc.", "summary": "Clean Energy Pathways, Inc. operates as a multifaceted development-stage alternative energy company. It focuses on developing fossil fuel replacements utilizing clean burning biomass fuel, solar photo voltaic panels for power generation, and solar thermal application for heating water in commercial and residential applications; and LED lighting replacements for high energy and heat producing incandescent and mercury vapor lighting. It is also working to develop carbon neutral organic fertilizers. The company was formerly known as XcelPlus Global Holdings, Inc. and changed its name to Clean Energy Pathways, Inc. in August 2010. Clean Energy Pathways, Inc. is based in Buffalo, Wyoming.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Buffalo"}, "CSLI": {"short_name": "CRITICAL SOLUTIONS INC", "long_name": "Critical Solutions, Inc.", "summary": "Critical Solutions, Inc., through its subsidiary, White Door, Inc., manufactures and sells alternate powered systems in the United States. The company's alternate powered systems utilize solar panels, wind turbines, and hydrogen fuel cells to power physical security and communication requirements for areas where power is difficult to obtain, or where conventional power means are expensive to deploy. Its products are used by defense contractors to secure nuclear power plants, by the Federal Bureau of Prisons for emergency response teams, and the U.S. airports for emergency communication and ground surveillance. The company was incorporated in 2008 and is headquartered in Ashburn, Virginia. On June 4, 2013, an involuntary petition for liquidation under Chapter 7 was filed against Critical Solutions, Inc., in the U.S. Bankruptcy Court for the Eastern District of Virginia. July 1, 2013, the involuntary petition was approved by the Court. Critical Solutions, Inc. is in liquidation.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Ashburn"}, "CTS": {"short_name": "CTS Corporation", "long_name": "CTS Corporation", "summary": "CTS Corporation designs, manufactures, and sells sensors, electronic components, and actuators primarily to original equipment manufacturers and tier one suppliers for the aerospace and defense, industrial, information technology, medical, telecommunications, and transportation markets. It offers sensors and actuators for use in passenger or commercial vehicles; electronic components for use in telecommunications infrastructure, information technology and other high-speed applications, switches, and potentiometers; and fabricated piezoelectric materials and substrates for use primarily in medical, industrial, aerospace and defense, and information technology markets. The company sells and markets its products through its sales engineers, independent manufacturers' representatives, and distributors in the United States, Singapore, Taiwan, China, the Czech Republic, and internationally. CTS Corporation was founded in 1896 and is headquartered in Lisle, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Lisle"}, "DAIO": {"short_name": "Data I/O Corporation", "long_name": "Data I/O Corporation", "summary": "Data I/O Corporation designs, manufactures, and sells programming and security deployment systems and services for electronic device manufacturers in the United States, Europe, and internationally. Its programming system products are used to program integrated circuits (ICs) with the specific data necessary for the ICs. The company provides PSV handlers offline automated programming systems; and RoadRunner and RoadRunner3 series handlers, an in-line automated programming systems. It also offers SentriX, a security provisioning system; LumenX Programmer; non-automated FlashPAK III programming systems; and Unifamily programmers, an offline engineering non-automated systems. In addition, the company provides hardware support, system installation and repair, and device programming services. It markets and sells its products to original equipment manufacturers in automotive and consumer electronics, Internet of Things and their programming center partners, and electronic manufacturing service contract manufacturers through direct sales, internal telesales, and indirect sales representatives and distributors. Data I/O Corporation was incorporated in 1969 and is headquartered in Redmond, Washington.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Redmond"}, "FCGN": {"short_name": "FCG INC", "long_name": "FCG Inc.", "summary": "FCG Inc., doing business as Flexible Circuits, Inc., designs and manufactures flexible circuit boards and assemblies for the aerospace and military electronics markets. It offers strike weapons. The company was incorporated in 1963 and is based in Warrington, Pennsylvania.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Warrington"}, "GLW": {"short_name": "Corning Incorporated", "long_name": "Corning Incorporated", "summary": "Corning Incorporated engages in display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses worldwide. The company's Display Technologies segment offers glass substrates for organic light-emitting diodes and liquid crystal displays used in televisions, notebook computers, and flat panel desktop monitors. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, including cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for various carrier network applications. This segment also offers operator-grade distributed antenna systems; optical network evolution wireless platform; subscriber demarcation, connection and protection devices, various digital subscriber line passive solutions, and outside plant enclosures; and coaxial RF interconnects for the cable television industry and microwave applications. The company's Environmental Technologies segment offers ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. Its Specialty Materials segment manufactures products that provide material formulations for glass, glass ceramics, and fluoride crystals. The company's Life Sciences segment offers laboratory products comprising consumables, such as plastic vessels, specialty surfaces, cell culture media, and serum, as well as general labware and equipment under the Corning, Falcon, Pyrex, and Axygen brands. It also offers pharmaceutical glass tubing and packages. Corning Incorporated has a strategic collaboration with Intel Corporation to accelerate the availability of 5G in buildings; and collaboration with Pixelligent. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Corning"}, "GLW.F": {"short_name": "CORNING INC.  DL -,50", "long_name": "Corning Incorporated", "summary": "Corning Incorporated engages in display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses worldwide. The company's Display Technologies segment offers glass substrates for organic light-emitting diodes and liquid crystal displays used in televisions, notebook computers, and flat panel desktop monitors. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, including cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for various carrier network applications. This segment also offers operator-grade distributed antenna systems; optical network evolution wireless platform; subscriber demarcation, connection and protection devices, various digital subscriber line passive solutions, and outside plant enclosures; and coaxial RF interconnects for the cable television industry and microwave applications. The company's Environmental Technologies segment offers ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. Its Specialty Materials segment manufactures products that provide material formulations for glass, glass ceramics, and fluoride crystals. The company's Life Sciences segment offers laboratory products comprising consumables, such as plastic vessels, specialty surfaces, cell culture media, and serum, as well as general labware and equipment under the Corning, Falcon, Pyrex, and Axygen brands. It also offers pharmaceutical glass tubing and packages. Corning Incorporated has a strategic collaboration with Intel Corporation to accelerate the availability of 5G in buildings; and collaboration with Pixelligent. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Corning"}, "GLW.MX": {"short_name": "CORNING INC", "long_name": "Corning Incorporated", "summary": "Corning Incorporated engages in display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses worldwide. The company's Display Technologies segment offers glass substrates for organic light-emitting diodes and liquid crystal displays used in televisions, notebook computers, and flat panel desktop monitors. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, including cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for various carrier network applications. This segment also offers operator-grade distributed antenna systems; optical network evolution wireless platform; subscriber demarcation, connection and protection devices, various digital subscriber line passive solutions, and outside plant enclosures; and coaxial RF interconnects for the cable television industry and microwave applications. The company's Environmental Technologies segment offers ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. Its Specialty Materials segment manufactures products that provide material formulations for glass, glass ceramics, and fluoride crystals. The company's Life Sciences segment offers laboratory products comprising consumables, such as plastic vessels, specialty surfaces, cell culture media, and serum, as well as general labware and equipment under the Corning, Falcon, Pyrex, and Axygen brands. It also offers pharmaceutical glass tubing and packages. Corning Incorporated has a strategic collaboration with Intel Corporation to accelerate the availability of 5G in buildings; and collaboration with Pixelligent. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.", "currency": "MXN", "sector": "Technology", "industry": "Electronic Components", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Corning"}, "HOKUQ": {"short_name": "HOKU CORP", "long_name": "Hoku Corporation", "summary": "Hoku Corporation operates as a solar energy products and services company primarily in the United States. It focuses on manufacturing polysilicon, a primary material used in the manufacture of photovoltaic (PV) modules; and designing, engineering, and installing turnkey PV systems and related services in Hawaii using solar modules purchased from third-party suppliers. The company was formerly known as Hoku Scientific, Inc. and changed its name to Hoku Corporation in March 2010. Hoku Corporation was incorporated in 2001 and is headquartered in Honolulu, Hawaii. On July 2, 2013, Hoku Corporation along with its affiliates filed a voluntary petition for liquidation under Chapter 7 in the U.S. Bankruptcy Court for the District of Idaho.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Honolulu"}, "HWY.F": {"short_name": "ALLIED MOTION TECHS DL-01", "long_name": "Allied Motion Technologies Inc.", "summary": "Allied Motion Technologies Inc., together with its subsidiaries, designs, manufactures, and sells precision and specialty controlled motion components and systems that are used in a range of industries worldwide. It provides automotive brushless (BL) DC motors, power steering solutions, and special purpose motors; fractional horsepower permanent magnet DC and BLDC motors serving a range of original equipment applications; and high performance BLDC motors, including servo motors, frameless motors, torque motors, slot less motors, high resolution encoders, and motor/encoder assemblies. The company also offers gearing solutions in stand-alone and integrated gearing/motor configurations; advanced electronic motion control products and custom solutions, such as integrated power electronics, digital controls, and network communications for motor control and power conversion; and steering system components. In addition, it provides fractional horsepower BLDC outer rotor motors and traditional BLDC motor part sets; synchronous BLDC servo motor solutions and asynchronous BLDC motors; trolleys for use in medical environments; and active and passive products to monitor and resolve power quality and harmonic distortion issues, as well as electronic controls and platform based integrated steering system solutions. The company sells its products to end customers and original equipment manufacturers in vehicle, medical, aerospace and defense, and industrial markets through direct sales force, as well as authorized manufacturers' representatives, agents, and distributors. Allied Motion Technologies Inc. was founded in 1962 and is headquartered in Amherst, New York.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Amherst"}, "IEC": {"short_name": "IEC Electronics Corp.", "long_name": "IEC Electronics Corp.", "summary": "IEC Electronics Corp., together with its subsidiaries, provides electronic manufacturing services in the United States. It specializes in delivering technical solutions for the custom manufacturing, product configuration, and verification testing of engineered complex products that require a level of manufacturing. The company manufactures a range of assemblies that are incorporated into various products, such as aerospace and defense systems, medical devices, industrial equipment, and transportation products. It serves medical, industrial, aerospace, and defense sectors through a direct sales force, as well as through a network of manufacturer's representatives. The company was founded in 1966 and is headquartered in Newark, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Newark"}, "IEHC": {"short_name": "IEH CORP", "long_name": "IEH Corporation", "summary": "IEH Corporation designs, develops, manufactures, and sells printed circuit board connectors and custom interconnects for high performance applications in the United States and internationally. The company's products are used as basic components of larger assemblies of finished goods. It markets its products directly to original equipment manufacturers, as well as through authorized representatives and distributors primarily to military, aerospace, medical, industrial, test equipment, space, and commercial electronic markets. The company was formerly known as Industrial Heat Treating Company, Inc. and changed its name to IEH Corporation in March 1989. IEH Corporation was founded in 1941 and is based in Brooklyn, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Brooklyn"}, "INRD": {"short_name": "INRAD OPTICS INC", "long_name": "Inrad Optics, Inc.", "summary": "Inrad Optics, Inc., together with its subsidiaries, develops, manufactures, and markets crystal-based optical components and devices, custom optical components, and precision optical and opto-mechanical assemblies in the United States. The company provides optical components, optical coatings, and subassemblies for the military, aerospace, industrial, and medical marketplace; precision metal optics; and UV filter optical components for use in critical applications in defense systems, such as missile warning sensors, as well as opto-mechanical design and assembly services. Its optical components include planar, prismatic, and spherical components fabricated from glass and synthetic crystals comprising mirrors, lenses, prisms, wave plates, polarizing optics, X-ray monochromators and mirrors, and cavity optics for lasers. The company also offers laser devices and instrumentation products comprising electro-optic and nonlinear crystal devices for altering the intensity, polarization, or wavelength of a laser beam, as well as other crystal components for use in laser research, in commercial laser systems, and in detection of fast neutrons; and pockels' cells and associated electronics. It serves corporations in the defense, aerospace, laser system, process control, and metrology sectors of the photonics industry, as well as the United States Government, national laboratories, and universities. The company markets its products through sales, marketing, and customer service teams, as well as through independent sales agents. Inrad Optics, Inc. also exports its products Europe, Israel, and Asia. The company was formerly known as Photonic Products Group, Inc. and changed its name to Inrad Optics, Inc. in 2012. Inrad Optics, Inc. was founded in 1973 and is based in Northvale, New Jersey.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Northvale"}, "JBL": {"short_name": "Jabil Inc.", "long_name": "Jabil Inc.", "summary": "Jabil Inc. provides manufacturing services and solutions worldwide. The company operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. It offers electronics design, production, and product management services. The company provides electronic circuit design services, such as application-specific integrated circuit design, firmware development and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also specializes in the three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as offers various industrial design, advance mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, and PCBA design validation and verification services; and other consulting services, including the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution manufacturing development services. Additionally, the company offers systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves automotive and transportation, capital equipment, cloud, computing and storage, defense and aerospace, industrial and energy, networking and telecommunications, print and retail, and smart home and appliances, as well as edge devices and accessories, healthcare, mobility, and packaging industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Saint Petersburg"}, "JBL.F": {"short_name": "JABIL DL-,001", "long_name": "Jabil Inc.", "summary": "Jabil Inc. provides manufacturing services and solutions worldwide. The company operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. It offers electronics design, production, and product management services. The company provides electronic circuit design services, such as application-specific integrated circuit design, firmware development and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also specializes in the three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as offers various industrial design, advance mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, and PCBA design validation and verification services; and other consulting services, including the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution manufacturing development services. Additionally, the company offers systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves automotive and transportation, capital equipment, cloud, computing and storage, defense and aerospace, industrial and energy, networking and telecommunications, print and retail, and smart home and appliances, as well as edge devices and accessories, healthcare, mobility, and packaging industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Saint Petersburg"}, "KOC.F": {"short_name": "KOPIN CORP.  DL-,01", "long_name": "Kopin Corporation", "summary": "Kopin Corporation invents, develops, manufactures, and sells components, subassemblies, head-worn, and hand-held systems in the United States, the Asia-Pacific, Europe, and internationally. It offers miniature active-matrix liquid crystal displays, liquid crystal on silicon displays/spatial light modulators, organic light emitting diode displays, application specific integrated circuits, backlights, and optical lenses; and headset systems. The company's products are used in soldier, avionic, and military armored vehicle applications; 3D optical inspection systems; industrial, public safety, and consumer augmented and virtual reality wearable headsets; and training and simulation military applications. Kopin Corporation was founded in 1984 and is headquartered in Westborough, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Westborough"}, "KOPN": {"short_name": "Kopin Corporation", "long_name": "Kopin Corporation", "summary": "Kopin Corporation invents, develops, manufactures, and sells components, subassemblies, head-worn, and hand-held systems in the United States, the Asia-Pacific, Europe, and internationally. It offers miniature active-matrix liquid crystal displays, liquid crystal on silicon displays/spatial light modulators, organic light emitting diode displays, application specific integrated circuits, backlights, and optical lenses; and headset systems. The company's products are used in soldier, avionic, and military armored vehicle applications; 3D optical inspection systems; industrial, public safety, and consumer augmented and virtual reality wearable headsets; and training and simulation military applications. Kopin Corporation was founded in 1984 and is headquartered in Westborough, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Westborough"}, "KULR": {"short_name": "KULR TECHNOLOGY GROUP INC", "long_name": "KULR Technology Group, Inc.", "summary": "KULR Technology Group, Inc., through its subsidiary, KULR Technology Corporation, develops and commercializes thermal management technologies for electronics, batteries, and other components applications in the United States. The company offers lithium-ion battery thermal runaway shields; fiber thermal interface materials; phase change material heatsinks; HYDRA TRS battery storage bags; internal short circuit device; and CRUX cathodes. Its technologies are used in electric vehicles and autonomous driving systems, artificial intelligence and cloud computing, and energy storage and 5G communication technologies. The company serves electrical transportation, 5G mobile computing, cloud computing, and space exploration and communications markets. The company was formerly known as KT High-Tech Marketing Inc. and changed its name to KULR Technology Group, Inc. in August 2018. KULR Technology Group, Inc. was founded in 2013 and is based in Campbell, California.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Campbell"}, "LFS.F": {"short_name": "LITTELFUSE INC.  DL-,01", "long_name": "Littelfuse, Inc.", "summary": "Littelfuse, Inc. manufactures and sells circuit protection, power control, and sensing products in the Asia-Pacific, the Americas, and Europe. The company's Electronics segment offers fuses and fuse accessories, positive temperature coefficient resettable fuses, solid state relays, polymer electrostatic discharge suppressors, varistors, magnetic sensing products, gas discharge tubes, and position, fluid, and temperature sensors; and discrete transient voltage suppressor (TVS) diodes, TVS diode arrays, protection and switching thyristors, metal-oxide-semiconductor field-effect transistors, integrated circuits, silicon carbide diodes, and insulated gate bipolar transistors. This segment markets its products to industrial and automotive electronics, electric vehicle and related infrastructure, data and telecommunications, medical devices, alternative energy, consumer electronics, and white goods markets. Its Automotive segment provides blade fuses, battery cable protectors, resettable fuses, and high-current and high-voltage fuses for hybrid and electric vehicles; fuses, switches, relays, and power distribution modules for the commercial vehicle industry; and automotive sensor products to monitor the passenger occupants. This segment serves original equipment manufacturers, Tier-I suppliers, and parts distributors in the passenger car, heavy duty truck, off-road vehicles, material handling, agricultural, construction, and other commercial vehicle end markets. The company's Industrial segment offers power fuses and holders, protection relays and controls, and other circuit protection products for use in oil, gas, mining, alternative energy, electric vehicle infrastructure, non-residential construction, HVAC systems, elevator, and other industrial equipment applications. It sells its products through distributors, direct sales force, and manufacturers' representatives. Littelfuse, Inc. was founded in 1927 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Chicago"}, "LFUS": {"short_name": "Littelfuse, Inc.", "long_name": "Littelfuse, Inc.", "summary": "Littelfuse, Inc. manufactures and sells circuit protection, power control, and sensing products in the Asia-Pacific, the Americas, and Europe. The company's Electronics segment offers fuses and fuse accessories, positive temperature coefficient resettable fuses, solid state relays, polymer electrostatic discharge suppressors, varistors, magnetic sensing products, gas discharge tubes, and position, fluid, and temperature sensors; and discrete transient voltage suppressor (TVS) diodes, TVS diode arrays, protection and switching thyristors, metal-oxide-semiconductor field-effect transistors, integrated circuits, silicon carbide diodes, and insulated gate bipolar transistors. This segment markets its products to industrial and automotive electronics, electric vehicle and related infrastructure, data and telecommunications, medical devices, alternative energy, consumer electronics, and white goods markets. Its Automotive segment provides blade fuses, battery cable protectors, resettable fuses, and high-current and high-voltage fuses for hybrid and electric vehicles; fuses, switches, relays, and power distribution modules for the commercial vehicle industry; and automotive sensor products to monitor the passenger occupants. This segment serves original equipment manufacturers, Tier-I suppliers, and parts distributors in the passenger car, heavy duty truck, off-road vehicles, material handling, agricultural, construction, and other commercial vehicle end markets. The company's Industrial segment offers power fuses and holders, protection relays and controls, and other circuit protection products for use in oil, gas, mining, alternative energy, electric vehicle infrastructure, non-residential construction, HVAC systems, elevator, and other industrial equipment applications. It sells its products through distributors, direct sales force, and manufacturers' representatives. Littelfuse, Inc. was founded in 1927 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Chicago"}, "LGL": {"short_name": "LGL Group, Inc. (The)", "long_name": "The LGL Group, Inc.", "summary": "The LGL Group, Inc., together with its subsidiaries, engages in the design, manufacture, and marketing of frequency and spectrum control products in the United States and internationally. The company operates in two segments, Electronic Components and Electronic Instruments. The Electronic Components segment offers XTAL, clock oscillators, VCXO, TCXO OCXO, and DOCXO devices; and radio frequency, microwave and millimeter wave filters, diplexers, and solid-state power amplifiers. It also provides filter devices, which includes crystal, ceramic, LC, tubular, combline, cavity, interdigital, and metal insert waveguide, as well as digital, analog and mechanical tunable filters, switched filter arrays, and RF subsystems. This segment's products are used in infrastructure equipment for the telecommunications and network equipment industries; and electronic systems for applications in defense, aerospace, earth-orbiting satellites, down-hole drilling, medical devices, instrumentation, industrial devices, and global positioning systems. The Electronic Instruments segment designs and manufactures frequency and time reference standards, distribution amplifiers, redundancy auto switches, and NTP servers for timing and synchronization in various applications. Its products are used in computer networking, satellite earth stations, electric utilities, broadcasting, and telecommunication systems. The company was formerly known as Lynch Corporation and changed its name to The LGL Group, Inc. The LGL Group, Inc. was founded in 1917 and is based in Orlando, Florida.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "ASE", "market": "us_market", "country": "United States", "city": "Orlando"}, "LINK": {"short_name": "INTERLINK ELECTRONICS INC", "long_name": "Interlink Electronics, Inc.", "summary": "Interlink Electronics, Inc., together with its subsidiaries, designs, develops, manufactures, and sells force-sensing technologies that incorporate proprietary materials technology, and firmware and software products and custom solutions. Its products comprise sensor components, subassemblies, and modules that support cursor control and novel three dimensional user inputs. The company also provides force-sensing resistor sensors; force sensing linear potentiometers for menu navigation and control; and integrated mouse modules and pointing solutions to various electronic devices. In addition, it offers human machine interface technology platforms for various applications, including vehicle entry, vehicle multi-media control interface, rugged touch controls, presence detection, collision detection, speed and torque controls, biological monitoring, and others. The company serves multi-national and start-up companies, design houses, original design manufacturers, original equipment manufacturers, and universities in various markets, such as consumer electronics, automotive, industrial, and medical through direct sales employees, as well as outside sales representatives and distributors. It operates in the United States, Asia, the Middle East, Europe, and internationally. Interlink Electronics, Inc. was founded in 1985 and is headquartered in Irvine, California.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Irvine"}, "LPTH": {"short_name": "LightPath Technologies, Inc.", "long_name": "LightPath Technologies, Inc.", "summary": "LightPath Technologies, Inc. designs, develops, manufactures, and distributes optical components and assemblies. The company offers precision molded glass aspheric optics, molded and diamond-turned infrared aspheric lenses, and other optical components used to produce products that manipulate light. Its products are used in defense products, medical devices, laser aided industrial tools, automotive safety applications, barcode scanners, optical data storage, hybrid fiber coax datacom, telecommunications, machine vision and sensors, and other industries. The company sells its products directly to customers in North America, Europe, and China, as well as through distributors and channel partners in the United States and internationally. LightPath Technologies, Inc. was founded in 1985 and is headquartered in Orlando, Florida.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Orlando"}, "LPZB.F": {"short_name": "LIGHTPATH TECHS A  DL-,01", "long_name": "LightPath Technologies, Inc.", "summary": "LightPath Technologies, Inc. designs, develops, manufactures, and distributes optical components and assemblies. The company offers precision molded glass aspheric optics, molded and diamond-turned infrared aspheric lenses, and other optical components used to produce products that manipulate light. Its products are used in defense products, medical devices, laser aided industrial tools, automotive safety applications, barcode scanners, optical data storage, hybrid fiber coax datacom, telecommunications, machine vision and sensors, and other industries. The company sells its products directly to customers in North America, Europe, and China, as well as through distributors and channel partners in the United States and internationally. LightPath Technologies, Inc. was founded in 1985 and is headquartered in Orlando, Florida.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Orlando"}, "LYTS": {"short_name": "LSI Industries Inc.", "long_name": "LSI Industries Inc.", "summary": "LSI Industries Inc. provides corporate visual image solutions in the United States, Canada, Mexico, Australia, and Latin America. It operates through Lighting and Graphics segments. The Lighting segment manufactures and markets outdoor and indoor lighting and lighting controls for parking lot and garage, quick-service restaurant, grocery and pharmacy store, automotive, and national retail markets. It primarily offers exterior area, interior, canopy, and landscape lightings, as well as lighting controls, light poles, and photometric layouts; lighting system design services; and solid-state LED solutions. This segment also designs, engineers, and manufactures electronic circuit boards, assemblies, and sub-assemblies. The Graphics segment manufactures and sells exterior and interior visual image elements used in graphics displays and visual image programs in various markets that include the petroleum/convenience store market, quick-service restaurant, grocery, and multi-site retail operations. Its products comprise signage and canopy graphics, pump dispenser graphics, building fascia graphics, decals, interior signage and marketing graphics, aisle markers, wall mural graphics, fleet graphics, video boards, menu boards, and digital signage and media content management products. This segment also provides installation management services for the installation of interior or exterior products. LSI Industries Inc. was founded in 1976 and is headquartered in Cincinnati, Ohio.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Cincinnati"}, "ME5A.F": {"short_name": "METHODE ELECTR.  DL-,50", "long_name": "Methode Electronics, Inc.", "summary": "Methode Electronics, Inc. designs, manufactures, and markets component and subsystem devices worldwide. It operates through four segments: Automotive, Industrial, Interface, and Medical. The Automotive segment supplies electronic and electro-mechanical devices, and related products to automobile original equipment manufacturers directly or through their tiered suppliers. Its products include integrated center consoles, hidden switches, ergonomic switches, transmission lead-frames, and LED-based lighting and sensors, which incorporate magneto-elastic sensing and other technologies that monitor the operation or status of a component or system. The Industrial segment manufactures external lighting solutions; industrial safety radio remote controls; braided flexible cables; current-carrying laminated busbars and devices; custom power-product assemblies, such as PowerRail solution; high-current low-voltage flexible power cabling systems; and powder-coated busbars that are used in various markets and applications comprising aerospace, commercial vehicles, computers, industrial, power conversion, military, telecommunications, and transportation. The Interface segment provides various copper and fiber-optic interface, and interface solutions for the appliance, commercial food service, construction, consumer, material handling, point-of-sale, and telecommunications markets. Its solutions comprise copper transceivers and solid-state field-effect consumer touch panels. The Medical segment offers Dabir Surfaces, a surface support technology aimed at pressure injury prevention for use by patients who are immobilized or otherwise at risk for pressure injuries, including patients undergoing long-duration surgical procedures. The company was founded in 1946 and is headquartered in Chicago, Illinois.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Chicago"}, "MEI": {"short_name": "Methode Electronics, Inc.", "long_name": "Methode Electronics, Inc.", "summary": "Methode Electronics, Inc. designs, manufactures, and markets component and subsystem devices worldwide. It operates through four segments: Automotive, Industrial, Interface, and Medical. The Automotive segment supplies electronic and electro-mechanical devices, and related products to automobile original equipment manufacturers directly or through their tiered suppliers. Its products include integrated center consoles, hidden switches, ergonomic switches, transmission lead-frames, and LED-based lighting and sensors, which incorporate magneto-elastic sensing and other technologies that monitor the operation or status of a component or system. The Industrial segment manufactures external lighting solutions; industrial safety radio remote controls; braided flexible cables; current-carrying laminated busbars and devices; custom power-product assemblies, such as PowerRail solution; high-current low-voltage flexible power cabling systems; and powder-coated busbars that are used in various markets and applications comprising aerospace, commercial vehicles, computers, industrial, power conversion, military, telecommunications, and transportation. The Interface segment provides various copper and fiber-optic interface, and interface solutions for the appliance, commercial food service, construction, consumer, material handling, point-of-sale, and telecommunications markets. Its solutions comprise copper transceivers and solid-state field-effect consumer touch panels. The Medical segment offers Dabir Surfaces, a surface support technology aimed at pressure injury prevention for use by patients who are immobilized or otherwise at risk for pressure injuries, including patients undergoing long-duration surgical procedures. The company was founded in 1946 and is headquartered in Chicago, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Chicago"}, "MPAD": {"short_name": "MICROPAC INDUSTRIES INC", "long_name": "Micropac Industries, Inc.", "summary": "Micropac Industries, Inc. designs, manufactures, and distributes various types of microelectronic circuits. The company's products and technologies include custom design hybrid microelectronic circuits; solid state relays and power controllers; custom optoelectronic assemblies and components; optocouplers; light-emitting diodes; hall-effect sensors; displays; power operational amplifiers; fiber optic components and assemblies; high temperature products; and radiation tolerant electronics. Its products are used as components and assemblies in a range of military, space, and industrial systems, including aircraft instrumentation and navigation systems, satellite systems, power supplies, electronic controls, computers, medical devices, and high-temperature products. The company markets its products through a direct technical sales staff, independent representatives, and independent stocking distributors in the United States and Western Europe, primarily to original equipment manufacturers and contractors. Micropac Industries, Inc. was founded in 1963 and is based in Garland, Texas.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Garland"}, "NGRP": {"short_name": "NGEN TECHNOLOGIES HOLDINGS CORP", "long_name": "Ngen Technologies Holdings Corp.", "summary": "Ngen Technologies Holdings Corp. engages in the automotive technology, biomedical technology, and glasses free 3D display technology businesses. It designs, develops, and sells technology that enables glasses free 3D display for use in smart phones, televisions, and tablets. The company also designs, develops, and sells automotive technologies, including silencer/muffler system that enables fuel efficiency for automobiles. In addition, it engages in manufacturing laser-based light sources, as well as focuses on biomedical products, including a tumor detection scanner using laser and Micro-Electro-Mechanical Systems (MEMS). The company was formerly known as Liberated Solutions, Inc. and changed its name to Ngen Technologies Holdings Corp. in January 2020. Ngen Technologies Holdings Corp. was founded in 2010 and is based in Dallas, Texas.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dallas"}, "NSYS": {"short_name": "Nortech Systems Incorporated", "long_name": "Nortech Systems Incorporated", "summary": "Nortech Systems Incorporated operates as an electronic manufacturing services company in the United States, Mexico, and China. It offers a range of value added engineering, technical and manufacturing, and support services, including project management, designing, testing, prototyping, supply chain management, and post-market services. The company also provides manufacturing and engineering services for medical devices, printed circuit board assemblies, wire and cable assemblies, and higher level electromechanical assemblies. In addition, it offers repair services. The company serves original equipment manufacturers in the aerospace and defense, medical, and industrial markets through business development teams and independent manufacturers' representatives. Nortech Systems Incorporated was founded in 1990 and is headquartered in Maple Grove, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Maple Grove"}, "NVGT": {"short_name": "NOVAGANT CORP", "long_name": "Novagant Corp.", "summary": "Novagant Corp. operates as a development stage company. The company was formerly known as Petrogulf, Inc. and changed its name to Novagant Corp. in January 2014. The company was incorporated in 1987 and is based in Lighthouse Point, Florida.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Lighthouse Point"}, "NXSL": {"short_name": "NEXTECH SOLUTIONS", "long_name": "NexTech FAS Technologies, Inc.", "summary": "On february 22, 2011, NexTech FAS Technologies, Inc. went out of business as per its Chapter 11 liquidation filing under bankruptcy. NexTech FAS Technologies, Inc. engages in the design, manufacture, sale, and servicing of high-precision coating systems and advanced metrology and automation solutions for the semiconductor and flat panel display (FPD) industries. It also involves in the development FAS-Coat, a patented extrusion coating technology for aka spinless coating, slot die coating, and slit coating in the manufacturing process of FPD substrates. The company's products include Altair for testing the repeatability of systems that detect particles on the surface of substrates; Aludra, a reticle inspection system that employs light scattering technology to infer the presence of particles on a semiconductor reticle; Orion, a reticle inspection system, which provides inspection for semiconductor reticles and photomasks; FPDStar, an optical inspection system for identifying and mapping pattern, particle, and processing defects on FPD/TFT substrates; and NexTStar, an automated optical inspection system that represents breakthrough performance in FPD pattern, particle, and processing defect detection. Its products also comprise Pegasu, a wafer sorter series that provides standards-compliant user and automation interfaces; Proteus Reticle Load Port Upgrade kit, a hardware and software solution; and PST upgrades for wafer sorters. In addition, the company's FAS-Coat coating systems process substrates for the flat panel display, multi-chip module, solar cell, biomedical, and semiconductor industries. It was formerly known as NexTech Solutions, Inc. and changed its name to NexTech FAS Technologies, Inc. in July 2007. The company is headquartered in Austin, Texas.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Austin"}, "OSIS": {"short_name": "OSI Systems, Inc.", "long_name": "OSI Systems, Inc.", "summary": "OSI Systems, Inc. designs, manufactures, and sells electronic systems and components worldwide. It operates through three segments: Security, Healthcare, and Optoelectronics and Manufacturing. The Security segment offers baggage and parcel inspection, cargo and vehicle inspection, hold baggage and people screening, radiation detection, and explosive and narcotics trace detection systems under the Rapiscan Systems and AS&E names. It also provides site design, installation, training, and technical support services; and security screening solutions under the S2 name. The Healthcare segment offers patient monitoring and diagnostic cardiology systems, and related supplies and accessories under the Spacelabs name for use in critical care, emergency, and perioperative areas within hospitals, physicians' offices, medical clinics, and ambulatory surgery centers. The Optoelectronics and Manufacturing segment provides optoelectronic devices under the OSI Optoelectronics, OSI LaserDiode, OSI Laserscan, Semicoa, and Advanced Photonix names for the aerospace and defense, avionics, medical imaging and diagnostics, biochemistry analysis, pharmaceutical, nanotechnology, telecommunications, construction, and homeland security markets. It also offers electronics manufacturing services to original equipment manufacturers and end users for medical, automotive, defense, aerospace, industrial, and consumer applications under the OSI Electronics, APlus Products, Altaflex, and PFC names; and LCD displays for medical, industrial, and consumer electronics applications, as well as flex circuits for OEM customers. This segment offers laser-based remote sensing devices to detect and classify vehicles in toll and traffic management systems under the OSI Laserscan and Autosense names; and solid-state laser products for aerospace, defense, telecommunication, and medical applications under the OSI LaserDiode name. The company was founded in 1987 and is headquartered in Hawthorne, California.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Hawthorne"}, "PLXS": {"short_name": "Plexus Corp.", "long_name": "Plexus Corp.", "summary": "Plexus Corp., together with its subsidiaries, provides electronic manufacturing services in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It offers design and development, supply chain, new product introduction, and manufacturing solutions, as well as aftermarket services to companies in the healthcare/life sciences, industrial/commercial, aerospace/defense, and communications market sectors. The company was founded in 1979 and is headquartered in Neenah, Wisconsin.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Neenah"}, "PPIX.L": {"short_name": "PROPHOTONIX LIMITED COM SHS $0.", "long_name": "ProPhotonix Limited", "summary": "ProPhotonix Limited designs, manufactures, sells, and distributes light emitting diode (LED) illumination solutions and laser modules in the United States, Canada, Mexico, South America, Europe, Asia, and internationally. The company operates through two segments, LED's (light emitting diode systems) and Laser & Diodes. It offers COBRA Cure FX series of (UV) LED curing systems for UV curing of inks, coatings, and adhesives, as well as 3D printing; and LED line light products for line scan and web inspection. The company also provides LED spot, area, and ring lights for use in machine and night vision, biomedical, life sciences, fluorescence, strobing, microscopy, security ID, and other industrial applications. In addition, it offers laser modules, including alignment, dental, industrial, medical, scientific, continuous wave, compact laser, nanosecond pulsed, photon, wavelength combiner, PROdigii digital, and structured light laser modules, as well as OEM laser modules; laser diodes and SpecBright spotlights; and UVC LED systems to kill or inactivate viral, bacterial, and fungal species. The company's products are used in 3D scanning, machine vision lighting, industrial alignment, industry solutions, defense, military, medical, UV curing, security and transport, commercial, and other industry applications. ProPhotonix Limited was founded in 1951 and is headquartered in Salem, New Hampshire.", "currency": "GBp", "sector": "Technology", "industry": "Electronic Components", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Salem"}, "PX4.F": {"short_name": "PLEXUS CORP.  DL-,01", "long_name": "Plexus Corp.", "summary": "Plexus Corp., together with its subsidiaries, provides electronic manufacturing services in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. It offers design and development, supply chain, new product introduction, and manufacturing solutions, as well as aftermarket services to companies in the healthcare/life sciences, industrial/commercial, aerospace/defense, and communications market sectors. The company was founded in 1979 and is headquartered in Neenah, Wisconsin.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Neenah"}, "REFR": {"short_name": "Research Frontiers Incorporated", "long_name": "Research Frontiers Incorporated", "summary": "Research Frontiers Incorporated develops and markets technology and devices to control the flow of light worldwide. The company develops and licenses suspended particle device (SPD-Smart) light-control technology to companies that manufacture and market the SPD-Smart chemical emulsion, light-control film made from the chemical emulsion, the light-control panels made by laminating the film, and electronics to power end-products incorporating the film, as well as lamination services for and the end-products, such as windows, skylights, and sunroofs. Its SPD-Smart light-control technology is used in various product applications, including windows, sunshades, skylights, and interior partitions for homes and buildings; automotive windows, sunroofs, sun-visors, sunshades, rear-view mirrors, instrument panels, and navigation systems; aircraft windows; museum display panels, and eyewear products; and flat panel displays for electronic products. The company serves automotive, aerospace and marine, and architectural industries. Research Frontiers Incorporated was founded in 1965 and is headquartered in Woodbury, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Woodbury"}, "RELL": {"short_name": "Richardson Electronics, Ltd.", "long_name": "Richardson Electronics, Ltd.", "summary": "Richardson Electronics, Ltd. engages in the power and microwave technologies, customized display solutions, and healthcare equipment businesses in North America, the Asia Pacific, Europe, and Latin America. The company's Power and Microwave Technologies Group segment provides engineered solutions, power grid and microwave tubes, and related consumables; technical services for microwave and industrial equipment; flat panel detector solutions, replacement parts, tubes, and service training for diagnostic imaging equipment; customized display solutions; and power conversion and RF and microwave components for broadcast transmission, CO2 laser cutting, diagnostic imaging, dielectric and induction heating, high energy transfer, high voltage switching, plasma, power conversion, radar, and radiation oncology applications. Its products are used to control, switch, or amplify electrical power signals, as well as are used as display devices in alternative energy, healthcare, aviation, communications, industrial, marine, military, scientific, and semiconductor markets. The company's Canvys segment provides custom display solutions, such as touch screens, protective panels, all-in-one computers, custom enclosures, specialized cabinet finishes, application specific software packages, and certification services to corporate enterprise, financial, industrial, and medical original equipment manufacturer markets. Its Healthcare segment manufactures, refurbishes, and distributes diagnostic imaging replacement parts for CT and MRI systems; replacement CT and MRI tubes; MRI coils, cold heads, and RF amplifiers; hydrogen thyratrons, klystrons, and magnetrons; flat panel detector upgrades; and additional replacement solutions, as well as offers CT service training. This segment serves hospitals, medical centers, asset management companies, independent service organizations, and multi-vendor service providers. The company was founded in 1947 and is headquartered in LaFox, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "LaFox"}, "RESS": {"short_name": "RENEWABLE ENERGY SOLUTION SYS I", "long_name": "Renewable Energy Solution Systems, Inc.", "summary": "Renewable Energy Solution Systems, Inc. provides renewable energy solutions for telecommunications, industrial, and commercial industries. It operates as an integrator of solar energy technologies and equipment, with specialization in solar DC to DC power generation for telecommunications cell sites. The company's flagship product, Razor Series DC to DC converter, utilizes the power produced from the photovoltaic array and delivers compatible power directly into the client's power management system without inversion. Its Razor Series solution is designed to support various industries, including telecommunications, commercial manufacturing, government institutions, and municipalities. Renewable Energy Solution Systems also distributes T Series HVAC unit, a collection of self-contained and split air conditioners for various levels of cooling requirements for telecommunications applications; and North Star telecom series batteries. In addition, it company offers E-Link Control Module to manage and optimize power system performance. Further, it provides project management services, consultation services, and financial management services. The company was formerly known as Critical Point Resources, Inc. and changed its name to Renewable Energy Solution Systems, Inc. in February 2012. Renewable Energy Solution Systems, Inc. is based in Port Washington, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Port Washington"}, "RFR.F": {"short_name": "RESEARCH FRONTIERS DL-,01", "long_name": "Research Frontiers Incorporated", "summary": "Research Frontiers Incorporated develops and markets technology and devices to control the flow of light worldwide. The company develops and licenses suspended particle device (SPD-Smart) light-control technology to companies that manufacture and market the SPD-Smart chemical emulsion, light-control film made from the chemical emulsion, the light-control panels made by laminating the film, and electronics to power end-products incorporating the film, as well as lamination services for and the end-products, such as windows, skylights, and sunroofs. Its SPD-Smart light-control technology is used in various product applications, including windows, sunshades, skylights, and interior partitions for homes and buildings; automotive windows, sunroofs, sun-visors, sunshades, rear-view mirrors, instrument panels, and navigation systems; aircraft windows; museum display panels, and eyewear products; and flat panel displays for electronic products. The company serves automotive, aerospace and marine, and architectural industries. Research Frontiers Incorporated was founded in 1965 and is headquartered in Woodbury, New York.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Woodbury"}, "ROG": {"short_name": "Rogers Corporation", "long_name": "Rogers Corporation", "summary": "Rogers Corporation designs, develops, manufactures, and sells engineered materials and components worldwide. It operates in Advanced Connectivity Solutions (ACS), Elastomeric Material Solutions (EMS), Power Electronics Solutions (PES), and Other segments. The ACS segment offers circuit materials and solutions for connectivity applications in wireless infrastructure, automotive, aerospace and defense, connected devices, and wired infrastructure under the RO4000, RO3000, RT/duroid, TMM, AD Series, CuClad, Kappa, DiClad, IsoClad, COOLSPAN, MAGTREX, TC Series, IM Series, 92ML, and CLTE Series names. The EMS segment provides engineered material solutions, including polyurethane and silicone materials used in cushioning, gasketing, sealing, and vibration management applications for general industrial, portable electronics, automotive, mass transit, aerospace and defense, footwear and impact mitigation, and printing markets; customized silicones used in flex heater and semiconductor thermal applications; and polytetrafluoroethylene and ultra-high molecular weight polyethylene materials used in wire and cable, electrical insulation, and automotive applications under the PORON, BISCO, DeWAL, ARLON, Griswold, eSORBA, XRD, HeatSORB, and R/bak names. The PES segment offers ceramic substrate materials, busbars, and cooling solutions under the curamik and ROLINX names. The Other segment provides elastomer components; and elastomer floats for level sensing in fuel tanks, motors, and storage tanks for applications in the general industrial and automotive markets under the NITROPHYL and ENDUR names. Rogers Corporation was founded in 1832 and is headquartered in Chandler, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Chandler"}, "SANM": {"short_name": "Sanmina Corporation", "long_name": "Sanmina Corporation", "summary": "Sanmina Corporation provides integrated manufacturing solutions, components, products and repair, logistics, and after-market services worldwide. It operates in two businesses, Integrated Manufacturing Solutions; and Components, Products and Services. The company offers product design and engineering, including concept development, detailed design, prototyping, validation, preproduction, manufacturing design release, and product industrialization; manufacturing of components, subassemblies, and complete systems; high-level assembly and test services; direct order fulfillment and logistics services; after-market product service and support; and supply chain management services. It also provides interconnect systems, such as printed circuit board fabrication, backplane, cable assemblies, and plastic injection moldings; mechanical systems comprising enclosures and precision machining; memory, enterprise, radio frequency, optical, and microelectronic solutions; defense and aerospace products; and cloud-based manufacturing execution software. The company sells its products and services primarily to original equipment manufacturers that serve the industrial, medical, defense and aerospace, automotive, communications networks, and cloud solutions industries. The company was formerly known as Sanmina-SCI Corporation and changed its name to Sanmina Corporation in November 2012. Sanmina Corporation was founded in 1980 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "SAYN.F": {"short_name": "SANMINA CORP. NEW  DL-,01", "long_name": "Sanmina Corporation", "summary": "Sanmina Corporation provides integrated manufacturing solutions, components, products and repair, logistics, and after-market services worldwide. It operates in two businesses, Integrated Manufacturing Solutions; and Components, Products and Services. The company offers product design and engineering, including concept development, detailed design, prototyping, validation, preproduction, manufacturing design release, and product industrialization; manufacturing of components, subassemblies, and complete systems; high-level assembly and test services; direct order fulfillment and logistics services; after-market product service and support; and supply chain management services. It also provides interconnect systems, such as printed circuit board fabrication, backplane, cable assemblies, and plastic injection moldings; mechanical systems comprising enclosures and precision machining; memory, enterprise, radio frequency, optical, and microelectronic solutions; defense and aerospace products; and cloud-based manufacturing execution software. The company sells its products and services primarily to original equipment manufacturers that serve the industrial, medical, defense and aerospace, automotive, communications networks, and cloud solutions industries. The company was formerly known as Sanmina-SCI Corporation and changed its name to Sanmina Corporation in November 2012. Sanmina Corporation was founded in 1980 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "SGMA": {"short_name": "SigmaTron International, Inc.", "long_name": "SigmaTron International, Inc.", "summary": "SigmaTron International, Inc. operates as an independent provider of electronic manufacturing services (EMS). Its EMS services includes printed circuit board assemblies and completely assembled (box-build) electronic products. The company also offers automatic and manual assembly, and testing of products; material sourcing and procurement services; manufacturing and test engineering support services; design services; warehousing and distribution services; and assistance in obtaining product approval from governmental and other regulatory bodies. It primarily serves customers operating in the industrial electronics, consumer electronics, and medical/life sciences industries in the United States, Mexico, China, and Vietnam. The company markets its services through independent manufacturers' representative organizations. SigmaTron International, Inc. was founded in 1993 and is headquartered in Elk Grove Village, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Elk Grove Village"}, "SIMC": {"short_name": "SIMCLAR INC", "long_name": "Simclar, Inc.", "summary": "Simclar, Inc., together with its subsidiaries, operates as a contract manufacturer of electronic and electro-mechanical products in the United States and Mexico. Its custom-designed products include complex printed circuit boards (PCBs), finished products, subassemblies, molded and nonmolded cable assemblies, wire harnesses, injection molded, and electronic assembly products. The PCBs produced by the company comprise pin-through-hole assemblies, low and medium volume surface mount technology assemblies, and mixed technology PCBs, including multilayer PCBs; and cable and harness assemblies consist of multiconductor, ribbon, coaxial cable, and discrete wire harness assemblies. The company also provides contract manufacturing services, which involves the manufacture of complete finished assemblies with all sheet metal, power supplies, fans, and PCBs, as well as complete sub-assemblies for integration into original equipment manufactures (OEMs) finished products, such as speaker and lock-key assemblies, and diode assemblies. In addition, Simclar offers reworking and refurbishing services, which comprise redesign, rework, refurbish, and repair of materials and subassemblies; sheet metal fabrication services; and backplane interconnect solutions. The company's products are manufactured to customer specifications and designed for OEMs in the data processing, telecommunications, instrumentation, and food preparation equipment industries. Simclar was founded in 1976. It was formerly known as Techdyne, Inc. and changed its name to Simclar, Inc. in September 2003. The company was founded in 1976 and is based in Hialeah, Florida. Simclar, Inc. operates as a subsidiary of Simclar Group Limited.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Hialeah"}, "STKR": {"short_name": "PROPHOTONIX LTD", "long_name": "ProPhotonix Limited", "summary": "ProPhotonix Limited designs, manufactures, sells, and distributes light emitting diode (LED) illumination solutions and laser modules in the United States, Canada, Mexico, South America, Europe, Asia, and internationally. The company operates through two segments, LED's (light emitting diode systems) and Laser & Diodes. It offers COBRA Cure FX series of (UV) LED curing systems for UV curing of inks, coatings, and adhesives, as well as 3D printing; and LED line light products for line scan and web inspection. The company also provides LED spot, area, and ring lights for use in machine and night vision, biomedical, life sciences, fluorescence, strobing, microscopy, security ID, and other industrial applications. In addition, it offers laser modules, including alignment, dental, industrial, medical, scientific, continuous wave, compact laser, nanosecond pulsed, photon, wavelength combiner, PROdigii digital, and structured light laser modules, as well as OEM laser modules; laser diodes and SpecBright spotlights; and UVC LED systems to kill or inactivate viral, bacterial, and fungal species. The company's products are used in 3D scanning, machine vision lighting, industrial alignment, industry solutions, defense, military, medical, UV curing, security and transport, commercial, and other industry applications. ProPhotonix Limited was founded in 1951 and is headquartered in Salem, New Hampshire.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Salem"}, "SUTI": {"short_name": "SUTIMCO INTL INC", "long_name": "SUTIMCo International, Inc.", "summary": "SUTIMCo International, Inc., a multi-project business development enterprise, engages in creating new technology companies from patented university innovations. The company primarily engages in the development of operating companies, companies in the pre-funding stage, and projects in the development process. SUTIMCo International, Inc. is headquartered in Santa Ana, California.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Santa Ana"}, "TLED": {"short_name": "LIGHT ENGINE DESIGN CORP", "long_name": "Curtis Mathes Corporation", "summary": "Light Engine Design Corp. manufactures and sells lighting products for consumer and industrial lighting markets. The company offers consumer and industrial lighting, frequency specific lighting, monochromatic lighting, and horticultural lighting. Light Engine Design Corp. was formerly known as Business Continuity Solutions, Inc. The company was incorporated in 1997 and is based in Tempe, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Tempe"}, "TNLX": {"short_name": "TRANS-LUX CORP", "long_name": "Trans-Lux Corporation", "summary": "Trans-Lux Corporation designs, manufactures, and supplies digital signage display solutions, fixed digit scoreboards, and LED lighting fixtures and lamps. It operates in two segments, Digital Product Sales; and Digital Product Lease and Maintenance. The Digital Product Sales segment sells indoor and outdoor digital product signage products. The Digital Product Lease and Maintenance segment is involved in the lease and maintenance of indoor and outdoor digital product signage. The company offers LED display systems for use by sports arenas and stadiums; financial institutions, including brokerage firms, banks, energy companies, insurance companies, and mutual fund companies; educational institutions; outdoor advertising companies; corporate and government communication centers; retail outlets; casinos, racetracks, and other gaming establishments; airports, train stations, bus terminals, and other transportation facilities; movie theatres; and health maintenance organizations, as well as in various other applications. It also provides turnkey installation and support services. The company markets its products through direct sales representatives and a network of independent dealers and distributors in the United States and Canada; and internal sales people and independent distributors in the rest of North America, Europe, the Middle East, South America, Africa, the Far East, and Australia. Trans-Lux Corporation was founded in 1920 and is headquartered in New York, New York.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New York"}, "TRPS": {"short_name": "TRIP TECHNOLOGIES INC", "long_name": "Trip Technologies Inc.", "summary": "Trip Technologies Inc. provides solar and green energy solutions for homeowners, businesses, and non-profit and government organizations in the United States. The company offers solar electric system or photovoltaic systems, battery back-up systems, solar water heating systems, solar attic fans, reflective roof paints, solar pool heating systems, pool purification systems, and rain water harvesting systems. It also provides installation services. The company was founded in 2004 and is based in Miami, Florida.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Miami"}, "TTMI": {"short_name": "TTM Technologies, Inc.", "long_name": "TTM Technologies, Inc.", "summary": "TTM Technologies, Inc., together with its subsidiaries, manufactures printed circuit boards (PCBs) worldwide. The company operates through two segments, PCB and E-M Solutions. The company offers a range of PCB products, radio-frequency (RF) components, and electro-mechanical solutions, including conventional PCBs, RF and microwave circuits, high density interconnect PCBs, substrate-like PCBs, flexible PCBs, rigid-flex PCBs, custom assemblies and system integration products, IC substrates, passive RF components, advanced ceramic RF components, multi-chip modules, and beamforming and switching networks. It also produces printed circuits with heavy copper cores, and embedded and press-fit coins; PCBs with electrically passive heat sinks; and PCBs with electrically active thermal cores. In addition, it offers various services, including design for manufacturability, PCB layout design, simulation and testing, and quick turnaround services. The company serves original equipment manufacturers and electronic manufacturing services companies that primarily serve the aerospace and defense, automotive, cellular phone, computing, medical/industrial/instrumentation, and networking/communications end markets of the electronics industry; and the U.S. government. TTM Technologies, Inc. was founded in 1978 and is headquartered in Santa Ana, California.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Ana"}, "UNXLQ": {"short_name": "UNI-PIXEL INC", "long_name": "Uni-Pixel, Inc.", "summary": "Uni-Pixel, Inc. designs, develops, manufactures, and markets micro-structured polymer film materials and related technologies for the display, flexible electronics, and automotive industries in the United States. The company markets its touch screen films as sub-components of a touch sensor module under the XTouch brand; and hard coat resin and optical films under the Diamond Guard brand. Uni-Pixel, Inc. was founded in 1998 and is headquartered in Santa Clara, California. On February 21, 2018, the voluntary petition of Uni-Pixel, Inc. for reorganization under Chapter 11 was converted to Chapter 7. It had filed for Chapter 11 bankruptcy on August 30, 2017.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "VCV.F": {"short_name": "VICOR CORP.  DL-,01", "long_name": "Vicor Corporation", "summary": "Vicor Corporation designs, develops, manufactures, and markets modular power components and power systems for converting electrical power in the United States, Europe, the Asia Pacific, and internationally. The company offers a range of brick-format DC-DC converters; complementary components; and input and output voltage, and output power products, as well as electrical and mechanical accessories. It also provides custom power systems solutions. The company serves independent manufacturers of electronic devices, original equipment manufacturers, and their contract manufacturers in the aerospace and aviation, defense electronics, industrial automation and equipment, instrumentation, test equipment, solid state lighting, telecommunications and networking infrastructure, and vehicles and transportation markets. Vicor Corporation was founded in 1981 and is headquartered in Andover, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Andover"}, "VICR": {"short_name": "Vicor Corporation", "long_name": "Vicor Corporation", "summary": "Vicor Corporation designs, develops, manufactures, and markets modular power components and power systems for converting electrical power in the United States, Europe, the Asia Pacific, and internationally. The company offers a range of brick-format DC-DC converters; complementary components; and input and output voltage, and output power products, as well as electrical and mechanical accessories. It also provides custom power systems solutions. The company serves independent manufacturers of electronic devices, original equipment manufacturers, and their contract manufacturers in the aerospace and aviation, defense electronics, industrial automation and equipment, instrumentation, test equipment, solid state lighting, telecommunications and networking infrastructure, and vehicles and transportation markets. Vicor Corporation was founded in 1981 and is headquartered in Andover, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Andover"}, "VMTG": {"short_name": "VICTOR MINING INDUSTRY GROUP IN", "long_name": "Victor Mining Industry Group Inc.", "summary": "Victor Mining Industry Group, Inc. does not have significant operations. Previously, it was engaged in the manufacture and assembly of sensors and micro systems. The company, formerly known as Sensor System Solutions Inc., is based in Carson City, Nevada.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Carson City"}, "VPER": {"short_name": "VIPER NETWORKS INC", "long_name": "Viper Networks, Inc.", "summary": "Viper Networks, Inc. manufactures and distributes LED lighting products It offers LED street lights, and parking lot and indoor lighting products, as well as intelligent lighting solutions with camera, sensor, and wireless technologies. The company was incorporated in 1983 and is based in Troy, Michigan.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Troy"}, "XPH.F": {"short_name": "AMPHENOL CORP.  A DL-,001", "long_name": "Amphenol Corporation", "summary": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates in two segments, Interconnect Products and Assemblies, and Cable Products and Solutions. The Interconnect Products and Assemblies segment offers connector and connector systems, including fiber optic, harsh environment, high-speed, and radio frequency interconnect products, as well as antennas; power interconnect products, busbars, and distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; and other products comprising antennas, flexible and rigid printed circuit boards, hinges, molded parts, production-related products, sensors and sensor-based products, and switches. The Cable Products and Solutions segment offers coaxial, power, and specialty cables; cable assemblies; and components, which include combiner/splitter products, connector and connector systems, and fiber optic components. The company sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation has a partnership with PPC Broadband, Inc. in the home networking field. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.", "currency": "EUR", "sector": "Technology", "industry": "Electronic Components", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Wallingford"}}