{
    "GRPN.MX": {
        "short_name": "GROUPON INC",
        "long_name": "Groupon, Inc.",
        "summary": "Groupon, Inc. operates online local commerce marketplaces that connect merchants to consumers by offering goods and services at a discount in North America and internationally. The company provides deals in various categories, including events and activities; health, beauty, and wellness; food and drink; home and garden; automotive; discounted and market rates for hotel, airfare, and package deals, as well as deals on various product lines, such as electronics, sporting goods, jewelry, toys, household items, and apparel. It offers its deal offerings to customers through Websites; search engines; mobile applications and mobile, which enable consumers to browse, purchase, manage, and redeem deals on their mobile devices; emails and push notifications; affiliate channels; social and display advertising; and offline marketing. The company was formerly known as ThePoint.com, Inc. and changed its name to Groupon, Inc. in October 2008. Groupon, Inc. was founded in 2008 and is headquartered in Chicago, Illinois.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Chicago"
    },
    "OPMG": {
        "short_name": "OPTIONS MEDIA GROUP HOLDINGS IN",
        "long_name": "Options Media Group Holdings, Inc.",
        "summary": "Options Media Group Holdings, Inc., through its subsidiaries, focuses on the mobile software applications in the United States and Canada. It offers PhoneGuard anti-texting software, a mobile phone control management software suite, which is designed to prevent texting and emailing while driving, as well as offers parents and employers the ability to monitor the driving habits of mobile phone users to prevent speeding. The company also provides lead generation programs to assist various businesses with customer acquisition for the products and services they are selling. Options Media Group Holdings, Inc. was incorporated in 2000 and is headquartered in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boca Raton"
    },
    "SPXA": {
        "short_name": "SPECTRUMDNA INC",
        "long_name": "SpectrumDNA, Inc.",
        "summary": "Spectrum DNA, Inc. operates a social media studio that creates digital networked applications, which are engines of engagement (enginets) primarily for media outlets and brand advertisers. Its enginets are branded Web and wireless-based network experiences, and Web and mobile applications. The company's principal enginets include The Addictionary, a social wordplay engine used as the foundation for apps created to engage in word-related apps; and PlanetTagger, a location-enabled integrated social marketing platform that offers online communities a tool, which centralize the social media marketing and editorial programming, as well as provides the community users with utility to extend the reach of the community. It also offers OptEngage, a new class configurable and contextual browser application that talks to a cloud-based platform, which enables clients to deliver content and utility to their users on the Web; and the Hucklemonkey, an application programming interface API that integrates gamification into clients existing services or new applications. The company was founded in 2006 and is based in Park City, Utah.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Internet Information Providers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Park City"
    }
}