{"CCOP": {"short_name": "COMPETITIVE COMPANIES INC", "long_name": "Competitive Companies, Inc.", "summary": "Competitive Companies, Inc., through its subsidiaries, provides fixed and mobile wireless broadband Internet services to wholesale, retail, and enterprise customers in the United States and internationally. It offers high speed wireless Internet connections to customers in rural communities. The company also provides fixed wireless, fail-over 4G, fail-over 5G, and Internet booster plus services; and Wi-Fi services. In addition, it engages in the business of preparing and filing with the Federal Communications Commission (FCC) Form 601-FCC applications for radio service authorization for the purpose of obtaining the use of Â\u0091millimeter wave' spectrum in the 71-95 GHz bands on a shared basis with federal government initiatives. The company was founded in 1998 and is headquartered in San Antonio, Texas.", "currency": "USD", "sector": "Technology", "industry": "Long Distance Carriers", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Antonio"}, "LYNS": {"short_name": "LIGHTYEAR NETWORK SOLUTIONS INC", "long_name": "Lightyear Network Solutions, Inc.", "summary": "Lightyear Network Solutions, Inc., through its subsidiaries, provides telecommunications services in the United States and Puerto Rico. Its telecommunications products and services include long distance and local phone services, Internet/Intranet, calling cards, advanced data, conferencing, voice over Internet protocol (VoIP) services, and wireless services, as well as VoIP hardware under the Lightyear XStream brand. The company also offers digital subscriber line services, integrated access services, frame relay, dial-up and dedicated access services, Web hosting and development services, call analysis software for customized billing reports, multimedia conferencing services, and direct sales services for organizations to sell telecom products in a private label program. It serves large, medium, and small businesses, as well as residential customers through its direct sales force and agents. As of December 31, 2012, the company provided service to approximately 65,000 customer locations. Lightyear Network Solutions, Inc. was founded in 1993 and is based in Louisville, Kentucky.", "currency": "USD", "sector": "Technology", "industry": "Long Distance Carriers", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Louisville"}}