{"1GSN.F": {"short_name": "NOVANTA INC.", "long_name": "Novanta Inc.", "summary": "Novanta Inc., together with its subsidiaries, designs, manufactures, markets, and sells photonics, vision, and precision motion components and sub-systems to original equipment manufacturers in the medical and industrial markets worldwide. Its Photonics segment offers photonics-based solutions, including laser scanning and laser beam delivery, CO2 laser, solid state laser, ultrafast laser, and optical light engine products for photonics-based applications, such as industrial processing, metrology, medical and life science imaging, DNA sequencing, and medical laser procedures. The company's Vision segment provides a range of medical grade technologies, including medical insufflators, pumps, and related disposables; visualization solutions; wireless, recorder and video integration technologies for operating room integrations; optical data collection and machine vision technologies; radio frequency identification technologies; thermal chart recorders; spectrometry technologies; and embedded touch screen solutions. Its Precision Motion segment offers optical and inductive encoders, precision motors, motion control sub-assemblies, servo drives, air bearings, and air bearing spindles. The company sells its products through its direct sales force, resellers, distributors, and system integrators under the Cambridge Technology, Lincoln Laser, Synrad, Laser Quantum, ARGES, WOM, NDS, NDSsi, Med X Change, Reach Technology, JADAK, ThingMagic, Photo Research, General Scanning, Celera Motion, MicroE, Applimotion, Zettlex, Ingenia, and Westwind brands. The company was formerly known as GSI Group, Inc. and changed its name to Novanta Inc. in May 2016. Novanta Inc. was founded in 1968 and is headquartered in Bedford, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Bedford"}, "1KT.F": {"short_name": "KEYSIGHT TECHS  DL-,01", "long_name": "Keysight Technologies, Inc.", "summary": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific. Its Communications Solutions Group segment provides electronic design automation (EDA) software; radio frequency and microwave test instruments; hardware and virtual network test platforms and software applications, including data center, routing and switching, software defined networking, security, and encryption; oscilloscopes, logic and serial protocol analyzers, logic-signal sources, arbitrary waveform generators, and bit error rate testers; optical modulation analyzers, optical component analyzers, optical power meters, and optical laser source solutions; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company's Electronic Industrial Solutions Group segment offers design tools; design verification solutions; and digital multi-meters, function generators, frequency counters, data acquisition systems, audio analyzers, LCR meters, thermal imagers, precision source measure units, ultra-high precision device current analyzers, and test executive software platforms, as well as various power supplies comprising AC/DC modular supplies and electronically programmable loads. This segment also provides printed-circuit-board-assembly testers, integrated circuit parametric testers, and sub-nano-meter positioning sub-assemblies; test and measurement products and software; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company sells its products through direct sales force, distributors, resellers, and manufacturer's representatives. Keysight Technologies, Inc. was incorporated in 2013 and is headquartered in Santa Rosa, California.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Santa Rosa"}, "808.F": {"short_name": "VELODYNE LIDAR INC.", "long_name": "Velodyne Lidar, Inc.", "summary": "Velodyne Lidar, Inc. develops and produces lidar sensors for use in industrial, 3D mapping, drones, and auto applications in North America, the Asia Pacific, Europe, the Middle East, and Africa. The company offers surround-view hybrid solid state, directional solid state, and dome lidars; and Vella, an advanced driver assistance systems (ADAS) software solution built around lidar. Its products are used in various applications, including autonomous vehicles, ADAS, UAVs, mapping, industrial automation, self-driving rovers, autonomous vessels, smart city initiatives, and robotics. The company has a strategic partnership with Beijing Trunk Technology Co., Ltd. Velodyne Lidar, Inc. was founded in 2018 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Jose"}, "ACFN": {"short_name": "ACORN ENERGY INC", "long_name": "Acorn Energy, Inc.", "summary": "Acorn Energy, Inc., through its subsidiaries, develops and markets wireless remote monitoring and control systems for various markets in the United States and internationally. It operates through two segments, Power Generation (PG) Monitoring and Cathodic Protection (CP) Monitoring. The PG segment provides wireless remote monitoring and control systems, and services for critical assets, which include stand-by power generators, compressors, pumps, pumpjacks, light towers, turbines, and other industrial equipment; and Internet of Things applications. The CP segment offers remote monitoring of cathodic protection systems on gas pipelines for gas utilities and pipeline companies. The company was incorporated in 1986 and is based in Wilmington, Delaware.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wilmington"}, "ASPT": {"short_name": "ALADDIN SEPARATION TECHNOLOGIES", "long_name": "Haber, Inc.", "summary": "Haber, Inc., a technology process development company, develops proprietary technologies in extractive metallurgy and electrochemical separations. The company offers Haber Gold Process Four (HGP4) technologies, including sulfide reduction processes, gold extraction, and recovery processes; and the associated Â\u0091Aladdin' proprietary processing equipment. It primarily focusing in Guyana. The company was founded in 1967 and is based in Arlington, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Arlington"}, "AURT": {"short_name": "ATTUNE RTD", "long_name": "Attune RTD, Inc", "summary": "Attune RTD, Inc., a development stage company, focuses on providing technology related to the operations of energy efficient electronic systems in the United States. Its technology is used in the operations of swimming pool pumps, sprinkler controllers, heating and air conditioning controllers, and others. The company's products include BrioWave 175p and BrioWave 175w Smart Energy Management Controllers, which are designed to use an interactive graphical user interface. It also sells turnkey solar power systems. The company's products are also designed to prevent maintenance problems from occurring in swimming pool filtration systems. It was formerly known as Interfacing Technologies, Inc. and changed its name to Attune RTD, Inc. in March 2008. Attune RTD, Inc. was incorporated in 2001 and is headquartered in Palm Springs, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Palm Springs"}, "CGNX": {"short_name": "Cognex Corporation", "long_name": "Cognex Corporation", "summary": "Cognex Corporation provides machine vision products that capture and analyze visual information in order to automate manufacturing and distribution tasks worldwide. Its machine vision products are used to automate the manufacture and tracking of discrete items, including mobile phones, aspirin bottles, and automobile tires by locating, identifying, inspecting, and measuring them during the manufacturing or distribution process. The company offers VisionPro software, a suite of patented vision tools for advanced programming; Cognex Designer that allows customers to build vision applications with a graphical, flowchart-based programming environment; and Cognex deep learning vision software. It also provides general-purpose vision systems for vision tasks, including part location, identification, measurement, assembly verification, and robotic guidance; and vision sensors for vision applications, such as checking the presence and size of parts; the In-Sight product line of vision systems and sensors. In addition, the company offers ID products comprising DataMan image-based barcode readers and barcode verifiers, as well as vision-enabled mobile terminals for industrial barcode reading applications. It sells its products to consumer electronics, automotive, consumer products, food and beverage, pharmaceuticals, and medical devices industries, as well as through a network of distributors and integrators. The company was founded in 1981 and is headquartered in Natick, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Natick"}, "CGNX.MX": {"short_name": "COGNEX CORP", "long_name": "Cognex Corporation", "summary": "Cognex Corporation provides machine vision products that capture and analyze visual information in order to automate manufacturing and distribution tasks worldwide. Its machine vision products are used to automate the manufacture and tracking of discrete items, including mobile phones, aspirin bottles, and automobile tires by locating, identifying, inspecting, and measuring them during the manufacturing or distribution process. The company offers VisionPro software, a suite of patented vision tools for advanced programming; Cognex Designer that allows customers to build vision applications with a graphical, flowchart-based programming environment; and Cognex deep learning vision software. It also provides general-purpose vision systems for vision tasks, including part location, identification, measurement, assembly verification, and robotic guidance; and vision sensors for vision applications, such as checking the presence and size of parts; the In-Sight product line of vision systems and sensors. In addition, the company offers ID products comprising DataMan image-based barcode readers and barcode verifiers, as well as vision-enabled mobile terminals for industrial barcode reading applications. It sells its products to consumer electronics, automotive, consumer products, food and beverage, pharmaceuticals, and medical devices industries, as well as through a network of distributors and integrators. The company was founded in 1981 and is headquartered in Natick, Massachusetts.", "currency": "MXN", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Natick"}, "CGZ.F": {"short_name": "COGNEX CORP.  DL-,002", "long_name": "Cognex Corporation", "summary": "Cognex Corporation provides machine vision products that capture and analyze visual information in order to automate manufacturing and distribution tasks worldwide. Its machine vision products are used to automate the manufacture and tracking of discrete items, including mobile phones, aspirin bottles, and automobile tires by locating, identifying, inspecting, and measuring them during the manufacturing or distribution process. The company offers VisionPro software, a suite of patented vision tools for advanced programming; Cognex Designer that allows customers to build vision applications with a graphical, flowchart-based programming environment; and Cognex deep learning vision software. It also provides general-purpose vision systems for vision tasks, including part location, identification, measurement, assembly verification, and robotic guidance; and vision sensors for vision applications, such as checking the presence and size of parts; the In-Sight product line of vision systems and sensors. In addition, the company offers ID products comprising DataMan image-based barcode readers and barcode verifiers, as well as vision-enabled mobile terminals for industrial barcode reading applications. It sells its products to consumer electronics, automotive, consumer products, food and beverage, pharmaceuticals, and medical devices industries, as well as through a network of distributors and integrators. The company was founded in 1981 and is headquartered in Natick, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Natick"}, "COHR": {"short_name": "Coherent, Inc.", "long_name": "Coherent, Inc.", "summary": "Coherent, Inc. provides lasers, laser-based technologies, and laser-based system solutions for a range of scientific, commercial, and industrial research applications. It operates in two segments, OEM Laser Sources and Industrial Lasers & Systems. The company designs, manufactures, markets, and services lasers, laser tools, precision optics, and related accessories; and laser measurement and control products. Its products are used for applications in microelectronics, materials processing, original equipment manufacturer components and instrumentation, and scientific research and government programs. The company markets its products through a direct sales force in the United States, as well as through direct sales personnel and independent representatives internationally. Coherent, Inc. was founded in 1966 and is headquartered in Santa Clara, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Santa Clara"}, "CRGS": {"short_name": "CURAEGIS TECHNOLOGIES INC", "long_name": "CurAegis Technologies, Inc.", "summary": "CurAegis Technologies, Inc. develops and markets advanced technologies in the areas of safety and wellness. It focuses on the commercialization of the myCadian system, a wellness and safety system that enables the user to anticipate and avert undesired or disastrous situations caused by the degradation of alertness; and Z-Coach, a proprietary sleep training and education solution to correct sleep issues and enhance overall wellness for industry professionals and corporate workers. The company was formerly known as Torvec, Inc. and changed its name to CurAegis Technologies, Inc. in June 2016. CurAegis Technologies, Inc. was founded in 1996 and is based in Rochester, New York.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rochester"}, "CYBE": {"short_name": "CyberOptics Corporation", "long_name": "CyberOptics Corporation", "summary": "CyberOptics Corporation designs, develops, and manufactures high precision sensing technology solutions and system products worldwide. Its products are used in surface mount technology (SMT) and semiconductor industries to improve yields and productivity. The company offers products based on multi-reflection suppression (MRS) technology, including multi-function inspection and measurement machines, and memory module inspection system; high precision 3D and 2D sensors for inspection and metrology; and 3D MRS sensors that are used various applications, such as printed circuit boards, CPU sockets, solder balls and bumps, wafer bumps, copper pillars, and other wafer level and advanced packaging. It also provides SMT electronic assembly alignment sensor products comprises LaserAlign sensors that are incorporated into the placement heads of pick-and-place machines; inspection and metrology system products for process control, inspection, and metrology application; automated optical inspection products; strobe inspection module sensor technology for 2D inspection of circuit boards; MX products for inspection of memory modules; and SPI products. The company offers CyberGage360, a near-line or off-line metrology tool; 3D scanning and metrology equipment; WaferSense, a series of wireless sensors; automatic leveling, automatic gapping, automatic teaching, and automatic vibration sensors; WaferSense airborne particle sensor; in-line particle sensor; WaferSense auto multi sensor; WaferSense auto resistance sensor; and auto vibration and leveling sensor. It sells its products to SMT electronic assembly circuit board manufacturers, end-user customers manufacturing their own circuit boards, semiconductor manufacturers, and outsourced semiconductor assembly and test companies through independent sales representatives and distributors. CyberOptics Corporation was founded in 1984 and is headquartered in Minneapolis, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Minneapolis"}, "CYE.F": {"short_name": "CYBEROPTICS CORP.", "long_name": "CyberOptics Corporation", "summary": "CyberOptics Corporation designs, develops, and manufactures high precision sensing technology solutions and system products worldwide. Its products are used in surface mount technology (SMT) and semiconductor industries to improve yields and productivity. The company offers products based on multi-reflection suppression (MRS) technology, including multi-function inspection and measurement machines, and memory module inspection system; high precision 3D and 2D sensors for inspection and metrology; and 3D MRS sensors that are used various applications, such as printed circuit boards, CPU sockets, solder balls and bumps, wafer bumps, copper pillars, and other wafer level and advanced packaging. It also provides SMT electronic assembly alignment sensor products comprises LaserAlign sensors that are incorporated into the placement heads of pick-and-place machines; inspection and metrology system products for process control, inspection, and metrology application; automated optical inspection products; strobe inspection module sensor technology for 2D inspection of circuit boards; MX products for inspection of memory modules; and SPI products. The company offers CyberGage360, a near-line or off-line metrology tool; 3D scanning and metrology equipment; WaferSense, a series of wireless sensors; automatic leveling, automatic gapping, automatic teaching, and automatic vibration sensors; WaferSense airborne particle sensor; in-line particle sensor; WaferSense auto multi sensor; WaferSense auto resistance sensor; and auto vibration and leveling sensor. It sells its products to SMT electronic assembly circuit board manufacturers, end-user customers manufacturing their own circuit boards, semiconductor manufacturers, and outsourced semiconductor assembly and test companies through independent sales representatives and distributors. CyberOptics Corporation was founded in 1984 and is headquartered in Minneapolis, Minnesota.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Minneapolis"}, "DYSL": {"short_name": "DYNASIL CORP OF AMERICA", "long_name": "Dynasil Corporation of America", "summary": "Dynasil Corporation of America develops, markets, manufactures, and sells detection, sensing, and analysis technology and optical components in the United States, Asia, Europe, and internationally. It operates through Optics, Innovation and Development, and Biomedical segments. The Optics segment supplies synthetic crystals, optical materials, components, and coatings that are used in devices, such as baggage scanners, medical imaging systems, optical instruments, lasers, analytical instruments, automotive components, semiconductor/electronic devices, spacecraft/aircraft components, and advertising displays in the medical, industrial, and homeland security/defense sectors. The Innovation and Development segment develops advanced technology in materials, sensors, and prototype instruments that detect or measure radiation, light, magnetism, or sound for use in security, medical, and industrial applications. The Biomedical segment engages in the development of tissue sealant products. The company distributes its products through direct sales and marketing staff, as well as through manufacturer's representatives and distributors. Dynasil Corporation of America was founded in 1960 and is headquartered in Newton, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Newton"}, "ELSE": {"short_name": "Electro-Sensors, Inc.", "long_name": "Electro-Sensors, Inc.", "summary": "Electro-Sensors, Inc. manufactures and sells industrial production monitoring and process control systems. The company manufactures and sells various monitoring systems that measure machine production and operation rates, as well as systems, which regulate the speed of related machines in production processes. Its speed monitoring systems include a line of products that measure production counts or rates, such as parts, gallons, or board feet; and alarm systems, tachometers, and other devices that translate impulses from the sensors into alarm signals, computer inputs, or digital displays. The company's temperature application products consist of bearing, gear box, and motor temperature monitoring sensors. It also offers production monitoring devices that include a belt alignment and slide gate position monitors; vibration monitoring products; and tilt switches. In addition, the company provides hazard monitoring systems, such as Electro-Sentry, which integrates its sensors for monitoring temperature, belt alignment, and shaft speed; and HazardPRO, a wireless hazard technology monitoring system, as well as HazardPRO software. It serves customers in various industries, including grain/feed/milling, bulk material, manufacturing, food product, ethanol, power generation, and other processing industries. The company sells its products through internal sales team, manufacturer's representatives, and distributors in the United States, Canada, Mexico, Bolivia, Chile, Colombia, Guatemala, Peru, the United Kingdom, Ukraine, Egypt, Saudi Arabia, India, Indonesia, Australia, New Zealand, China, Taiwan, Korea, Vietnam, Malaysia, the Philippines, and Singapore. Electro-Sensors, Inc. was founded in 1968 and is based in Minnetonka, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Minnetonka"}, "EQTL": {"short_name": "EQUITECH INTERNATIONAL CORP", "long_name": "Equitech International Corporation", "summary": "Equitech International Corporation is a developer of next generation fiber optic probes, analytical instruments, and electronic equipment used in research, industrial process control, and commercial and consumer electronics. The company was incorporated in 1996 and is based in New Ellenton, South Carolina.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "New Ellenton"}, "ERMG": {"short_name": "ERECORD MANAGEMENT INC", "long_name": "ERecord Management, Inc.", "summary": "ERecord Management, Inc. operates as a healthcare consulting company. It offers EMR solutions to healthcare providers in terms of health information systems and services; PMS solutions for enterprise appointment scheduling; and MRI solutions, which include MRI technology and PACS system software, as well as various installation, management, and daily staffing. The company also provides training, implementation, technical support, remote troubleshooting, and corporate office training services. ERecord Management focuses on solutions for electronic medical records, practice management systems, information technology security and audit services, and various other components of HIPAA compliance requirements. The company was founded in 2001. It was formerly known as R-Tec Technologies, Inc. and changed its name to ERecord Management, Inc. in January 2008. ERecord Management is based in Oak Park, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Oak Park"}, "ESE": {"short_name": "ESCO Technologies Inc.", "long_name": "ESCO Technologies Inc.", "summary": "ESCO Technologies Inc. produces and supplies engineered products and systems for industrial and commercial markets worldwide. It operates through three segments: Aerospace & Defense, Utility Solutions Group (USG), and RF Shielding and Test. The Aerospace & Defense segment designs and manufactures filtration products, including hydraulic filter elements and fluid control devices used in commercial aerospace applications; filter mechanisms used in micro-propulsion devices for satellites; and custom designed filters for manned aircraft and submarines. It also designs, develops, and manufactures elastomeric-based signature reduction solutions for U.S. naval vessels; and mission-critical bushings, pins, sleeves, and precision-tolerance machined components for landing gear, rotor heads, engine mounts, flight controls, and actuation systems for the aerospace and defense industries. The USG segment provides diagnostic testing solutions that enable electric power grid operators to assess the integrity of high-voltage power delivery equipment; and decision support tools for the renewable energy industry, primarily wind and solar. The RF Shielding and Test segment designs and manufactures RF test and secure communication facilities, acoustic test enclosures, RF and magnetically shielded rooms, RF measurement systems, and broadcast and recording studios; and RF absorptive materials and filters, active compensation systems, antennas, antenna masts, turntables, electric and magnetic probes, RF test cells, proprietary measurement software, and other test accessories to perform various tests. It also provides services, such as calibration for antennas and field probes, chamber certification, field surveys, customer training, and various product tests. The company distributes its products through a network of distributors, sales representatives, direct sales teams, and in-house sales personnel. ESCO Technologies Inc. was incorporated in 1990 and is based in St. Louis, Missouri.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Saint Louis"}, "ESNR": {"short_name": "ELECTRONIC SENSOR TECHNOLOGY IN", "long_name": "Electronic Sensor Technology, Inc.", "summary": "Electronic Sensor Technology, Inc. develops, manufactures, and sells electronic devices used for vapor analysis. The company offers zNose, an electronic nose designed for various industry applications, which can detect odors and chemical vapors produced by explosives, chemicals, and biological weapons, as well as used for identifying hazardous industrial materials, improvised explosives, and flammable materials. Its product is used in the homeland security, chemical and petrochemical, environmental, life science, and food and beverage industries. The company also provides spare parts, such as columns, saw detectors, and traps; and accessories, including rugged shipping case, battery assemblies, battery chargers, DC/AC inverters, desorbers, heaters, remote samplers, sample injectors, system controllers, user tool kits, and water traps, as well as support and validation services. Electronic Sensor Technology offers its products through online store. The company is based in Newbury Park, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Newbury Park"}, "F1LI34.SA": {"short_name": "FLIR SYSTEMSDRN", "long_name": "FLIR Systems, Inc.", "summary": "FLIR Systems, Inc. designs, develops, markets, and distributes thermal imaging systems, visible-light imaging systems, locater systems, measurement and diagnostic systems, and threat-detection solutions worldwide. The company operates in three segments: Industrial Business Unit, Government and Defense Business Unit, and Commercial Business Unit. The Industrial Business Unit segment offers thermal and visible-spectrum imaging camera cores and components for parties that create thermal, industrial, and other types of imaging systems; and products, such as thermal imaging cameras, gas detection cameras, firefighting cameras, process automation cameras, and environmental test and measurement devices. The Government and Defense Business Unit segment offers airborne, land, maritime, man-portable multi-spectrum imaging systems, radars, lasers, imaging components, integrated multi-sensor system platforms, CBRNE detectors, and nano-class UAS solutions, as well as services related to these systems. The Commercial Business Unit segment provides thermal and visible-spectrum security cameras, digital and networked video recorders, and related software and accessories; networked marine electronic systems that include multi-function helm displays, navigational instruments, autopilots, radars, sonar systems, thermal and visible imaging systems; communications equipment for boats, traffic cameras, sensors and associated traffic management software; and handheld thermal imagers. FLIR Systems, Inc. was founded in 1978 and is headquartered in Wilsonville, Oregon.", "currency": "BRL", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Wilsonville"}, "FARO": {"short_name": "FARO Technologies, Inc.", "long_name": "FARO Technologies, Inc.", "summary": "FARO Technologies, Inc. designs, develops, manufactures, markets, and supports software driven three-dimensional (3D) measurement and imaging solutions worldwide. It operates through three segments: 3D Manufacturing, Construction BIM, and Emerging Verticals. The company offers FaroArm, a combination of a portable articulated measurement arm, a computer, and CAM2 software programs; and FARO ScanArm, a FaroArm equipped with a hard probe and non-contact laser line probe to measure products. It also provides FARO Design ScanArm 2.5C, a portable lightweight 3D ScanArm; FARO Prizm, a full-color laser line probe with 3D design and modeling software; FARO Laser Tracker that combines a portable laser measurement tool, a computer, and CAM2 software programs; and FARO Tracer, which projects a laser line onto a surface or object; and FARO Focus laser scanner to measure and collect a cloud of data points. In addition, the company offers FARO ScanPlan, a handheld mapper that captures two-dimensional floor plans; and FARO Software, a family of computer-aided design-based measurement and laser scanner software. FARO Technologies, Inc. offers its products for manufacturing, industrial, architecture, surveying, building information modeling, construction, public safety forensics, cultural heritage, dental, and other applications. FARO Technologies, Inc. was founded in 1981 and is headquartered in Lake Mary, Florida.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Lake Mary"}, "FCUV": {"short_name": "FOCUS UNIVERSAL INC", "long_name": "Focus Universal Inc.", "summary": "Focus Universal Inc. develops and manufactures smart instrumentation platform and device. The company offers Ubiquitor, a wireless sensor device with a universal sensor node and gateway system that uses a computer or mobile device as the output display module that displays the readings of various probe modules. Its smart instrumentation platform (USIP) utilizes mobile devices or computers to communicate with smart devices, such as sensors, probes, and controllers to monitor and control any functions. The company also offers digital sensors and horticultural sensors, as well as universal smart controller (USC), a controller device. Further, it provides filter and handheld meter products, including fan speed adjuster, carbon filter, and HEPA filtration devices, as well as digital light and quantum par meters. Focus Universal Inc. sells its air filtration systems through distributors. The company was founded in 2009 and is based in Ontario, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Ontario"}, "FIT": {"short_name": "Fitbit, Inc.", "long_name": "Fitbit, Inc.", "summary": "Fitbit, Inc., a technology company, provides health solutions in the United States and internationally. The company offers a line of devices, including Fitbit Charge 3, Fitbit Inspire, Fitbit Inspire HR, and Fitbit Ace 2 activity trackers; Fitbit Ionic and Fitbit Versa family of smartwatches, as well as Fitbit Flyer wireless headphones and the Fitbit Aria family of connected scales; and accessories, such as bands and frames for its devices. It also offers Fitbit online dashboard and mobile apps that sync automatically with and display real-time data from its wearable devices; and Fitbit Care, a connected health platform for health plans, employers, and health systems. In addition, the company provides Fitbit Premium, a paid subscription service that uses the data of users to deliver actionable guidance and coaching to help users achieve their health and fitness goals, as well as includes Fitbit Coach that offers exercise programs through personal trainer and yoga apps. It sells its products through consumer electronics and specialty, e-commerce, mass merchant, department store, club, and sporting goods and outdoors retailers; wireless carriers; distributors; and Fitbit.com, an online store, as well as directly to consumers. Fitbit, Inc. has a collaboration with The Scripps Research Institute and Stanford Medicine to study the role of wearables to detect, track, and contain infectious diseases, such as COVID-19.; and partnership with Solera Health to reduce risk of type 2 diabetes. The company was formerly known as Healthy Metrics Research, Inc. and changed its name to Fitbit, Inc. in October 2007. Fitbit, Inc. was founded in 2007 and is headquartered in San Francisco, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "San Francisco"}, "FL4.F": {"short_name": "FLIR SYS INC.  DL-,01", "long_name": "FLIR Systems, Inc.", "summary": "FLIR Systems, Inc. designs, develops, markets, and distributes thermal imaging systems, visible-light imaging systems, locater systems, measurement and diagnostic systems, and threat-detection solutions worldwide. The company operates in three segments: Industrial Business Unit, Government and Defense Business Unit, and Commercial Business Unit. The Industrial Business Unit segment offers thermal and visible-spectrum imaging camera cores and components for parties that create thermal, industrial, and other types of imaging systems; and products, such as thermal imaging cameras, gas detection cameras, firefighting cameras, process automation cameras, and environmental test and measurement devices. The Government and Defense Business Unit segment offers airborne, land, maritime, man-portable multi-spectrum imaging systems, radars, lasers, imaging components, integrated multi-sensor system platforms, CBRNE detectors, and nano-class UAS solutions, as well as services related to these systems. The Commercial Business Unit segment provides thermal and visible-spectrum security cameras, digital and networked video recorders, and related software and accessories; networked marine electronic systems that include multi-function helm displays, navigational instruments, autopilots, radars, sonar systems, thermal and visible imaging systems; communications equipment for boats, traffic cameras, sensors and associated traffic management software; and handheld thermal imagers. FLIR Systems, Inc. was founded in 1978 and is headquartered in Wilsonville, Oregon.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Wilsonville"}, "FLIR": {"short_name": "FLIR Systems, Inc.", "long_name": "FLIR Systems, Inc.", "summary": "FLIR Systems, Inc. designs, develops, markets, and distributes thermal imaging systems, visible-light imaging systems, locater systems, measurement and diagnostic systems, and threat-detection solutions worldwide. The company operates in three segments: Industrial Business Unit, Government and Defense Business Unit, and Commercial Business Unit. The Industrial Business Unit segment offers thermal and visible-spectrum imaging camera cores and components for parties that create thermal, industrial, and other types of imaging systems; and products, such as thermal imaging cameras, gas detection cameras, firefighting cameras, process automation cameras, and environmental test and measurement devices. The Government and Defense Business Unit segment offers airborne, land, maritime, man-portable multi-spectrum imaging systems, radars, lasers, imaging components, integrated multi-sensor system platforms, CBRNE detectors, and nano-class UAS solutions, as well as services related to these systems. The Commercial Business Unit segment provides thermal and visible-spectrum security cameras, digital and networked video recorders, and related software and accessories; networked marine electronic systems that include multi-function helm displays, navigational instruments, autopilots, radars, sonar systems, thermal and visible imaging systems; communications equipment for boats, traffic cameras, sensors and associated traffic management software; and handheld thermal imagers. FLIR Systems, Inc. was founded in 1978 and is headquartered in Wilsonville, Oregon.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Wilsonville"}, "FLXT": {"short_name": "FLEXPOINT SENSOR SYSTEMS INC", "long_name": "Flexpoint Sensor Systems, Inc.", "summary": "Flexpoint Sensor Systems, Inc. designs, engineers, manufactures, and sells bend sensor technology and products using its patented Bend Sensor flexible potentiometer technology. The company's Bend Sensor technology is a flexible potentiometer bend sensor product consisting of a coated substrate, such as plastic that changes electrical conductivity as it is bent in a consistent manner. It provides various products for automotive industry applications, including seat belt reminders, horn switches, braking systems, and emergency vehicles. The company also offers products for use in toys, wearables, disposable colonoscope devices, other medical devices, medical beds, flow control applications, shoes, industrial control systems, medical equipment and instrumentation, computer peripherals, automotive transmission equipment, commercial vending equipment, and other devices. Flexpoint Sensor Systems, Inc. sells its products to original equipment manufacturers, manufacturers, or distributors worldwide. The company was formerly known as Micropoint, Inc. and changed its name to Flexpoint Sensor Systems, Inc. in July 1999. Flexpoint Sensor Systems, Inc. was founded in 1992 and is based in Draper, Utah.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Draper"}, "FT1.F": {"short_name": "FARO TECHS INC.  DL-,001", "long_name": "FARO Technologies, Inc.", "summary": "FARO Technologies, Inc. designs, develops, manufactures, markets, and supports software driven three-dimensional (3D) measurement and imaging solutions worldwide. It operates through three segments: 3D Manufacturing, Construction BIM, and Emerging Verticals. The company offers FaroArm, a combination of a portable articulated measurement arm, a computer, and CAM2 software programs; and FARO ScanArm, a FaroArm equipped with a hard probe and non-contact laser line probe to measure products. It also provides FARO Design ScanArm 2.5C, a portable lightweight 3D ScanArm; FARO Prizm, a full-color laser line probe with 3D design and modeling software; FARO Laser Tracker that combines a portable laser measurement tool, a computer, and CAM2 software programs; and FARO Tracer, which projects a laser line onto a surface or object; and FARO Focus laser scanner to measure and collect a cloud of data points. In addition, the company offers FARO ScanPlan, a handheld mapper that captures two-dimensional floor plans; and FARO Software, a family of computer-aided design-based measurement and laser scanner software. FARO Technologies, Inc. offers its products for manufacturing, industrial, architecture, surveying, building information modeling, construction, public safety forensics, cultural heritage, dental, and other applications. FARO Technologies, Inc. was founded in 1981 and is headquartered in Lake Mary, Florida.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Lake Mary"}, "FTV": {"short_name": "Fortive Corporation", "long_name": "Fortive Corporation", "summary": "Fortive Corporation designs, develops, manufactures, markets, and services professional and engineered products, software, and services worldwide. Its Professional Instrumentation segment provides test tools, and thermal imaging and calibration equipment for electrical, industrial, electronic, and calibration applications; online condition-based monitoring equipment; portable gas detection equipment, consumables, and software as a service offerings; subscription-based technical, analytical, and compliance services; and software, data analytics, and services for critical infrastructure in utility, industrial, energy, construction, facilities management, public safety, mining, and healthcare applications, as well as environmental, health, and safety applications. This segment also provides product realization services and products that help developers and engineers across the end-to-end product creation cycle from concepts to finished products; materials components; devices that sense, monitor, and control operational or manufacturing variables; and critical sterilization and disinfection solutions. It markets its products and services under the ACCRUENT, FLUKE, FLUKE BIOMEDICAL, FLUKE NETWORKS, GORDIAN, INDUSTRIAL SCIENTIFIC, INTELEX, LANDAUER, PRUFTECHNIK, QUALITROL, INVETECH, KEITHLEY, PACIFIC SCIENTIFIC, SONIX, and TEKTRONIX brands. The company's Industrial Technologies segment offers solutions and services for use in fuel dispensing, remote fuel management, point-of-sale and payment systems, environmental compliance, vehicle tracking, and fleet and traffic management under the ANGI, GASBOY, GILBARCO, GILBARCO AUTOTANK, ORPAK, VEEDER-ROOT, and TELETRAC NAVMAN brands. This segment also offers professional tools, toolboxes, and automotive diagnostic equipment under the MATCO brand; and wheel service equipment under the COATS brand. Fortive Corporation was incorporated in 2015 and is headquartered in Everett, Washington.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Everett"}, "FTV-PA": {"short_name": "Fortive Corporation 5.00% Manda", "long_name": "Fortive Corporation", "summary": "Fortive Corporation designs, develops, manufactures, markets, and services professional and engineered products, software, and services worldwide. Its Professional Instrumentation segment provides test tools, and thermal imaging and calibration equipment for electrical, industrial, electronic, and calibration applications; online condition-based monitoring equipment; portable gas detection equipment, consumables, and software as a service offerings; subscription-based technical, analytical, and compliance services; and software, data analytics, and services for critical infrastructure in utility, industrial, energy, construction, facilities management, public safety, mining, and healthcare applications, as well as environmental, health, and safety applications. This segment also provides product realization services and products that help developers and engineers across the end-to-end product creation cycle from concepts to finished products; materials components; devices that sense, monitor, and control operational or manufacturing variables; and critical sterilization and disinfection solutions. It markets its products and services under the ACCRUENT, FLUKE, FLUKE BIOMEDICAL, FLUKE NETWORKS, GORDIAN, INDUSTRIAL SCIENTIFIC, INTELEX, LANDAUER, PRUFTECHNIK, QUALITROL, INVETECH, KEITHLEY, PACIFIC SCIENTIFIC, SONIX, and TEKTRONIX brands. The company's Industrial Technologies segment offers solutions and services for use in fuel dispensing, remote fuel management, point-of-sale and payment systems, environmental compliance, vehicle tracking, and fleet and traffic management under the ANGI, GASBOY, GILBARCO, GILBARCO AUTOTANK, ORPAK, VEEDER-ROOT, and TELETRAC NAVMAN brands. This segment also offers professional tools, toolboxes, and automotive diagnostic equipment under the MATCO brand; and wheel service equipment under the COATS brand. Fortive Corporation was incorporated in 2015 and is headquartered in Everett, Washington.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Everett"}, "G66.F": {"short_name": "GENASYS INC.  DL-,00001", "long_name": "Genasys Inc.", "summary": "Genasys Inc., a communication company, designs, develops, and commercializes directed and multidirectional sound technologies, voice broadcast products, and location-based mass messaging solutions for emergency warning and workforce management worldwide. The company operates through two segments, Hardware and Software. It provides long range acoustic devices, such as acoustic hailing devices which are used to project sirens and audible voice messages; and Genasys Emergency Management, a unified software platform for cloud, on-premise or hybrid operations. The company also offers Integrated Mass Notification Solutions, including Genasys voice arrays, which project sirens and audible voice messages 60Â° - 360Â° with vocal clarity from close range to approximately 14 square kilometers; and GEM software to deliver SMS, text, email, and social media alerts to people at risk in defined geographic areas. It sells its products directly to governments, militaries, end-users, and commercial companies. The company was formerly known as LRAD Corporation. Genasys Inc. is based in San Diego, California.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "San Diego"}, "GIGA": {"short_name": "Giga-tronics Incorporated", "long_name": "Giga-tronics Incorporated", "summary": "Giga-tronics Incorporated, together with its subsidiaries, develops and manufactures electronics equipment for military test and airborne operational applications in the United States, Europe, Asia, and internationally. It operates through two segments, Microsource and the Giga-tronics Division. The company also develops microwave integrated components, as well as MIC components; Band Reject Filters for RADAR/EW (electronic warfare) for solving interference problems in RADAR/EW applications; self-protection systems for military aircrafts; and RADAR filters for military fighter jet aircraft. In addition, it designs, manufactures, and markets functional test products for testing RADAR/EW equipment of the defense electronics market. The company serves prime defense contractors, the armed services, and research institutes. Giga-tronics Incorporated was founded in 1980 and is headquartered in Dublin, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Dublin"}, "GNSS": {"short_name": "Genasys Inc.", "long_name": "Genasys Inc.", "summary": "Genasys Inc., a communication company, designs, develops, and commercializes directed and multidirectional sound technologies, voice broadcast products, and location-based mass messaging solutions for emergency warning and workforce management worldwide. The company operates through two segments, Hardware and Software. It provides long range acoustic devices, such as acoustic hailing devices which are used to project sirens and audible voice messages; and Genasys Emergency Management, a unified software platform for cloud, on-premise or hybrid operations. The company also offers Integrated Mass Notification Solutions, including Genasys voice arrays, which project sirens and audible voice messages 60Â° - 360Â° with vocal clarity from close range to approximately 14 square kilometers; and GEM software to deliver SMS, text, email, and social media alerts to people at risk in defined geographic areas. It sells its products directly to governments, militaries, end-users, and commercial companies. The company was formerly known as LRAD Corporation. Genasys Inc. is based in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Diego"}, "GWSO": {"short_name": "GLOBAL WARMING SOLUTIONS INC", "long_name": "Global Warming Solutions, Inc.", "summary": "Global Warming Solutions, Inc., a development stage company, focuses on development and commercialization of technologies that help mitigate global warming and effects on the planet. The company's solutions include light electric thermal generator solar energetic system, a hybrid solar and thermal energy generation technology that works by heating up liquids that circulate on the surface of solar panels to generate electricity; and generator/engine/motor hybrid energy system for the use in engine applications that include lawnmowers, powerboats, and snowmobiles. It also develops pureray water purification system, a technology that purifies water and other consumable liquids; and wave power station, a system that is designed to capture the power of energy of sea waves, which generates electricity. The company was formerly known as Southern Investments, Inc. and changed its name to Global Warming Solutions, Inc. in July 2007. Global Warming Solutions, Inc. was founded in 1999 and is based in Houston, Texas.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Houston"}, "II6.F": {"short_name": "II-VI INC.", "long_name": "II-VI Incorporated", "summary": "II-VI Incorporated develops, manufactures, and markets engineered materials, and optoelectronic components and devices worldwide. The company operates through two segments, Compound Semiconductors and Photonic Solutions. The Compound Semiconductors segment offers optical and electro-optical components and materials used in high-power CO2 lasers; fiber-delivered beam delivery systems, and processing tools and direct diode lasers for industrial lasers; and compound semiconductor epitaxial and gallium arsenide wafers. This segment also provides infrared optical components and optical assemblies for aerospace and defense, medical, and commercial laser imaging applications; semiconductor lasers and detectors for optical interconnects and sensing applications with InP; and engineered materials for thermoelectric and silicon carbide applications to the semiconductor, aerospace, and defense and medical markets. In addition, it offers compound semiconductor epitaxial wafers for applications in optical components, wireless devices, and communication systems; and GaAs wafers for the production of lasers and integrated circuits. The Photonic Solutions segment provides crystal materials, optics, microchip lasers, and optoelectronic modules for use in optical communication networks and other consumer, life sciences, and commercial applications. This segment also offers pump lasers, optical isolators, and optical amplifiers and micro-optics for optical amplifiers, terrestrial and submarine applications. The company serves original equipment manufacturers, laser end users, system integrators of high-power lasers, U.S. government prime contractors, and various U.S. government agencies, as well as manufacturers of equipment and devices for industrial, optical communications, consumer electronics, security and monitoring applications. The company was founded in 1971 and is headquartered in Saxonburg, Pennsylvania.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Saxonburg"}, "IIVI": {"short_name": "II-VI Incorporated", "long_name": "II-VI Incorporated", "summary": "II-VI Incorporated develops, manufactures, and markets engineered materials, and optoelectronic components and devices worldwide. The company operates through two segments, Compound Semiconductors and Photonic Solutions. The Compound Semiconductors segment offers optical and electro-optical components and materials used in high-power CO2 lasers; fiber-delivered beam delivery systems, and processing tools and direct diode lasers for industrial lasers; and compound semiconductor epitaxial and gallium arsenide wafers. This segment also provides infrared optical components and optical assemblies for aerospace and defense, medical, and commercial laser imaging applications; semiconductor lasers and detectors for optical interconnects and sensing applications with InP; and engineered materials for thermoelectric and silicon carbide applications to the semiconductor, aerospace, and defense and medical markets. In addition, it offers compound semiconductor epitaxial wafers for applications in optical components, wireless devices, and communication systems; and GaAs wafers for the production of lasers and integrated circuits. The Photonic Solutions segment provides crystal materials, optics, microchip lasers, and optoelectronic modules for use in optical communication networks and other consumer, life sciences, and commercial applications. This segment also offers pump lasers, optical isolators, and optical amplifiers and micro-optics for optical amplifiers, terrestrial and submarine applications. The company serves original equipment manufacturers, laser end users, system integrators of high-power lasers, U.S. government prime contractors, and various U.S. government agencies, as well as manufacturers of equipment and devices for industrial, optical communications, consumer electronics, security and monitoring applications. The company was founded in 1971 and is headquartered in Saxonburg, Pennsylvania.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Saxonburg"}, "IIVIP": {"short_name": "II-VI Incorporated - 6.00% Seri", "long_name": "II-VI Incorporated", "summary": "II-VI Incorporated develops, manufactures, and markets engineered materials, and optoelectronic components and devices worldwide. The company operates through two segments, Compound Semiconductors and Photonic Solutions. The Compound Semiconductors segment offers optical and electro-optical components and materials used in high-power CO2 lasers; fiber-delivered beam delivery systems, and processing tools and direct diode lasers for industrial lasers; and compound semiconductor epitaxial and gallium arsenide wafers. This segment also provides infrared optical components and optical assemblies for aerospace and defense, medical, and commercial laser imaging applications; semiconductor lasers and detectors for optical interconnects and sensing applications with InP; and engineered materials for thermoelectric and silicon carbide applications to the semiconductor, aerospace, and defense and medical markets. In addition, it offers compound semiconductor epitaxial wafers for applications in optical components, wireless devices, and communication systems; and GaAs wafers for the production of lasers and integrated circuits. The Photonic Solutions segment provides crystal materials, optics, microchip lasers, and optoelectronic modules for use in optical communication networks and other consumer, life sciences, and commercial applications. This segment also offers pump lasers, optical isolators, and optical amplifiers and micro-optics for optical amplifiers, terrestrial and submarine applications. The company serves original equipment manufacturers, laser end users, system integrators of high-power lasers, U.S. government prime contractors, and various U.S. government agencies, as well as manufacturers of equipment and devices for industrial, optical communications, consumer electronics, security and monitoring applications. The company was founded in 1971 and is headquartered in Saxonburg, Pennsylvania.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Saxonburg"}, "IKE.AX": {"short_name": "IKE GPS FPO NZX", "long_name": "ikeGPS Group Limited", "summary": "ikeGPS Group Limited, together with its subsidiaries, designs, markets, and sells integrated GPS data capture devices and related software primarily in the United States. The company operates through Utility & Communications, and New Business segments. It offers Spike, a smart laser measurement solution for various industries and professional use to measure and locate an object. The company also engages in the signage, architecture engineering and construction, and geospatial activities; and provides consulting solutions. ikeGPS Group Limited serves sign and graphics, utilities, construction and home, government, appraisals and assessments, facility and asset management, window film, and architecture sectors. The company was formerly known as Surveylab Group Limited and changed its name to ikeGPS Group Limited in October 2013. ikeGPS Group Limited was founded in 2003 and is headquartered in Broomfield, Colorado.", "currency": "AUD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "ASX", "market": "au_market", "country": "United States", "city": "Broomfield"}, "IKE.NZ": {"short_name": "ikeGPS Group Limited Ordinary S", "long_name": "ikeGPS Group Limited", "summary": "ikeGPS Group Limited, together with its subsidiaries, designs, markets, and sells integrated GPS data capture devices and related software primarily in the United States. The company operates through Utility & Communications, and New Business segments. It offers Spike, a smart laser measurement solution for various industries and professional use to measure and locate an object. The company also engages in the signage, architecture engineering and construction, and geospatial activities; and provides consulting solutions. ikeGPS Group Limited serves sign and graphics, utilities, construction and home, government, appraisals and assessments, facility and asset management, window film, and architecture sectors. The company was formerly known as Surveylab Group Limited and changed its name to ikeGPS Group Limited in October 2013. ikeGPS Group Limited was founded in 2003 and is headquartered in Broomfield, Colorado.", "currency": "NZD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NZE", "market": "nz_market", "country": "United States", "city": "Broomfield"}, "IRBL": {"short_name": "INROB TECH LTD", "long_name": "InRob Tech Ltd.", "summary": "InRob Tech Ltd. provides engineering products and services for the maintenance of equipment, and the integration and production of wireless control solutions for unmanned ground vehicle robots (UVR) for military and law enforcement UVR applications and control solutions. The company's UVR solutions comprise remote control systems, complete robot systems, and customized solutions. It also targets the civilian applications market, which includes solar powered equipment, as well as nuclear plant maintenance, inspection, and decommissioning; the demolition industry; and firefighting and rescue services. The company is based in Las Vegas, Nevada.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Las Vegas"}, "ISNS": {"short_name": "Image Sensing Systems, Inc.", "long_name": "Image Sensing Systems, Inc.", "summary": "Image Sensing Systems, Inc. develops and markets video and radar processing products for the intelligent transportation systems industry worldwide. The company operates through two segments, Intersection and Highway. It offers various vehicle and traffic detection products, including Autoscope video systems and RTMS radar systems that convert sensory input collected by video cameras and radar units into vehicle detection and traffic data used to operate, monitor, and enhance the efficiency of roadway infrastructure. The company provides its video and radar processing products for use in traffic applications, such as intersection control, highway, bridge and tunnel traffic management, and traffic data collection. It markets and sells its products to end users comprising federal, state, city, and county departments of transportation, port, highway, tunnel, and other transportation authorities, as well as system integrators or other suppliers of systems and services who are operating under subcontracts in connection with road construction contracts. Image Sensing Systems, Inc. was founded in 1984 and is headquartered in Saint Paul, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Saint Paul"}, "IT6.F": {"short_name": "ITRON INC.", "long_name": "Itron, Inc.", "summary": "Itron, Inc., a technology and service company, provides end-to-end solutions that help manage operations in the energy, water, and smart city space worldwide. The company operates through three segments: Device Solutions, Networked Solutions, and Outcomes. The Device Solutions segment offers hardware products that are used for measurement, control, or sensing. The Networked Solutions segment provides a combination of communicating devices, such as smart meters, modules, endpoints, and sensors; network infrastructure; and associated application software for acquiring and transporting application-specific data. The Outcomes segment offers enhanced software and services for managing, organizing, analyzing, and interpreting data to enhance decision making, maximize operational profitability, drive resource efficiency, and deliver results for consumers, utilities, and smart cities. In addition, it offers software implementation, project management, installation, consulting, and post-sale maintenance support services, as well as cloud and software-as-a-service; and extended or customer-specific warranties. It offers its products and services under the Itron brand. The company markets its products directly through its sales force, as well as through indirect sales force consisting of distributors, sales representatives, partners, and meter manufacturer representatives to utilities and municipalities. Itron, Inc. was founded in 1977 and is headquartered in Liberty Lake, Washington.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Liberty Lake"}, "ITRI": {"short_name": "Itron, Inc.", "long_name": "Itron, Inc.", "summary": "Itron, Inc., a technology and service company, provides end-to-end solutions that help manage operations in the energy, water, and smart city space worldwide. The company operates through three segments: Device Solutions, Networked Solutions, and Outcomes. The Device Solutions segment offers hardware products that are used for measurement, control, or sensing. The Networked Solutions segment provides a combination of communicating devices, such as smart meters, modules, endpoints, and sensors; network infrastructure; and associated application software for acquiring and transporting application-specific data. The Outcomes segment offers enhanced software and services for managing, organizing, analyzing, and interpreting data to enhance decision making, maximize operational profitability, drive resource efficiency, and deliver results for consumers, utilities, and smart cities. In addition, it offers software implementation, project management, installation, consulting, and post-sale maintenance support services, as well as cloud and software-as-a-service; and extended or customer-specific warranties. It offers its products and services under the Itron brand. The company markets its products directly through its sales force, as well as through indirect sales force consisting of distributors, sales representatives, partners, and meter manufacturer representatives to utilities and municipalities. Itron, Inc. was founded in 1977 and is headquartered in Liberty Lake, Washington.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Liberty Lake"}, "K1SG34.SA": {"short_name": "KEYSIGHT TECDRN", "long_name": "Keysight Technologies, Inc.", "summary": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific. Its Communications Solutions Group segment provides electronic design automation (EDA) software; radio frequency and microwave test instruments; hardware and virtual network test platforms and software applications, including data center, routing and switching, software defined networking, security, and encryption; oscilloscopes, logic and serial protocol analyzers, logic-signal sources, arbitrary waveform generators, and bit error rate testers; optical modulation analyzers, optical component analyzers, optical power meters, and optical laser source solutions; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company's Electronic Industrial Solutions Group segment offers design tools; design verification solutions; and digital multi-meters, function generators, frequency counters, data acquisition systems, audio analyzers, LCR meters, thermal imagers, precision source measure units, ultra-high precision device current analyzers, and test executive software platforms, as well as various power supplies comprising AC/DC modular supplies and electronically programmable loads. This segment also provides printed-circuit-board-assembly testers, integrated circuit parametric testers, and sub-nano-meter positioning sub-assemblies; test and measurement products and software; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company sells its products through direct sales force, distributors, resellers, and manufacturer's representatives. Keysight Technologies, Inc. was incorporated in 2013 and is headquartered in Santa Rosa, California.", "currency": "BRL", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "SAO", "market": "br_market", "country": "United States", "city": "Santa Rosa"}, "KEYS": {"short_name": "Keysight Technologies Inc.", "long_name": "Keysight Technologies, Inc.", "summary": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific. Its Communications Solutions Group segment provides electronic design automation (EDA) software; radio frequency and microwave test instruments; hardware and virtual network test platforms and software applications, including data center, routing and switching, software defined networking, security, and encryption; oscilloscopes, logic and serial protocol analyzers, logic-signal sources, arbitrary waveform generators, and bit error rate testers; optical modulation analyzers, optical component analyzers, optical power meters, and optical laser source solutions; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company's Electronic Industrial Solutions Group segment offers design tools; design verification solutions; and digital multi-meters, function generators, frequency counters, data acquisition systems, audio analyzers, LCR meters, thermal imagers, precision source measure units, ultra-high precision device current analyzers, and test executive software platforms, as well as various power supplies comprising AC/DC modular supplies and electronically programmable loads. This segment also provides printed-circuit-board-assembly testers, integrated circuit parametric testers, and sub-nano-meter positioning sub-assemblies; test and measurement products and software; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company sells its products through direct sales force, distributors, resellers, and manufacturer's representatives. Keysight Technologies, Inc. was incorporated in 2013 and is headquartered in Santa Rosa, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Santa Rosa"}, "KEYS.MX": {"short_name": "KEYSIGHT TECHNOLOGIES INC", "long_name": "Keysight Technologies, Inc.", "summary": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific. Its Communications Solutions Group segment provides electronic design automation (EDA) software; radio frequency and microwave test instruments; hardware and virtual network test platforms and software applications, including data center, routing and switching, software defined networking, security, and encryption; oscilloscopes, logic and serial protocol analyzers, logic-signal sources, arbitrary waveform generators, and bit error rate testers; optical modulation analyzers, optical component analyzers, optical power meters, and optical laser source solutions; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company's Electronic Industrial Solutions Group segment offers design tools; design verification solutions; and digital multi-meters, function generators, frequency counters, data acquisition systems, audio analyzers, LCR meters, thermal imagers, precision source measure units, ultra-high precision device current analyzers, and test executive software platforms, as well as various power supplies comprising AC/DC modular supplies and electronically programmable loads. This segment also provides printed-circuit-board-assembly testers, integrated circuit parametric testers, and sub-nano-meter positioning sub-assemblies; test and measurement products and software; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company sells its products through direct sales force, distributors, resellers, and manufacturer's representatives. Keysight Technologies, Inc. was incorporated in 2013 and is headquartered in Santa Rosa, California.", "currency": "MXN", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Santa Rosa"}, "KNWN": {"short_name": "KNOW LABS INC", "long_name": "Know Labs, Inc.", "summary": "Know Labs, Inc., develops, markets, and sells proprietary technologies in the United States. Its proprietary platform technologies include ChromaID and Bio-RFID technologies that utilize electromagnetic energy along the electromagnetic spectrum to perform analytics, which allow the user to identify, authenticate, and diagnose various organic and non-organic materials and substances. The company, through its subsidiary TransTech Systems, Inc., distributes products for employee and personnel identification and authentication. The company was formerly known as Visualant, Incorporated and changed its name to Know Labs, Inc. in May 2018. Know Labs, Inc. was founded in 1998 and is headquartered in Seattle, Washington.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Seattle"}, "LCTC": {"short_name": "LIFELOC TECHNOLOGIES INC", "long_name": "Lifeloc Technologies, Inc.", "summary": "Lifeloc Technologies, Inc. develops, manufactures, and markets portable hand-held and fixed station breathalyzers and related accessories for law enforcement, workplace, corrections, original equipment manufacturing, and consumer markets worldwide. It offers fuel-cell based breath alcohol testing equipment; and a line of supplies, accessories, services, and training to support customers' alcohol testing programs. The company also develops and sells online drug and alcohol training and refresher courses. In addition, it engages in the ownership and rental of real property through existing commercial leases. The company was founded in 1983 and is headquartered in Wheat Ridge, Colorado. Lifeloc Technologies, Inc. is a subsidiary of EDCO Partners LLLP.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wheat Ridge"}, "LUNA": {"short_name": "Luna Innovations Incorporated", "long_name": "Luna Innovations Incorporated", "summary": "Luna Innovations Incorporated develops, manufactures, and markets fiber optic sensing, and test and measurement products worldwide. It operates through two segments, Products and Licensing, and Technology Development. The Products and Licensing segment offers test and measurement products, which include optical vector analyzer, optical backscatter reflectometers, and the Phoenix family of tunable lasers; optical distributed sensor interrogator sensing solutions for distributed strain and temperature measurements; and Hyperion sensing solution that enable full-spectrum data acquisition and flexible peak detect algorithms of fiber-bragg grating (FBG), long period FBGs and fabry-perot sensors with low-latency access to data for closed loop feedback applications. This segment also provides general photonics comprising components, modules, and instruments to measure, manage, and control polarization and group delay in fiber optic networks; tunable lasers; and TeraMetrix products to measure and verify physical properties online and in real-time to reduce raw materials and rework costs in manufacturing processes as well as to conduct quality control monitoring utilizing terahertz measurement technologies. The Technology Development segment provides applied research for customers principally in the areas of sensing and instrumentation, advanced materials, and health sciences. The company sells its products to telecommunications companies, defense agencies, government system integrators, researchers, original equipment manufacturers, distributors, testing labs, and strategic partners directly, as well as through manufacturer representative organizations, partner and distribution channels, technical sales engineers, value added resellers, and independent sales representatives. Luna Innovations Incorporated was founded in 1990 and is headquartered in Roanoke, Virginia.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NCM", "market": "us_market", "country": "United States", "city": "Roanoke"}, "LVHK.ME": {"short_name": "LEVENHUK INC", "long_name": "Levenhuk Inc.", "summary": "Levenhuk Inc. manufactures and sells optical devices and instruments. It offers telescopes, microscopes, binoculars, spotting scopes, magnifiers, monoculars, and accessories, as well as microscope slides, star charts, cleaning accessories for optics, and educational materials on natural science. The company offers its optics primarily under the Levenhuk brand name. It operates through a dealer network in the United States, Canada, India, Azerbaijan, Southeast Asia, and Europe. The company was founded in 2002 and is headquartered in Tampa, Florida.", "currency": "RUB", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "MCX", "market": "ru_market", "country": "United States", "city": "Tampa"}, "MIND": {"short_name": "MIND Technology, Inc.", "long_name": "MIND Technology, Inc.", "summary": "MIND Technology, Inc., through its subsidiaries, provides technology to the oceanographic, hydrographic, defense, seismic and maritime security industries in the United States, Singapore, Malaysia, the United Kingdom, and internationally. The company operates in two segments, Marine Technology Products, and Equipment Leasing. The Marine Technology Products segment develops, manufactures, and sells proprietary products. Its products include the GunLink seismic source acquisition and control systems that provide operators of marine seismic surveys with precise monitoring and control of energy sources; the BuoyLink RGPS tracking system, which is used to offer precise positioning of marine seismic energy sources and streamers; Digishot energy source controllers; Sleeve Gun energy sources; SeaLink product line of marine sensors and solid streamer systems; and HarborGuard, an integrated waterside surveillance and security system that combines radar, video, and other surveillance technology to provide security for various waterside installations. This segment also provides streamer weight collars, depth and pressure transducers, air control valves, and source array systems; spare and replacement parts; repair and engineering services, training and field service operations, and umbilical termination; and equipment, consumables, systems integration, engineering hardware, and software maintenance support services. The Equipment Leasing segment leases seismic equipment for short-term primarily to seismic data acquisition contractors and oil field service providers. This segment also sells used equipment from its lease pool. The company was formerly known as Mitcham Industries, Inc. MIND Technology, Inc. was founded in 1987 and is headquartered in The Woodlands, Texas.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "The Woodlands"}, "MINDP": {"short_name": "MIND Technology, Inc. - Series ", "long_name": "MIND Technology, Inc.", "summary": "MIND Technology, Inc., through its subsidiaries, provides technology to the oceanographic, hydrographic, defense, seismic and maritime security industries in the United States, Singapore, Malaysia, the United Kingdom, and internationally. The company operates in two segments, Marine Technology Products, and Equipment Leasing. The Marine Technology Products segment develops, manufactures, and sells proprietary products. Its products include the GunLink seismic source acquisition and control systems that provide operators of marine seismic surveys with precise monitoring and control of energy sources; the BuoyLink RGPS tracking system, which is used to offer precise positioning of marine seismic energy sources and streamers; Digishot energy source controllers; Sleeve Gun energy sources; SeaLink product line of marine sensors and solid streamer systems; and HarborGuard, an integrated waterside surveillance and security system that combines radar, video, and other surveillance technology to provide security for various waterside installations. This segment also provides streamer weight collars, depth and pressure transducers, air control valves, and source array systems; spare and replacement parts; repair and engineering services, training and field service operations, and umbilical termination; and equipment, consumables, systems integration, engineering hardware, and software maintenance support services. The Equipment Leasing segment leases seismic equipment for short-term primarily to seismic data acquisition contractors and oil field service providers. This segment also sells used equipment from its lease pool. The company was formerly known as Mitcham Industries, Inc. MIND Technology, Inc. was founded in 1987 and is headquartered in The Woodlands, Texas.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "The Woodlands"}, "MKSI": {"short_name": "MKS Instruments, Inc.", "long_name": "MKS Instruments, Inc.", "summary": "MKS Instruments, Inc. provides instruments, systems, subsystems, and process control solutions that measure, monitor, deliver, analyze, power, and control critical parameters of manufacturing processes worldwide. Its Vacuum & Analysis segment offers pressure and vacuum control solutions, including direct and indirect pressure measurement; materials delivery solutions comprising flow and valve technologies, as well as integrated pressure measurement and control subsystems, which provide customers with precise control capabilities; power delivery products, such as microwave, power delivery systems, radio frequency matching networks, and metrology products used in providing energy to etching, stripping, and deposition processes; and plasma and reactive gas products. The company's Light & Motion segment offers lasers and laser-based systems, such as amplifiers, fiber lasers, diode-pumped solid-state lasers, high-energy pulsed lasers, and tunable lasers; and photonics products comprising optical components, lens assemblies, and vibration isolation solutions, as well as instruments and motion products, such as high-precision motion stages and controls, hexapods, photonics instruments for measurement and analysis, and production equipment for test and measurement. Its Equipment & Solutions segment provides laser-based systems for printed circuit board (PCB) manufacturing, including flexible interconnect PCB processing systems and HDI solutions for rigid PCB manufacturing and substrate processing, as well as passive component MLCC testing. The company serves semiconductor, industrial technologies, life and health sciences, research, and defense markets. It markets and sells its products and services through its direct sales organization, independent distributors, and sales representatives, as well as through its websites and product catalogs. MKS Instruments, Inc. was founded in 1961 and is headquartered in Andover, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Andover"}, "MKSI.MX": {"short_name": "MKS INSTRUMENTS INC", "long_name": "MKS Instruments, Inc.", "summary": "MKS Instruments, Inc. provides instruments, systems, subsystems, and process control solutions that measure, monitor, deliver, analyze, power, and control critical parameters of manufacturing processes worldwide. Its Vacuum & Analysis segment offers pressure and vacuum control solutions, including direct and indirect pressure measurement; materials delivery solutions comprising flow and valve technologies, as well as integrated pressure measurement and control subsystems, which provide customers with precise control capabilities; power delivery products, such as microwave, power delivery systems, radio frequency matching networks, and metrology products used in providing energy to etching, stripping, and deposition processes; and plasma and reactive gas products. The company's Light & Motion segment offers lasers and laser-based systems, such as amplifiers, fiber lasers, diode-pumped solid-state lasers, high-energy pulsed lasers, and tunable lasers; and photonics products comprising optical components, lens assemblies, and vibration isolation solutions, as well as instruments and motion products, such as high-precision motion stages and controls, hexapods, photonics instruments for measurement and analysis, and production equipment for test and measurement. Its Equipment & Solutions segment provides laser-based systems for printed circuit board (PCB) manufacturing, including flexible interconnect PCB processing systems and HDI solutions for rigid PCB manufacturing and substrate processing, as well as passive component MLCC testing. The company serves semiconductor, industrial technologies, life and health sciences, research, and defense markets. It markets and sells its products and services through its direct sales organization, independent distributors, and sales representatives, as well as through its websites and product catalogs. MKS Instruments, Inc. was founded in 1961 and is headquartered in Andover, Massachusetts.", "currency": "MXN", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Andover"}, "MKT.F": {"short_name": "MKS INSTRUMENTS INC.", "long_name": "MKS Instruments, Inc.", "summary": "MKS Instruments, Inc. provides instruments, systems, subsystems, and process control solutions that measure, monitor, deliver, analyze, power, and control critical parameters of manufacturing processes worldwide. Its Vacuum & Analysis segment offers pressure and vacuum control solutions, including direct and indirect pressure measurement; materials delivery solutions comprising flow and valve technologies, as well as integrated pressure measurement and control subsystems, which provide customers with precise control capabilities; power delivery products, such as microwave, power delivery systems, radio frequency matching networks, and metrology products used in providing energy to etching, stripping, and deposition processes; and plasma and reactive gas products. The company's Light & Motion segment offers lasers and laser-based systems, such as amplifiers, fiber lasers, diode-pumped solid-state lasers, high-energy pulsed lasers, and tunable lasers; and photonics products comprising optical components, lens assemblies, and vibration isolation solutions, as well as instruments and motion products, such as high-precision motion stages and controls, hexapods, photonics instruments for measurement and analysis, and production equipment for test and measurement. Its Equipment & Solutions segment provides laser-based systems for printed circuit board (PCB) manufacturing, including flexible interconnect PCB processing systems and HDI solutions for rigid PCB manufacturing and substrate processing, as well as passive component MLCC testing. The company serves semiconductor, industrial technologies, life and health sciences, research, and defense markets. It markets and sells its products and services through its direct sales organization, independent distributors, and sales representatives, as well as through its websites and product catalogs. MKS Instruments, Inc. was founded in 1961 and is headquartered in Andover, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Andover"}, "MKTY": {"short_name": "MECHANICAL TECHNOLOGY INC", "long_name": "Mechanical Technology, Incorporated", "summary": "Mechanical Technology, Incorporated, through its subsidiary, MTI Instruments, Inc., designs, manufactures, and markets precision linear displacement solutions, vibration measurement and system balancing solutions, and wafer inspection tools worldwide. It offers electronic gauging instruments for position, displacement, and vibration applications in the industrial manufacturing/production markets, as well as the research, design, and process development market. The company also provides engine vibration analysis systems for military and commercial aircraft; capacitance, laser systems, and fiber optic sensors for non-contact measurement; and vibration and balancing systems, engine signal conditioning, and charge amplifiers for turbine engine/rotating machine measurement and balancing. In addition, it offers portable precision signal generator; manual semiconductor metrology system, semi-automated metrology system, and photovoltaic/solar metrology system; and rapid-deployment custom measurement solutions to OEMs. The company serves manufacturing, electronics, semiconductor, solar, commercial and military aviation, automotive, and data storage industries. Mechanical Technology, Incorporated was founded in 1961 and is based in Albany, New York.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Albany"}, "MLAB": {"short_name": "Mesa Laboratories, Inc.", "long_name": "Mesa Laboratories, Inc.", "summary": "Mesa Laboratories, Inc. designs, manufactures, and markets quality control instruments and disposable products in the United States, Canada, Europe, and Japan. The company's Sterilization and Disinfection Control segment manufactures and markets biological indicators comprising spore strips, self-contained products, and culture media, as well as process challenge devices; and offers testing services. This segment also provides chemical and cleaning indicators that are used to assess the effectiveness of sterilization and cleaning processes. Its Instruments segment offers data loggers used in critical manufacturing, quality control, and validation applications; medical meters and calibration solutions used to test various parameters of the dialysis fluid, and the calibration and operation of the dialysis machine; gas flow calibration and air sampling equipment that are used for industrial hygiene assessments, calibration of gas metering equipment, and environmental air sampling; and torque testing systems used for measure bottle cap tightness. This segment's products are used in healthcare, pharmaceutical, medical device, food and beverage, industrial hygiene, and environmental air sampling industries. The company's Biopharmaceutical Development segment develops, manufactures, and commercializes automated solutions for protein analysis, which include analysis equipment, CDs, kits, and buffers; and peptide synthesizers to automate chemically synthesized peptides that are used in the creation of peptide therapies, biomaterials, cosmetics, and general research. Its Continuous Monitoring segment offers systems, which are used to monitor temperature, humidity, and differential pressure for use in hospitals, pharmaceutical and medical device manufacturers, blood banks, pharmacies, and laboratory environments. The company was founded in 1982 and is headquartered in Lakewood, Colorado.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Lakewood"}, "MTSC": {"short_name": "MTS Systems Corporation", "long_name": "MTS Systems Corporation", "summary": "MTS Systems Corporation supplies test systems, motion simulators, and precision sensors in the Americas, Europe, and Asia. The company's Test & Simulation segment offers road simulators and component test systems, vehicle performance test systems, vehicle dynamics simulators, electrical motors and energy recovery systems, tire performance and rolling resistance measurement systems, and moving ground-plane systems and balances. It also provides systems for the physical characterization of material properties; systems to test durability and performance of implants, prostheses, and other medical and dental materials and devices; products, systems, and software to perform static and fatigue testing of aircraft; products for blades, bearings, and wind turbines; structural engineering systems, such as static and dynamic testing; and seismic simulation tables. In addition, this segment offers installation, product life cycle management, professional training, calibration and metrology, technical consulting, and onsite and factory repair and maintenance services, as well as accessories and spare parts. It serves automobile, truck, motorcycle, motorsports vehicles, construction and agricultural equipment, rail and off-road vehicle manufacturers, and their suppliers, as well as the power generation, aerospace, vehicles, biomedical, structural engineering, oil and gas, wind energy, amusement parks, flight simulation, and other industries. The company's Sensors segment provides sensors for measurements of vibration, pressure, position, force, and sound; and piezoelectric sensors and components. It serves the automotive, aerospace, industrial, defense, and research and development markets. The company sells its products through direct sales and service organizations, and independent representatives and distributors, as well as through catalogs, internet, etc. MTS Systems Corporation was founded in 1966 and is headquartered in Eden Prairie, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Eden Prairie"}, "MVIN.F": {"short_name": "MICROVISION NEW DL -,001", "long_name": "MicroVision, Inc.", "summary": "MicroVision, Inc. develops scanning technology to create a high-resolution miniature projection and three-dimensional sensing and image capture solutions under the PicoP brand name in the United States. Its PicoP scanning technology is based on micro-electrical mechanical systems, laser diodes, opto-mechanics, and electronics. The company's products are used in interactive and non-interactive projected displays; 3D perceptive light detection and ranging (LiDAR) sensing for consumer electronics; augmented/mixed reality; and 3D Perceptive LiDAR sensing for automotive active collision avoidance systems. It sells its products primarily to original equipment manufacturers and original design manufacturers. MicroVision, Inc. was founded in 1993 and is headquartered in Redmond, Washington.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Redmond"}, "MVIS": {"short_name": "Microvision, Inc.", "long_name": "MicroVision, Inc.", "summary": "MicroVision, Inc. develops scanning technology to create a high-resolution miniature projection and three-dimensional sensing and image capture solutions under the PicoP brand name in the United States. Its PicoP scanning technology is based on micro-electrical mechanical systems, laser diodes, opto-mechanics, and electronics. The company's products are used in interactive and non-interactive projected displays; 3D perceptive light detection and ranging (LiDAR) sensing for consumer electronics; augmented/mixed reality; and 3D Perceptive LiDAR sensing for automotive active collision avoidance systems. It sells its products primarily to original equipment manufacturers and original design manufacturers. MicroVision, Inc. was founded in 1993 and is headquartered in Redmond, Washington.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Redmond"}, "MYDX": {"short_name": "MYDX INC", "long_name": "MyDx, Inc.", "summary": "MyDx, Inc., a science and technology company, develops products and services focusing on the cannabis industry. It focuses on four business segments: Consumer Products, Data Analytics, Biopharmaceutical, and Software as a Service (SaaS). The Consumer Products segment provides smart devices and consumables, including CannaDx sensors, delivery devices, and MyDx 2 sensors. The Data Analytics segment offers pre-clinical chemical analysis and patient feedback ecosystem. The Biopharmaceutical segment engages in identifying, licensing, and selling green active pharmaceutical ingredients and corresponding formulations. The SaaS segment provides software services for prescribers, patient groups, cultivators, and regulators. The company distributes its products through various channels, including e-commerce via the company's Website, direct to retail, amazon.com, and sales through affiliate partners. MyDx, Inc. was founded in 2012 and is based in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Diego"}, "NOVT": {"short_name": "Novanta Inc.", "long_name": "Novanta Inc.", "summary": "Novanta Inc., together with its subsidiaries, designs, manufactures, markets, and sells photonics, vision, and precision motion components and sub-systems to original equipment manufacturers in the medical and industrial markets worldwide. Its Photonics segment offers photonics-based solutions, including laser scanning and laser beam delivery, CO2 laser, solid state laser, ultrafast laser, and optical light engine products for photonics-based applications, such as industrial processing, metrology, medical and life science imaging, DNA sequencing, and medical laser procedures. The company's Vision segment provides a range of medical grade technologies, including medical insufflators, pumps, and related disposables; visualization solutions; wireless, recorder and video integration technologies for operating room integrations; optical data collection and machine vision technologies; radio frequency identification technologies; thermal chart recorders; spectrometry technologies; and embedded touch screen solutions. Its Precision Motion segment offers optical and inductive encoders, precision motors, motion control sub-assemblies, servo drives, air bearings, and air bearing spindles. The company sells its products through its direct sales force, resellers, distributors, and system integrators under the Cambridge Technology, Lincoln Laser, Synrad, Laser Quantum, ARGES, WOM, NDS, NDSsi, Med X Change, Reach Technology, JADAK, ThingMagic, Photo Research, General Scanning, Celera Motion, MicroE, Applimotion, Zettlex, Ingenia, and Westwind brands. The company was formerly known as GSI Group, Inc. and changed its name to Novanta Inc. in May 2016. Novanta Inc. was founded in 1968 and is headquartered in Bedford, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Bedford"}, "NOVTN.MX": {"short_name": "NOVANTA INC", "long_name": "Novanta Inc.", "summary": "Novanta Inc., together with its subsidiaries, designs, manufactures, markets, and sells photonics, vision, and precision motion components and sub-systems to original equipment manufacturers in the medical and industrial markets worldwide. Its Photonics segment offers photonics-based solutions, including laser scanning and laser beam delivery, CO2 laser, solid state laser, ultrafast laser, and optical light engine products for photonics-based applications, such as industrial processing, metrology, medical and life science imaging, DNA sequencing, and medical laser procedures. The company's Vision segment provides a range of medical grade technologies, including medical insufflators, pumps, and related disposables; visualization solutions; wireless, recorder and video integration technologies for operating room integrations; optical data collection and machine vision technologies; radio frequency identification technologies; thermal chart recorders; spectrometry technologies; and embedded touch screen solutions. Its Precision Motion segment offers optical and inductive encoders, precision motors, motion control sub-assemblies, servo drives, air bearings, and air bearing spindles. The company sells its products through its direct sales force, resellers, distributors, and system integrators under the Cambridge Technology, Lincoln Laser, Synrad, Laser Quantum, ARGES, WOM, NDS, NDSsi, Med X Change, Reach Technology, JADAK, ThingMagic, Photo Research, General Scanning, Celera Motion, MicroE, Applimotion, Zettlex, Ingenia, and Westwind brands. The company was formerly known as GSI Group, Inc. and changed its name to Novanta Inc. in May 2016. Novanta Inc. was founded in 1968 and is headquartered in Bedford, Massachusetts.", "currency": "MXN", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Bedford"}, "NUVG": {"short_name": "NUVUS GRO CORP", "long_name": "Nuvus Gro Corp.", "summary": "HempTech Corporation, a technology company, provides Controlled Environment Agriculture (CEA) solutions with automation and analytical tools for the cultivators of legal industrial hemp and cannabis in the United States. The company's products and solutions include Grow.droid, a self-contained fully-automated platform for growing cannabis; CognetiX, a suite of software solutions that integrates plant and business data into a real-time, distributed grow control platform; Mithra intelligent lighting that is an LED lighting technology for indoor growing facilities; and GROWComm solutions, which is a community comprising engineers, legacy growers, entrepreneurs, market researchers, and industry pioneers to address the needs of the agriculture and cannabis grow industry. Its solutions also include SmartNergy, an energy management and control product for the indoor agriculture industry; SmartSense, a sensor and control product for the agriculture industry that provides sensors and sensor networks for indoor growing facilities; and SPIDer (secure perimeter intrusion detection network) solution that addresses the potential threat facing the cannabis/hemp industry. The company is based in Saint Petersburg, Florida. HempTech Corporation operates as a subsidiary of FutureWorld Corp.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Saint Petersburg"}, "QDLC": {"short_name": "QUADLOGIC CONTROLS CORP", "long_name": "Quadlogic Controls Corporation", "summary": "Quadlogic Controls Corporation develops and sells electric sub meter and energy monitoring products in the United States, Canada, Israel, Colombia, Chile, Mexico, the Dominican Republic, Costa Rica, Puerto Rico, Panama, and Brazil. The company offers sub metering and utility metering products, such as multi-tenant meters, in-unit residential meters, sock meters, 3-phase kwh and demand meters, and commercial meters; and data collectors, energy loss prevention products, and communication options, as well as a Web-based software package for energy monitoring, energy usage analysis, tenant billing, and data retrieval. It also provides tenant billing services, including remote meter reading and tenant electric billing; off-cycle meter reads for property sales, move-ins/outs, etc.; custom-design management reporting; and compatibility with client accounting systems, as well as system repair and maintenance services. In addition, the company offers power line communication metering systems; technical support and meter installation; and electricity and natural gas supply services. It serves commercial and residential buildings and complexes, and power utilities. The company was founded in 1982 and is headquartered in Long Island City, New York.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Long Island City"}, "QURT": {"short_name": "QUARTA RAD INC", "long_name": "Quarta-Rad, Inc.", "summary": "Quarta-Rad, Inc. distributes and sells detection devices for homeowners, homebuilders, and home renovation contractors in North America, Europe, and Asia. It sells radiation detection equipment, including RADEX RD1503, a hand-held radiation detector for the consumer market; RADEX RD1706, a hand-held radiation detector; RADEX RD1008, a radiation detection device that provides readings for Gamma- and Beta- radiation values; RADEX RD1212, a hand-held radiation detector for the consumer market; RADEX RD1212-BT, a hand-held radiation detector with Bluetooth; and RADEX RD ONE, a compact personal radiation detector. The company also offers RADEX M107, a simple radon gas detector that provides visual/audio alarm when a threshold is reached, as well as RADEX EMI50, a hand-held device that offers real-time measuring of electric field strength and electromagnetic field. In addition, it offers light and brightness detection equipment, such as RADEX Lupin, a hand-held device that measures illumination, brightness, and flicker ratio of LED screens. Quarta-Rad, Inc. markets its products through the independent distributors and the Internet. The company was formerly known as Quatra-Rad, Inc. and changed its name to Quarta-Rad, Inc. in February 2012. Quarta-Rad, Inc. was founded in 2011 and is based in Wilmington, Delaware.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Wilmington"}, "RMTD": {"short_name": "REMOTE DYNAMICS INC", "long_name": "Remote Dynamics, Inc.", "summary": "Remote Dynamics, Inc. was acquired by Telogis, Inc in July 2010. Previously, Remote Dynamics was engaged in the marketing, sale, and support of automatic vehicle location and mobile resource management solutions in the United States. The company is headquartered in Plano, Texas.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Plano"}, "S94.F": {"short_name": "SENSATA TECHN.HLDG LS-,01", "long_name": "Sensata Technologies Holding plc", "summary": "Sensata Technologies Holding plc, through its subsidiaries, develops, manufactures, and sells sensors, sensor-based solutions, controls, and other products in the Americas, Europe, Asia, and internationally. It operates in two segments, Performance Sensing and Sensing Solutions. The Performance Sensing segment offers pressure sensors, including microfused strain gage, ceramic capacitive, and micro-electromechanical sensors; speed and position sensors, such as magnetic speed and position sensors, and mechanical/electrical control systems; and temperature sensors. Its products are used in mission-critical systems; and subsystems of automobiles, on-road trucks, and off-road equipment, including tire pressure monitoring, thermal management, air conditioning, and regenerative braking. This segment serves automotive, heavy vehicle, and off-road industries, as well as agriculture original equipment manufacturers (OEM), suppliers, and aftermarket distributors. The Sensing Solutions segment provides various application-specific sensor and control products used in aerospace market and various industrial markets, including small appliance; heating, ventilation, and air conditioning; semiconductor; material handling; factory automation; and water management markets. Its products include pressure, temperature, and position sensors; motor and compressor protectors; solid state relays; bimetal electromechanical controls; thermal and magnetic-hydraulic circuit breakers; power inverters; motor starters; thermostats; switches; and charge controllers, as well as linear and rotary position sensors, linear variable differential transformers, and aircraft controls. This segment serves OEMs in the climate control, appliance, semiconductor, medical, energy and infrastructure, data/telecom, material handling, factory automation, and aerospace industries, as well as aerospace, and motor and compressor suppliers. The company was founded in 1916 and is headquartered in Attleboro, Massachusetts.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Attleboro"}, "SCND": {"short_name": "SCIENTIFIC INDUSTRIES INC", "long_name": "Scientific Industries, Inc.", "summary": "Scientific Industries, Inc. designs, manufactures, and markets benchtop laboratory equipment, bioprocessing systems and products, and catalyst research instruments worldwide. It offers vortex mixers to mix the contents of test tubes, beakers, and other containers by placing such containers on a rotating cup or other attachments; and various mixers and shakers, such as high speed touch mixers, mixers with an integral timer, cell disruptors, microplate mixers, vortex mixers incorporating digital control and display, multi-vessel vortex mixers, and orbital shakers. The company also provides benchtop multi-purpose rotators and rockers to rotate and rock various containers; refrigerated incubators and incubator shakers for shaking and stirring functions; and magnetic stirrers, including high/low programmable magnetic stirrers, four-place high/low programmable magnetic stirrers, large volume magnetic, and four-place general purpose stirrers. In addition, it offers AMI-300 catalyst characterization instrument for temperature-programmed catalyst characterization experiments; and catalyst research instrument products, such as reactor systems, high throughput systems, and micro-activity reactors. Further, the company provides bioprocessing systems comprising disposable sensors, such as coaster systems and other shaking products using vessels; and mechanical balances, moisture analyzers, pill counters, and force gauges, as well as pharmacy, laboratory, and industrial digital scales. Its products are used for research purposes by universities, pharmaceutical companies, pharmacies, national laboratories, medical device manufacturers, petrochemical companies, and other industries performing laboratory-scale research. The company markets its products under the Genie and Torbal brand names directly, as well as through laboratory equipment distributors and online. Scientific Industries, Inc. was founded in 1954 and is headquartered in Bohemia, New York.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Bohemia"}, "SI1A.F": {"short_name": "SCHMITT INDS INC. ORE.", "long_name": "Schmitt Industries, Inc.", "summary": "Schmitt Industries, Inc., together with its subsidiaries, designs, manufactures, and sells test and measurement products worldwide. The company's Balancer segment offers computer-controlled vibration detection, balancing, and process control systems. Its products comprise SB-5500, an optional acoustic emission monitoring system (AEMS) control card to monitor the AE signals generated on the grinding machine; process control cards to provide enhanced control of the grinding process; SB-2000, a compact manual balancing system; and AE-1000, an AE control platform, which reduces air machine grinding time under the Schmitt Dynamic Balance System brand name. This segment sells its products to end user operators, as well as manufacturers of grinding machines for automotive, industrial, aerospace, and medical industries through independent manufacturers' representatives and distributors. Its Measurement segment provides laser and confocal chromatic white light sensors for distance, measurement, and dimensional sizing products under the Acuity brand name for various application, including manufacturing, lumber production, steel casting, glass and paper production, medical imaging, crane control and micron-level part, and surface inspection; and ultrasonic measurement products that measure the levels of liquid tanks and transmit that data through satellite to a secure Website for display, as well as remote tank monitoring products under the Xact brand name. Schmitt Industries, Inc. was founded in 1984 and is based in Portland, Oregon.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Portland"}, "SIGL": {"short_name": "SIGNAL ADVANCE INC", "long_name": "Signal Advance, Inc.", "summary": "Signal Advance, Inc. engages in the engineering research and technology development business. The company offers Signal Advance (SA) technology that reduces signal detection delays associated with various physical sensors, improves response time and performance in control, intervention, and/or signal transmission systems. It serves biomedicine, industrial process control, transportation, cyber-security, and defense markets. The company was formerly known as Biodyne Development Company, Inc and changed its name to Signal Advance, Inc. in 2007. Signal Advance, Inc. was founded in 1992 and is based in Rosharon, Texas.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Rosharon"}, "SMIT": {"short_name": "Schmitt Industries, Inc.", "long_name": "Schmitt Industries, Inc.", "summary": "Schmitt Industries, Inc., together with its subsidiaries, designs, manufactures, and sells test and measurement products worldwide. The company's Balancer segment offers computer-controlled vibration detection, balancing, and process control systems. Its products comprise SB-5500, an optional acoustic emission monitoring system (AEMS) control card to monitor the AE signals generated on the grinding machine; process control cards to provide enhanced control of the grinding process; SB-2000, a compact manual balancing system; and AE-1000, an AE control platform, which reduces air machine grinding time under the Schmitt Dynamic Balance System brand name. This segment sells its products to end user operators, as well as manufacturers of grinding machines for automotive, industrial, aerospace, and medical industries through independent manufacturers' representatives and distributors. Its Measurement segment provides laser and confocal chromatic white light sensors for distance, measurement, and dimensional sizing products under the Acuity brand name for various application, including manufacturing, lumber production, steel casting, glass and paper production, medical imaging, crane control and micron-level part, and surface inspection; and ultrasonic measurement products that measure the levels of liquid tanks and transmit that data through satellite to a secure Website for display, as well as remote tank monitoring products under the Xact brand name. Schmitt Industries, Inc. was founded in 1984 and is based in Portland, Oregon.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Portland"}, "SOBR": {"short_name": "SOBR SAFE INC", "long_name": "SOBR Safe, Inc.", "summary": "SOBR Safe, Inc. engages in developing a touch-based identity verification and alcohol detection system. It develops SOBR Check, a technology with applications in commercial fleet management, school buses, manufacturing facilities, and warehousing. The company was founded in 2004 and is headquartered in Boulder, Colorado.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Boulder"}, "SOTK": {"short_name": "SONO-TEK CORP", "long_name": "Sono-Tek Corporation", "summary": "Sono-Tek Corporation designs and manufactures ultrasonic coating systems for applying on parts and components for the microelectronics/electronics, alternative energy, medical, industrial, and research and development/other markets worldwide. It also designs and manufactures custom-engineered ultrasonic coating systems; and provides patented nozzles and generators for manufacturers' equipment. The company's products include integrated multi-axis coating systems, integrated coating systems, fluxing systems, OEM systems, and other related systems. It markets and distributes its products through independent distributors and sales representatives. The company was founded in 1975 and is headquartered in Milton, New York.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Milton"}, "SPEC": {"short_name": "SPECTRALCAST INC", "long_name": "SpectralCast, Inc.", "summary": "SpectralCast, Inc. designs, manufactures, and distributes specialty electronics. The company also integrates and cultivates consumer electronic products with the encrypted network, the Orbital Organic Network, known as the Overnet. It offers 58 inch and 55 inch Orbital Elite LED televisions, and 42 inch multi-function LCD television. The company was formerly known as 7 Star Entertainment, Inc. and changed its name to SpectralCast, Inc. in January 2014. SpectralCast, Inc. is based in San Diego, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "San Diego"}, "SRMX": {"short_name": "SADDLE RANCH MEDIA INC", "long_name": "Saddle Ranch Media, Inc.", "summary": "Sky Fidelity, Inc., a diversified technology company, provides cloud managed services (IoT), as well as solar power, satellite broadband, and WiFi camera surveillance solutions. The company offers IoT for businesses and consumers; and i-BRIGHT 7x smart surge protector, a WiFi-enabled home energy management tool. It also offers satellite broadband solutions that are used in Caribbean, disaster, duel mode tracking, education, emergency backup, mobile data, oil and gas site, RV and mobile home, supervisory control and data acquisition, telemedicine, and yacht and boat applications for live streaming video, VOIP, email, texting, and other Internet based communications. In addition, it offers WiFi camera systems for applications in car dealerships, construction sites, golf courses, marinas, oil and gas sites, RV and mobile homes, water locations, and yachts and boats. Further, the company offers WiFi hotspot solutions, including Sky400, a dual band outdoor access point system; and Sky300, an outdoor device for delivering last mile wireless services to businesses or residential broadband subscribers. It serves customers worldwide. The company was incorporated in 2016 and is based in Newport Beach, California with additional offices in Clearwater and Fort Lauderdale, Florida; and Taipei, Taiwan.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Newport Beach"}, "ST": {"short_name": "Sensata Technologies Holding pl", "long_name": "Sensata Technologies Holding plc", "summary": "Sensata Technologies Holding plc, through its subsidiaries, develops, manufactures, and sells sensors, sensor-based solutions, controls, and other products in the Americas, Europe, Asia, and internationally. It operates in two segments, Performance Sensing and Sensing Solutions. The Performance Sensing segment offers pressure sensors, including microfused strain gage, ceramic capacitive, and micro-electromechanical sensors; speed and position sensors, such as magnetic speed and position sensors, and mechanical/electrical control systems; and temperature sensors. Its products are used in mission-critical systems; and subsystems of automobiles, on-road trucks, and off-road equipment, including tire pressure monitoring, thermal management, air conditioning, and regenerative braking. This segment serves automotive, heavy vehicle, and off-road industries, as well as agriculture original equipment manufacturers (OEM), suppliers, and aftermarket distributors. The Sensing Solutions segment provides various application-specific sensor and control products used in aerospace market and various industrial markets, including small appliance; heating, ventilation, and air conditioning; semiconductor; material handling; factory automation; and water management markets. Its products include pressure, temperature, and position sensors; motor and compressor protectors; solid state relays; bimetal electromechanical controls; thermal and magnetic-hydraulic circuit breakers; power inverters; motor starters; thermostats; switches; and charge controllers, as well as linear and rotary position sensors, linear variable differential transformers, and aircraft controls. This segment serves OEMs in the climate control, appliance, semiconductor, medical, energy and infrastructure, data/telecom, material handling, factory automation, and aerospace industries, as well as aerospace, and motor and compressor suppliers. The company was founded in 1916 and is headquartered in Attleboro, Massachusetts.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Attleboro"}, "TB5.F": {"short_name": "TRIMBLE INC.", "long_name": "Trimble Inc.", "summary": "Trimble Inc. provides technology solutions that enable professionals and field mobile workers to improve or transform their work processes worldwide. It operates through four segments: Buildings and Infrastructure, Geospatial, Resources and Utilities, and Transportation. The Buildings and Infrastructure segment offers field and office software for route selection and design; systems to guide and control construction equipment; systems to monitor, track, and manage assets, equipment, and workers; software to share and communicate data; 3D conceptual design and modeling software; building information modeling software; integrated site layout and measurement systems; cost estimating, scheduling, and project controls solutions; applications for sub-contractors and trades; and an integrated workplace management software. The Geospatial segment provides surveying and geospatial products, and geographic information systems. The Resources and Utilities segment offers precision agriculture products and services, such as guidance and positioning systems, automated and variable-rate application and technology systems, and information management solutions. It offers manual and automated navigation guidance for tractors and other farm equipment; solutions to automate application of pesticide and seeding; water solutions; Farmer Core, a software subscription that enables farmers to connect their farm operation; and forestry solutions for forest management and timber processing. The Transportation segment offers solutions for long haul trucking, field service management, rail, and construction logistics industries; and transportation management, analytics, routing, mapping, reporting, and predictive modeling solution under Trimble brand name. It has strategic alliance with Boston Dynamics. The company was formerly known as Trimble Navigation Limited and changed its name to Trimble Inc. in October 2016. Trimble Inc. was founded in 1978 and is headquartered in Sunnyvale, California.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Sunnyvale"}, "TDY": {"short_name": "Teledyne Technologies Incorpora", "long_name": "Teledyne Technologies Incorporated", "summary": "Teledyne Technologies Incorporated provides instrumentation, digital imaging, aerospace and defense electronics, and engineered systems in the United States, the United Kingdom, Canada, the Netherlands, and internationally. The company's Instrumentation segment offers monitoring and control instruments for marine, environmental, industrial, and other applications, as well as electronic test and measurement equipment; and power and communications connectivity devices for distributed instrumentation systems and sensor networks deployed in mission critical and harsh environments. Its Digital Imaging segment provides image sensors and digital cameras for use in industrial, scientific, academic research, and medical applications; and hardware and software for image processing and automatic data collection in industrial, academic research, and medical applications, as well as manufacturing services for micro electro-mechanical systems. This segment also offers light detection and ranging systems; focal plane arrays, sensors, and subsystems; and geospatial software products. The company's Aerospace and Defense Electronics segment provides electronic components and subsystems, as well as communications products, such as defense electronics; environment interconnects; data acquisition and communications equipment for aircraft; components and subsystems for wireless and satellite communications; and general aviation batteries. Its Engineered Systems segment offers systems engineering and integration, technology development, and manufacturing solutions for defense, space, environmental, and energy applications; and designs and manufactures electrochemical energy systems and electronics for military applications. The company markets and sells its products and services through sales forces, third-party distributors, and commissioned sales representatives. Teledyne Technologies Incorporated was founded in 1960 and is headquartered in Thousand Oaks, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Thousand Oaks"}, "TKOI": {"short_name": "TELKONET INC", "long_name": "Telkonet, Inc.", "summary": "Telkonet, Inc. provides EcoSmart platform of intelligent automation solutions in support of the Internet of Things in the United States. Its EcoSmart platform provides savings, management reporting, analytics, and virtual engineering of a customer's portfolio and/or property's room-by-room energy consumption. The company's EcoSmart suite of energy management products comprise EcoTouch Thermostat, a touch capacitive thermostat interface; EcoInsight Thermostat, a programmable and controllable wired thermostat; EcoAir Thermostat, a wireless thermostat; EcoSource Controller, a remote HVAC control device; EcoSmart VRF controllers; EcoConnect Bridge, an Ethernet to Zigbee bridge that serves as the coordinator for various EcoSmart devices; and EcoCommander Gateway, a network-edge gateway server that provides data aggregation, analytics, reporting, and management of the EcoSmart product suite. It also offers EcoSense Occupancy Sensor, a remote occupancy sensor, which monitor environments with sensors that are designed to detect motion or body heat; EcoSwitch Light Switch, an energy management product that saves energy; EcoGuard, which monitors and controls the flow of power to various outlets; and EcoContact, a remote and wireless door/window contact solution. In addition, the company provides EcoCentral, a cloud-based dashboard; EcoCare professional support and maintenance services; and EcoSmart Mobile that offer iOS and Android applications. It serves hospitality, government and military, educational, multiple dwelling unit, healthcare, and commercial industries. The company was founded in 1977 and is headquartered in Waukesha, Wisconsin.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Waukesha"}, "TRCK": {"short_name": "TRACK GROUP INC", "long_name": "Track Group, Inc.", "summary": "Track Group, Inc., together with its subsidiaries, designs, manufactures, and markets location tracking devices. It also develops and sells various related software, services, accessories, networking solutions, and monitoring applications. The company offers ReliAlert XC4, a GPS monitoring device; ReliAlert XC 3, which enables agencies to track offender movements and communicate directly with offenders in real-time through on-board two/three-way voice communication technology; and Shadow, an offender tracking device with 3G compliant. It also provides TrackerPAL, a cloud-based monitoring system; TrackerPAL Mobile, a mobile application of the TrackerPAL software for Android and iOS devices; data analytics services; BACtrack, a smartphone-based remote alcohol monitoring system; Empower smartphone application that provides victim and survivor support by creating a mobile geo-zone around a survivor of domestic abuse and communicates with the offender's tracking device; InTouch, a smartphone monitoring and supervision application for the criminal justice market; SecureCuff steel bands; and RF Beacon, a self-contained and short-range transmitting station that provides a radio frequency signal communicating with assigned offender GPS devices, as well as product support services. The company sells its products in the United States, Latin America, and internationally. The company was formerly known as SecureAlert, Inc. and changed its name to Track Group, Inc. in May 2015. Track Group, Inc. was incorporated in 1995 and is headquartered in Naperville, Illinois.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Naperville"}, "TRMB": {"short_name": "Trimble Inc.", "long_name": "Trimble Inc.", "summary": "Trimble Inc. provides technology solutions that enable professionals and field mobile workers to improve or transform their work processes worldwide. It operates through four segments: Buildings and Infrastructure, Geospatial, Resources and Utilities, and Transportation. The Buildings and Infrastructure segment offers field and office software for route selection and design; systems to guide and control construction equipment; systems to monitor, track, and manage assets, equipment, and workers; software to share and communicate data; 3D conceptual design and modeling software; building information modeling software; integrated site layout and measurement systems; cost estimating, scheduling, and project controls solutions; applications for sub-contractors and trades; and an integrated workplace management software. The Geospatial segment provides surveying and geospatial products, and geographic information systems. The Resources and Utilities segment offers precision agriculture products and services, such as guidance and positioning systems, automated and variable-rate application and technology systems, and information management solutions. It offers manual and automated navigation guidance for tractors and other farm equipment; solutions to automate application of pesticide and seeding; water solutions; Farmer Core, a software subscription that enables farmers to connect their farm operation; and forestry solutions for forest management and timber processing. The Transportation segment offers solutions for long haul trucking, field service management, rail, and construction logistics industries; and transportation management, analytics, routing, mapping, reporting, and predictive modeling solution under Trimble brand name. It has strategic alliance with Boston Dynamics. The company was formerly known as Trimble Navigation Limited and changed its name to Trimble Inc. in October 2016. Trimble Inc. was founded in 1978 and is headquartered in Sunnyvale, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Sunnyvale"}, "TRMB.MX": {"short_name": "TRIMBLE INC", "long_name": "Trimble Inc.", "summary": "Trimble Inc. provides technology solutions that enable professionals and field mobile workers to improve or transform their work processes worldwide. It operates through four segments: Buildings and Infrastructure, Geospatial, Resources and Utilities, and Transportation. The Buildings and Infrastructure segment offers field and office software for route selection and design; systems to guide and control construction equipment; systems to monitor, track, and manage assets, equipment, and workers; software to share and communicate data; 3D conceptual design and modeling software; building information modeling software; integrated site layout and measurement systems; cost estimating, scheduling, and project controls solutions; applications for sub-contractors and trades; and an integrated workplace management software. The Geospatial segment provides surveying and geospatial products, and geographic information systems. The Resources and Utilities segment offers precision agriculture products and services, such as guidance and positioning systems, automated and variable-rate application and technology systems, and information management solutions. It offers manual and automated navigation guidance for tractors and other farm equipment; solutions to automate application of pesticide and seeding; water solutions; Farmer Core, a software subscription that enables farmers to connect their farm operation; and forestry solutions for forest management and timber processing. The Transportation segment offers solutions for long haul trucking, field service management, rail, and construction logistics industries; and transportation management, analytics, routing, mapping, reporting, and predictive modeling solution under Trimble brand name. It has strategic alliance with Boston Dynamics. The company was formerly known as Trimble Navigation Limited and changed its name to Trimble Inc. in October 2016. Trimble Inc. was founded in 1978 and is headquartered in Sunnyvale, California.", "currency": "MXN", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Sunnyvale"}, "TYZ.F": {"short_name": "TELEDYNE TECHS  DL-,01", "long_name": "Teledyne Technologies Incorporated", "summary": "Teledyne Technologies Incorporated provides instrumentation, digital imaging, aerospace and defense electronics, and engineered systems in the United States, the United Kingdom, Canada, the Netherlands, and internationally. The company's Instrumentation segment offers monitoring and control instruments for marine, environmental, industrial, and other applications, as well as electronic test and measurement equipment; and power and communications connectivity devices for distributed instrumentation systems and sensor networks deployed in mission critical and harsh environments. Its Digital Imaging segment provides image sensors and digital cameras for use in industrial, scientific, academic research, and medical applications; and hardware and software for image processing and automatic data collection in industrial, academic research, and medical applications, as well as manufacturing services for micro electro-mechanical systems. This segment also offers light detection and ranging systems; focal plane arrays, sensors, and subsystems; and geospatial software products. The company's Aerospace and Defense Electronics segment provides electronic components and subsystems, as well as communications products, such as defense electronics; environment interconnects; data acquisition and communications equipment for aircraft; components and subsystems for wireless and satellite communications; and general aviation batteries. Its Engineered Systems segment offers systems engineering and integration, technology development, and manufacturing solutions for defense, space, environmental, and energy applications; and designs and manufactures electrochemical energy systems and electronics for military applications. The company markets and sells its products and services through sales forces, third-party distributors, and commissioned sales representatives. Teledyne Technologies Incorporated was founded in 1960 and is headquartered in Thousand Oaks, California.", "currency": "EUR", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "FRA", "market": "dr_market", "country": "United States", "city": "Thousand Oaks"}, "UCLE": {"short_name": "US NUCLEAR CORP", "long_name": "US Nuclear Corp.", "summary": "US Nuclear Corp. develops, manufactures, and sells radiation detection and measuring equipment worldwide. It operates through two segments, Optron and Overhoff. The company offers radiation water monitors that allow the detection of radioactive materials in drinking water, ground water, rainfall, rivers, and lakes; alpha, beta, gamma, and tritium monitors; DroneRAD aerial radiation detection; air and water monitors; and nano-second X-ray monitors. It also provides vehicle, personnel, exit, and room monitors; radon air monitors and radon switch products; handheld survey meters, as well as personal dosimeters and pocket micro-R meters; and port security equipment. In addition, the company offers software, which measures gamma and neutron radiation levels; airborne radioactivity levels; temperature and humidity in the facility; status of security doors; wind speed and direction; and barometric pressure. Its products and services are used in nuclear reactor plants, universities, local and state hospitals, government agencies, and emergency medical technicians/first responders, as well as in airports, cargo, screening as ports and borders, and other critical infrastructure. The company is headquartered in Canoga Park, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Canoga Park"}, "VLDR": {"short_name": "Velodyne Lidar, Inc.", "long_name": "Velodyne Lidar, Inc.", "summary": "Velodyne Lidar, Inc. develops and produces lidar sensors for use in industrial, 3D mapping, drones, and auto applications in North America, the Asia Pacific, Europe, the Middle East, and Africa. The company offers surround-view hybrid solid state, directional solid state, and dome lidars; and Vella, an advanced driver assistance systems (ADAS) software solution built around lidar. Its products are used in various applications, including autonomous vehicles, ADAS, UAVs, mapping, industrial automation, self-driving rovers, autonomous vessels, smart city initiatives, and robotics. The company has a strategic partnership with Beijing Trunk Technology Co., Ltd. Velodyne Lidar, Inc. was founded in 2018 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "VNT": {"short_name": "Vontier Corporation", "long_name": "Vontier Corporation", "summary": "Vontier Corporation engages in the research and development, manufacture, sale, and distribution of critical technical equipment, components, software, and services for manufacturing, repair and servicing in the mobility infrastructure industry worldwide. The company offers a range of solutions, including environmental sensors, fueling equipment, field payment hardware, remote management and workflow software, and vehicle tracking and fleet management software solutions for traffic light control and vehicle mechanics', and technicians' equipment. Its mobility technologies products include solutions and services in the areas of fuel dispensing, remote fuel management, point-of-sale and payment systems, environmental compliance, vehicle tracking and fleet management, and traffic management; and diagnostics and repair technologies products comprise vehicle repair tools, toolboxes, automotive diagnostic equipment, and software, as well as wheel-service equipment for automotive tire installation and repair shops, including brake lathes, tire changers, wheel balancers, and wheel weights under the AMMCO and COATS brand names. The company markets its products and services to retail and commercial fueling operators, commercial vehicle repair businesses, municipal governments, and public safety entities and fleet owners/operators through a network of franchised mobile distributors, as well as direct sales personnel and independent distributors. Vontier Corporation was incorporated in 2019 and is headquartered in Raleigh, North Carolina. Vontier Corporation(NYSE:VNT) operates independently of Fortive Corporation as of October 9, 2020.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Raleigh"}, "VPG": {"short_name": "Vishay Precision Group, Inc.", "long_name": "Vishay Precision Group, Inc.", "summary": "Vishay Precision Group, Inc. designs, manufactures, and markets sensors, sensor-based measurement systems, specialty resistors, and strain gages in the United States, Israel, the United Kingdom, rest of Europe, Asia, and Canada. It operates through three segments: Foil Technology Products, Force Sensors, and Weighing and Control Systems. The company's product portfolio includes foil resistors, foil strain gages, transducers, load cells, weighing modules, data acquisition systems, and weighing and control systems, as well as sensors that convert mechanical inputs into an electronic signal for display, processing, interpretation, or control by its instrumentation and system products. Its products are primarily used in the military and aerospace, medical, agricultural, steel, and construction sectors for application in waste management, bulk hauling, logging, scale manufacturing, engineering systems, pharmaceutical, oil, chemical, steel, paper, and food industries. The company offers its products under the Alpha Electronics, Powertron, Vishay Foil Resistors, Celtron, Revere, Sensortronics, Tedea-Huntleigh, Pacific Instruments, BLH Nobel, KELK, VPG Onboard Weighing, Gleeble, and Micro-Measurements brands. It sells its products through original equipment manufacturers, end-users, distributors, and electronic manufacturing services channels. Vishay Precision Group, Inc. was incorporated in 2009 and is headquartered in Malvern, Pennsylvania.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NYQ", "market": "us_market", "country": "United States", "city": "Malvern"}, "WATT": {"short_name": "Energous Corporation", "long_name": "Energous Corporation", "summary": "Energous Corporation develops wire-free charging solutions. The company develops WattUp wireless power technology that consists of semiconductor chipsets, software controls, hardware designs, and antennas that enables radio frequency based wire-free charging for electronic devices. It has a strategic partnership with Xentris Wireless to develop ruggedized products for military applications using the company's radio frequency based charging technology. The company was formerly known as DvineWave Inc. and changed its name to Energous Corporation in January 2014. Energous Corporation was founded in 2012 and is headquartered in San Jose, California.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "San Jose"}, "WELX": {"short_name": "WINLAND HOLDINGS CORPORATION", "long_name": "Winland Holdings Corporation", "summary": "Winland Holdings Corporation, through its subsidiaries, provides critical condition monitoring products to the security industry. Its products are used to protect against loss of assets due to damage from water, excess humidity, extremes of temperature, and loss of power. The company offers EnviroAlert, which monitors temperature, humidity, and/or water presence in critical environments; TempAlert, a temperature monitoring device for residential and commercial environments through security systems; WaterBug, a water presence and leak detection system; and Power-Out Alert, a power outage detector. It also provides INSIGHT, an automated cloud-based platform that offers early alerting, reporting, and logging services designed to ensure regulatory compliance. The company offers its products through a network of distributors, dealers, security installers, and integrators for healthcare, pharmaceutical, foodservice, and manufacturing industries, as well as for research facilities. Winland Holdings Corporation was founded in 1972 and is headquartered in Mankato, Minnesota.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "PNK", "market": "us_market", "country": "United States", "city": "Mankato"}, "WRAP": {"short_name": "Wrap Technologies, Inc.", "long_name": "Wrap Technologies, Inc.", "summary": "Wrap Technologies, Inc., a security technology company, develops security products for law enforcement and security personnel. It develops BolaWrap 100, a hand-held remote restraint device that discharges an eight-foot bola style Kevlar tether to entangle a subject at a range of 10-25 feet. The company was founded in 2016 and is headquartered in Tempe, Arizona.", "currency": "USD", "sector": "Technology", "industry": "Scientific & Technical Instruments", "exchange": "NMS", "market": "us_market", "country": "United States", "city": "Tempe"}}