{"0Q19.L": {"short_name": "CEVA INC CEVA ORD SHS", "long_name": "CEVA, Inc.", "summary": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled device; audio/voice/speech and ultra-low power always-on/sensing applications for multiple IoT markets; sensor fusion software and IMU solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. CEVA, Inc. licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was founded in 1999 and is headquartered in Mountain View, California.", "currency": "USD", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "LSE", "market": "gb_market", "country": "United States", "city": "Mountain View"}, "AVGO.MX": {"short_name": "BROADCOM INC", "long_name": "Broadcom Inc.", "summary": "Broadcom Inc. designs, develops, and supplies semiconductor infrastructure software solutions. It offers semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company's infrastructure software solutions enable customers to plan, develop, automate, manage, and secure applications across mainframe, distributed, mobile, and cloud platforms. It operates through two segments, Semiconductor Solutions and Infrastructure Software. The company was incorporated in 2018 and is based in San Jose, California.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "San Jose"}, "MCHP.MX": {"short_name": "MICROCHIP TECHNOLOGY", "long_name": "Microchip Technology Incorporated", "summary": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit microprocessors; and microcontrollers for automotive, industrial, computing, communication, lighting, power supplies, motor control, human machine interface, security, and wired and wireless connectivity applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly and test subcontracting manufacturing services; and aerospace and timing systems products, application specific integrated circuits, and complex programmable logic devices. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.", "currency": "MXN", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Chandler"}, "XIX.DE": {"short_name": "XILINX INC.  DL-,01", "long_name": "Xilinx, Inc.", "summary": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. The company has a collaboration with Kameleon Security to develop cybersecurity solution for servers, cloud computing, and data centers. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.", "currency": "EUR", "sector": "Technology", "industry": "Semiconductor - Broad Line", "exchange": "GER", "market": "de_market", "country": "United States", "city": "San Jose"}}