{
    "UNLA": {
        "short_name": "UNILAVA CORPORATION",
        "long_name": "Unilava Corporation",
        "summary": "Unilava Corporation provides various communications services, products, and equipment to small and medium sized enterprise businesses and consumers worldwide. Its Wireline segment offers retail and resell communication services comprising local, long-distance, and other services; and integrated voice and data services. This segment's long distance services comprise traditional and international long distance, calling card, and conference calling services, as well as wholesale switched access services to other service providers. Its data services include switched and dedicated transport, Internet access and network integration, data equipment sales, and U-verse services; high-speed connections, such as private lines, packet, dedicated Internet, and enterprise networking services; DSL/broadband, dial-up Internet access, and Wi-Fi services; and businesses voice applications over IP-based networks. The company's Wireless segment provides wireless voice communications services; sells wireless equipment comprising handsets and personal computer wireless data cards through online stores, agents, or third-party retail stores; and sells accessories, such as carrying cases, hands-free devices, batteries, battery chargers, and other items to consumers, as well as to agents and other third-party distributors for resale. Its Advertising Solutions segment sells Yellow Pages online Internet-based directory advertising and local search. This segment operates Counia.com, a coupon Website for savings and values; and Local114.co.kr that provides yellow pages and business services, such as Website development, Internet advertising, and other value-added services. The company's Other segment offers roadside assistance and operator services. Unilava Corporation provides its services under the Telava, Countryconnect, Telava Mobile, Local Area Yellow Pages, Telava Wireless, Counia, and Nationwide Roadside Assistance brand names. The company is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Wireless Communications",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    }
}