{
    "CP9.F": {
        "short_name": "CYFROWY POLSAT SA ZY -,04",
        "long_name": "Cyfrowy Polsat S.A.",
        "summary": "Cyfrowy Polsat S.A. provides digital satellite platform, digital terrestrial television (TV), and telecommunication services in Poland. The company operates in two segments, B2C and B2B Services, and Media. The B2C and B2B Services segment offers satellite and Internet television, mobile and fixed-line Internet access, video online, mobile and fixed-line telephony, and wholesale services for other telecommunications operators, as well as telecommunications equipment and set-top boxes, and photovoltaic installations. It also provides services to other telecommunication operators, such as network interconnection, texting and MMS traffic routing, international roaming, services to MVNOs, shared access to network assets, and lease of network infrastructure. It offers approximately 160 TV channels, including terrestrial, general interest, sports and e-sports, movie, news/information, education, entertainment, and music and children's channels; and over the top services, such as Cyfrowy Polsat GO, VOD/PPV, online video and music, catch-up TV, and multiroom HD services. The Media segment produces, acquires, and broadcasts information, sports, and entertainment programs, as well as TV series and feature films broadcasted on television channels; and operates thematic portals and on the online advertising market. It also sells TV channel advertising airtime and sponsoring, and channel broadcasting rights. The company is also involved in the gaseous fuels trading; technical; Web portal; and other financial supporting activities, as well as intellectual property rights rental business. The company was formerly known as Polsat Cyfrowy S.A. and changed its name to Cyfrowy Polsat S.A. in 2004. Cyfrowy Polsat S.A. was incorporated in 1996 and is based in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Entertainment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "state": null,
        "city": "Warsaw",
        "zipcode": "03-878",
        "website": "http://www.cyfrowypolsat.pl",
        "market_cap": "Mid Cap"
    }
}