{
    "DBIS.QA": {
        "short_name": "Dlala Brokerage and Investment ",
        "long_name": "Dlala Brokerage and Investment Holding Company Q.P.S.C.",
        "summary": "Dlala Brokerage and Investment Holding Company Q.P.S.C., together with its subsidiaries, engages in the brokerage activities at the Qatar Exchange. It operates through Stock Broking, Real Estate, and Information Technology segments. The company offers property management, marketing, and sales services for real estate clients; and information technology management and consultation services. It also engages in developing and programming of programs; and investment activities. Dlala Brokerage and Investment Holding Company Q.P.S.C. was incorporated in 2005 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.dlalaholding.com"
    },
    "IHGS.QA": {
        "short_name": "Inma Holding QPSC",
        "long_name": "Islamic Holding Group (Q.P.S.C)",
        "summary": "Islamic Holding Group (Q.P.S.C) invests in shares and bonds in Qatar. It operates through Brokerage and Real Estate segments. The company provides financial brokerage services. It provides property management, marketing, and sales services for real estate. The company was formerly known as Islamic Financial Securities Company (Q.S.C) and changed its name to Islamic Holding Group (Q.P.S.C) in July 2010. Islamic Holding Group (Q.P.S.C) was founded in 2003 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.islamicholding.com.qa"
    }
}