{
    "AHCS.QA": {
        "short_name": "Aamal QPSC",
        "long_name": "Aamal Company Q.P.S.C.",
        "summary": "Aamal Company Q.P.S.C., together with its subsidiaries, engages in the property, trading and distribution, industrial manufacturing, and managed services businesses in Qatar and internationally. The company's Property segment is involved in leasing the facilities of retail outlet complex, real estate investments, and property rental businesses. Its Trading and Distribution segment engages in wholesale and/or retail distribution of pharmaceutical and consumable items, automotive goods, home appliances, medical equipment, tires, lubricants, batteries, car spare parts, and office supplies products. This segment also provides industrial printing and laminating solutions; supplies, installs, commissions, and maintains air conditioning and refrigeration equipment; offers hospital information systems; and operates a chain of pharmacies, as well as sells footwear and general commercial trading products, and engages in clinical activities. The company's Industrial Manufacturing segment is involved in the manufacture, wholesale, and/or retail distribution of electric cables and tools, aggregates, ready-mix concrete, cement blocks and bricks, interlocking slabs, curb stone, and concrete pipes; provision of services in relation to industrial investment, repair, and construction of power plants; purchasing and leasing of ships; trading electromechanical equipment and cables; and management of industrial enterprises. Its Managed Services segment offers housekeeping and cleaning, facilities and support, energy, and entertainment and amusement services; and IT support, business process outsourcing, travel agency, and call center services. The company also trades in light emitting diode lamps and other lighting products; and provides facilities management, energy, and building maintenance and cleaning services. Aamal Company Q.P.S.C. was founded in 2001 and is headquartered in Doha, Qatar. Aamal Company Q.P.S.C. is a subsidiary of Al Faisal Holding Company W.L.L.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "QIMD.QA": {
        "short_name": "Qatar Industrial Manufacturing ",
        "long_name": "Qatar Industrial Manufacturing Company Q.P.S.C.",
        "summary": "Qatar Industrial Manufacturing Company Q.P.S.C., together with its subsidiaries, engages in industrial manufacturing and various types of industrial investments in Qatar and internationally. The company produces treated sand for construction and agricultural uses; paving stones and kerb stones; facial tissues, toilet rolls, kitchen rolls, and M Tork rolls; sulphuric acid for local and export markets; and non-colored and colored aluminum profiles. It serves petrochemicals, chemicals and building materials, and food industries. The company was founded in 1990 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "SIIS.QA": {
        "short_name": "Salam International Investment ",
        "long_name": "Salam International Investment Limited Q.P.S.C.",
        "summary": "Salam International Investment Limited Q.P.S.C. establishes, incorporates, acquires, and owns enterprises in contracting, energy and industry, consumer and luxury products, technology, real estate, and development sectors in Qatar and internationally. It provides information technology, IT consulting, electronic system installation and maintenance, and mechanical services; and building and facility management, investment, and oil and gas services. The company also engages in civil contracting and furniture trading activities; trading and maintenance of refrigerators, water coolers, and air conditioners; consulting and managerial studies; and manufacturing of switchgears and transformers. In addition, it is involved in trading of chemical materials and furniture, water equipment, IT equipment, and computer networks; maintenance of oil equipment; steel works; furniture and interior, and aluminum works; managing restaurants and bakeries; real estate; interior design; and furniture and interiors manufacturing businesses. Further, the company engages in the retail and wholesale of luxury consumer products; marketing and offices facility, and photography trading and related services businesses; construction and supply of landscaping related materials; and manufacture of bowls and boxes of cardboards. Salam International Investment Limited Q.P.S.C. was founded in 1952 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    }
}