{
    "MCCS.QA": {
        "short_name": "Mannai Corporation QPSC",
        "long_name": "Mannai Corporation Q.P.S.C.",
        "summary": "Mannai Corporation Q.P.S.C., together with its subsidiaries, operates as a conglomerate worldwide. The company operates through Information Technology, Auto Group, Energy and Industrial Markets, Geotechnical Services, Logistics, Travel, Engineering, Jewellery Trading, Telecom Retail, and Others segments. It offers a range of IT services, including application implementation, bespoke application development, systems integration, mobility, master data management, enterprise content management, data warehousing, enterprise resource planning, and customer relationship management; outsourcing and consulting services; hardware, software, security, networking, compute, and print solutions; digital business and technology services; office equipment solutions; distribution, technology, payment, and other solutions; and healthcare, research, and scientific technology solutions and services. The company also sells small compacts, passenger cars, commercial vehicles, and used cars; sells and markets heavy equipment and construction machinery to the construction and industrial sectors; and car rental, lease hire, chauffeur, and shuttle services. In addition, it supplies equipment and services to the oil and gas, construction, infrastructure, and utilities sector. Further, the company provides geotechnical, geological, and material testing services to civil engineering, water resource, and development projects; engineering services; travel agency services; and air, sea, and road freight transportation, as well as warehousing and customs clearance services. Additionally, it supplies home, white goods, and small kitchen appliances, electronics, video and audio systems; retails and wholesales jewelry and watch products through its 251 stores; and provides facilities maintenance and management services. The company was founded in 1951 and is based in Doha, Qatar. Mannai Corporation Q.P.S.C. operates as a subsidiary of Qatar Investment & Projects Development Holding Co., W.L.L.",
        "currency": "QAR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.mannai.com"
    }
}