{
  "AKHI.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Insurance - Diversified",
    "long_name": "Al Khaleej Takaful Insurance Company Q.P.S.C.",
    "market": "qa_market",
    "sector": "Financial Services",
    "short_name": "Al Khaleej Takaful Insurance QP",
    "state": null,
    "summary": "Al Khaleej Takaful Insurance Company Q.P.S.C. engages in the insurance, reinsurance, and takaful insurance businesses in Qatar. The company offers comprehensive and third party motor insurance products; and property insurance products, such as fire and special perils, property all risks, business interruption, terrorism, and jewelers block insurance. It also provides engineering insurance products, including contractor's all risk, erection all risk, equipment, machinery breakdown, deterioration of stock in cold storage, and electronic equipment insurance; and workmen's compensation, personal accident, fidelity guarantee, and money insurance. In addition, the company offers public liability/third party liability, product liability, event liability, directors and officers liability and company reimbursement, professional indemnity, medical malpractice, bankers blanket bond, and cyber liability insurance products. Further, it provides freight forwarders liability, marine hull, and aviation insurance; and medical, group life, and travel insurance products. Additionally, it is involved in real estate and investments activities. Al Khaleej Takaful Insurance Company Q.P.S.C. was incorporated in 1978 and is based in Doha, Qatar.",
    "website": "http://www.alkhaleejtakaful.com",
    "zipcode": "4555"
  },
  "DOHI.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Insurance - Diversified",
    "long_name": "Doha Insurance Group Q.P.S.C.",
    "market": "qa_market",
    "sector": "Financial Services",
    "short_name": "Doha Insurance Group QPSC",
    "state": null,
    "summary": "Doha Insurance Group Q.P.S.C., together with its subsidiaries, engages in insurance and reinsurance businesses. It operates through three segments: Marine and Aviation, Motor, and Fire and General Accidents. The company's personal insurance products include car, travel, and yacht insurance products; and corporate insurance products comprise motor fleet, aviation, engineering, fire, health, and marine insurance products. It provides insurance and reinsurance services according to Islamic Sharia principles under the Doha Takaful name. In addition, the company engages in the insurance intermediation and management; information technology solutions; real estate and investment; and real estate holding and leasing operations. It operates in the state of Qatar, the United Arab Emirates, Lebanon, Germany, and Jordan. The company was formerly known as Doha Insurance Company Q.S.C. and changed its name to Doha Insurance Group Q.P.S.C. in March 2017. Doha Insurance Group Q.P.S.C. was incorporated in 1999 and is headquartered in Doha, Qatar.",
    "website": "http://www.dig.qa",
    "zipcode": null
  },
  "QATI.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Insurance - Diversified",
    "long_name": "Qatar Insurance Company Q.S.P.C.",
    "market": "qa_market",
    "sector": "Financial Services",
    "short_name": "Qatar Insurance QSPC",
    "state": null,
    "summary": "Qatar Insurance Company Q.S.P.C., together with its subsidiaries, provides insurance, reinsurance, real estate, and financial advisory services. It operates through six segments: Marine & Aviation Insurance, Property & Casualty Insurance, Health & Life Insurance, Real Estate, Advisory, and Investments. The company offers personal insurance products, including car, home, travel, boat, motorcycle, and life and medical; and business insurance products, such as energy, marine and aviation, property and commercial, and motor fleet. It is also involved in the investment activities; management of property; and provision of IT and related services. The company operates in the State of Qatar, the United Arab Emirates, the Sultanate of Oman, the State of Kuwait, the United Kingdom, Switzerland, Bermuda, Singapore, Cayman Islands, Gibraltar, Italy, Jersey, and Malta. Qatar Insurance Company Q.S.P.C. was founded in 1964 and is headquartered in Doha, Qatar.",
    "website": "http://www.qatarinsurance.com/corporate",
    "zipcode": null
  },
  "QGRI.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Insurance - Diversified",
    "long_name": "Qatar General Insurance & Reinsurance Company Q.P.S.C.",
    "market": "qa_market",
    "sector": "Financial Services",
    "short_name": "Qatar General Insurance and Rei",
    "state": null,
    "summary": "Qatar General Insurance & Reinsurance Company QPSC, together with its subsidiaries, provides general insurance and reinsurance products for individuals, families, and businesses. The company offers personal insurance products, such as motor, villa/home owner, accident, medical, jewelry, and travel insurance products. It also provides corporate insurance products comprising energy, motor, engineering, casualty, property, medical and life, and marine; and specialized insurance products for restaurants, education institutes, supermarkets, pharmacies, beauty salons, and car show rooms, as well as office, jewelry, and Islamic Takaful insurance products. In addition, the company is involved in the investment, development, and management of real estate properties; repair of automobiles; water bottling and beverage trading; hospitality, exhibition, and events management; and contracting and construction activities, as well as manufacture of rebars and insulation materials. Qatar General Insurance & Reinsurance Company QPSC was founded in 1979 and is headquartered in Doha, Qatar.",
    "website": "http://www.qgirco.com",
    "zipcode": null
  },
  "QISI.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Insurance - Diversified",
    "long_name": "Qatar Islamic Insurance Group  Q.P.S.C.",
    "market": "qa_market",
    "sector": "Financial Services",
    "short_name": "Qatar Islamic Insurance Group Q",
    "state": null,
    "summary": "Qatar Islamic Insurance Group Q.P.S.C. provides a range of insurance products and services in Qatar. The company primarily offers property, travel, motor, marine, fire, engineering, liability, life, medical, money-bankers, energy, electronics and computer, takaful, health, and family package insurance products; and general insurance products, including burglary, plate glass, office multicover, and accident insurance products. It serves private and public sectors, including government offices, banking institutions, hotels, and other organizations, as well as infrastructure projects. The company was formerly known as Qatar Islamic Insurance Company Q.P.S.C. Qatar Islamic Insurance Group Q.P.S.C. was incorporated in 1993 and is based in Doha, Qatar.",
    "website": "http://www.qiic.com.qa",
    "zipcode": null
  },
  "QLMI.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Insurance - Diversified",
    "long_name": "QLM Life & Medical Insurance Company Q.P.S.C.",
    "market": "qa_market",
    "sector": "Financial Services",
    "short_name": "QLM Life and Medical Insurance ",
    "state": null,
    "summary": "QLM Life & Medical Insurance Company Q.P.S.C. provides life and medical insurance services in Qatar and internationally. It operates in two segments, Medical, and Group and Credit Life Insurance. The company was incorporated in 2018 and is based in Doha, Qatar. QLM Life & Medical Insurance Company Q.P.S.C. is a subsidiary of Qatar Insurance Company Q.S.P.C.",
    "website": "http://www.qlm.com.qa",
    "zipcode": null
  }
}
