{
  "QGTS.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Marine Shipping",
    "long_name": "Qatar Gas Transport Company Limited (Nakilat) (QPSC)",
    "market": "qa_market",
    "sector": "Industrials",
    "short_name": "Qatar Gas Transport Ltd QPSC",
    "state": null,
    "summary": "Qatar Gas Transport Company Limited (Nakilat) (QPSC), together with its subsidiaries, operates as a shipping and maritime company in Qatar. The company is involved in the chartering of vessels; ship repair and offshore construction activities; fabrication, construction, and assembly of offshore and onshore structures; and provision of pipe fabrication and solutions, module fabrication and assembly, and onshore field and modular construction services. It also offers towage services through owned and operated tug boats, pilot boats, line boats, crew boats, and other harbor crafts, as well as towing, escorting, berthing, pilot support, afloat and ashore line handling services, emergency response, and marine maintenance support. In addition, the company provides agency and logistic support services, custom formalities, husbandry services, bunker coordination services, crew change and administration services, spare and supply services, and drydocking support services; and various support services to vessels, such as chandlery services, storage facilities, and logistics and related services. Its fleet consists of 29 wholly-owned and 40 jointly-owned vessels; 4 LPG carriers; 1 floating storage regasification unit vessel; and 25 tugs and marine support vessels. The company was founded in 2004 and is headquartered in Doha, Qatar.",
    "website": "http://nakilat.com",
    "zipcode": null
  },
  "QNNS.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Marine Shipping",
    "long_name": "Qatar Navigation Q.P.S.C.",
    "market": "qa_market",
    "sector": "Industrials",
    "short_name": "Qatar Navigation QPSC",
    "state": null,
    "summary": "Qatar Navigation Q.P.S.C. operates as a diversified maritime and logistics company in the State of Qatar, Singapore, the United Arab Emirates, and Germany. The company's Milaha Capital segment provides corporate finance advisory services; and manages the portfolio of financial and real estate investments. Its Milaha Maritime & Logistics segment offers logistics, warehousing, container feeder shipping, non-vessel operating common carrier operations, bulk shipping, shipping agencies, port management and operations, shipyard, and steel fabrication services. Its Milaha Offshore segment provides offshore support services to the oil and gas industry through a fleet of offshore service vessels, which include safety standby vessels, anchor handling tugs, crew and work boats, and dynamic positioning vessels, as well as saturation diving services. The company's Milaha Trading segment trades in trucks, heavy equipment, machinery, and lubrication brands; offers after sales service; and owns and operates a travel agency. Its Milaha Gas and Petrochem segment owns, manages, and operates a fleet of LPG and liquefied natural gas carriers; and provides ocean transportation services to international energy and industrial companies. This segment also owns and manages a fleet of product tankers and one crude carrier, as well as operates various product tankers in partnership with international trading and shipping companies. The company also engages in heavy vehicle selling, cargo handling, fabrication and installation of offshore structures, land transport, vessel chartering, real estate maintenance, warehousing; securities investment activities; trading building and industrial materials, and aggregates; and foreign shipping agency activities. In addition, it owns, hires, purchases, sells, operates, manages, and repairs various ships. Qatar Navigation Q.P.S.C. was incorporated in 1957 and is based in Doha, Qatar.",
    "website": "http://www.milaha.com",
    "zipcode": null
  }
}
