{
  "CAFEN.MX": {
    "city": "Beasain",
    "country": "Spain",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Diversified Machinery",
    "long_name": "Construcciones y Auxiliar de Ferrocarriles, S.A.",
    "market": "mx_market",
    "market_cap": "Small Cap",
    "sector": "Industrial Goods",
    "short_name": "CONSTRUCCIONES Y AUXILIAR DE FE",
    "state": null,
    "summary": "Construcciones y Auxiliar de Ferrocarriles, S.A. designs, manufactures, and sells rolling stock and rail components worldwide. It offers rolling stock products for high speed trains, regional trains, commuter trains, metros, LRV's and tram-trains, trams and light metros, and locomotives. The company also provides equipment and components, such as wheel sets, wheels, axles, gear units, and couplers, as well as after-sales services, including technological advice and inspection guidelines; and traction systems and converters, energy storage systems, and control and communication systems. In addition, it designs, manufactures, supplies, and maintains railway signaling systems. Further, the company is involved in the provision of maintenance, and refurbishment and upgrading services; management of spare parts and workshop equipment; and technical support and consultancy. Additionally, it develops turnkey solutions that cover a range of activities, such as viability studies, civil works, electrification and signaling, maintenance, and the operation of the system. The company was formerly known as Compañía Auxiliar de Ferrocarriles S.A. and changed its name to Construcciones y Auxiliar de Ferrocarriles, S.A. in 1971. Construcciones y Auxiliar de Ferrocarriles, S.A. was incorporated in 1917 and is based in Beasain, Spain.",
    "website": "http://www.caf.net",
    "zipcode": "20200"
  },
  "FDRN.MX": {
    "city": "Sabadell",
    "country": "Spain",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Diversified Machinery",
    "long_name": "Fluidra, S.A.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Industrial Goods",
    "short_name": "FLUIDRA SA",
    "state": null,
    "summary": "Fluidra, S.A., together with its subsidiaries, manufactures and markets accessories and machineries for swimming pools, irrigation, and water treatment and purification fir private and public customers worldwide. The company designs, manufactures, and distributes various components required for the construction, refurbishment, improvement, and maintenance of residential and commercial pools. It also markets fluid handling products; manufactures, produces, and distributes plastic material by injection system, plastic parts for armature; provides financial advisory services in the acquisition of shares; and manufacture and distribution of automatic pool covers. Fluidra, S.A. sells its products primarily under the Jandy, AstralPool, Polaris, Cepex, Zodiac, CTX Professional, and Gre brand names in approximately 45 countries. The company was formerly known as Aquaria de Inv. Corp., S.L. and changed its name to Fluidra, S.A. in September 2007. Fluidra, S.A. was founded in 1969 and is based in Sabadell, Spain.",
    "website": "http://www.fluidra.com",
    "zipcode": "08208"
  }
}
