{
    "CICN.SW": {
        "short_name": "CICOR TECH N",
        "long_name": "Cicor Technologies Ltd.",
        "summary": "Cicor Technologies Ltd. engages in the development and manufacture of electronic components and systems worldwide. The company operates in two divisions, AMS and ES. It develops and produces rigid, rigid-flexible, and flexible printed circuit boards; thin and thick-film substrates and hybrid circuits; and printed electronics. The company also provides outsourced electronic manufacturing services in the fields of printed circuit board assembly, microelectronic assembly, box building and system assembly, control cabinet construction, cable assembly, tool design and fabrication, and plastic injection molding. It serves industrial, medical, aerospace and defense, watches and consumer, automotive and transport communication, and other markets. Cicor Technologies Ltd. was founded in 1966 and is headquartered in Boudry, Switzerland.",
        "currency": "CHF",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Boudry",
        "zipcode": "2017",
        "website": "http://www.cicor.com",
        "full_time_employees": 1901
    },
    "ELMN.SW": {
        "short_name": "ELMA ELECTRONIC N",
        "long_name": "Elma Electronic AG",
        "summary": "Elma Electronic AG manufactures and sells electronic packaging products for the embedded systems market worldwide. It offers backplanes; chassis platforms; cabinet products, including cabinets and racks, mobile carts, cases and enclosures, and accessories; and embedded boards comprising single board computers, storage modules, ethernet switches, carriers and adapters, FPGAs, and and I/O communication products. The company also provides embedded computing systems; enclosures and components, including table and small housings, subracks, housing components, front panels, and handles and accessories for computer housings; power solutions comprising power distribution boards, modular solutions, power systems, PSU product configurator, and standard power supplies; and rotary switches, including encoders, knobs and caps, LED'S, audio solutions, selector and coded switches, multi rotary switches, and mentor components. The company serves aerospace and defense, industrial, communications, transportation, energy, medical, science and research, test and measurement, broadcast, and audio/video industries. Elma Electronic AG was founded in 1960 and is headquartered in Wetzikon, Switzerland.",
        "currency": "CHF",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Wetzikon",
        "zipcode": "8620",
        "website": "http://www.elma.com",
        "full_time_employees": 778
    },
    "LEHN.SW": {
        "short_name": "LEM N",
        "long_name": "LEM Holding SA",
        "summary": "LEM Holding SA, together with its subsidiaries, provides solutions for measuring electrical parameters in China, the United States, Germany, Japan, Italy, Switzerland, and internationally. It operates in two segments, Industry and Automotive. The Industry segment develops, manufactures, and sells current and voltage transducers for use in various industrial applications. The Automotive segment develops, manufactures, and sells transducers for the measurement of current and voltage of various industrial applications. Its products are used in various applications, such as drives & welding, renewable energies and power supplies, traction, high-precision, conventional and green cars businesses, as well as for AC/DC converters, uninterrupted power supply systems for computers, micro turbines, and wind and solar power generation. The company was founded in 1972 and is based in Plan-les-Ouates, Switzerland.",
        "currency": "CHF",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Plan-les-Ouates",
        "zipcode": "1228",
        "website": "http://www.lem.com",
        "full_time_employees": 1500
    },
    "SAHN.SW": {
        "short_name": "SCHAFFNER N",
        "long_name": "Schaffner Holding AG",
        "summary": "Schaffner Holding AG, together with its subsidiaries, develops, manufactures, and sells solutions for power electronic systems worldwide. The company operates through three segments: Electromagnetic Compatibility (EMC), Power Magnetics, and Automotive. It offers EMC/EMI filters and chokes, including IEC inlet filters and power entry modules, single-phase filters, DC filters, 3-phase filters, 3-phase + neutral line filters, LCL filters, EMC/EMI chokes, feedthrough components, PCB filters, and pulse transformers; power solutions comprising line and load reactors, Ecosine passive harmonic filters, Ecosine active harmonic filters, and output filters; and power magnetics, which include inductors, filters, and transformers. The company also provides automotive components, such as EMC/EMI filters, common mode chokes, magnetic components, inductors, and antennas. It primarily serves motor drives, infrastructure, machinery, building technology, factory automation, mobility, renewables, power supply, and automotive markets. The company was founded in 1962 and is headquartered in Luterbach, Switzerland.",
        "currency": "CHF",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "EBS",
        "market": "ch_market",
        "country": "Switzerland",
        "state": null,
        "city": "Luterbach",
        "zipcode": "4542",
        "website": "http://www.schaffner.com",
        "full_time_employees": 2180
    },
    "T1EL34.SA": {
        "short_name": "TE CONNECTIVDRN",
        "long_name": "TE Connectivity Ltd.",
        "summary": "TE Connectivity Ltd., together with its subsidiaries, manufactures and sells connectivity and sensor solutions in Europe, the Middle East, Africa, the AsiaÂ\u0096Pacific, and the Americas. The company operates through three segments: Transportation Solutions, Industrial Solutions, and Communications Solutions. The Transportation Solutions segment provides terminals and connector systems and components, sensors, antennas, relays, application tooling, and wire and heat shrink tubing products for use in the automotive, commercial transportation, and sensor markets. The Industrial Solutions segment offers terminals and connector systems and components; and heat shrink tubing, interventional medical components, relays, and wires and cables for aerospace, defense, oil and gas, industrial equipment, medical, and energy markets. The Communications Solutions segment supplies electronic components, such as terminals and connector systems and components, relays, heat shrink tubing, and antennas for the data and devices, and appliances markets. TE Connectivity Ltd. sells its products to approximately 140 countries primarily through direct selling to manufacturers, as well as through third-party distributors. The company was formerly known as Tyco Electronics Ltd. and changed its name to TE Connectivity Ltd. in March 2011. TE Connectivity Ltd. was incorporated in 2000 and is based in Schaffhausen, Switzerland.",
        "currency": "BRL",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SAO",
        "market": "br_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schaffhausen",
        "zipcode": "8200",
        "website": "http://www.te.com",
        "full_time_employees": 80000
    },
    "TEL": {
        "short_name": "TE Connectivity Ltd. New Switze",
        "long_name": "TE Connectivity Ltd.",
        "summary": "TE Connectivity Ltd., together with its subsidiaries, manufactures and sells connectivity and sensor solutions in Europe, the Middle East, Africa, the AsiaÂ\u0096Pacific, and the Americas. The company operates through three segments: Transportation Solutions, Industrial Solutions, and Communications Solutions. The Transportation Solutions segment provides terminals and connector systems and components, sensors, antennas, relays, application tooling, and wire and heat shrink tubing products for use in the automotive, commercial transportation, and sensor markets. The Industrial Solutions segment offers terminals and connector systems and components; and heat shrink tubing, interventional medical components, relays, and wires and cables for aerospace, defense, oil and gas, industrial equipment, medical, and energy markets. The Communications Solutions segment supplies electronic components, such as terminals and connector systems and components, relays, heat shrink tubing, and antennas for the data and devices, and appliances markets. TE Connectivity Ltd. sells its products to approximately 140 countries primarily through direct selling to manufacturers, as well as through third-party distributors. The company was formerly known as Tyco Electronics Ltd. and changed its name to TE Connectivity Ltd. in March 2011. TE Connectivity Ltd. was incorporated in 2000 and is based in Schaffhausen, Switzerland.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Switzerland",
        "state": null,
        "city": "Schaffhausen",
        "zipcode": "8200",
        "website": "http://www.te.com",
        "full_time_employees": 80000
    }
}