{
    "1773.T": {
        "short_name": "YTL CORP",
        "long_name": "YTL Corporation Berhad",
        "summary": "YTL Corporation Berhad, an investment holding company, operates as an integrated infrastructure developer in Malaysia, the United Kingdom, Singapore, Indonesia, Australia, Japan, Jordan, and China. It generates, transmits, and distributes electricity through gas and coal fired power plants as an independent power producer; owns and operates power transmission grids; constructs, operates, and maintains power plants and express rail links; and constructs civil engineering projects. The company also invests in and develops properties; owns and manages hotels and resorts; owns and manages real estate investment trusts; manufactures and trades in clinker, cement, and ready mixed concrete; and provides carbon consulting services. In addition, it engages in the water and sewerage businesses; provision of education services; and development, ownership, and operation of narrowcast digital media networks, as well as provides mobile and 4G Internet services. YTL Corporation Berhad was founded in 1955 and is based in Kuala Lumpur, Malaysia.",
        "currency": "JPY",
        "sector": "Utilities",
        "industry": "Utilities - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    },
    "TML.AX": {
        "short_name": "TIMAH FPO",
        "long_name": "Timah Resources Limited",
        "summary": "Timah Resources Limited, through its subsidiary, Mistral Engineering Sdn Bhd., generates biogas renewable energy in Australia and Malaysia. It owns and operates a biogas power plant with approximately 4 megawatts located in Sabah, Malaysia. The company is based in Sandakan, Malaysia. Timah Resources Limited is a subsidiary of Cash Nexus (M) Sdn. Bhd.",
        "currency": "AUD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Malaysia",
        "city": "Sandakan"
    },
    "TNABY": {
        "short_name": "TENAGA NASIONAL BERHAD",
        "long_name": "Tenaga Nasional Berhad",
        "summary": "Tenaga Nasional Berhad engages in the generation, transmission, distribution, and sale of electricity in Malaysia and internationally. The company operates and maintains thermal generation facilities and hydroelectric power generating schemes, as well as supports six independent power producers; and manages and operates the National Grid that is connected to Thailand's transmission system in the north, as well as Singapore's transmission system at Senoko in the south. It also supplies fuel and coal for power generation; generates, distributes, supplies, deals in, and sells various energy sources, as well as provides related technical services; develops district cooling systems; operates and maintains co-generation works; manufactures, sells, and repairs distribution, power, and earthing transformers; and develops, owns, and manages dry bulk terminals. In addition, the company provides turnkey contracting of transmission substations; repair and maintenance services to heavy industries and other related services; higher education, and telecommunication and IT infrastructure solution and services; research and development services in the areas of engineering, information technology, business, accountancy, and liberal studies; and training courses. Further, it offers insurance and reinsurance products, parking facilities for motor vehicles, technical and laboratory, and consultancy and other services; manufactures and distributes power and general cables, and aluminum rods; operates an integrated district cooling systems for air conditioning systems of office buildings; assembles, manufactures, tests, reconditions, and distributes high and medium voltage switchgears, and control gears for transmission and distribution of electric power; and operates wind assets. It primarily serves commercial and industrial, and residential customers. The company was founded in 1949 and is headquartered in Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Utilities",
        "industry": "Utilities - Renewable",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Malaysia",
        "city": "Kuala Lumpur"
    }
}