{
    "0KE.F": {
        "short_name": "KERNEL HLDG S.A.",
        "long_name": "Kernel Holding S.A.",
        "summary": "Kernel Holding S.A. operates as a diversified agricultural company in Ukraine, Europe, and North America. The company operates through three segments: Oilseed Processing, Infrastructure and Trading, and Farming. The Oilseed Processing segment is involved in the production, refining, bottling, marketing, and distribution of bottled sunflower oil; and produces and sells crude and refined sunflower oil in bulk, as well as meal products. The Infrastructure and Trading segment provides grain handling and transshipment services in the Chornomorsk port; grain and oilseed cleaning, drying, and storage services; and proprietary trading and silo services, as well as sourcing and merchandising services of wholesale sunflower oil and grains. The Farming segment engages in agricultural farming; and the production of corn, wheat, soybean, sunflower seed, and rapeseed. The company also exports its products. Kernel Holding S.A. was founded in 1995 and is headquartered in Kyiv, Ukraine.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ukraine",
        "state": null,
        "city": "Kiev",
        "zipcode": "01001",
        "website": "http://www.kernel.ua",
        "market_cap": "Small Cap"
    },
    "MPQ.F": {
        "short_name": "MHP SE GDR S/2",
        "long_name": "MHP SE",
        "summary": "MHP SE, together with its subsidiaries, produces and sells food and poultry products in Ukraine and internationally. It operates in four segments: Poultry & Related Operations, Grain Growing, Meat-Processing & Other Agricultural Operations, and European Operating. The Poultry & Related Operations segment produces and sells fresh and frozen chicken meats, vegetable oils, including sunflower and soybean, as well as mixed fodder under the Nasha Riaba and Ukrainian Chicken brands in Ukraine; and under the Qualiko, Ukrainian Chicken, ?ssilah, and Sultanah names to export markets. The Grain Growing segment grows crops for fodder production and sale to third parties. The Meat-Processing & Other Agricultural Operations segment produces and sells sausages, processed and cooked meats, convenience foods, and produce from cattle and milk operations under the Bashchinsky, Lehko!, Qualiko, and Sytni brands. The European Operating segment engages in the production and sale of chicken meat and processed poultry meat products under the PP and Poli brands. It is also involved in hatching eggs; and growing of corn, sunflower, and soybean seeds, as well as rape and wheat grains to third parties. The company was formerly known as MHP S.A. and changed its name to MHP SE in August 2017. MHP SE was founded in 1998 and is headquartered in Kiev, Ukraine.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ukraine",
        "state": null,
        "city": "Kiev",
        "zipcode": "03143",
        "website": "http://mhp.com.ua",
        "market_cap": "Small Cap"
    }
}