{
    "1E0.F": {
        "short_name": "ADASTRIA CO. LTD.",
        "long_name": "Adastria Co., Ltd.",
        "summary": "Adastria Co., Ltd. plans, produces, and retails clothes and sundry goods in Japan. It offers women's, men's, and children's apparel; and lifestyle items, including bags, shoes, kitchen and interior goods, and furniture under various brands. As of February 28, 2021, the company operated 1,400 retail stores in Hong Kong, China, Taiwan, South Korea, and the United States. The company was formerly known as Adastria Holdings Co., Ltd. and changed its name to Adastria Co., Ltd. in June 2015. Adastria Co., Ltd. was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.adastria.co.jp",
        "full_time_employees": null
    },
    "2668.T": {
        "short_name": "TABIO CORPORATION",
        "long_name": "Tabio Corporation",
        "summary": "Tabio Corporation plans, manufactures, wholesales, and retails socks. The company offers toe, plain, ankle, crew, high, over knee high, and parts socks; foot covers and cover socks; tights; short, wedding, and all-through stockings; and sports socks comprising running, golf, soccer and futsal, and yoga socks, as well as leg warmers. It also provides health/beauty socks, including inner, pressure, and cold socks, as well as socks for swelling, foot fatigue, foot odor, shoe slip, and sleep measures; leggings and leggings pants; and fresher, business, ceremonial occasion, suit casual, and long shoe socks. The company was formerly known as DAN Co., Ltd. and changed its name to Tabio Corporation in September 2006. Tabio Corporation was founded in 1968 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "556-0011",
        "website": "http://www.tabio.com",
        "full_time_employees": null
    },
    "2685.T": {
        "short_name": "ADASTRIA CO LTD",
        "long_name": "Adastria Co., Ltd.",
        "summary": "Adastria Co., Ltd. plans, produces, and retails clothes and sundry goods in Japan. It offers women's, men's, and children's apparel; and lifestyle items, including bags, shoes, kitchen and interior goods, and furniture under various brands. As of February 28, 2021, the company operated 1,400 retail stores in Hong Kong, China, Taiwan, South Korea, and the United States. The company was formerly known as Adastria Holdings Co., Ltd. and changed its name to Adastria Co., Ltd. in June 2015. Adastria Co., Ltd. was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.adastria.co.jp",
        "full_time_employees": null
    },
    "2776.T": {
        "short_name": "SHINTO HOLDINGS INC",
        "long_name": "SHINTO Holdings, Inc.",
        "summary": "SHINTO Holdings, Inc. engages in the wholesale of apparel in Japan. The company is also involved in the underwear, uniform, trading, and brand licensing business, as well as offers beauty serum face mask products. In addition, it engages in the purchase, sale, and management of real estate properties; and provides real estate services, including concierge, property information, delivery, and tax consultation. The company serves specialty stores, mass retailers, sports mass retailers, etc. It offers its products under the Modern Amusement, RUSS-K, and CONART brands. The company was formerly known as Crymson Co.,Ltd. and changed its name to Shinto Holdings, Inc. in October 2017. Shinto Holdings, Inc. was incorporated in 1984 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-0004",
        "website": "http://www.shintohd.co.jp",
        "full_time_employees": 29
    },
    "3002.T": {
        "short_name": "GUNZE LTD",
        "long_name": "Gunze Limited",
        "summary": "Gunze Limited engages in the functional solutions, apparel, and lifestyle creations businesses in Japan. It offers plastic films comprising shrink films, flexible multilayer sheets, functional and multilayer film tubings, opp films, and nylon films, as well as consulting services related to comprehensive package system; engineering plastics, such as small-diameter fluoro resin heat-shrinkable tubes, thin-walled fluoro resin tubes, fiber products, films and sheets, and seamless belts; electronic components, including various touch screens and functional films, as well as commissioned manufacturing services; and medical materials consisting of bioabsorbable surgical suture threads, bone fixation devices, artificial dermis, absorbable reinforcement felt, and medical stockings. The company also provides equipment for packaging and film wrapping, post-press of printing, and pharmaceuticals and cosmetics, as well as equipment for dairy, beverage, and food products; innerwear, legwear, nightwear, and home casual wear products for physical and mental relaxation; and threads and accessories, such as sewing threads for clothing, industrial materials, and automotive applications. In addition, it operates 22 Gunze sports clubs, and fitness studios, spas, and junior schools; sells plant materials and nursery trees, flowers, and gardening products; develops commercial facilities; leases shopping complexes, housing, and office buildings; and offers technology, equipment, and funds energy conservation, as well as thermal insulation materials and solar power generation systems. The company was formerly known as Gunze Silk Manufacturing Co., Ltd. and changed its name to Gunze Limited in 1967. Gunze Limited was founded in 1896 and is headquartered in Ayabe, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ayabe",
        "zipcode": "623-8511",
        "website": "http://www.gunze.co.jp",
        "full_time_employees": 6185
    },
    "3045.T": {
        "short_name": "KAWASAKI & CO.LTD.",
        "long_name": "Kawasaki & Co., Ltd.",
        "summary": "Kawasaki & Co., Ltd. manufactures and sells clothing products under the Lake Ulster brand. The company offers towels, handkerchiefs, bags, pouches, accessories, interior items, bath toiletries, and other items. It is also involved in the rental and leasing of warehouses, as well as photovoltaic power generation and other businesses. The company sells its products through retail and department stores; and directly operated stores. Kawasaki & Co., Ltd. was founded in 1971 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "595-0814",
        "website": "http://www.kawasaki-corp.co.jp",
        "full_time_employees": 43
    },
    "3205.T": {
        "short_name": "DAIDOH LIMITED",
        "long_name": "Daidoh Limited",
        "summary": "Daidoh Limited manufactures and sells ready-made men's and women's clothing and accessories in Japan. The company offers custom made clothing products, knitted yarns, worsted fabrics, apparel, etc. It also provides OEM, as well as import and export services. In addition, the company manufactures, sells, and retails yarns, fibrous materials for apparel, and apparel. Further, it sells its products under the NEWYORKER and House Tartan brands. Further, the company is involved in the leasing of real-estate properties, such as shopping center stores and office buildings; and operation and real estate management of commercial facilities. The company was founded in 1879 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-8619",
        "website": "http://www.daidoh-limited.com",
        "full_time_employees": 730
    },
    "3529.T": {
        "short_name": "ATSUGI CO LTD",
        "long_name": "Atsugi Co., Ltd.",
        "summary": "Atsugi Co., Ltd. develops, manufactures, and sells pantyhose products, stockings, and lingerie products for women in Japan. The company also provides socks for women, children, and men; and elderly care products, such as portable deodorizing toilets. Atsugi Co., Ltd. was founded in 1947 and is headquartered in Ebina, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ebina",
        "zipcode": null,
        "website": "http://www.atsugi.co.jp",
        "full_time_employees": 1535
    },
    "3591.T": {
        "short_name": "WACOAL HOLDINGS CORP",
        "long_name": "Wacoal Holdings Corp.",
        "summary": "Wacoal Holdings Corp. engages in the manufacture, wholesale, and retail sale of intimate apparel, outerwear, sportswear, and other textile products and accessories in Japan, Asia, Oceania, the Americas, and Europe. It operates through Wacoal Business (Domestic), Wacoal Business (Overseas), Peach John Business, and Other Businesses segments. The company offers women's foundation garments, including brassieres and girdles; and lingerie, such as slips, bra-slips, and women's briefs. It also designs, manufactures, and sells nightwear, children's underwear, hosiery, and other apparel and textile goods, as well as provides various other services. In addition, the company engages in the restaurant businesses; cultural and service-related operations; construction of stores and interior design; and production and sale of mannequins. Wacoal Holdings Corp. was founded in 1946 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8530",
        "website": "http://www.wacoalholdings.jp",
        "full_time_employees": 20984
    },
    "3597.T": {
        "short_name": "JICHODO CO LTD",
        "long_name": "JICHODO Co.,Ltd.",
        "summary": "JICHODO Co.,Ltd. manufactures and sells uniforms in Japan and internationally. It also provides men's casuals, medical white coats, and safety shoes. The company sells its products through mass retailers, roadside shops, specialty stores, delivery and general wholesalers, and uniform shops. JICHODO Co.,Ltd. was founded in 1924 and is headquartered in Fukuyama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuyama",
        "zipcode": "729-3193",
        "website": "http://www.jichodo.co.jp",
        "full_time_employees": 241
    },
    "3598.T": {
        "short_name": "YAMAKI CO LTD",
        "long_name": "Yamaki Co.,Ltd.",
        "summary": "Yamaki Co.,Ltd. engages in planning, manufacture, and sale of men's and women's shirts primarily in Japan. The company operates under the Shirt of the shirt, SHIRTY'S, CHOYA shirt, STYLE WORKS, Shirt station, SHIRT HOUSE, and Men's Closet brand names. It also operates shops. The company was founded in 1953 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-0005",
        "website": "http://www.e-yamaki.co.jp",
        "full_time_employees": 1172
    },
    "3611.T": {
        "short_name": "MATSUOKA CORPORATION",
        "long_name": "Matsuoka Corporation",
        "summary": "Matsuoka Corporation engages in planning, manufacturing, and selling apparel products in Japan and internationally. The company is involved in sewing formal, casual, work, and inner wear. It also develops and processes fabrics. The company was founded in 1956 and is headquartered in Fukuyama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuyama",
        "zipcode": "720-0045",
        "website": "http://www.matuoka.co.jp",
        "full_time_employees": 13898
    },
    "7447.T": {
        "short_name": "NAGAILEBEN CO",
        "long_name": "Nagaileben Co., Ltd.",
        "summary": "Nagaileben Co., Ltd. produces and sells medical clothing in Japan. The company was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0044",
        "website": "http://www.nagaileben.co.jp",
        "full_time_employees": 516
    },
    "7545.T": {
        "short_name": "NISHIMATSUYA CHAIN CO",
        "long_name": "Nishimatsuya Chain Co., Ltd.",
        "summary": "Nishimatsuya Chain Co., Ltd. operates a chain of specialty stores for baby/children's living goods in Japan. The company offers newborn and baby clothes; children's wear; accessories, such as baby and children's hat, sock, shoe, and towel; room products; stroller buggies, child seats and car supplies, hugging straps, rain goods, bags/backpacks, and lesson bags; milk, food, baby bottle, and hygiene products; toys; and maternity products. It operates 1,006 stores. The company was incorporated in 1956 and is headquartered in Himeji, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Himeji",
        "zipcode": "671-0218",
        "website": "http://www.24028.jp",
        "full_time_employees": 713
    },
    "7606.T": {
        "short_name": "UNITED ARROWS LTD",
        "long_name": "United Arrows Ltd.",
        "summary": "United Arrows Ltd. plans, buys, and retails men's and women's apparel, accessories, and other products in Japan. As of March 31, 2019, it operated a network of 358 stores. The company also sells its products through online stores. United Arrows Ltd. was founded in 1989 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.united-arrows.co.jp",
        "full_time_employees": null
    },
    "8011.T": {
        "short_name": "SANYO SHOKAI",
        "long_name": "Sanyo Shokai Ltd.",
        "summary": "Sanyo Shokai Ltd. manufactures and sells men's and women's clothes and accessories through department stores, specialty stores, and directly managed stores in Japan. The company was founded in 1942 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0003",
        "website": "http://www.sanyo-shokai.co.jp",
        "full_time_employees": 1572
    },
    "8016.T": {
        "short_name": "ONWARD HOLDINGS CO LTD",
        "long_name": "Onward Holdings Co., Ltd.",
        "summary": "Onward Holdings Co., Ltd., through its subsidiaries, designs, manufactures, and sells men's, women's, and children's apparel, accessories, and other products in Japan, Europe, Asia, and the United States. The company operates through Apparel Business and Lifestyle Business segments. It offers uniforms, jewelry, accessories, health-related and cosmetic products, gift items, gift catalogs, and sales promotion goods; pet supplies, and other product lines; stage, theater, and ballet supplies; inner wear and related products; and sports shoes, leather goods, dance supplies, and luxury and fashion products. The company also engages in the planning, designing, and constructing of commercial, cultural, and environmental facilities; promotion of art and culture; planning and production of advertising and promotional materials; management, purchase, sale, and rental of real estate; import, export, and sale of cosmetic products; retail and wholesale of clothing products and bags; operation of stores; and operation and management of Lakeland Country Club and Talofofo Golf Club, as well as hotels and resort facilities. In addition, it is involved in the provision of management consultation, and property and life insurance agency services; and apparel sales, restaurant management, digital marketing, and IT solutions businesses. The company offers its products primarily under the GRACE CONTINENTAL, JIL SANDER, JOSEPH, J. PRESS, Nijyusanku, ICB, KASHIYAMA, Jiyuku, and other brands. It provides its products through department stores, as well as through e-commerce stores. The company was formerly known as Onward Kashiyama Co., Ltd. and changed its name to Onward Holdings Co., Ltd. in 2007. Onward Holdings Co., Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8239",
        "website": "http://www.onward-hd.co.jp",
        "full_time_employees": 7498
    },
    "8040.T": {
        "short_name": "TOKYO SOIR CO",
        "long_name": "Tokyo Soir Co., Ltd.",
        "summary": "Tokyo Soir Co., Ltd. engages in the manufacture and wholesale of women's formal wear and accessories in Japan. It offers black and color formal wear, and ceremony suit. The company sells its products through department stores, chain stores, and online. Tokyo Soir Co., Ltd. was founded in 1954 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-8604",
        "website": "http://www.soir.co.jp",
        "full_time_employees": null
    },
    "8105.T": {
        "short_name": "HOTTA MARUSHO CO",
        "long_name": "Marushohotta Co.,Ltd.",
        "summary": "Marushohotta Co.,Ltd. manufactures and sells apparels in Japan. It designs twisted yarns; mattress, feather and wool futon, and health products; decorations, jewelry, and loading and small items; and home fashion, women's clothing, baby and kids' clothes, etc. The company was founded in 1861 and is headquartered in Tokyo, Japan. Marushohotta Co.,Ltd. is a subsidiary of RIZAP Group Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0006",
        "website": "http://www.pearly-marusho.co.jp",
        "full_time_employees": null
    },
    "8107.T": {
        "short_name": "KIMURATAN CORP",
        "long_name": "Kimuratan Corporation",
        "summary": "Kimuratan Corporation plans, produces, and sells baby and children's clothing in Japan. The company offers its products under the n.o.u.s, Love, Coeur a Coeur, Piccolo, Biquette Club, La Chaive, Lily ivory, dolcina, Bobson, and Biquette brands. It is also involved in the store management and childcare management operations. The company was founded in 1925 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0001",
        "website": "http://www.kimuratan.co.jp",
        "full_time_employees": null
    },
    "8127.T": {
        "short_name": "YAMATO INTERNATIONAL INC",
        "long_name": "Yamato International Inc.",
        "summary": "Yamato International Inc. plans, manufactures, and sells apparel products focusing on casual wear in Japan. It offers its products under the Crocodile, Crocodile Ladies, Switch motion, Crocodile Sports, Crocodile chic, Crocodile Three Days, CITERA, Penfield, and Lighting Bolt brands. The company was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "577-0061",
        "website": "http://www.yamatointr.co.jp",
        "full_time_employees": 195
    },
    "8143.T": {
        "short_name": "LAPINE CO",
        "long_name": "Lapine Co., Ltd.",
        "summary": "Lapine Co., Ltd. engages in the produces, wholesales, and retails fashion apparel for women under the LAPINE brand in Japan. The company was formerly known as Daito Co., Ltd. and changed its name to Lapine Co., Ltd. in April 1967. Lapine Co., Ltd. was founded in 1950 and is based in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-0008",
        "website": "http://www.lapine.co.jp",
        "full_time_employees": 174
    },
    "8215.T": {
        "short_name": "GINZA YAMAGATAYA CO",
        "long_name": "Ginza Yamagataya Co., Ltd.",
        "summary": "Ginza Yamagataya Co., Ltd. manufactures and sells clothing for men and women in Japan. It operates 30 clothing stores. The company was founded in 1907 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0043",
        "website": "http://www.ginyama.co.jp",
        "full_time_employees": null
    },
    "8256.T": {
        "short_name": "MARUMITSU CO",
        "long_name": "Marumitsu Co., Ltd.",
        "summary": "Marumitsu Co., Ltd. engages in the clothing wholesale business in Japan. The company sells clothing, bedding, interiors, clothing goods, etc.; color depositing shampoo/heat care products; and antibody detection and micro blood collection kits. It also operates retail stores for sale of men's clothing under the Kent House brand; develops B to B platform; and deals in live performance promotional goods, and artist-branding related goods. The company was founded in 1900 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0056",
        "website": "http://www.proroute.co.jp",
        "full_time_employees": null
    },
    "9275.T": {
        "short_name": "NARUMIYA INTERNATIONAL CO LTD",
        "long_name": "NARUMIYA INTERNATIONAL Co., Ltd.",
        "summary": "NARUMIYA INTERNATIONAL Co., Ltd., together with its subsidiaries, manufactures, processes, and sells children's clothing and related products. The company offers clothes for babies, toddlers, and juniors. It also provides logistics management and purchasing of products; packaging and shipment services, including assortment; and products storage, management, transportation, and logistics services. The company offers its products under the ANNA SUI mini, kate spade new york childrenswear, mezzo piano, X-girl Stages, XLARGE KIDS, kladskap, petit main, b.ROOM, sense of wonder, Love & Peace & Money, baby cheer, Sophie la giraffe, Pupil House, Lovetoxic, mezzo piano junior, pom ponette junior, Lindsay, BLUECROSS girls, by LOVEiT, BLUE CROSS, and petit main LIEN brands. As of February 28, 2019, it operated 769 stores in Japan. The company also offers its products online. The company was formerly known as NI Corporation Co., Ltd. and changed its name to NARUMIYA INTERNATIONAL Co., Ltd. in September 1995. NARUMIYA INTERNATIONAL Co., Ltd. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://www.narumiya-net.co.jp",
        "full_time_employees": 1020
    },
    "9876.T": {
        "short_name": "COX CO LTD",
        "long_name": "Cox Co., Ltd.",
        "summary": "Cox Co., Ltd. engages in the planning, manufacturing, and selling of clothing and miscellaneous products in Japan. The company offers men's, women's, and children clothing under the Ikka, LBC, VENCE EXCHANGE, CURRENT, notch, 8marbull, NO NEED, and Candy Beans brands. As of February 28, 2020, it operated a network of 222 stores. The company was formerly known as Emizu Co., Ltd. and changed its name to Cox Co., Ltd. in December 1984. The company was founded in 1958 and is headquartered in Tokyo, Japan. Cox Co., Ltd. is a subsidiary of Aeon Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0007",
        "website": "http://www.cox-online.co.jp",
        "full_time_employees": 1170
    },
    "9885.T": {
        "short_name": "CHARLE CO LTD",
        "long_name": "Charle Co.,Ltd.",
        "summary": "Charle Co.,Ltd. engages in the sale of apparel, cosmetics, health foods, etc. It primarily sells women's underwear, innerwear, and leg knits, as well as men's and kids clothing; and skin, body, and hair care products. The company sells its products through mail order and door-to-door channels. Charle Co.,Ltd. was founded in 1975 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "654-0192",
        "website": "http://www.charle.co.jp",
        "full_time_employees": null
    },
    "9982.T": {
        "short_name": "TAKIHYO CO LTD",
        "long_name": "Takihyo Co., Ltd.",
        "summary": "Takihyo Co., Ltd. engages in the apparel, retail, textile, lifestyle, real estate, and material businesses in Japan and internationally. The company plans, designs, produces, market researches, and ships ladies', babies/kids, men's, and home wear; and lifestyle goods, such as cushions and kitchen mats. It also operates the sportswear brand ZOY, the men's wear brand BOB, and the G/FORE and WAAC brands for golf gloves, shoes, accessories, and apparel for men and women; operates a boutique under the Melangetopand brand name; and produces and sells woolen fabric, synthetic cotton blends, and knits to apparel manufacturers and trading companies. In addition, the company operates Komeda Coffee Shop as a franchisee; operates Shina, an art gallery that offers traditional crafts, modern pops, and art and subculture; and rents and manages real estate properties. Further, it provides packaging films; synthetic resins for automobile, electronic equipment, electric appliances, and space and aviation instruments, as well as for food packaging materials and daily necessities items; and industrial materials to process interior furniture, miscellaneous goods, and building materials. Takihyo Co., Ltd. was founded in 1751 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "451-8688",
        "website": "http://www.takihyo.co.jp",
        "full_time_employees": 881
    },
    "GUN.F": {
        "short_name": "GUNZE LTD",
        "long_name": "Gunze Limited",
        "summary": "Gunze Limited engages in the functional solutions, apparel, and lifestyle creations businesses in Japan. It offers plastic films comprising shrink films, flexible multilayer sheets, functional and multilayer film tubings, opp films, and nylon films, as well as consulting services related to comprehensive package system; engineering plastics, such as small-diameter fluoro resin heat-shrinkable tubes, thin-walled fluoro resin tubes, fiber products, films and sheets, and seamless belts; electronic components, including various touch screens and functional films, as well as commissioned manufacturing services; and medical materials consisting of bioabsorbable surgical suture threads, bone fixation devices, artificial dermis, absorbable reinforcement felt, and medical stockings. The company also provides equipment for packaging and film wrapping, post-press of printing, and pharmaceuticals and cosmetics, as well as equipment for dairy, beverage, and food products; innerwear, legwear, nightwear, and home casual wear products for physical and mental relaxation; and threads and accessories, such as sewing threads for clothing, industrial materials, and automotive applications. In addition, it operates 22 Gunze sports clubs, and fitness studios, spas, and junior schools; sells plant materials and nursery trees, flowers, and gardening products; develops commercial facilities; leases shopping complexes, housing, and office buildings; and offers technology, equipment, and funds energy conservation, as well as thermal insulation materials and solar power generation systems. The company was formerly known as Gunze Silk Manufacturing Co., Ltd. and changed its name to Gunze Limited in 1967. Gunze Limited was founded in 1896 and is headquartered in Ayabe, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Ayabe",
        "zipcode": "623-8511",
        "website": "http://www.gunze.co.jp",
        "full_time_employees": 6185
    },
    "LOO.F": {
        "short_name": "LOOK HOLDINGS INC.",
        "long_name": "Look Holdings Incorporated",
        "summary": "Look Holdings Incorporated, together with its subsidiaries, engages in planning, manufacturing, and selling women's apparels and related accessories in Japan, South Korea, Europe, China, Hong Kong, the United States, and China. Its products include handbag and leather goods; fashion, home interiors, and design products; and ballet shoes. The company offers its products under the BENSIMON, Repetto, MARIMEKKO, KEITH, LAISSÃ\u0089 PASSÃ\u0089, A.P.C., IL BISONTE, and Gelateria Marghera brands. It also manufactures and sells gelato; and provides logistics services. The company sells its products through its physical and online stores. The company was formerly known as Look Incorporated and changed its name to Look Holdings Incorporated in January 2018. Look Holdings Incorporated was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.look-inc.jp",
        "full_time_employees": 1415
    },
    "OWK.F": {
        "short_name": "ONWARD HOLDINGS CO. LTD.",
        "long_name": "Onward Holdings Co., Ltd.",
        "summary": "Onward Holdings Co., Ltd., through its subsidiaries, designs, manufactures, and sells men's, women's, and children's apparel, accessories, and other products in Japan, Europe, Asia, and the United States. The company operates through Apparel Business and Lifestyle Business segments. It offers uniforms, jewelry, accessories, health-related and cosmetic products, gift items, gift catalogs, and sales promotion goods; pet supplies, and other product lines; stage, theater, and ballet supplies; inner wear and related products; and sports shoes, leather goods, dance supplies, and luxury and fashion products. The company also engages in the planning, designing, and constructing of commercial, cultural, and environmental facilities; promotion of art and culture; planning and production of advertising and promotional materials; management, purchase, sale, and rental of real estate; import, export, and sale of cosmetic products; retail and wholesale of clothing products and bags; operation of stores; and operation and management of Lakeland Country Club and Talofofo Golf Club, as well as hotels and resort facilities. In addition, it is involved in the provision of management consultation, and property and life insurance agency services; and apparel sales, restaurant management, digital marketing, and IT solutions businesses. The company offers its products primarily under the GRACE CONTINENTAL, JIL SANDER, JOSEPH, J. PRESS, Nijyusanku, ICB, KASHIYAMA, Jiyuku, and other brands. It provides its products through department stores, as well as through e-commerce stores. The company was formerly known as Onward Kashiyama Co., Ltd. and changed its name to Onward Holdings Co., Ltd. in 2007. Onward Holdings Co., Ltd. was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8239",
        "website": "http://www.onward-hd.co.jp",
        "full_time_employees": 7498
    },
    "TSIHF": {
        "short_name": "TSI HOLDINGS CO LTD",
        "long_name": "TSI Holdings Co.,Ltd.",
        "summary": "TSI Holdings Co., Ltd. plans, manufactures, sells, and imports clothing in Japan and internationally. It primarily offers men's, women's, and kid's wear. The company is also involved in the import, export, wholesale, and retail of clothing; and mail-order sales and e-commerce business, as well as production and logistics management activities. It serves specialty and department stores. The company was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.tsi-holdings.com",
        "full_time_employees": null
    },
    "WA5.F": {
        "short_name": "WACOAL HLDGS CORP.",
        "long_name": "Wacoal Holdings Corp.",
        "summary": "Wacoal Holdings Corp. engages in the manufacture, wholesale, and retail sale of intimate apparel, outerwear, sportswear, and other textile products and accessories in Japan, Asia, Oceania, the Americas, and Europe. It operates through Wacoal Business (Domestic), Wacoal Business (Overseas), Peach John Business, and Other Businesses segments. The company offers women's foundation garments, including brassieres and girdles; and lingerie, such as slips, bra-slips, and women's briefs. It also designs, manufactures, and sells nightwear, children's underwear, hosiery, and other apparel and textile goods, as well as provides various other services. In addition, the company engages in the restaurant businesses; cultural and service-related operations; construction of stores and interior design; and production and sale of mannequins. Wacoal Holdings Corp. was founded in 1946 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8530",
        "website": "http://www.wacoalholdings.jp",
        "full_time_employees": 20984
    },
    "WACLY": {
        "short_name": "WACOAL HOLDINGS CORP",
        "long_name": "Wacoal Holdings Corp.",
        "summary": "Wacoal Holdings Corp. engages in the manufacture, wholesale, and retail sale of intimate apparel, outerwear, sportswear, and other textile products and accessories in Japan, Asia, Oceania, the Americas, and Europe. It operates through Wacoal Business (Domestic), Wacoal Business (Overseas), Peach John Business, and Other Businesses segments. The company offers women's foundation garments, including brassieres and girdles; and lingerie, such as slips, bra-slips, and women's briefs. It also designs, manufactures, and sells nightwear, children's underwear, hosiery, and other apparel and textile goods, as well as provides various other services. In addition, the company engages in the restaurant businesses; cultural and service-related operations; construction of stores and interior design; and production and sale of mannequins. Wacoal Holdings Corp. was founded in 1946 and is headquartered in Kyoto, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "601-8530",
        "website": "http://www.wacoalholdings.jp",
        "full_time_employees": 20984
    }
}