{
    "2754.T": {
        "short_name": "TOKATSU HOLDINGS CO LTD",
        "long_name": "Tokatsu Holdings Co., Ltd.",
        "summary": "Tokatsu Holdings Co., Ltd. engages in the sale of automobiles in Japan. The company sells new and used cars. It also provides maintenance services, as well as engages in the life and property insurance agency business. The company was founded in 1969 and is headquartered in Matsudo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Matsudo"
    },
    "3011.T": {
        "short_name": "BANNERS CO LTD",
        "long_name": "Banners Co., Ltd.",
        "summary": "Banners Co., Ltd. engages in the real estate, and automobile and musical instruments sales businesses in Japan. The company creates and rents living-oriented stores and facilities; and sells Honda vehicles and related non-life insurance products. It also imports and sells oboe and bathoons through a specialty store of double reed musical instruments; and provides after-sales services for musical instruments customers. In addition, the company sells various building materials. Banners Co., Ltd. was founded in 1950 and is headquartered in Kumagaya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kumagaya"
    },
    "3184.T": {
        "short_name": "INTERNATIONAL CONGLOMERATE DSB ",
        "long_name": "International Conglomerate of Distribution for Automobile Holdings Co., Ltd.",
        "summary": "International Conglomerate of Distribution for Automobile Holdings Co., Ltd. engages in the automobile sales-related and automobile recycling businesses in Japan and internationally. It is involved in the sale of new and used cars; car rental, inspection, maintenance, and repair activities; and automobile insurance business, including automobile liability and voluntary insurance products. The company was founded in 1967 and is headquartered in Suzuka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Suzuka"
    },
    "3186.T": {
        "short_name": "NEXTAGE CO LTD",
        "long_name": "NEXTAGE Co., Ltd.",
        "summary": "NEXTAGE Co., Ltd. engages in the retail sale of new and used cars in Japan. It also engages in the provision of vehicle maintenance and repair, as well as vehicle safety inspection services; operation of an insurance agency; purchase of used cars; and car exterior coating business. The company was founded in 1998 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "3377.T": {
        "short_name": "BIKE O & CO LTD",
        "long_name": "BIKE O & COMPANY Ltd.",
        "summary": "BIKE O & COMPANY Ltd. distributes and retails used motorcycles in Japan. It manages the purchasing motorcycle-only special shops; and sells purchased motorcycles at auction halls to motorcycle retailers. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3538.T": {
        "short_name": "WILLPLUS HOLDINGS CORPORATION",
        "long_name": "WILLPLUS Holdings Corporation",
        "summary": "WILLPLUS Holdings Corporation imports and sells new and used cars through stores in Japan. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7599.T": {
        "short_name": "IDOM INC",
        "long_name": "IDOM Inc.",
        "summary": "IDOM Inc. purchases and sells used cars in Japan and internationally. The company also sells new cars. It operates through a network of approximately 500 stores under the Gulliver brand. The company was formerly known as Gulliver International Co. Ltd. and changed its name to IDOM Inc. in July 2016. IDOM Inc. was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7602.T": {
        "short_name": "CARCHS HOLDINGS CO.LTD",
        "long_name": "Carchs Holdings Co., Ltd.",
        "summary": "Carchs Holdings Co., Ltd. purchases, sells, and distributes automobiles. It sells used cars through its retail stores, as well as exports through the Internet site, PicknBuy24.com. The company also engages in the wholesale and distribution of spare parts and accessories of automobile through the online shop. In addition, it provides car maintenance services; and property and casualty insurance products, primarily car insurance. The company operates 38 stores in Japan. Carchs Holdings Co., Ltd. was founded in 1987 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7623.T": {
        "short_name": "SUNAUTAS CO LTD",
        "long_name": "Sunautas Co., Ltd.",
        "summary": "Sunautas Co., Ltd. sells automobile and petroleum products in Japan. It also provides maintenance, rent-a-car, and property and casualty insurance agency services. In addition, the company operates gas stations under the ENEOS KYGNUS brand; acts as an automotive dealer for Shonan BMW and Peugeot; and provides various services related to fuel oil, as well as new cars, used cars, service maintenance, and Jeep accessories and parts. The company was formerly known as Asahi Shokai Co., Ltd. and changed its name to Sunautas Co., Ltd. in 1992. Sunautas Co., Ltd. was founded in 1945 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "7680.T": {
        "short_name": "KEIJIDOUSHAKAN CO LTD",
        "long_name": "KEIJIDOUSYAKAN. Co., Ltd.",
        "summary": "KEIJIDOUSYAKAN. Co., Ltd. engages in buying and selling new/used cars. It also sells auto parts, as well as provides car maintenance and insurance agency services. The company was founded in 1998 and is headquartered Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "8291.T": {
        "short_name": "NISSAN TOKYO SALES HLDG",
        "long_name": "Nissan Tokyo Sales Holdings Co., Ltd.",
        "summary": "Nissan Tokyo Sales Holdings Co., Ltd. engages in the automobile dealership business in Japan. It is involved in the Nissan and Renault car sales, maintenance, and parts supplies and sales activities; purchase and sale of used cars; sports car rental business; and vehicle inspection, race management, system solution, vehicle transport, registration agency, and taxi businesses. The company also offers general and life insurance agency services; and plans, develops, and sells campers. In addition, it operates a sports car main portal site. Nissan Tokyo Sales Holdings Co., Ltd. was founded in 1942 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}