{
    "2754.T": {
        "short_name": "TOKATSU HOLDINGS CO LTD",
        "long_name": "Tokatsu Holdings Co.,Ltd.",
        "summary": "Tokatsu Holdings Co.,Ltd. engages in the sale of automobiles in Japan. The company sells new and used cars. It also provides maintenance services, as well as engages in the life and property insurance agency business; and sheet metal painting business. The company was incorporated in 1969 and is based in Matsudo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsudo",
        "zipcode": "270-0013",
        "website": "http://www.tkhd.co.jp",
        "market_cap": 2070792448
    },
    "3011.T": {
        "short_name": "BANNERS CO LTD",
        "long_name": "Banners Co., Ltd.",
        "summary": "Banners Co., Ltd. engages in the real estate, and musical instruments and automobile sales businesses in Japan. The company creates and rents tenants and stores; and sells Honda cars and related non-life insurance products. It also imports and sells oboe and bassoon through a specialty store of double reed musical instruments; and provides maintenance and after-sales services for musical instruments customers. Banners Co., Ltd. was founded in 1950 and is headquartered in Kumagaya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kumagaya",
        "zipcode": "360-0816",
        "website": "http://www.banners.jp",
        "market_cap": 2005687552
    },
    "3184.T": {
        "short_name": "INTERNATIONAL CONGLOMERATE DSB ",
        "long_name": "International Conglomerate of Distribution for Automobile Holdings Co., Ltd.",
        "summary": "International Conglomerate of Distribution for Automobile Holdings Co., Ltd. engages in the automobile sales-related and automobile recycling businesses in Japan and internationally. It is involved in the sale of new and used cars; car rental, inspection, maintenance, and repair activities; and automobile insurance business, including automobile liability and voluntary insurance products. The company was founded in 1967 and is headquartered in Suzuka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Suzuka",
        "zipcode": "513802",
        "website": "http://www.icda.jp",
        "market_cap": 4961992704
    },
    "3186.T": {
        "short_name": "NEXTAGE CO LTD",
        "long_name": "NEXTAGE Co., Ltd.",
        "summary": "NEXTAGE Co., Ltd. engages in the retail sale of new and used cars in Japan. It also engages in the provision of vehicle maintenance and repair, as well as vehicle safety inspection services; operation of an insurance agency; purchase of used cars; and car exterior coating business. The company was founded in 1998 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460 0004",
        "website": "http://www.nextage.jp",
        "market_cap": 125930029056
    },
    "3352.T": {
        "short_name": "BUFFALO CO LTD",
        "long_name": "Buffalo Co.,Ltd.",
        "summary": "Buffalo Co.,Ltd. operates as a franchisee of AUTOBACS stores in Japan. The company sells car accessories, such as tires and car navigation systems. It also purchases and sells new and used cars, as well as provides installation, vehicle inspection, maintenance, and sheet metal services. In addition, the company is involved in the food service business; and operation of roasted meat-like franchisee. It operates 15 AUTOBACS stores and 2 grilled meat-like stores. The company was incorporated in 1983 and is headquartered in Kawaguchi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawaguchi",
        "zipcode": "332-0012",
        "website": "http://www.buffalo.co.jp",
        "market_cap": 2826134528
    },
    "3377.T": {
        "short_name": "BIKE O & CO LTD",
        "long_name": "BIKE O & COMPANY Ltd.",
        "summary": "BIKE O & COMPANY Ltd. distributes and retails used motorcycles in Japan. It manages the purchasing motorcycle-only special shops; and sells purchased motorcycles at auction halls to motorcycle retailers. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0022",
        "website": "http://www.8190.co.jp",
        "market_cap": 9091605504
    },
    "3538.T": {
        "short_name": "WILLPLUS HOLDINGS CORPORATION",
        "long_name": "WILLPLUS Holdings Corporation",
        "summary": "WILLPLUS Holdings Corporation imports and sells new and used cars through stores in Japan. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.willplus.co.jp",
        "market_cap": 11387412480
    },
    "7509.T": {
        "short_name": "I.A.GROUP",
        "long_name": "I.A Group Corporation",
        "summary": "I.A Group Corporation engages in the car accessories business in Japan. The company operates AUTOBACS, a car accessory franchise store; and Techno Cube, a vehicle inspection and sheet metal services store. It also engages in leasing, buying, selling, construction, and property management activities related to real estate, as well as bridal business. I.A Group Corporation was incorporated in 1980 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": null,
        "website": "http://www.ia-group.co.jp",
        "market_cap": 5622258688
    },
    "7599.T": {
        "short_name": "IDOM INC",
        "long_name": "IDOM Inc.",
        "summary": "IDOM Inc. purchases and sells used cars in Japan and internationally. The company also sells new cars. It operates through a network of approximately 500 stores under the Gulliver brand. The company was formerly known as Gulliver International Co. Ltd. and changed its name to IDOM Inc. in July 2016. IDOM Inc. was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-6425",
        "website": "http://www.idom-inc.com",
        "market_cap": 63557632000
    },
    "7602.T": {
        "short_name": "CARCHS HOLDINGS CO.LTD",
        "long_name": "Carchs Holdings Co., Ltd.",
        "summary": "Carchs Holdings Co., Ltd. purchases, sells, and distributes automobiles. It sells used cars through its retail stores, as well as exports through the Internet site, PicknBuy24.com. The company also engages in the wholesale and distribution of spare parts and accessories of automobile through the online shop. In addition, it provides car maintenance services; and property and casualty insurance products, primarily car insurance. The company operates 38 stores in Japan. Carchs Holdings Co., Ltd. was founded in 1987 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8578",
        "website": "http://www.carchs-hd.com",
        "market_cap": 5477974016
    },
    "7623.T": {
        "short_name": "SUNAUTAS CO LTD",
        "long_name": "Sunautas Co., Ltd.",
        "summary": "Sunautas Co., Ltd. sells automobile and petroleum products in Japan. It also provides car maintenance and rental, and non-life insurance agency services. In addition, the company operates gas stations under the ENEOS and KYGNUS brands; acts as an automotive dealer for Jeep and Peugeot; and provides various services related to fuel oil, as well as new cars, used cars, service maintenance, and Jeep and Peugeot accessories and parts. The company was formerly known as Asahi Shokai Co., Ltd. and changed its name to Sunautas Co., Ltd. in 1992. Sunautas Co., Ltd. was founded in 1951 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.sunautas.co.jp",
        "market_cap": 1462896128
    },
    "7676.T": {
        "short_name": "GOODSPEED CO LTD",
        "long_name": "Goodspeed. Co., Ltd.",
        "summary": "Goodspeed Co., Ltd. engages in the sale of used cars, and parts and supplies. It is also involved in the repair and inspection of automobiles; provision of general insurance agency services; and rental of cars. The company was founded in 2002 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "461-0001",
        "website": "http://goodspeed-group.co.jp",
        "market_cap": 6232334336
    },
    "7680.T": {
        "short_name": "KEIJIDOUSHAKAN CO LTD",
        "long_name": "KEIJIDOUSYAKAN. Co., Ltd.",
        "summary": "KEIJIDOUSYAKAN. Co., Ltd. engages in buying and selling new/used cars. It also sells auto parts, as well as provides car maintenance and insurance agency services. The company was founded in 1998 and is headquartered Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "060-0005",
        "website": "http://www.keijidousyakan.com",
        "market_cap": 510400000
    },
    "8291.T": {
        "short_name": "NISSAN TOKYO SALES HLDG",
        "long_name": "Nissan Tokyo Sales Holdings Co., Ltd.",
        "summary": "Nissan Tokyo Sales Holdings Co., Ltd. engages in the automobile dealership business in Japan. It is involved in the Nissan and Renault car sales, maintenance, and parts supplies and sales activities; purchase and sale of used cars; sports car rental business; and vehicle inspection, race management, system solution, vehicle transport, registration agency, and taxi businesses. The company also offers general and life insurance agency services; and plans, develops, and sells campers. In addition, it operates a sports car main portal site. Nissan Tokyo Sales Holdings Co., Ltd. was founded in 1942 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.nissan-tokyo-hd.co.jp",
        "market_cap": 16015390720
    },
    "8298.T": {
        "short_name": "FAMILY INC",
        "long_name": "Family Inc.",
        "summary": "Family Inc. engages in the retail of imported new cars and used cars in Japan. It is also involved in the sale of car supplies and parts; car rental and maintenance, and metal sheet painting activities; and non-life insurance agency, solar power generation, and condominium leasing businesses. The company offers products and services through its network of 30 stores. Family Inc. was founded in 1973 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "260-0041",
        "website": "http://www.cardealerfamily.co.jp",
        "market_cap": 4197530880
    },
    "9268.T": {
        "short_name": "OPTIMUS GP CO LTD",
        "long_name": "Optimus Group Company Limited",
        "summary": "Optimus Group Company Limited engages in the vehicle trading business. Its Trading segment buys used vehicles through auction houses and exports them to local car dealers worldwide. The company's Logistics segment is involved in the transportation of used cars from Japan to overseas. Its Service segment provides auto financing loans; and on-site pre-vehicle inspection maintenance services. The company's Inspection segment provides pre-shipment inspection of used cars, imported vehicles, and domestic vehicle inspections. Optimus Group Company Limited was founded in 2015 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0014",
        "website": "http://www.optimusgroup.co.jp",
        "market_cap": 4830581760
    },
    "USV.F": {
        "short_name": "USS CO. LTD",
        "long_name": "USS Co., Ltd.",
        "summary": "USS Co., Ltd., together with its subsidiaries, operates and manages used vehicle auction sites in Japan. It distributes used vehicles through the operation of on-site auctions at 19 locations, as well as through satellite and Internet auctions. The company also provides motor lorry transport, financial, and used car export services; recycles end-of-life automobiles and other goods; and purchases and sells used and accident-damaged vehicles. In addition, it operates a used car purchasing chain under the Rabbit name. The company was formerly known as Aichi Automobile General Services Co., Ltd. and changed its name to USS Co., Ltd. in March 1995. USS Co., Ltd. was incorporated in 1969 and is headquartered in Tokai, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokai",
        "zipcode": "476-0005",
        "website": "http://www.ussnet.co.jp",
        "market_cap": 3500640000
    }
}