{
    "11T.F": {
        "short_name": "TOYODA GOSEI CO.LTD",
        "long_name": "Toyoda Gosei Co., Ltd.",
        "summary": "Toyoda Gosei Co., Ltd. manufactures and markets automobile parts, optoelectronic products, and other general industry products. It offers weatherstrips products, such as opening trim weatherstrips, door glass runs, door and outer weatherstrips, and luggage weatherstrips; functional components comprising fuel tank module components, power train parts, and chassis and drive train parts; interior and exterior parts; and safety system products, such as airbags, steering wheels, and other products. The company also provides solar LEDs and deep ultraviolet light source modules; and general industry products, such as air conditioning products, home construction components, construction and industrial machinery parts, and LED dynamo lights. It has operations in Japan, the Americas, Europe and Africa, and Asia. Toyoda Gosei Co., Ltd. was founded in 1949 and is headquartered in Kiyosu, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kiyosu",
        "zipcode": "452-8564",
        "website": "http://www.toyoda-gosei.com",
        "full_time_employees": null
    },
    "2YO.F": {
        "short_name": "PRESS KOGYO CO. LTD",
        "long_name": "Press Kogyo Co., Ltd.",
        "summary": "Press Kogyo Co., Ltd. engages in the manufacture and sale of automotive and construction machinery parts in Japan and internationally. It offers chassis frames, axles, cabins for construction machinery, and other automotive products, including front bumper, axle shafts, ABS sensor rings, instrument panels, cowl top panels, door beams, ladder frames, rear under-run protectors for medium duty trucks, and front under-run protectors for heavy duty trucks. The company also provides plastic parts, such as cab rear covers, side covers, transmission covers, under covers, air cleaner brackets, urea water tank brackets, battery trays, front tire splashes, and rear steps; dies and automatic welders; automated parking systems and parking palette; specially equipped vehicles; and torch cleaners. Press Kogyo Co., Ltd. was founded in 1925 and is headquartered in Kawasaki, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "210-8512",
        "website": "http://www.presskogyo.co.jp",
        "full_time_employees": 6658
    },
    "3116.T": {
        "short_name": "TOYOTA BOSHOKU CORP",
        "long_name": "Toyota Boshoku Corporation",
        "summary": "Toyota Boshoku Corporation manufactures and sells automotive interior systems and products, automotive filter and power train equipment components, automotive components, and fabric goods in Japan. The company offers seats, door trims, and leather instrument panels; headliners, such as ceiling-mounted rear entertainment systems and panorama roofs; headliner and instrument panel mystic illumination, and illuminated twin consoles; and floor carpets, tonneau covers, package trays, electric sunshade systems, and silencers. It also offers textile components comprising seat fabrics, curtain-shield airbags, seatbelt webbings, and partition nets; and exterior components consisting of bumpers, fender liners, and engine undercovers. In addition, the company provides filter products, including air and oil filters; anti-allergen and deodorizing cabin, pollen removal cabin, anti-bacterial and mould resistant cabin, and clean air filters; and hydrocarbon absorption filters. Further, it offers air induction part products, such as air induction systems and cleaners, intake manifolds, and cylinder head covers; fuel cell part products comprising stack manifolds and separators; and motor core components for hybrid systems, fluid filters for automatic transmission, oil mist separators, revolving sensors, ignition coils for motorcycles, and ABS coils. Additionally, the company provides aircraft and railway seats, as well as fabric wall decorations for home interior applications. Toyota Boshoku Corporation was founded in 1918 and is based in Kariya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": null,
        "website": "http://www.toyota-boshoku.com/jp",
        "full_time_employees": null
    },
    "3422.T": {
        "short_name": "MARUJUN CO LTD",
        "long_name": "MARUJUN Co., Ltd.",
        "summary": "MARUJUN Co., Ltd. manufactures and sells automobile body and precision press parts in Japan and internationally. It offers auto body press parts, including auto body frameworks, such as front pillar inner lower and upper, side sill, roof side, rear and middle floor cross member, and center pillar inner products; safety reinforcing parts comprising front and rear bumpers; batteries and PCU covering parts for hybrid cars; and functional parts, including hood hinges, steering hunger beams, tailgate hinges, hood locks, fuel filler pipes, and hand brakes. The company also provides precision parts consisting of clutch drums and hubs, clutch pistons, planetary carriers, belt pulleys, and holder stators; and dies, such as hood outer draw type, center pillar inner trim type, front pillar lower stiffener scudding type, and precision/thickening dies. In addition, it offers jigs/QC inspection fixtures, including front door inner single inspection fixtures, front pillar comp inspection fixtures, front door inner comp inspection fixtures, and side sill comp jigs. MARUJUN Co., Ltd. was founded in 1952 and is headquartered in Ogaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ogaki",
        "zipcode": "503-1601",
        "website": "http://www.marujun.co.jp",
        "full_time_employees": null
    },
    "3434.T": {
        "short_name": "ALPHA CORP",
        "long_name": "ALPHA Corporation",
        "summary": "ALPHA Corporation develops, manufactures, supplies, and sells lock and key products for automobile parts, housing hardware products, and coin operated lockers in Japan and internationally. The company operates in two segments, Automobile Parts Business and Security Equipment Business. It offers automobile parts, such as keys, locks, door handles, back door sensors, motorcycle bar locks, and molding bumpers; housing locks/industrial locks, including housing electronic and mechanical locks, delivery boxes, padlocks, and industrial locks for automatic vending machines, ATMs, and game machines; and locker systems. The company was formerly known as Kokusan Kinzoku Kogyo Co., Ltd. and changed its name to ALPHA Corporation in December 1990. ALPHA Corporation was founded in 1923 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "236-0004",
        "website": "http://www.kk-alpha.com",
        "full_time_employees": 4516
    },
    "3439.T": {
        "short_name": "MITSUCHI CORPORATION",
        "long_name": "Mitsuchi Corporation",
        "summary": "Mitsuchi Corporation manufactures, delivers, and sells fasteners for automobiles in Japan. The company offers cold-forged products, including deformation, gear processing, hole machining, gear processing, hole and gear processing, and forming and forgings. It also provides assembly products for window regulators and rear-door locks; and quick nuts and nutters, and quick joints. The company was formerly known as Mitsuchi Byora Co., Ltd. and changed its name to Mitsuchi Corporation in February 1975. Mitsuchi Corporation was founded in 1963 and is headquartered in Kasugai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kasugai",
        "zipcode": "486-0901",
        "website": "http://www.mitsuchi.co.jp",
        "full_time_employees": 490
    },
    "3526.T": {
        "short_name": "ASHIMORI INDUSTRY CO",
        "long_name": "Ashimori Industry Co., Ltd.",
        "summary": "Ashimori Industry Co., Ltd. manufactures and sells automotive safety systems in Japan and internationally. The company offers automotive seat belts, air bags, steering wheels, tonneau covers, electric sunshades, manual shades, and separation nets. It also provides disaster prevention materials and equipment; fire hoses; fire hydrant hoses; and hoses for golf course, water sprinkling and irrigation, and marine and irrigation use. In addition, the company offers industrial materials, including ropes and cords; wide-woven textiles and silica screens; tapes and belts; safety harnesses, carrier cable ropes, and other fall-prevention equipment for use at construction sites; and trucking and logistics related products, such as air roll systems, light slider labor-saving loading/unloading equipment, NA tightener load-securing clamps for trucks, and cal-pane thermal barrier partition panels for trucks, as well as construction materials. Further, it provides pipeline automatic lining systems for rehabilitating gas, potable water, sewage, agricultural water, telecommunications signal, and electricity pipelines. The company was formerly known as Ashimori Rope Works and changed its name to Ashimori Industry Co., Ltd. in 1944. Ashimori Industry Co., Ltd. was founded in 1878 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "566-0001",
        "website": "http://www.ashimori.co.jp",
        "full_time_employees": 2871
    },
    "4222.T": {
        "short_name": "KODAMA CHEMICAL INDUSTRY CO",
        "long_name": "Kodama Chemical Industry Co.,Ltd.",
        "summary": "Kodama Chemical Industry Co.,Ltd. manufactures and sells plastic products in Japan and internationally. The company offers automobile interior and exterior parts, such as pillars and trims, trunk rooms, doors, bumpers, package trays to automobile manufacturers, as well as DVD and Blu-ray cases. It also provides resin products used around water, such as vanity mirrors, kitchens, toilets, and baths, as well as Celeblight, a mirror. The company was formerly known as Kodama Metal Industry Co., Ltd. and changed its name to Kodama Chemical Industry Co.,Ltd. in 1955. Kodama Chemical Industry Co.,Ltd. was founded in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0041",
        "website": "http://www.kodama-chemical.co.jp",
        "full_time_employees": 842
    },
    "4246.T": {
        "short_name": "DAIKYONISHIKAWA CORPORATION",
        "long_name": "DaikyoNishikawa Corporation",
        "summary": "DaikyoNishikawa Corporation develops, manufactures, and sells automotive and plastic parts in Japan. The company offers bumpers that include radiator grilles and side step moldings; rear spoilers; lift gate modules; license garnishes, such as roof racks, fenders, and roof and hood products; instrument panels; center modules; decoration panels that include console boxes, indicator panels, and gear shift knobs; door trims, such as trunk side trims and boards; door modules; and assist grips comprising pillar trims. It also provides automotive engine parts comprising piping systems; shroud panels comprising cylinder head covers and PS tanks; oil strainers; intake manifolds, such as engine covers. In addition, the company offers plastic housing products, which include bath units and bathtub pans; kitchen counters, BMC artificial marbles, and washstand counters; and gas pipes, eaves troughs, iron-core stair mats, garden storage chests, and dust boxes. Further, it is involved in holding, leasing, and managing premises and equipment; collecting, transporting, and disposing industrial waste; and non-life insurance agency and life insurance soliciting business. DaikyoNishikawa Corporation was founded in 1953 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": "739-0049",
        "website": "http://www.daikyonishikawa.co.jp",
        "full_time_employees": 5432
    },
    "5101.T": {
        "short_name": "YOKOHAMA RUBBER CO",
        "long_name": "The Yokohama Rubber Company, Limited",
        "summary": "The Yokohama Rubber Company, Limited manufactures and sells tires, industrial products, and golf products in Japan, the United States, India, China, the Philippines, and internationally. It operates through Tires, Multiple Business (MB), and Alliance Tire Group (ATG) segments. The Tires segment offers tires for passenger cars and light trucks; trucks and buses; construction and mining equipment; and motor sports, as well as tire tubes, aluminium alloy wheels, and other peripheral products. The MB segment provides high-pressure hoses, conveyor belts, marine hoses and pneumatic marine fenders, and antiseismic products and roadway joints. It also provides sealants and adhesives, aircraft fixtures, and components under the Hamatite brand. The ATG segment provides tires for agricultural, industrial, construction, and forestry machinery. The company also markets golf equipment and services under the PRGR brand. It sells its products primarily under the ADVAN, BluEarth, iceGUARD, GEOLANDAR, and YOKOHAMA brand names. The Yokohama Rubber Company, Limited was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8685",
        "website": "http://www.y-yokohama.com",
        "full_time_employees": 27252
    },
    "5104.T": {
        "short_name": "NITTO KAKO CO",
        "long_name": "Nitto Kako Co.,Ltd.",
        "summary": "Nitto Kako Co.,Ltd. manufactures and sells industrial rubber and resin products in Japan. The company provides rubber sheets for various applications, such as automobiles, chemicals, civil engineering construction, packing, cushioning materials, rugs, etc.; construction, civil engineering, and landscape materials, which are used in the areas of permeability, cushioning, cushioning materials, curing, vibration protection, anti- slip, turf protection, etc.; and functional rubber mats, such as icebreaker anti-slip, frozen road surface correspondence, oil removal, etc. It also offers powdered rubber products, an environmentally friendly product based on rubber powder recycled from tires; orbit related products to JR companies and other non-railway companies; rubber compounds to rubber molding manufacturers; and resin products, including cleaning and foaming agents, and antistatic resin products. The company was formerly known as Nitto Tire Co., Ltd. and changed its name to Nitto Kako Co.,Ltd. in April 1982. Nitto Kako Co.,Ltd. was founded in 1949 and is based in Samukawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Samukawa",
        "zipcode": "253-0111",
        "website": "http://www.nitto-kk.co.jp",
        "full_time_employees": 230
    },
    "5108.T": {
        "short_name": "BRIDGESTONE CORP",
        "long_name": "Bridgestone Corporation",
        "summary": "Bridgestone Corporation, together with its subsidiaries, manufactures and sells tires and rubber products. It operates through two segments, Tires and Diversified Products. The company offers tires and tire tubes for passenger cars, trucks, buses, construction and mining vehicles, industrial machinery, agricultural machinery, aircraft, motorcycles, scooters, etc.; automotive parts; retreading materials and services; automotive maintenance and repair services; tire raw materials; and other tire-related products. It also provides vehicle parts, polyurethane foam and related products, electronic precision parts, industrial materials-related products, civil engineering and construction materials and equipment, and others; commercial roofing materials and other materials; golf balls, golf clubs, and other sporting goods; bicycles, bicycle-related goods, and others, as well as finance and other services. In addition, the company offers maintenance, IT/sensing technology, and other solutions for the mining, fleet, and agricultural sectors. It has operations in Japan, the United States, China, the Asia Pacific, Europe, Russia, the Middle East, Africa, Oceania, and internationally. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8340",
        "website": "http://www.bridgestone.co.jp",
        "full_time_employees": 138036
    },
    "5121.T": {
        "short_name": "FUJIKURA COMPOSITES INC",
        "long_name": "FUJIKURA COMPOSITES Inc.",
        "summary": "FUJIKURA COMPOSITES Inc. engages in the production and sale of industrial rubber components in Japan. It also manufactures and sells industrial materials, including pneumatic controllers, anti-vibration mounts, and peripherals; printing materials; electrical and electronic equipment; rescue and life-saving equipment; and carbon shafts for golf clubs. In addition, the company offers gas/water residential equipment to control and regulate the gas and water; and rubber packings, sealing materials, admixtures, etc. for connection and branching of communication cables. Further, it provides fire prevention sheets; rubber blankets for various offset printing, such as books, magazines, newspapers, packages, metal deco, drink cans, plastic cups, and others; and audio cone material. FUJIKURA COMPOSITES Inc. sells its offset printing blanket under the Fujikura Graphics brand name. The company was formerly known as Fujikura Rubber Ltd. and changed its name to FUJIKURA COMPOSITES Inc. in April 2019. FUJIKURA COMPOSITES Inc. was founded in 1901 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "135-0063",
        "website": "http://www.fujikuracomposites.jp",
        "full_time_employees": 2550
    },
    "5161.T": {
        "short_name": "NISHIKAWA RUBBER CO",
        "long_name": "Nishikawa Rubber Co., Ltd.",
        "summary": "Nishikawa Rubber Co., Ltd. manufactures and sells rubber and sealing products primarily for automotive applications in Japan and internationally. It offers automotive-related products, such as insulators for electrical parts; hood, lamp, waist, and door hole seals; sunroof, trunklid, roofside, door mounted, drip, body mounted, convertible header, and convertible roofside weatherstrips; and glass run channels. The company also provides housing-related products, including joint gaskets, backup seals, door seals, and other seals for water-proofing, fire-protection, dust-proofing, noise insulation, barrier-free, energy-saving applications, etc.; and civil engineering-related products, including AN joint I, AN joint III, Excel joints, and ANB flexible joints for sewage works and water-swelling sponge applications. Nishikawa Rubber Co., Ltd. was founded in 1934 and is headquartered in Hiroshima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hiroshima",
        "zipcode": "733-8510",
        "website": "http://www.nishikawa-rbr.co.jp",
        "full_time_employees": 6696
    },
    "5184.T": {
        "short_name": "NICHIRIN CO LTD",
        "long_name": "Nichirin Co., Ltd.",
        "summary": "Nichirin Co., Ltd. manufactures and sells automotive and housing hoses, and related parts worldwide. The company offers brake, air conditioning, and power steering hoses; and automatic transmission fluid, air brake, clutch, ESC, CNG, oil cooler, suspension, urea SCR, hydraulic, and vacuum brake hoses, as well as EF-TUBE and oil cooler units for automotive applications. It also provides brake, clutch, fuel, and oil cushion and cooler hoses for motorcycle applications; and mixing faucet and toilet hoses for residential use. The company was formerly known as Nichirin Rubber Industrial Co.,Ltd. and changed its name to Nichirin Co., Ltd. in July 1991. Nichirin Co., Ltd. was founded in 1914 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kobe",
        "zipcode": "650-0033",
        "website": "http://www.nichirin.co.jp",
        "full_time_employees": 2345
    },
    "5185.T": {
        "short_name": "FUKOKU CO LTD",
        "long_name": "Fukoku Co.,Ltd.",
        "summary": "Fukoku Co.,Ltd. produces and sells rubber and resin products in Japan and internationally. The company offers wiper blade rubbers that are used in automobiles, trains, ships, and aircrafts; and seal products, including brake booster diaphragms, radiator gaskets, duty valves, piston seals, and constant velocity joints, which are used in automotive brake systems and fuel systems, as well as air intake and exhaust systems, and pneumatic tools and industrial machinery. It also provides anti-vibration products comprising suspension parts, torsional vibration dampers, couplings, engine mounts, cabin mounts, shock absorbers and ballast mats, and other parts functioning to reduce vibrations and noise in construction, civil engineering, and industrial machinery industries, as well as anti-vibration products for rail cars and rail roads. In addition, the company provides ultrasonic motors, such as motors with encoders, vacuum-type motors, hollow-type motors, non-magnetic motors, and ring-type motors that are used for driving the autofocus mechanism in SLR cameras, the headrests in luxury cars, and stages of semiconductor equipment. Further, it offers bio related parts, such as medical infusion bags consisting of culture bags, cell rinsing bags, and adaptors for centrifuge. The company was formerly known as Fukoku Rubber Industry Co., Ltd. and changed its name to Fukoku Co.,Ltd. in January 1986. Fukoku Co.,Ltd. was founded in 1953 and is headquartered in Ageo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ageo",
        "zipcode": "362-8561",
        "website": "http://www.fukoku-rubber.co.jp",
        "full_time_employees": 5079
    },
    "5189.T": {
        "short_name": "SAKURA RUBBER CO",
        "long_name": "Sakura Rubber Co., Ltd.",
        "summary": "Sakura Rubber Co., Ltd. manufactures and sells specialty rubber products. The company offers firefighting products, including fire hoses, firefighting suction hoses, toxic substances measuring instruments, firefighting training and rescue apparatus, air respirators, emergency lifesaving tools, powered impact tools, air lifting bags, community disaster prevention apparatus, couplings for large diameter hoses, MVU fans and blowers, and rescue support systems, as well as mountain, hydraulic, and water rescue tools. It also provides aerospace products, such as various fittings; PTFE, rubber, lightweight rubber and PTFE, oxygen suction, and duct hoses; extruded, sheet, and molded goods; and inflatable seals, insulation products, bending tubes, and quick disconnectors. In addition, the company offers industrial rubber products comprising tank vapor seals; oil-resistant hoses for petrochemical plants; suction delivery hoses; tank lorry hoses; gate seals; joints; rubber sheets; pressed products; molded rubber; and insulation and hydraulic hoses, as well as couplings for the general industry. Further, it engages in the real estate business. The company was founded in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-8587",
        "website": "http://www.sakura-rubber.co.jp",
        "full_time_employees": 360
    },
    "5191.T": {
        "short_name": "SUMITOMO RIKO CO LTD",
        "long_name": "Sumitomo Riko Company Limited",
        "summary": "Sumitomo Riko Company Limited manufactures and sells automotive parts. It provides automotive products, including anti-vibration rubber products, such as heat-resistant rubber products, chassis parts, lightweight parts, active control parts, and dampers; hoses, including rubber and resin fuel, air control, water, oil, canisters, hydrogen, and air conditioner hoses; sound controlling and insulation products comprising standing wave spacers and engine cover products; heat conducting and sound reducing materials, including magnetic induction foaming; and interior equipment consisting of head rests and arm rests. The company also offers seal products, consisting of connector and wire seals; cell gaskets for fuel cell vehicles; and electronic products, including charging and developer rolls, cleaning blades, intermediate transfer belts, sponge and paper feeder rollers, water-developable flexographic printing plates. In addition, it provides hydraulic hoses used in heavy construction equipment and forklifts; industrial hoses for construction and civil engineering industry; anti-vibration rubber for rolling stocks; disc rubber bearings and seismic isolation rubber bearings used in bridges, highways, and railways; and landscape materials. Further, the company offers housing environment products, such as seismic control systems for wooden houses and buildings, dampers for traffic vibration mitigation, heavy floor impact noise countering dampers, window films against heat, and concrete molds used in construction and building; and health and nursing products, including body pressure sensors, training and evaluation systems for chest compression, and active mattress, as well as micro-fluid chips. The company was formerly known as Tokai Rubber Industries, Ltd. and changed its name to Sumitomo Riko Company Limited in October 2014. The company was founded in 1929 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-6316",
        "website": "http://www.sumitomoriko.co.jp",
        "full_time_employees": 26109
    },
    "5202.T": {
        "short_name": "NIPPON SHEET GLASS CO",
        "long_name": "Nippon Sheet Glass Company, Limited",
        "summary": "Nippon Sheet Glass Company, Limited manufactures and sells glass and glazing products worldwide. It operates through Architectural, Automotive, Technical Glass, and Other segments. The company offers architectural products, including solar control, thermal insulation, fire protection, noise control, safety/security, self-cleaning, decoration, solar energy, and antimicrobial glasses; glass systems; and coated or non-coated glasses the Pilkington brand. It also provides automotive products, such as automotive glass products for vehicle original equipment manufacturers; aftermarket glass replacement products; and glass solutions for specialized vehicles, which include commercial, off-road, bus and coach, marine, and rail. In addition, the company offers functional products under the MICROGLAS, Flake, Metashine, GLASFLAKE, and SILKYFLAKE names; absorbent glass mat (AGM) separator, a component for valve regulated lead-acid batteries; polyethylene (PE) separator, which allows the battery assembly line to run efficiently; and sleeve tubes, which are used as the separators for positive plate of clad type lead-acid batteries. Further, it provides SELFOC lens arrays and micro lenses; SELGUIDE, a linear LED light source for image scanning; sheet glasses for electronic office devices; and ultra-fine flat glasses. The company was formerly known as America Japan Sheet Glass Co., Ltd. and changed its name to Nippon Sheet Glass Company, Limited in 1931. Nippon Sheet Glass Company, Limited was incorporated in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6321",
        "website": "http://www.nsg.com",
        "full_time_employees": null
    },
    "5334.T": {
        "short_name": "NGK SPARK PLUG CO",
        "long_name": "NGK Spark Plug Co., Ltd.",
        "summary": "NGK Spark Plug Co., Ltd., together with its subsidiaries, manufactures and sells spark plugs and related products for internal-combustion engines; and technical ceramics and applicable products in Japan. The company offers spark plugs, including plugs for aftermarket and original equipment, igniter plugs, and resister cables and covers; glow plugs comprising ceramic and metal type glow plugs, and glow controllers; and oxygen, NOx, temperature, and knock sensors. It also provides semiconductor components, such as IC packages for electronics and smart devices, as well as manufacturing parts for semiconductors; and medical products. In addition, the company offers fine ceramics, including wear-resistant parts, ultrasonic transducers and sensors, products for semiconductor manufacturing equipment, electric equipment products, and other ceramic products. Further, it provides cutting tools comprising ceramic, cermet, micro grain carbide, coated carbide, and cubic boron nitride grades, as well as SS and rotational tools. The company sells its spark and glow plugs under NGK brand; and sensors, semiconductor packages/substrates, cutting tools, and fine ceramics under NTK brand. NGK Spark Plug Co., Ltd. was founded in 1936 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "467-8525",
        "website": "http://www.ngkntk.co.jp/english",
        "full_time_employees": null
    },
    "5949.T": {
        "short_name": "UNIPRES CORP",
        "long_name": "Unipres Corporation",
        "summary": "Unipres Corporation manufactures and sells automotive parts in Japan, the Americas, Europe, and Asia. The company provides car body parts, such as front side members, front pillars, side sills, center pillars, rear side members, side roof rails, filler tubes, steering members, fuel tank parts, and parts that support collision and handling safety of automobiles. It also offers precision press technology products, including torque converters, clutch packs, clutch drums, driven plate/retaining plates, oil pans, piston plungers, carrier packs, carrier plate/bases, and end plates. In addition, the company provides plastic press technology products comprising front under covers, front fender protectors, floor under covers, and trunk trims. Further, it engages in the manufacture and sale of electric machinery parts; metal products; and welders, dies, jigs, and tools, as well as inspection and maintenance of press machinery. Unipres Corporation was founded in 1945 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-0033",
        "website": "http://www.unipres.co.jp",
        "full_time_employees": null
    },
    "5975.T": {
        "short_name": "TOPRE CORPORATION",
        "long_name": "Topre Corporation",
        "summary": "Topre Corporation manufactures and sells components and products for automobiles, temperature-controlled logistics, air-conditioning systems, and electronic equipment in Japan, the United States, China, Mexico, and Thailand. The company offers metal press forming products and high-tensile steel plates for automobiles and office automation equipment; and constant temperature logistics products for light vehicles and heavy vehicles, as well as compact, 2t, 3t, and 4t trucks. It also provides air-conditioning equipment comprising fans, home ventilation systems, and ductless ventilation systems for use in office buildings, factories, hospitals, and houses; and electronic equipment, including keyboards, PIN pads, touch monitors, touch panels, and embedded computers. The company was formerly known as Tokyo Press Kogyo Co., Ltd. and changed its name to Topre Corporation in October 1985. Topre Corporation was founded in 1935 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.topre.co.jp",
        "full_time_employees": null
    },
    "5985.T": {
        "short_name": "SUNCALL CORP",
        "long_name": "Suncall Corporation",
        "summary": "Suncall Corporation manufactures and distributes automotive parts and materials, hard disk-related parts, and printer and communication-related products in Japan, the United States, China, the Philippines, and internationally. The company offers precision shaped wires and steel wires for valve springs; and automotive products, including valve springs, transmission springs, detent springs, drive plates, press parts, shaped rings, spiral springs for variable valves and seat belts, sensor rings, boot clamps, shunt on bus bars, small springs, motor/stator cores, ring gears, heat-resistant springs, inspection pins for wire harnesses, reactor coils, wave rings/wave springs, bus bars, ECU control parts, valve cotters, accordion springs, tension reducers, and bus rings. It also provides hard disk drive suspensions, such as highly shock-resistant suspensions and DSA suspensions for HDD; and printer-related products comprising tube shafts, carriage guide shafts, shafts for business machines, small springs, press parts, torque limiters, resin-coated tube shafts, clutches for business machines, and screw conveyors. In addition, the company offers connectors and adapters for optical communications; bamboo charcoal for environmental related issues; and measuring instruments-related/other products, such as inspection pins for wire harnesses, cams, probes, and unit assemblies for inspections. The company was formerly known as Sanko Senzai Kogyo Co., Ltd. and changed its name to Suncall Corporation in April 1991. Suncall Corporation was founded in 1943 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "615-8555",
        "website": "http://www.suncall.co.jp",
        "full_time_employees": 2453
    },
    "5988.T": {
        "short_name": "PIOLAX INC",
        "long_name": "PIOLAX, Inc.",
        "summary": "PIOLAX, Inc. designs, develops, produces, and sells various parts and products for automotive, medical, and consumer and security industries. It offers valves and fuel parts for filling, storing, and providing petrol; connectors for piping used around radiators; compact filters for fuel and oil systems; and evapo-tube ASSY products. The company also provides powertrain parts, which include various springs that are used for transmissions, as well as snap rings used for holding parts; open-close parts, including air dampers and locks for glove boxes; resin and metal fasteners for fixing automobile interior/exterior parts and connecting pipes to car body; and harnesses for bundling electric wires. In addition, it offers precision parts comprising retainers and tension springs to hold wheel caps, etc.; injection-molded parts for automotive interior/exterior; and visor-related parts and luggage board handles, as well as plate clamps and screw clamps. Further, the company provides medical appliances, such as spiral catheters and stents; and consumer and security products, including springs for combination faucets, and security parts to seal moneybags or container vehicles, as well as hot water blocking valves and headphone wire bands. It operates in Japan, rest of Asia, the United States, Europe, and internationally. The company was formerly known as Kato Hatsujo Inc. and changed its name to PIOLAX, Inc. in October 1995. PIOLAX, Inc. was founded in 1933 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "240-0023",
        "website": "http://www.piolax.co.jp",
        "full_time_employees": null
    },
    "5991.T": {
        "short_name": "NHK SPRING CO LTD",
        "long_name": "NHK Spring Co., Ltd.",
        "summary": "NHK Spring Co., Ltd. provides automobile, data communications, and industry and lifestyle products in Japan and internationally. The company operates through four segments: Automotive Suspension Springs; Automotive Seating; Precision Springs and Components; and Industrial Machinery and Equipment, and Others. Its automobile products include automotive suspension springs, such as coil springs, stabilizers/torsion bars, stabilinkers, and leaf springs; and power train products, and braking and exhaust systems, including valve springs, thin leaf springs for disk brakes, and clutch diaphragms/waved springs/arc springs. The company's automobile products also consist of sporty automotive seats, air suspension seats, axis locks for arm rest, power automotive seats, seals/sheets, screws and bolts, and control cables; motorcycle related chain tensioners; electric related products; thin leaf springs and precision stamped products; and motor cores and integrated metal substrates. Its data communication products comprise HDD-related products, such as suspensions, top covers, disk clamps, dual stage and co-located actuator suspensions, and VCM yokes; data communications and semiconductor device related products, including test sockets, full wafer probe cards, wire springs/precision machine items, lock hinges, and semiconductor process components; electric related products; microcontactor solutions, such as full wafer probe cards, probe cards for wafer and package TAB scans, test sockets, and probe units for flat panel displays and package substrates; and ultra-precision machining technologies. The company's industry and life style products include plant, spring mechanism, chemical, multi-story parking system, anti-counterfeiting, electronic components department, railway, maritime, and sports related products, and products related to various tests and design services. NHK Spring Co., Ltd. was incorporated in 1936 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "236-0004",
        "website": "http://www.nhkspg.co.jp",
        "full_time_employees": null
    },
    "5992.T": {
        "short_name": "CHUO SPRING CO",
        "long_name": "Chuo Spring Co.,Ltd.",
        "summary": "Chuo Spring Co.,Ltd. manufactures and sells springs and control cables in Japan, the United States, Taiwan, Indonesia, Thailand, and China. It offers automotive products, such as chassis springs, including coil and leaf springs, and stabilizer and torsion bars; and precision springs comprising valve/arc/brake tension/torsion/springs, flat springs, formed wire clamps/spiral springs, HV belleville springs, and CVT springs. The company also provides control cables consisting of parking brake, transmission, hood/fuel lid/trunk release, power slide door/door lock/lock release, and emergency parking brake release cables. In addition, it offers CABLEX products, which include smoke ejection/ventilation systems, top-light with smoke ejection and ventilation systems, push/pull cables, and wheelchair fixtures; electric vehicle charging cable reels; and customized springs. Chuo Spring Co.,Ltd. was founded in 1925 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "458-8505",
        "website": "http://www.chkk.co.jp",
        "full_time_employees": null
    },
    "6042.T": {
        "short_name": "NIKKI CO LTD",
        "long_name": "Nikki Co., Ltd.",
        "summary": "Nikki Co., Ltd. designs, develops, manufactures, and sells carburetors and fuel equipment in Japan and internationally. The company offers gas-fueled automobile components, including fuel rail assemblies, injectors, vaporizers, regulators, and fuel filters; automobile components, such as actuators and power valves; and electronic control equipment comprising electronic control units and sensors. It also provides industrial engine components and gaseous fueled general purpose engine components consisting of throttle body for general purpose engines, general purpose carburetors, GHP-mixers, and GHP-Zero governors. In addition, the company offers conversion kit that is used for converting CNG or LPG fuel supply system from gasoline engine. The company was formerly known as Nippon Carburetor Co., Ltd. and changed its name to Nikki Co., Ltd. in 2001. Nikki Co., Ltd. was founded in 1932 and is headquartered in Atsugi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Atsugi",
        "zipcode": "243-0801",
        "website": "http://www.nikkinet.co.jp",
        "full_time_employees": null
    },
    "6461.T": {
        "short_name": "NIPPON PISTON RING CO",
        "long_name": "Nippon Piston Ring Co., Ltd.",
        "summary": "Nippon Piston Ring Co., Ltd. produces and sells automobile engine parts, marine engine parts, and other products in Japan and internationally. The company offers automobile products, including piston rings for gasoline, diesel, motorcycle, and rotary engines; cylinder liners; valve seat inserts; composite and alloy cast iron camshafts; valve rocker arms, valve lifters/valve guide/rocker bridges; and aluminum reinforced composite, fuel injector parts, and synchronizer rings. It also provides marine and industrial piston rings; sealing rings for torque converters, turbochargers, hydraulic equipment, refrigerators, and engine for miniature models; and compressor parts for air conditioners and refrigerators. In addition, the company offers metal injection molding parts; and medical equipment parts, such as dental implants. Nippon Piston Ring Co., Ltd. was founded in 1931 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": "338-8503",
        "website": "http://www.npr.co.jp",
        "full_time_employees": null
    },
    "6462.T": {
        "short_name": "RIKEN CORP",
        "long_name": "Riken Corporation",
        "summary": "Riken Corporation manufactures and sells automotive and machinery parts in Japan and internationally. It offers piston rings; engine parts, such as camshafts, pistons, valve seats, valve lifters, valve spring retainers, tappets and rocker arms, crankshafts, and others; transmission parts, including seal rings, differential cases, pinion shafts, and others; drive and chassis parts comprising steering knuckles, damper forks, brake calipers, pressure plates, lower arms, and others; and vanes for air compressors and power steering systems, shoes and shoe discs for air conditioning systems, sliders for power steering systems, and others. The company also produces marine and industrial components and parts consisting of a range of parts for engines of various types, sizes, and applications, including aircraft, agricultural machinery, construction equipment, and industrial components, as well as large size piston rings for marine engine applications; other components for use in construction equipment and agricultural machinery; and compressor parts comprising vanes, housings, and cylinders. In addition, it provides piping products; aerospace industrial equipment parts; thermal engineering products consisting of furnaces, such as hydrogen gas heating furnaces, magnetic field heat treatment furnaces, vacuum furnaces, continuous ceramic sintering furnaces, general-purpose heat treatment furnaces, and others; and electromagnetic compatibility products, such as radio frequency anechoic chambers and shield rooms. The company serves automotive, truck, and other vehicle manufacturers. Riken Corporation was founded in 1927 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8202",
        "website": "http://www.riken.co.jp",
        "full_time_employees": 4491
    },
    "6463.T": {
        "short_name": "TPR CO LTD",
        "long_name": "TPR Co., Ltd.",
        "summary": "TPR Co., Ltd. engages in the research and development, manufacture, and marketing of functional engine components worldwide. It offers automobile related parts that include powertrain parts, such as piston rings, cylinder liners, valve seats and guides, seal rings, and carbon scraper rings; interior resin parts comprising interior panel parts, resin painting parts, and door parts; exterior resin parts consisting of radiator grille and millimeter wave radar covers; moldings and roof rails; and textiles, such as floor mats. The company's automobile related parts also comprise aluminum wheels and engine components; suspension parts; shock absorber parts, including bearings and base valve cases; automotive aluminum brake drums; and electrical and electronic components, such as radiator grilles with illumination and telematics communication units. In addition, it provides automotive machinery parts, including inspection and maintenance equipment, automobile production equipment, and power systems; drying equipment, such as infrared radiation, facilities, and air conditioning equipment; temperature control valves; special copper alloys for welding; and O shape rings, various seal rings, reston sponges, and anti-vibration pads, as well as carbon black masterbatch products. Further, the company offers home equipment, such as resin bamboos, handrails, and bamboo fences, as well as feet warming heaters and heaters for washlet toilet seats. Additionally, it provides life support services consisting of house and factory construction, nursing home, insurance, and industrial waste processing services, as well as develops nanoporous materials and As-cast parts. The company was formerly known as Teikoku Piston Ring Co., Ltd. and changed its name to TPR Co., Ltd. in October 2011. TPR Co., Ltd. was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.tpr.co.jp",
        "full_time_employees": null
    },
    "6470.T": {
        "short_name": "TAIHO KOGYO",
        "long_name": "Taiho Kogyo Co., Ltd.",
        "summary": "Taiho Kogyo Co., Ltd. manufactures and sells bearings in Japan. It provides engine bearings; and bushings and thrust washers for engine and engine accessory components, and steering systems, as well as for differential, transmission, suspension, and other applications. The company also offers special bearings for use in automobile and home air conditioning compressors, turbochargers, and steering systems; and EGR valves and actuators for use in turbochargers. In addition, it provides aluminum die-cast products; plastic products; and precision dies, including sintering, precision casting, and precision plastic molding dies. The company was founded in 1944 and is headquartered in Toyota, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyota",
        "zipcode": "471-8502",
        "website": "http://www.taihonet.co.jp",
        "full_time_employees": null
    },
    "6471.T": {
        "short_name": "NSK",
        "long_name": "NSK Ltd.",
        "summary": "NSK Ltd. manufactures and sells industrial machinery bearings, automotive products, and precision machinery and parts worldwide. Its products include ball bearings; roller bearings; bearing units; super precision bearings; bearings for steel industry, mining and construction, papermaking machines, and pumps and compressors; and bearings for special environments, including sanitary, corrosive, vacuum, clean, high-temperature, non-magnetic requirement, and dust-contaminated environments. The company also provides automotive products, which comprise chassis products, such as electric power steerings, steering column and intermediate shafts, and hub unit bearings; power train products comprising engine parts and electrical accessories; and drive train products consisting of automatic and manual transmission, products for motorcycles and all-terrain vehicles, half toroidal CVT POWERTOROS units, and differential gear and propeller shafts. In addition, it offers precision machine components, including ball screws, linear guides, monocarriers, XY tables, and spindles; and accessories, including ball screw support bearings, air bearings, and clean grease, as well as support units for heavy and light loads, machine tools, and small equipment. Further, the company provides megatorque motors; recruitment services; maintenance and repair services; design, development, sales, and maintenance services for computer systems and networks; insurance agency services; and sells industrial machinery bearings and automotive components, as well as manages and rents real estate properties. It serves agriculture, automotive, cement, food processing machinery, industrial motor, gearbox, injection molding machine, machine tool, medical device, mining and construction, motorcycle, office equipment, palm oil, papermaking machinery, pump and compressor, railway, semiconductor, steel, sugar, and wind turbine industries. NSK Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8560",
        "website": "http://www.nsk.com/index.html",
        "full_time_employees": 30378
    },
    "6473.T": {
        "short_name": "JTEKT CORPORATION",
        "long_name": "JTEKT Corporation",
        "summary": "JTEKT Corporation manufactures and sells steering systems, driveline components, bearings, machine tools, electronic control devices, home accessory equipment, etc. It offers steering systems, such as electric power steering, hydraulic power steering, and unit components; driveline components, including driveshaft, propeller shaft, coupling, and Torsen limited slip differential products; wheels, such as hub units; engine and peripheral parts that include damper pulley; and transmission products, such as electric pump for idle-stop system and solenoid valves. The company also provides sensor systems comprising peripherals for social infrastructures; products for research and development field, including semiconductor transducers, load cells, DC amplifiers, and pressure transducer for welding guns and indicators; medical equipment, such as pressure sensors for dialyzers; and heat-resistant lithium-ion capacitors. In addition, it offers ball and roller bearings; and oil seals. Further, the company provides machine tools, such as cam and crankshaft grinders, cylindrical grinders, cutting machines, machining centers, gear skiving centers, and other machine tools; and mechatronic products. It offers its products under the JTEKT, KOYO, and TOYODA brands. The company operates in Japan, rest of Asia, Europe, North America, South America, Oceania, and internationally. JTEKT Corporation was founded in 1921 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-8502",
        "website": "http://www.jtekt.co.jp",
        "full_time_employees": null
    },
    "6493.T": {
        "short_name": "NITTAN VALVE CO",
        "long_name": "Nittan Valve Co., Ltd.",
        "summary": "Nittan Valve Co., Ltd. manufactures and distributes engine valves in Japan. The company offers engine valves for engines in automobiles, motorcycles and scooters, trucks, and buses; and engine valves for marine and general-purpose products for engine manufacturing customers, as well as for generators, tillers, mowers, etc. It also manufactures and sells precision forged gears and automatic transmission parts for automobiles, trucks, agricultural, construction, and industrial machinery. In addition, the company manufactures and sells valve lifters, roller rocker arms, and machine tools; and produces, processes, and sells chemical free vegetables. The company was formerly known as Nittan Valve Manufacturing Co., Ltd and changed its name to Nittan Valve Co., Ltd. in July 1961. Nittan Valve Co., Ltd. was founded in 1948 and is headquartered in Hadano, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hadano",
        "zipcode": "257-0031",
        "website": "http://www.niv.co.jp",
        "full_time_employees": null
    },
    "64M.F": {
        "short_name": "EXEDY CORP.",
        "long_name": "EXEDY Corporation",
        "summary": "EXEDY Corporation, together with its subsidiaries, manufactures and sells manual and automatic transmission vehicle parts in Japan and internationally. The company provides manual and automatic transmission parts for passenger vehicles, trucks, and buses, which include clutch covers, clutch discs, sports clutches, torque converters, and AT parts. It also offers separate type power shift transmissions, retarders, and dampers discs for construction machinery; differential direct connection type power shift transmissions for industrial vehicles, such as forklifts; and dual clutches for agricultural machinery. In addition, the company provides dry type pulley centrifugal clutches, wet type centrifugal clutches, wet type multi-plate clutches with coil springs, wet type multi-plate clutches with DSPs, and one-way clutches. The company was formerly known as Daikin Manufacturing Co., Ltd and changed its name to EXEDY Corporation in 1995. EXEDY Corporation was founded in 1950 and is headquartered in Neyagawa, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Neyagawa",
        "zipcode": "572-8570",
        "website": "http://www.exedy.com",
        "full_time_employees": null
    },
    "6584.T": {
        "short_name": "SANOH INDUSTRIAL CO",
        "long_name": "Sanoh Industrial Co., Ltd.",
        "summary": "Sanoh Industrial Co., Ltd. manufactures and sells automotive parts worldwide. The company offers automotive tubing products, such as cluster tubes; and plastic fuel tubes comprising engine jumpers, fuel tank jumpers, ORVR tubes, in-tank tubes, breather tubes, vapor return tubes, canister drain tubes, ventilation tubes, and fuel filler necks. Its automotive tubing products also include brake tubes; brake vacuum tubes; metal tubing products comprising brazed and welded steel tubing products; surface treatment products, which consists of PA, PC, and PVdF coating products; plastic tubing products that comprise mono-layer, multi-layer, and convoluted tubing products; and quick connectors. In addition, the company offers powertrain products, such as fuel injection rails (FIRs), high-pressure FIRs, intake pipes, and fuel senders for motorcycles; and water and oil cooler pipes. Further, it provides environment and safety products consisting of exhaust gas recirculation pipes, air shutter guides, pre tensioner tubes, and seat belt buckles and shoulder adapters; and wire condensers for refrigerators and timer devices for washing machines. The company was formerly known as Omiya Kohku Kogyo Co., Ltd. and changed its name to Sanoh Industrial Co., Ltd. in March 1952. Sanoh Industrial Co., Ltd. was founded in 1939 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.sanoh.com",
        "full_time_employees": 8839
    },
    "6592.T": {
        "short_name": "MABUCHI MOTOR CO",
        "long_name": "Mabuchi Motor Co., Ltd.",
        "summary": "Mabuchi Motor Co., Ltd. researches, develops, manufactures, markets, and sells small electric motors. It provides motors for use in automotive appliances, light electric vehicles, precision and office equipment, home appliances and power tools, and car AV equipment; and brush motors. The company sells its products in Japan, North and Latin America, Europe, China, and the Asia Pacific. Mabuchi Motor Co., Ltd. was incorporated in 1926 and is headquartered in Matsudo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsudo",
        "zipcode": "270-2280",
        "website": "http://www.mabuchi-motor.co.jp",
        "full_time_employees": 21477
    },
    "6776.T": {
        "short_name": "TENSHO ELECTRIC INDUSTRIES CO",
        "long_name": "Tensho Electric Industries Co., Ltd.",
        "summary": "Tensho Electric Industries Co., Ltd. designs, manufactures, and sells plastic molding products in Japan and internationally. It offers containers for infectious municipal and medical waste, conductive printed circuit board storage racks, materials for logistics industry, returnable containers, etc. The company also provides various automobile resin parts, such as exterior and interior parts, air conditioners and thermal equipment parts, intake system parts, safety device parts, and engine peripheral parts. In addition, it offers home appliances, such as exterior parts of lighting apparatus and LCD televisions, as well as office equipment. The company was founded in 1936 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "194-0005",
        "website": "http://www.tensho-plastic.co.jp",
        "full_time_employees": null
    },
    "67X.F": {
        "short_name": "MUSASHI SEIMITSU IND.",
        "long_name": "Musashi Seimitsu Industry Co., Ltd.",
        "summary": "Musashi Seimitsu Industry Co., Ltd. manufactures and sells transportation equipment in Japan and internationally. The company provides parts for automobiles, such as power train, and linkage and suspension products. It also manufactures and supplies transmission gears, camshafts, and other drive parts for motorcycles, general-purpose engines, and all-terrain vehicles. Musashi Seimitsu Industry Co., Ltd. has a strategic collaboration with Aquarius Engines (A.M) Ltd. for research and development, assembly, distribution, marketing, and sales of the Aquarius engines and generators. The company was formerly known as Musashi Sangyo and changed its name to Musashi Seimitsu Industry Co., Ltd. in September 1963. Musashi Seimitsu Industry Co., Ltd. was founded in 1938 and is headquartered in Toyohashi, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Toyohashi",
        "zipcode": null,
        "website": "http://www.musashi.co.jp",
        "full_time_employees": null
    },
    "6901.T": {
        "short_name": "SAWAFUJI ELECTRIC CO",
        "long_name": "Sawafuji Electric Co., Ltd.",
        "summary": "Sawafuji Electric Co., Ltd. manufactures and sells electronic components for trucks and buses, portable electronic equipment, and portable refrigerators in Japan. The company offers automotive electrical equipment, such as starters, alternators, hybrid (HV) motors, control devices, battery packs, relays, and DC motors. It also provides refrigerators under the ENGEL brand; and gasoline and diesel engine generators and welders under the Elemax brand, as well as generators for use in ships, power plants, and industrial applications. In addition, the company engages in the transportation and freightage businesses. It exports its products to approximately 100 countries worldwide. The company was formerly known as Sawafuji Electric Manufactory and changed its name to Sawafuji Electric Co., Ltd. in 1934. Sawafuji Electric Co., Ltd. was founded in 1908 and is headquartered in Ota, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ota",
        "zipcode": "370-0344",
        "website": "http://www.sawafuji.co.jp",
        "full_time_employees": 891
    },
    "6902.T": {
        "short_name": "DENSO CORP",
        "long_name": "DENSO Corporation",
        "summary": "DENSO Corporation manufactures and sells automotive components in Japan. It offers HVAC units, condensers, radiators, water-cooled intercoolers, and bus air conditioners; gasoline and diesel engine management systems, and engine-related products comprising gasoline direct injectors, high pressure pumps, variable cam timing systems, exhaust gas sensors, common rail systems, and spark plugs; and oil pressure control valves. The company also provides hybrid and electric car drive systems, power supply and related products, and starting system parts, such as alternators and starters; electric power steering motors, control brake motors, and electric control units (ECUs); windshield wiper systems, power window motors, engine control motors, and blower fans; motor generators and lithium-ion battery packs; cockpit products, such as humanÂ\u0096machine interface control units, meters, head-up displays, air-conditioning panels, and driver status monitors; and connected products and services, including telematics control units, electronic toll collection 2.0 on-board devices, and road-to-vehicle and vehicle-to-vehicle communication devices. In addition, it offers electronic systems, services, and platforms; vision sensors, millimeter-wave radar sensors, sonar sensors, driving-support ECUs, and sensors and ECUs for airbags; electronics products, including powertrain and body ECUs; retrofitted products, such as acceleration control devices; and microelectronic devices comprising power cards, semiconductor sensors, and application specific integrated circuit. Further, the company provides automated modules, vertical articulated and collaborative robots, IoT data servers, barcode and 2D handy terminals, and QR and RFID payment and recognition solutions. Additionally, it offers consulting and cloud services for horticultural facilities, as well as after-sale services; and in-vehicle refrigeration units. DENSO Corporation was founded in 1949 and is based in Kariya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8661",
        "website": "http://www.denso.com/global/en/",
        "full_time_employees": null
    },
    "6995.T": {
        "short_name": "TOKAI RIKA CO",
        "long_name": "Tokai Rika Co., Ltd.",
        "summary": "Tokai Rika Co., Ltd. produces and sells human interface systems and controls, security systems, safety systems, electronics, ornaments, and home devices. The company offers human interface systems and controls, including touchpads; multi-function, power window, steering, heater control, push start, fog lamp, power outer mirror, defogger, rheostat light control, and seat switches, as well as neutral start, parking brake, engine oil pressure, door lock, brake lamp, courtesy lamp, and buckup light sensing switches; and shift levers. It also provides security systems, such as smart key portable device and emergency keys, electronic key systems, powered/mechanical steering lock assemblies, immobilizers, remote keys, and key sets; and safety systems comprising seatbelts, steering wheels, door mirrors, and digital outer mirrors. In addition, the company offers electronic systems, such as power supply ECUs, immobilizer ECUs, speed and steering angle sensors, and custom ICs; and wheel covers, center caps, and emblems. Further, it provides entrance electric door locks and window lock monitoring systems; SMT and board lock connectors; and auto alarms. Tokai Rika Co., Ltd. was founded in 1948 and is headquartered in Niwa-gun, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Niwa",
        "zipcode": "480-0195",
        "website": "http://www.tokai-rika.co.jp",
        "full_time_employees": null
    },
    "69L.F": {
        "short_name": "DAIDO METAL CO.LTD",
        "long_name": "Daido Metal Co., Ltd.",
        "summary": "Daido Metal Co., Ltd. ,together with its subsidiaries, manufactures and sells bearings in Japan, North America, Europe, Asia, China, and internationally. It offers metal-polymer plain bearings used in various applications, including office equipment, construction equipment, high-speed vehicles, trains, domed stadiums, and others, as well as hydro, thermal, and nuclear power plants. The company also provides metallic bearings; engine bearings, such as half shell bearings, bushings, thrust washers, and turbocharger bearings for use in passenger cars, buses, construction machinery, and race cars; and turbomachinery bearing systems comprising turbine and supercharger bearings for marine engines, power-generating turbine bearings, waterwheels for generator and water treatment pump bearings, and compressor and pump bearings. In addition, it offers modular products consisting of small assembly products, insert molding products, and specialty-shaped products; pumps and drum feeders; centralized lubrication products; and capacitors. Daido Metal Co., Ltd was founded in 1939 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0008",
        "website": "http://www.daidometal.com",
        "full_time_employees": 6916
    },
    "6JK.F": {
        "short_name": "JTEKT CORP.",
        "long_name": "JTEKT Corporation",
        "summary": "JTEKT Corporation manufactures and sells steering systems, driveline components, bearings, machine tools, electronic control devices, home accessory equipment, etc. It offers steering systems, such as electric power steering, hydraulic power steering, and unit components; driveline components, including driveshaft, propeller shaft, coupling, and Torsen limited slip differential products; wheels, such as hub units; engine and peripheral parts that include damper pulley; and transmission products, such as electric pump for idle-stop system and solenoid valves. The company also provides sensor systems comprising peripherals for social infrastructures; products for research and development field, including semiconductor transducers, load cells, DC amplifiers, and pressure transducer for welding guns and indicators; medical equipment, such as pressure sensors for dialyzers; and heat-resistant lithium-ion capacitors. In addition, it offers ball and roller bearings; and oil seals. Further, the company provides machine tools, such as cam and crankshaft grinders, cylindrical grinders, cutting machines, machining centers, gear skiving centers, and other machine tools; and mechatronic products. It offers its products under the JTEKT, KOYO, and TOYODA brands. The company operates in Japan, rest of Asia, Europe, North America, South America, Oceania, and internationally. JTEKT Corporation was founded in 1921 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-8502",
        "website": "http://www.jtekt.co.jp",
        "full_time_employees": null
    },
    "7208.T": {
        "short_name": "KANEMITSU CORPORATION",
        "long_name": "Kanemitsu Corporation",
        "summary": "Kanemitsu Corporation designs, develops, manufactures, and sells sheet metal pulleys for vehicles, agricultural machinery, and general equipment in Japan and internationally. The company offers transmission parts, such as inner drums, pistons, and plate rears; and airbag components, sensor plates, electric power steering parts, stainless steel chambers, pulleys, sprockets, and rib formation on boss parts.The company was founded in 1947 and is headquartered in Akashi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Akashi",
        "zipcode": "673-0874",
        "website": "http://www.kanemitsu.co.jp",
        "full_time_employees": 600
    },
    "7215.T": {
        "short_name": "FALTEC CO LIMITED",
        "long_name": "Faltec Co., Ltd.",
        "summary": "Faltec Co., Ltd. designs, develops, produces, and sells automotive parts, accessories, and supplies worldwide. The company offers resin molding products, such as injection molding machines, radiator grilles, and other exterior parts; surface treatment products, including plating and plating line, deposition/sputtering, millimeter wave radar cover, and painting and painting line; and press processing products, such as SUS moldings, roll forming, bend processing/cut processing, and roof rail. It also provides electrical and electronic components comprising fog lamps, remote control engine starter, and grip heater products, as well as telematics communication units and remote control engine starters. The company was founded in 1917 and is headquartered in Kawasaki, Japan. Faltec Co., Ltd. is a subsidiary of TPR Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawasaki",
        "zipcode": "212-0013",
        "website": "http://www.faltec.co.jp",
        "full_time_employees": 2313
    },
    "7217.T": {
        "short_name": "TEIN INC",
        "long_name": "Tein, Inc.",
        "summary": "Tein, Inc. designs, develops, manufactures, and sells auto parts and suspensions in Japan and internationally. The company offers OE-shape shock absorbers, electronic damping force controllers, low-down springs, and specialized dampers, as well as shock absorbers for the street and sporty rides. It also provides standardized and racing springs, polyurethane bushes, strengthened tie rods, toe control arms, pillow ball upper mounts, bonnet/hood dampers, repair and replacement parts, and tools and handy products. In addition, the company offers helmets and intercoms, safety fuel cells, alignment and corner weight gauges, motorsport tents, gas cylinder covers, and automatic piston rod inspection machines. Further, the company sells imported automobile goods. Tein, Inc. was founded in 1985 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "245-0053",
        "website": "http://www.tein.co.jp",
        "full_time_employees": 298
    },
    "7218.T": {
        "short_name": "TANAKA SEIMITSU KOGYO",
        "long_name": "Tanaka Seimitsu Kogyo Co., Ltd.",
        "summary": "Tanaka Seimitsu Kogyo Co., Ltd. manufactures and sells automobile and motorcycle parts, and other miscellaneous parts in Japan and internationally. The company was founded in 1948 and is headquartered in Toyama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyama",
        "zipcode": "930-0996",
        "website": "http://www.tanasei.co.jp",
        "full_time_employees": 1780
    },
    "7219.T": {
        "short_name": "HKS LIMITED",
        "long_name": "HKS Co., Ltd.",
        "summary": "HKS Co., Ltd. manufactures and sells automobile aftermarket parts in Japan and internationally. It offers automobile aftermarket products, such as turbo kits, exhaust systems, turbochargers, original mufflers, suspensions, electronics, and others; race engines; eco-friendly and fuel efficient systems; and conversion kits for converting a normal gasoline vehicle into CNB Bi-fuel system vehicle. The company also engages in developing and selling light sport aircraft engines, as well as in the contract and original equipment manufacturing business. HKS Co., Ltd. was founded in 1973 and is headquartered in Fujinomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fujinomiya",
        "zipcode": "418-0192",
        "website": "http://www.hks-global.com",
        "full_time_employees": 345
    },
    "7220.T": {
        "short_name": "MUSASHI SEIMITSU IND",
        "long_name": "Musashi Seimitsu Industry Co., Ltd.",
        "summary": "Musashi Seimitsu Industry Co., Ltd. manufactures and sells transportation equipment in Japan and internationally. The company provides parts for automobiles, such as power train, and linkage and suspension products. It also manufactures and supplies transmission gears, camshafts, and other drive parts for motorcycles, general-purpose engines, and all-terrain vehicles. Musashi Seimitsu Industry Co., Ltd. has a strategic collaboration with Aquarius Engines (A.M) Ltd. for research and development, assembly, distribution, marketing, and sales of the Aquarius engines and generators. The company was formerly known as Musashi Sangyo and changed its name to Musashi Seimitsu Industry Co., Ltd. in September 1963. Musashi Seimitsu Industry Co., Ltd. was founded in 1938 and is headquartered in Toyohashi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyohashi",
        "zipcode": null,
        "website": "http://www.musashi.co.jp",
        "full_time_employees": null
    },
    "7228.T": {
        "short_name": "DAYTONA CORP",
        "long_name": "Daytona Corporation",
        "summary": "Daytona Corporation engages in the market research, planning, development, testing, procurement, logistics management, and export of motorcycle parts and accessories. The company offers hand controls, such as switches, switch housings, clutch levers, master cylinders, heated grips, hydraulic clutches, and control kits; gauges; brake parts comprising calipers, brackets, and rear master cylinders; and engine parts, including tappet lifters, connecting rods, switches, lifter blocks, rocker cover kits, rocker arms, oil pumps, cam chain tensioners, and cylinders. It also provides electrical parts, such as switches, charging systems, ignition coils, regulators, and other products; chassis parts, which include steering dampers, wheel rims, and fork bushes; decoration panels and reverse gear kits; and master cylinder and caliper rebuild kits. In addition, the company offers engines, and upgrade and setting parts; and multi-fit products, such as heated grips, gauges, mirrors, direction indicators, headlights, and premium zone series. Further, it provides chassis, handles, lights, seats, exhausts, and replacement parts and accessories; and smartphone, power supply, and multiuse mountbar accessories. The company sells its products through authorized overseas distributors in Asia, North America, Europe, Oceania, and Central and South America. Daytona Corporation was founded in 1972 and is based in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "437-0226",
        "website": "http://daytona-global.com",
        "full_time_employees": 180
    },
    "7229.T": {
        "short_name": "YUTAKA GIKEN CO",
        "long_name": "Yutaka Giken Co.,Ltd.",
        "summary": "Yutaka Giken Co.,Ltd. manufactures and sells automobile parts in Japan and internationally. Its products include torque converters; exhaust system products, such as exhaust manifolds, catalytic converters, silencers, and heat collectors; brake discs for motorcycles; and motor parts, including stator cores and rotors. The company was founded in 1954 and is headquartered in Hamamatsu, Japan. Yutaka Giken Co.,Ltd. is a subsidiary of Honda Motor Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hamamatsu",
        "zipcode": "431-3194",
        "website": "http://www.yutakagiken.co.jp",
        "full_time_employees": 6307
    },
    "7231.T": {
        "short_name": "TOPY INDUSTRIES",
        "long_name": "Topy Industries, Limited",
        "summary": "Topy Industries, Limited engages in the steel, automotive, industrial machinery components, power generation, and other businesses in Japan and internationally. The company provides section steel, such as H-section steel, channel steel, equal and unequal angle steel, unequal non-isopachous steel, flat steel, R-flat steel, bulb plate, ultra-thick wide flat, and deformed section steel products, including rims, super giant off-the-road rim wheels, track shoes, blades, forklift mast materials, segment components, HSST rails, and Z-steel products, as well as deformed bar steel products. It also offers steel wheels, aluminum wheels, and construction machinery wheels for passenger cars, trucks, buses, and small and large construction vehicles; and undercarriage components, such as tracks, rollers, cutting edges for motor graders, and city pads for hydraulic shovels, bulldozers, and other construction equipment, as well as parts. In addition, the company generates and supplies thermal electricity; and provides crawler robots and synthetic mica products. Further, it leases real estate properties and operates OSSO sports club. The company was founded in 1921 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8634",
        "website": "http://www.topy.co.jp",
        "full_time_employees": 6181
    },
    "7235.T": {
        "short_name": "TOKYO RADIATOR MFG CO",
        "long_name": "Tokyo Radiator Mfg.Co.,Ltd.",
        "summary": "Tokyo Radiator Mfg.Co.,Ltd. manufactures and sells heat exchangers and body components in Japan, China, Thailand, and Indonesia. It provides cooling modules for trucks and construction machinery; radiators and inter coolers for heavy and light duty trucks; EGR coolers for diesel and gasoline engines; oil coolers; oil pans; and SCR, fuel, and sub tanks. The company was founded in 1938 and is headquartered in Fujisawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fujisawa",
        "zipcode": "252-0816",
        "website": "http://www.tokyo-radiator.co.jp",
        "full_time_employees": 884
    },
    "7236.T": {
        "short_name": "T.RAD CO LTD",
        "long_name": "T.RAD Co., Ltd.",
        "summary": "T.RAD Co., Ltd. manufactures and markets heat exchangers for automobiles, construction and industrial machines, air conditioners, distributed generators, and others in Japan and internationally. The company offers radiators, oil coolers, EGR coolers, charge air coolers, fin coils, and other heat exchangers for automobiles, motorcycles, off-highway machines, fuel cell systems, and heating and cooling equipment. It also engages in the research, development, manufacture, and marketing of environment-related equipment; and manufacture and marketing of parts for automobiles and other machines. The company was formerly known as Toyo Radiator Co., Ltd. and changed its name to T.RAD Co., Ltd. in April 2005. T.RAD Co., Ltd. was incorporated in 1936 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0053",
        "website": "http://www.trad.co.jp",
        "full_time_employees": 4657
    },
    "7238.T": {
        "short_name": "AKEBONO BRAKE INDUSTRY CO",
        "long_name": "Akebono Brake Industry Co., Ltd.",
        "summary": "Akebono Brake Industry Co., Ltd. researches, develops, manufactures, and sells brakes, and related components and parts Japan, North America, Europe, and other Asian countries. The company offers disc brake calipers, disc brake pads, disc rotors, drum brake linings, drum brake shoes, wheel cylinders, drum-in-hat brakes, brake drums, sensors, etc. for automobiles; and disc brake calipers, disc brake pads, master cylinders, and others for motorcycles. It also provides brakes for rolling stock, including disc brakes and brake linings for bullet trains, brake linings for regular trains, disc brakes for monorail, brake linings for rolling stock, brake shoes for railroad trains, etc. In addition, the company offers brakes for industrial machinery, such as drum brakes for forklifts, clutch facings for car air conditioner units, brake shoes for elevators, etc., as well as disc brakes for wind turbine generators and rough terrain cranes. Further, it provides sensor products comprising accelerometers, angular rate sensors, and sensor clusters; vehicle behavior detection and wireless portable vibration measurement devices; and inclinometers, concrete filing detectors, light emitting inclination sensors/pockets, and earthquake detectors for long-wave seismic motors. The company was formerly known as Akebono Sekimen Kogyo Co., Ltd. and changed its name to Akebono Brake Industry Co., Ltd. in 1960. Akebono Brake Industry Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8534",
        "website": "http://www.akebono-brake.com",
        "full_time_employees": 6499
    },
    "7239.T": {
        "short_name": "TACHI-S CO LTD",
        "long_name": "TACHI-S Co., Ltd.",
        "summary": "TACHI-S Co., Ltd. engages in the manufacture and sale of automotive seats in Japan and internationally. It offers driver, rear, passenger, second, third, and commercial vehicle seat systems for car categories, such as luxury brand cars, sports cars, Kei cars, trucks, and commercial vehicles. The company was formerly known as Tachikawa Spring Co., Ltd. and changed its name to TACHI-S Co., Ltd. in April 1986. TACHI-S Co., Ltd. was founded in 1954 and is headquartered in Akishima, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Akishima",
        "zipcode": "196-8611",
        "website": "http://www.tachi-s.co.jp",
        "full_time_employees": 13750
    },
    "7241.T": {
        "short_name": "FUTABA INDUSTRIAL CO",
        "long_name": "Futaba Industrial Co., Ltd.",
        "summary": "Futaba Industrial Co., Ltd. manufactures and sells automobile parts, office equipment parts, equipment for external sales, and agricultural equipment in Japan and internationally. The company offers automobile parts, such as exhaust systems and manifolds; exhaust heat recovery and diesel exhaust gas post-treatment devices; body frame parts and instrument panel reinforcements; front suspension sub-frames, trailing arms, rear axle beams, and engine undercovers; and fuel inlet pipes and canisters. It also provides paper feeding units; precision parts for copiers, multifunction copiers, printers, and digital printers, etc.; and assembly and welding equipment for automobile manufacturers. The company was incorporated in 1935 and is headquartered in Okazaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Okazaki",
        "zipcode": "444-8558",
        "website": "http://www.futabasangyo.com",
        "full_time_employees": null
    },
    "7242.T": {
        "short_name": "KYB CORPORATION",
        "long_name": "KYB Corporation",
        "summary": "KYB Corporation manufactures and sells automotive and hydraulic components, and other products worldwide. It offers automotive products, including shock absorbers, hydraulic power steering vane pumps, steering gearbox, communication control unit controls, motors, dual pinion systems, EPS actuators, and vane pumps; motorcycle components, such as power-regulated front fork and rear cushion unit, shock absorption, steering dampers; and railroad equipment, such as caliper brakes, dampers, shock absorbers, suspension system, and valves. The company also provides aircraft components comprising actuators, accumulators, wheel brakes, reservoir modules, and reservoirs for space rockets; construction, industrial, and agricultural machinery products consisting of pumps, motors, cylinders, valves, arch cellular communication device, and integrated HSTs; and special purpose vehicles, including concrete mixer trucks, granule carriers, and tilting drum mixing machines, as well as products for environment, such as pruned tree shredder trucks, primary crushers, wood crushing type grinding machine, and wood pulverizer. In addition, it provides theater equipment comprising acoustic reflectors, rigging systems, and floor equipment; moving starting platforms for construction; marine components consisting of stern cranes; and industrial machinery, including axial piston pumps, motion packages, oil and mini buffers, and gas springs. Further, the company offers sports and welfare products, such as chair ski shock absorbers, sports dampers, and vehicle kneeling down systems. The company was formerly known as Kayaba Industry Co., Ltd. and changed its name to KYB Corporation in October 2015. KYB Corporation was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-6111",
        "website": "http://www.kyb.co.jp",
        "full_time_employees": null
    },
    "7244.T": {
        "short_name": "ICHIKOH INDUSTRIES",
        "long_name": "Ichikoh Industries, Ltd.",
        "summary": "Ichikoh Industries, Ltd., together with its subsidiaries, develops, manufactures, and sells automotive parts for aftermarket in Japan and internationally. It provides head, rear combination, and fog lamps; door, inside, and electronic mirrors; windshield wiper blades; and lamps for railroad carriages, house apparatus, etc. The company was founded in 1903 and is headquartered in Isehara, Japan. Ichikoh Industries, Ltd. is a subsidiary of Valeo Bayen.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Isehara",
        "zipcode": "259-1192",
        "website": "http://www.ichikoh.com",
        "full_time_employees": 3602
    },
    "7245.T": {
        "short_name": "DAIDO METAL CO LTD",
        "long_name": "Daido Metal Co., Ltd.",
        "summary": "Daido Metal Co., Ltd. ,together with its subsidiaries, manufactures and sells bearings in Japan, North America, Europe, Asia, China, and internationally. It offers metal-polymer plain bearings used in various applications, including office equipment, construction equipment, high-speed vehicles, trains, domed stadiums, and others, as well as hydro, thermal, and nuclear power plants. The company also provides metallic bearings; engine bearings, such as half shell bearings, bushings, thrust washers, and turbocharger bearings for use in passenger cars, buses, construction machinery, and race cars; and turbomachinery bearing systems comprising turbine and supercharger bearings for marine engines, power-generating turbine bearings, waterwheels for generator and water treatment pump bearings, and compressor and pump bearings. In addition, it offers modular products consisting of small assembly products, insert molding products, and specialty-shaped products; pumps and drum feeders; centralized lubrication products; and capacitors. Daido Metal Co., Ltd was founded in 1939 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0008",
        "website": "http://www.daidometal.com",
        "full_time_employees": 6916
    },
    "7247.T": {
        "short_name": "MIKUNI CORP",
        "long_name": "Mikuni Corporation",
        "summary": "Mikuni Corporation manufactures and sells automobile products in Japan and internationally. The company's automobiles products include heaters, intake systems, valve systems, thermal control systems, sensors, pumps, etc., as well as products for motorcycles and power equipment. It also provides gas and water control devices, accessory parts for fuel cells, and humidifiers; and consumer products, as well as assistive devices and nursing care equipment. In addition, the company trades in precision processed materials comprising castings and forgings for aircraft, parts, accessories, and maintenance materials; and imports and distributes lawn mowers, turf-care equipment, and industrial machinery and parts. Further, it offers fuel injection systems and related devices, carburetors, pumps, control valves, and engine preheaters. The company was formerly known as Mikuni Kogyo Co., Ltd. and changed its name to Mikuni Corporation in 1991. Mikuni Corporation was founded in 1923 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.mikuni.co.jp",
        "full_time_employees": 5698
    },
    "7254.T": {
        "short_name": "UNIVANCE CORP",
        "long_name": "Univance Corporation",
        "summary": "Univance Corporation manufactures and sells drivetrain transmission products for automotive, agricultural, industrial, and off highway applications in Japan and internationally. The company offers gear boxes for truck motors and generators; transfer cases and transmissions for longitudinal engine layouts; part time transfer cases for SUV and pick-up applications; PTUs for transversely engine layouts; transmissions and reduction units for agricultural machinery vehicles; and reduction gearboxes for construction vehicles. It also provides functional, CVT, AT, transmission, differential, steering, and engine components for automotive sector, as well as clutches for automatic transmissions. The company was founded in 1937 and is headquartered in Kosai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kosai",
        "zipcode": "431-0494",
        "website": "http://www.uvc.co.jp",
        "full_time_employees": 1654
    },
    "7255.T": {
        "short_name": "SAKURAI LTD",
        "long_name": "Sakurai Ltd.",
        "summary": "Sakurai Ltd. designs, develops, manufactures, assembles, sells, and maintains machine tools and parts in Japan and internationally. The company offers passenger car transmission cases; motorcycle and passenger car cylinder heads; automatic transmission valve bodies; cylinders blocks; and forklift parts and gas meter parts, as well as general-purpose engine parts for use in outboard motors and agricultural machinery. It also manufactures and processes aircraft body parts, flying object parts, processing precision parts, and machine tools in aerospace field; and deburring, milling, head changing, system UP overhaul, and special purpose machines. Sakurai Ltd. was founded in 1950 and is headquartered in Hamamatsu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hamamatsu",
        "zipcode": "431-3124",
        "website": "http://www.sakurai-net.co.jp",
        "full_time_employees": 319
    },
    "7256.T": {
        "short_name": "KASAI KOGYO CO LTD",
        "long_name": "Kasai Kogyo Co., Ltd.",
        "summary": "Kasai Kogyo Co., Ltd. manufactures and sells automotive interior and exterior parts, and related businesses in Japan and internationally. The company offers cabin trim products, including door trims, head lining products, sun visors, rear parcel shelf products, map lamps, and body side trims; and luggage trim products, such as luggage side trims, tonneau covers, tonneau boards, trunk rooms, floor boards, and luggage floor under boxes. It also provides noise insulation parts comprising dash and hood insulators; and other body parts consisting of engine undercovers and fender covers. The company was founded in 1912 and is headquartered in Koza, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Koza",
        "zipcode": "253-0106",
        "website": "http://www.kasai.co.jp",
        "full_time_employees": 9310
    },
    "7259.T": {
        "short_name": "AISIN CORPORATION",
        "long_name": "Aisin Corporation",
        "summary": "Aisin Corporation manufactures and sells automotive parts, and energy- and lifestyle-related products. It provides powertrain products comprising 1-motor hybrid transmission and eaxle products; chassis and vehicle safety systems, such as automated parking systems and electronically controlled brake systems; power sliding door systems and sunroof products; connected and sharing solutions; and repair and maintenance products. The company also offers energy solutions comprising ENEÂ·FARM, a system that generates electricity by extracting hydrogen from gas; gas heat pump air-conditioners; warm water shower-toilet seats; and peltier modules that are thermoelectric conversion devices, which function as heat pumps by sending direct current. In addition, it provides ILY-Ai, a multi-functional personal shopping mobility product for various user needs; fiber laser; and audio equipment. The company was incorporated in 1949 and is headquartered in Kariya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8650",
        "website": "http://www.aisin.com",
        "full_time_employees": null
    },
    "7264.T": {
        "short_name": "MURO CORPORATION",
        "long_name": "Muro Corporation",
        "summary": "Muro Corporation designs, manufactures, and sells auto parts in Japan. The company provides engine parts, including angle sensors, flanges, washers, flywheels, stators, spacers, seat valve springs, valve lift control actuator stoppers, and plugs; transmission parts comprising secondary sheave stopper plates, separator plates, upper valve body covers, shield balances, retainer bearing outputs, holder C rings, ring-C main SFT products, and shims; differential gear parts, such as pinion thrust washers, differential side gear thrust washers, adjuster nuts, and finger-locks; and other parts consisting of bezel ciger lighters, oil separators, ribbon springs, closure disks, and adapters. It also offers auto feed screw driving systems; and citrus peelers for household use. The company was formerly known as Muro-Kinzoku Kogyo Co, LTD. and changed its name to Muro Corporation in March 1990. Muro Corporation was founded in 1953 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "321-3231",
        "website": "http://www.muro.co.jp",
        "full_time_employees": 1085
    },
    "7266.T": {
        "short_name": "IMASEN ELECTRIC INDUSTRIAL CO",
        "long_name": "Imasen Electric Industrial Co., Ltd.",
        "summary": "Imasen Electric Industrial Co., Ltd., together with its subsidiaries, develops, manufactures, and sells auto parts in Japan and internationally. The company offers mechanical products, including reclining, slide, height, and power seat adjusters; driving position memory seats; and window regulators. It also provides electric products, such as rear combination, interior, high-mounted stop, and indicator lamps, as well as overhead consoles; warning units, power seat control units, and power relays; and mike type and air horns. In addition, the company offers ashtrays, magnetic valves, power servos and latches, speed sensors, and motors. Further, it manufactures and sells aircraft wire harness, as well as wire harness for machine tools; and electromotive wheelchairs, and artificial arms and legs. Additionally, the company designs, develops, and manufactures image and video processing devices, LAN systems, and communication devices, as well as hardware and software for microcomputer systems. Imasen Electric Industrial Co., Ltd. was founded in 1939 and is based in Inuyama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Inuyama",
        "zipcode": "484-8507",
        "website": "http://www.imasen.co.jp",
        "full_time_employees": 4582
    },
    "7268.T": {
        "short_name": "TATSUMI CORP",
        "long_name": "TATSUMI Corporation",
        "summary": "TATSUMI Corporation manufactures and sells precision parts for cars, motorcycles, and industrial machinery in Japan and internationally. The company offers wiper system, power window, and starter motor parts; brake parts, ABS/ESC products for passenger cars, and brake master power parts; transmission parts; planetary gear shafts; and other parts that support brakes and engines of industrial and construction machinery. It also manufactures and sells heat and surface treatment machines. The company was formerly known as Tatsumi Seisakusho Co., Ltd. changed its name to TATSUMI Corporation in 1993. TATSUMI Corporation was founded in 1951 and is headquartered in Ashikaga, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ashikaga",
        "zipcode": "326-0836",
        "website": "http://www.tatsumi-ta.co.jp",
        "full_time_employees": 705
    },
    "7271.T": {
        "short_name": "YASUNAGA CORP",
        "long_name": "Yasunaga Corporation",
        "summary": "Yasunaga Corporation manufactures and sells engine parts and machine tools, and wire saw and electronics systems. It provides automotive and industrial machinery comprising engine parts, such as connecting rods, cylinder heads and blocks, camshafts, and crankshafts; and machine tools, including fracture splitting machines, finishing boring machines, double and single spindle machining centers, transfer machines, micro finishers, and leak testers. The company also offers solar cells, wire saws, and inspection and measuring devices. In addition, it provides environmental equipment that consists of air pumps and disposers for daily life, medical and healthcare, factory and other industrial location, and fish farming and aquarium applications. The company was formerly known as Yasunaga Tekkosho Co., Ltd. and changed its name to Yasunaga Corporation in April 1988. Yasunaga Corporation was founded in 1923 and is headquartered in Iga, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Iga",
        "zipcode": "518-0834",
        "website": "http://www.fine-yasunaga.co.jp",
        "full_time_employees": 1962
    },
    "7273.T": {
        "short_name": "IKUYO CO LTD",
        "long_name": "ikuyo Co.,Ltd.",
        "summary": "ikuyo Co.,Ltd. manufactures and sells resin parts for automobiles in Japan. It offers automobile exterior and interior equipment, and molded products, as well as processes and sells rubber products. The company was formerly known as Ikuyo Coating Co., Ltd. and changed its name to ikuyo Co., Ltd. in April 1974. The company was founded in 1947 and is headquartered in Atsugi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Atsugi",
        "zipcode": "243-0801",
        "website": "http://www.ikuyo194.co.jp",
        "full_time_employees": 196
    },
    "7276.T": {
        "short_name": "KOITO MANUFACTURING CO LTD",
        "long_name": "Koito Manufacturing Co., Ltd.",
        "summary": "Koito Manufacturing Co., Ltd. manufactures and markets automotive lighting equipment, electrical equipment, and other products in Japan, North America, China, rest of Asia, Europe, and internationally. The company provides automotive lighting products and accessories, including LED, discharge, and halogen headlamps, as well as fog lamps; and signaling lamps/other lighting products comprising LED rear combination, side turn signal, and high-mounted stop lamps. It also offers aircraft lighting and other equipment, such as interior and exterior lights, and caution warning panels, as well as electrical, hydraulic, and mechanical equipment; and ship lights/special products consisting of LED marine lamps and destination indicators. In addition, it manufactures and markets electronic components, electrical devices, telecommunications equipment, precision machinery, miniature bulbs, electrical equipment, resin metal molds, railroad car control equipment, and road traffic signals and traffic control systems, as well as seats for railroad cars, etc. Further, the company provides transportation and logistics, and insurance agency services; and maintains traffic signals and safety equipment. Koito Manufacturing Co., Ltd. was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8711",
        "website": "http://www.koito.co.jp",
        "full_time_employees": null
    },
    "7278.T": {
        "short_name": "EXEDY CORPORATION",
        "long_name": "EXEDY Corporation",
        "summary": "EXEDY Corporation, together with its subsidiaries, manufactures and sells manual and automatic transmission vehicle parts in Japan and internationally. The company provides manual and automatic transmission parts for passenger vehicles, trucks, and buses, which include clutch covers, clutch discs, sports clutches, torque converters, and AT parts. It also offers separate type power shift transmissions, retarders, and dampers discs for construction machinery; differential direct connection type power shift transmissions for industrial vehicles, such as forklifts; and dual clutches for agricultural machinery. In addition, the company provides dry type pulley centrifugal clutches, wet type centrifugal clutches, wet type multi-plate clutches with coil springs, wet type multi-plate clutches with DSPs, and one-way clutches. The company was formerly known as Daikin Manufacturing Co., Ltd and changed its name to EXEDY Corporation in 1995. EXEDY Corporation was founded in 1950 and is headquartered in Neyagawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Neyagawa",
        "zipcode": "572-8570",
        "website": "http://www.exedy.com",
        "full_time_employees": null
    },
    "7280.T": {
        "short_name": "MITSUBA CORP",
        "long_name": "Mitsuba Corporation",
        "summary": "Mitsuba Corporation manufactures and sells automotive electronic components. The company operates through Transportation Equipment-Related Operations, Information Service Operations, and Others segments. It provides auto electrical products, including front and rear wiper systems, windshield washer systems, door mirrors, lamps, power window and seat motors, roof motors, power sliding door drive systems, door lock actuators, fuel tank lid openers, power relays, horns, starter motors, cooling fans and motors, intelligent dynamic actuators, electric oil pumps, electronic throttle control motors, and electric power steering and servo brake motors. The company also offers motorcycle electrical products, such as starter motors, AC generators, ACG starters, fuel pump modules, starter relays, flasher relays, general use relays, actuators, horns, LED turn signal and license lamps; and EV Ecorun motors and solar car products. In addition, it provides general use products comprising general-purpose motors and bicycle power generation systems; and nursing care products, such as driving actuators and driving actuator controllers. Further, the company is involved in the information and agency services businesses. It primarily operates in Japan, China, other Asian countries, the Americas, and Europe. The company was formerly known as Mitsuba Electric Mfg. Co., Ltd. and changed its name to Mitsuba Corporation in October 1996. Mitsuba Corporation was founded in 1946 and is headquartered in Kiryu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kiryu",
        "zipcode": "376-8555",
        "website": "http://www.mitsuba.co.jp",
        "full_time_employees": 28230
    },
    "7282.T": {
        "short_name": "TOYODA GOSEI",
        "long_name": "Toyoda Gosei Co., Ltd.",
        "summary": "Toyoda Gosei Co., Ltd. manufactures and markets automobile parts, optoelectronic products, and other general industry products. It offers weatherstrips products, such as opening trim weatherstrips, door glass runs, door and outer weatherstrips, and luggage weatherstrips; functional components comprising fuel tank module components, power train parts, and chassis and drive train parts; interior and exterior parts; and safety system products, such as airbags, steering wheels, and other products. The company also provides solar LEDs and deep ultraviolet light source modules; and general industry products, such as air conditioning products, home construction components, construction and industrial machinery parts, and LED dynamo lights. It has operations in Japan, the Americas, Europe and Africa, and Asia. Toyoda Gosei Co., Ltd. was founded in 1949 and is headquartered in Kiyosu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kiyosu",
        "zipcode": "452-8564",
        "website": "http://www.toyoda-gosei.com",
        "full_time_employees": null
    },
    "7283.T": {
        "short_name": "AISAN INDUSTRY CO",
        "long_name": "Aisan Industry Co., Ltd.",
        "summary": "Aisan Industry Co., Ltd. manufactures and sells automotive parts in Japan and internationally. The company offers fuel pumps, fuel pump modules, throttle bodies, EGR valves, intake manifolds, positive crankcase ventilation valves, charcoal canisters and fuel tank close valves, and engine valves. It also provides FI systems, titanium alloy engine valves, and charcoal canisters for motorcycles; and hydrogen injectors, electric water pumps, and gas fuel systems for LPG and CNG. The company was founded in 1938 and is headquartered in Obu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Obu",
        "zipcode": "474-8588",
        "website": "http://www.aisan-ind.co.jp",
        "full_time_employees": null
    },
    "7284.T": {
        "short_name": "MEIWA INDUSTRY CO",
        "long_name": "Meiwa Industry Co.,Ltd.",
        "summary": "Meiwa Industry Co., Ltd. manufactures and sells automotive interior parts in Japan. It offers automotive interior components under the Shiko, Zem-Light, Zem-Light SPS, and Meitone brand names for use in various areas, such as trunk, floor mats, and roofs of sedans, wagons, SUVs, minivans, small cars, and trucks. The company also manufactures and sells home construction materials and devices comprising floor materials, housing equipment parts, sound insulation/soundproof material, and water shield/water stop material. Meiwa Industry Co., Ltd. was incorporated in 1950 and is headquartered in Atsugi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Atsugi",
        "zipcode": "243-0003",
        "website": "http://www.meiwasangyo.co.jp",
        "full_time_employees": 545
    },
    "7287.T": {
        "short_name": "NIPPON SEIKI CO",
        "long_name": "Nippon Seiki Co., Ltd.",
        "summary": "Nippon Seiki Co., Ltd. manufactures and sells instruments for automobiles, motorcycles, agricultural / construction machines, and boats in Japan, the Americas, Europe, and Asia. The company also provides sensors for automobiles, such as level, rotation, pressure, angle, and temperature sensor; household appliances, including displays, intercom systems, and wireless communication products, as well products which require waterproofing technology; office automation appliances comprising control panels for copiers, printers, facsimiles, and multi-functional products; and factory automation appliances, such as sequence controllers. In addition, it offers display products, which consists of passive liquid crystal display and organic light emitting diode; and manufactures and supplies gauges and displays for vehicles for the aftermarkets under the Defi brand name. Further, the company provides controllers for air-conditioning and household equipment, assemblies for factory automation, amusement units, high-density mounting boards, and electroluminescence panels and modules; PCB assemblies for amusements; and car inspection and maintenance services, as well as sells new and used automobiles. Additionally, it processes and sells resin materials; manufactures electronic sub-assemblies for instruments and remote controllers, and peripheral systems; develops and sells software products; and provides freight transportation, advertising agency, and computer services. The company also offers engages in the plastic injection molding; compounding and coloring of plastic; and trading activities. Nippon Seiki Co., Ltd. was founded in 1946 and is headquartered in Nagaoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagaoka",
        "zipcode": "940-8580",
        "website": "http://www.nippon-seiki.co.jp",
        "full_time_employees": 14530
    },
    "7292.T": {
        "short_name": "MURAKAMI CORP",
        "long_name": "Murakami Corporation",
        "summary": "Murakami Corporation manufactures and sells rear-view mirrors for automobiles and optical thin-film materials worldwide. The company offers rear-view mirror products, including hydrophilic clear mirrors, electro-chromic mirrors, aspheric mirrors, powerfold units, actuators, blind spot indicator mirrors, exterior rear view mirrors with puddle lamps, auto powerfold mirrors, exterior rear view mirrors with turn lamps, exterior rear view mirrors with side cameras, reverse auto-down mirrors, wide view interior mirrors with blind spot indicators, projection lamps, heated washer, and actuator units for electric vehicle inlet. It also provides opt-electronics solutions covering video equipment, such as dichronic mirrors and filters, UV cut and IR cut filters, cold mirrors, neutral density filters, bandpass filters, trimming filters, half mirrors, etc. for use in projectors, digital cameras, etc.; office automation equipment, such as aluminum and silver surface, chrome reflection, and laser mirrors, as well as antireflection coating, etc. for use in scanners, printers, laser-beam printers, copiers, etc.; and automotive components, including concave, aspheric mirrors, etc. for use in HUD, speedometers, on-board sensors etc. In addition, the company offers various components, including projection mirror actuator units, navigation stands, and active spoiler controllers. The company was founded in 1882 and is headquartered in Shizuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shizuoka",
        "zipcode": "420-8550",
        "website": "http://www.murakami-kaimeido.co.jp",
        "full_time_employees": 3183
    },
    "7294.T": {
        "short_name": "YOROZU CORP",
        "long_name": "Yorozu Corporation",
        "summary": "Yorozu Corporation designs, develops, manufactures, and sells auto parts, agricultural machinery parts, and production equipment worldwide. It offers front and rear suspension members, rear beams, links, brake pedals, and oil pans, as well as other parts, such as suspension modules, engine mounts, splash guards, and body parts for cars, trucks, and tractors. The company was formerly known as Yorozu Automotive Works and changed its name to Yorozu Corporation in June 1990. Yorozu Corporation was founded in 1948 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "222-8560",
        "website": "http://www.yorozu-corp.co.jp",
        "full_time_employees": 6475
    },
    "7296.T": {
        "short_name": "F.C.C. CO LTD",
        "long_name": "F.C.C. Co., Ltd.",
        "summary": "F.C.C. Co., Ltd. engages in the manufacture and sale of clutches, facings, and catalysts for automobiles, motorcycles, and general-purpose machinery in Japan, the United States, Indonesia, India, Thailand, China, Brazil, and Vietnam. It operates through two segments, Motorcycle Clutches and Automobile Clutches. The company's clutches for motorcycles comprise wet-type multi-disc, wet-type multi-disc assisted and slipper, wet-type and dry centrifugal, and racing clutches, as well as pulleys for belt converters for use in motorcycles, scooters, road sports bikes, all-terrain vehicles (ATVs), and racing vehicles. Its automobiles clutches include automatic transmission, CVT, torque converter lockup, manual transmission, and 4WD vehicle clutches. In addition, the company's general-purpose clutches consist of FCCTRAC, a cam-type torque-sensitive limited slip differential for four-wheel ATVs; and hydraulic static transmissions for snow throwers and lawn mowers. It is also involved in the manufacture and sale of components and parts for motorcycles and automobiles. The company was formerly known as Fuji Chemical Co., Ltd. and changed its name to F.C.C. Co., Ltd. in July 1984. F.C.C. Co., Ltd. was founded in 1939 and is headquartered in Hamamatsu, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hamamatsu",
        "zipcode": "431-1394",
        "website": "http://www.fcc-net.co.jp",
        "full_time_employees": null
    },
    "7298.T": {
        "short_name": "YACHIYO INDUSTRY CO",
        "long_name": "Yachiyo Industry Co., Ltd.",
        "summary": "Yachiyo Industry Co., Ltd. develops, produces, and sells automobile parts in Japan, the Americas, China, Europe, and Asia. It manufactures plastic and steel fuel tanks; tilt inner slide, outer slide, popup, and panorama sunroofs; plastic parts, including bumpers and instrument panels; and motorcycle parts. The company was formerly known as Yachiyo Painting Co., Ltd. and changed its name to Yachiyo Industry Co., Ltd. in September 1968. Yachiyo Industry Co., Ltd. was founded in 1953 and is headquartered in Sayama, Japan. Yachiyo Industry Co., Ltd. is a subsidiary of Honda Motor Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sayama",
        "zipcode": "350-1335",
        "website": "http://www.yachiyo-ind.co.jp",
        "full_time_employees": 7169
    },
    "7299.T": {
        "short_name": "FUJI OOZX INC",
        "long_name": "Fuji Oozx Inc.",
        "summary": "Fuji Oozx Inc. manufactures and sells engine valves and other related components for the automotive industry in Japan and internationally. The company offers engine valves, titanium valves, hollow valves, cotters/retainers, and valve seats and rotators. It also processes steel materials; sells processed steel products, tools, and jigs; and purchases, sells, lends, and repairs machine tools, as well as undertakes equipment installment contracts. The company was formerly known as Fuji Valve, Co., Ltd. and changed its name to Fuji Oozx Inc. in December 1992. Fuji Oozx Inc. was founded in 1951 and is headquartered in Kikugawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kikugawa",
        "zipcode": "439-0023",
        "website": "http://www.oozx.co.jp",
        "full_time_employees": null
    },
    "7315.T": {
        "short_name": "IJTT CO LTD",
        "long_name": "IJTT Co., Ltd.",
        "summary": "IJTT Co., Ltd. manufactures and sells transport equipment. The company offers industrial engines, power take offs, propeller shafts, and transfer products, as well as intake throttles, fly wheels, front axles, rocker arms, hub and drum assy, hub and rotor assy, diffcarrier assy, and diffcage assy products. It also provides cylinder heads, cylinder blocks, crank cases, diff carrier, exh-manifolds, fly wheel housings, pulleys, hubs, brake drums, disk rotors, transmission cases, trunion brackets, spring seats and brackets, i-beem front axles, knuckles, knuckle arms, tierod arms, main shafts, clank shafts, cam shafts, yokes, spiders, shaft end, and control valves. IJTT Co., Ltd. was founded in 2013 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "221-0056",
        "website": "http://www.ijtt.co.jp",
        "full_time_employees": 4207
    },
    "7551.T": {
        "short_name": "WEDS CO LTD",
        "long_name": "Weds Co., Ltd.",
        "summary": "Weds Co., Ltd., together with its subsidiaries, engages in the planning and development, and sale of automobile parts and supplies in Japan. The company offers aluminum and steel wheels for automobiles. It is also involved in the automobile supplies retailing, mobile phone sale, industrial machine sale, and elderly complex welfare businesses; and warehousing, rail transportation, logistics consulting, logistics equipment sale, industrial waste treatment, and worker dispatch service businesses. The company was formerly known as Nippo Co., Ltd. and changed its name to Weds Co., Ltd. in November 1973. Weds Co., Ltd. was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-0016",
        "website": "http://www.weds.co.jp",
        "full_time_employees": null
    },
    "7839.T": {
        "short_name": "SHOEI CO LTD",
        "long_name": "Shoei Co., Ltd.",
        "summary": "Shoei Co., Ltd. manufactures and sells helmets for government agencies under the SHOEI brand worldwide. The company provides full-face, system, jet, off-road, and trial helmets, as well as parts and accessories. It also offers its products online. The company was founded in 1959 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-0016",
        "website": "http://www.shoei.com",
        "full_time_employees": 479
    },
    "7888.T": {
        "short_name": "SANKO GOSEI LTD",
        "long_name": "Sanko Gosei Ltd.",
        "summary": "Sanko Gosei Ltd. engages in the molding and sale of plastic parts in Japan and internationally. It is involved in the production and assembly of mechanical/digital parts; and design, production, and sale of molds for plastic molded parts, industrial products, and industrial robots. The company's products include auto parts, such as exterior and interior parts, structured parts, instrument panels, functional parts, fan shrouds, and power pistons. It also provides OA apparatus, such as printer flames and fuser assemblies, automated fuser assembly lines, toner cartridge plastic parts, CMT automated assembly lines, printer covers, printers, and optical equipment flames; and air-conditioner products, including quiet and heat-resistant cross flow fans, propeller fans, and turbofans, as well as panels and covers for air conditioners. In addition, the company offers molded plastic parts for medical equipment; and GPS parts, saxophones, compact disc and mechanical chassis parts, nursing care bed parts, and recaps. Its products are used in industrial electric equipment, information and telecommunication appliance, automobile, household appliance, housing equipment, and nursing care products. Sanko Gosei Ltd. was founded in 1940 and is headquartered in Nanto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nanto",
        "zipcode": "939-1698",
        "website": "http://www.sankogosei.co.jp",
        "full_time_employees": 2337
    },
    "7988.T": {
        "short_name": "NIFCO INC",
        "long_name": "Nifco Inc.",
        "summary": "Nifco Inc. manufactures and sells industrial plastic parts and components in Japan, rest of Asia, North America, and Europe. It offers automotive parts and components for use in fuel, engine, exterior, interiors, and electric powertrain. The company also offers household equipment, such as drawer closers, push latches, earthquake-proof latches, and door dampers; consumer electronics/office automation products that include dampers, free-stop hinges, magnet latches, and push latches; and fashion/sport products, such as side release buckles, cord locks, and other buckles. In addition, it manufactures and sells beds, as well as imports and sells furniture products. The company was formerly known as Japan Industry Fastener Inc. and changed its name to Nifco Inc. in December 1970. Nifco Inc. was incorporated in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8522",
        "website": "http://www.nifco.com",
        "full_time_employees": null
    },
    "9WM.F": {
        "short_name": "NIFCO INC.",
        "long_name": "Nifco Inc.",
        "summary": "Nifco Inc. manufactures and sells industrial plastic parts and components in Japan, rest of Asia, North America, and Europe. It offers automotive parts and components for use in fuel, engine, exterior, interiors, and electric powertrain. The company also offers household equipment, such as drawer closers, push latches, earthquake-proof latches, and door dampers; consumer electronics/office automation products that include dampers, free-stop hinges, magnet latches, and push latches; and fashion/sport products, such as side release buckles, cord locks, and other buckles. In addition, it manufactures and sells beds, as well as imports and sells furniture products. The company was formerly known as Japan Industry Fastener Inc. and changed its name to Nifco Inc. in December 1970. Nifco Inc. was incorporated in 1946 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8522",
        "website": "http://www.nifco.com",
        "full_time_employees": null
    },
    "AKBIF": {
        "short_name": "AKEBONO BRAKE INDUSTRY CO",
        "long_name": "Akebono Brake Industry Co., Ltd.",
        "summary": "Akebono Brake Industry Co., Ltd. researches, develops, manufactures, and sells brakes, and related components and parts Japan, North America, Europe, and other Asian countries. The company offers disc brake calipers, disc brake pads, disc rotors, drum brake linings, drum brake shoes, wheel cylinders, drum-in-hat brakes, brake drums, sensors, etc. for automobiles; and disc brake calipers, disc brake pads, master cylinders, and others for motorcycles. It also provides brakes for rolling stock, including disc brakes and brake linings for bullet trains, brake linings for regular trains, disc brakes for monorail, brake linings for rolling stock, brake shoes for railroad trains, etc. In addition, the company offers brakes for industrial machinery, such as drum brakes for forklifts, clutch facings for car air conditioner units, brake shoes for elevators, etc., as well as disc brakes for wind turbine generators and rough terrain cranes. Further, it provides sensor products comprising accelerometers, angular rate sensors, and sensor clusters; vehicle behavior detection and wireless portable vibration measurement devices; and inclinometers, concrete filing detectors, light emitting inclination sensors/pockets, and earthquake detectors for long-wave seismic motors. The company was formerly known as Akebono Sekimen Kogyo Co., Ltd. and changed its name to Akebono Brake Industry Co., Ltd. in 1960. Akebono Brake Industry Co., Ltd. was founded in 1929 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8534",
        "website": "http://www.akebono-brake.com",
        "full_time_employees": 6499
    },
    "AKN.F": {
        "short_name": "AISIN CORP.",
        "long_name": "Aisin Corporation",
        "summary": "Aisin Corporation manufactures and sells automotive parts, and energy- and lifestyle-related products. It provides powertrain products comprising 1-motor hybrid transmission and eaxle products; chassis and vehicle safety systems, such as automated parking systems and electronically controlled brake systems; power sliding door systems and sunroof products; connected and sharing solutions; and repair and maintenance products. The company also offers energy solutions comprising ENEÂ·FARM, a system that generates electricity by extracting hydrogen from gas; gas heat pump air-conditioners; warm water shower-toilet seats; and peltier modules that are thermoelectric conversion devices, which function as heat pumps by sending direct current. In addition, it provides ILY-Ai, a multi-functional personal shopping mobility product for various user needs; fiber laser; and audio equipment. The company was incorporated in 1949 and is headquartered in Kariya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8650",
        "website": "http://www.aisin.com",
        "full_time_employees": null
    },
    "ASEKY": {
        "short_name": "AISIN CORPORATION UNSP ADR EACH",
        "long_name": "Aisin Corporation",
        "summary": "Aisin Corporation manufactures and sells automotive parts, and energy- and lifestyle-related products. It provides powertrain products comprising 1-motor hybrid transmission and eaxle products; chassis and vehicle safety systems, such as automated parking systems and electronically controlled brake systems; power sliding door systems and sunroof products; connected and sharing solutions; and repair and maintenance products. The company also offers energy solutions comprising ENEÂ·FARM, a system that generates electricity by extracting hydrogen from gas; gas heat pump air-conditioners; warm water shower-toilet seats; and peltier modules that are thermoelectric conversion devices, which function as heat pumps by sending direct current. In addition, it provides ILY-Ai, a multi-functional personal shopping mobility product for various user needs; fiber laser; and audio equipment. The company was incorporated in 1949 and is headquartered in Kariya, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8650",
        "website": "http://www.aisin.com",
        "full_time_employees": null
    },
    "BGT.F": {
        "short_name": "BRIDGESTONE CORP.",
        "long_name": "Bridgestone Corporation",
        "summary": "Bridgestone Corporation, together with its subsidiaries, manufactures and sells tires and rubber products. It operates through two segments, Tires and Diversified Products. The company offers tires and tire tubes for passenger cars, trucks, buses, construction and mining vehicles, industrial machinery, agricultural machinery, aircraft, motorcycles, scooters, etc.; automotive parts; retreading materials and services; automotive maintenance and repair services; tire raw materials; and other tire-related products. It also provides vehicle parts, polyurethane foam and related products, electronic precision parts, industrial materials-related products, civil engineering and construction materials and equipment, and others; commercial roofing materials and other materials; golf balls, golf clubs, and other sporting goods; bicycles, bicycle-related goods, and others, as well as finance and other services. In addition, the company offers maintenance, IT/sensing technology, and other solutions for the mining, fleet, and agricultural sectors. It has operations in Japan, the United States, China, the Asia Pacific, Europe, Russia, the Middle East, Africa, Oceania, and internationally. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8340",
        "website": "http://www.bridgestone.co.jp",
        "full_time_employees": 138036
    },
    "BGTA.F": {
        "short_name": "BRIDGESTONE ADR 1/2 O.N.",
        "long_name": "Bridgestone Corporation",
        "summary": "Bridgestone Corporation, together with its subsidiaries, manufactures and sells tires and rubber products. It operates through two segments, Tires and Diversified Products. The company offers tires and tire tubes for passenger cars, trucks, buses, construction and mining vehicles, industrial machinery, agricultural machinery, aircraft, motorcycles, scooters, etc.; automotive parts; retreading materials and services; automotive maintenance and repair services; tire raw materials; and other tire-related products. It also provides vehicle parts, polyurethane foam and related products, electronic precision parts, industrial materials-related products, civil engineering and construction materials and equipment, and others; commercial roofing materials and other materials; golf balls, golf clubs, and other sporting goods; bicycles, bicycle-related goods, and others, as well as finance and other services. In addition, the company offers maintenance, IT/sensing technology, and other solutions for the mining, fleet, and agricultural sectors. It has operations in Japan, the United States, China, the Asia Pacific, Europe, Russia, the Middle East, Africa, Oceania, and internationally. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8340",
        "website": "http://www.bridgestone.co.jp",
        "full_time_employees": 138036
    },
    "BRDCF": {
        "short_name": "BRIDGESTONE CORP",
        "long_name": "Bridgestone Corporation",
        "summary": "Bridgestone Corporation, together with its subsidiaries, manufactures and sells tires and rubber products. It operates through two segments, Tires and Diversified Products. The company offers tires and tire tubes for passenger cars, trucks, buses, construction and mining vehicles, industrial machinery, agricultural machinery, aircraft, motorcycles, scooters, etc.; automotive parts; retreading materials and services; automotive maintenance and repair services; tire raw materials; and other tire-related products. It also provides vehicle parts, polyurethane foam and related products, electronic precision parts, industrial materials-related products, civil engineering and construction materials and equipment, and others; commercial roofing materials and other materials; golf balls, golf clubs, and other sporting goods; bicycles, bicycle-related goods, and others, as well as finance and other services. In addition, the company offers maintenance, IT/sensing technology, and other solutions for the mining, fleet, and agricultural sectors. It has operations in Japan, the United States, China, the Asia Pacific, Europe, Russia, the Middle East, Africa, Oceania, and internationally. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8340",
        "website": "http://www.bridgestone.co.jp",
        "full_time_employees": 138036
    },
    "BRDCY": {
        "short_name": "BRIDGESTONE CORP",
        "long_name": "Bridgestone Corporation",
        "summary": "Bridgestone Corporation, together with its subsidiaries, manufactures and sells tires and rubber products. It operates through two segments, Tires and Diversified Products. The company offers tires and tire tubes for passenger cars, trucks, buses, construction and mining vehicles, industrial machinery, agricultural machinery, aircraft, motorcycles, scooters, etc.; automotive parts; retreading materials and services; automotive maintenance and repair services; tire raw materials; and other tire-related products. It also provides vehicle parts, polyurethane foam and related products, electronic precision parts, industrial materials-related products, civil engineering and construction materials and equipment, and others; commercial roofing materials and other materials; golf balls, golf clubs, and other sporting goods; bicycles, bicycle-related goods, and others, as well as finance and other services. In addition, the company offers maintenance, IT/sensing technology, and other solutions for the mining, fleet, and agricultural sectors. It has operations in Japan, the United States, China, the Asia Pacific, Europe, Russia, the Middle East, Africa, Oceania, and internationally. The company was founded in 1931 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-8340",
        "website": "http://www.bridgestone.co.jp",
        "full_time_employees": 138036
    },
    "DNO.F": {
        "short_name": "DENSO CORP.",
        "long_name": "DENSO Corporation",
        "summary": "DENSO Corporation manufactures and sells automotive components in Japan. It offers HVAC units, condensers, radiators, water-cooled intercoolers, and bus air conditioners; gasoline and diesel engine management systems, and engine-related products comprising gasoline direct injectors, high pressure pumps, variable cam timing systems, exhaust gas sensors, common rail systems, and spark plugs; and oil pressure control valves. The company also provides hybrid and electric car drive systems, power supply and related products, and starting system parts, such as alternators and starters; electric power steering motors, control brake motors, and electric control units (ECUs); windshield wiper systems, power window motors, engine control motors, and blower fans; motor generators and lithium-ion battery packs; cockpit products, such as humanÂ\u0096machine interface control units, meters, head-up displays, air-conditioning panels, and driver status monitors; and connected products and services, including telematics control units, electronic toll collection 2.0 on-board devices, and road-to-vehicle and vehicle-to-vehicle communication devices. In addition, it offers electronic systems, services, and platforms; vision sensors, millimeter-wave radar sensors, sonar sensors, driving-support ECUs, and sensors and ECUs for airbags; electronics products, including powertrain and body ECUs; retrofitted products, such as acceleration control devices; and microelectronic devices comprising power cards, semiconductor sensors, and application specific integrated circuit. Further, the company provides automated modules, vertical articulated and collaborative robots, IoT data servers, barcode and 2D handy terminals, and QR and RFID payment and recognition solutions. Additionally, it offers consulting and cloud services for horticultural facilities, as well as after-sale services; and in-vehicle refrigeration units. DENSO Corporation was founded in 1949 and is based in Kariya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8661",
        "website": "http://www.denso.com/global/en/",
        "full_time_employees": null
    },
    "DNOA.F": {
        "short_name": "DENSO CORP. ADR 4",
        "long_name": "DENSO Corporation",
        "summary": "DENSO Corporation manufactures and sells automotive components in Japan. It offers HVAC units, condensers, radiators, water-cooled intercoolers, and bus air conditioners; gasoline and diesel engine management systems, and engine-related products comprising gasoline direct injectors, high pressure pumps, variable cam timing systems, exhaust gas sensors, common rail systems, and spark plugs; and oil pressure control valves. The company also provides hybrid and electric car drive systems, power supply and related products, and starting system parts, such as alternators and starters; electric power steering motors, control brake motors, and electric control units (ECUs); windshield wiper systems, power window motors, engine control motors, and blower fans; motor generators and lithium-ion battery packs; cockpit products, such as humanÂ\u0096machine interface control units, meters, head-up displays, air-conditioning panels, and driver status monitors; and connected products and services, including telematics control units, electronic toll collection 2.0 on-board devices, and road-to-vehicle and vehicle-to-vehicle communication devices. In addition, it offers electronic systems, services, and platforms; vision sensors, millimeter-wave radar sensors, sonar sensors, driving-support ECUs, and sensors and ECUs for airbags; electronics products, including powertrain and body ECUs; retrofitted products, such as acceleration control devices; and microelectronic devices comprising power cards, semiconductor sensors, and application specific integrated circuit. Further, the company provides automated modules, vertical articulated and collaborative robots, IoT data servers, barcode and 2D handy terminals, and QR and RFID payment and recognition solutions. Additionally, it offers consulting and cloud services for horticultural facilities, as well as after-sale services; and in-vehicle refrigeration units. DENSO Corporation was founded in 1949 and is based in Kariya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8661",
        "website": "http://www.denso.com/global/en/",
        "full_time_employees": null
    },
    "DNZOF": {
        "short_name": "DENSO CORP",
        "long_name": "DENSO Corporation",
        "summary": "DENSO Corporation manufactures and sells automotive components in Japan. It offers HVAC units, condensers, radiators, water-cooled intercoolers, and bus air conditioners; gasoline and diesel engine management systems, and engine-related products comprising gasoline direct injectors, high pressure pumps, variable cam timing systems, exhaust gas sensors, common rail systems, and spark plugs; and oil pressure control valves. The company also provides hybrid and electric car drive systems, power supply and related products, and starting system parts, such as alternators and starters; electric power steering motors, control brake motors, and electric control units (ECUs); windshield wiper systems, power window motors, engine control motors, and blower fans; motor generators and lithium-ion battery packs; cockpit products, such as humanÂ\u0096machine interface control units, meters, head-up displays, air-conditioning panels, and driver status monitors; and connected products and services, including telematics control units, electronic toll collection 2.0 on-board devices, and road-to-vehicle and vehicle-to-vehicle communication devices. In addition, it offers electronic systems, services, and platforms; vision sensors, millimeter-wave radar sensors, sonar sensors, driving-support ECUs, and sensors and ECUs for airbags; electronics products, including powertrain and body ECUs; retrofitted products, such as acceleration control devices; and microelectronic devices comprising power cards, semiconductor sensors, and application specific integrated circuit. Further, the company provides automated modules, vertical articulated and collaborative robots, IoT data servers, barcode and 2D handy terminals, and QR and RFID payment and recognition solutions. Additionally, it offers consulting and cloud services for horticultural facilities, as well as after-sale services; and in-vehicle refrigeration units. DENSO Corporation was founded in 1949 and is based in Kariya, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8661",
        "website": "http://www.denso.com/global/en/",
        "full_time_employees": null
    },
    "DNZOY": {
        "short_name": "DENSO CORP",
        "long_name": "DENSO Corporation",
        "summary": "DENSO Corporation manufactures and sells automotive components in Japan. It offers HVAC units, condensers, radiators, water-cooled intercoolers, and bus air conditioners; gasoline and diesel engine management systems, and engine-related products comprising gasoline direct injectors, high pressure pumps, variable cam timing systems, exhaust gas sensors, common rail systems, and spark plugs; and oil pressure control valves. The company also provides hybrid and electric car drive systems, power supply and related products, and starting system parts, such as alternators and starters; electric power steering motors, control brake motors, and electric control units (ECUs); windshield wiper systems, power window motors, engine control motors, and blower fans; motor generators and lithium-ion battery packs; cockpit products, such as humanÂ\u0096machine interface control units, meters, head-up displays, air-conditioning panels, and driver status monitors; and connected products and services, including telematics control units, electronic toll collection 2.0 on-board devices, and road-to-vehicle and vehicle-to-vehicle communication devices. In addition, it offers electronic systems, services, and platforms; vision sensors, millimeter-wave radar sensors, sonar sensors, driving-support ECUs, and sensors and ECUs for airbags; electronics products, including powertrain and body ECUs; retrofitted products, such as acceleration control devices; and microelectronic devices comprising power cards, semiconductor sensors, and application specific integrated circuit. Further, the company provides automated modules, vertical articulated and collaborative robots, IoT data servers, barcode and 2D handy terminals, and QR and RFID payment and recognition solutions. Additionally, it offers consulting and cloud services for horticultural facilities, as well as after-sale services; and in-vehicle refrigeration units. DENSO Corporation was founded in 1949 and is based in Kariya, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": "448-8661",
        "website": "http://www.denso.com/global/en/",
        "full_time_employees": 170932
    },
    "FCV.F": {
        "short_name": "F.C.C. CO. LTD",
        "long_name": "F.C.C. Co., Ltd.",
        "summary": "F.C.C. Co., Ltd. engages in the manufacture and sale of clutches, facings, and catalysts for automobiles, motorcycles, and general-purpose machinery in Japan, the United States, Indonesia, India, Thailand, China, Brazil, and Vietnam. It operates through two segments, Motorcycle Clutches and Automobile Clutches. The company's clutches for motorcycles comprise wet-type multi-disc, wet-type multi-disc assisted and slipper, wet-type and dry centrifugal, and racing clutches, as well as pulleys for belt converters for use in motorcycles, scooters, road sports bikes, all-terrain vehicles (ATVs), and racing vehicles. Its automobiles clutches include automatic transmission, CVT, torque converter lockup, manual transmission, and 4WD vehicle clutches. In addition, the company's general-purpose clutches consist of FCCTRAC, a cam-type torque-sensitive limited slip differential for four-wheel ATVs; and hydraulic static transmissions for snow throwers and lawn mowers. It is also involved in the manufacture and sale of components and parts for motorcycles and automobiles. The company was formerly known as Fuji Chemical Co., Ltd. and changed its name to F.C.C. Co., Ltd. in July 1984. F.C.C. Co., Ltd. was founded in 1939 and is headquartered in Hamamatsu, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Hamamatsu",
        "zipcode": "431-1394",
        "website": "http://www.fcc-net.co.jp",
        "full_time_employees": null
    },
    "JTEKY": {
        "short_name": "JTEKT CORPORATION",
        "long_name": "JTEKT Corporation",
        "summary": "JTEKT Corporation manufactures and sells steering systems, driveline components, bearings, machine tools, electronic control devices, home accessory equipment, etc. It offers steering systems, such as electric power steering, hydraulic power steering, and unit components; driveline components, including driveshaft, propeller shaft, coupling, and Torsen limited slip differential products; wheels, such as hub units; engine and peripheral parts that include damper pulley; and transmission products, such as electric pump for idle-stop system and solenoid valves. The company also provides sensor systems comprising peripherals for social infrastructures; products for research and development field, including semiconductor transducers, load cells, DC amplifiers, and pressure transducer for welding guns and indicators; medical equipment, such as pressure sensors for dialyzers; and heat-resistant lithium-ion capacitors. In addition, it offers ball and roller bearings; and oil seals. Further, the company provides machine tools, such as cam and crankshaft grinders, cylindrical grinders, cutting machines, machining centers, gear skiving centers, and other machine tools; and mechatronic products. It offers its products under the JTEKT, KOYO, and TOYODA brands. The company operates in Japan, rest of Asia, Europe, North America, South America, Oceania, and internationally. JTEKT Corporation was founded in 1921 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "542-8502",
        "website": "http://www.jtekt.co.jp",
        "full_time_employees": null
    },
    "KOTMF": {
        "short_name": "KOITO MANUFACTURING CO LTD",
        "long_name": "Koito Manufacturing Co., Ltd.",
        "summary": "Koito Manufacturing Co., Ltd. manufactures and markets automotive lighting equipment, electrical equipment, and other products in Japan, North America, China, rest of Asia, Europe, and internationally. The company provides automotive lighting products and accessories, including LED, discharge, and halogen headlamps, as well as fog lamps; and signaling lamps/other lighting products comprising LED rear combination, side turn signal, and high-mounted stop lamps. It also offers aircraft lighting and other equipment, such as interior and exterior lights, and caution warning panels, as well as electrical, hydraulic, and mechanical equipment; and ship lights/special products consisting of LED marine lamps and destination indicators. In addition, it manufactures and markets electronic components, electrical devices, telecommunications equipment, precision machinery, miniature bulbs, electrical equipment, resin metal molds, railroad car control equipment, and road traffic signals and traffic control systems, as well as seats for railroad cars, etc. Further, the company provides transportation and logistics, and insurance agency services; and maintains traffic signals and safety equipment. Koito Manufacturing Co., Ltd. was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8711",
        "website": "http://www.koito.co.jp",
        "full_time_employees": null
    },
    "KOTMY": {
        "short_name": "KOITO MANUFACTURING CO LTD",
        "long_name": "Koito Manufacturing Co., Ltd.",
        "summary": "Koito Manufacturing Co., Ltd. manufactures and markets automotive lighting equipment, electrical equipment, and other products in Japan, North America, China, rest of Asia, Europe, and internationally. The company provides automotive lighting products and accessories, including LED, discharge, and halogen headlamps, as well as fog lamps; and signaling lamps/other lighting products comprising LED rear combination, side turn signal, and high-mounted stop lamps. It also offers aircraft lighting and other equipment, such as interior and exterior lights, and caution warning panels, as well as electrical, hydraulic, and mechanical equipment; and ship lights/special products consisting of LED marine lamps and destination indicators. In addition, it manufactures and markets electronic components, electrical devices, telecommunications equipment, precision machinery, miniature bulbs, electrical equipment, resin metal molds, railroad car control equipment, and road traffic signals and traffic control systems, as well as seats for railroad cars, etc. Further, the company provides transportation and logistics, and insurance agency services; and maintains traffic signals and safety equipment. Koito Manufacturing Co., Ltd. was founded in 1915 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-8711",
        "website": "http://www.koito.co.jp",
        "full_time_employees": null
    },
    "MBUMY": {
        "short_name": "MABUCHI MOTOR CO",
        "long_name": "Mabuchi Motor Co., Ltd.",
        "summary": "Mabuchi Motor Co., Ltd. researches, develops, manufactures, markets, and sells small electric motors. It provides motors for use in automotive appliances, light electric vehicles, precision and office equipment, home appliances and power tools, and car AV equipment; and brush motors. The company sells its products in Japan, North and Latin America, Europe, China, and the Asia Pacific. Mabuchi Motor Co., Ltd. was incorporated in 1926 and is headquartered in Matsudo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Matsudo",
        "zipcode": "270-2280",
        "website": "http://www.mabuchi-motor.co.jp",
        "full_time_employees": 21477
    },
    "NGK.F": {
        "short_name": "NGK SPARK PLUG",
        "long_name": "NGK Spark Plug Co., Ltd.",
        "summary": "NGK Spark Plug Co., Ltd., together with its subsidiaries, manufactures and sells spark plugs and related products for internal-combustion engines; and technical ceramics and applicable products in Japan. The company offers spark plugs, including plugs for aftermarket and original equipment, igniter plugs, and resister cables and covers; glow plugs comprising ceramic and metal type glow plugs, and glow controllers; and oxygen, NOx, temperature, and knock sensors. It also provides semiconductor components, such as IC packages for electronics and smart devices, as well as manufacturing parts for semiconductors; and medical products. In addition, the company offers fine ceramics, including wear-resistant parts, ultrasonic transducers and sensors, products for semiconductor manufacturing equipment, electric equipment products, and other ceramic products. Further, it provides cutting tools comprising ceramic, cermet, micro grain carbide, coated carbide, and cubic boron nitride grades, as well as SS and rotational tools. The company sells its spark and glow plugs under NGK brand; and sensors, semiconductor packages/substrates, cutting tools, and fine ceramics under NTK brand. NGK Spark Plug Co., Ltd. was founded in 1936 and is headquartered in Nagoya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "467-8525",
        "website": "http://www.ngkntk.co.jp/english",
        "full_time_employees": null
    },
    "NGKSF": {
        "short_name": "NGK SPARK PLUG CO",
        "long_name": "NGK Spark Plug Co., Ltd.",
        "summary": "NGK Spark Plug Co., Ltd., together with its subsidiaries, manufactures and sells spark plugs and related products for internal-combustion engines; and technical ceramics and applicable products in Japan. The company offers spark plugs, including plugs for aftermarket and original equipment, igniter plugs, and resister cables and covers; glow plugs comprising ceramic and metal type glow plugs, and glow controllers; and oxygen, NOx, temperature, and knock sensors. It also provides semiconductor components, such as IC packages for electronics and smart devices, as well as manufacturing parts for semiconductors; and medical products. In addition, the company offers fine ceramics, including wear-resistant parts, ultrasonic transducers and sensors, products for semiconductor manufacturing equipment, electric equipment products, and other ceramic products. Further, it provides cutting tools comprising ceramic, cermet, micro grain carbide, coated carbide, and cubic boron nitride grades, as well as SS and rotational tools. The company sells its spark and glow plugs under NGK brand; and sensors, semiconductor packages/substrates, cutting tools, and fine ceramics under NTK brand. NGK Spark Plug Co., Ltd. was founded in 1936 and is headquartered in Nagoya, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "467-8525",
        "website": "http://www.ngkntk.co.jp/english",
        "full_time_employees": null
    },
    "NGKSY": {
        "short_name": "NGK SPARK PLUG CO",
        "long_name": "NGK Spark Plug Co., Ltd.",
        "summary": "NGK Spark Plug Co., Ltd., together with its subsidiaries, manufactures and sells spark plugs and related products for internal-combustion engines; and technical ceramics and applicable products in Japan. The company offers spark plugs, including plugs for aftermarket and original equipment, igniter plugs, and resister cables and covers; glow plugs comprising ceramic and metal type glow plugs, and glow controllers; and oxygen, NOx, temperature, and knock sensors. It also provides semiconductor components, such as IC packages for electronics and smart devices, as well as manufacturing parts for semiconductors; and medical products. In addition, the company offers fine ceramics, including wear-resistant parts, ultrasonic transducers and sensors, products for semiconductor manufacturing equipment, electric equipment products, and other ceramic products. Further, it provides cutting tools comprising ceramic, cermet, micro grain carbide, coated carbide, and cubic boron nitride grades, as well as SS and rotational tools. The company sells its spark and glow plugs under NGK brand; and sensors, semiconductor packages/substrates, cutting tools, and fine ceramics under NTK brand. NGK Spark Plug Co., Ltd. was founded in 1936 and is headquartered in Nagoya, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "467-8525",
        "website": "http://www.ngkntk.co.jp/english",
        "full_time_employees": null
    },
    "NHK.F": {
        "short_name": "NHK SPRING CO. LTD",
        "long_name": "NHK Spring Co., Ltd.",
        "summary": "NHK Spring Co., Ltd. provides automobile, data communications, and industry and lifestyle products in Japan and internationally. The company operates through four segments: Automotive Suspension Springs; Automotive Seating; Precision Springs and Components; and Industrial Machinery and Equipment, and Others. Its automobile products include automotive suspension springs, such as coil springs, stabilizers/torsion bars, stabilinkers, and leaf springs; and power train products, and braking and exhaust systems, including valve springs, thin leaf springs for disk brakes, and clutch diaphragms/waved springs/arc springs. The company's automobile products also consist of sporty automotive seats, air suspension seats, axis locks for arm rest, power automotive seats, seals/sheets, screws and bolts, and control cables; motorcycle related chain tensioners; electric related products; thin leaf springs and precision stamped products; and motor cores and integrated metal substrates. Its data communication products comprise HDD-related products, such as suspensions, top covers, disk clamps, dual stage and co-located actuator suspensions, and VCM yokes; data communications and semiconductor device related products, including test sockets, full wafer probe cards, wire springs/precision machine items, lock hinges, and semiconductor process components; electric related products; microcontactor solutions, such as full wafer probe cards, probe cards for wafer and package TAB scans, test sockets, and probe units for flat panel displays and package substrates; and ultra-precision machining technologies. The company's industry and life style products include plant, spring mechanism, chemical, multi-story parking system, anti-counterfeiting, electronic components department, railway, maritime, and sports related products, and products related to various tests and design services. NHK Spring Co., Ltd. was incorporated in 1936 and is headquartered in Yokohama, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "236-0004",
        "website": "http://www.nhkspg.co.jp",
        "full_time_employees": null
    },
    "NI9.F": {
        "short_name": "NIPPON SHEET GLASS",
        "long_name": "Nippon Sheet Glass Company, Limited",
        "summary": "Nippon Sheet Glass Company, Limited manufactures and sells glass and glazing products worldwide. It operates through Architectural, Automotive, Technical Glass, and Other segments. The company offers architectural products, including solar control, thermal insulation, fire protection, noise control, safety/security, self-cleaning, decoration, solar energy, and antimicrobial glasses; glass systems; and coated or non-coated glasses the Pilkington brand. It also provides automotive products, such as automotive glass products for vehicle original equipment manufacturers; aftermarket glass replacement products; and glass solutions for specialized vehicles, which include commercial, off-road, bus and coach, marine, and rail. In addition, the company offers functional products under the MICROGLAS, Flake, Metashine, GLASFLAKE, and SILKYFLAKE names; absorbent glass mat (AGM) separator, a component for valve regulated lead-acid batteries; polyethylene (PE) separator, which allows the battery assembly line to run efficiently; and sleeve tubes, which are used as the separators for positive plate of clad type lead-acid batteries. Further, it provides SELFOC lens arrays and micro lenses; SELGUIDE, a linear LED light source for image scanning; sheet glasses for electronic office devices; and ultra-fine flat glasses. The company was formerly known as America Japan Sheet Glass Co., Ltd. and changed its name to Nippon Sheet Glass Company, Limited in 1931. Nippon Sheet Glass Company, Limited was incorporated in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6321",
        "website": "http://www.nsg.com",
        "full_time_employees": null
    },
    "NPSGY": {
        "short_name": "NIPPON SHEET GLASS CO",
        "long_name": "Nippon Sheet Glass Company, Limited",
        "summary": "Nippon Sheet Glass Company, Limited manufactures and sells glass and glazing products worldwide. It operates through Architectural, Automotive, Technical Glass, and Other segments. The company offers architectural products, including solar control, thermal insulation, fire protection, noise control, safety/security, self-cleaning, decoration, solar energy, and antimicrobial glasses; glass systems; and coated or non-coated glasses the Pilkington brand. It also provides automotive products, such as automotive glass products for vehicle original equipment manufacturers; aftermarket glass replacement products; and glass solutions for specialized vehicles, which include commercial, off-road, bus and coach, marine, and rail. In addition, the company offers functional products under the MICROGLAS, Flake, Metashine, GLASFLAKE, and SILKYFLAKE names; absorbent glass mat (AGM) separator, a component for valve regulated lead-acid batteries; polyethylene (PE) separator, which allows the battery assembly line to run efficiently; and sleeve tubes, which are used as the separators for positive plate of clad type lead-acid batteries. Further, it provides SELFOC lens arrays and micro lenses; SELGUIDE, a linear LED light source for image scanning; sheet glasses for electronic office devices; and ultra-fine flat glasses. The company was formerly known as America Japan Sheet Glass Co., Ltd. and changed its name to Nippon Sheet Glass Company, Limited in 1931. Nippon Sheet Glass Company, Limited was incorporated in 1918 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6321",
        "website": "http://www.nsg.com",
        "full_time_employees": null
    },
    "NPSKY": {
        "short_name": "NSK",
        "long_name": "NSK Ltd.",
        "summary": "NSK Ltd. manufactures and sells industrial machinery bearings, automotive products, and precision machinery and parts worldwide. Its products include ball bearings; roller bearings; bearing units; super precision bearings; bearings for steel industry, mining and construction, papermaking machines, and pumps and compressors; and bearings for special environments, including sanitary, corrosive, vacuum, clean, high-temperature, non-magnetic requirement, and dust-contaminated environments. The company also provides automotive products, which comprise chassis products, such as electric power steerings, steering column and intermediate shafts, and hub unit bearings; power train products comprising engine parts and electrical accessories; and drive train products consisting of automatic and manual transmission, products for motorcycles and all-terrain vehicles, half toroidal CVT POWERTOROS units, and differential gear and propeller shafts. In addition, it offers precision machine components, including ball screws, linear guides, monocarriers, XY tables, and spindles; and accessories, including ball screw support bearings, air bearings, and clean grease, as well as support units for heavy and light loads, machine tools, and small equipment. Further, the company provides megatorque motors; recruitment services; maintenance and repair services; design, development, sales, and maintenance services for computer systems and networks; insurance agency services; and sells industrial machinery bearings and automotive components, as well as manages and rents real estate properties. It serves agriculture, automotive, cement, food processing machinery, industrial motor, gearbox, injection molding machine, machine tool, medical device, mining and construction, motorcycle, office equipment, palm oil, papermaking machinery, pump and compressor, railway, semiconductor, steel, sugar, and wind turbine industries. NSK Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8560",
        "website": "http://www.nsk.com/index.html",
        "full_time_employees": 30378
    },
    "NSK.F": {
        "short_name": "NSK LTD.",
        "long_name": "NSK Ltd.",
        "summary": "NSK Ltd. manufactures and sells industrial machinery bearings, automotive products, and precision machinery and parts worldwide. Its products include ball bearings; roller bearings; bearing units; super precision bearings; bearings for steel industry, mining and construction, papermaking machines, and pumps and compressors; and bearings for special environments, including sanitary, corrosive, vacuum, clean, high-temperature, non-magnetic requirement, and dust-contaminated environments. The company also provides automotive products, which comprise chassis products, such as electric power steerings, steering column and intermediate shafts, and hub unit bearings; power train products comprising engine parts and electrical accessories; and drive train products consisting of automatic and manual transmission, products for motorcycles and all-terrain vehicles, half toroidal CVT POWERTOROS units, and differential gear and propeller shafts. In addition, it offers precision machine components, including ball screws, linear guides, monocarriers, XY tables, and spindles; and accessories, including ball screw support bearings, air bearings, and clean grease, as well as support units for heavy and light loads, machine tools, and small equipment. Further, the company provides megatorque motors; recruitment services; maintenance and repair services; design, development, sales, and maintenance services for computer systems and networks; insurance agency services; and sells industrial machinery bearings and automotive components, as well as manages and rents real estate properties. It serves agriculture, automotive, cement, food processing machinery, industrial motor, gearbox, injection molding machine, machine tool, medical device, mining and construction, motorcycle, office equipment, palm oil, papermaking machinery, pump and compressor, railway, semiconductor, steel, sugar, and wind turbine industries. NSK Ltd. was founded in 1914 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-8560",
        "website": "http://www.nsk.com/index.html",
        "full_time_employees": 30276
    },
    "SMO.F": {
        "short_name": "SUMITOMO EL.IND.",
        "long_name": "Sumitomo Electric Industries, Ltd.",
        "summary": "Sumitomo Electric Industries, Ltd. manufactures and sells electric wires and cables worldwide. It operates through five segments: Automotive, Infocommunications, Electronics, Environment and Energy, and Industrial Materials and Others. The company offers wiring harnesses and electrical components; steel cords for tire reinforcement; steel wires for springs; wiring materials; optical lenses for infrared devices; abrasion-resistant parts/materials; heat shrink and heat-resistant tubing/tapes; magnet wires; aluminum bars/wires; spinel products; products for electronic devices; sintered parts; and EV quick-charger connector assemblies. It also provides fibers and optical fiber cables; optical connectors; optical fiber couplers and splitter modules; optical termination and splice boxes, and closures; optical fiber amplifiers; devices for large/small scale communication uses; optical transceiver modules and devices, and wireless devices; H-PCF; EO/OE converters; coaxial cables, flat components, insulated electronic and spiral shielded wires, cables, and flexible printed circuits; optical lenses for infrared devices; fusion splicers and tools; and data center solutions. In addition, the company offers intelligent transport system and IT asset management/security products; CATV systems; contents distribution network; and wind profiler radars. Further, it provides plated and alloy wires, fluoroplastics-coated materials, sintered ZnS lenses, semiconductors substrates, thermal control devices, and tool-related products; superconducting products; various energy and environment systems; products for railway and transport machinery; steel wires; polytetrafluoroethylene porous material; Celmet, a porous metal; cutting and plastic working tools; and alloy parts. The company was formerly known as Sumitomo Electric Wire & Cable Works and changed its name to Sumitomo Electric Industries, Ltd. in 1939. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://www.sei.co.jp",
        "full_time_employees": 283910
    },
    "SMO1.F": {
        "short_name": "SUMITOMO EL.IND.ADR",
        "long_name": "Sumitomo Electric Industries, Ltd.",
        "summary": "Sumitomo Electric Industries, Ltd. manufactures and sells electric wires and cables worldwide. It operates through five segments: Automotive, Infocommunications, Electronics, Environment and Energy, and Industrial Materials and Others. The company offers wiring harnesses and electrical components; steel cords for tire reinforcement; steel wires for springs; wiring materials; optical lenses for infrared devices; abrasion-resistant parts/materials; heat shrink and heat-resistant tubing/tapes; magnet wires; aluminum bars/wires; spinel products; products for electronic devices; sintered parts; and EV quick-charger connector assemblies. It also provides fibers and optical fiber cables; optical connectors; optical fiber couplers and splitter modules; optical termination and splice boxes, and closures; optical fiber amplifiers; devices for large/small scale communication uses; optical transceiver modules and devices, and wireless devices; H-PCF; EO/OE converters; coaxial cables, flat components, insulated electronic and spiral shielded wires, cables, and flexible printed circuits; optical lenses for infrared devices; fusion splicers and tools; and data center solutions. In addition, the company offers intelligent transport system and IT asset management/security products; CATV systems; contents distribution network; and wind profiler radars. Further, it provides plated and alloy wires, fluoroplastics-coated materials, sintered ZnS lenses, semiconductors substrates, thermal control devices, and tool-related products; superconducting products; various energy and environment systems; products for railway and transport machinery; steel wires; polytetrafluoroethylene porous material; Celmet, a porous metal; cutting and plastic working tools; and alloy parts. The company was formerly known as Sumitomo Electric Wire & Cable Works and changed its name to Sumitomo Electric Industries, Ltd. in 1939. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://www.sei.co.jp",
        "full_time_employees": null
    },
    "SMTOF": {
        "short_name": "SUMITOMO ELECTRIC INDUSTRIES",
        "long_name": "Sumitomo Electric Industries, Ltd.",
        "summary": "Sumitomo Electric Industries, Ltd. manufactures and sells electric wires and cables worldwide. It operates through five segments: Automotive, Infocommunications, Electronics, Environment and Energy, and Industrial Materials and Others. The company offers wiring harnesses and electrical components; steel cords for tire reinforcement; steel wires for springs; wiring materials; optical lenses for infrared devices; abrasion-resistant parts/materials; heat shrink and heat-resistant tubing/tapes; magnet wires; aluminum bars/wires; spinel products; products for electronic devices; sintered parts; and EV quick-charger connector assemblies. It also provides fibers and optical fiber cables; optical connectors; optical fiber couplers and splitter modules; optical termination and splice boxes, and closures; optical fiber amplifiers; devices for large/small scale communication uses; optical transceiver modules and devices, and wireless devices; H-PCF; EO/OE converters; coaxial cables, flat components, insulated electronic and spiral shielded wires, cables, and flexible printed circuits; optical lenses for infrared devices; fusion splicers and tools; and data center solutions. In addition, the company offers intelligent transport system and IT asset management/security products; CATV systems; contents distribution network; and wind profiler radars. Further, it provides plated and alloy wires, fluoroplastics-coated materials, sintered ZnS lenses, semiconductors substrates, thermal control devices, and tool-related products; superconducting products; various energy and environment systems; products for railway and transport machinery; steel wires; polytetrafluoroethylene porous material; Celmet, a porous metal; cutting and plastic working tools; and alloy parts. The company was formerly known as Sumitomo Electric Wire & Cable Works and changed its name to Sumitomo Electric Industries, Ltd. in 1939. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://www.sei.co.jp",
        "full_time_employees": null
    },
    "SMTOY": {
        "short_name": "SUMITOMO ELECTRIC INDUSTRIES",
        "long_name": "Sumitomo Electric Industries, Ltd.",
        "summary": "Sumitomo Electric Industries, Ltd. manufactures and sells electric wires and cables worldwide. It operates through five segments: Automotive, Infocommunications, Electronics, Environment and Energy, and Industrial Materials and Others. The company offers wiring harnesses and electrical components; steel cords for tire reinforcement; steel wires for springs; wiring materials; optical lenses for infrared devices; abrasion-resistant parts/materials; heat shrink and heat-resistant tubing/tapes; magnet wires; aluminum bars/wires; spinel products; products for electronic devices; sintered parts; and EV quick-charger connector assemblies. It also provides fibers and optical fiber cables; optical connectors; optical fiber couplers and splitter modules; optical termination and splice boxes, and closures; optical fiber amplifiers; devices for large/small scale communication uses; optical transceiver modules and devices, and wireless devices; H-PCF; EO/OE converters; coaxial cables, flat components, insulated electronic and spiral shielded wires, cables, and flexible printed circuits; optical lenses for infrared devices; fusion splicers and tools; and data center solutions. In addition, the company offers intelligent transport system and IT asset management/security products; CATV systems; contents distribution network; and wind profiler radars. Further, it provides plated and alloy wires, fluoroplastics-coated materials, sintered ZnS lenses, semiconductors substrates, thermal control devices, and tool-related products; superconducting products; various energy and environment systems; products for railway and transport machinery; steel wires; polytetrafluoroethylene porous material; Celmet, a porous metal; cutting and plastic working tools; and alloy parts. The company was formerly known as Sumitomo Electric Wire & Cable Works and changed its name to Sumitomo Electric Industries, Ltd. in 1939. The company was founded in 1897 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0041",
        "website": "http://www.sei.co.jp",
        "full_time_employees": null
    },
    "STAA.F": {
        "short_name": "STANLEY EL.",
        "long_name": "Stanley Electric Co., Ltd.",
        "summary": "Stanley Electric Co., Ltd., together with its subsidiaries, manufacture, sells, and import/export of automotive and other light bulbs. It operates through Automotive Equipment, Electronic Components, and Applied Electronic Products segments. The Automotive Equipment Business segment offers LED, HID, and halogen headlamps; rear combination, turn signal, and fog lamps; and automotive LED and light bulbs, etc. The Electronic Components Business segment provides ultraviolet (UV), visible light, and infrared LEDs; optical sensors, liquid crystal display (LCD) devices, and UV cold cathode lamps; and sub miniature lamps, etc. The Applied Electronic Products Business segment offers LED lighting for landscape, road, etc.; operating panels; backlighting units for LCDs; flash units for cameras; and sensors for automobiles, etc. The company also offers measuring instruments, medical equipment, and other equipment, as well as develops and sells software. It operates in Japan, the Americas, the Asia-Pacific, China, and internationally. Stanley Electric Co., Ltd. was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "153-8636",
        "website": "http://www.stanley.co.jp",
        "full_time_employees": null
    },
    "STAEF": {
        "short_name": "STANLEY ELECTRIC CO",
        "long_name": "Stanley Electric Co., Ltd.",
        "summary": "Stanley Electric Co., Ltd., together with its subsidiaries, manufacture, sells, and import/export of automotive and other light bulbs. It operates through Automotive Equipment, Electronic Components, and Applied Electronic Products segments. The Automotive Equipment Business segment offers LED, HID, and halogen headlamps; rear combination, turn signal, and fog lamps; and automotive LED and light bulbs, etc. The Electronic Components Business segment provides ultraviolet (UV), visible light, and infrared LEDs; optical sensors, liquid crystal display (LCD) devices, and UV cold cathode lamps; and sub miniature lamps, etc. The Applied Electronic Products Business segment offers LED lighting for landscape, road, etc.; operating panels; backlighting units for LCDs; flash units for cameras; and sensors for automobiles, etc. The company also offers measuring instruments, medical equipment, and other equipment, as well as develops and sells software. It operates in Japan, the Americas, the Asia-Pacific, China, and internationally. Stanley Electric Co., Ltd. was founded in 1920 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "153-8636",
        "website": "http://www.stanley.co.jp",
        "full_time_employees": null
    },
    "TY7.F": {
        "short_name": "TOYOTA BOSHOKU CORP.",
        "long_name": "Toyota Boshoku Corporation",
        "summary": "Toyota Boshoku Corporation manufactures and sells automotive interior systems and products, automotive filter and power train equipment components, automotive components, and fabric goods in Japan. The company offers seats, door trims, and leather instrument panels; headliners, such as ceiling-mounted rear entertainment systems and panorama roofs; headliner and instrument panel mystic illumination, and illuminated twin consoles; and floor carpets, tonneau covers, package trays, electric sunshade systems, and silencers. It also offers textile components comprising seat fabrics, curtain-shield airbags, seatbelt webbings, and partition nets; and exterior components consisting of bumpers, fender liners, and engine undercovers. In addition, the company provides filter products, including air and oil filters; anti-allergen and deodorizing cabin, pollen removal cabin, anti-bacterial and mould resistant cabin, and clean air filters; and hydrocarbon absorption filters. Further, it offers air induction part products, such as air induction systems and cleaners, intake manifolds, and cylinder head covers; fuel cell part products comprising stack manifolds and separators; and motor core components for hybrid systems, fluid filters for automatic transmission, oil mist separators, revolving sensors, ignition coils for motorcycles, and ABS coils. Additionally, the company provides aircraft and railway seats, as well as fabric wall decorations for home interior applications. Toyota Boshoku Corporation was founded in 1918 and is based in Kariya, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Kariya",
        "zipcode": null,
        "website": "http://www.toyota-boshoku.com/jp",
        "full_time_employees": null
    },
    "TYR.F": {
        "short_name": "TOYO TIRE CORP.",
        "long_name": "Toyo Tire Corporation",
        "summary": "Toyo Tire Corporation manufactures and sells tires in Japan and internationally. The company provides tires for passenger vehicles, trucks and buses, construction machinery, and industrial trucks, as well as SUVs, CUVs, and pickup trucks under the Toyo Tires, Nitto, and Silverstone brands. It also offers automotive parts, including engine, motor, member, differential, strut, and exhaust mounts; bushes and couplings; and dynamic dampers; constant verlocity universal joint boots; and air suspensions. The company was formerly known as Toyo Tire & Rubber Co., Ltd. and changed its name to Toyo Tire Corporation in January 2019. Toyo Tire Corporation was incorporated in 1943 and is headquartered in Itami City, Japan",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Itami",
        "zipcode": "664-0847",
        "website": "http://www.toyotires.co.jp",
        "full_time_employees": 11258
    },
    "V94.F": {
        "short_name": "MABUCHI MOTOR LTD",
        "long_name": "Mabuchi Motor Co., Ltd.",
        "summary": "Mabuchi Motor Co., Ltd. researches, develops, manufactures, markets, and sells small electric motors. It provides motors for use in automotive appliances, light electric vehicles, precision and office equipment, home appliances and power tools, and car AV equipment; and brush motors. The company sells its products in Japan, North and Latin America, Europe, China, and the Asia Pacific. Mabuchi Motor Co., Ltd. was incorporated in 1926 and is headquartered in Matsudo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Matsudo",
        "zipcode": "270-2280",
        "website": "http://www.mabuchi-motor.co.jp",
        "full_time_employees": 21477
    },
    "YORUF": {
        "short_name": "YOKOHAMA RUBBER CO",
        "long_name": "The Yokohama Rubber Company, Limited",
        "summary": "The Yokohama Rubber Company, Limited manufactures and sells tires, industrial products, and golf products in Japan, the United States, India, China, the Philippines, and internationally. It operates through Tires, Multiple Business (MB), and Alliance Tire Group (ATG) segments. The Tires segment offers tires for passenger cars and light trucks; trucks and buses; construction and mining equipment; and motor sports, as well as tire tubes, aluminium alloy wheels, and other peripheral products. The MB segment provides high-pressure hoses, conveyor belts, marine hoses and pneumatic marine fenders, and antiseismic products and roadway joints. It also provides sealants and adhesives, aircraft fixtures, and components under the Hamatite brand. The ATG segment provides tires for agricultural, industrial, construction, and forestry machinery. The company also markets golf equipment and services under the PRGR brand. It sells its products primarily under the ADVAN, BluEarth, iceGUARD, GEOLANDAR, and YOKOHAMA brand names. The Yokohama Rubber Company, Limited was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8685",
        "website": "http://www.y-yokohama.com",
        "full_time_employees": 27252
    },
    "YORUY": {
        "short_name": "YOKOHAMA RUBBER CO",
        "long_name": "The Yokohama Rubber Company, Limited",
        "summary": "The Yokohama Rubber Company, Limited manufactures and sells tires, industrial products, and golf products in Japan, the United States, India, China, the Philippines, and internationally. It operates through Tires, Multiple Business (MB), and Alliance Tire Group (ATG) segments. The Tires segment offers tires for passenger cars and light trucks; trucks and buses; construction and mining equipment; and motor sports, as well as tire tubes, aluminium alloy wheels, and other peripheral products. The MB segment provides high-pressure hoses, conveyor belts, marine hoses and pneumatic marine fenders, and antiseismic products and roadway joints. It also provides sealants and adhesives, aircraft fixtures, and components under the Hamatite brand. The ATG segment provides tires for agricultural, industrial, construction, and forestry machinery. The company also markets golf equipment and services under the PRGR brand. It sells its products primarily under the ADVAN, BluEarth, iceGUARD, GEOLANDAR, and YOKOHAMA brand names. The Yokohama Rubber Company, Limited was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8685",
        "website": "http://www.y-yokohama.com",
        "full_time_employees": 27252
    },
    "YRB.F": {
        "short_name": "YOKOHAMA RUBBER",
        "long_name": "The Yokohama Rubber Company, Limited",
        "summary": "The Yokohama Rubber Company, Limited manufactures and sells tires, industrial products, and golf products in Japan, the United States, India, China, the Philippines, and internationally. It operates through Tires, Multiple Business (MB), and Alliance Tire Group (ATG) segments. The Tires segment offers tires for passenger cars and light trucks; trucks and buses; construction and mining equipment; and motor sports, as well as tire tubes, aluminium alloy wheels, and other peripheral products. The MB segment provides high-pressure hoses, conveyor belts, marine hoses and pneumatic marine fenders, and antiseismic products and roadway joints. It also provides sealants and adhesives, aircraft fixtures, and components under the Hamatite brand. The ATG segment provides tires for agricultural, industrial, construction, and forestry machinery. The company also markets golf equipment and services under the PRGR brand. It sells its products primarily under the ADVAN, BluEarth, iceGUARD, GEOLANDAR, and YOKOHAMA brand names. The Yokohama Rubber Company, Limited was founded in 1917 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-8685",
        "website": "http://www.y-yokohama.com",
        "full_time_employees": 27252
    }
}