{"3059.T": {"short_name": "HIRAKI CO.LTD", "long_name": "Hiraki Co.,Ltd.", "summary": "Hiraki Co.,Ltd. engages in the shoes and footwear planning and development, mail-order, store, and wholesale clothing businesses in Japan. The company provides various shoes, including sneakers, casual and business shoes, boots, pumps, sandals, beach home sandals, rain shoes and boots, school shoes, and work shoes for women and men; kids and junior's shoes; and baby shoes. It also offers a range of wear products comprising tops, bottoms, room wear, inners, leg wear, sportswear/swimsuits, school wear, bra and shorts sets, underwear, sanitary shorts, and bodysuit girdles for women, kids and juniors, and men. In addition, the company provides interior goods, beddings, covers, rugs, carpets, curtains, cushions, slippers, and others; and fashion accessories, bath and toilet products, cleaning/laundry supplies, towels, kitchen utensils, storage supplies, stationery and household goods, bags, beauty and hygiene products, and others, as well as umbrellas, parasols, and raincoats. The company was founded in 1978 and is headquartered in Kobe, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kobe"}, "3550.T": {"short_name": "STUDIO ATAO CO LTD", "long_name": "STUDIO ATAO Co., Ltd.", "summary": "STUDIO ATAO Co., Ltd. engages in the planning and sale of bags and wallets in Japan. It also administers and manages stores; produces and operates Internet shops; and plans and produces paper media, including illustrations, as well as engages in character planning, planning, and production of promotional goods, such as novelties. The company was founded in 2005 and is headquartered in Kobe, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kobe"}, "7422.T": {"short_name": "TOHO LAMAC CO", "long_name": "Toho Lamac Co., Ltd.", "summary": "Toho Lamac Co., Ltd. engages in the trading of shoes. The company offers sneakers, synthetic-leather shoes, and sports shoes for men, women, and children. It markets its products under the SHOEZOO, hocco, SONIA PARENTI, &Rouge, Fit Partner, B.C.COMPANY, NICE CLAUP, mc marie claire, apricot, keds, LEON, and ROYAL ALBERT HALL brand names. The company was formerly known as Toho Rubber Industries Co., Ltd. and changed its name to Toho Lamac Co., Ltd. in January 1988. Toho Lamac Co., Ltd. was founded in 1958 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7829.T": {"short_name": "SAMANTHA THAVASA JAPAN LIMITED", "long_name": "Samantha Thavasa Japan Limited", "summary": "Samantha Thavasa Japan Limited primarily engages in the planning, manufacture, and sale of handbags and jewelry. The company offers wallets, card cases, jewelry, makeup bags, golf wear, gifts, and small accessories, as well as sweets. It sells its products under the brand names of Samantha Thavasa, Samantha Thavasa Deluxe, Samantha Vega, Samantha Kingz, Samantha Thavasa Petit Choice, Samantha Tiara, Samantha Tiara Bridal, Samantha Silva by Samantha Tiara, Samantha Silva Bridal, Samantha Thavasa under25, No.7 Samantha Thavasa, Samantha Thavasa Anniversary, and Sweets Samantha Thavasa. The company sells its products through its stores in Japan, South Korea, China, Singapore, Taiwan, and the United States. Samantha Thavasa Japan Limited was founded in 1994 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7932.T": {"short_name": "NIPPI INC", "long_name": "Nippi,Incorporated", "summary": "Nippi,Incorporated, together with its subsidiaries, manufactures and sells collagen casings, gelatin and collagen peptides, cosmetics and functional foods, functional polymers, and life science products in Japan and internationally. The company offers collagen casings for use in various fields, including foods, medicines and pharmaceuticals, and cosmetics; gelatin, which is used in food products, pharmaceutical products, photo films, etc.; and leather products for the automotive industry. It also develops cosmetics and functional foods with collagen; offers Nippi Linker, a vinyl chloride resin, which is primarily used for electric wires and masking films; and provides Nippi V Foam, a foam made of vinyl chloride for welder processing that is used in cars, quilt products, and novelty goods. In addition, the company engages in real estate leasing activities; and provides life science products that include laminin, lab equipment and supplies, and reagents, as well as contract services and bovine spongiform encephalopathy test kits. The company was formerly known as The Japan Leather Mfg. Co., Ltd. and changed its name to Nippi,Incorporated in February 1974. Nippi,Incorporated was founded in 1907 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7936.T": {"short_name": "ASICS CORP", "long_name": "ASICS Corporation", "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kobe"}, "7938.T": {"short_name": "REGAL CORPORATION", "long_name": "Regal Corporation", "summary": "Regal Corporation manufactures, retails, wholesales, and repairs various types of shoes for men and women. It also sells its products online. The company was formerly known as Nippon Shoe Co., Ltd. and changed its name to Regal Corporation in October 1990. Regal Corporation was founded in 1902 and is headquartered in Urayasu, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Urayasu"}, "8115.T": {"short_name": "MOONBAT CO LTD", "long_name": "MOONBAT Co.,Ltd.", "summary": "Moonbat Co.,Ltd. engages in the planning, manufacture, import, purchase, and sale of umbrellas, clothing, fur, leather, jewelry, and hats in Japan. The company was founded in 1885 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "ASCCF": {"short_name": "ASICS CORP", "long_name": "ASICS Corporation", "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kobe"}, "ASCCY": {"short_name": "ASICS CORP", "long_name": "ASICS Corporation", "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Kobe"}, "ASI1.F": {"short_name": "ASICS CORP.", "long_name": "ASICS Corporation", "summary": "ASICS Corporation manufactures and sells sports goods in Japan, the Americas, Europe, Oceania, Southeast and South Asia, and internationally. It offers sports shoes, apparel, and equipment. The company sells its products under the ASICS, ASICSTIGER, and Onitsuka Tiger brands through 989 retail stores, as well as through online. ASICS Corporation was founded in 1949 and is headquartered in Kobe, Japan.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kobe"}}