{"2196.T": {"short_name": "ESCRIT INC", "long_name": "Escrit Inc.", "summary": "Escrit Inc. engages in the bridal business in Japan. The company plans, performs, and manages wedding ceremonies and receptions. It is also involved in the construction and real estate business. The company was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2198.T": {"short_name": "IKK INC", "long_name": "IKK Inc.", "summary": "IKK Inc. provides wedding, reception planning, and coordination services in Japan. It also offers funeral, nursing care, and other services, as well as operates private nursing homes. The company was founded in 1995 and is headquartered in Imari, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Imari"}, "2300.T": {"short_name": "KYOKUTO CO LTD", "long_name": "Kyokuto Co., Ltd.", "summary": "Kyokuto Co., Ltd. operates in the cleaning industry primarily in Japan. The company offers detergent under the EM wash name. It operates a network of 685 stores. The company was founded in 1964 and is based in Fukuoka, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukuoka"}, "2305.T": {"short_name": "STUDIO ALICE", "long_name": "STUDIO ALICE Co.,Ltd.", "summary": "STUDIO ALICE Co.,Ltd. operates children's photo studios in Japan. The company offers maternity photo, new born photo, hundred days celebration, peach/double fifth festival, half birthday, birthday photo, happy birthday Shichigosan, admission/enrollment/graduation, 1/2 coming-of-age ceremony, thirteen celebration, coming-of-age ceremony, bridal, family photo/longevity celebration, portrait photo, Disney character shooting, and business trip shooting services. It also provides print, album, photo mount, display photo, postcard, photography accessories, and other products. The company was founded in 1974 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "2344.T": {"short_name": "HEIAN CEREMONY SERVICE CO", "long_name": "Heian Ceremony Service Co.,Ltd.", "summary": "Heian Ceremony Service Co., Ltd. provides wedding and funeral services in Japan. The company offers wedding and various kinds of banquets, wedding and general beauty, photo, flower, print, and after-sales service. It also operates funeral halls. In addition, the company operates four home care sales offices in Hiratsuka, Fujisawa, Chigasaki, and Odawara; three group houses; and three day service and two elderly rental apartments. Further, it manages a mutual benefit society and subscribers to ceremonial funerary business operators; and engages in cooking, funeral gift return, invitation letter, photograph of deceased businesses, etc., as well as develops private brand products. The company was founded in 1969 and is headquartered in Hiratsuka, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Hiratsuka"}, "2406.T": {"short_name": "ARTE SALON HOLDINGS INC", "long_name": "Arte Salon Holdings,Inc.", "summary": "Arte Salon Holdings,Inc., through its subsidiaries, operates and franchises salons. It operates a chain of 323 stores in Japan and internationally. The company was formerly known as ARTEJAPAN CO., LTD. and changed its name to ARTE Salon Holdings, Inc. in July 2006. ARTE Salon Holdings, Inc. was founded in 1988 and is headquartered in Yokohama, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Yokohama"}, "2418.T": {"short_name": "TSUKADA GLOBAL HOLDINGS INC", "long_name": "TSUKADA GLOBAL HOLDINGS Inc.", "summary": "TSUKADA GLOBAL HOLDINGS Inc., through its subsidiaries, engages in the planning, development, and ownership of guest houses, hotels, and restaurants in Japan and internationally. It operates through three segments: Wedding business, Hotel business, and Wellness & Relaxation business. The company offers guest house, hotel, and overseas wedding services through its 23 wedding venues. It also provides wedding attire, beauty care and hair makeup, wedding ceremony and reception, and photography and videography services. In addition, the company manages and operates hotels and restaurants under the InterContinental Tokyo Bay, The Strings by InterContinental Tokyo, The Strings Hotel Yagoto Nagoya, The Strings Hotel Nagoya, VINO BUONO, Mangiare, and SHIKITEI names. Further, it operates 36 reflexology salons and a reflexology school under the Queensway name, as well as Beauty & Relax SPA-HERBS, a spa complex; and BEST STYLE FITNESS, a fitness club. The company was formerly known as Best Bridal Inc. and changed its name to TSUKADA GLOBAL HOLDINGS Inc. in July 2014. TSUKADA GLOBAL HOLDINGS Inc. was founded in 1995 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2424.T": {"short_name": "BRASS CORPORATION", "long_name": "Brass Corporation", "summary": "Brass Corporation provides various services in arranging the wedding and reception in Japan. The company also offers and rents bridal gowns and formalwear; and arranges MOCHI-TSUKI, a live performance event at Japanese celebrations. Brass Corporation was founded in 1998 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "2437.T": {"short_name": "SHINWA WISE HLDGS CO LTD", "long_name": "Shinwa Wise Holdings Co.,Ltd.", "summary": "Shinwa Wise Holdings Co.,Ltd., together with its subsidiaries, operates as an auction company in Japan. The company plans and manages public auctions and Internet public auctions focusing on art works and jewelry; operates an art trade gallery; develops and sells solar power plants; imports and sells coconut husk; sells asset defense diamonds; and buys, manages, rents, and sells real estate properties. It also engages in insurance, microfinance, cultural support, and virtual currency block chain trading activities, as well as undertakes afforestation projects and support projects for medical institutions. The company was formerly known as Shinwa Art Auction Co.,Ltd. and changed its name to Shinwa Wise Holdings Co.,Ltd. in December 2017. Shinwa Wise Holdings Co.,Ltd. was founded in 1989 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2438.T": {"short_name": "ASUKANET CO LIMITED", "long_name": "Asukanet Co., Ltd.", "summary": "Asukanet Co., Ltd. provides personal publishing, memorial design, and aerial imaging services in Japan. The company offers personalized photobooks in small lots, such as book by on-demand printing, as well as related software development; funeral photographs for funeral companies and homes; and aerial display related services. Asukanet Co., Ltd. was founded in 1995 and is headquartered in Hiroshima, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Hiroshima"}, "2485.T": {"short_name": "TEAR CORPORATION", "long_name": "Tear Corporation", "summary": "Tear Corporation provides funeral services in Japan. The company operates funeral centers primarily in Chubu, Kansai, and Kanto districts. It also offers subcontracting funeral and legal requirements at the hall, as well as funeral and legal requirements at temples, private homes, and public places; and follow-ups according to the consultation content of the bereaved families. Tear Corporation was founded in 1997 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "3041.T": {"short_name": "BEAUTY KADAN CO.LTD", "long_name": "Beauty Kadan Co., Ltd.", "summary": "Beauty Kadan Co., Ltd. operates in the funeral flower altar and flower wholesale businesses in Japan. It is involved in the planning, proposal, and logistics of fresh flowers, as well as bridal flower business. The company sells flowers primarily to retail florists and flower departments of funeral companies. Beauty Kadan Co., Ltd. was founded in 1974 and is headquartered in Kumamoto, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kumamoto"}, "4331.T": {"short_name": "TAKE & GIVE NEEDS CO", "long_name": "Take and Give. Needs Co., Ltd", "summary": "Take and Give. Needs Co., Ltd. engages in the wedding business primarily in Japan. The company is involved in planning and management of overseas and domestic resort weddings; travel planning; celebrity and haute couture wedding; and event and decoration businesses. It also engages in the sale of products and services for honeymoon and anniversary travel; provides loan and financial cooperation for weddings; and designs, produces, sells, and rents bridal and formal wears. In addition, the company is involved in the operation of nursery, restaurants, and hotels, as well as provides consulting services. Take and Give. Needs Co., Ltd. was founded in 1998 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4679.T": {"short_name": "TAYA CO LTD", "long_name": "TAYA Co.,Ltd.", "summary": "TAYA Co.,Ltd. operates beauty salons. As of March 31, 2018, it operated 126 salons and 1 retail shop. The company was founded in 1964 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4696.T": {"short_name": "WATABE WEDDING COR", "long_name": "Watabe Wedding Corporation", "summary": "Watabe Wedding Corporation provides wedding and travel services for wedding participants in Japan and internationally. The company operates wedding facilities; produces and sells wedding dresses, etc.; rents wedding related attires and formal wear for coming-of-age ceremonies, various parties, etc.; and provides clothing and photography integrated services by combining beauty care, dressing, and studio portraits. It also offers wedding related services, such as consultations for wedding halls; arranging wedding ceremonies; planning and directing wedding receptions; and bridal goods, including furniture, beddings, jewelries, and gems. The company was formerly known as Watabe Clothing Store Co., Ltd. and changed its name to Watabe Wedding Corporation in August 1996. Watabe Wedding Corporation was founded in 1953 and is headquartered in Kyoto, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kyoto"}, "4JA.F": {"short_name": "JAPAN ANIMAL REF.MED.CEN.", "long_name": "Japan Animal Referral Medical Center Co., Ltd.", "summary": "Japan Animal Referral Medical Center Co., Ltd. owns and operates medical centers for animals in Japan. The company provides veterinary hospital conducting advanced medical care service for dogs and cats. The company's medical center comprises cardiology, respiratory, urology, gastroenterology, oncology, neurology, orthopedics, ophthalmology, radiology and imaging, and anesthesiology departments. It also provides professional training services, such as clinical training and treatment; and conducts research and development projects, including genetic testing, immunotherapy, and regenerative medicine. Japan Animal Referral Medical Center Co., Ltd. was founded in 2005 and is headquartered in Kawasaki, Japan.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kawasaki"}, "6039.T": {"short_name": "JAPAN ANIMAL REFERRAL MED CNTR ", "long_name": "Japan Animal Referral Medical Center Co., Ltd.", "summary": "Japan Animal Referral Medical Center Co., Ltd. owns and operates medical centers for animals in Japan. The company provides veterinary hospital conducting advanced medical care service for dogs and cats. The company's medical center comprises cardiology, respiratory, urology, gastroenterology, oncology, neurology, orthopedics, ophthalmology, radiology and imaging, and anesthesiology departments. It also provides professional training services, such as clinical training and treatment; and conducts research and development projects, including genetic testing, immunotherapy, and regenerative medicine. Japan Animal Referral Medical Center Co., Ltd. was founded in 2005 and is headquartered in Kawasaki, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kawasaki"}, "6060.T": {"short_name": "COCOLONET CO LTD", "long_name": "Cocolonet CO., LTD.", "summary": "Cocolonet Co., Ltd. provides funeral and wedding services in Japan. The company is involved in the wholesale and retail of tombstones; and operation of housing for elderly people. It also engages in the fresh flower wholesale business. The company was formerly known as Kanno Corporation Co., Ltd. and changed its name to Cocolonet Co., Ltd. in April 2006. The company was founded in 1892 and is headquartered in Fukushima, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukushima"}, "6071.T": {"short_name": "IBJ INC", "long_name": "IBJ, Inc.", "summary": "IBJ, Inc. provides marriage hunting services in Japan. The company is involved in community-related business with marriage-hunting websites; event-related business, including parties, matchmaking get-togethers, and community gatherings; directly-managed marriage-hunting lounge business; marriage consulting federation business; and franchise and life design media business. It operates Bridal Net, a marriage hunting website; IBJ Members Marriage-Hunting Lounge, a directly-managed marriage-hunting lounge; and Japan Marriage Consulting Federation, an official member lounge. The company also provides PARTY PARTY, a service that hosts marriage-hunting parties; and Rush, a service that hosts matchmaking get-togethers and community gatherings. As of October 2020, the company operated 78 lounges. IBJ, Inc. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6181.T": {"short_name": "TAMENY INC", "long_name": "Tameny Inc.", "summary": "Tameny Inc. provides marriage information and support services in Japan. It offers team marriage and smart marriage program ranging from admission to marriage, and story of concierge services, as well as insurance agent services. The company was formerly known as Partner Agent, Inc. and changed its name to Tameny Inc. in September 2020. Tameny Inc. was founded in 2006 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6184.T": {"short_name": "KAMAKURA SHINSHO LTD", "long_name": "Kamakura Shinsho, Ltd.", "summary": "Kamakura Shinsho, Ltd. operates portal sites in Japan. The company publishes and lectures to communicate knowledge on funerals, altar, tombs, temples, etc. It offers portal sites that gives information on funerals; and responds to various consultations by telephone and e-mails, as well as a mobile search site with GPS functions to search the funeral companies and centers. The company also provides operates sites that offers information on joint funerals and farewell party; family funeral knowledge and family funeral expenses; funeral navigation; funeral estimates; introduction of expenses to direct funeral and cremation ceremonies; and guidance on customs and funerals. In addition, it operates sites for funeral and funeral night wear, and legal flowers; information on heritage inheritance; navigating the remains; funeral guards to support Web attraction of funeral services; and funeral insurance products. Further, the company operates sites that offers information on Buddhist altar/Buddhist information; Buddha statues and Buddhist teachers; information on graves and tombstones; and temple cemeteries. Kamakura Shinsho, Ltd. was founded in 1979 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6186.T": {"short_name": "ICHIKURA CO LTD", "long_name": "Ichikura Co., Ltd.", "summary": "Ichikura Co., Ltd. develops, sells, and rents kimonos for ceremonies in Japan. It also provides staff wedding support services, such as planning and development services for photo products, including cooking, flower decoration, beauty, costumes, photography, albums, etc. The company was founded in 1991 and is headquartered in Saitama, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Saitama"}, "6537.T": {"short_name": "WASHHOUSE CO LTD", "long_name": "Washhouse Co.,Ltd.", "summary": "Washhouse Co.,Ltd. plans, develops, and operates remotely managed coin-operated laundry stores in Japan. As of February 20, 2020, the company operated 623 stores. It also franchises its stores. The company was founded in 2001 and is headquartered in Miyazaki, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Miyazaki"}, "6574.T": {"short_name": "CONVANO INC", "long_name": "Convano Inc.", "summary": "Convano Inc. manages and franchises nail salons in Japan. The company was founded in 2007 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7040.T": {"short_name": "SUN LIFE HOLDING CO LTD", "long_name": "Sun-Life Holding Co.,Ltd.", "summary": "Sun-Life Holding Co.,Ltd. provides wedding ceremony, funeral, and nursing care services in Japan. It operates hotels and ceremonial halls, as well as nursing homes and senior residences. The company was founded in 1933 and is headquartered in Hiratsuka, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Hiratsuka"}, "7062.T": {"short_name": "FUREASU CO LTD", "long_name": "fureasu Co.,Ltd", "summary": "fureasu Co.,Ltd provides massage, nursing, and care services in Japan. It offers home massage, relaxation massage, spa, and office massage services. The company also provides visiting nursing services; and visit care services comprising physical care and life support services. fureasu Co.,Ltd was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7086.T": {"short_name": "KIZUNA HOLDINGS CORP", "long_name": "KIZUNA HOLDINGS Corp.", "summary": "KIZUNA HOLDINGS Corp. provides funeral planning, promotion, and management services in Japan. The company was founded in 2000 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7358.T": {"short_name": "POPPINS HOLDINGS INC", "long_name": "Poppins Holdings Inc.", "summary": "Poppins Holdings Inc. provides family care and edu-care services in Japan. It offers child-rearing support services, including nanny services, nursery school, kids rooms, in-house nursery facilities, test preparation classes for kindergarten and elementary school, preschool, school for early childhood education, and after school; infant/early childhood education support services comprising training and education of nannies and infant/early childhood professionals, and training and study-abroad programs for staff of nursery and/or preschool facilities, as well as research services for govt and educational institutions; child-rearing business consulting services; and elderly care support services, such as home care services for seniors, daytime care services, and training and education support services for elderly care professionals. The company was founded in 1987 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7502.T": {"short_name": "PLAZA CREATE HONSHA CO LTD", "long_name": "Plaza Create Honsha Co.,Ltd.", "summary": "Plaza Create Honsha Co.,Ltd. operates in photographs and videos related businesses in Japan. The company offers digital photo printing services and various products; online photo printing services; photo shooting services; mobile services; and photography services for wedding ceremonies. It also operates photo service shops under the Palette Plaza and 55Station name; and prints ID cards, and employee photo and student ID cards under the GRASYS brand. Plaza Create Honsha Co.,Ltd. was founded in 1986 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7523.T": {"short_name": "ART VIVANT CO LTD", "long_name": "Art Vivant Co., Ltd.", "summary": "Art Vivant Co., Ltd. operates in the arts related business. The company sells art works, including printed, oil painting, and watercolor products; and arts and crafts, such as sculptures and glass crafts, as well as miscellaneous art goods. It operates in the United States, Europe, China, and Japan. Art Vivant Co., Ltd. was founded in 1984 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9731.T": {"short_name": "HAKUYOSHA COMPANY LTD", "long_name": "Hakuyosha Company, Ltd.", "summary": "Hakuyosha Company, Ltd. engages in cleaning, rental, and other businesses in Japan. The company cleans general clothing items, fur, leather, shoes, difficult-to-handle kimono, and bags; and interior items, such as curtains, carpets, and futons, as well as offers house cleaning for including kitchens and bathrooms. It also rents uniforms to restaurants and factories; and linen, including sheets and towels, as well as tablecloths to restaurants. In addition, the company cleans theaters, halls, offices, and shops; and building exterior tiles, lighting fixtures, and carpets as well as provides pest control services. Hakuyosha Company, Ltd. was founded in 1906 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "MRM": {"short_name": "MEDIROM Healthcare Technologies", "long_name": "MEDIROM Healthcare Technologies Inc.", "summary": "MEDIROM Healthcare Technologies Inc. provides holistic health services in Japan. It operates in two segments, Relaxation Salon and Digital Preventative Healthcare. The Relaxation Salon segment operates and franchises relaxation salons, which provide finger-pressure style bodywork therapy, stretch therapy, and posture and joint alignment, as well as physical therapy elements; and various individual services, including anti-fatigue therapy, athletic support therapy, slim-down therapy, and reflexology. As of June 30, 2020, this segment had a total of 289 salons consisting of 138 directly operated salons and 151 franchised salons primarily in the Tokyo metropolitan area, which includes Tokyo, Yokohama, and Saitama. The Digital Preventative Healthcare segment engages in the sampling business, which includes brand promotion and consumer analysis for third party brands of corporate clients. This segment also offers government-sponsored Specific Health Guidance program, utilizing its internally-developed on-demand health monitoring smartphone application, Lav; MOTHER Tracker for fitness applications; and preventative healthcare services utilizing its digital application and devices. MEDIROM Healthcare Technologies Inc. also operates Re.Ra.Ku College that offers continuing training for franchise owners, home office staff, and salon staff covering topics, such as customer service, salon operations, and relaxation techniques located in the Odaiba area in Tokyo. The company was formerly known as MEDIROM Inc. and changed its name to MEDIROM Healthcare Technologies Inc. in March 2020. MEDIROM Healthcare Technologies Inc. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "NCM", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TVJ.F": {"short_name": "TSUKADA GLOBAL HLDGS INC.", "long_name": "TSUKADA GLOBAL HOLDINGS Inc.", "summary": "TSUKADA GLOBAL HOLDINGS Inc., through its subsidiaries, engages in the planning, development, and ownership of guest houses, hotels, and restaurants in Japan and internationally. It operates through three segments: Wedding business, Hotel business, and Wellness & Relaxation business. The company offers guest house, hotel, and overseas wedding services through its 23 wedding venues. It also provides wedding attire, beauty care and hair makeup, wedding ceremony and reception, and photography and videography services. In addition, the company manages and operates hotels and restaurants under the InterContinental Tokyo Bay, The Strings by InterContinental Tokyo, The Strings Hotel Yagoto Nagoya, The Strings Hotel Nagoya, VINO BUONO, Mangiare, and SHIKITEI names. Further, it operates 36 reflexology salons and a reflexology school under the Queensway name, as well as Beauty & Relax SPA-HERBS, a spa complex; and BEST STYLE FITNESS, a fitness club. The company was formerly known as Best Bridal Inc. and changed its name to TSUKADA GLOBAL HOLDINGS Inc. in July 2014. TSUKADA GLOBAL HOLDINGS Inc. was founded in 1995 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "WW8.F": {"short_name": "WATABE WEDDING", "long_name": "Watabe Wedding Corporation", "summary": "Watabe Wedding Corporation provides wedding and travel services for wedding participants in Japan and internationally. The company operates wedding facilities; produces and sells wedding dresses, etc.; rents wedding related attires and formal wear for coming-of-age ceremonies, various parties, etc.; and provides clothing and photography integrated services by combining beauty care, dressing, and studio portraits. It also offers wedding related services, such as consultations for wedding halls; arranging wedding ceremonies; planning and directing wedding receptions; and bridal goods, including furniture, beddings, jewelries, and gems. The company was formerly known as Watabe Clothing Store Co., Ltd. and changed its name to Watabe Wedding Corporation in August 1996. Watabe Wedding Corporation was founded in 1953 and is headquartered in Kyoto, Japan.", "currency": "EUR", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Kyoto"}}