{
    "1413.T": {
        "short_name": "HINOKIYA GROUP CO LTD",
        "long_name": "Hinokiya Group Co.,Ltd.",
        "summary": "Hinokiya Group Co.,Ltd. operates as a custom housing company in Japan. It is also involved in real estate, insulating material, renovation, nursing care, childcare, and other business. The company was founded in 1988 and is headquartered in Tokyo, Japan. Hinokiya Group Co.,Ltd. is a subsidiary of Yamada Holdings Co.,Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1420.T": {
        "short_name": "SANYO HOMES CORPORATION",
        "long_name": "Sanyo Homes Corporation",
        "summary": "Sanyo Homes Corporation engages in construction business in Japan. It operates in two segments, Housing Business and the Condominium Business. The Housing Business segment is involved in the design, construction, supervision and contracting, sale, and other activities for detached houses, rental welfare housing, and housing renovations. The Condominium Business segment develops, rents, and sells condominium buildings. The company is also involved in the sale of eco-energy facilities, such as solar power and storage batteries, as well as structural steel frameworks; and life support services comprising management of condominiums, and nursing and child care facilities. Sanyo Homes Corporation was founded in 1969 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1728.T": {
        "short_name": "MISAWA HOMES CHUGOKU CO.LTD",
        "long_name": "Misawa Homes Chugoku Co., Ltd.",
        "summary": "Misawa Homes Chugoku Co., Ltd. designs, constructs, and sells wooden prefabricated houses, ceramic houses, apartments, condominiums, buildings, and stores in Japan. It is also involved in the real estate-related business; and sale, design, and construction of housing-related products, such as interior and exterior. The company was founded in 1971 and is headquartered in Okayama, Japan. Misawa Homes Chugoku Co., Ltd. operates as a subsidiary of Misawa Homes Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Okayama"
    },
    "1739.T": {
        "short_name": "SEEDHEIWA CO LTD",
        "long_name": "SeedHeiwa Co., Ltd.",
        "summary": "SeedHeiwa Co., Ltd. engages in the design, construction, and supervision of construction works in Japan. The company constructs small and large buildings, as well as undertakes renovations and repair works. It is also involved in the sale, lease, management, and brokerage of condominiums, detached houses, and commercial facilities; and management of hotels. The company was formerly known as SEED Co., Ltd. and changed its name to SeedHeiwa Co., Ltd. in July 2014. The company was incorporated in 1993 and is headquartered in Osaka, Japan. SeedHeiwa Co., Ltd. is a subsidiary of Sanei Architecture Planning Co.,Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "1808.T": {
        "short_name": "HASEKO CORPORATION",
        "long_name": "HASEKO Corporation",
        "summary": "HASEKO Corporation plans, designs, constructs, sells, renovates, and rents condominiums in Japan and internationally. The company operates through Construction-Related Business, Service-Related Business, and Overseas-Related Business segments. It is also involved in the real estate development, including for-sale housing and real estate, and condominium and apartment management operation and administration business; real estate brokerage, such as selling and buying, exchanging, leasing, and agency of real estate; purchase and resale comprising condominiums and other properties; and provision of real estate solutions that include asset management and project proposals, as well as consultation for use of land and real estate investment management and admiration of real estate. In addition, the company is involved in the for-sale condominium management business, which comprises monitoring, management and cleaning, maintenance, clerical, and life support; and rental condominium management and operation. Further, it provides large-scale repair, earthquake-resistant structure and facility renovation, environmental friendliness and energy saving renovation, value enhancement renovation, and remolding works, as well as condominium rehabilitation and building replacement services. Additionally, the company manages facilities for the elderly; and offers home nursing care, and senior living planning and consultation. It also provides interior enhancement services; and sells and leases construction materials. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1840.T": {
        "short_name": "TSUCHIYA HLDG",
        "long_name": "Tsuchiya Holdings Co., Ltd.",
        "summary": "Tsuchiya Holdings Co., Ltd., through its subsidiaries, provides control, management, and consulting services for companies operating in the construction industry in Japan. The company is involved in the construction of homes, as well as remodeling of buildings. It also offers real estate brokerage and leasing services, as well as offers solar power generation equipment. The company was formerly known as Tsuchiya Home Co., Ltd. and changed its name to Tsuchiya Holdings Co., Ltd. in November 2008. Tsuchiya Holdings Co., Ltd. was founded in 1969 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sapporo"
    },
    "1911.T": {
        "short_name": "SUMITOMO FORESTRY CO",
        "long_name": "Sumitomo Forestry Co., Ltd.",
        "summary": "Sumitomo Forestry Co., Ltd. engages in the timber and building materials, housing and construction, overseas housing and real estate, environment and resources, and other businesses in Japan, the United States, and internationally. The company's Timber and Building Materials segment procures, manufactures, processes, and sells timber and building materials, such as interior materials, plywood, medium density fiberboard, particle board, laminated veneer lumber, and other timber and building materials; develops and produces building materials, including structural members, and special interior products; and sells housing materials. Its Housing and Construction segment is involved in the construction, maintenance, and renovation of detached houses and apartment buildings; lease, management, purchase, sale, and brokerage of real estate; and house exterior fixtures, urban greening works, CAD, site surveys, etc. The company's Overseas Housing and Real Estate segment sells specs home; constructs detached houses, etc.; and develops multi-family housing and commercial complexes, etc. Its Environment and Resources segment engages in the biomass power generation business and forestation, etc. The company's Other segment is involved in the private-pay elderly care facilities and insurance agency businesses; and contracted civil engineering/construction works, etc. The company also engages in the management of forest and golf courses; secondary processing and sale of aluminum sashes and exterior finishing products; processing industrial waste products; wholesale of electric power; supply and sale of wood chips; development of computer systems, etc.; landscaping for private residences, plant management and rental, equipment leasing, office services, staffing, training, business contracting, and home nursing care services; and production and sale of nursery compost, culture soil for gardening, etc. The company was founded in 1691 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "1928.T": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "3284.T": {
        "short_name": "HOOSIERS HOLDINGS",
        "long_name": "Hoosiers Holdings",
        "summary": "Hoosiers Holdings, through its subsidiaries, engages in planning, selling, and managing condominiums, self-owned detached houses, and apartments in Japan. The company operates through six segments: Condominium Apartments for Families and Singles, CCRC, Houses and Flats, Real Estate Investment, Property Management and Related Services, and Other. It engages in the real estate investment, development, leasing, and brokerage activities, as well as management of hotels; insurance business; management of sports facilities; and investment management, advisory, and consulting business activities. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3291.T": {
        "short_name": "IIDA GROUP HOLDINGS CO LTD",
        "long_name": "Iida Group Holdings Co., Ltd.",
        "summary": "Iida Group Holdings Co., Ltd. constructs and sells detached houses, and detached house condominiums in Japan. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3477.T": {
        "short_name": "FORLIFE CO LTD",
        "long_name": "FORLIFE Co., Ltd.",
        "summary": "FORLIFE Co., Ltd. provides condominiums and custom-built homes in Yokohama city, Kanagawa prefecture, Kawasaki city, and Jonan District of Tokyo. The company also offers ready-built houses. The company was formerly known as Four Life & Company Co., Ltd. and changed its name to FORLIFE Co., Ltd. in May 2013. FORLIFE Co., Ltd. was founded in 1996 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "4204.T": {
        "short_name": "SEKISUI CHEMICAL CO",
        "long_name": "Sekisui Chemical Co., Ltd.",
        "summary": "Sekisui Chemical Co., Ltd. engages in housing, urban infrastructure and environmental products (UIEP), and high performance plastics (HPP) businesses. The Housing segment engages in the manufacturing, construction, sale, refurbishing, and other operations related to unit housing, real estate, and residential service business. The UIEP segment manufactures, constructs, and sells PVC pipes and joints, polyethylene pipes and joints, pipe and drain renewal materials and construction methods, reinforced plastic pipe, construction materials, and FFU. The HPP segment engages in the manufacture and sale of interlayer films for laminated glass, polyolefin foam, tape, LCD fine particles and photosensitive materials, functional resin for infrastructure, diagnostic drugs, and other products. It operates in Japan, the United States, Europe, Asia, and internationally. The company was formerly known as Sekisui Sangyo Co., Ltd. and changed its name to Sekisui Chemical Co., Ltd. in 1948. Sekisui Chemical Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "6073.T": {
        "short_name": "ASANTE INCORPORATED",
        "long_name": "Asante Incorporated",
        "summary": "Asante Incorporated engages in the house amenity and total sanitation businesses in Japan. The company offers house maintenance services, which include termite control; measures against humidity; earthquake countermeasures; and remodeling/new construction services, as well as handles solar power generation system, and electric home remodeling services. It also provides pest control and bedbug control services, as well as takes countermeasures against vermin and birds. The company was formerly known as Sanyo Shodoku Co., Ltd. and changed its name to Asante Incorporated in January 1994. Asante Incorporated was founded in 1970 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8904.T": {
        "short_name": "AVANTIA CO LTD",
        "long_name": "Avantia Co.,Ltd.",
        "summary": "Avantia Co.,Ltd. engages in the custom-build housing business in Japan. It involved in the planning, design, construction, interior coordination, and exterior design of houses; detached housing business; residential land development and sale; remodeling business; development business; residential land development business; condominium business; and brokerage business. The company was formerly known as Sanyo Housing Nagoya Co., Ltd. and changed its name to Avantia Co.,Ltd. in January 2020. Avantia Co.,Ltd. was founded in 1989 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Nagoya"
    },
    "8917.T": {
        "short_name": "FIRST JUKEN CO LTD",
        "long_name": "First Juken Co., Ltd.",
        "summary": "First Juken Co., Ltd. engages in the construction and sale of detached houses in Japan. The company also provides subcontracting work and related services; and construction consulting services. In addition, it offers real estate sales, brokerage, placement, rental, and management services; and non-life insurance agency and life insurance solicitation services. The company was founded in 1999 and is headquartered in Amagasaki, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Amagasaki"
    },
    "HS6.F": {
        "short_name": "HASEKO CORP.",
        "long_name": "HASEKO Corporation",
        "summary": "HASEKO Corporation plans, designs, constructs, sells, renovates, and rents condominiums in Japan and internationally. The company operates through Construction-Related Business, Service-Related Business, and Overseas-Related Business segments. It is also involved in the real estate development, including for-sale housing and real estate, and condominium and apartment management operation and administration business; real estate brokerage, such as selling and buying, exchanging, leasing, and agency of real estate; purchase and resale comprising condominiums and other properties; and provision of real estate solutions that include asset management and project proposals, as well as consultation for use of land and real estate investment management and admiration of real estate. In addition, the company is involved in the for-sale condominium management business, which comprises monitoring, management and cleaning, maintenance, clerical, and life support; and rental condominium management and operation. Further, it provides large-scale repair, earthquake-resistant structure and facility renovation, environmental friendliness and energy saving renovation, value enhancement renovation, and remolding works, as well as condominium rehabilitation and building replacement services. Additionally, the company manages facilities for the elderly; and offers home nursing care, and senior living planning and consultation. It also provides interior enhancement services; and sells and leases construction materials. The company was founded in 1937 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "IIO.SG": {
        "short_name": "IIDA Group Holdings Co. Ltd. Re",
        "long_name": "Iida Group Holdings Co., Ltd.",
        "summary": "Iida Group Holdings Co., Ltd. constructs and sells detached houses, and detached house condominiums in Japan. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SKHSF": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "SKHSY": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "SKSUF": {
        "short_name": "SEKISUI CHEMICAL CO",
        "long_name": "Sekisui Chemical Co., Ltd.",
        "summary": "Sekisui Chemical Co., Ltd. engages in housing, urban infrastructure and environmental products (UIEP), and high performance plastics (HPP) businesses. The Housing segment engages in the manufacturing, construction, sale, refurbishing, and other operations related to unit housing, real estate, and residential service business. The UIEP segment manufactures, constructs, and sells PVC pipes and joints, polyethylene pipes and joints, pipe and drain renewal materials and construction methods, reinforced plastic pipe, construction materials, and FFU. The HPP segment engages in the manufacture and sale of interlayer films for laminated glass, polyolefin foam, tape, LCD fine particles and photosensitive materials, functional resin for infrastructure, diagnostic drugs, and other products. It operates in Japan, the United States, Europe, Asia, and internationally. The company was formerly known as Sekisui Sangyo Co., Ltd. and changed its name to Sekisui Chemical Co., Ltd. in 1948. Sekisui Chemical Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "SPH1.F": {
        "short_name": "SEKISUI HOUSE",
        "long_name": "Sekisui House, Ltd.",
        "summary": "Sekisui House, Ltd. designs, constructs, and contracts built-to-order detached houses in Japan and internationally. It also engages in the design, construction, and contracting of built-to-order properties for lease, medical and nursing care facilities, commercial facilities, and hotels; design, construction, and contracting of construction of buildings and civil engineering works; remodeling and renovation of houses, etc.; sub-lease, management, operation, and brokerage of real estate; sale of houses and residential land; design, construction, and sale of condominiums; and development of office and commercial buildings, as well as management and operation of owned properties. The company was founded in 1960 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "SUI.F": {
        "short_name": "SEKISUI CHEM.",
        "long_name": "Sekisui Chemical Co., Ltd.",
        "summary": "Sekisui Chemical Co., Ltd. engages in housing, urban infrastructure and environmental products (UIEP), and high performance plastics (HPP) businesses. The Housing segment engages in the manufacturing, construction, sale, refurbishing, and other operations related to unit housing, real estate, and residential service business. The UIEP segment manufactures, constructs, and sells PVC pipes and joints, polyethylene pipes and joints, pipe and drain renewal materials and construction methods, reinforced plastic pipe, construction materials, and FFU. The HPP segment engages in the manufacture and sale of interlayer films for laminated glass, polyolefin foam, tape, LCD fine particles and photosensitive materials, functional resin for infrastructure, diagnostic drugs, and other products. It operates in Japan, the United States, Europe, Asia, and internationally. The company was formerly known as Sekisui Sangyo Co., Ltd. and changed its name to Sekisui Chemical Co., Ltd. in 1948. Sekisui Chemical Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    }
}