{
    "2157.T": {
        "short_name": "KOSHIDAKA HOLDINGS CO LTD",
        "long_name": "Koshidaka Holdings Co., Ltd.",
        "summary": "Koshidaka Holdings Co., Ltd. operates a karaoke chain in Japan. It operates Curves, a chain of fitness stores that promote fitness programs for women; and Maneki no Yu and Lamp no Yu hot spring facilities. The company was formerly known as Koshidaka Co. Ltd. and changed its name to Koshidaka Holdings Co., Ltd. in September 2010. The company was founded in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.koshidakaholdings.co.jp",
        "market_cap": "Small Cap"
    },
    "2675.T": {
        "short_name": "DYNAC HLDGS CORP",
        "long_name": "Dynac Holdings Corporation",
        "summary": "Dynac Holdings Corporation operates and manages multi-business restaurants primarily in Japan. The company engages in the operation and management of various restaurants and drink corners in cultural facilities, such as theaters and music halls; golf courses, ski resorts, and golf club restaurants; and roadside stations and service areas. It also plans and manages various events and parties; and offers catering services. The company operates restaurants primarily under the Hibiki, Uomori, and Toritori names. As of December 31, 2019, it operated 249 stores. The company was founded in 1958 and is headquartered in Tokyo, Japan. Dynac Holdings Corporation is a subsidiary of Suntory Holdings Limited.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.dynac.co.jp",
        "market_cap": "Micro Cap"
    },
    "2694.T": {
        "short_name": "G.TASTE CO LTD",
        "long_name": "G.taste Co.,Ltd.",
        "summary": "G.taste Co.,Ltd. operates in the food service industry in Japan. The company is involved in the planning and management of restaurants; and franchise and food processing businesses, as well as consulting business. The company was founded in 1959 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "462-0841",
        "website": "http://www.g-taste.co.jp",
        "market_cap": "Micro Cap"
    },
    "2695.T": {
        "short_name": "KURA SUSHI INC",
        "long_name": "Kura Sushi,Inc.",
        "summary": "Kura Sushi,Inc. develops and operates a chain of sushi restaurants in Japan, Taiwan, and the United States. As of October 2018, it operates 485 stores. The company was founded in 1977 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "599-8253",
        "website": "http://www.kura-corpo.co.jp",
        "market_cap": "Small Cap"
    },
    "2705.T": {
        "short_name": "OOTOYA HOLDINGS CO LTD",
        "long_name": "OOTOYA Holdings Co., Ltd.",
        "summary": "OOTOYA Holdings Co., Ltd., together with its subsidiaries, plans, manages and franchises restaurants. Its restaurants primarily offer set meals. As of March 31, 2019, the company operated and franchised 353 stores in Japan and 110 stores internationally. OOTOYA Holdings Co., Ltd. was founded in 1958 and is headquartered in Musashino, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": "180-0006",
        "website": "http://www.ootoya.jp",
        "market_cap": "Micro Cap"
    },
    "2752.T": {
        "short_name": "FUJIO FOOD GROUP INC",
        "long_name": "Fujio Food Group Inc.",
        "summary": "Fujio Food Group Inc. operates restaurant chains in Japan and internationally. The company is involved in the management of restaurants and franchise chains; and designing and planning activities related to the interior and exterior of the stores. It operates restaurants under the MaidoOokiniShokudo, KushiyaMonogatari, Kappougi, and Tsurumaru brands, as well as other sub-brands. Fujio Food Group Inc. was founded in 1979 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0046",
        "website": "http://www.fujiofood.com",
        "market_cap": "Small Cap"
    },
    "2753.T": {
        "short_name": "AMIYAKI TEI CO LTD",
        "long_name": "Amiyaki Tei Co., Ltd.",
        "summary": "Amiyaki Tei Co., Ltd. operates a chain of restaurants in Japan. It operates through Yakiniku, Yakitori, and Other segments. The Yakiniku segment operates 182 restaurants under the Amiyaki Tei, Karbiya, and Suehiro Kan brand names, which specializes in offering meat. The Yakitori segment operates 55 restaurants under the Ganso Yakitoriya brand, which offers yakitori and kamomeki. The Other segment operates 32 restaurants. Amiyaki Tei Co., Ltd. was founded in 1995 and is headquartered in Kasugai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kasugai",
        "zipcode": "486-0918",
        "website": "http://www.amiyakitei.co.jp",
        "market_cap": "Micro Cap"
    },
    "2764.T": {
        "short_name": "HIRAMATSU INC",
        "long_name": "Hiramatsu Inc.",
        "summary": "Hiramatsu Inc. operates and manages cafes, restaurants, and hotels in Japan. The company was formerly known as Hiramatsu-Tei Ltd. and changed its name to Hiramatsu Inc. in December 1994. Hiramatsu Inc. was founded in 1982 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0013",
        "website": "http://www.hiramatsu.co.jp",
        "market_cap": "Micro Cap"
    },
    "2789.T": {
        "short_name": "KARULA CO LTD",
        "long_name": "Karula Co.,LTD.",
        "summary": "Karula Co.,LTD. operates Japanese style family restaurants in Japan. As of September 30, 2020, it operated 120 stores in Tohoku and Kita-Kantou regions, including 93 Japanese-style restaurant Marumatsu stores; 6 Soba restaurant Marumatsu stores; 4 Katsu gourmet stores; 3 Crab Masamune stores; 3 Joshoan stores; 1 Jushoan Marumatsu store; 1 Rotating sushi store; and 12 Shabu Masamune and other stores. The company was formerly known as Marumatsu Co., Ltd. and changed its name to Karula Co.,LTD. in March 1991. Karula Co.,LTD. was founded in 1910 and is headquartered in Tomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tomiya",
        "zipcode": "981-3341",
        "website": "http://www.re-marumatu.co.jp",
        "market_cap": "Nano Cap"
    },
    "2798.T": {
        "short_name": "Y'S TABLE CORP",
        "long_name": "Y's Table Corporation",
        "summary": "Y's Table Corporation plans, develops, and operates various restaurants in Japan and internationally. As of May 31, 2020, it operated 52 directly managed stores and 48 FC franchise stores. The company was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.ystable.co.jp",
        "market_cap": "Nano Cap"
    },
    "3053.T": {
        "short_name": "PEPPER FOOD SERVICE CO LTD",
        "long_name": "Pepper Food Service Co., Ltd.",
        "summary": "Pepper Food Service Co., Ltd. operates restaurants in Japan and internationally. It operates through Pepper Lunch, Ikinari! Steak, Other Restaurants, and Own-brand products segments. The company owns and franchises restaurants primarily under the Pepper Lunch and Ikinari! Steak brands. It also franchises and operates other restaurants, such as Chargrilled Steak Kuni, a cut-to-order steak restaurant; Kodawari Tonkatsu Katsukitei, a pork cutlet restaurant; and Gyutan Natori, a beef tongue restaurant. In addition, the company sells various specialty products at restaurants and wholesale, including tonkatsu sauce, frozen pepper rice, dressings, steak sauce, and other food items; and through online comprising frozen Hamburg steak, frozen pepper rice, frozen beef tongue, the Ikinari! Steak set, dressings, steak sauce, and clear masks for food service workers. As of March 31, 2019, it operated 478 Pepper Lunch restaurants, including 56 directly-owned and 422 franchised; 439 Ikinari! Steak restaurants, such as 283 directly-owned and 156 franchised; and 15 other restaurants, as well as contracted with 41 separate outsourced operators. The company was founded in 1970 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.pepper-fs.co.jp",
        "market_cap": "Micro Cap"
    },
    "3067.T": {
        "short_name": "TOKYO ICHIBAN FOODS CO.LTD",
        "long_name": "Tokyo Ichiban Foods Co., Ltd.",
        "summary": "Tokyo Ichiban Foods Co., Ltd. operates a chain of swimming tiger blowfish specialty restaurants under the Tora-fugu Tei name in Japan. It also operates sushi and live fishes restaurant under the Sakana-no-manma name; and tiger blowfish restaurant under the Fuguyoshi Souhonten name, as well as operates restaurants under the Wokuni name. The company was founded in 1996 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.tokyo-ichiban-foods.co.jp",
        "market_cap": "Nano Cap"
    },
    "3069.T": {
        "short_name": "JFLA HLDGS INC",
        "long_name": "JFLA Holdings Inc.",
        "summary": "JFLA Holdings Inc. operates and franchises restaurants in Japan. It franchises Gyukaku and Toriden restaurants, as well as operates sweets brand GOKOKU. The company also manufactures, processes, wholesales, and retails soy sauce, Japanese seasoning, miso, pickles, sake, alcoholic beverages, soft drinks, and food products; imports, wholesales, and retails fine foods, confectionery materials, and wine; and wholesales general food for business use. In addition, it offers milk and dairy products; and engages in breeding of calves. The company was formerly known as Walnut Street Group Holding Limited and changed its name to JFLA Holdings Inc. in 2018. JFLA Holdings Inc. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0014",
        "website": "http://j-fla.com",
        "market_cap": "Micro Cap"
    },
    "3075.T": {
        "short_name": "CHOUSHIMARU CO.LTD.",
        "long_name": "Choushimaru Co.,Ltd.",
        "summary": "Choushimaru Co.,Ltd. operates gourmet carousel sushi restaurants in Japan and internationally. As of August 15, 2019, it operated 94 stores. The company was formerly known as All Co., Ltd. and changed its name to Choushimaru Co.,Ltd. in April 2005. Choushimaru Co.,Ltd. was founded in 1977 and is headquartered in Chiba, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Chiba",
        "zipcode": "261-0025",
        "website": "http://www.choushimaru.co.jp",
        "market_cap": "Micro Cap"
    },
    "3077.T": {
        "short_name": "HORIIFOODSERVICE CO.LTD.",
        "long_name": "Horiifoodservice Co., Ltd.",
        "summary": "Horiifoodservice Co., Ltd. operates in the restaurant industry. It operates restaurants under the Hidden House Ninja, Broiled charcoal fire ninja, Hitachi Iroku Momochi, Shabu-shabu Sanmagami Tomoe, Japanese dining taste, Featuring Profit from Honpo, Garlic trees of thorns, Private dining benefits, Everyone's Japanese Village, Suddenly steak, and From red brand names. The company was founded in 1983 and is headquartered in Mito, Japan. Horiifoodservice Co., Ltd. is a subsidiary of TBI Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Mito",
        "zipcode": "310-0805",
        "website": "http://www.horiifood.co.jp",
        "market_cap": "Nano Cap"
    },
    "3082.T": {
        "short_name": "KICHIRI HOLDINGS & CO LTD",
        "long_name": "Kichiri & Co., Ltd.",
        "summary": "Kichiri & Co., Ltd., a food service company, operates and manages restaurants in Japan. The company was founded in 1988 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0052",
        "website": "http://www.kichiri.co.jp",
        "market_cap": "Micro Cap"
    },
    "3085.T": {
        "short_name": "ARCLAND SERVICE HOLDINGS CO LTD",
        "long_name": "Arcland Service Holdings Co., Ltd.",
        "summary": "Arcland Service Holdings Co., Ltd. engages in the management of restaurants in Japan. The company also develops and franchises FC specialty stores; and manufactures and sells processed meat products and various frozen foods. It operates 461 stores, including 406 stores in Japan and 55 stores internationally. The company was formerly known as ArcLand Service Co., Ltd. and changed its name to Arcland Service Holdings Co., Ltd. in July 2016. The company was founded in 1993 and is headquartered in Tokyo, Japan. Arcland Service Holdings Co., Ltd. is a subsidiary of Arcland Sakamoto Co., Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0062",
        "website": "http://www.arclandservice.co.jp",
        "market_cap": "Small Cap"
    },
    "3087.T": {
        "short_name": "DOUTOR NICHIRES HOLDINGS CO LTD",
        "long_name": "DOUTOR NICHIRES Holdings Co., Ltd.",
        "summary": "DOUTOR NICHIRES Holdings Co., Ltd. manages restaurants and cafes in Japan. It manufactures and sells bread and pastry products; roasts and sells coffee; and imports, exports, purchases, and sells food products. The company also engages in the manufacture and wholesale of confectionary products; operation of bakery shops; wholesale of coffee machines, etc.; wholesale of fruits and vegetables; processing and wholesale of meat; manufacture of hams, sausages, and bacons; manufacture and wholesale of dressing products; and import of coffee beans and tea. In addition, it designs, constructs, maintains, and cleans stores; and operates natural food stores. DOUTOR NICHIRES Holdings Co., Ltd. was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.dnh.co.jp",
        "market_cap": "Small Cap"
    },
    "3091.T": {
        "short_name": "BRONCO BILLY CO LTD",
        "long_name": "BRONCO BILLY Co., LTD.",
        "summary": "BRONCO BILLY Co., LTD. operates restaurants in Japan. It primarily offers steak, hamburg, and fresh salad, as well as alcohol. As of December 31, 2018, it operated 115 stores. The company was founded in 1978 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": null,
        "website": "http://www.bronco.co.jp",
        "market_cap": "Small Cap"
    },
    "3097.T": {
        "short_name": "MONOGATARI CORPORATION",
        "long_name": "The Monogatari Corporation",
        "summary": "The Monogatari Corporation operates restaurant chain and specialty stores in Japan and internationally. The company is also involved in the management of franchise chain business. As of August 01, 2018, it operated approximately 459 stores in Japan, including 253 directly operated stores and 206 franchise stores; and 16 stores internationally, including 13 directly operated stores and 3 franchise stores. The company was founded in 1949 and is headquartered in Toyohashi, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Toyohashi",
        "zipcode": "440-0831",
        "website": "http://www.monogatari.co.jp",
        "market_cap": "Small Cap"
    },
    "3133.T": {
        "short_name": "KAIHAN CO LTD",
        "long_name": "kaihan co.,Ltd.",
        "summary": "Kaihan Co., Ltd. engages in the restaurant business in Japan. The company was formerly known as Kaihan, Ltd. and changed its name to Kaihan Co., Ltd. in October 2006. Kaihan Co., Ltd. was founded in 2003 and is based in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "450-0002",
        "website": "http://www.kaihan.co.jp",
        "market_cap": "Micro Cap"
    },
    "3178.T": {
        "short_name": "CHIMNEY CO LTD",
        "long_name": "Chimney Co., Ltd.",
        "summary": "Chimney Co., Ltd. operates and franchises a chain of restaurants in Japan. The company operates through a network of 338 directly managed stores, 91 contract stores, and 248 franchise stores. Chimney Co., Ltd. was founded in 1984 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-0052",
        "website": "http://www.chimney.co.jp",
        "market_cap": "Micro Cap"
    },
    "3193.T": {
        "short_name": "TORIKIZOKU HOLDINGS CO LTD",
        "long_name": "Torikizoku Holdings Co.,Ltd.",
        "summary": "Torikizoku Holdings Co., Ltd. operates in the restaurant business in Japan. As of January 31, 2021, it operated through a network of 622 stores, including 387 directly-managed stores and 235 TCC stores. The company was founded in 1985 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.torikizoku.co.jp",
        "market_cap": "Micro Cap"
    },
    "3196.T": {
        "short_name": "HOTLAND CO LTD",
        "long_name": "HOTLAND Co.,Ltd.",
        "summary": "HOTLAND Co.,Ltd. operates restaurants in Japan and internationally. The company is also involved in the development of Takoyaki shops and specialty stores, and bars; and operation of coffee bean and tea leaf shops, and baristas. In addition, it manufactures and sells ice creams and desserts. The company was founded in 1988 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0041",
        "website": "http://www.hotland.co.jp",
        "market_cap": "Micro Cap"
    },
    "3197.T": {
        "short_name": "SKYLARK HOLDINGS CO LTD",
        "long_name": "Skylark Holdings Co., Ltd.",
        "summary": "Skylark Holdings Co., Ltd. operates restaurants in Japan and internationally. The company also engages in the provision of food services; and related businesses. It operates Western, Chinese, Japanese, Sushi, and Italian restaurants primarily under the Gusto, Bamiyan, JonathanÂ´s, Syabuyo, Yumean, Steak Gusto, Karayoshi, Grazie Gardens, Aiya, Musashi No Mori Coffee, S Gusto, Totoyamichi, chawan, Tonkaratei, Yumean Shokudo, Bamiyan Ken, miwami, Tomato and Onion, Jyu-Jyu Karubi, and FLO PRESTIGE brand names. The company also provides delivery and take-out services. As of December 31, 2020, it operated 3,119 stores. The company was formerly known as Skylark Co., Ltd. and changed its name to Skylark Holdings Co., Ltd. in July 2018. Skylark Holdings Co., Ltd. was founded in 1962 and is based in Musashino, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": "180-8580",
        "website": "http://www.skylark.co.jp",
        "market_cap": "Mid Cap"
    },
    "3198.T": {
        "short_name": "SFP HOLDINGS CO LTD",
        "long_name": "SFP Holdings Co., Ltd.",
        "summary": "SFP Holdings Co., Ltd. manages restaurants in Japan. The company was formerly known as SFP Dining Co., Ltd. and changed its name to SFP Holdings Co., Ltd. in June 2017. SFP Holdings Co., Ltd. was founded in 1984 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "158-0094",
        "website": "http://www.sfpdining.jp",
        "market_cap": "Small Cap"
    },
    "3221.T": {
        "short_name": "YOSSIX CO LTD",
        "long_name": "Yossix Co.,Ltd.",
        "summary": "Yossix Co.,Ltd. engages in the restaurant business in Japan. The company also designs and constructs stores. As of March 31, 2020, it operated 343 stores. The company was founded in 1985 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "461-0025",
        "website": "http://yossix.co.jp",
        "market_cap": "Micro Cap"
    },
    "3224.T": {
        "short_name": "GENERAL OYSTER INC",
        "long_name": "General Oyster, Inc.",
        "summary": "General Oyster, Inc., through its subsidiaries, engages in the food and beverage business in Japan. It also engages in the processing and wholesale of oysters; and land cultivation, seed and seedling production, and sea aquaculture businesses. In addition, the company operates a chain of oyster bar restaurants. General Oyster, Inc. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0025",
        "website": "http://www.oysterbar.co.jp",
        "market_cap": "Nano Cap"
    },
    "3317.T": {
        "short_name": "FLYING GARDEN CO",
        "long_name": "Flying Garden Co., Ltd.",
        "summary": "Flying Garden Co., Ltd. operates a chain of restaurants under the Flying Garden name in Japan. The company primarily offers bomb hamburgers. Flying Garden Co., Ltd. was founded in 1976 and is headquartered in Oyama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Oyama",
        "zipcode": "323-0026",
        "website": "http://www.fgarden.co.jp",
        "market_cap": "Nano Cap"
    },
    "3329.T": {
        "short_name": "TOWA FOOD SERVICE CO LTD",
        "long_name": "Towa Food Service Co., Ltd.",
        "summary": "Towa Food Service Co., Ltd. operates a chain of cafÃ©s and restaurants in Japan. Its products include coffee and tea, pastas and cakes, and pizzas, as well as okonomiyaki and teppanyaki. The company was founded in 1972 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0004",
        "website": "http://www.towafood-net.co.jp",
        "market_cap": "Micro Cap"
    },
    "3358.T": {
        "short_name": "Y.S.FOOD CO LTD",
        "long_name": "Y.S.Food Co.,Ltd.",
        "summary": "Y.S.Food Co.,Ltd. engages in the management of Chikuho Ramen directly-managed shops in Japan and internationally. The company also franchises Chikuho ramen shops; manufactures and sells food ingredients, noodles, and sauces; engages in the real estate lease business; and plans, designs, and constructs shops. Y.S.Food Co.,Ltd. was founded in 1994 and is based in Tagawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tagawa",
        "zipcode": null,
        "website": "http://www.ys-food.jp",
        "market_cap": "Nano Cap"
    },
    "3370.T": {
        "short_name": "FUJITA CORP CO.LTD.",
        "long_name": "FUJITA CORPORATION Co.,Ltd.",
        "summary": "FUJITA CORPORATION Co.,Ltd. operates and manages fast food restaurants in Japan. It also provides lottery services, as well as operates various combined cafes, including Internet, DVD, game, billiards, etc.; and a 100 yen shop. The company operates its stores under the Mister Donut, Mos burger, Baby Face Planets, bull horn, Madoka, Oppe-chan, In warm weather, Hanamaru Udon, Doutor coffee shop, Yone no yu, Pepper lunch, Katon, Pork cutlet pork cutlet, Kitchen One, Dolce Ristorante, Space Create Own space, Celia good life goods, Lottery/toto, Ramen Happy Pussy, Charcoal grilled meat beef horn, Shabu-shabu, Yakitori and Kamo kamadoka, and Yonoya brands. As of April 1, 2018, it operated 69 stores. The company was formerly known as Family Foods Co., Ltd. and changed its name to FUJITA CORPORATION Co.,Ltd. in April 1996. FUJITA CORPORATION Co.,Ltd. was founded in 1978 and is headquartered in Tomakomai, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tomakomai",
        "zipcode": "059-1374",
        "website": "http://www.fujitacorp.co.jp",
        "market_cap": "Nano Cap"
    },
    "3372.T": {
        "short_name": "KANMONKAI CO LTD",
        "long_name": "KANMONKAI Co., Ltd.",
        "summary": "Kanmonkai Co., Ltd. develops, manages, and franchises restaurant stores in Japan and internationally. It operates 40 stores. The company was formerly known as Sakanatei Co., Ltd. and changed its name to Kanmonkai Co., Ltd. in March 2001. Kanmonkai Co., Ltd. was founded in 1980 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "550-0014",
        "website": "http://www.kanmonkai.co.jp",
        "market_cap": "Nano Cap"
    },
    "3387.T": {
        "short_name": "CREATE RESTAURANTS HOLDINGS INC",
        "long_name": "create restaurants holdings inc.",
        "summary": "create restaurants holdings inc. plans, develops, and manages food courts, izakaya bars, and dinner-time restaurants in Japan, Singapore, Hong Kong, and Taiwan. The company operates a range of restaurants, including Japanese, Western, Chinese, and ethnic cuisines primarily under the Hina-Sushi, Shabu Sai, Harvest, Hong Kong Chonron, TANTO TANTO, Yasia-ya Mei, Kichiza, and Kagonoya brands. It also operates Toriyoshi, a poultry-specialty izakaya bar; Isomaru-suisan, a 24-hour seafood izakaya bar; and Ichigoro, a specialty dumpling izakaya bar, as well as restaurants under the ramen brand. In addition, the company operates Italian restaurants, cafes, Korean barbecue restaurants, and dessert cafes. As of February 29, 2020, it operated 1,149 restaurants under 259 brands. create restaurants holdings inc. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0022",
        "website": "http://www.createrestaurants.com",
        "market_cap": "Small Cap"
    },
    "3397.T": {
        "short_name": "TORIDOLL HOLDINGS CORPORATION",
        "long_name": "TORIDOLL Holdings Corporation",
        "summary": "TORIDOLL Holdings Corporation, through its subsidiaries, operates and manages restaurants in Japan and internationally. It operates MARUGAME SEIMEN, a specialized Sanuki Udon restaurant; TORIDOLL YAKITORI, a charcoal grilled chicken restaurant; WOK TO WALK that serves Thai street food; Crackin' Kitchen, a Hawaiian-Cajun restaurant; TOKYO TABLE, which serves Japanese and American food; Pokeworks, a poke food restaurant; and Monster Curry, a Japanese curry shop restaurant. The company also operates Makino chain of restaurants serving tempura; Nagata Honjo-ken chain of restaurants that offer noodles; Kona's Coffee shops, which serve coffee from Hawaii drip-brewed and pancakes; Marusho-ya chain of ramen shops that provide noodles; Tonichi chain of restaurants that serve pork cutlets over rice and pork steak; ZUNDO-YA ramen shops; BANPAIYA store that offers drinks; and HAKATA-MARU, which serves cooked pork broth. In addition, it operates NIKU-YAMAKI-SHOTEN that provides grilled meat bowls; Boat Noodle, a chain of fast food restaurants; SHORYU shop of tonkatsu ramen from Hakata; TamJai Yunnan Mixian, which offers rice noodles; and TamJai SamGor Mixian that serves soup of rice noodles. The company was formerly known as Toridoll. Corporation and changed its name to TORIDOLL Holdings Corporation in October 2016. TORIDOLL Holdings Corporation was founded in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0043",
        "website": "http://www.toridoll.com",
        "market_cap": "Small Cap"
    },
    "3399.T": {
        "short_name": "MARUCHIYO YAMAOKA CORP",
        "long_name": "Maruchiyo Yamaokaya Corporation",
        "summary": "Maruchiyo Yamaokaya Corporation operates ramen restaurants in Japan. It operates 138 restaurants under the Yamaokaya brand name. The company was founded in 1980 and is headquartered in Sapporo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Sapporo",
        "zipcode": "007-0827",
        "website": "http://www.yamaokaya.com",
        "market_cap": "Nano Cap"
    },
    "3418.T": {
        "short_name": "BALNIBARBI CO LTD",
        "long_name": "Balnibarbi Co.,Ltd.",
        "summary": "Balnibarbi Co.,Ltd. develops and manages restaurants in Japan. The company operates food, drink, and sweet shops; cafes; and commercial facilities, as well as offers lectures on entrepreneurship and management. It operates 82 stores. The company also engages in the management planning of restaurants, as well as shooting studio rental business. Balnibarbi Co.,Ltd. was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "111-0051",
        "website": "http://www.balnibarbi.com",
        "market_cap": "Micro Cap"
    },
    "3543.T": {
        "short_name": "KOMEDA HOLDINGS CO LTD",
        "long_name": "KOMEDA Holdings Co., Ltd.",
        "summary": "KOMEDA Holdings Co., Ltd. operates a chain of coffee shops in Japan. The company operates 896 stores. It is also involved in the manufacture and sale of breads; sale of other food and equipment; and sub-lease of stores. In addition, the company provides consultancy services for the construction of new stores. KOMEDA Holdings Co., Ltd. was founded in 1968 and is based in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": null,
        "website": "http://www.komeda-holdings.co.jp",
        "market_cap": "Small Cap"
    },
    "3547.T": {
        "short_name": "KUSHIKATSU TANAKA HOLDINGS CO",
        "long_name": "Kushikatsu Tanaka Holdings Co.",
        "summary": "Kushikatsu Tanaka Holdings Co. engages in the management of restaurant business. The company was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.kushi-tanaka.co.jp",
        "market_cap": "Micro Cap"
    },
    "3561.T": {
        "short_name": "CHIKARANOMOTO HOLDINGS CO LTD",
        "long_name": "Chikaranomoto Holdings Co.,Ltd.",
        "summary": "Chikaranomoto Holdings Co.,Ltd. operates restaurants in Japan and internationally. The company operates restaurants under the Ippudo, IPPUDO RAMEN EXPRESS, Five lines, Nashimatei, PANDA EXPRESS, Inaba Udon, and Ichika Bachika brand names. It also engages in the management of domestic and foreign food business; conducts various events and technical guidance classes; and offers human resource education, and consulting business. In addition, the company manufactures and sells noodles; and soups, soup stock, and seasonings. Chikaranomoto Holdings Co.,Ltd. was founded in 1979 and is headquartered in Fukuoka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "810-0041",
        "website": "http://www.chikaranomoto.com",
        "market_cap": "Micro Cap"
    },
    "5F7.F": {
        "short_name": "ZENSHO HOLDINGS CO. LTD.",
        "long_name": "Zensho Holdings Co., Ltd.",
        "summary": "Zensho Holdings Co., Ltd. manages food service chain restaurants in Japan and internationally. The company also develops sales systems and food processing systems. Its restaurants offer gyudon, udon, and hamburger steaks, as well as provides conveyor-belt sushi restaurant and coffee shop, and dining services under the Sukiya, Nakau, Coco's, Big Boy, Victoria Station, Jolly Pasta, EL Torito, Hamazushi, Hanaya Yohei, Washoku Yohei, Gyuan, Ichiban, Takarjima, Denmaru, Kyubeiya, Seto Udon, Tamon'an, Moriva Coffee, and CafÃ© Milano brands in Japan. The company also serves customers under Sukiya brand name in China, Brazil, Thailand, Malaysia, Mexico, Taiwan, and Indonesia, as well as under the Chicken Rice Shop. In addition, it operates supermarket chains; and offers residential and nursing care services for the elderly. As of June 30, 2020, it operated 9,856 stores, which include 4,316 franchised restaurants. The company was formerly known as Zensho Co., Ltd. and changed its name to Zensho Holdings Co., Ltd. in October 2011. Zensho Holdings Co., Ltd. was founded in 1982 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.zensho.co.jp",
        "market_cap": "Mid Cap"
    },
    "6082.T": {
        "short_name": "RIDE ON EXPRESS HLDGS CO LTD",
        "long_name": "RIDE ON EXPRESS HOLDINGS Co., Ltd.",
        "summary": "RIDE ON EXPRESS HOLDINGS Co., Ltd. engages in the home delivery of food in Japan. It delivers sushi under the Gin no Sara and Sushi Jojo! brands; and rice bowl with condiments, soups, and pickles under the Kamadon brand, as well as operates Fine Dine, a delivery agency service. The company was formerly known as RIDE ON EXPRESS Co., Ltd. and changed its name to RIDE ON EXPRESS HOLDINGS Co., Ltd. in October 2017. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-6317",
        "website": "http://www.rideonexpresshd.co.jp",
        "market_cap": "Micro Cap"
    },
    "7421.T": {
        "short_name": "KAPPA CREATE CO LTD",
        "long_name": "Kappa Create Co., Ltd.",
        "summary": "Kappa Create Co., Ltd. engages in the management of restaurants. It also processes and sells food products. The company was formerly known as Kappa Create Holdings Co., Ltd. and changed its name to Kappa Create Co., Ltd. in October 2015. Kappa Create Co., Ltd. was founded in 1973 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": null,
        "website": "http://www.kappa-create.co.jp",
        "market_cap": "Small Cap"
    },
    "7522.T": {
        "short_name": "WATAMI CO LTD",
        "long_name": "Watami Co., Ltd.",
        "summary": "Watami Co., Ltd. engages in the food, home food, and agriculture services business in Japan and internationally. The company operates restaurants. It also engages in organic farming, livestock, and dairy businesses; and development, construction, operation, and management of wind power generation facilities. The company was incorporated in 1967 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "144-0043",
        "website": "http://www.watami.co.jp",
        "market_cap": "Small Cap"
    },
    "7524.T": {
        "short_name": "MARCHE CORP",
        "long_name": "Marche Corporation",
        "summary": "Marche Corporation operates a chain of eateries in Japan. It operates retail stores under the Yoitoraden, Den Hakken, Ikokoroden, Umishinmaru, Kushiman, Hachiemon, BarVida, and Hermitage names. The company was founded in 1972 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "545-0021",
        "website": "http://www.marche.co.jp",
        "market_cap": "Nano Cap"
    },
    "7550.T": {
        "short_name": "ZENSHO HOLDINGS CO LTD",
        "long_name": "Zensho Holdings Co., Ltd.",
        "summary": "Zensho Holdings Co., Ltd. manages food service chain restaurants in Japan and internationally. The company also develops sales systems and food processing systems. Its restaurants offer gyudon, udon, and hamburger steaks, as well as provides conveyor-belt sushi restaurant and coffee shop, and dining services under the Sukiya, Nakau, Coco's, Big Boy, Victoria Station, Jolly Pasta, EL Torito, Hamazushi, Hanaya Yohei, Washoku Yohei, Gyuan, Ichiban, Takarjima, Denmaru, Kyubeiya, Seto Udon, Tamon'an, Moriva Coffee, and CafÃ© Milano brands in Japan. The company also serves customers under Sukiya brand name in China, Brazil, Thailand, Malaysia, Mexico, Taiwan, and Indonesia, as well as under the Chicken Rice Shop. In addition, it operates supermarket chains; and offers residential and nursing care services for the elderly. As of June 30, 2020, it operated 9,856 stores, which include 4,316 franchised restaurants. The company was formerly known as Zensho Co., Ltd. and changed its name to Zensho Holdings Co., Ltd. in October 2011. Zensho Holdings Co., Ltd. was founded in 1982 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.zensho.co.jp",
        "market_cap": "Mid Cap"
    },
    "7554.T": {
        "short_name": "KOURAKUEN HOLDINGS CORPORATION",
        "long_name": "Kourakuen Holdings Corporation",
        "summary": "Kourakuen Holdings Corporation operates a chain of restaurants under the Korakuen name in Japan. As of November 11, 2020, it operated 456 stores. The company was formerly known as Kourakuen Co., Ltd. and changed its name to Kourakuen Holdings Corporation in 2015. Kourakuen Holdings Corporation was founded in 1954 and is headquartered in Koriyama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Koriyama",
        "zipcode": "963-0724",
        "website": "http://www.kourakuen.co.jp",
        "market_cap": "Micro Cap"
    },
    "7561.T": {
        "short_name": "HURXLEY CORP",
        "long_name": "Hurxley Corporation",
        "summary": "Hurxley Corporation operates Hokka Hokka Tei franchise chain stores in Japan. Its stores offer take-out boxed lunch. The company was formerly known as Kansai Hokka-Hokka Tei Corp. and changed its name to Hurxley Corporation in July 1993. Hurxley Corporation was founded in 1980 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0014",
        "website": "http://www.hurxley.co.jp",
        "market_cap": "Micro Cap"
    },
    "7562.T": {
        "short_name": "ANRAKUTEI CO LTD",
        "long_name": "Anrakutei Co., Ltd.",
        "summary": "Anrakutei Co., Ltd. operates and manages a chain of restaurants in Japan. It is also involved in the consulting activities of restaurant management, sale of raw materials related to restaurants, and wholesale business. As of June 2020, the company operated 212 restaurants. The company was founded in 1963 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": null,
        "website": "http://www.anrakutei.co.jp",
        "market_cap": "Micro Cap"
    },
    "7581.T": {
        "short_name": "SAIZERIYA COMPANY",
        "long_name": "Saizeriya Co.,Ltd.",
        "summary": "Saizeriya Co.,Ltd. operates in the restaurant business. The company operates a chain of Italian style vegetable stores. It has 1,504 restaurants, including 1,093 restaurants in Japan and 411 restaurants internationally. The company was founded in 1973 and is headquartered in Yoshikawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yoshikawa",
        "zipcode": "342-0008",
        "website": "http://www.saizeriya.co.jp",
        "market_cap": "Small Cap"
    },
    "7604.T": {
        "short_name": "UMENOHANA CO LTD",
        "long_name": "UMENOHANA Co., Ltd.",
        "summary": "Umenohana Co., Ltd. engages in the restaurant business in Japan. It operates through Restaurant and Takeout segments. The company's restaurants offer tofu and tofu skin-based dishes, crab dishes, Chinese food, and deli items. It also provides sushi, rice, pork dumplings, tofu skin, and bento dishes through takeout stores. It operates restaurants under Umenohana, Kanishige, China Umenohana, Koichian, and Umenohana Takeout brand names. The company was formerly known as K.K. Ume Corporation and changed its name to Umenohana Co., Ltd. in October 1997. Umenohana Co., Ltd. was founded in 1979 and is headquartered in Kurume, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kurume",
        "zipcode": "833-0033",
        "website": "http://www.umenohana.co.jp",
        "market_cap": "Micro Cap"
    },
    "7611.T": {
        "short_name": "HIDAY HIDAKA CORP",
        "long_name": "Hiday Hidaka Corp.",
        "summary": "Hiday Hidaka Corp. operates a chain of restaurants in Japan. The company offers ramen and other Chinese dishes. It operates approximately 400 stores primarily in the Tokyo metropolitan area. The company was formerly known as Hidaka Commercial Co., Ltd. and changed its name to Hiday Hidaka Corp. in June 1998. Hiday Hidaka Corp. was founded in 1973 and is headquartered in Saitama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Saitama",
        "zipcode": null,
        "website": "http://www.hiday.co.jp",
        "market_cap": "Small Cap"
    },
    "7616.T": {
        "short_name": "COLOWIDE CO LTD",
        "long_name": "Colowide Co.,Ltd.",
        "summary": "Colowide Co.,Ltd., together with its subsidiaries, operates and franchises a chain of restaurants in Japan and internationally. The company also manufactures and sells pastries, baked pastries, and chocolates; manufactures, processes, and sells various foodstuffs; and processes and wholesales tuna and other sea foods. In addition, it is involved in the sale and distribution of various foodstuffs; management of store deployment; and development and operation of wireless telecommunications technology. Further, the company develops and sells Menu-kun, a self-ordering system for the food service industry; sells cigarettes and liquors; and manages karaoke rooms. It operates the Wolfgang Puck cafÃ© and express restaurant chain; and Izakaya, a Japanese-style pub. The company operates its restaurants under the GYU-KAKU, Shabu-Shabu ONYASAI, KAPPA SUSHI, and Freshness Burger brand names. It operates 1,508 direct management stores and 1,201 franchise chains. Colowide Co.,Ltd. was founded in 1963 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-8112",
        "website": "http://www.colowide.co.jp",
        "market_cap": "Small Cap"
    },
    "7621.T": {
        "short_name": "UKAI CO LTD",
        "long_name": "Ukai Co.,Ltd.",
        "summary": "Ukai Co.,Ltd. operates restaurants and museums in Japan. It operates 7 Japanese and 8 Western restaurants, as well as 3 confectionery stores. The company was founded in 1964 and is headquartered in Hachioji, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Hachioji",
        "zipcode": "193-0846",
        "website": "http://www.ukai.co.jp",
        "market_cap": "Micro Cap"
    },
    "7630.T": {
        "short_name": "ICHIBANYA CO LTD",
        "long_name": "Ichibanya Co., Ltd.",
        "summary": "Ichibanya Co., Ltd. operates and franchises curry specialty restaurants. The company operates its restaurants primarily under the CURRY HOUSE CoCo ICHIBANYA, Pasta de CoCo, Menya CoCo Ichi, and Nikkui Tei brand names. As of June 30, 2019, it operated 1,483 restaurants, including 184 directly managed and 1,119 FC member restaurants in Japan; 8 in the United States; 48 in China; 24 in Taiwan; 40 in South Korea; 28 in Thailand; 9 in Hong Kong; 4 in Singapore; 7 in Indonesia; 1 each in Malaysia, Vietnam, and the United Kingdom; and 9 in the Philippines. The company was founded in 1978 and is headquartered in Ichinomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Ichinomiya",
        "zipcode": "491-8601",
        "website": "http://www.ichibanya.co.jp",
        "market_cap": "Small Cap"
    },
    "7674.T": {
        "short_name": "NATTY SWANKY CO LTD",
        "long_name": "NATTY SWANKY Co.,Ltd",
        "summary": "NATTY SWANKY Co., Ltd. develops and manages restaurants. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0023",
        "website": "http://nattyswanky.com",
        "market_cap": "Micro Cap"
    },
    "7678.T": {
        "short_name": "ASAKUMA CO LTD",
        "long_name": "Asakuma Co.,Ltd",
        "summary": "Asakuma Co., Ltd. engages in the restaurant management and franchise business in Japan. The company was founded in 1948 and is based in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "468-0058",
        "website": "http://www.asakuma.co.jp",
        "market_cap": "Micro Cap"
    },
    "7682.T": {
        "short_name": "HAMAYUU CO LTD",
        "long_name": "Hamayuu Co.,Ltd.",
        "summary": "Hamayuu Co., Ltd. provides Chinese cuisine restaurants. As of July 31, 2019, the company operated 41 direct shops, 30 Mumu Mian stores, 3 Four Seasons Pavilion stores, and 8 Tao Lie shops. The company was founded in 1967 and is based in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "466-0815",
        "website": "http://www.hamayuu.co.jp",
        "market_cap": "Nano Cap"
    },
    "8160.T": {
        "short_name": "KISOJI CO LTD",
        "long_name": "Kisoji Co., Ltd.",
        "summary": "Kisoji Co., Ltd. operates a chain of restaurants and taverns in Japan. Its restaurants offer shabu-shabu and Japanese cuisine, chicken dishes, grilled meat, wine, and Kyushu cuisine. The company was formerly known as Matsuba Co., Ltd. and changed its name to Kisoji Co., Ltd. in February 1974. Kisoji Co., Ltd. was founded in 1950 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "466-8507",
        "website": "http://www.kisoji.co.jp",
        "market_cap": "Small Cap"
    },
    "8179.T": {
        "short_name": "ROYAL HOLDINGS CO",
        "long_name": "ROYAL HOLDINGS Co., Ltd.",
        "summary": "Royal Holdings Co., Ltd., through its subsidiaries, operates a chain of restaurants in Japan. It operates through Restaurant Business, Contract Food Service, In-Flight Catering Business, Hotel Business, and Food Manufacturing segments. The company operates restaurants under various brands, including the Royal Host; the TENDON TENYA, a tempura and tempura rice bowl restaurant; the Cowboy Family that provides salad bar, steak, and hamburgers; the Sizzler, a grill restaurant; and the Shakey's, a pizza restaurant. It also operates specialty restaurants under the Hananoki, Royal Garden Cafe, Pinkberry, The 3rd Cafe, and Rose Bakery names, as well as a hotel under the Richmond Hotel brand. In addition, the company operates restaurants and retail shops at airports, highways, department stores, convention centers, offices, hospitals, etc. Further, it produces sweets, breads, and sweet potatoes desserts; frozen cakes breads and dressings; and Halal products, as well as provides in-flight catering services. The company was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "154-8584",
        "website": "http://www.royal-holdings.co.jp",
        "market_cap": "Small Cap"
    },
    "8181.T": {
        "short_name": "TOTENKO CO LTD",
        "long_name": "Totenko Co., Ltd.",
        "summary": "Totenko Co., Ltd. operates restaurants and banquet halls in Japan. The company offers food and drinks for weddings and other events, as well as for season banquets. It operates 20 stores. The company was formerly known as Ueno Kanko Onsen Co., Ltd. and changed its name to Totenko Co., Ltd. in May 1961. Totenko Co., Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-8707",
        "website": "http://www.totenko.co.jp",
        "market_cap": "Nano Cap"
    },
    "8200.T": {
        "short_name": "RINGER HUT CO LTD",
        "long_name": "Ringer Hut Co., Ltd.",
        "summary": "Ringer Hut Co., Ltd. operates restaurants in Japan and internationally. It operates approximately 800 stores under the Nagasaki Champon Ringer Hut, Tonkatsu Bonito, and Nagasaki Takumi Hamakatsu brands. The company was formerly known as Hamakatsu Corporation and changed its name to Ringer Hut Co., Ltd. in August 1982. Ringer Hut Co., Ltd. was founded in 1962 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0032",
        "website": "http://www.ringerhut.co.jp",
        "market_cap": "Small Cap"
    },
    "8209.T": {
        "short_name": "FRIENDLY CORP",
        "long_name": "Friendly Corporation",
        "summary": "Friendly Corporation develops and operates a chain of family restaurants in the Kansai area, Japan. The company was founded in 1954 and is headquartered in Daito, Japan. As of June 11, 2018, Friendly Corporation operates as a subsidiary of Joyfull Co., Ltd..",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Daito",
        "zipcode": "574-0014",
        "website": "http://www.friendly-co.com",
        "market_cap": "Nano Cap"
    },
    "9266.T": {
        "short_name": "IKKA DINING PROJECT LTD",
        "long_name": "Ikka Dining Project.,Ltd.",
        "summary": "Ikka Dining Project., Ltd. engages in dinning and wedding business in Japan. The company is also involved in bridal business. As of March 31, 2020, it managed 69 stores; and a wedding facility. The company was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0011",
        "website": "http://www.ikkadining.co.jp",
        "market_cap": "Nano Cap"
    },
    "9279.T": {
        "short_name": "GIFT INC",
        "long_name": "Gift Inc.",
        "summary": "Gift Inc. operates restaurants in Japan and Singapore. Its restaurants offer noodles, sauces, and soups. The company was founded in 2008 and is headquartered in Machida, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Machida",
        "zipcode": null,
        "website": "http://www.gift-group.co.jp",
        "market_cap": "Micro Cap"
    },
    "9701.T": {
        "short_name": "TOKYO KAIKAN CO",
        "long_name": "Tokyo Kaikan Co., Ltd.",
        "summary": "Tokyo Kaikan Co., Ltd. operates restaurants, bars, and banquet halls in Japan. It also operates boutiques, galleries, and a cooking school; provides wedding services; and sells gifts, such as confectionery, retortable items, etc. The company was founded in 1911 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.kaikan.co.jp",
        "market_cap": "Micro Cap"
    },
    "9734.T": {
        "short_name": "SEIYOKEN",
        "long_name": "Kabushiki Kaisha Seiyoken",
        "summary": "Kabushiki Kaisha Seiyoken operates restaurants in Japan. Its restaurants offer hayashi rice, beef stew, and kamoba royal puddingThe company was founded in 1872 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "110-8715",
        "website": "http://www.seiyoken.co.jp",
        "market_cap": "Nano Cap"
    },
    "9828.T": {
        "short_name": "GENKI SUSHI CO LTD",
        "long_name": "Genki Sushi Co., Ltd.",
        "summary": "Genki Sushi Co., Ltd. operates and manages a chain of sushi stores in Japan, Hong Kong, Mainland China, and internationally. The company offers its products under the Uobei, Genki Sushi, and Senryo brands. It operates approximately 140 stores in Japan. The company was founded in 1968 and is headquartered in Utsunomiya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Utsunomiya",
        "zipcode": null,
        "website": "http://www.genkisushi.co.jp",
        "market_cap": "Micro Cap"
    },
    "9850.T": {
        "short_name": "GOURMET KINEYA CO",
        "long_name": "Gourmet Kineya Co.,Ltd.",
        "summary": "Gourmet Kineya Co.,Ltd. operates a chain of restaurants. The company was formerly known as Ryogoku Foods Co., Ltd. and changed its name to Gourmet Kineya Co.,Ltd. in September 1986. Gourmet Kineya Co.,Ltd. was incorporated in 1967 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "559-8561",
        "website": "http://www.gourmet-kineya.co.jp",
        "market_cap": "Micro Cap"
    },
    "9853.T": {
        "short_name": "GINZA RENOIR CO",
        "long_name": "Ginza Renoir Co., Ltd.",
        "summary": "Ginza Renoir Co., Ltd. manages and franchises a chain of restaurants in Japan. It operates restaurants under the Tea room Renoir, Cafe Renoir, Cafe Miyama, NEW YORKER'S Cafe, New Style !!, NEW YORKER'S Cafe, Ruyuno Coffee, My Space & Plaza, Miyama coffee, and BLENZ COFFEE brands. The company was founded in 1964 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-0011",
        "website": "http://www.ginza-renoir.co.jp",
        "market_cap": "Nano Cap"
    },
    "9861.T": {
        "short_name": "YOSHINOYA HOLDINGS CO LTD",
        "long_name": "Yoshinoya Holdings Co., Ltd.",
        "summary": "Yoshinoya Holdings Co., Ltd., through its subsidiaries, owns and operates restaurants worldwide. The company was founded in 1899 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0015",
        "website": "http://www.yoshinoya-holdings.com",
        "market_cap": "Small Cap"
    },
    "9873.T": {
        "short_name": "KFC HOLDINGS JAPAN LTD",
        "long_name": "KFC Holdings Japan, Ltd.",
        "summary": "KFC Holdings Japan, Ltd. operates restaurants in Japan. Its stores provide handmade fried chicken. The company was formerly known as Kentucky Fried Chicken Japan, Ltd. and changed its name to KFC Holdings Japan, Ltd. in 2014. KFC Holdings Japan, Ltd. was founded in 1970 and is headquartered in Yokohama, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Yokohama",
        "zipcode": "220-8586",
        "website": "http://www.kfc.co.jp",
        "market_cap": "Small Cap"
    },
    "9887.T": {
        "short_name": "MATSUYA FOODS HOLDINGS CO LTD",
        "long_name": "Matsuya Foods Holdings Co., Ltd.",
        "summary": "Matsuya Foods Holdings Co., Ltd. owns and operates restaurants in Japan, China, and Taiwan. It operates beef-on-rice and set meals chains; and pork cutlet, sushi, and Chinese noodle restaurants, as well as provides restaurant technology and management instructions to franchise stores. The company also engages in the kitchen equipment maintenance, construction supervision, water supply, drainage construction, and cleaning activities; and sale of sanitary detergents. As of March 31, 2020, it operated 1193 restaurants. The company was formerly known as Matsuya Foods Co., Ltd. Matsuya Foods Holdings Co., Ltd. was founded in 1966 and is headquartered in Musashino, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": "180-0006",
        "website": "http://www.matsuyafoods.co.jp",
        "market_cap": "Small Cap"
    },
    "9900.T": {
        "short_name": "SAGAMI HOLDINGS CORPORATION",
        "long_name": "Sagami Holdings Corporation",
        "summary": "Sagami Holdings Corporation operates a chain of Japanese cuisine/noodle restaurants in Japan and internationally. It operates restaurants under the Sagami, Ajino-Mingei, Don Don An, Aiso-Ya, SUIZAN, Seimen-Daigaku, JINJIN, SAGAMI-Tei, Dela Pasta Kitchen, BINMUGI, HAMACHO, BUBUKA, KATSUTANI, and SAGAMI Milano Centrale names. The company also manufactures, processes, and sells noodles, cut vegetables, and beverages; manages franchise and overseas outlets; and manufactures, imports, exports, and sells food and restaurant related materials. In addition, the company is involved in the menu development. Sagami Holdings Corporation was founded in 1970 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "463-8535",
        "website": "http://www.sagami-holdings.co.jp",
        "market_cap": "Micro Cap"
    },
    "9936.T": {
        "short_name": "OHSHO FOOD SERVICE CORP",
        "long_name": "Ohsho Food Service Corp.",
        "summary": "Ohsho Food Service Corp. operates and franchises a chain of Chinese restaurants under the Gyoza OHSHO brand in Japan. As of March 31, 2019, it had a network of 516 directly operated and 213 franchised outlets. The company was founded in 1967 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kyoto",
        "zipcode": "607-8307",
        "website": "http://www.ohsho.co.jp",
        "market_cap": "Small Cap"
    },
    "9942.F": {
        "short_name": "JOYFULL CO LTD",
        "long_name": "Joyfull Co., Ltd.",
        "summary": "Joyfull Co., Ltd. operates a chain of family restaurants in Japan. The company's restaurants offer meals, hamburgers, snacks, desserts, alcoholic beverages, and others. As of May 31, 2018, it operated 801 Joyful stores. The company was founded in 1976 and is based in Oita, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Oita",
        "zipcode": "870-0141",
        "website": "http://www.joyfull.co.jp",
        "market_cap": "Micro Cap"
    },
    "9945.T": {
        "short_name": "PLENUS CO LTD",
        "long_name": "Plenus Company Limited",
        "summary": "Plenus Company Limited engages in the food business in Japan and internationally. It operates and franchises restaurant chains under the Hotto Motto, YAYOI, Yayoiken, and MK RESTAURANT names. The company also engages in the sale of foodstuffs and packaging materials; development, sale, and maintenance of IT systems for the food-service industry; research, development, production, and sale of various seasonings and processed foods; and processing and sale of marine products. As of February 29, 2020, it operated 2,909 shops, including 1,161 directly managed shops and 1,748 franchised shops. The company was formerly known as Taiyo Co., Ltd. and changed its name to Plenus Company Limited in December 1990. Plenus Company Limited was founded in 1960 and is headquartered in Fukuoka City, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka City",
        "zipcode": "812-8580",
        "website": "http://www.plenus.co.jp",
        "market_cap": "Small Cap"
    },
    "9950.T": {
        "short_name": "HACHI-BAN CO",
        "long_name": "Hachi-Ban Co., Ltd.",
        "summary": "Hachi-Ban Co., Ltd. engages in the restaurant management business. The company also produces and sells food products, and soups and extracts; and sells, imports, and exports foods and seasonings. In addition, it is involved in the restaurant franchise and property letting business. As of January 21, 2021, it operated 134 stores in Japan and 144 stores internationally. The company was founded in 1971 and is headquartered in Kanazawa, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kanazawa",
        "zipcode": "921-8582",
        "website": "http://www.hachiban.co.jp",
        "market_cap": "Micro Cap"
    },
    "9969.T": {
        "short_name": "SHOKUBUN CO LTD",
        "long_name": "Shokubun Co.,Ltd.",
        "summary": "Shokubun Co., Ltd. engages in the home delivery of general household ingredients. It is also involved in the businesses of commercial grocery sales. The company was incorporated in 1977 and is headquartered in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "463-8536",
        "website": "http://www.shokubun.co.jp",
        "market_cap": "Nano Cap"
    },
    "9973.T": {
        "short_name": "KOZOSUSHI CO LTD",
        "long_name": "Kozosushi Co., LTD.",
        "summary": "Kozosushi Co., LTD. engages in the manufacture and sale of sushi and boxed lunches in Japan. It also supplies raw materials; and provides training as franchiser to franchisees. The company was founded in 1964 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0045",
        "website": "http://www.kozosushi.co.jp",
        "market_cap": "Micro Cap"
    },
    "9979.T": {
        "short_name": "DAISYO CORP",
        "long_name": "Daisyo Corporation",
        "summary": "Daisyo Corporation operates a chain of restaurants in Japan. It also operates a bar, a cafÃ©, and a bakery; engages in sushi and meat businesses; and distributes food ingredients to restaurants. Daisyo Corporation was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "143-0016",
        "website": "http://www.daisyo.co.jp",
        "market_cap": "Micro Cap"
    },
    "MDNDF": {
        "short_name": "MCDONALD'S HOLDINGS COMPANY(JAP",
        "long_name": "McDonald's Holdings Company (Japan), Ltd.",
        "summary": "McDonald's Holdings Company (Japan), Ltd. operates a chain of hamburger restaurants in Japan. As of December 31, 2020, it operated 2,924 restaurants. The company was formerly known as Japan McDonald's K.K. and changed its name to McDonald's Holdings Company (Japan), Ltd. in July 2002. McDonald's Holdings Company (Japan), Ltd. was founded in 1971 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-1339",
        "website": "http://www.mcd-holdings.co.jp",
        "market_cap": "Mid Cap"
    },
    "MJ8.F": {
        "short_name": "MCDONALD S HLDG CO.J.",
        "long_name": "McDonald's Holdings Company (Japan), Ltd.",
        "summary": "McDonald's Holdings Company (Japan), Ltd. operates a chain of hamburger restaurants in Japan. As of December 31, 2020, it operated 2,924 restaurants. The company was formerly known as Japan McDonald's K.K. and changed its name to McDonald's Holdings Company (Japan), Ltd. in July 2002. McDonald's Holdings Company (Japan), Ltd. was founded in 1971 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-1339",
        "website": "http://www.mcd-holdings.co.jp",
        "market_cap": "Mid Cap"
    },
    "PF9.SG": {
        "short_name": "Pepper Food Service Co. Ltd. Re",
        "long_name": "Pepper Food Service Co., Ltd.",
        "summary": "Pepper Food Service Co., Ltd. operates restaurants in Japan and internationally. It operates through Pepper Lunch, Ikinari! Steak, Other Restaurants, and Own-brand products segments. The company owns and franchises restaurants primarily under the Pepper Lunch and Ikinari! Steak brands. It also franchises and operates other restaurants, such as Chargrilled Steak Kuni, a cut-to-order steak restaurant; Kodawari Tonkatsu Katsukitei, a pork cutlet restaurant; and Gyutan Natori, a beef tongue restaurant. In addition, the company sells various specialty products at restaurants and wholesale, including tonkatsu sauce, frozen pepper rice, dressings, steak sauce, and other food items; and through online comprising frozen Hamburg steak, frozen pepper rice, frozen beef tongue, the Ikinari! Steak set, dressings, steak sauce, and clear masks for food service workers. As of March 31, 2019, it operated 478 Pepper Lunch restaurants, including 56 directly-owned and 422 franchised; 439 Ikinari! Steak restaurants, such as 283 directly-owned and 156 franchised; and 15 other restaurants, as well as contracted with 41 separate outsourced operators. The company was founded in 1970 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.pepper-fs.co.jp",
        "market_cap": "Micro Cap"
    },
    "SKX.F": {
        "short_name": "SKYLARK",
        "long_name": "Skylark Holdings Co., Ltd.",
        "summary": "Skylark Holdings Co., Ltd. operates restaurants in Japan and internationally. The company also engages in the provision of food services; and related businesses. It operates Western, Chinese, Japanese, Sushi, and Italian restaurants primarily under the Gusto, Bamiyan, JonathanÂ´s, Syabuyo, Yumean, Steak Gusto, Karayoshi, Grazie Gardens, Aiya, Musashi No Mori Coffee, S Gusto, Totoyamichi, chawan, Tonkaratei, Yumean Shokudo, Bamiyan Ken, miwami, Tomato and Onion, Jyu-Jyu Karubi, and FLO PRESTIGE brand names. The company also provides delivery and take-out services. As of December 31, 2020, it operated 3,119 stores. The company was formerly known as Skylark Co., Ltd. and changed its name to Skylark Holdings Co., Ltd. in July 2018. Skylark Holdings Co., Ltd. was founded in 1962 and is based in Musashino, Japan.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Musashino",
        "zipcode": "180-8580",
        "website": "http://www.skylark.co.jp",
        "market_cap": "Mid Cap"
    }
}