{
    "6030.T": {
        "short_name": "ADVENTURE INC",
        "long_name": "Adventure Inc.",
        "summary": "Adventure Inc. engages in the online travel business in Japan. It operates an online reservation platform. The company was formerly known as Cyber Travel Co,. Ltd. and changed its name to Adventure Inc. in June 2013. Adventure Inc. was founded in 2006 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-6024",
        "website": "http://jp.adventurekk.com",
        "market_cap": 48144896000
    },
    "6191.T": {
        "short_name": "AIRTRIP CORP",
        "long_name": "AirTrip Corp.",
        "summary": "AirTrip Corp. engages in the online travel agency business in Japan. It offers business travel management and other services. The company also offers IT offshore development project services, such as lab-type offshore development and BPO services. In addition, it engages in investment business. The company was formerly known as Evolable Asia Corp. and changed its name to AirTrip Corp. in January 2020. AirTrip Corp. was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-6219",
        "website": "http://www.evolableasia.com",
        "market_cap": 62576513024
    },
    "6548.T": {
        "short_name": "TABIKOBO CO LTD",
        "long_name": "Tabikobo Co. Ltd.",
        "summary": "Tabikobo Co. Ltd. engages in the travel business in Japan and internationally. The company provides various travel support services. It offers travel arrangements for corporations, such as overseas business trips, MICE, incentive travel, company, study, and group trips, as well as concert and event services. The company also provides online tour booking services. Tabikobo Co. Ltd. was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "170-6046",
        "website": "http://www.tabikobo.com",
        "market_cap": 5172460544
    },
    "6561.T": {
        "short_name": "HANATOUR JAPAN CO LTD",
        "long_name": "Hanatour Japan Co., Ltd.",
        "summary": "Hanatour Japan Co., Ltd. operates as a travel company in Japan and internationally. The company arranges inbound travel services from South Korea, China, Southeast Asia, Europe, and America; and arranges and sells accommodation-only products through guest room sales site, JAPAN TOMARU. It also operates JAPAN TOPKEN, an online sales site that sells admission tickets for tourist destinations, transportation passes, and optional tour products; and Gorilla, a sales site, which provides travel services, as well as sells travel products, such as hotels, various tickets, transportation passes, optional tours, and restaurant tickets. In addition, the company engages in the general charter passenger car transportation business; hotel management; and software and Web system development, operation, and maintenance businesses. The company was founded in 2005 and is headquartered in Tokyo, Japan. Hanatour Japan Co., Ltd. is a subsidiary of Hanatour Service Inc.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0003",
        "website": "http://www.hanatourjapan.jp",
        "market_cap": 12185910272
    },
    "6577.T": {
        "short_name": "BESTONE.COM CO LTD",
        "long_name": "Bestone.Com Co.,Ltd",
        "summary": "Bestone.Com Co.,Ltd operates as an online travel agent. It engages in arranging cruise travel packages. Bestone.Com Co.,Ltd offers its products through its Websites best1cruise.com and hunemoon.com. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.best1cruise-corp.info",
        "market_cap": 3966017280
    },
    "7048.T": {
        "short_name": "VELTRA CORP",
        "long_name": "VELTRA Corporation",
        "summary": "Veltra Corporation operates a tour and activity booking site for travelers worldwide. The company operates VELTRA, a site that provides approximately 4,500 tours and activities, such as sightseeing tours, spa escapes, interactive cultural programs, and other activities. It also operates hawaiiactivities.com, a reservation site specializing in activities in Hawaii. The company was founded in 1991 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0031",
        "website": "http://www.veltra.com",
        "market_cap": 26452240384
    },
    "9085.S": {
        "short_name": "HOKKAIDO CHUO BUS CO",
        "long_name": "Hokkaido Chuo Bus Co., Ltd.",
        "summary": "Hokkaido Chuo Bus Co., Ltd. provides passenger car transportation services in Japan. It is also involved in real estate, restaurant, hotel, and public bath businesses. The company was founded in 1943 and is headquartered in Otaru, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "SAP",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Otaru",
        "zipcode": null,
        "website": "http://www.chuo-bus.co.jp",
        "market_cap": 9880155136
    },
    "9376.T": {
        "short_name": "EURASIA TRAVEL CO",
        "long_name": "Eurasia Travel Co., Ltd.",
        "summary": "Eurasia Travel Co., Ltd. provides travel agency services in Japan and internationally. It offers travel planning and arrangement services, as well as engages in overseas travel insurance business. The company serves individuals, corporations, and groups. Eurasia Travel Co., Ltd. was founded in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-8642",
        "website": "http://www.eurasia.co.jp",
        "market_cap": 2391119872
    },
    "9726.T": {
        "short_name": "KNT-CT HOLDINGS LIMITED",
        "long_name": "KNT-CT Holdings Co., Ltd.",
        "summary": "KNT-CT Holdings Co., Ltd., together with its subsidiaries, provides travel services in Japan. It also sells airline tickets; and offers reinsurance underinsurance products. The company was formerly known as Kinki Nippon Tourist Co., Ltd. and changed its name to KNT-CT Holdings Co., Ltd. in January 2013. KNT-CT Holdings Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan. KNT-CT Holdings Co., Ltd. is a subsidiary of Kintetsu Group Holdings Co.,Ltd.",
        "currency": "JPY",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0239",
        "website": "http://www.kntcthd.co.jp/en",
        "market_cap": 42105053184
    }
}