{
    "A2M.AX": {
        "short_name": "A2 MILK FPO NZ",
        "long_name": "The a2 Milk Company Limited",
        "summary": "The a2 Milk Company Limited, together with its subsidiaries, sells A2 protein type branded milk and related products in Australia, New Zealand, China, other Asian countries, and the United States. The company offers fresh milk under the a2 Milk brand; and infant formula under the a2 Platinum brand. The company was formerly known as A2 Corporation Limited and changed its name to The a2 Milk Company Limited in April 2014. The a2 Milk Company Limited was founded in 2000 and is based in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.thea2milkcompany.com",
        "market_cap": "Mid Cap"
    },
    "ACOPF": {
        "short_name": "THE A2 MILK COMPANY LTD",
        "long_name": "The a2 Milk Company Limited",
        "summary": "The a2 Milk Company Limited, together with its subsidiaries, sells A2 protein type branded milk and related products in Australia, New Zealand, China, other Asian countries, and the United States. The company offers fresh milk under the a2 Milk brand; and infant formula under the a2 Platinum brand. The company was formerly known as A2 Corporation Limited and changed its name to The a2 Milk Company Limited in April 2014. The a2 Milk Company Limited was founded in 2000 and is based in Auckland, New Zealand.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.thea2milkcompany.com",
        "market_cap": "Mid Cap"
    },
    "ACOPY": {
        "short_name": "THE A2 MILK COMPANY LTD UNSPON ",
        "long_name": "The a2 Milk Company Limited",
        "summary": "The a2 Milk Company Limited, together with its subsidiaries, sells A2 protein type branded milk and related products in Australia, New Zealand, China, other Asian countries, and the United States. The company offers fresh milk under the a2 Milk brand; and infant formula under the a2 Platinum brand. The company was formerly known as A2 Corporation Limited and changed its name to The a2 Milk Company Limited in April 2014. The a2 Milk Company Limited was founded in 2000 and is based in Auckland, New Zealand.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.thea2milkcompany.com",
        "market_cap": "Mid Cap"
    },
    "AFC.NZ": {
        "short_name": "AFC Group Holdings Limited Ordi",
        "long_name": "AFC Group Holdings Limited",
        "summary": "AFC Group Holdings Limited, together with its subsidiaries, produces, manufactures, and purchases food, health, and cosmetic products for distribution in Australia, China, and New Zealand. It operates through three segments: Corporate, Vineyard and Winery, and Manufacturing. The company's products include milk, honey, wine, beef, mutton, and health and skin care products. The company also produces and sells varietals and blends of wine; and manufactures cosmetic face masks under the DDMASK brand. In addition, it distributes food products, cosmetics, and health products. The company was formerly known as Australasian Food Corporation Limited and changed its name to AFC Group Holdings Limited in September 2016. AFC Group Holdings Limited was incorporated in 2006 and is headquartered in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2013",
        "website": "http://www.afcnz.com",
        "market_cap": "Small Cap"
    },
    "ALF.NZ": {
        "short_name": "Allied Farmers Limited Ordinary",
        "long_name": "Allied Farmers Limited",
        "summary": "Allied Farmers Limited, through its subsidiaries, sells and purchases livestock in New Zealand. The company engages in the procurement, processing, and sale of calves. It also provides livestock financing, rural, and nominee services; rural finance; and online services through its MyLivestock website. The company was formerly known as The Farmers Co-operative Organisation Society of New Zealand Limited and changed its name to Allied Farmers Limited in 1996. Allied Farmers Limited was founded in 1913 and is based in Stratford, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Stratford",
        "zipcode": "4332",
        "website": "http://www.alliedfarmers.co.nz",
        "market_cap": "Small Cap"
    },
    "ATM.NZ": {
        "short_name": "The a2 Milk Company Limited Ord",
        "long_name": "The a2 Milk Company Limited",
        "summary": "The a2 Milk Company Limited, together with its subsidiaries, sells A2 protein type branded milk and related products in Australia, New Zealand, China, other Asian countries, and the United States. The company offers fresh milk under the a2 Milk brand; and infant formula under the a2 Platinum brand. The company was formerly known as A2 Corporation Limited and changed its name to The a2 Milk Company Limited in April 2014. The a2 Milk Company Limited was founded in 2000 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.thea2milkcompany.com",
        "market_cap": "Mid Cap"
    },
    "CGF.NZ": {
        "short_name": "Cooks Global Foods Limited Ordi",
        "long_name": "Cooks Global Foods Limited",
        "summary": "Cooks Global Foods Limited, together with its subsidiaries, operates in the food and beverage industry. The company operates and franchises Esquires Coffee outlets in the United Kingdom, Ireland, Portugal, Bahrain, Kuwait, Syria, Saudi Arabia, Jordan, Pakistan, Indonesia, Canada, and China. It also supplies tea/coffee/beverages and fresh produce. In addition, the company engages in holding intellectual property, and the store and office lease holding business, as well as the provision of nominee and name protection services. Cooks Global Foods Limited was incorporated in 2008 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.cooksglobalfoods.com",
        "market_cap": "Small Cap"
    },
    "DGL.NZ": {
        "short_name": "Delegat Group Limited Ordinary ",
        "long_name": "Delegat Group Limited",
        "summary": "Delegat Group Limited produces, markets, distributes, and sells wine. The company markets and sells its products primarily under the Oyster Bay and Barossa Valley Estate brands, as well as under the Delegat name to retailers and distributors in the United Kingdom, Ireland, and rest of Europe; and the United States, Canada, Australia, New Zealand, and the Asia Pacific. It also provides brand marketing services. The company was formerly known as Delegat's Group Limited and changed its name to Delegat Group Limited in July 2014. Delegat Group Limited was founded in 1947 and is based in Auckland, New Zealand. Delegat Group Limited is a subsidiary of Delegat Share Protection Trust.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Wineries & Distilleries",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.delegat.com",
        "market_cap": "Small Cap"
    },
    "EVO.AX": {
        "short_name": "EVOLVE EDU FPO NZX",
        "long_name": "Evolve Education Group Limited",
        "summary": "Evolve Education Group Limited provides early childhood education (ECE) services in New Zealand and Australia. The company operates and manages ECE centers. It operates approximately 126 center-based ECE facilities under the Lollipops, Cubby Care, Active Explorers, Learning Adventures, Little Earth Montessori, Little Lights, Little Wonders, and Pascals brand names. The company was incorporated in 2014 and is based in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.evolveeducation.co.nz",
        "market_cap": "Small Cap"
    },
    "EVO.NZ": {
        "short_name": "Evolve Education Group Limited ",
        "long_name": "Evolve Education Group Limited",
        "summary": "Evolve Education Group Limited provides early childhood education (ECE) services in New Zealand and Australia. The company operates and manages ECE centers. It operates approximately 126 center-based ECE facilities under the Lollipops, Cubby Care, Active Explorers, Learning Adventures, Little Earth Montessori, Little Lights, Little Wonders, and Pascals brand names. The company was incorporated in 2014 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.evolveeducation.co.nz",
        "market_cap": "Small Cap"
    },
    "FCG.NZ": {
        "short_name": "Fonterra Co-operative Group Lim",
        "long_name": "Fonterra Co-operative Group Limited",
        "summary": "Fonterra Co-operative Group Limited, together with its subsidiaries, collects, manufactures, and sells milk and milk-derived products. The company offers milk powders, butter, and cheese products. It also engages in the fast-moving consumer goods and foodservice businesses. In addition, the company operates 70 Farm Source retail stores; and engages in farming of fresh milk. It provides its products primarily under the Anchor, Anmum, Anlene, NZMP, Farm Source, De Winkel, Fresh 'n Fruity, Kapiti, Mainland, Mammoth, Perfect Italiano, Piako, Primo, and Symbio brands. The company has operations in New Zealand, China, rest of Asia, Australia, the United States, Europe, Latin America, and internationally. Fonterra Co-operative Group Limited was founded in 2001 and is headquartered in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Food Distribution",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.fonterra.com",
        "market_cap": "Mid Cap"
    },
    "FWL.NZ": {
        "short_name": "Foley Wines Limited Ordinary Sh",
        "long_name": "Foley Wines Limited",
        "summary": "Foley Wines Limited, an integrated wine company, produces, markets, and sells wines in New Zealand. It offers wines under the Martinborough Vineyard, Te Kairanga, Lighthouse Gin, Grove Mill, Vavasour, and Mt Difficulty brands. It also exports its products. The company was formerly known as Foley Family Wines Limited and changed its name to Foley Wines Limited in December 2018. Foley Family Wines Limited was incorporated in 1986 and is headquartered in Blenheim, New Zealand. Foley Wines Limited is a subsidiary of Foley Family Wines Holdings, New Zealand Limited.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Wineries & Distilleries",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Blenheim",
        "zipcode": "7276",
        "website": "http://www.foleywines.co.nz",
        "market_cap": "Small Cap"
    },
    "HVM.AX": {
        "short_name": "HAPPY VAL FPO",
        "long_name": "Happy Valley Nutrition Limited",
        "summary": "Happy Valley Nutrition Limited focuses on producing, supplying, and selling of infant milk formula (IMF) and other nutritional products in New Zealand. The company was formerly known as Happy Valley Milk Limited and changed its name to Happy Valley Nutrition Limited in September 2019. Happy Valley Nutrition Limited was incorporated in 2016 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1052",
        "website": "http://www.hvn.co.nz",
        "market_cap": "Small Cap"
    },
    "JLG.NZ": {
        "short_name": "Just Life Group Limited Ordinar",
        "long_name": "Just Life Group Limited",
        "summary": "Just Life Group Limited provides filtered water solutions to business and residential customers in New Zealand. It also offers natural light and ventilation systems to enhance living spaces. The company was formerly known as Just Water International Limited and changed its name to Just Life Group Limited in February 2019. Just Life Group Limited was founded in 1987 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Non-Alcoholic",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.jwi.co.nz",
        "market_cap": "Small Cap"
    },
    "KTD.AX": {
        "short_name": "KEYTONE FPO",
        "long_name": "Keytone Dairy Corporation Limited",
        "summary": "Keytone Dairy Corporation Limited, together with its subsidiary, manufactures and exports dairy, health and wellness, and nutrition products in New Zealand and Australia. It offers powdered milk nutritional products, including whole milk powder, skim milk powder, colostrum milk powder, and kiwifruit milk powder under the KeyDairy brand name; and health supplement capsules for the treatment of acne and natural beauty products under the KeyHealth and FaceClear names. The company also provides contract manufacturing and packaging services for milk powders, sports nutrition products, and health products; food service products, such as yoghurt powder blends, ice cream powder blends, fruit smoothie blends, and milk shake powder blends; and animal nutrition powdered blends and special patient powder blends. It serves retailers, distributors, and industrial customers. The company also exports its products to China, Vietnam, Hong Kong, Taiwan, Malaysia, Japan, Korea, Australia, and the European Union. Keytone Dairy Corporation Limited was founded in 2011 and is headquartered in Christchurch, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8042",
        "website": "http://www.keytonedairy.com",
        "market_cap": "Small Cap"
    },
    "LIC.NZ": {
        "short_name": "Livestock Improvement Corporati",
        "long_name": "Livestock Improvement Corporation Limited",
        "summary": "Livestock Improvement Corporation Limited, together with its subsidiaries, develops, produces, and markets artificial breeding, genetics, farm software, farm automation, and herd testing services. The company operates in four segments: NZ Market Genetics, Herd Testing, Farm Software, and Farm Automation. The NZ Market Genetics segment provides bovine genetic breeding materials, and related services to dairy farmers. The Herd Testing segment offers herd testing and animal recording services for pastoral farmers. The Farm Software segment provides data recording and farm management information services. The Farm Automation segment offers dairy automated equipment and technology. The company is also involved in the provision of diagnostic, animal health, research and development, and support services. It operates in New Zealand, Australia, Ireland, the United Kingdom, and internationally. Livestock Improvement Corporation Limited was founded in 1909 and is headquartered in Hamilton, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Hamilton",
        "zipcode": null,
        "website": "http://www.lic.co.nz",
        "market_cap": "Small Cap"
    },
    "MEE.NZ": {
        "short_name": "Me Today Limited Ordinary Share",
        "long_name": "Me Today Limited",
        "summary": "Me Today Limited, through its subsidiaries, operates as a health and wellness company in New Zealand. The company offers range of supplement products from general health to immune function, energy, sleep, beauty, mobility, and relaxation. It also provides skincare products, such as micellar gel, cream cleanser, mist toner, moisturizer, serum, eye and night cream, facemask, lip balm, hand cream, hand wash, and hand lotion. In addition, it sells and markets third party brands, including life space, artemis, and sleep drop products. Me Today Limited is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1061",
        "website": "http://www.metoday.com",
        "market_cap": "Small Cap"
    },
    "MWE.NZ": {
        "short_name": "Marlborough Wine Estates Group ",
        "long_name": "Marlborough Wine Estates Group Limited",
        "summary": "Marlborough Wine Estates Group Limited, together with its subsidiaries, operates in the wine industry in New Zealand, the United States, China, and internationally. It owns and operates 6 vineyard blocks comprising approximately 336 hectares located in the Awatere Valley in Marlborough; produces and sells grapes; and produces, sells, and markets wine under the O:TU and Music Bay brand names. The company was incorporated in 2015 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Wineries & Distilleries",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": null,
        "website": "http://www.nzmwe.com",
        "market_cap": "Small Cap"
    },
    "NZK.AX": {
        "short_name": "NZKSALMON FPO NZX",
        "long_name": "New Zealand King Salmon Investments Limited",
        "summary": "New Zealand King Salmon Investments Limited, together with its subsidiaries, engages in the farming, processing, and sale of premium salmon products. It offers whole fish, fillets, steaks, portions, wood roasted, cold smoked, and other products. The company sells its products to chefs, retailers, and wholesalers under the Ora King, Regal, Southern Ocean, Big Catch Salmon Burley, and Omega Plus brands, as well as the New Zealand King Salmon label. It serves customers in New Zealand, China, North America, Australia, Japan, Europe, and internationally. The company was incorporated in 2008 and is headquartered in Nelson, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Nelson",
        "zipcode": "7011",
        "website": "http://www.kingsalmon.co.nz",
        "market_cap": "Small Cap"
    },
    "NZK.NZ": {
        "short_name": "NZ King Salmon Investments Limi",
        "long_name": "New Zealand King Salmon Investments Limited",
        "summary": "New Zealand King Salmon Investments Limited, together with its subsidiaries, engages in the farming, processing, and sale of premium salmon products. It offers whole fish, fillets, steaks, portions, wood roasted, cold smoked, and other products. The company sells its products to chefs, retailers, and wholesalers under the Ora King, Regal, Southern Ocean, Big Catch Salmon Burley, and Omega Plus brands, as well as the New Zealand King Salmon label. It serves customers in New Zealand, China, North America, Australia, Japan, Europe, and internationally. The company was incorporated in 2008 and is headquartered in Nelson, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Nelson",
        "zipcode": "7011",
        "website": "http://www.kingsalmon.co.nz",
        "market_cap": "Small Cap"
    },
    "PHL.NZ": {
        "short_name": "Promisia Healthcare Limited Ord",
        "long_name": "Promisia Healthcare Limited",
        "summary": "Promisia Healthcare Limited provides healthcare services in New Zealand. It operates three aged care facilities. The company was formerly known as Promisia Integrative Limited and changed its name to Promisia Healthcare Limited in February 2021. Promisia Healthcare Limited was incorporated in 1983 and is based in Wellington, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Wellington",
        "zipcode": "6011",
        "website": "http://www.promisia.com",
        "market_cap": "Small Cap"
    },
    "S05.F": {
        "short_name": "SCALES CORP. LTD",
        "long_name": "Scales Corporation Limited",
        "summary": "Scales Corporation Limited engages in the agribusiness activities in New Zealand. The company operates through Food Ingredients, Horticulture, and Logistics segments. The Food Ingredients segment processes and markets food ingredients, such as pet food ingredients and juice concentrates. This segment also manufactures and sells apple, kiwifruit, and pear juice concentrates. The Horticulture segment is involved in growing, packaging, marketing, and exporting apples under the Mr Apple, Fern Ridge Fresh, Dazzle, and Posy brands. The Logistics segment provides supply chain services for exporters, importers, and FMCG businesses. This segment also engages in the sea and air freight of produce. It also provides insurance services. The company was founded in 1897 and is headquartered in Christchurch, New Zealand.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8013",
        "website": "http://scalescorporation.co.nz",
        "market_cap": "Small Cap"
    },
    "SAN.NZ": {
        "short_name": "Sanford Limited (NS) Ordinary S",
        "long_name": "Sanford Limited",
        "summary": "Sanford Limited engages in farming, harvesting, processing, storing, and marketing of seafood products. It operates through Wildcatch and Aquaculture segments. The company catches and processes inshore and deepwater fish species, as well as farms, harvests, and processes mussels and salmon. Its seafood products include antarctic toothfish, arrow squid, barracouta, blue mackerel, gemfish, ghost shark, greenshell mussels, hake, hapuku, hoki, jack mackerel, john dory, kahawai, king salmon, lemon sole, ling, monkfish, new zealand sole, orange roughy, patagonian toothfish, red cod, scampi, silver warehou, smooth oreo dory, snapper, southern blue whiting, trevally, and yellowbelly flounder. The company also provides auction, wharf, and research services; and retails and wholesales seafood. It operates in New Zealand and Australia; Europe; North America; Japan, China, Hong Kong, South Korea, and the rest of Asia; Africa; the Middle East; the Pacific; and Central and South America. Sanford Limited was founded in 1881 and is headquartered in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1010",
        "website": "http://www.sanford.co.nz",
        "market_cap": "Small Cap"
    },
    "SCL.NZ": {
        "short_name": "Scales Corporation Limited Ordi",
        "long_name": "Scales Corporation Limited",
        "summary": "Scales Corporation Limited engages in the agribusiness activities in New Zealand. The company operates through Food Ingredients, Horticulture, and Logistics segments. The Food Ingredients segment processes and markets food ingredients, such as pet food ingredients and juice concentrates. This segment also manufactures and sells apple, kiwifruit, and pear juice concentrates. The Horticulture segment is involved in growing, packaging, marketing, and exporting apples under the Mr Apple, Fern Ridge Fresh, Dazzle, and Posy brands. The Logistics segment provides supply chain services for exporters, importers, and FMCG businesses. This segment also engages in the sea and air freight of produce. It also provides insurance services. The company was founded in 1897 and is headquartered in Christchurch, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Christchurch",
        "zipcode": "8013",
        "website": "http://scalescorporation.co.nz",
        "market_cap": "Small Cap"
    },
    "SEK.NZ": {
        "short_name": "Seeka Limited Ordinary Shares",
        "long_name": "Seeka Limited",
        "summary": "Seeka Limited, together with its subsidiaries, provides orchard lease and management, and post harvest services to the horticulture industry primarily in New Zealand. It operates through Orchard Operations, Post Harvest Operations, and Retail Service Operations segments. The Orchard Operations segment offers on-orchard management services to orchard owners who produce kiwifruit, avocado, and kiwiberry crops. The Post Harvest Operations segment provides post-harvest services to the kiwifruit, avocado, and kiwiberry industries that include crops from the company's orchard management and lease operations, as well as crops from independent orchard owners. The Retail Service Operations segment offers fruit marketing services; and retail and ripening services for imported fruit produce, and operates a wholesale market. It also produces and sells apricots, avocado, cherries, European pears, kiwiberry, kiwifruit, nashi pears, plums, bananas, pineapple, and organics, as well as kiwi crush, kiwi crushies, and avocado oil to the retail sector and hospitals. The company was formerly known as Seeka Kiwifruit Industries Limited and changed its name to Seeka Limited in October 2016. Seeka Limited was founded in 1987 and is headquartered in Te Puke, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Te Puke",
        "zipcode": "3153",
        "website": "http://www.seeka.co.nz",
        "market_cap": "Small Cap"
    },
    "SM1.AX": {
        "short_name": "SYNLAIT FPO NZX",
        "long_name": "Synlait Milk Limited",
        "summary": "Synlait Milk Limited, together with its subsidiaries, manufactures and sells dairy products in China, rest of Asia, the Middle East, Africa, New Zealand, Australia, and internationally. The company is also involved in the processing, packaging, and marketing of dairy products, including cheese, butter, ice cream, and milk powder under the Alpine, Rolling, Meadow, Dairyworks, and Deep South brands. It offers liquid milk; milk powder related products; nutritional products, such as infant and adult nutritional powders; ingredients comprising skim milk powders and anhydrous milk fat; and specialized nutritional ingredients, such as lactoferrin. The company was founded in 2005 and is headquartered in Rakaia, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Rakaia",
        "zipcode": "7783",
        "website": "http://www.synlait.com",
        "market_cap": "Small Cap"
    },
    "SML.NZ": {
        "short_name": "Synlait Milk Limited (NS) Ordin",
        "long_name": "Synlait Milk Limited",
        "summary": "Synlait Milk Limited, together with its subsidiaries, manufactures and sells dairy products in China, rest of Asia, the Middle East, Africa, New Zealand, Australia, and internationally. The company is also involved in the processing, packaging, and marketing of dairy products, including cheese, butter, ice cream, and milk powder under the Alpine, Rolling, Meadow, Dairyworks, and Deep South brands. It offers liquid milk; milk powder related products; nutritional products, such as infant and adult nutritional powders; ingredients comprising skim milk powders and anhydrous milk fat; and specialized nutritional ingredients, such as lactoferrin. The company was founded in 2005 and is headquartered in Rakaia, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Rakaia",
        "zipcode": "7783",
        "website": "http://www.synlait.com",
        "market_cap": "Small Cap"
    },
    "SVR.NZ": {
        "short_name": "Savor Limited Ordinary Shares",
        "long_name": "Savor Limited",
        "summary": "Savor Limited operates in the hospitality sector in New Zealand. It operates restaurants and bars. The company was founded in 2003 and is based in Auckland, New Zealand.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Beverages - Brewers",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1143",
        "website": "http://www.savour.co.nz",
        "market_cap": "Small Cap"
    },
    "TGG.NZ": {
        "short_name": "T&G Global Limited Ordinary Sha",
        "long_name": "T&G Global Limited",
        "summary": "T&G Global Limited, together with its subsidiaries, grows, markets, distributes, and exports fresh produce under the JAZZ, envy, enza, pacific rose, LOTATOES, sunfirst, BEEKIST, and ORCHARD RD brands. It operates through Apples, International Produce, New Zealand Produce, Processed Foods, and Other segments. The company offers apples, pears, grapes, kiwifruit, asparagus, and tomatoes; citrus products, including lemons, mandarins, navel oranges, limes, grapefruit, and tangelos; cherries; blueberries, strawberries, and kiwi berries; and other stone fruits, as well as potatoes and other produce. It also cool stores and packs apples; sells, trades in, and markets processed foods; and engages in the horticulture, fruit and produce wholesale distribution, and fruit variety development and propagation activities. In addition, the company is involved in the processed foods broking, captive insurance provision, leased property holding, and water supply businesses, as well as the provision of in-market and fruit import and shared services. It sells its fresh produce in approximately 60 countries. The company was formerly known as Turners & Growers Limited and changed its name to T&G Global Limited in May 2015. The company was founded in 1883 and is headquartered in Auckland, New Zealand. T&G Global Limited is a subsidiary of BayWa Aktiengesellschaft.",
        "currency": "NZD",
        "sector": "Consumer Defensive",
        "industry": "Farm Products",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "1060",
        "website": "http://tandg.global",
        "market_cap": "Small Cap"
    },
    "ZNO.AX": {
        "short_name": "ZOONOGROUP FPO",
        "long_name": "Zoono Group Limited",
        "summary": "Zoono Group Limited, together with its subsidiaries, engages in the research, development, and sale of a range of antimicrobial products worldwide. The company's products include hand sanitizers, textile applicators, mould remediation, and surface sanitizers. It serves manufacturing, medicine, science, agriculture, viticulture, finance, FMCG, IT, entertainment, hospitality, catering, transport, child care, and livestock industries. Zoono Group Limited was incorporated in 1986 and is headquartered in Auckland, New Zealand.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "ASX",
        "market": "au_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2013",
        "website": "http://zoono.com",
        "market_cap": "Small Cap"
    },
    "ZNOGF": {
        "short_name": "ZOONO GROUP LTD",
        "long_name": "Zoono Group Limited",
        "summary": "Zoono Group Limited, together with its subsidiaries, engages in the research, development, and sale of a range of antimicrobial products worldwide. The company's products include hand sanitizers, textile applicators, mould remediation, and surface sanitizers. It serves manufacturing, medicine, science, agriculture, viticulture, finance, FMCG, IT, entertainment, hospitality, catering, transport, child care, and livestock industries. Zoono Group Limited was incorporated in 1986 and is headquartered in Auckland, New Zealand.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Household & Personal Products",
        "exchange": "PNK",
        "market": "us_market",
        "country": "New Zealand",
        "state": null,
        "city": "Auckland",
        "zipcode": "2013",
        "website": "http://zoono.com",
        "market_cap": "Small Cap"
    }
}