{"ACOPF": {"short_name": "THE A2 MILK COMPANY LTD", "long_name": "The a2 Milk Company Limited", "summary": "The a2 Milk Company Limited, together with its subsidiaries, sells A2 protein type branded milk and related products in Australia, New Zealand, China, other Asian countries, and the United States. The company offers fresh milk under the a2 Milk brand; and infant formula under the a2 Platinum brand. The company was formerly known as A2 Corporation Limited and changed its name to The a2 Milk Company Limited in April 2014. The a2 Milk Company Limited was founded in 2000 and is based in Auckland, New Zealand.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "PNK", "market": "us_market", "country": "New Zealand", "city": "Auckland"}, "ACOPY": {"short_name": "THE A2 MILK COMPANY LTD UNSPON ", "long_name": "The a2 Milk Company Limited", "summary": "The a2 Milk Company Limited, together with its subsidiaries, sells A2 protein type branded milk and related products in Australia, New Zealand, China, other Asian countries, and the United States. The company offers fresh milk under the a2 Milk brand; and infant formula under the a2 Platinum brand. The company was formerly known as A2 Corporation Limited and changed its name to The a2 Milk Company Limited in April 2014. The a2 Milk Company Limited was founded in 2000 and is based in Auckland, New Zealand.", "currency": "USD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "PNK", "market": "us_market", "country": "New Zealand", "city": "Auckland"}, "NZK.AX": {"short_name": "NZKSALMON FPO NZX", "long_name": "New Zealand King Salmon Investments Limited", "summary": "New Zealand King Salmon Investments Limited, together with its subsidiaries, engages in the farming, processing, and sale of premium salmon products. It offers whole fish, fillets, steaks, portions, wood roasted, cold smoked, and other products. The company sells its products to chefs, retailers, and wholesalers under the Ora King, Regal, Southern Ocean, Big Catch Salmon Burley, and Omega Plus brands, as well as the New Zealand King Salmon label. It serves customers in New Zealand, China, North America, Australia, Japan, Europe, and internationally. The company was incorporated in 2008 and is headquartered in Nelson, New Zealand.", "currency": "AUD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "ASX", "market": "au_market", "country": "New Zealand", "city": "Nelson"}, "NZK.NZ": {"short_name": "NZ King Salmon Investments Limi", "long_name": "New Zealand King Salmon Investments Limited", "summary": "New Zealand King Salmon Investments Limited, together with its subsidiaries, engages in the farming, processing, and sale of premium salmon products. It offers whole fish, fillets, steaks, portions, wood roasted, cold smoked, and other products. The company sells its products to chefs, retailers, and wholesalers under the Ora King, Regal, Southern Ocean, Big Catch Salmon Burley, and Omega Plus brands, as well as the New Zealand King Salmon label. It serves customers in New Zealand, China, North America, Australia, Japan, Europe, and internationally. The company was incorporated in 2008 and is headquartered in Nelson, New Zealand.", "currency": "NZD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Nelson"}, "S05.F": {"short_name": "SCALES CORP. LTD", "long_name": "Scales Corporation Limited", "summary": "Scales Corporation Limited engages in the agribusiness activities in New Zealand. The company operates through Food Ingredients, Horticulture, and Logistics segments. The Food Ingredients segment processes and markets food ingredients, such as pet food ingredients and juice concentrate. This segment also manufactures and sells apple, kiwifruit, and pear juice concentrates. The Horticulture segment is involved in growing, packaging, marketing, and exporting apples under the Mr Apple, Dazzle, Posy, and Fern Ridge Fresh brand names. The Logistics segment provides supply chain services for exporters, importers, and FMCG businesses. This segment also engages in the sea and air freight of produce. The company also provides insurance services. Scales Corporation Limited was founded in 1897 and is headquartered in Christchurch, New Zealand.", "currency": "EUR", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "FRA", "market": "dr_market", "country": "New Zealand", "city": "Christchurch"}, "SAN.NZ": {"short_name": "Sanford Limited (NS) Ordinary S", "long_name": "Sanford Limited", "summary": "Sanford Limited engages in farming, harvesting, processing, storing, and marketing of seafood products. It operates through Wildcatch and Aquaculture segments. The company catches and processes inshore and deepwater fish species, as well as farms, harvests, and processes mussels and salmon. Its seafood products include antarctic toothfish, arrow squid, barracouta, blue mackerel, gemfish, ghost shark, greenshell mussels, hake, hapuku, hoki, jack mackerel, john dory, kahawai, king salmon, lemon sole, ling, monkfish, new zealand sole, orange roughy, patagonian toothfish, red cod, scampi, silver warehou, smooth oreo dory, snapper, southern blue whiting, trevally, and yellowbelly flounder. The company also provides auction, wharf, and research services; and retails and wholesales seafood. It operates in New Zealand and Australia; Europe; North America; Japan, China, Hong Kong, South Korea, and the rest of Asia; Africa; the Middle East; the Pacific; and Central and South America. Sanford Limited was founded in 1881 and is headquartered in Auckland, New Zealand.", "currency": "NZD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}, "SCL.NZ": {"short_name": "Scales Corporation Limited Ordi", "long_name": "Scales Corporation Limited", "summary": "Scales Corporation Limited engages in the agribusiness activities in New Zealand. The company operates through Food Ingredients, Horticulture, and Logistics segments. The Food Ingredients segment processes and markets food ingredients, such as pet food ingredients and juice concentrate. This segment also manufactures and sells apple, kiwifruit, and pear juice concentrates. The Horticulture segment is involved in growing, packaging, marketing, and exporting apples under the Mr Apple, Dazzle, Posy, and Fern Ridge Fresh brand names. The Logistics segment provides supply chain services for exporters, importers, and FMCG businesses. This segment also engages in the sea and air freight of produce. The company also provides insurance services. Scales Corporation Limited was founded in 1897 and is headquartered in Christchurch, New Zealand.", "currency": "NZD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Christchurch"}, "SEK.NZ": {"short_name": "Seeka Limited Ordinary Shares", "long_name": "Seeka Limited", "summary": "Seeka Limited, together with its subsidiaries, provides orchard lease and management, and post harvest services to the horticulture industry primarily in New Zealand. It operates through Orchard Operations, Post Harvest Operations, and Retail Service Operations segments. The Orchard Operations segment offers on-orchard management services to orchard owners who produce kiwifruit, avocado, and kiwiberry crops. The Post Harvest Operations segment provides post-harvest services to the kiwifruit, avocado, and kiwiberry industries that include crops from the company's orchard management and lease operations, as well as crops from independent orchard owners. The Retail Service Operations segment offers fruit marketing services; and retail and ripening services for imported fruit produce, and operates a wholesale market. It also produces and sells apricots, avocado, cherries, European pears, kiwiberry, kiwifruit, nashi pears, plums, bananas, pineapple, and organics, as well as kiwi crush, kiwi crushies, and avocado oil to the retail sector and hospitals. The company was formerly known as Seeka Kiwifruit Industries Limited and changed its name to Seeka Limited in October 2016. Seeka Limited was founded in 1987 and is headquartered in Te Puke, New Zealand.", "currency": "NZD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Te Puke"}, "TGG.NZ": {"short_name": "T&G Global Limited Ordinary Sha", "long_name": "T&G Global Limited", "summary": "T&G Global Limited, together with its subsidiaries, grows, markets, distributes, and exports fresh produce under the JAZZ, envy, enza, pacific rose, LOTATOES, sunfirst, BEEKIST, and ORCHARD RD brands. It operates through Apples, International Produce, New Zealand Produce, Processed Foods, and Other segments. The company offers apples, pears, grapes, kiwifruit, asparagus, and tomatoes; citrus products, including lemons, mandarins, navel oranges, limes, grapefruit, and tangelos; cherries; blueberries, strawberries, and kiwi berries; and other stone fruits, as well as potatoes and other produce. It also cool stores and packs apples; sells, trades in, and markets processed foods; and engages in the horticulture, fruit and produce wholesale distribution, and fruit variety development and propagation activities. In addition, the company is involved in the processed foods broking, captive insurance provision, leased property holding, and water supply businesses, as well as the provision of in-market and fruit import and shared services. It sells its fresh produce in approximately 60 countries. The company was formerly known as Turners & Growers Limited and changed its name to T&G Global Limited in May 2015. The company was founded in 1883 and is headquartered in Auckland, New Zealand. T&G Global Limited is a subsidiary of BayWa Aktiengesellschaft.", "currency": "NZD", "sector": "Consumer Defensive", "industry": "Farm Products", "exchange": "NZE", "market": "nz_market", "country": "New Zealand", "city": "Auckland"}}