{
  "AFC.NZ": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Food Distribution",
    "long_name": "AFC Group Holdings Limited",
    "market": "nz_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "AFC Group Holdings Limited Ordi",
    "state": null,
    "summary": "AFC Group Holdings Limited, together with its subsidiaries, produces, manufactures, and purchases food, health, and cosmetic products for distribution in Australia, China, and New Zealand. It operates through three segments: Corporate, Vineyard and Winery, and Manufacturing. The company's products include milk, honey, wine, beef, mutton, and health and skin care products. The company also produces and sells varietals and blends of wine; and manufactures cosmetic face masks under the DDMASK brand. In addition, it distributes food products, cosmetics, and health products. The company was formerly known as Australasian Food Corporation Limited and changed its name to AFC Group Holdings Limited in September 2016. AFC Group Holdings Limited was incorporated in 2006 and is headquartered in Auckland, New Zealand.",
    "website": "http://www.afcnz.com",
    "zipcode": "2013"
  },
  "CGF.NZ": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Food Distribution",
    "long_name": "Cooks Global Foods Limited",
    "market": "nz_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Defensive",
    "short_name": "Cooks Global Foods Limited Ordi",
    "state": null,
    "summary": "Cooks Global Foods Limited, together with its subsidiaries, operates in the food and beverage industry. The company operates and franchises Esquires Coffee outlets in the United Kingdom, Ireland, Portugal, Bahrain, Kuwait, Syria, Saudi Arabia, Jordan, Pakistan, Indonesia, Canada, and China. It also supplies tea/coffee/beverages and fresh produce. In addition, the company engages in holding intellectual property, and the store and office lease holding business, as well as the provision of nominee and name protection services. Cooks Global Foods Limited was incorporated in 2008 and is based in Auckland, New Zealand.",
    "website": "http://www.cooksglobalfoods.com",
    "zipcode": "1010"
  },
  "FCG.NZ": {
    "city": "Auckland",
    "country": "New Zealand",
    "currency": "NZD",
    "exchange": "NZE",
    "industry": "Food Distribution",
    "long_name": "Fonterra Co-operative Group Limited",
    "market": "nz_market",
    "market_cap": "Mid Cap",
    "sector": "Consumer Defensive",
    "short_name": "Fonterra Co-operative Group Lim",
    "state": null,
    "summary": "Fonterra Co-operative Group Limited, together with its subsidiaries, collects, manufactures, and sells milk and milk-derived products. The company offers milk powders, butter, and cheese products. It also engages in the fast-moving consumer goods and foodservice businesses. In addition, the company operates 70 Farm Source retail stores; and engages in farming of fresh milk. It provides its products primarily under the Anchor, Anmum, Anlene, NZMP, Farm Source, De Winkel, Fresh 'n Fruity, Kapiti, Mainland, Mammoth, Perfect Italiano, Piako, Primo, and Symbio brands. The company has operations in New Zealand, China, rest of Asia, Australia, the United States, Europe, Latin America, and internationally. Fonterra Co-operative Group Limited was founded in 2001 and is headquartered in Auckland, New Zealand.",
    "website": "http://www.fonterra.com",
    "zipcode": "1010"
  }
}
