{
    "03F.F": {
        "short_name": "IDP EDUCATION LTD.",
        "long_name": "IDP Education Limited",
        "summary": "IDP Education Limited engages in the placement of students into education institutions in Asia, Australasia, and internationally. Its services include counselling, application processing, pre-departure guidance, examinations, English language teaching, client relations, digital marketing, online student recruitment, and shared services. The company is also involved in the distribution and administration of International English Language Testing System tests for study, work, and migration purposes. In addition, it operates English language schools. IDP Education Limited was founded in 1969 and is based in Docklands, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Docklands",
        "zipcode": "3008",
        "website": "http://www.idp.com",
        "market_cap": "Mid Cap"
    },
    "3PL.AX": {
        "short_name": "3PLEARNING FPO",
        "long_name": "3P Learning Limited",
        "summary": "3P Learning Limited, together with its subsidiaries, develops, markets, and sells online educational programs to schools and parents of school-aged students. It provides online education with e-learning programs covering mathematics, spelling, science, and literacy. The company offers Mathseeds, Mathletics, Reading Eggs, Spellodrome, Gooseberry Planet, STEMscopes Science, and WordFlyers learning resources. It serves approximately 4.6 million students in approximately 17,400 schools worldwide. The company is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.3plearning.com",
        "market_cap": "Small Cap"
    },
    "AKG.AX": {
        "short_name": "ACADEMIES FPO",
        "long_name": "Academies Australasia Group Limited",
        "summary": "Academies Australasia Group Limited provides training and education services in Australia and Singapore. The company primarily offers English language, senior high school, Singapore government school preparatory certificate, diploma, advanced diploma, and bachelor and master degree courses. It operates 18 licensed colleges offering approximately 150 qualifications. The company was formerly known as Garratt's Limited. Academies Australasia Group Limited was founded in 1908 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.academies.edu.au",
        "market_cap": "Small Cap"
    },
    "CLU.AX": {
        "short_name": "CLUEY LTD FPO",
        "long_name": "Cluey Ltd",
        "summary": "Cluey Learning Pty Ltd, an education technology company, provides online tutoring services for school students Australia. It offers tutoring services in the areas of English, Maths, and Chemistry for primary, secondary, and senior level students through its online tutoring platform; and test preparation services for NAPLAN (National Assessment Program Â\u0096 Literacy and Numeracy) and LANTITE (Literacy and Numeracy Test for Initial Teacher Education) through its test preparation platform. The company also provides tutoring sessions, practice content, feedback, and data analytics. Cluey Learning Pty Ltd was incorporated in 2017 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.clueylearning.com.au",
        "market_cap": "Small Cap"
    },
    "GEM.AX": {
        "short_name": "G8 EDUCATE FPO",
        "long_name": "G8 Education Limited",
        "summary": "G8 Education Limited owns, operates, franchises, and manages child care centers in Australia. The company provides educational child care services. As of December 31, 2020, it operated 472 centers. The company was founded in 2006 and is headquartered in Varsity Lakes, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Varsity Lakes",
        "zipcode": "4227",
        "website": "http://www.g8education.edu.au",
        "market_cap": "Small Cap"
    },
    "ICT.AX": {
        "short_name": "ICOLLEGE FPO",
        "long_name": "iCollege Limited",
        "summary": "iCollege Limited provides vocational education and training solutions in Australia and internationally. The company offers training to develop skills and knowledge required to gain employment or advance careers in various industry sectors, including construction, nursing, disability, hospitality, business, English language, and health and fitness. It serves workers, job seekers, and school leavers through its campuses in Sydney, Brisbane, Gold Coast, Perth, Adelaide, and Canberra. The company is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.icollege.edu.au",
        "market_cap": "Small Cap"
    },
    "IEL.AX": {
        "short_name": "IEL FPO",
        "long_name": "IDP Education Limited",
        "summary": "IDP Education Limited engages in the placement of students into education institutions in Asia, Australasia, and internationally. Its services include counselling, application processing, pre-departure guidance, examinations, English language teaching, client relations, digital marketing, online student recruitment, and shared services. The company is also involved in the distribution and administration of International English Language Testing System tests for study, work, and migration purposes. In addition, it operates English language schools. IDP Education Limited was founded in 1969 and is based in Docklands, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Docklands",
        "zipcode": "3008",
        "website": "http://www.idp.com",
        "market_cap": "Mid Cap"
    },
    "KME.AX": {
        "short_name": "KIPMCGRATH FPO",
        "long_name": "Kip McGrath Education Centres Limited",
        "summary": "Kip McGrath Education Centres Limited provides supplementary English and maths education services in Australia, New Zealand, the United Kingdom, Europe, and internationally. It sells franchises and offers services to franchisees in the education field. The company also provides tutorial assistance in English and maths to primary and secondary students; and online tutoring services. It has a franchise network of approximately 560 tutoring centers. Kip McGrath Education Centres Limited was founded in 1974 and is headquartered in Newcastle, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Newcastle",
        "zipcode": "2300",
        "website": "http://www.kipmcgrath.com",
        "market_cap": "Small Cap"
    },
    "RDH.AX": {
        "short_name": "REDH EDU FPO",
        "long_name": "RedHill Education Limited",
        "summary": "RedHill Education Limited engages in the education business in Australia, Europe, and South America. The company operates through three segments: Technology & Design, Greenwich, and Go Study. The Technology & Design segment provides face-to-face and online courses in information technology, digital design, interactive multimedia, computer coding, digital marketing, games and apps programming, as well as interior designing services. The Greenwich segment offers English language intensive courses, and vocational education and training courses for international students. The Go Study segment provides international student advisory recruitment agency services. RedHill Education Limited was founded in 2006 and is based in Ultimo, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Ultimo",
        "zipcode": "2007",
        "website": "http://www.redhilleducation.com",
        "market_cap": "Small Cap"
    },
    "SIT.AX": {
        "short_name": "SITE GROUP FPO",
        "long_name": "Site Group International Limited",
        "summary": "Site Group International Limited provides training, education, and workforce solutions to government, corporate, and individual clients in Australia and internationally. It operates through four segments: Site Skills TrainingÂ\u0096Domestic, Site Skills TrainingÂ\u0096International, Energy Services, and Tertiary Education. The Site Skills TrainingÂ\u0096Domestic segment offers vocational training and assessment services for candidates in the mining and processing, oil and gas, construction, camp services, hospitality, and logistic sectors. The Site Skills TrainingÂ\u0096International segment operates a facility in the Philippines to provide Australian standard training services. The Energy Services segment offers energy training and services to the oil and gas industry. The Tertiary Education segment provides diploma and certificate level courses under the Site Institute brand; and English language courses and conferences. The company also offers online learning services; and sources, trains, and deploys skilled labor for various projects. Site Group International Limited is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.site.edu.au",
        "market_cap": "Small Cap"
    },
    "UCW.AX": {
        "short_name": "UCW LTD FPO",
        "long_name": "UCW Limited",
        "summary": "UCW Limited, through its subsidiaries, provides tertiary education services in Australia and internationally. It offers accredited vocational education in the fields of ageing support, community services, counselling, dance teaching, early childhood education and care, fitness, mental health, remedial massage, sport and recreation management, and yoga teaching. The company was formerly known as Undercoverwear Limited and changed its name to UCW Limited in January 2015. UCW Limited was incorporated in 2004 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Education & Training Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.ucwlimited.com.au",
        "market_cap": "Small Cap"
    }
}