{
    "BRES.QA": {
        "short_name": "Barwa Real Estate QPSC",
        "long_name": "Barwa Real Estate Company Q.P.S.C.",
        "summary": "Barwa Real Estate Company is a real estate investment firm specializing in real estate projects which include residential facilities, a motor city, warehouses, and complementary commercial and retail spaces. The firm engages in investment, development, and management of properties with a focus on Qatar and Saudi Arabia. It also invests in stocks of real estate firms. The firm invests in the real estate markets across the globe. Its portfolio includes residential and commercial property and hotels. Barwa Real Estate Company was founded on January 19, 2006 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.barwa.com.qa",
        "full_time_employees": null
    },
    "ERES.QA": {
        "short_name": "Ezdan Holding Group QPSC",
        "long_name": "Ezdan Holding Group Q.P.S.C.",
        "summary": "Ezdan Holding Group Q.P.S.C., together with its subsidiaries, manages and rents real estate properties in Qatar. It operates through four segments: Residential and Commercial Properties, Investments, Hotel and Suites, and Malls. The Residential and Commercial Properties segment develops, owns, and rents real estate properties. The Investments segment invests in shares and sukuk investments. The Hotel and Suites segment manages hotels, suites, and restaurants. The Mall segment manages shopping malls. The company was formerly known as Ezdan Real Estate Company Q.S.C. and changed its name to Ezdan Holding Group Q.P.S.C. Ezdan Holding Group Q.P.S.C. was founded in 1960 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.ezdanholding.qa",
        "full_time_employees": null
    },
    "MRDS.QA": {
        "short_name": "Mazaya Real Estate Development ",
        "long_name": "Mazaya Real Estate Development Q.P.S.C.",
        "summary": "Mazaya Real Estate Development Q.P.S.C. engages in the real estate investment and development businesses. It develops real estate properties, such as master developments to individual projects in the residential, commercial, and industrial sectors. The company also provides project management and consultancy, property valuation, strategic partnership, real estate brokerage, master developments, assets and facility management division, marketing management and consultancy, real estate portfolio and fund management, and real estate market research services, as well as real estate management and maintenance services. In addition, it trades in mechanical electrical and construction equipment. The company was founded in 2008 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.mazayaqatar.com",
        "full_time_employees": null
    },
    "NLCS.QA": {
        "short_name": "National Leasing Holding QPSC",
        "long_name": "Alijarah Holding (Q.P.S.C.)",
        "summary": "Alijarah Holding (Q.P.S.C.), together with its subsidiaries, engages in financial leasing, real estate, property development, transportation, taxi service, and driving school businesses in Qatar. The company supplies equipment; and provides taxi and limousine services with a fleet of 520 Airport Taxi and approximately 100 limousine vehicles for transportation needs of individuals, corporate houses, and governments, as well as offers driving school services. It also offers Islamic leasing and infrastructure development services; and leases and manages properties. The company was incorporated in 2003 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.alijarah.com",
        "full_time_employees": null
    },
    "UDCD.QA": {
        "short_name": "United Development QPSC",
        "long_name": "United Development Company Q.P.S.C.",
        "summary": "United Development Company Q.P.S.C., together with its subsidiaries, identifies and invests in long-term projects in the State of Qatar. It operates through four segments: Urban Development, Hospitality and Leisure, Infrastructure and Utilities, and Other Operations. The company engages in the reclamation of land covering an area of 985 acres into a manmade island; and the development of the island into various districts comprising housing beachfront villas, town homes, luxury apartments, retail shopping complexes, penthouses, five star hotels, marinas, and schools and hospitals with related infrastructure and community facilities. It is also involved in the construction, ownership, and operation of district cooling systems; operation of a marinas; sale of marine related equipment; and investment in and management of restaurants, as well as purchase and sale of fast-moving consumer goods in the hospitality sector. In addition, the company invests in and develops real estate properties; and operates and develops hotels and resorts, as well as engages in the provision of advertising, insurance agency, technical and risk related, and cleaning related services. Further, it provides registry and master community, and property management support, as well as information technology solutions. The company was founded in 1999 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.udcqatar.com",
        "full_time_employees": null
    }
}