{
    "SBNC.DE": {
        "short_name": "SBERBANK ADR REGS/4 RL3",
        "long_name": "Sberbank of Russia",
        "summary": "Sberbank of Russia, together with its subsidiaries, provides corporate and retail banking products and services to individuals, small businesses, corporate clients, and financial institutions. The company offers deposit products; pension accounts; payment, transfer, brokerage, and asset management services; car, housing, education, and consumer loans; mortgages; debit and credit cards, and overdraft service; and refinancing products. It also provides derivative, financial instrument, foreign currency, precious metal, corporate structured, and commodities and securities products, as well as debt and capital markets funding, documentary, and other commission services. In addition, it offers life, property, bank card, accident, liability, trust management, investment and universal life, travel, and mutual investment funds insurance products, as well as individual pension plans and corporate pension programs. Additionally, the company provides business bank accounts, platform for exporters and importers, merchant acquiring and international trading services, and corporate cards for small businesses; and loans, investment products and capital markets services, fund investment services, and banking services for corporate clients. It also provides trade finance, interbank lending, currency risk hedging, and treasury services; deposits, custody services, and electronic trading systems; and settlement and cash collection services to financial institutions. As of December 31, 2020, the company operated 11 Regional banks and 14,162 branches in Russia. The company also has operations in 18 countries internationally. Sberbank of Russia was founded in 1841 and is headquartered in Moscow, Russia.",
        "currency": "EUR",
        "sector": "Financial",
        "industry": "Money Center Banks",
        "exchange": "GER",
        "market": "de_market",
        "country": "Russia",
        "state": null,
        "city": "Moscow",
        "zipcode": "117997",
        "website": "http://www.sberbank.ru",
        "market_cap": 135053099008
    }
}