{
    "JBFCF": {
        "short_name": "JOLLIBEE FOODS CORP",
        "long_name": "Jollibee Foods Corporation",
        "summary": "Jollibee Foods Corporation, doing business as Jollibee, develops, operates, and franchises quick service restaurants. The company operates quick service restaurants under the Jollibee, Chowking, Greenwich, Red Ribbon, Yong He King, Hong Zhuang Yuan, Mang Inasal, Burger King, Highlands Coffee, PHO24, Hard Rock Cafe, Dunkin' Donuts, Smashburger, Tim Ho Wan, Tortas Frontera, The Coffee Bean & Tea Leaf, and Panda Express names. It operates approximately 5,900 stores in the Philippines, the United States, Canada, the People's Republic of China, Hong Kong, Macau, the United Kingdom, Italy, Vietnam, Brunei, Singapore, Saudi Arabia, the United Arab Emirates, Qatar, Oman, Kuwait, Bahrain, Indonesia, Costa Rica, Egypt, El Salvador, Panama, Scotland, Malaysia, and internationally. The company also offers property leasing, manufacturing, digital printing, advertising, financial accounting, human resources and logistics, business management, and other services. Jollibee Foods Corporation was founded in 1975 and is headquartered in Pasig, the Philippines.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Pasig",
        "zipcode": "1605",
        "website": "http://www.jollibee.com.ph",
        "market_cap": 3779778304
    },
    "JBFCY": {
        "short_name": "JOLLIBEE FOODS CORP",
        "long_name": "Jollibee Foods Corporation",
        "summary": "Jollibee Foods Corporation, doing business as Jollibee, develops, operates, and franchises quick service restaurants. The company operates quick service restaurants under the Jollibee, Chowking, Greenwich, Red Ribbon, Yong He King, Hong Zhuang Yuan, Mang Inasal, Burger King, Highlands Coffee, PHO24, Hard Rock Cafe, Dunkin' Donuts, Smashburger, Tim Ho Wan, Tortas Frontera, The Coffee Bean & Tea Leaf, and Panda Express names. It operates approximately 5,900 stores in the Philippines, the United States, Canada, the People's Republic of China, Hong Kong, Macau, the United Kingdom, Italy, Vietnam, Brunei, Singapore, Saudi Arabia, the United Arab Emirates, Qatar, Oman, Kuwait, Bahrain, Indonesia, Costa Rica, Egypt, El Salvador, Panama, Scotland, Malaysia, and internationally. The company also offers property leasing, manufacturing, digital printing, advertising, financial accounting, human resources and logistics, business management, and other services. Jollibee Foods Corporation was founded in 1975 and is headquartered in Pasig, the Philippines.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Pasig",
        "zipcode": "1605",
        "website": "http://www.jollibee.com.ph",
        "market_cap": 4701026304
    },
    "PGCMF": {
        "short_name": "PUREGOLD PRICE CLUB INC",
        "long_name": "Puregold Price Club, Inc.",
        "summary": "Puregold Price Club, Inc. engages in the retail and wholesale of consumer goods in the Philippines. The company operates hypermarkets under the Puregold and Puregold Extra brand name in commercial centers and near transportation hubs; small store under Puregold Minimart brand name; S&R Membership Shopping under the warehouse club concept; and supermarkets under San Roque Supermarkets brand name. The company's stores offer canned goods, housewares, toiletries, dry goods, food products, pharmaceutical and medical goods, etc. It sells its products to retail consumers; and resellers, small to medium sized sari-sari stores, canteens, restaurants, bakeries, and convenience and drug stores, as well as small to medium sized businesses. The company operates 434 total stores, including 229 hypermarkets, 102 supermarkets, 29 extra, 19 minimart, 18 S&R warehouse clubs, and 38 S&R-QSRs. The company was founded in 1998 and is based in Manila, the Philippines. Puregold Price Club, Inc. is a subsidiary of Cosco Capital, Inc.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Manila",
        "zipcode": "1007",
        "website": "http://www.puregold.com.ph",
        "market_cap": 2230675712
    },
    "RRETY": {
        "short_name": "ROBINSONS RETAIL HLDGS INC",
        "long_name": "Robinsons Retail Holdings, Inc.",
        "summary": "Robinsons Retail Holdings, Inc. operates as a multi-format retail company in the Philippines. The company operates through Supermarkets, Department Stores, DIY Stores, Convenience Stores, Drug Stores, and Specialty Stores segments. It operates supermarkets under the Robinsons Supermarket brand that offer health and wellness, and fresh food products; and department stores under the Robinsons Department Store brand, which provide men's, ladies', and children's apparels and accessories, as well as shoes, bags, luggage, sportswear, furnishings, toys, homes, snacks, and stationery. The company also operates do-it-yourself (DIY) stores under the Handyman Do it Best, True Value, True Home, Robinsons Builders, Home Plus, De Oro Pacific Home Plus, and A.M. Builders' Depot brands that offer DIY and home improvement products; operates and franchises convenience stores under the Ministop name that provide fresh and ready to eat products; and operates drug stores under the South Star Drug name that offer prescription and over-the-counter pharmaceutical products, as well as food, personal care, and other products. In addition, it operates toys and juvenile products under Toys Â\u0091R' Us name; consumer electronics and appliances stores under Robinsons Appliances and Saver's Appliance name; beauty products under the Benefit, Shiseido, and Elizabeth Arden brands; mass merchandise stores under the Daiso Japan, Arcova, and Super50 name; pet retail under the Pet Lovers Centre name; and discount store under the No Brand name. As of December 31, 2020, it had 2,157 stores, including 264 supermarkets, 49 department stores, 222 DIY stores, 472 convenience stores, 829 drug stores, and 318 specialty stores. The company was formerly known as Robinsons Holdings, Inc. and changed its name to Robinsons Retail Holdings, Inc. Robinsons Retail Holdings, Inc. was founded in 1980 and is headquartered in Pasig City, the Philippines.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Pasig",
        "zipcode": "1600",
        "website": "http://www.robinsonsretailholdings.com.ph",
        "market_cap": 1587968896
    },
    "SVTMF": {
        "short_name": "SM INVESTMENTS CORPORATION",
        "long_name": "SM Investments Corporation",
        "summary": "SM Investments Corporation, together with its subsidiaries, engages in the property, retail, and banking and other businesses in the Philippines. The company's Property segment is involved in the mall, residential, and commercial development, as well as the operation of hotels and convention centers. This segment also develops, conducts, operates, and maintains commercial shopping centers, as well as conducts, operates, and maintains shopping center spaces, amusement centers, and cinema theaters within the shopping centers. In addition, it engages in the development and transformation of residential, commercial, entertainment, and tourism districts. As of December 31, 2020, it operated 76 malls in the Philippines with a total gross floor area (GFA) of 8.6 million square meters; and 7 malls in China with a total GFA of 1.3 million square meters. Its Retail segment is involved in the retail/wholesale trading of merchandise, such as dry goods, wearing apparels, food, and other merchandise. As of December 31, 2020, this segment operated 3,019 stores, including 66 SM stores, 59 SM supermarkets, 209 Savemore stores, 52 SM hypermarkets, 71 WalterMart stores, and 1,012 Alfamart stores, as well as 1,550 specialty stores. The company's Banking and Others segment engages in asset management and capital investments, as well as provision of financial services. It provides lending; deposit-taking; foreign exchange; brokering; trust and investments; credit cards; corporate cash management and remittances; leasing and financing; life insurance; and insurance and stock brokerage services, as well as investment, private, and rural banking services. This segment operates approximately a network of 1,400 branches and 4,400 ATMs. The company also invests in other sectors, such as commercial buildings, leisure, logistics and mining. SM Investments Corporation was founded in 1958 and is based in Pasay City, the Philippines.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Philippines",
        "state": null,
        "city": "Pasay City",
        "zipcode": "1300",
        "website": "http://www.sminvestments.com",
        "market_cap": 22430263296
    }
}