{
  "CASS.JK": {
    "city": "Jakarta Timur",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Airports & Air Services",
    "long_name": "PT Cardig Aero Services Tbk",
    "market": "id_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "Cardig Aero Services Tbk.",
    "state": null,
    "summary": "PT Cardig Aero Services Tbk engages in the ground handling, cargo handling, aircraft release and maintenance, catering, management facility, and aviation training businesses. The company's Ground Handling division offers passenger handling, including baggage and aircraft handling, ground support equipment usage, operation of business class lounge, and special assistance services. Its Cargo Handling division provides cargo buildup and breakdown, cargo documentation, cargo transfer and transit handling, cargo storage, and special cargo handling services. The company's Aircraft Release and Maintenance Service division provides repair and maintenance service for air transportation vehicles. Its Catering Services division offers food and catering services, as well as housekeeping, laundry, gardening, accommodation, transportation, and other services. The company's Management Facility division provides aircraft cleaning services, laundry services, security services, and other services to customers as per customers purchase order. Its Aviation Training division offers training facility services to provide flight simulators to aircraft pilot and other training services. PT Cardig Aero Services Tbk is also involved in management of airports; operation of restaurants; and investment activities. The company was founded in 1984 and is based in East Jakarta, Indonesia.",
    "website": "http://casgroup.co.id",
    "zipcode": "13650"
  },
  "GIAA.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Airports & Air Services",
    "long_name": "PT. Garuda Indonesia (Persero) Tbk",
    "market": "id_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "Garuda Indonesia (Persero) Tbk.",
    "state": null,
    "summary": "PT. Garuda Indonesia (Persero) Tbk provides airline services in Indonesia and internationally. It operates through Flight Operation, Aircraft Maintenance Services, and Other Operations segments. The company undertakes the scheduled and non-scheduled commercial air transportation of domestic or international passengers, cargoes, and mails; and provides aircraft repair, maintenance, and overhaul services. It also distributes computerized reservation systems; and provides travel agency, ticketing, aircraft rental, catering, hotel management, cargo, information technology, and ground handling services. The company operates through a fleet of 142 aircraft. PT. Garuda Indonesia (Persero) Tbk was founded in 1949 and is headquartered in Jakarta, Indonesia.",
    "website": "http://www.garuda-indonesia.com",
    "zipcode": "10110"
  },
  "HELI.JK": {
    "city": "Jakarta",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Airports & Air Services",
    "long_name": "PT Jaya Trishindo Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Jaya Trishindo Tbk.",
    "state": null,
    "summary": "PT Jaya Trishindo Tbk provides business and private helicopter charter services in Indonesia. The company is headquartered in Jakarta, Indonesia.",
    "website": "http://www.jatigroup.com",
    "zipcode": "11620"
  },
  "IATA.JK": {
    "city": "Jakarta Pusat",
    "country": "Indonesia",
    "currency": "IDR",
    "exchange": "JKT",
    "industry": "Airports & Air Services",
    "long_name": "PT Indonesia Transport & Infrastructure Tbk",
    "market": "id_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "Indonesia Transport & Infrastru",
    "state": null,
    "summary": "PT Indonesia Transport & Infrastructure Tbk provides commercial flight and air transport services in Indonesia and South East Asia. The company operates various types of fixed wing aircraft and helicopters. It offers aviation services, such as aircraft and helicopter chartering, air cargo, repair shop, and maintenance and other related services. The company also provides aero medical evacuation, geophysical, and survey aerial photography, as well as air services for the development of tourism industry. It serves onshore and offshore oil, gas, and mining companies. The company was formerly known as PT Indonesia Air Transport Tbk. and changed its name to PT Indonesia Transport & Infrastructure Tbk in April 2014. PT Indonesia Transport & Infrastructure Tbk was founded in 1968 and is headquartered in Central Jakarta, Indonesia.",
    "website": "http://www.indonesia-air.com",
    "zipcode": "10340"
  }
}
