{
    "IKBI.JK": {
        "short_name": "Sumi Indo Kabel Tbk.",
        "long_name": "PT Sumi Indo Kabel Tbk",
        "summary": "PT Sumi Indo Kabel Tbk manufactures and sells conductors, power and control cables, and automobile and telecommunication cables in Indonesia. The company provides bare conductor cables, fire resistance and flame retardant cables, armored and non-armored cables, and low and medium voltage cables of copper and aluminum. It also offers special products, including laminated aluminum polyethylene polyamid, low temperature, solar, bonding, and rolling stock cables; and low-voltage wires for batteries, earth bond low voltage wires, and vinyl insulated low voltage wires for automobiles, as well as steel wire amour cables for underground. The company was formerly known as PT IKI Indah Kabel Indonesia and changed its name to PT Sumi Indo Kabel Tbk in 1999. The company was founded in 1981 and is headquartered in Tangerang, Indonesia. PT Sumi Indo Kabel Tbk is a subsidiary of Sumitomo Electric Industries, Ltd.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15135",
        "website": "http://www.sikabel.com",
        "full_time_employees": 535
    },
    "JECC.JK": {
        "short_name": "Jembo Cable Company Tbk.",
        "long_name": "PT Jembo Cable Company Tbk",
        "summary": "PT Jembo Cable Company Tbk manufactures and sells various wires and cables in Indonesia and internationally. It operates through Power Cable, Telephone Cable, and Others segments. The company offers low and medium voltage copper and aluminum, fire resistant, fiber optic, telecommunication, lead sheathed, instrumentation, airfield, marine, overhead, and metal corrugated armored cables. It also operates an electrical power plant; and manufactures, assembles, supplies, installs, and sells solar panels and light emitting diodes. The company was founded in 1973 and is headquartered in Tangerang, Indonesia. PT Jembo Cable Company Tbk is a subsidiary of PT Monaspermata Persada.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15137",
        "website": "http://www.jembo.co.id",
        "full_time_employees": 979
    },
    "KBLI.JK": {
        "short_name": "KMI Wire & Cable Tbk.",
        "long_name": "PT KMI Wire and Cable Tbk",
        "summary": "PT KMI Wire and Cable Tbk manufactures and sells various power cables in Indonesia. The company offers aluminum, copper, and ground bare conductors; low voltage power cables comprising aluminum, copper, control, flexible, and instrument cables; medium voltage power cables consisting of aluminum and copper cables; high voltage power cables; outdoor and indoor telecom cables; special purpose cables, including fire resistant, flame retardant, lead and nylon sheathed, and thermocouple cables; and aluminum and copper rods, and rod products. It supplies power cables to the state owned electricity company; and cables to private and industrial sectors comprising oil and gas, mining, industrial, and other sectors. The company sells its products directly, as well as through a chain of distributors and resellers. It also exports its products internationally. PT KMI Wire and Cable Tbk was founded in 1972 and is based in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "13910",
        "website": "http://kmiwire.com",
        "full_time_employees": 680
    },
    "SCCO.JK": {
        "short_name": "Supreme Cable Manufacturing & C",
        "long_name": "PT Supreme Cable Manufacturing & Commerce Tbk",
        "summary": "PT Supreme Cable Manufacturing & Commerce Tbk manufactures and sells electrical cables, and insulation and melamine products in Indonesia and internationally. The company operates through cable, insulation and melamine segments. It offers building wires; low voltage power cables and bare conductors; and medium and high voltage power cables. It also provides fire resistant, armored, fire resistant corrugated, lead and armored, and other instrumentation cables; enameled wires; and OPGW and fiber optic, telecommunication, airport lighting, and fire resistant cables. In addition, the company manufactures pellet cross linked polyethylene and poly-vinyl chloride products; melamine, resin, and melamine sheet products; and plastic and cable reel products. Further, it is involved in the production of copper and aluminum wires and rods. PT Supreme Cable Manufacturing & Commerce Tbk offers its products under the SUPREME brand. The company was formerly known as PT Supreme Cable Manufacturing Corporation Tbk and changed its name to PT Supreme Cable Manufacturing & Commerce Tbk in October 2006. PT Supreme Cable Manufacturing & Commerce Tbk was founded in 1970 and is headquartered in Central Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10340",
        "website": "http://www.sucaco.com",
        "full_time_employees": 797
    },
    "VOKS.JK": {
        "short_name": "Voksel Electric Tbk.",
        "long_name": "PT Voksel Electric Tbk",
        "summary": "PT Voksel Electric Tbk, together with its subsidiaries, manufactures and sells power, telecommunication, and fiber optic cables in Indonesia. It operates through five segments: Power Cable, Fiber Optic Cable, Copper Wire Cable, Contractor Service, and Trading. The company provides bare copper conductors and bare aluminum conductors; and power and control cables, such as high and medium voltage submarine cables, low voltage cross linked polyethylene insulated cable, polyethylene insulated cables, polyvinyl chloride insulated cables, fire resistance cables, flame retardant cables, control and instrument cables, and sheath halogen free cables. It also offers optical fiber cables, which include all dielectric self supporting cables, aerial and duct cables, armor/buried cables, fibre To The Home (FTTH) and Single Core Per Tube (SCPT) cables, air blowing micro duct cables, submarine fiber optic cables, and optical ground wires, as well as supplies free market cables to contractors and distributors. In addition, the company is involved in the general trading, and development and services business; and operates as a general contractor. Further, it exports its products. PT Voksel Electric Tbk was founded in 1971 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12950",
        "website": "http://www.voksel.co.id",
        "full_time_employees": 1324
    }
}