{"HEXA.JK": {"short_name": "Hexindo Adiperkasa Tbk.", "long_name": "PT Hexindo Adiperkasa Tbk", "summary": "PT Hexindo Adiperkasa Tbk engages in the trading and rental of heavy equipment and related spare parts in Indonesia. It offers excavators, loading shovels, wheel loaders, rigid frame trucks, articulated dump trucks, used equipment, and consolidated solutions for construction sites; and a range of equipment to suit various industry solutions, such as mining, quarrying, general construction, demolition, recycling, and forestry. The company also provides various parts, such as lubricants, filters, undercarriages, O-ring kits for control valves, ground engaging tools, seal kits, and remanufactured components; and support services. It offers Hitachi, John Deere, Krupp, and Bell branded products. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Hexindo Adiperkasa Tbk is a subsidiary of Hitachi Construction Machinery Co. Ltd.", "currency": "IDR", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "HX1A.F": {"short_name": "HEXINDO ADIPERKASA RP 100", "long_name": "PT Hexindo Adiperkasa Tbk", "summary": "PT Hexindo Adiperkasa Tbk engages in the trading and rental of heavy equipment and related spare parts in Indonesia. It offers excavators, loading shovels, wheel loaders, rigid frame trucks, articulated dump trucks, used equipment, and consolidated solutions for construction sites; and a range of equipment to suit various industry solutions, such as mining, quarrying, general construction, demolition, recycling, and forestry. The company also provides various parts, such as lubricants, filters, undercarriages, O-ring kits for control valves, ground engaging tools, seal kits, and remanufactured components; and support services. It offers Hitachi, John Deere, Krupp, and Bell branded products. The company was founded in 1988 and is headquartered in Jakarta, Indonesia. PT Hexindo Adiperkasa Tbk is a subsidiary of Hitachi Construction Machinery Co. Ltd.", "currency": "EUR", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "INTA.JK": {"short_name": "Intraco Penta Tbk.", "long_name": "PT Intraco Penta Tbk", "summary": "PT Intraco Penta Tbk operates as a heavy equipment trading company in Indonesia. The company also provides mining contracting solutions, which include application and maintenance of mining equipment; and financing services for heavy equipment and other capital goods. It offers transportation and construction equipment; and provides fabrication and infrastructure support services for various sectors, including the mining, industrial, oil and gas, marine, and logistics, as well as operates a steam power plant. PT Intraco Penta Tbk was founded in 1970 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "IPU1.SG": {"short_name": "Intraco Penta, PT Registered Sh", "long_name": "PT Intraco Penta Tbk", "summary": "PT Intraco Penta Tbk operates as a heavy equipment trading company in Indonesia. The company also provides mining contracting solutions, which include application and maintenance of mining equipment; and financing services for heavy equipment and other capital goods. It offers transportation and construction equipment; and provides fabrication and infrastructure support services for various sectors, including the mining, industrial, oil and gas, marine, and logistics, as well as operates a steam power plant. PT Intraco Penta Tbk was founded in 1970 and is based in Jakarta, Indonesia.", "currency": "EUR", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "TIRA.JK": {"short_name": "Tira Austenite Tbk", "long_name": "PT Tira Austenite Tbk", "summary": "PT Tira Austenite Tbk engages in the trading and manufacture of technical products primarily in Indonesia. It operates through three segments: Trading and Distribution of Technical Products; Welding and Molding; and Distribution of Industrial Gases. The company sells various steel products, including machinery steel used for the making of shaft, gear, and other machine parts; and stainless and tool steel products, as well as wear resistant steel products for heavy equipment, liner plate, crusher, and other applications. It also provides medical gases, including anaerobic atmosphere mixtures, blood gas mixtures, breathing air, helium, and lung diffusion gas mixtures; and specialty gases, such as analytical instrumentation mixtures, chemical process gases, emission calibration gases, environmental compliance mixtures, gas mixtures, high purity gas products, hydrocarbon calibration standards, laser gas mixtures, rare gases, and ultra-high purity gas products. In addition, the company offers industrial gases, such as argon, carbon dioxide, nitrogen, oxygen, and hydrogen; fuel gases, including acetylene, LPG, and propane; high-pressure cylinder gases; liquid cylinders for gas or liquid service; and shielding gases. Further, it manufactures bronze casting products under the ALPHABRONZE name; welding electrode products under the name of MG and STELEC; and electronic components, as well as trades in steel. The company was founded in 1971 and is headquartered in East Jakarta, Indonesia. PT Tira Austenite Tbk is a subsidiary of PT Widjajatunggal Sejahtera.", "currency": "IDR", "sector": "Industrials", "industry": "Industrial Distribution", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "East Jakarta"}}