{
    "DEAL.JK": {
        "short_name": "Dewata Freightinternational Tbk",
        "long_name": "PT Dewata Freightinternational Tbk",
        "summary": "PT Dewata Freightinternational Tbk provides freight forwarding, vehicle rental, distribution management, and construction services. It engages in trade and mining services; and provides cargo shipment services, including loading, unloading containers, repackaging, shipping door to door, storing hazardous and non-hazardous, and handling cargo that requires cooling storage system. The company was founded in 1995 and is headquartered in North Jakarta, Indonesia. PT Dewata Freightinternational Tbk is a subsidiary of PT Bimada Paramita Adhyana.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14240",
        "website": "http://www.dfilogistics.com",
        "market_cap": "Large Cap"
    },
    "IPCC.JK": {
        "short_name": "Indonesia Kendaraan Terminal Tb",
        "long_name": "PT Indonesia Kendaraan Terminal Tbk",
        "summary": "PT Indonesia Kendaraan Terminal Tbk provides vehicle terminal services in Indonesia. The company offers car terminal services, including stevedoring, cargodoring, receiving, and delivery services, as well as repairing, painting, engine repair, accessories installation, washing, spare part management, marking and labeling, pre-delivery inspection, pre-port stock, and port to dear services. It also provides sea toll services. The company was founded in 2012 and is based in North Jakarta, Indonesia. PT Indonesia Kendaraan Terminal Tbk is a subsidiary of PT Pelabuhan Indonesia II.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14110",
        "website": "http://www.indonesiacarterminal.co.id",
        "market_cap": "Large Cap"
    },
    "KJEN.JK": {
        "short_name": "Krida Jaringan Nusantara Tbk.",
        "long_name": "PT Krida Jaringan Nusantara Tbk",
        "summary": "PT Krida Jaringan Nusantara Tbk provides courier services to banking, telecommunications, package shipment, and other sectors in Indonesia and internationally. It offers freight forwarding; collection, processing, transportation, and delivery services. The company also engages in the goods collection, courier agency, and warehousing and storage businesses; and sending of goods through rail, land, sea, and air transportation, as well as packaging of goods. In addition, it provides cargo consolidation, cargo space, and customs management. The company was founded in 1998 and is headquartered in Jakarta Pusat, Indonesia. PT Krida Jaringan Nusantara Tbk is a subsidiary of PT Grafindo Karya Nusantara.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "10430",
        "website": "http://www.kjn.id",
        "market_cap": "Large Cap"
    },
    "PPGL.JK": {
        "short_name": "Prima Globalindo Logistik Tbk.",
        "long_name": "PT Prima Globalindo Logistik Tbk",
        "summary": "Pt Prima Globalindo Logistik provides freight forwarding and land transportation services for export and import in Indonesia. It provides international sea and air freight, trucking and custom brokerage, and reefer cargo services. The company was founded in 2015 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14350",
        "website": "http://www.pgl-logistic.com",
        "market_cap": "Large Cap"
    },
    "SAPX.JK": {
        "short_name": "Satria Antaran Prima Tbk.",
        "long_name": "PT Satria Antaran Prima Tbk",
        "summary": "PT Satria Antaran Prima Tbk operates as an android-based shipping service company in Indonesia. It offers city and domestic courier; warehouse management; international express shipping and cargo; mailroom; land transportation; dedicated courier; ocean and air cargo; cash on delivery; same day and one day delivery; regular delivery; last mile delivery; and label, packaging, and wood packing services. The company was founded in 2014 and is headquartered in East Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "East Jakarta",
        "zipcode": "12780",
        "website": "http://www.sap-express.id",
        "market_cap": "Large Cap"
    },
    "TNCA.JK": {
        "short_name": "Trimuda Nuansa Citra Tbk.",
        "long_name": "PT Trimuda Nuansa Citra Tbk",
        "summary": "PT Trimuda Nuansa Citra Tbk provides air courier services with door to door services under the Garuda Express Delivery brand name in Indonesia. It offers domestic and international courier and cargo services for the delivery of general goods, dangerous goods, medical goods, valuable goods, valuable documents, and shipping using refrigerated trucks. The company also offers freight forwarding and commercial post services, as well as rail, land, sea, and air transportation management services. PT Trimuda Nuansa Citra Tbk was founded in 1995 and is headquartered in Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "12870",
        "website": "http://www.ged.co.id",
        "market_cap": "Large Cap"
    }
}