{
    "BIRD.JK": {
        "short_name": "Blue Bird Tbk.",
        "long_name": "PT Blue Bird Tbk",
        "summary": "PT Blue Bird Tbk provides taxi transportation services in Indonesia. The company operates combined fleet of approximately 23000 taxis in 61 depots located in Jakarta, Banten, Bandung, Semarang, Surabaya, Bali, Lombok, Medan, Padang, Batam, Pekanbaru, Palembang, Makasar, and Manado; and operates 1000 executive taxis, as well as offers lifecare taxi services. It also provides used cars; charter bus services for business and leisure; and corporate rental services. In addition, the company offers logistics, heavy equipment rental, van and coach body manufacturing services; and operates a resort consisting of 189 rooms, 104 garden chalet rooms, 39 ocean view rooms, 14 beach bungalow rooms, 1 beach garden suite room with private pool, and 30 two bedroom mangsit suites. Further, it provides supporting services, such as strategic and IT-based services to medium-and large-size business, manages and develops properties and assets that include pool area, building, etc.; and maintains and operates petrol stations. The company was founded in 2001 and is based in South Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12790",
        "website": "http://www.bluebirdgroup.com",
        "market_cap": "Small Cap"
    },
    "LRNA.JK": {
        "short_name": "Eka Sari Lorena Transport Tbk.",
        "long_name": "PT Eka Sari Lorena Transport Tbk",
        "summary": "PT Eka Sari Lorena Transport Tbk, together with its subsidiaries, provides transportation services in Indonesia. It offers land and air transportation services; document, package, and cargo delivery services; and land transportation rental services, as well as engages in palm oil agribusiness. The company was founded in 2002 and is headquartered in Jakarta, Indonesia. PT Eka Sari Lorena Transport Tbk is a subsidiary of PT. Lorena Karina.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta",
        "zipcode": "10130",
        "website": "http://www.lorena-karina.com",
        "market_cap": "Small Cap"
    },
    "SAFE.JK": {
        "short_name": "Steady Safe Tbk",
        "long_name": "PT Steady Safe Tbk",
        "summary": "PT Steady Safe Tbk provides transportation services in Jakarta. It operates in two segments, Land Transportation and Financial Services. The company offers bus transportation services. It also engages in the provision of financing, limousine rental, and taxi services. The company was formerly known as PT. Tanda Widjaja Sakti and changed its name to PT Steady Safe Tbk in December 1993. PT Steady Safe Tbk was founded in 1971 and is headquartered in Jakarta, Indonesia. PT Steady Safe Tbk is a subsidiary of PT Infiniti Wahana.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Selatan",
        "zipcode": "12950",
        "website": "http://steadysafe.co.id",
        "market_cap": "Small Cap"
    },
    "TAXI.JK": {
        "short_name": "Express Transindo Utama Tbk.",
        "long_name": "PT Express Transindo Utama Tbk",
        "summary": "PT Express Transindo Utama Tbk, together with its subsidiaries, provides land transportation services in Indonesia. The company offers regular taxi services under the Express Taxi Regular and Eagle Taxi brand name; premium taxi services under the Tiara Express brand; and value added transportation business services, including limousine rental services under the Limousine Express brand name and bus rental services under the Eagle High brand name. It operates a fleet of approximately 8,000 licensed taxis in the Greater Jakarta area, as well as in other cities, such as Medan, Surabaya, Semarang, Bandung, Bali, and Lombok. The company was founded in 1981 and is headquartered in West Jakarta, Indonesia. PT Express Transindo Utama Tbk is a subsidiary of PT Rajawali Corpora.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "West Jakarta",
        "zipcode": "11160",
        "website": "http://expressgroup.co.id",
        "market_cap": "Small Cap"
    },
    "WEHA.JK": {
        "short_name": "WEHA Transportasi Indonesia Tbk",
        "long_name": "PT WEHA Transportasi Indonesia Tbk",
        "summary": "PT WEHA Transportasi Indonesia Tbk, together with its subsidiaries, provides passenger transportation services in Indonesia. The company operates in three segments: Passenger Transportation Services, Inter-Cities Transportation Services, and Other services. It operates bus rental business under the White Horse Deluxe Coach (WHDC) brand to serve domestic and international corporate customers, school kid's shuttle, employee's shuttle, weddings, and passenger transport for funeral home. The company also provides intercity shuttle services on the Jakarta-Bandung route under the Day Trans brand, and for the Central Java and surrounding areas with the Yogyakarta, Semarang, Solo, Salatiga, and Jepara routes, as well as online booking system. In addition, it offers car rental services; and sightseeing tour services, such as bus and tour guide. The company was formerly known as PT Panorama Transportasi Tbk and changed its name to PT WEHA Transportasi Indonesia Tbk in June 2015. PT WEHA Transportasi Indonesia Tbk was founded in 2001 and is headquartered in Tangerang, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15125",
        "website": "http://www.whitehorse.co.id",
        "market_cap": "Small Cap"
    }
}