{
    "ASSA.JK": {
        "short_name": "Adi Sarana Armada Tbk.",
        "long_name": "PT Adi Sarana Armada Tbk",
        "summary": "PT Adi Sarana Armada Tbk operates as a transportation service company in Indonesia. The company provides rental business services; leasing services without option rights for land transportation not four or more wheeled vehicles; freight transportation of goods such as truck, pick up, and container; and transportation consulting services. It also engages in car trading and car repair business. The company provides driver services, used vehicle trade through online and offline, parcel delivery services, car sharing, freight forwarding services, transportation consultation, and warehousing services. The company was founded in 1999 and is headquartered in North Jakarta, Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14350",
        "website": "http://www.assarent.co.id",
        "full_time_employees": 1010
    },
    "BPTR.JK": {
        "short_name": "Batavia Prosperindo Trans Tbk.",
        "long_name": "PT Batavia Prosperindo Trans Tbk",
        "summary": "PT Batavia Prosperindo Trans Tbk operates as a transportation services company in Indonesia. It offers long-term and short-term vehicle rental and fleet management services. The company was founded in 2014 and is based in Central Jakarta, Indonesia. PT Batavia Prosperindo Trans Tbk is a subsidiary of PT Batavia Prosperindo Makmur.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Pusat",
        "zipcode": "12920",
        "website": "http://www.bataviarent.com",
        "full_time_employees": 111
    },
    "SKRN.JK": {
        "short_name": "Superkrane Mitra Utama Tbk.",
        "long_name": "PT Superkrane Mitra Utama Tbk",
        "summary": "PT Superkrane Mitra Utama Tbk engages in the rental and trading of heavy equipment and accessories in Indonesia. The company leases crawler cranes, crawler telescopic boom cranes, rough terrain and all terrain cranes, truck mounted cranes, and cargo cranes; tele handlers; man lifts and man lifts crawlers; forklifts; scissor lifts; and multi axle products and truck trailers. It also provides lifting and rigging solutions for the construction/infrastructure, maintenance, mining, and petrochemical industries; and heavy construction services and engineering solutions. The company was founded in 1996 and is headquartered in North Jakarta, Indonesia. PT Superkrane Mitra Utama Tbk is a subsidiary of PT Sumi Traktor Perkasa.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Jakarta Utara",
        "zipcode": "14130",
        "website": "http://www.superkrane.com",
        "full_time_employees": 851
    },
    "TRJA.JK": {
        "short_name": "Transkon Jaya Tbk.",
        "long_name": "PT Transkon Jaya Tbk",
        "summary": "PT Transkon Jaya Tbk engages in the rental and lease without option rights for cars, buses, trucks, and others. The company rents light vehicles, light trucks and buses, manhauls, ambulance, service bodies, rescue vehicles, and other specialist vehicles. It also provides special vehicles with double and single cabin modification units for service units, palfinger cranes, heavy duty trays, drop side trays, and rescue units; and various accessories. The company serves mining, oil and gas, and construction industries. It also offers internet network, internet and communications, and IT and computer services. The company was founded in 2002 and is headquartered in Balikpapan, Indonesia. PT Transkon Jaya Tbk is a subsidiary of PT Damai Investa Sukses.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Rental & Leasing Services",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Balikpapan",
        "zipcode": "76116",
        "website": "http://transkon-rent.com",
        "full_time_employees": 172
    }
}