{
    "INOV.JK": {
        "short_name": "Inocycle Technology Group Tbk.",
        "long_name": "PT Inocycle Technology Group Tbk",
        "summary": "PT Inocycle Technology Group Tbk engages in the production and sale of recycle polyester staple fiber in Indonesia, the United States, Japan, the Philippines, India, Saudi Arabia, Morocco, Germany, Spain, Italy, and Australia. The company provides hollow conjugated, solid, and special function fiber. It also offers homeware products, such as pillows, bolsters, mattresses, blankets, carpets, mattress protectors, and bed cover sets; and geotextile non-woven products used in various industries, such as mining, construction, agriculture, manufacturing, and infrastructure. The Company was formerly known as PT Hilon Felt. The company was founded in 2001 and is headquartered in Tangerang, Indonesia. PT Inocycle Technology Group Tbk is a subsidiary of PT Hilon Indonesia.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Tangerang",
        "zipcode": "15560",
        "website": "http://www.inocycle.com",
        "market_cap": "Large Cap"
    },
    "OPMS.JK": {
        "short_name": "Optima Prima Metal Sinergi Tbk.",
        "long_name": "PT Optima Prima Metal Sinergi Tbk",
        "summary": "PT Optima Prima Metal Sinergi Tbk engages in the metal scrap trading business in Indonesia. It supplies steel plates from used ships to steel manufacturers; and offers metal scrap raw materials. The company was founded in 2012 and is based in Surabaya, Indonesia. PT Optima Prima Metal Sinergi Tbk is a subsidiary of PT Asian Perkasa Indosteel.",
        "currency": "IDR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Surabaya",
        "zipcode": null,
        "website": "http://www.opms.co.id",
        "market_cap": "Large Cap"
    }
}