{
  "1085.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Hengxin Technology Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HXTL",
    "state": null,
    "summary": "Hengxin Technology Ltd., an investment holding company, engages in the research, design, development, and manufacture of telecommunications and technological products, and the production of radio frequency coaxial cables for mobile communications and mobile communications systems exchange equipment in the People's Republic of China, India, and internationally. The company operates through Radio Frequency (RF) Coaxial Cables, Telecommunication Equipment and Accessories, and Antennas segments. It offers RF coaxial cables for mobile communications to transmit high-frequency signals between antenna and base station equipment in outdoor base station wireless signal coverage system and indoor wireless signal coverage system in buildings; and to radiate high frequency signals to surrounding environment through continuous small antenna elements along the cable in railways, highways, tunnels, underground car parks, elevators, and high rise buildings. The company also provides coaxial cables for telecommunications equipment and accessories to transmit signals within microwave communications systems, radio broadcast wireless systems, and air/sea radar systems, as well as accessories, such as connectors and jumper cables for wireless signal coverage systems equipment within base stations. In addition, it offers antennas for use in signal transmission for wireless communications; high temperature resistant cables, which are used as part of the raw material components for antennas; and antenna testing services. Further, the company provides technical services of antennas and related telecommunications products for mobile communications systems, as well as engages in trading and investment activities. It serves telecommunications operators and equipment manufacturers. The company was founded in 1996 and is headquartered in Singapore.",
    "website": "http://www.hengxin.com.sg",
    "zipcode": "529541"
  },
  "1206.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Electronic Components",
    "long_name": "Technovator International Limited",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "TECHNOVATOR",
    "state": null,
    "summary": "Technovator International Limited, together with its subsidiaries, provides smart energy management products, solutions, and integrated services primarily in the People's Republic of China. The company's Smart Transportation segment offers a series of proprietary software and hardware products, and integrated supervision and control system for rail transit; and building automation systems for use in rail transit and safety door systems, as well as provides integrated solutions comprising planning, procurement, installation, commissioning, and aftersales services. Its Smart Building and Complex segment provides integrated intelligence solutions and efficiency management services, including integrated energy consumption monitoring, energy-saving consultation, and reformation services, as well as full life-cycle services; and supplies and integrates intelligence systems for buildings. The company's Smart Energy segment offers regional energy planning, integrated utilization of industrial waste heat recovery, heat pump, independent temperature and humidity control, and variable air rate technologies for energy cascade utilization, as well as optimization and transformation of energy systems. This segment also provides urban heating network technologies, including distributed variable frequency heating, cooling and heating network balancing, and combined multi-heat sources heating, as well as heating network and source monitoring, and optimal regulation technologies. The company also offers digital video urban surveillance systems for multi-level remote surveillance in the finance, electricity, security, and road traffic industries; and fire alarm systems, which offers online fire control solutions for city authorities and commercial users. The company was formerly known as Technovator Int Private Ltd. and changed its name to Technovator International Limited in September 2011. Technovator International Limited was incorporated in 2005 and is headquartered in Singapore.",
    "website": "http://www.technovator.com.sg",
    "zipcode": "347805"
  },
  "1O3.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Software - Application",
    "long_name": "iFAST Corporation Ltd.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "IFAST CORP. LTD",
    "state": null,
    "summary": "iFAST Corporation Ltd. provides investment products and services in Singapore, Hong Kong, Malaysia, and China. The company operates through Business-to-Business (B2B), Business-to-Consumer (B2C), and Business-to-Business-to-Consumer (B2B2C) divisions. The B2B division operates iFAST Central that includes a range of services, including investment administration and transactions services, research and trainings, IT services, and backroom functions to banks, financial advisory firms, and financial institutions. It also operates iFAST Global Prestige, an investment platform designed to meet the requirements of high net worth individuals, as well as the wealth advisers servicing them; and iFAST Pensions that delivers tax-effective employee benefit solutions to multinational companies and its employees comprising expatriates, as well as assists companies to administer pension schemes for its employees through an Internet platform. In addition, this division operates iFAST Global Markets that provides investors with transparent adviser-assisted wealth management plans. The B2C division offers a distribution and transactional platform for investors through its Fundsupermart.com Website that offers a range of investment products, transparent fees structure, tools to compare investments, customer services support, and research advice. The B2B2C division provides fintech solutions to institutional clients to develop and enhance its capabilities. The company also operates bondsupermart.com, a regional bond information portal that provides bond information and research for investors and wealth advisers. iFAST Corporation Ltd. was incorporated in 2000 and is headquartered in Singapore.",
    "website": "http://www.ifastcorp.com",
    "zipcode": "049315"
  },
  "42E.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Choo Chiang Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Choo Chiang",
    "state": null,
    "summary": "Choo Chiang Holdings Ltd., an investment holding company, engages in the retail and distribution of electrical products and accessories in Singapore. It operates through two segments, Distribution Business and Property Investment Business. The company offers electrical cables and cable accessories; light switches, circuit breakers, and accessories; lightning accessories; trunking and pipe products; air-conditioner accessories; light fixtures and accessories; ventilating, wall-mounted, and ceiling fans; and power drills and handheld tools. It also provides electrical products and accessories under the CCM and CRM brands. In addition, the company is involved in the assembly of lighting fittings and fixtures; and property investment and real estate management activities. It offers its products for residential and industrial use through 10 retail branches. The company was incorporated in 2014 and is headquartered in Singapore. Choo Chiang Holdings Ltd. is a subsidiary of TL Investment Holdings Pte. Ltd.",
    "website": "http://www.ccm.sg",
    "zipcode": "738388"
  },
  "544.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Information Technology Services",
    "long_name": "CSE Global Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CSE Global",
    "state": null,
    "summary": "CSE Global Limited, an investment holding company, provides integrated industrial automation, information technology, and intelligent transport solutions in the Asia Pacific, the Americas, Europe, the Middle East, and Africa. The company offers automation solutions, including process control, safety shutdown, fire and gas detection, supervisory control and data acquisition (SCADA), wellhead and subsea control, process skid, electrical drive and high/medium voltage, electrical protection and control, real-time information, and intelligent transport systems, as well as I&E construction and safe secure solutions. It also provides environmental solutions comprising multiple hearth furnaces, fluid bed incinerators, carbon and energy recovery systems, and rotary kiln incinerators. In addition, the company offers telecommunication solutions, including construction communications, fiber optic, microwave radio, conventional and trunked radio, and public address and general alarm systems; VSAT satellite communications, telephone, local and wide area, Internet protocol based, and SCADA and telemetry networks; and CCTV, access control, and FIDS systems. Further, it provides e-business integration, research and development, and computer system integration services; computer network systems; computer systems; infrastructure engineering services; plant and environmental engineering services; contracting resources and permanent placement; and two-way radio services. Additionally, the company distributes electrical engineering equipment; designs and installs high temperature thermal process and incineration systems; designs and develops water treatment and disposal technology; provides commercial building controls and automation services; and leases office and warehouse space. It serves oil and gas, infrastructure, and mining industries. CSE Global Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.cse-global.com",
    "zipcode": "469332"
  },
  "558.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "UMS Holdings Limited",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "UMS",
    "state": null,
    "summary": "UMS Holdings Limited, an investment holding company, provides high precision front-end semiconductor components, and electromechanical assembly and final testing services. It operates in two segments, Semiconductor and Others. The Semiconductor segment offers precision machining components and equipment modules for semiconductor equipment manufacturers. The Others segment provides water disinfection systems shipment services; and supplies base components to oil and gas original equipment manufacturers, as well as trades in nonferrous metal alloys. The company also offers precision machining services, including milling, lathe, horizontal, cleaning, anodizing, and CMM; metal finishing services, such as electroless and selective nickel, anodizing, plating, e-polish, chemical cleaning, and parts refurbishment; and system integration, refurbishment, prototyping, and vendor managed inventory services, as well as electroplating services. In addition, it is involved in the assembly and integration of equipment and automated assembly lines; manufacture and assembly of stainless steel gaslines and weldment products; manufacture and repair of waste water treatment equipment; and holding of investment properties. The company serves semiconductor, electronic, machine tools, aerospace, and oil and gas industries. It operates in Singapore, Malaysia, Taiwan, the United States, South Korea, the People's Republic of China, and internationally. UMS Holdings Limited was incorporated in 2001 and is headquartered in Singapore.",
    "website": "http://www.umsgroup.com.sg",
    "zipcode": "499616"
  },
  "573.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Challenger Technologies Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Challenger",
    "state": null,
    "summary": "Challenger Technologies Limited operates a chain of information technology (IT) retail stores under the Challenger brand name in Singapore. The company operates through IT Products and Services, Electronic Signage, and Telephonic Call Centre and Data Management Services segments. The IT Products and Services segment retails a selection of IT products, including personal computers, notebooks, printers, scanners, digital imaging solutions, personal digital assistants, mobile and wireless connectivity solutions, audio-visual and projection equipment, and related peripherals. The Electronic Signage segment supplies and installs electronic signages; and provides electronic signage services. The Telephonic Call Centre and Data Management Services segment is involved in the provision of telephonic call center, data management, and direct marketing services. The company also offers procurement services for IT products. In addition, it engages in the online sale of computer hardware, software, and accessories, as well as mobile phones and accessories. As of February 13, 2020, the company operated retail network of 41 stores. Challenger Technologies Limited was founded in 1982 and is based in Singapore.",
    "website": "http://www.challengerasia.com",
    "zipcode": "408553"
  },
  "575.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "ASTI Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ASTI^",
    "state": null,
    "summary": "ASTI Holdings Limited, an investment holding company, engages in the provision of semiconductor manufacturing services for surface mount technology components in Singapore, China, Malaysia, the Philippines, the United Kingdom, and internationally. It operates in two segments, Back-end Equipment Solutions and Technologies, and Distribution and Services. The company provides tape and reel packaging, and integrated circuit programming services to original equipment manufacturers, contract manufacturers, and component distributors. It also offers solutions and technologies in the back-end, including assembly, test, and finishing activities; and semiconductor application in consumer electronics, computer peripheral, and communication solutions. In addition, the company manufactures and distributes carrier tapes and plastic reels; and develops chip packaging and related technologies. Further, it offers equipment contract manufacturing services comprising turnkey manufacturing, assembly, and machining services for the semiconductor, medical, scientific, and precision tooling industries; trades in electronic components and computer peripherals, equipment, and materials; and acts as a commission agent, as well as engages in the property investment activities. Additionally, the company is involved in the construction of antique wooden sea boats, communication of culture, exhibition, conference activities, etc.; and development and management of a mixed-use property. ASTI Holdings Limited was incorporated in 1999 and is based in Singapore.",
    "website": "http://www.astigp.com",
    "zipcode": "339416"
  },
  "580.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "Santak Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Santak",
    "state": null,
    "summary": "Santak Holdings Limited, an investment holding company, manufactures and trades in precision engineering and assembly products. It operates through Precision Engineering and Trading and Distribution segments. The company's Precision Engineering segment manufactures precision machined components for multi-national companies and other contract manufacturers. This segment's products are primarily used in hard-disk drives, fibre-optics connectors, consumer electronic devices, oil and gas equipment, telecommunication devices, mobile phones, optical instrument devices, medical equipment, connectors/contacts, and computer peripherals. Its Trading and Distribution segment engages in the sourcing and supplying of custom-made electronic, electrical, and mechanical components/products. This segment offers die-cast and machined parts, metal enclosures and stamped parts, heatsinks, solenoids, coils, contactless smartcards, security/access control systems, and OEM assembly of card readers. This segment also supplies customized electro-mechanical and mechanical assemblies, sheet metal parts, aluminum and copper heat sinks, wire harnessing, power supplies, and special material PCBs, as well as thermoplastic/BMC/insert molding products. The company operates in Singapore, other ASEAN countries, North Asia, the United States, Europe, and internationally. Santak Holdings Limited was founded in 1978 and is based in Singapore.",
    "website": "http://www.santak.com.sg",
    "zipcode": "758084"
  },
  "5AB.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Trek 2000 International Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Trek 2000 Intl",
    "state": null,
    "summary": "Trek 2000 International Ltd, an investment holding company, engages in the research, design, development, and dealing of computer hardware, software, electronic components, and other related products. The company operates through Interactive Customised Solutions, Interactive Consumer Solutions, and Licensing segments. It offers patented technology solutions, including USB, wireless, anti-piracy, compression, security/encryption, centralized management system, and PC and mobile apps products; and portable storage solutions, such as flash memory. The company also provides wireless solutions, including patient alert systems, Flucard, Flucard ultra, Ai-ball, smart gateway, and smart sensor for diapers; and ThumbDrive solutions, such as trek's smart meters, micro solid state devices, i solid state devices, ThumbDrive cloud, thumbdrive crypto, thumbdrive swipe, ThumbDrive SWAN, and chez solutions to protect crucial information, as well as secure transaction, identity, key, encryption, and storage flash drives. In addition, it is involved in the research and experimental development on medical technologies; research, design, development, and distribution of memory modules, and other related products and solutions; and development and marketing of Web portal services, including social networking sites. Further, the company provides design solutions, such as complete design-in modules or sub-modules in semi-customized or customized forms for software, hardware, and firmware; and security solutions for mobile storage devices, as well as licenses its patented technologies and trademarks. It operates in China/Hong Kong, Taiwan, India, Singapore, Indonesia, Malaysia, Thailand, Europe, the United States, and internationally. Trek 2000 International Ltd was incorporated in 1999 and is headquartered in Singapore.",
    "website": "http://www.trek2000.com.sg",
    "zipcode": "508769"
  },
  "5EF.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Adventus Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Adventus",
    "state": null,
    "summary": "Adventus Holdings Limited, an investment holding company, operates as a property development and management consulting company in Singapore and Vietnam. The company is also developing two 5-star hotels under the name Da Nang 5-Star Hotel Development and Hoi An 5-Star Resort projects. In addition, it offers management consulting and construction management services; invests in properties; and operates in commodities and mineral resources businesses. The company was formerly known as SNF Corporation Ltd. and changed its name to Adventus Holdings Limited in January 2009. Adventus Holdings Limited was founded in 2003 and is headquartered in Singapore.",
    "website": "http://www.adventusholdings.com",
    "zipcode": "100052"
  },
  "5HC.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Information Technology Services",
    "long_name": "Ntegrator International Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Ntegrator Intl",
    "state": null,
    "summary": "Ntegrator International Ltd., an investment holding company, provides information technology and telecommunication solutions in Singapore, Vietnam, and Myanmar. It operates through two segments, Project Sales, and Project Management and Maintenance Services. The company offers fiber optics network infrastructure solutions, multi-service access solutions for network infrastructure, solutions for ISPs and Internet applications, computer security solutions for IP networks, VoIP solutions, wireless LAN deployment for campuses and public facilities, and WCDMA and 4G LTE network solutions. It is also involved in the seamless integration of voice and data signals used in organizations' telephone network, which include PABX, video conferencing systems, and VoIP applications, as well as voice messaging, recording, or logging systems. In addition, the company offers project management services, including the provision of installation and implementation services for network infrastructure and voice communication systems; and onsite and online maintenance and support services, such as control hotline, hardware and software repair, online CRM system, onsite support, and remote dial-in services. Further, it provides system integration services of voice, video, and data communication networks; and building construction services, which include fiber patching, splicing, installation, and maintenance, as well as undertakes cable/civil works for underground, road, and inbuilding. Ntegrator International Ltd. was incorporated in 1999 and is headquartered in Singapore.",
    "website": "http://www.ntegrator.com",
    "zipcode": "159088"
  },
  "5NT.SG": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Information Technology Services",
    "long_name": "Ntegrator International Ltd.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Ntegrator International Ltd. Re",
    "state": null,
    "summary": "Ntegrator International Ltd., an investment holding company, provides information technology and telecommunication solutions in Singapore, Vietnam, and Myanmar. It operates through two segments, Project Sales, and Project Management and Maintenance Services. The company offers fiber optics network infrastructure solutions, multi-service access solutions for network infrastructure, solutions for ISPs and Internet applications, computer security solutions for IP networks, VoIP solutions, wireless LAN deployment for campuses and public facilities, and WCDMA and 4G LTE network solutions. It is also involved in the seamless integration of voice and data signals used in organizations' telephone network, which include PABX, video conferencing systems, and VoIP applications, as well as voice messaging, recording, or logging systems. In addition, the company offers project management services, including the provision of installation and implementation services for network infrastructure and voice communication systems; and onsite and online maintenance and support services, such as control hotline, hardware and software repair, online CRM system, onsite support, and remote dial-in services. Further, it provides system integration services of voice, video, and data communication networks; and building construction services, which include fiber patching, splicing, installation, and maintenance, as well as undertakes cable/civil works for underground, road, and inbuilding. Ntegrator International Ltd. was incorporated in 1999 and is headquartered in Singapore.",
    "website": "http://www.ntegrator.com",
    "zipcode": "159088"
  },
  "5PF.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Scientific & Technical Instruments",
    "long_name": "Jason Marine Group Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Jason Marine",
    "state": null,
    "summary": "Jason Marine Group Limited, an investment holding company, provides marine electronics systems integration and support services for the marine and offshore oil and gas industries. The company operates in Sale of Goods, Rendering of Services, and Airtime Revenue segments. The Sale of Goods segment engages in the design, supply, and sale of marine, communication, navigation, and automation equipment. The Rendering of Services segment provides maintenance and support services, including repair works, troubleshooting, commissioning, radio survey, and annual performance tests. The Airtime Revenue segment offers airtime for the satellite communication systems. The company offers CCTVs; PABX systems; PAGA systems for individual project specifications; GMDSS A3 solutions; VSAT systems; LAN systems; entertainment systems; Helideck monitoring systems and weather monitoring systems; UHF network systems; collision avoidance radar systems; microwave systems; and non-directional beacons, as well as search and rescue systems, and vessel and ship health monitoring systems. It has operations in Singapore, the People's Republic of China, Indonesia, Malaysia, Germany, Denmark, and internationally. Jason Marine Group Limited was founded in 1976 and is headquartered in Singapore.",
    "website": "http://www.jason.com.sg",
    "zipcode": "128383"
  },
  "6K4.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Triterras, Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "TRITERRAS INC. CL.A",
    "state": null,
    "summary": "Triterras, Inc. operates as a fintech company. It operates Kratos, a commodity trading and trade finance platforms that connects and enables commodity traders to trade and source capital from lenders directly online. The company is headquartered in Singapore.",
    "website": "http://triterras.com",
    "zipcode": "048619"
  },
  "7IQ.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "Revez Corporation Ltd.",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "REVEZ CORPORATION LTD.",
    "state": null,
    "summary": "Revez Corporation Ltd., together with its subsidiaries, engages in the developing and implementation of information technology solutions. It operates through IT Solutions; Meetings, Incentive, Conferences, Exhibitions (MICE); and Digital Media Networks segments. The IT Solutions segment provides simple applications and websites; comprehensive tailor-made integrated solutions, which includes design and development of integrated suite of solutions, immersive multimedia, artificial intelligence, internet of things, information and communications technology, software-as-a-service, and creative and content services; engineering consultancy; and robotic solutions and services to customers. The MICE segment offers design and installation support to its solutions, which are installed in showrooms, exhibition halls, product launches, and customer service centers. The Digital Media Networks segment is involved in creating, owning, and implementing award-winning digital media solutions and media networks; and digital out-of-home, advertising networks, and digital sport networks. The company is headquartered in Singapore. Revez Corporation Ltd. is a subsidiary of L3N Capital Pte. Ltd.",
    "website": "http://www.revezcorp.com",
    "zipcode": "138565"
  },
  "8353.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Software - Application",
    "long_name": "Anacle Systems Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ANACLE",
    "state": null,
    "summary": "Anacle Systems Limited engages in the software development, and provision of enterprise application software and energy management solutions in Singapore, Malaysia, the People's Republic of China, and internationally. It operates through three segments: Simplicity and myBill; Starlight; and SpaceMonster. The Simplicity and myBill segment include a package of enterprise application software solutions, which provides specific solutions for enterprise asset management, shared resources management, tenancy management, financial management, supply chain management, customer relationship management, and billing management. The Starlight segment provides cloud-based energy management solutions to the energy profiles of buildings, including energy consumption, power quality, energy analytics, and carbon footprint profiles information. The SpaceMonster segment operates as an online venue booking platform. The company also offers support and maintenance services; and researches, designs, develops, and supervises the manufacturing and assembly process of hardware products. It serves aerospace, defense, education, environment, healthcare, real estate, and utility industries. Anacle Systems Limited was founded in 2006 and is headquartered in Singapore.",
    "website": "http://www.anacle.com",
    "zipcode": "138633"
  },
  "8420.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Software - Infrastructure",
    "long_name": "Nexion Technologies Limited",
    "market": "hk_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NEXION TECH",
    "state": null,
    "summary": "Nexion Technologies Limited, an investment holding company, provides information and communications technology solutions. The company offers cyber infrastructure solutions, including maintenance and support services for telecommunications service providers and large enterprises; and cyber security solutions in the area of Internet content management for government agencies. It also provides a Software-as-a-Service platform, which includes hardware and software and/or service components, as well as holds properties. The company operates in Hong Kong, Malaysia, Myanmar, Taiwan, the Philippines, Singapore, South Korea, and the People's Republic of China. Nexion Technologies Limited has a technology partnership agreement with XOX Berhad to develop its SaaS and cyber security businesses. The company was founded in 2002 and is headquartered in Singapore.",
    "website": "http://www.nexion.com.hk",
    "zipcode": "369585"
  },
  "8AZ.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "Aztech Global Ltd.",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Aztech Gbl",
    "state": null,
    "summary": "Aztech Global Ltd., together with its subsidiaries, engages in the research, development, engineering, and manufacturing of IoT devices, data-communication products, and LED lighting products. It operates through IoT Devices and Data-communication Products; LED lighting products; and Others segments. The company provides smart security cameras; IoT lighting products; homeplugs; fibre gateways; dual band Wi-Fi MESH controllers; satellite modems; climate control mattresses; tracking devices; and healthtech products, such as wearable sensors to original equipment manufacturers (OEM) and original design manufacturers (ODM).It also distributes IoT home automation systems that enable users to control devices at home wirelessly through an application on their smartphones or tablets under the Kyla brand names through channel partners and e-commerce platforms. In addition, the company provides LED lighting products, such as luminaires, bulbs, and tubes for use in residential, commercial, industrial, agriculture, refrigeration, and automotive industrial applications; electrical and LED lights, fittings, and parts; plastic injection parts; and multi-communication products and computer peripherals, as well as installs lighting systems. Further, it offers kitchen appliances, including ovens, air fryers, electric kettles, and toasters; and home and living products, such as cordless vacuum cleaners, fans, and air purifiers. The company also provides joint development manufacturing and contract manufacturing services to multinational corporations. The company was formerly known as Aztech Global Pte. Ltd. and changed its name to Aztech Global Ltd. in February 2021. Aztech Global Ltd. was founded in 1986 and is based in Singapore. Aztech Global Ltd. is a subsidiary of Aztech Group Ltd.",
    "website": "http://www.aztechglobal.com",
    "zipcode": "408694"
  },
  "A31.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Addvalue Technologies Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Addvalue Tech",
    "state": null,
    "summary": "Addvalue Technologies Ltd, an investment holding company, provides satellite-based communication and digital broadband products and solutions for connectivity between human, machines, and human and machines. It operates through three segments: Europe Middle East and Africa, North America, and Asia Pacific. The company develops and manufactures a range of terminals operating on satellite networks for land, maritime, and aeronautical applications; and develops agile communications systems and employs software defined radio and deep machine learning tools for governments and commercial enterprises. It also provides turnkey contracting services for system integration; and managed services that combine edge processing in terminals and cloud-based services platforms. The company markets its products and solutions under the Wideye brand. Addvalue Technologies Ltd has partnership with AIOT Chile SpA to provide a smart satcom-based digital IOT/M2M solution. The company was founded in 1994 and is headquartered in Singapore.",
    "website": "http://www.addvaluetech.com",
    "zipcode": "469332"
  },
  "AIY.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Software - Application",
    "long_name": "iFAST Corporation Ltd.",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "IFAST",
    "state": null,
    "summary": "iFAST Corporation Ltd. provides investment products and services in Singapore, Hong Kong, Malaysia, and China. The company operates through Business-to-Business (B2B), Business-to-Consumer (B2C), and Business-to-Business-to-Consumer (B2B2C) divisions. The B2B division operates iFAST Central that includes a range of services, including investment administration and transactions services, research and trainings, IT services, and backroom functions to banks, financial advisory firms, and financial institutions. It also operates iFAST Global Prestige, an investment platform designed to meet the requirements of high net worth individuals, as well as the wealth advisers servicing them; and iFAST Pensions that delivers tax-effective employee benefit solutions to multinational companies and its employees comprising expatriates, as well as assists companies to administer pension schemes for its employees through an Internet platform. In addition, this division operates iFAST Global Markets that provides investors with transparent adviser-assisted wealth management plans. The B2C division offers a distribution and transactional platform for investors through its Fundsupermart.com Website that offers a range of investment products, transparent fees structure, tools to compare investments, customer services support, and research advice. The B2B2C division provides fintech solutions to institutional clients to develop and enhance its capabilities. The company also operates bondsupermart.com, a regional bond information portal that provides bond information and research for investors and wealth advisers. iFAST Corporation Ltd. was incorporated in 2000 and is headquartered in Singapore.",
    "website": "http://www.ifastcorp.com",
    "zipcode": "049315"
  },
  "AVV.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "CEI Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CEI",
    "state": null,
    "summary": "CEI Limited provides contract manufacturing services for the industrial equipment market in the Asia Pacific, Europe, and the United States. It offers printed circuit board and box-build assembly, equipment design, cable harness assembly, and manufacturing services; and value-added services, such as materials management, circuit layout, development engineering and prototype samples, metal stamping, cable harnessing, and precision machined components. The company also designs and manufactures own branded proprietary equipment for the semiconductor industry. It offers its services for electroluminescence displays used in industrial, transportation, and medical applications; medical and health care equipment; office automation equipment such as high speed printers; office equipment, including digital photocopiers; analytical instruments comprising gas and liquid chromatographs, and measurement instruments; aerospace products and oil and gas equipment; industrial safety controllers and environmental sensors; semiconductor equipment; and SMT equipment. The company was formerly known as CEI Contract Manufacturing Limited and changed its name to CEI Limited in April 2016. CEI Limited was founded in 1980 and is headquartered in Singapore. As of April 26, 2021, CEI Limited operates as a subsidiary of AEM Singapore Pte. Ltd.",
    "website": "http://www.cei.com.sg",
    "zipcode": "569707"
  },
  "AWX.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "AEM Holdings Ltd",
    "market": "sg_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "AEM",
    "state": null,
    "summary": "AEM Holdings Ltd provides intelligent system testing and handling solutions for semiconductor and electronics companies Asia, North America, Europe, the Middle East, and Central America. It operates through Equipment Systems Solutions, System Level Test & Inspection, Micro-Electro-Mechanical Systems, and Test and Measurement Solutions segments. The company offers handling and test equipment; engineering and design services; field support services; and supplies, consumables, maintenance services, upgrade kits, and upgrade engineering for handlers. It also provides automatic measurement and test solutions for communications; and specialized wafer probers that enable the testing for sensors and semiconductors for the automotive, industrial, and consumer sectors. AEM Holdings Ltd is headquartered in Singapore.",
    "website": "http://www.aem.com.sg",
    "zipcode": "555853"
  },
  "AWZ.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Multi-Chem Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Multi-Chem",
    "state": null,
    "summary": "Multi-Chem Limited, an investment holding company, distributes information technology products in Singapore, the People's Republic of China, Australia, and internationally. It operates in two segments, PCB Business and IT Business. The company provides distributes hardware and software relating to internet and network products, as well as related installation, technical, and maintenance services. In addition, it offers PCB manufacturing services, such as precision drilling services to PCB fabricators. Further, the company distributes a range of specialty chemicals for surface treatment, electroless copper plating, tin/tin lead stripping, and micro-etching; and supplies PCB-related materials and equipment, including plating systems, pulse rectifiers for copper plating, copper and tin anodes for electroplating, entry and back-up materials for drilling, non-woven brushes, dry film and liquid photoresist products, CCL and prepreg products, tacky rollers, tack cloth/wipes, and cleaning machines to remove foreign particles on PCBs. Additionally, it rents machines, as well as offers software consultancy and implementation services; and IT training courses. Multi-Chem Limited was incorporated in 1985 and is headquartered in Singapore.",
    "website": "http://www.multichem.com.sg",
    "zipcode": "609966"
  },
  "B26.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Ban Leong Technologies Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Ban Leong",
    "state": null,
    "summary": "Ban Leong Technologies Limited, together with its subsidiaries, engages in the wholesale and distribution of computer peripherals, accessories, and other multimedia products in Singapore and internationally. It operates through three segments: Multimedia, Data storage, and IT accessories. The Multimedia segment offers audio and visual products, such as ear phones, speakers, cameras, and commercial and consumer displays. The Data Storage segment provides storage of data, such as cloud drives, HDD enclosures, and Blu-ray and portable DVD-RW. The IT Accessories segment offers PC-related accessories, including computer systems, components, peripherals, and printers, as well as mobile products, such as wearables, accessories, and powerpacks. It also provides smart home and robotics solutions. The company distributes its products through e-commerce; retailers and chain stores; and directly to commercial resellers and system integrators. Ban Leong Technologies Limited was incorporated in 1993 and is based in Singapore.",
    "website": "http://www.banleong.com",
    "zipcode": "408825"
  },
  "B69.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Computer Hardware",
    "long_name": "Broadway Industrial Group Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Broadway Ind",
    "state": null,
    "summary": "Broadway Industrial Group Limited, an investment holding company, manufactures and sells precision-machined components and assemblies for electronics, automotive, oil and gas, and other industries. It manufactures various actuator arms, and related assembled parts primarily for the hard disk drive industry. The company also distributes precision machined components; and provides business and management consultancy services. It operates in Thailand, the People's Republic of China, Singapore, and internationally. The company was founded in 1969 and is headquartered in Singapore.",
    "website": "http://www.bw-grp.com",
    "zipcode": "138633"
  },
  "BCY.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Powermatic Data Systems Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Powermatic Data",
    "state": null,
    "summary": "Powermatic Data Systems Limited, an investment holding company, manufactures, sells, markets, and distributes wireless connectivity products and related services in Singapore and other Asian countries, the United States, Europe, and internationally. The company operates through, Wireless Connectivity Products and Property segments. It provides wireless radio modules, embedded boards, indoor and outdoor access points, and wireless antennas used in industrial PC, IOT, healthcare, hospitality, security surveillance and other industries, as well as offers OEM and ODM solutions, and other sales related services. The company is also involved in the lease and maintenance of Harrison Industrial Building, a freehold investment property in Singapore; and trading of computers related peripherals. It serves electronic and wireless device component distributors, system integrators, wireless products design houses, and other corporations. Powermatic Data Systems Limited was founded in 1989 and is headquartered in Singapore.",
    "website": "http://www.powermatic.com.sg",
    "zipcode": "369651"
  },
  "BDA.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "PNE Industries Ltd",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "PNE Industries",
    "state": null,
    "summary": "PNE Industries Ltd, an investment holding company, manufactures, assembles, and trades in electrical and electronic products primarily in Europe, Malaysia, Singapore, and the People's Republic of China. It operates in two segments, Contract Manufacturing and Trading. The Contract Manufacturing segment manufactures electronic controllers, and other electrical and electronic products. The Trading segment manufactures and trades in emergency lighting equipment and related products under PNE brand name. It also provides electrical apparatus, light fittings, and related products. PNE Industries Ltd was founded in 1983 and is headquartered in Singapore.",
    "website": "http://www.pne.com.sg",
    "zipcode": "339944"
  },
  "BDF.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Excelpoint Technology Ltd.",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Excelpoint",
    "state": null,
    "summary": "Excelpoint Technology Ltd., an investment holding company, provides electronic components, and engineering design, and supply chain management services. The company is involved in the trading of electronic components; and provision of marketing and technical support services. It offers wireless connectivity and DSP audio enhancement implementation solutions that are used in portable wireless speakers, wireless music headphones, mini combos, sound bar and wireless subwoofers, and audio transmitter dongles; wearable devices and accessories for iPhone and iPad; solutions of Bluetooth enabled massage chairs and lost-and-found tags; and entry-level and mid-tier platforms for wearables and smart accessories applications. The company also provides automotive solutions, including the development of reference car infotainment systems and core boards, which support GPS for navigation, video playback, Bluetooth headset and handfree, Bluetooth music streaming, rearview camera, etc.; connectivity solutions, such as BLE, Bluetooth, BLE/Bluetooth combo, embedded Wi-Fi, and sub-Ghz modules for smart homes; headset solutions; Qualcomm, a smart audio platform; and electric power quality analyzer systems. In addition, it offers Internet of Things solutions for smart buildings, smart agriculture and smart infrastructure. It serves original equipment manufacturers, original design manufacturers, and electronics manufacturing service providers in Hong Kong, the People's Republic of China, Southeast Asia, India, and internationally. The company was founded in 1987 and is headquartered in Singapore.",
    "website": "http://www.excelpoint.com",
    "zipcode": "486057"
  },
  "BIX.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "Ellipsiz Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Ellipsiz",
    "state": null,
    "summary": "Ellipsiz Ltd, an investment holding company, distributes various manufacturing, testing, and inspection/measurement equipment to the semiconductor, electronics manufacturing, and telecommunication industries. The company's Distribution and Services Solutions segment distributes equipment and tools for semiconductor and electronics manufacturing, integrated circuit (IC) failure analysis, IC reliability testing, and printed circuit board assembly testing and inspection services; and provides equipment maintenance support engineering services, including systems integration to the semiconductor and electronics manufacturing services industry. This segment also provides facilities management services, such as chemicals, gas and abatement management, and turnkey wafer fabrication equipment relocation; and trades in consumable products for hospital, pharmaceutical, electronic, and food processing industries. Its Automated Precision System Solutions segment offers customized systems and solutions for test automation; high precision automated assembly process for fiber and lens; and automated wafer level testing in the semiconductor and electronics manufacturing environment. The company's Vending Solutions segment distributes and provides retail solutions through intelligent automated retail machines. Its Property Investment and Development segment invests in and develops properties. The company also offers solutions for in-circuit and functional testing; sells and markets scientific and industrial products; engineering services; and related technical and support services. It operates in Singapore, Malaysia, China, Taiwan, Indonesia, and internationally. The company was formerly known as SingaTrust Ltd. and changed its name to Ellipsiz Ltd in 2001. Ellipsiz Ltd was founded in 1992 and is headquartered in Singapore. Ellipsiz Ltd is a subsidiary of Bevrian Pte. Ltd.",
    "website": "http://www.ellipsiz.com",
    "zipcode": "555854"
  },
  "BKY.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductors",
    "long_name": "Avi-Tech Electronics Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Avi-Tech",
    "state": null,
    "summary": "Avi-Tech Electronics Limited provides burn-in, manufacturing and printed circuit board assembly, and engineering services for the semiconductor, electronics, life sciences, aviation, and other industries. It operates through three divisions: Burn-In and Related Services, Burn-In Boards and Boards Related Products, and Engineering Services and Equipment Distribution. The Burn-In and Related Services division offers static burn-in, dynamic burn-in, test during burn-in, and high power burn-in services for semiconductor manufacturers, as well as tape and reel services. The Burn-In Boards and Boards Related Products division designs and manufactures a range of burn-in boards for various types of burn-in systems; and boards for other types of reliability tests, such as high temperature operating life tests and highly accelerated stress tests. It also provides printed circuit board assembly services for industries ranging from medical, mobile communications, and aviation. The Engineering Services and Equipment Distribution division is involved in the design, development, full turnkey outsourced manufacturing, and system integration of semiconductor equipment and lab automation systems for the life sciences and biotech industries. It also provides technical services, as well as distributes third party products. The company also markets and sells burn-in boards; and trades in imaging equipment and energy efficient products, as well as engages in business support activities. It serves customers in Singapore, the United States, Malaysia, Germany, the Philippines, Thailand, Taiwan, and China. The company was incorporated in 1981 and is headquartered in Singapore.",
    "website": "http://www.avi-tech.com.sg",
    "zipcode": "554859"
  },
  "BVQ.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Information Technology Services",
    "long_name": "Procurri Corporation Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Procurri",
    "state": null,
    "summary": "Procurri Corporation Limited provides data center equipment and information technology (IT) lifecycle services. It operates through two segments, IT Distribution and Lifecycle Services. The company distributes IT hardware products, including servers, and storage and networking equipment of various IT brands, as well as provides supply chain management services. It also offers IT maintenance services for various IT systems and networks; IT hardware as a service; and equipment refurbishment and data destruction, and asset disposal services. In addition, the company is involved in the supply, rental, maintenance, and servicing of computer hardware, peripheral equipment, and data processing equipment; computer network and system integration design, installation, commissioning, and maintenance activities; provision of technical advice and services, and enterprise management consulting services; data processing activities; and distribution of IT spare parts. Further, it engages in the sale of IT asset disposal; and provision of repair, data center, hardware resale, and computer hardware and peripheral equipment maintenance services. It serves original equipment manufacturers, value-added resellers, system integrators, and cloud and managed services providers in Singapore, Europe, the Middle East, Africa, the Americas, and internationally. Procurri Corporation Limited was founded in 2009 and is headquartered in Singapore.",
    "website": "http://www.procurri.com",
    "zipcode": "534119"
  },
  "C04.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Casa Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Casa",
    "state": null,
    "summary": "Casa Holdings Limited, an investment holding company, distributes home and cooking appliances, kitchen and bathroom fixtures, and accessories in Southeast Asia, South Asia, North Africa, the Middle East, and internationally. It operates through two segments, Trading and Property Development. The company offers hobs, cooker hoods, ovens, microwave ovens, washers, dryers, dishwashers, washing machines, tumble dryers, and fridges under the EF and ELBA brand names; washing machine under the Beko brand; wine coolers under the CHATEAU brand; kitchen sinks, faucets, mirror cabinets, showers, and bathroom accessories under the Rubine brand; bath tubs and shower trays under the BLB brand; and water heaters under the Ferroli brand. It also develops and constructs residential and commercial properties. Casa Holdings Limited was founded in 1976 and is based in Singapore.",
    "website": "http://www.casaholdings.com.sg",
    "zipcode": "628884"
  },
  "C50.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Computer Hardware",
    "long_name": "Cheung Woh Technologies Ltd",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Cheung Woh",
    "state": null,
    "summary": "Cheung Woh Technologies Ltd manufactures and supplies precision hard disk drive components. It operates through Hard Disk Drive Components and Precision Metal Stamping Components segments. The Hard Disk Drive Components segment offers voice coil motor plates, air combs, and baseplates. The Precision Metal Stamping Components segment provides sheet metal machined parts and computer numerical controlled machined parts. It serves the hard disk drive, communications, electrical and electronics, semiconductor, and automotive industries in Singapore, Malaysia, Thailand, the United States, the Philippines, Europe, the People's Republic of China, the Middle East, and internationally. The company was incorporated in 1972 and is based in Singapore.",
    "website": "http://www.cheungwoh.com.sg",
    "zipcode": "638065"
  },
  "C76.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Computer Hardware",
    "long_name": "Creative Technology Ltd",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Creative",
    "state": null,
    "summary": "Creative Technology Ltd, together with its subsidiaries, designs, manufactures, and distributes digital entertainment products worldwide. The company offers digitized sound and video boards, computers, and related multimedia and personal digital entertainment products. It also provides amplifiers, speakers, sound cards, gaming headsets, headphones, peripherals, accessories, software products, sound blasters, and others. In addition, the company offers multimedia solutions for personal computers and personal digital entertainment products. It markets its products and solutions to consumers and system integrators through a distribution network, including traditional marketing channels, original equipment manufacturers, and the Internet. Creative Technology Ltd was founded in 1981 and is headquartered in Singapore.",
    "website": "http://www.creative.com",
    "zipcode": "609921"
  },
  "CREAF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Computer Hardware",
    "long_name": "Creative Technology Ltd",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CREATIVE TECHNOLOGY LTD",
    "state": null,
    "summary": "Creative Technology Ltd, together with its subsidiaries, designs, manufactures, and distributes digital entertainment products worldwide. The company offers digitized sound and video boards, computers, and related multimedia and personal digital entertainment products. It also provides amplifiers, speakers, sound cards, gaming headsets, headphones, peripherals, accessories, software products, sound blasters, and others. In addition, the company offers multimedia solutions for personal computers and personal digital entertainment products. It markets its products and solutions to consumers and system integrators through a distribution network, including traditional marketing channels, original equipment manufacturers, and the Internet. Creative Technology Ltd was founded in 1981 and is headquartered in Singapore.",
    "website": "http://www.creative.com",
    "zipcode": "609921"
  },
  "CSYJF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "CSE Global Limited",
    "market": "us_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CSE GLOBAL LTD",
    "state": null,
    "summary": "CSE Global Limited, an investment holding company, provides integrated industrial automation, information technology, and intelligent transport solutions in the Asia Pacific, the Americas, Europe, the Middle East, and Africa. The company offers automation solutions, including process control, safety shutdown, fire and gas detection, supervisory control and data acquisition (SCADA), wellhead and subsea control, process skid, electrical drive and high/medium voltage, electrical protection and control, real-time information, and intelligent transport systems, as well as I&E construction and safe secure solutions. It also provides environmental solutions comprising multiple hearth furnaces, fluid bed incinerators, carbon and energy recovery systems, and rotary kiln incinerators. In addition, the company offers telecommunication solutions, including construction communications, fiber optic, microwave radio, conventional and trunked radio, and public address and general alarm systems; VSAT satellite communications, telephone, local and wide area, Internet protocol based, and SCADA and telemetry networks; and CCTV, access control, and FIDS systems. Further, it provides e-business integration, research and development, and computer system integration services; computer network systems; computer systems; infrastructure engineering services; plant and environmental engineering services; contracting resources and permanent placement; and two-way radio services. Additionally, the company distributes electrical engineering equipment; designs and installs high temperature thermal process and incineration systems; designs and develops water treatment and disposal technology; provides commercial building controls and automation services; and leases office and warehouse space. It serves oil and gas, infrastructure, and mining industries. CSE Global Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.cse-global.com",
    "zipcode": "469332"
  },
  "CTL.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Computer Hardware",
    "long_name": "Creative Technology Ltd",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CREATIVE TECH.  SD-,25",
    "state": null,
    "summary": "Creative Technology Ltd, together with its subsidiaries, designs, manufactures, and distributes digital entertainment products worldwide. The company offers digitized sound and video boards, computers, and related multimedia and personal digital entertainment products. It also provides amplifiers, speakers, sound cards, gaming headsets, headphones, peripherals, accessories, software products, sound blasters, and others. In addition, the company offers multimedia solutions for personal computers and personal digital entertainment products. It markets its products and solutions to consumers and system integrators through a distribution network, including traditional marketing channels, original equipment manufacturers, and the Internet. Creative Technology Ltd was founded in 1981 and is headquartered in Singapore.",
    "website": "http://www.creative.com",
    "zipcode": "609921"
  },
  "DDU.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Addvalue Technologies Ltd",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ADDVALUE TECHNOL. SD-,025",
    "state": null,
    "summary": "Addvalue Technologies Ltd, an investment holding company, provides satellite-based communication and digital broadband products and solutions for connectivity between human, machines, and human and machines. It operates through three segments: Europe Middle East and Africa, North America, and Asia Pacific. The company develops and manufactures a range of terminals operating on satellite networks for land, maritime, and aeronautical applications; and develops agile communications systems and employs software defined radio and deep machine learning tools for governments and commercial enterprises. It also provides turnkey contracting services for system integration; and managed services that combine edge processing in terminals and cloud-based services platforms. The company markets its products and solutions under the Wideye brand. Addvalue Technologies Ltd has partnership with AIOT Chile SpA to provide a smart satcom-based digital IOT/M2M solution. The company was founded in 1994 and is headquartered in Singapore.",
    "website": "http://www.addvaluetech.com",
    "zipcode": "469332"
  },
  "DSE.AX": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Software - Application",
    "long_name": "Dropsuite Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "DROPSUITE FPO",
    "state": null,
    "summary": "Dropsuite Limited operates a cloud-based software platform worldwide. The company offers Dropsuite Website Backup, a cloud-based website and database backup, and monitoring service that allows website owners to automatically backup their website files and databases, monitor website availability and performance, and restore lost or corrupted data; Dropsuite Email Backup and Archiving, a cloud-based email backup and archiving solution that helps organizations to securely backup, manage, recover, comply, and protect their email data; and Dropsuite for Microsoft Office 365, a backup and archiving solution for Microsoft's Office 365 suite of products. It also provides Dropsuite for Google Workplace, a backup and archiving solution for Google Workplace; and Reseller Provisioning Platform, which allows reseller partners to customize, provision, and support their users on the Dropsuite platform. The company serves financial services, government, healthcare, law firms, and manufacturing industries. The company was incorporated in 1983 and is headquartered in Singapore.",
    "website": "http://www.dropsuite.com",
    "zipcode": "088837"
  },
  "FLEX": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Electronic Components",
    "long_name": "Flex Ltd.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "Flex Ltd.",
    "state": null,
    "summary": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.",
    "website": "http://www.flex.com",
    "zipcode": "486123"
  },
  "FLEXN.MX": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "MXN",
    "exchange": "MEX",
    "industry": "Printed Circuit Boards",
    "long_name": "Flex Ltd.",
    "market": "mx_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "FLEX LTD",
    "state": null,
    "summary": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.",
    "website": "http://www.flex.com",
    "zipcode": "486123"
  },
  "FXI.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Flex Ltd.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "FLEX LTD.",
    "state": null,
    "summary": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.",
    "website": "http://www.flex.com",
    "zipcode": "486123"
  },
  "GINV.L": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Communication Equipment",
    "long_name": "Global Invacom Group Limited",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "GLOBAL INVACOM GROUP LIMITED OR",
    "state": null,
    "summary": "Global Invacom Group Limited, an investment holding company, engages in the research, development, design, and supply of integrated satellite communications equipment in the United States, Europe, Asia, and internationally. The company operates through Satellite Communications and Contract Manufacturing segments. It offers low noise blocks; very small aperture terminals (VSAT); video distribution systems; in home distribution systems; fiber integrated reception systems; antennas; accessories, such as fiber splitters, termination and installation products, cleaning kits, fiber optic cable solutions, cleaving and splicing solutions, and test and measurement equipment; and rack mount products for use in uplink stations, cable heads, SNGV's, Ob trucks, GPS, VSAT, and teleports. The company also provides electronics manufacturing services, as well as radio frequency over fiber solutions for commercial, government, and military markets; and supplies custom and bespoke products in various technology areas. In addition, it designs and manufactures microwave waveguide components and applications. Further, the company designs products for the reception and transmission of satellite signals; and provides technical support services. It serves broadcasters and data over satellite providers. Global Invacom Group Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.globalinvacom.com",
    "zipcode": "038988"
  },
  "J03.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "Jadason Enterprises Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Jadason",
    "state": null,
    "summary": "Jadason Enterprises Ltd, an investment holding company, distributes machines and materials for the printed circuit board (PCB) and semi-conductor industries in Singapore, the People's Republic of China, Malaysia, Hong Kong, Taiwan, Japan, and Thailand. The company operates through Equipment and Supplies, and Manufacturing and Support Services segments. It also provides resharpening services to the PCB industry; sales support and procurement services; and drilling services to the PCB and semiconductor industries, as well as installs machines. In addition, the company engages in the distribution of equipment, supplies, and materials; and provision of support services to the PCB and semiconductor industries; lamination of PCBs; and assembly of laser photo plotters, exposure machines, and other PCB equipment for the PCB industry. Further, it engages in trading large format photo masks. Jadason Enterprises Ltd was founded in 1980 and is based in Singapore.",
    "website": "http://www.jadason.com/indexE.html",
    "zipcode": "416237"
  },
  "JLB.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductors",
    "long_name": "Grand Venture Technology Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "$ Grand Venture",
    "state": null,
    "summary": "Grand Venture Technology Limited manufactures precision machining and sheet metal components and modules in Singapore, Malaysia, the United States, China, and internationally. The company operates through two segments, Life sciences, electronics and others; and Semiconductor. The Life sciences, electronics and others segment is involved in manufacturing of components of mass spectrometers and liquid chromatography instruments used for various laboratories testing and pharmaceutical applications, as well as the assembly of modules. The Semiconductor segment manufactures electrical components and devices, such as transistors and diodes. The company offers precision machining services, such as metals, engineering plastics, ceramic, quartz, and sub-micron machining, as well as manufactures vacuum parts; sheet metal fabrication, including cutting/laser cutting, CNC bending, CNC turret punching, welding and robotic magnesium inert gas welding, and wet painting/powder coating. It also provides modular, electromechanical, mechatronics, and cleanroom assemblies, as well as testing services. The company serves semiconductor, electronics, analytical life sciences, medical and industrial automation industries. Grand Venture Technology Limited was founded in 2012 and is headquartered in Singapore. Grand Venture Technology Limited is a subsidiary of Metalbank Singapore Pte. Ltd.",
    "website": "http://www.gvt.com.sg",
    "zipcode": "498828"
  },
  "KARO": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "NCM",
    "industry": "Software - Application",
    "long_name": "Karooooo Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Karooooo Ltd.",
    "state": null,
    "summary": "Karooooo Ltd. develops a vehicle fleet management software solution. The company was incorporated in 2018 and is based in Singapore.",
    "website": null,
    "zipcode": "079903"
  },
  "KLIC": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "Kulicke and Soffa Industries, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "Kulicke and Soffa Industries, I",
    "state": null,
    "summary": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools to assemble semiconductor devices. It operates in two segments, Capital Equipment, and Aftermarket Products and Services (APS). The Capital Equipment segment manufactures and sells ball and wedge bonders, and advanced packaging and electronic assembly solutions. The APS segment manufactures and sells dicing blades, capillaries, and bonding wedges. The company also services, maintains, repairs, and upgrades equipment. It serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.",
    "website": "http://www.kns.com",
    "zipcode": "554369"
  },
  "KRO.JO": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "ZAc",
    "exchange": "JNB",
    "industry": "Software - Application",
    "long_name": "Karooooo Ltd.",
    "market": "za_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "Karooooo Ltd",
    "state": null,
    "summary": "Karooooo Ltd. develops a vehicle fleet management software solution. The company was incorporated in 2018 and is based in Singapore.",
    "website": null,
    "zipcode": "079903"
  },
  "KU1.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "Kulicke and Soffa Industries, Inc.",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "KULICKE + SOFFA IND.",
    "state": null,
    "summary": "Kulicke and Soffa Industries, Inc. designs, manufactures, and sells capital equipment and tools to assemble semiconductor devices. It operates in two segments, Capital Equipment, and Aftermarket Products and Services (APS). The Capital Equipment segment manufactures and sells ball and wedge bonders, and advanced packaging and electronic assembly solutions. The APS segment manufactures and sells dicing blades, capillaries, and bonding wedges. The company also services, maintains, repairs, and upgrades equipment. It serves semiconductor device manufacturers, integrated device manufacturers, outsourced semiconductor assembly and test providers, other electronics manufacturers, industrial manufacturers, and automotive electronics suppliers primarily in the United States and the Asia/Pacific region. Kulicke and Soffa Industries, Inc. was founded in 1951 and is headquartered in Singapore.",
    "website": "http://www.kns.com",
    "zipcode": "554369"
  },
  "M11.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "Manufacturing Integration Technology Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "MFG Integration",
    "state": null,
    "summary": "Manufacturing Integration Technology Ltd, an investment holding company, designs, develops, manufactures, and distributes automated equipment for semiconductor and other industries in Singapore, China, Europe, the United States, and other countries in Asia. The company operates through Built-To-Print and Customised Automation segments. It also offers contract equipment manufacturing services; manufactures and repairs lifting and handling equipment; and components for electronic and semiconductor industries. The company was founded in 1989 and is headquartered in Singapore. Manufacturing Integration Technology Ltd is a subsidiary of MIT Technologies Pte Ltd.",
    "website": "http://www.mitech-ltd.com.sg",
    "zipcode": "569872"
  },
  "MAXN": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Solar",
    "long_name": "Maxeon Solar Technologies, Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Maxeon Solar Technologies, Ltd.",
    "state": null,
    "summary": "Maxeon Solar Technologies, Ltd. designs, manufactures, markets, and sells solar panels and related solar system components worldwide. The company provides interdigitated back contact and shingled solar cells and panels under the SunPower brand. It offers its products to dealers, project developers, system integrators, distributors, resellers, and residential and small-scale commercial customers. The company is headquartered in Singapore.",
    "website": "http://www.maxeon.com",
    "zipcode": "018981"
  },
  "MCRNF": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "Micro-Mechanics (Holdings) Ltd.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "MICRO MECHANICS(HOLDINGS)",
    "state": null,
    "summary": "Micro-Mechanics (Holdings) Ltd. designs, manufactures, and markets high precision parts and tools used in applications for the wafer-fabrication and assembly processes of the semiconductor industry. The company operates through five segments: Singapore, Malaysia, The Philippines, USA, and China. It offers die attach - pick-up products, such as rubber tips, high-temp plastic tools, tungsten carbide tools, sensor assemblies, and vacuum wand tools; die attach - dispensing products, including dispense nozzle adaptors, dispense nozzles, pen dispense assemblies, writing pen nozzle tips, and epoxy stamping tools; and die attach - die ejection products comprising ejector needles, needle holders/pepper pots, and needle holder seals. The company also provides thermosonic bonding products that include clamps and electronic flame off products; ultrasonic bonding products comprising clamps, bearing base assemblies, anvils, and wire cutters; and encapsulation products consisting of BGA dispensing nozzles, dispensing manifolds, pump screws, and O-rings. In addition, it manufactures precision parts and assemblies on a contract basis for OEMs. Micro-Mechanics (Holdings) Ltd. was founded in 1983 and is based in Singapore.",
    "website": "http://www.micro-mechanics.com",
    "zipcode": "416209"
  },
  "MQR1.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Multi-Chem Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "MULTI-CHEM LTD",
    "state": null,
    "summary": "Multi-Chem Limited, an investment holding company, distributes information technology products in Singapore, the People's Republic of China, Australia, and internationally. It operates in two segments, PCB Business and IT Business. The company provides distributes hardware and software relating to internet and network products, as well as related installation, technical, and maintenance services. In addition, it offers PCB manufacturing services, such as precision drilling services to PCB fabricators. Further, the company distributes a range of specialty chemicals for surface treatment, electroless copper plating, tin/tin lead stripping, and micro-etching; and supplies PCB-related materials and equipment, including plating systems, pulse rectifiers for copper plating, copper and tin anodes for electroplating, entry and back-up materials for drilling, non-woven brushes, dry film and liquid photoresist products, CCL and prepreg products, tacky rollers, tack cloth/wipes, and cleaning machines to remove foreign particles on PCBs. Additionally, it rents machines, as well as offers software consultancy and implementation services; and IT training courses. Multi-Chem Limited was incorporated in 1985 and is headquartered in Singapore.",
    "website": "http://www.multichem.com.sg",
    "zipcode": "609966"
  },
  "MZH.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "Nanofilm Technologies International Limited",
    "market": "sg_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "Nanofilm",
    "state": null,
    "summary": "Nanofilm Technologies International Limited provides nanotechnology solutions in Asia. The company operates through Advanced Materials Business Unit (BU), Nanofabrication BU, and Industrial Equipment BU segments. The Advanced Materials BU segment offers advanced materials through surface solution services based on its vacuum coating technologies and processes. The Nanofabrication BU segment manufactures and supplies nanoproducts, which are used by its customers as components for the smooth functioning and performance of various parts of their end-products. The Industrial Equipment BU segment manufactures and sells turnkey equipment systems comprising coating equipment, cleaning lines, and automation systems that are installed at its customers' production lines. This segment also provides customized operating software for its systems and training, as well as spare-parts, customer service, and other forms of after-sales support. The company also offers advanced materials and nanoproducts; markets and sells industrial machinery and equipment; engages in research and experimental development on engineering, and solar cell business; and provides coating services to end users in the precision engineering and printed circuit boards industries, consultation and technical development services, and coating services for automotive parts and precision components. In addition, it engages in the manufacture and forming of modules; manufacture, processing, and assembly of plastic products; production and sale of auto parts; and trading and sale of electronics and equipment. The company was founded in 1999 and is headquartered in Singapore.",
    "website": "http://www.nti-nanofilm.com",
    "zipcode": "139959"
  },
  "N01.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Nera Telecommunications Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NeraTel",
    "state": null,
    "summary": "Nera Telecommunications Ltd designs, engineers, sells, distributes, installs, services, and maintains telecommunication systems and products in transmission networks and satellite communications, and information technology networks in Singapore, Malaysia, Philippines, Indonesia, Thailand, Pakistan, Morocco, Europe, Middle East, Africa, and internationally. It operates through two segments, Wireless Infrastructure Networks (WIN) and Network Infrastructure (NI). The WIN segment provides wireless infrastructure network solutions, including in-building, outdoor coverage enhancement, RF access network optimization, benchmarking, and microwave solutions, as well as 3G/4G/LTE base stations and 5G-ready solutions. It serves clients in a range of sectors, such as service providers, ISPs, broadcasters, enterprises, government organizations, offshore, and utilities. The NI segment offers cloud solutions; cybersecurity products, including firewalls, intrusion prevention systems, and encryption products, as well as security information and event management, and privilege access management products; and security assessment services. It also provides intent-based networking products; carrier-grade optical network solutions, including long haul systems, metro DWDM applications, optical multi-service platforms, and mobile front-haul solutions to serve mobile backhaul, business services, DC interconnection, and edge aggregation; and content creation, acquisition, and IP video transport solutions, as well as encoders/multiplexers, and transmission and network management systems to broadcasters and service providers. In addition, this segment offers automated solutions to navigate and manage services across multi-cloud infrastructure; and consulting services to identify automation governance model, change management plan, and deployment strategy. The company was incorporated in 1978 and is headquartered in Singapore. Nera Telecommunications Ltd is a subsidiary of Asia Systems Ltd.",
    "website": "http://www.nera.net",
    "zipcode": "539225"
  },
  "N8U.SG": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "STU",
    "industry": "Semiconductor Equipment & Materials",
    "long_name": "UMS Holdings Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "UMS Holdings Ltd. Registered Sh",
    "state": null,
    "summary": "UMS Holdings Limited, an investment holding company, provides high precision front-end semiconductor components, and electromechanical assembly and final testing services. It operates in two segments, Semiconductor and Others. The Semiconductor segment offers precision machining components and equipment modules for semiconductor equipment manufacturers. The Others segment provides water disinfection systems shipment services; and supplies base components to oil and gas original equipment manufacturers, as well as trades in nonferrous metal alloys. The company also offers precision machining services, including milling, lathe, horizontal, cleaning, anodizing, and CMM; metal finishing services, such as electroless and selective nickel, anodizing, plating, e-polish, chemical cleaning, and parts refurbishment; and system integration, refurbishment, prototyping, and vendor managed inventory services, as well as electroplating services. In addition, it is involved in the assembly and integration of equipment and automated assembly lines; manufacture and assembly of stainless steel gaslines and weldment products; manufacture and repair of waste water treatment equipment; and holding of investment properties. The company serves semiconductor, electronic, machine tools, aerospace, and oil and gas industries. It operates in Singapore, Malaysia, Taiwan, the United States, South Korea, the People's Republic of China, and internationally. UMS Holdings Limited was incorporated in 2001 and is headquartered in Singapore.",
    "website": "http://www.umsgroup.com.sg",
    "zipcode": "499616"
  },
  "NAHD": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "New Asia Holdings, Inc.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NEW ASIA HOLDINGS INC",
    "state": null,
    "summary": "New Asia Holdings, Inc. develops and provides neural trading models for the financial community. The company also offers algorithm trading software solutions to clients on the basis of Software as a Service licensing and delivery models with licensed users availing themselves of service-based contractual arrangements. It serves broker-dealers, banks, funds, and other clients. The company was formerly known as DM Products, Inc. and changed its name to New Asia Holdings, Inc. in January 2015. New Asia Holdings, Inc. was incorporated in 2001 and is headquartered in Singapore.",
    "website": "http://www.newasiainc.com",
    "zipcode": "409051"
  },
  "NHD.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Jubilee Industries Holdings Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Jubilee",
    "state": null,
    "summary": "Jubilee Industries Holdings Ltd., an investment holding company, manufactures and deals in precision plastic and metal molds. The company operates through two segments, Mechanical Business Unit and Electronics Business Unit. The Mechanical Business Unit segment offers plastic injection molds for consumer electronics, household appliances, medical supplies, automotive, and computer peripherals; and precision plastic injection mold design and fabrication services. This segment provides single-shot, double-shot, vertical, insert, and gas-assisted molding services; and value-added services for plastic decorative purposes, such as laser etching, ultrasonic welding, heat staking, printing, polishing, and sub-assembly services. It also builds engineering tools for customers in the medical and automotive industry. The Electronics Business Unit segment distributes memory devices, radio frequency modules, power management integrated circuits, microcontrollers, transistors, MOSFETs, capacitors, inductors, resistors, crystal oscillators, and connectors, as well as provides industrial power solutions, and design-in and integration services. This segment serves original design manufacturers, original equipment manufacturers, and electronics manufacturers. It has operations in Singapore, the United States, Malaysia, the People's Republic of China, India, Thailand, Vietnam, Indonesia, and other countries. The company was formerly known as JLJ Holdings Limited and changed its name to Jubilee Industries Holdings Ltd. in April 2012. The company was founded in 1993 and is headquartered in Singapore. Jubilee Industries Holdings Ltd. is a subsidiary of Accrelist Ltd.",
    "website": "http://www.jihldgs.com",
    "zipcode": "408564"
  },
  "NVGI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Information Technology Services",
    "long_name": "Noble Vici Group, Inc.",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "NOBLE VICI GROUP INC",
    "state": null,
    "summary": "Noble Vici Group, Inc. engages in the IoT, big data, blockchain, and e-commerce businesses in China, Singapore, Malaysia, the Philippines, Thailand, Indonesia, and rest of the Asia Pacific. The company develops and manages software for interactive digital media and software consultancy; and provides business and management consultancy services, as well as offers customer service for ecommerce and merchants servicing. It is also involved in the hardware retailing and marketing business; merchants onboarding activities; and online retail business, as well as operates as an affiliate system provider. The company is headquartered in Singapore.",
    "website": "http://www.noblevici.com",
    "zipcode": "048616"
  },
  "QS9.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Global Invacom Group Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "G Invacom",
    "state": null,
    "summary": "Global Invacom Group Limited, an investment holding company, engages in the research, development, design, and supply of integrated satellite communications equipment in the United States, Europe, Asia, and internationally. The company operates through Satellite Communications and Contract Manufacturing segments. It offers low noise blocks; very small aperture terminals (VSAT); video distribution systems; in home distribution systems; fiber integrated reception systems; antennas; accessories, such as fiber splitters, termination and installation products, cleaning kits, fiber optic cable solutions, cleaving and splicing solutions, and test and measurement equipment; and rack mount products for use in uplink stations, cable heads, SNGV's, Ob trucks, GPS, VSAT, and teleports. The company also provides electronics manufacturing services, as well as radio frequency over fiber solutions for commercial, government, and military markets; and supplies custom and bespoke products in various technology areas. In addition, it designs and manufactures microwave waveguide components and applications. Further, the company designs products for the reception and transmission of satellite signals; and provides technical support services. It serves broadcasters and data over satellite providers. Global Invacom Group Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.globalinvacom.com",
    "zipcode": "038988"
  },
  "QZG.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "Accrelist Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Accrelist Ltd",
    "state": null,
    "summary": "Accrelist Ltd. operates as a distributor and manufacturers' representative of test equipment for the disk drive industry. It operates through four segments: Financial Technology, Electronic Components Distribution Business Unit (EBU), Mechanical Business Unit (MBU), and Aesthetic Medical Services (AMS). The Financial Technology segment provides financial services, such as crowdfunding to enable users to raise funds for their projects and electronic wallet services granting users an alternate mode of payment. The EBU segment distributes and acts as a representative for a range of active and passive electronic components. The MBU segment offers mold design and fabrication services for consumer electronics, household appliances, and automotive and computer peripherals, as well as precision plastic injection molding services for their customers' finished products. The AMS segment operates four aesthetic medical clinics under the Accrelist Medical Aesthetics brand. The company also provides petroleum, mining, and prospecting services, as well as system integration services; trades in iron ore and coal; and retails pharmaceutical and medical goods. It has operations in Singapore, Malaysia, Indonesia, Thailand, Vietnam, the United States, the People's Republic of China, India, and internationally. The company was formerly known as WE Holdings Ltd. and changed its name to Accrelist Ltd. in November 2016. The company was founded in 1986 and is headquartered in Singapore.",
    "website": "http://www.accrelist.com.sg",
    "zipcode": "408564"
  },
  "RCU.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Information Technology Services",
    "long_name": "Revez Corporation Ltd.",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "$ Revez",
    "state": null,
    "summary": "Revez Corporation Ltd., together with its subsidiaries, engages in the developing and implementation of information technology solutions. It operates through IT Solutions; Meetings, Incentive, Conferences, Exhibitions (MICE); and Digital Media Networks segments. The IT Solutions segment provides simple applications and websites; comprehensive tailor-made integrated solutions, which includes design and development of integrated suite of solutions, immersive multimedia, artificial intelligence, internet of things, information and communications technology, software-as-a-service, and creative and content services; engineering consultancy; and robotic solutions and services to customers. The MICE segment offers design and installation support to its solutions, which are installed in showrooms, exhibition halls, product launches, and customer service centers. The Digital Media Networks segment is involved in creating, owning, and implementing award-winning digital media solutions and media networks; and digital out-of-home, advertising networks, and digital sport networks. The company is headquartered in Singapore. Revez Corporation Ltd. is a subsidiary of L3N Capital Pte. Ltd.",
    "website": "http://www.revezcorp.com",
    "zipcode": "138565"
  },
  "S69.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Serial System Ltd",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Serial System",
    "state": null,
    "summary": "Serial System Ltd, an investment holding company, distributes electronic and electrical components, and consumer products. It operates in three segments: Electronic Components Distribution, Consumer Products Distribution, and Other Businesses. The company offers consumer products, including household appliances and lifestyle goods, such as printer accessories, camera accessories, processors, motherboards, and hard-disk drives. It is also involved in the trading and rental of investment properties; assembly and distribution of medical devices and ethylene oxide sterilization; trading and distribution of IT and photographic products; and distribution and marketing of information technology, computer peripherals, parts, software, and related products. In addition, the company offers hospitality and healthcare, laundry, and project financing services. Further, it manufactures, processes, trades, and exports durian puree and durian related products; provides management, marketing, and administrative services; markets, promotes, sells, exports, and distributes semiconductor components; and offers managed print services, as well as distributes copiers and printers. Additionally, the company is involved in communications and power line construction activities. It serves various industries, such as consumer electronics, telecommunication, household appliances, industrial, electronics manufacturing services, security and surveillance, automotive, and medical. The company operates in Singapore, Malaysia, Thailand, the Philippines, Indonesia, Vietnam, India, Hong Kong, China, South Korea, and Taiwan. The company was founded in 1988 and is headquartered in Singapore.",
    "website": "http://www.serialsystem.com",
    "zipcode": "408554"
  },
  "S71.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Semiconductors",
    "long_name": "Sunright Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Sunright",
    "state": null,
    "summary": "Sunright Limited, an investment holding company, provides burn-in, testing, and electronic manufacturing services to semiconductor and electronics manufacturers in Singapore, Malaysia, China, Taiwan, Hong Kong, India, the Philippines, Thailand, Vietnam, the United States, and internationally. The company offers burn-in services for a range of integrated circuits, such as memories, micro-controllers, microprocessors, digital signal processors, etc., as well as turnkey services, including wafer sort, test, burn-in, mark, scan, and drop ship. It also provides testing services; manufactures parallel test/burn-in boards, test interface board assemblies, and probe cards; and designs, develops, and delivers hardware and software products for burn-in parallel tests comprising parallel test burn-in systems, and handling and storage products. In addition, the company offers design, engineering, and manufacturing services for electronic products to aerospace, automotive, computing, consumers' electronics, industrial, medical, and mobile OEM customers. Further, it assembles electronic and electrical components; provides research and development services for burn-in and test related activities; and trades in and distributes high-technology electronic products. The company was founded in 1978 and is headquartered in Singapore.",
    "website": "http://www.sunright.com",
    "zipcode": "169204"
  },
  "SMFX": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Software - Application",
    "long_name": "S A M Trade Asia Pte Ltd.",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "S A M TRADE ASIA PTE LTD",
    "state": null,
    "summary": "S A M Trade Asia Pte Ltd, a holding company, engages in the management of intellectual property and proprietary technology analytics associated with the development of Samtrade FX trading platform. The company is based in Singapore.",
    "website": "http://www.samtradefx.com",
    "zipcode": "068907"
  },
  "TRIT": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "NMS",
    "industry": "Information Technology Services",
    "long_name": "Triterras, Inc.",
    "market": "us_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Triterras, Inc.",
    "state": null,
    "summary": "Triterras, Inc. operates as a fintech company. It operates Kratos, a commodity trading and trade finance platforms that connects and enables commodity traders to trade and source capital from lenders directly online. The company is headquartered in Singapore.",
    "website": "http://triterras.com",
    "zipcode": "048619"
  },
  "TVV.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Software - Application",
    "long_name": "MC Payment Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "$ MC Payment",
    "state": null,
    "summary": "MC Payment Limited provides merchant payment and digital commerce enabling services in Singapore, Malaysia, Indonesia, and Thailand. The company offers online-to-offline solutions through its integrated platform with a focus on servicing merchants in the retail, transportation, and food and beverage industries. Its products include online payment solutions; ffastpay POS that accepts various payment methods with one terminal; ffastpay Limo through which private hire drivers can receive customers preferred payment method with their mobile phones; and HeroHippo that integrates self-ordering and digital-payment solution. The company also offers MCP E-Invoice, which creates and sends invoices through email; MCP Quickpay for creating payment links or QR codes for transactions; and MCP Batch Processing that processes multiple transactions at one go. MC Payment Limited is headquartered in Singapore, Singapore.",
    "website": "http://www.mcpayment.com",
    "zipcode": "118502"
  },
  "TZ2.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Trek 2000 International Ltd",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TREK 2000 INTL LTD SD-,05",
    "state": null,
    "summary": "Trek 2000 International Ltd, an investment holding company, engages in the research, design, development, and dealing of computer hardware, software, electronic components, and other related products. The company operates through Interactive Customised Solutions, Interactive Consumer Solutions, and Licensing segments. It offers patented technology solutions, including USB, wireless, anti-piracy, compression, security/encryption, centralized management system, and PC and mobile apps products; and portable storage solutions, such as flash memory. The company also provides wireless solutions, including patient alert systems, Flucard, Flucard ultra, Ai-ball, smart gateway, and smart sensor for diapers; and ThumbDrive solutions, such as trek's smart meters, micro solid state devices, i solid state devices, ThumbDrive cloud, thumbdrive crypto, thumbdrive swipe, ThumbDrive SWAN, and chez solutions to protect crucial information, as well as secure transaction, identity, key, encryption, and storage flash drives. In addition, it is involved in the research and experimental development on medical technologies; research, design, development, and distribution of memory modules, and other related products and solutions; and development and marketing of Web portal services, including social networking sites. Further, the company provides design solutions, such as complete design-in modules or sub-modules in semi-customized or customized forms for software, hardware, and firmware; and security solutions for mobile storage devices, as well as licenses its patented technologies and trademarks. It operates in China/Hong Kong, Taiwan, India, Singapore, Indonesia, Malaysia, Thailand, Europe, the United States, and internationally. Trek 2000 International Ltd was incorporated in 1999 and is headquartered in Singapore.",
    "website": "http://www.trek2000.com.sg",
    "zipcode": "508769"
  },
  "V03.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronic Components",
    "long_name": "Venture Corporation Limited",
    "market": "sg_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "Venture",
    "state": null,
    "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore, the Asia Pacific, and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, installation, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; development and marketing of color imaging products for label printing; and research and development of biotechnology, life and medical science products. The company is also involved in the provision of engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services; and manufacturing, product design and development, engineering and supply-chain management services. In addition, it engages in the manufacturing, fabricating, and dealing of precision plastic tools, components and sub-assemblies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Further, the company wholesales computer hardware and peripheral equipment; manufactures and repairs engineering and scientific instruments; and manufactures and sells data and telecommunications products in industrial electronics industries. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.",
    "website": "http://www.venture.com.sg",
    "zipcode": "569873"
  },
  "VEM.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronic Components",
    "long_name": "Venture Corporation Limited",
    "market": "dr_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VENTURE  SD-,25",
    "state": null,
    "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore, the Asia Pacific, and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, installation, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; development and marketing of color imaging products for label printing; and research and development of biotechnology, life and medical science products. The company is also involved in the provision of engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services; and manufacturing, product design and development, engineering and supply-chain management services. In addition, it engages in the manufacturing, fabricating, and dealing of precision plastic tools, components and sub-assemblies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Further, the company wholesales computer hardware and peripheral equipment; manufactures and repairs engineering and scientific instruments; and manufactures and sells data and telecommunications products in industrial electronics industries. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.",
    "website": "http://www.venture.com.sg",
    "zipcode": "569873"
  },
  "VEMLY": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Electronic Components",
    "long_name": "Venture Corporation Limited",
    "market": "us_market",
    "market_cap": "Mid Cap",
    "sector": "Technology",
    "short_name": "VENTURE CORPORATION LTD",
    "state": null,
    "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore, the Asia Pacific, and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, installation, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; development and marketing of color imaging products for label printing; and research and development of biotechnology, life and medical science products. The company is also involved in the provision of engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services; and manufacturing, product design and development, engineering and supply-chain management services. In addition, it engages in the manufacturing, fabricating, and dealing of precision plastic tools, components and sub-assemblies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Further, the company wholesales computer hardware and peripheral equipment; manufactures and repairs engineering and scientific instruments; and manufactures and sells data and telecommunications products in industrial electronics industries. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.",
    "website": "http://www.venture.com.sg",
    "zipcode": "569873"
  },
  "XCC.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Information Technology Services",
    "long_name": "CSE Global Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "CSE GLOBAL LTD.  SD-,05",
    "state": null,
    "summary": "CSE Global Limited, an investment holding company, provides integrated industrial automation, information technology, and intelligent transport solutions in the Asia Pacific, the Americas, Europe, the Middle East, and Africa. The company offers automation solutions, including process control, safety shutdown, fire and gas detection, supervisory control and data acquisition (SCADA), wellhead and subsea control, process skid, electrical drive and high/medium voltage, electrical protection and control, real-time information, and intelligent transport systems, as well as I&E construction and safe secure solutions. It also provides environmental solutions comprising multiple hearth furnaces, fluid bed incinerators, carbon and energy recovery systems, and rotary kiln incinerators. In addition, the company offers telecommunication solutions, including construction communications, fiber optic, microwave radio, conventional and trunked radio, and public address and general alarm systems; VSAT satellite communications, telephone, local and wide area, Internet protocol based, and SCADA and telemetry networks; and CCTV, access control, and FIDS systems. Further, it provides e-business integration, research and development, and computer system integration services; computer network systems; computer systems; infrastructure engineering services; plant and environmental engineering services; contracting resources and permanent placement; and two-way radio services. Additionally, the company distributes electrical engineering equipment; designs and installs high temperature thermal process and incineration systems; designs and develops water treatment and disposal technology; provides commercial building controls and automation services; and leases office and warehouse space. It serves oil and gas, infrastructure, and mining industries. CSE Global Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.cse-global.com",
    "zipcode": "469332"
  },
  "Y3D.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Electronics & Computer Distribution",
    "long_name": "mDR Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "MDR Limited",
    "state": null,
    "summary": "mDR Limited, an investment holding company, engages in the distribution and retail of telecommunication products and services in Singapore and Malaysia. It operates through After-Market Services (AMS); Distribution Management Solutions (DMS); Digital Inkjet Printing for Out-Of-Home Advertising Solutions (DPAS); and Investment segments. The company also offers after-market services, such as equipment repair, technical and customer support services for mobile equipment and consumer electronic products; digital inkjet printing services for point-of-sale and out-of-home advertising solutions; and loans to third party. In addition, it distributes and retails mobile related services, including prepaid cards, as well as skin care products; and invests in marketable securities. The company operates telecommunications retail stores that provide M1 and SingTel products and services, such as mobile, fixed, and wireless broadband under the HandphoneShop and 3 Mobile names in Singapore; and HandPhoneShop.com, an e-commerce portal that provide mobile devices, gadgets, and accessories. It operates 9 Singtel stores, 8 M1 stores, and 3 Samsung concept stores. The company was founded in 2000 and is headquartered in Singapore.",
    "website": "http://www.m-dr.com",
    "zipcode": "408594"
  }
}
