{
  "1085.HK": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "HKD",
    "exchange": "HKG",
    "industry": "Communication Equipment",
    "long_name": "Hengxin Technology Ltd.",
    "market": "hk_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "HXTL",
    "state": null,
    "summary": "Hengxin Technology Ltd., an investment holding company, engages in the research, design, development, and manufacture of telecommunications and technological products, and the production of radio frequency coaxial cables for mobile communications and mobile communications systems exchange equipment in the People's Republic of China, India, and internationally. The company operates through Radio Frequency (RF) Coaxial Cables, Telecommunication Equipment and Accessories, and Antennas segments. It offers RF coaxial cables for mobile communications to transmit high-frequency signals between antenna and base station equipment in outdoor base station wireless signal coverage system and indoor wireless signal coverage system in buildings; and to radiate high frequency signals to surrounding environment through continuous small antenna elements along the cable in railways, highways, tunnels, underground car parks, elevators, and high rise buildings. The company also provides coaxial cables for telecommunications equipment and accessories to transmit signals within microwave communications systems, radio broadcast wireless systems, and air/sea radar systems, as well as accessories, such as connectors and jumper cables for wireless signal coverage systems equipment within base stations. In addition, it offers antennas for use in signal transmission for wireless communications; high temperature resistant cables, which are used as part of the raw material components for antennas; and antenna testing services. Further, the company provides technical services of antennas and related telecommunications products for mobile communications systems, as well as engages in trading and investment activities. It serves telecommunications operators and equipment manufacturers. The company was founded in 1996 and is headquartered in Singapore.",
    "website": "http://www.hengxin.com.sg",
    "zipcode": "529541"
  },
  "5AB.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Trek 2000 International Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Trek 2000 Intl",
    "state": null,
    "summary": "Trek 2000 International Ltd, an investment holding company, engages in the research, design, development, and dealing of computer hardware, software, electronic components, and other related products. The company operates through Interactive Customised Solutions, Interactive Consumer Solutions, and Licensing segments. It offers patented technology solutions, including USB, wireless, anti-piracy, compression, security/encryption, centralized management system, and PC and mobile apps products; and portable storage solutions, such as flash memory. The company also provides wireless solutions, including patient alert systems, Flucard, Flucard ultra, Ai-ball, smart gateway, and smart sensor for diapers; and ThumbDrive solutions, such as trek's smart meters, micro solid state devices, i solid state devices, ThumbDrive cloud, thumbdrive crypto, thumbdrive swipe, ThumbDrive SWAN, and chez solutions to protect crucial information, as well as secure transaction, identity, key, encryption, and storage flash drives. In addition, it is involved in the research and experimental development on medical technologies; research, design, development, and distribution of memory modules, and other related products and solutions; and development and marketing of Web portal services, including social networking sites. Further, the company provides design solutions, such as complete design-in modules or sub-modules in semi-customized or customized forms for software, hardware, and firmware; and security solutions for mobile storage devices, as well as licenses its patented technologies and trademarks. It operates in China/Hong Kong, Taiwan, India, Singapore, Indonesia, Malaysia, Thailand, Europe, the United States, and internationally. Trek 2000 International Ltd was incorporated in 1999 and is headquartered in Singapore.",
    "website": "http://www.trek2000.com.sg",
    "zipcode": "508769"
  },
  "A31.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Addvalue Technologies Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Addvalue Tech",
    "state": null,
    "summary": "Addvalue Technologies Ltd, an investment holding company, provides satellite-based communication and digital broadband products and solutions for connectivity between human, machines, and human and machines. It operates through three segments: Europe Middle East and Africa, North America, and Asia Pacific. The company develops and manufactures a range of terminals operating on satellite networks for land, maritime, and aeronautical applications; and develops agile communications systems and employs software defined radio and deep machine learning tools for governments and commercial enterprises. It also provides turnkey contracting services for system integration; and managed services that combine edge processing in terminals and cloud-based services platforms. The company markets its products and solutions under the Wideye brand. Addvalue Technologies Ltd has partnership with AIOT Chile SpA to provide a smart satcom-based digital IOT/M2M solution. The company was founded in 1994 and is headquartered in Singapore.",
    "website": "http://www.addvaluetech.com",
    "zipcode": "469332"
  },
  "BCY.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Powermatic Data Systems Limited",
    "market": "sg_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Powermatic Data",
    "state": null,
    "summary": "Powermatic Data Systems Limited, an investment holding company, manufactures, sells, markets, and distributes wireless connectivity products and related services in Singapore and other Asian countries, the United States, Europe, and internationally. The company operates through, Wireless Connectivity Products and Property segments. It provides wireless radio modules, embedded boards, indoor and outdoor access points, and wireless antennas used in industrial PC, IOT, healthcare, hospitality, security surveillance and other industries, as well as offers OEM and ODM solutions, and other sales related services. The company is also involved in the lease and maintenance of Harrison Industrial Building, a freehold investment property in Singapore; and trading of computers related peripherals. It serves electronic and wireless device component distributors, system integrators, wireless products design houses, and other corporations. Powermatic Data Systems Limited was founded in 1989 and is headquartered in Singapore.",
    "website": "http://www.powermatic.com.sg",
    "zipcode": "369651"
  },
  "DDU.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Addvalue Technologies Ltd",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "ADDVALUE TECHNOL. SD-,025",
    "state": null,
    "summary": "Addvalue Technologies Ltd, an investment holding company, provides satellite-based communication and digital broadband products and solutions for connectivity between human, machines, and human and machines. It operates through three segments: Europe Middle East and Africa, North America, and Asia Pacific. The company develops and manufactures a range of terminals operating on satellite networks for land, maritime, and aeronautical applications; and develops agile communications systems and employs software defined radio and deep machine learning tools for governments and commercial enterprises. It also provides turnkey contracting services for system integration; and managed services that combine edge processing in terminals and cloud-based services platforms. The company markets its products and solutions under the Wideye brand. Addvalue Technologies Ltd has partnership with AIOT Chile SpA to provide a smart satcom-based digital IOT/M2M solution. The company was founded in 1994 and is headquartered in Singapore.",
    "website": "http://www.addvaluetech.com",
    "zipcode": "469332"
  },
  "GINV.L": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Communication Equipment",
    "long_name": "Global Invacom Group Limited",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Technology",
    "short_name": "GLOBAL INVACOM GROUP LIMITED OR",
    "state": null,
    "summary": "Global Invacom Group Limited, an investment holding company, engages in the research, development, design, and supply of integrated satellite communications equipment in the United States, Europe, Asia, and internationally. The company operates through Satellite Communications and Contract Manufacturing segments. It offers low noise blocks; very small aperture terminals (VSAT); video distribution systems; in home distribution systems; fiber integrated reception systems; antennas; accessories, such as fiber splitters, termination and installation products, cleaning kits, fiber optic cable solutions, cleaving and splicing solutions, and test and measurement equipment; and rack mount products for use in uplink stations, cable heads, SNGV's, Ob trucks, GPS, VSAT, and teleports. The company also provides electronics manufacturing services, as well as radio frequency over fiber solutions for commercial, government, and military markets; and supplies custom and bespoke products in various technology areas. In addition, it designs and manufactures microwave waveguide components and applications. Further, the company designs products for the reception and transmission of satellite signals; and provides technical support services. It serves broadcasters and data over satellite providers. Global Invacom Group Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.globalinvacom.com",
    "zipcode": "038988"
  },
  "N01.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Nera Telecommunications Ltd",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "NeraTel",
    "state": null,
    "summary": "Nera Telecommunications Ltd designs, engineers, sells, distributes, installs, services, and maintains telecommunication systems and products in transmission networks and satellite communications, and information technology networks in Singapore, Malaysia, Philippines, Indonesia, Thailand, Pakistan, Morocco, Europe, Middle East, Africa, and internationally. It operates through two segments, Wireless Infrastructure Networks (WIN) and Network Infrastructure (NI). The WIN segment provides wireless infrastructure network solutions, including in-building, outdoor coverage enhancement, RF access network optimization, benchmarking, and microwave solutions, as well as 3G/4G/LTE base stations and 5G-ready solutions. It serves clients in a range of sectors, such as service providers, ISPs, broadcasters, enterprises, government organizations, offshore, and utilities. The NI segment offers cloud solutions; cybersecurity products, including firewalls, intrusion prevention systems, and encryption products, as well as security information and event management, and privilege access management products; and security assessment services. It also provides intent-based networking products; carrier-grade optical network solutions, including long haul systems, metro DWDM applications, optical multi-service platforms, and mobile front-haul solutions to serve mobile backhaul, business services, DC interconnection, and edge aggregation; and content creation, acquisition, and IP video transport solutions, as well as encoders/multiplexers, and transmission and network management systems to broadcasters and service providers. In addition, this segment offers automated solutions to navigate and manage services across multi-cloud infrastructure; and consulting services to identify automation governance model, change management plan, and deployment strategy. The company was incorporated in 1978 and is headquartered in Singapore. Nera Telecommunications Ltd is a subsidiary of Asia Systems Ltd.",
    "website": "http://www.nera.net",
    "zipcode": "539225"
  },
  "QS9.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Communication Equipment",
    "long_name": "Global Invacom Group Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "G Invacom",
    "state": null,
    "summary": "Global Invacom Group Limited, an investment holding company, engages in the research, development, design, and supply of integrated satellite communications equipment in the United States, Europe, Asia, and internationally. The company operates through Satellite Communications and Contract Manufacturing segments. It offers low noise blocks; very small aperture terminals (VSAT); video distribution systems; in home distribution systems; fiber integrated reception systems; antennas; accessories, such as fiber splitters, termination and installation products, cleaning kits, fiber optic cable solutions, cleaving and splicing solutions, and test and measurement equipment; and rack mount products for use in uplink stations, cable heads, SNGV's, Ob trucks, GPS, VSAT, and teleports. The company also provides electronics manufacturing services, as well as radio frequency over fiber solutions for commercial, government, and military markets; and supplies custom and bespoke products in various technology areas. In addition, it designs and manufactures microwave waveguide components and applications. Further, the company designs products for the reception and transmission of satellite signals; and provides technical support services. It serves broadcasters and data over satellite providers. Global Invacom Group Limited was founded in 1985 and is headquartered in Singapore.",
    "website": "http://www.globalinvacom.com",
    "zipcode": "038988"
  },
  "TZ2.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Communication Equipment",
    "long_name": "Trek 2000 International Ltd",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TREK 2000 INTL LTD SD-,05",
    "state": null,
    "summary": "Trek 2000 International Ltd, an investment holding company, engages in the research, design, development, and dealing of computer hardware, software, electronic components, and other related products. The company operates through Interactive Customised Solutions, Interactive Consumer Solutions, and Licensing segments. It offers patented technology solutions, including USB, wireless, anti-piracy, compression, security/encryption, centralized management system, and PC and mobile apps products; and portable storage solutions, such as flash memory. The company also provides wireless solutions, including patient alert systems, Flucard, Flucard ultra, Ai-ball, smart gateway, and smart sensor for diapers; and ThumbDrive solutions, such as trek's smart meters, micro solid state devices, i solid state devices, ThumbDrive cloud, thumbdrive crypto, thumbdrive swipe, ThumbDrive SWAN, and chez solutions to protect crucial information, as well as secure transaction, identity, key, encryption, and storage flash drives. In addition, it is involved in the research and experimental development on medical technologies; research, design, development, and distribution of memory modules, and other related products and solutions; and development and marketing of Web portal services, including social networking sites. Further, the company provides design solutions, such as complete design-in modules or sub-modules in semi-customized or customized forms for software, hardware, and firmware; and security solutions for mobile storage devices, as well as licenses its patented technologies and trademarks. It operates in China/Hong Kong, Taiwan, India, Singapore, Indonesia, Malaysia, Thailand, Europe, the United States, and internationally. Trek 2000 International Ltd was incorporated in 1999 and is headquartered in Singapore.",
    "website": "http://www.trek2000.com.sg",
    "zipcode": "508769"
  }
}
