{"C50.SI": {"short_name": "Cheung Woh", "long_name": "Cheung Woh Technologies Ltd", "summary": "Cheung Woh Technologies Ltd manufactures and supplies precision hard disk drive components. It operates through Hard Disk Drive Components and Precision Metal Stamping Components segments. The Hard Disk Drive Components segment offers voice coil motor plates, air combs, and baseplates. The Precision Metal Stamping Components segment provides sheet metal machined parts and computer numerical controlled machined parts. It serves the hard disk drive, communications, electrical and electronics, semiconductor, and automotive industries in Singapore, Malaysia, Thailand, the United States, the Philippines, Europe, the People's Republic of China, the Middle East, and internationally. The company was incorporated in 1972 and is based in Singapore. Cheung Woh Technologies Ltd is a subsidiary of Nexsuss Holdings Pte Ltd.", "currency": "SGD", "sector": "Technology", "industry": "Computer Hardware", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "CREAF": {"short_name": "CREATIVE TECHNOLOGY LTD", "long_name": "Creative Technology Ltd", "summary": "Creative Technology Ltd, together with its subsidiaries, designs, manufactures, and distributes digital entertainment products worldwide. The company offers digitized sound and video boards, computers, and related multimedia and personal digital entertainment products. It also provides amplifiers, speakers, sound cards, gaming headsets, headphones, peripherals, accessories, software products, sound blasters, and others. In addition, the company offers multimedia solutions for personal computers and personal digital entertainment products. It markets its products and solutions to consumers and system integrators through a distribution network, including traditional marketing channels, original equipment manufacturers, and the Internet. Creative Technology Ltd was founded in 1981 and is headquartered in Singapore.", "currency": "USD", "sector": "Technology", "industry": "Computer Hardware", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "CTL.F": {"short_name": "CREATIVE TECH.  SD-,25", "long_name": "Creative Technology Ltd", "summary": "Creative Technology Ltd, together with its subsidiaries, designs, manufactures, and distributes digital entertainment products worldwide. The company offers digitized sound and video boards, computers, and related multimedia and personal digital entertainment products. It also provides amplifiers, speakers, sound cards, gaming headsets, headphones, peripherals, accessories, software products, sound blasters, and others. In addition, the company offers multimedia solutions for personal computers and personal digital entertainment products. It markets its products and solutions to consumers and system integrators through a distribution network, including traditional marketing channels, original equipment manufacturers, and the Internet. Creative Technology Ltd was founded in 1981 and is headquartered in Singapore.", "currency": "EUR", "sector": "Technology", "industry": "Computer Hardware", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}}