{"AVV.SI": {"short_name": "CEI", "long_name": "CEI Limited", "summary": "CEI Limited provides contract manufacturing services for the industrial equipment market in the Asia Pacific, Europe, and the United States. It offers printed circuit board and box-build assembly, equipment design, cable harness assembly, and manufacturing services; and value-added services, such as materials management, circuit layout, development engineering and prototype samples, metal stamping, cable harnessing, and precision machined components. The company also designs and manufactures own branded proprietary equipment for the semiconductor industry. It offers its services for electroluminescence displays used in industrial, transportation, and medical applications; medical and health care equipment; office automation equipment such as high speed printers; office equipment, including digital photocopiers; analytical instruments comprising gas and liquid chromatographs, and measurement instruments; aerospace products and oil and gas equipment; industrial safety controllers and environmental sensors; semiconductor equipment; and SMT equipment. The company was formerly known as CEI Contract Manufacturing Limited and changed its name to CEI Limited in April 2016. CEI Limited was founded in 1980 and is headquartered in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Electronic Components", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "BDA.SI": {"short_name": "PNE Industries", "long_name": "PNE Industries Ltd", "summary": "PNE Industries Ltd, an investment holding company, manufactures, assembles, and trades in electrical and electronic products primarily in Europe, Malaysia, Singapore, and the People's Republic of China. It operates in two segments, Contract Manufacturing and Trading. The Contract Manufacturing segment manufactures electronic controllers, and other electrical and electronic products. The Trading segment manufactures and trades in emergency lighting equipment and related products under PNE brand name. It also provides electrical apparatus, light fittings, and related products. PNE Industries Ltd was founded in 1983 and is headquartered in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Electronic Components", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "FLEX": {"short_name": "Flex Ltd.", "long_name": "Flex Ltd.", "summary": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "NMS", "market": "us_market", "country": "Singapore", "city": "Singapore"}, "J03.SI": {"short_name": "Jadason", "long_name": "Jadason Enterprises Ltd", "summary": "Jadason Enterprises Ltd, an investment holding company, distributes machines and materials for the printed circuit board (PCB) and semi-conductor industries in Singapore, the People's Republic of China, Malaysia, Hong Kong, Taiwan, Japan, and Thailand. The company operates through Equipment and Supplies, and Manufacturing and Support Services segments. It also provides resharpening services to the PCB industry; sales support and procurement services; and drilling services to the PCB and semiconductor industries, as well as installs machines. In addition, the company is involved in the distribution of equipment, supplies, and materials; and provision of support services to the PCB and semiconductor industries; lamination of PCBs; and assembly of laser photo plotters, exposure machines, and other PCB equipment for the PCB industry. Further, it engages in trading large format photo masks. Jadason Enterprises Ltd was founded in 1980 and is based in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Electronic Components", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "MZH.SI": {"short_name": "Nanofilm", "long_name": "Nanofilm Technologies International Limited", "summary": "Nanofilm Technologies International Limited provides nanotechnology solutions in Asia. The company operates through Advanced Materials Business Unit (BU), Nanofabrication BU, and Industrial Equipment BU segments. The Advanced Materials BU segment offers advanced materials through surface solution services based on its vacuum coating technologies and processes. The Nanofabrication BU segment manufactures and supplies nanoproducts, which are used by its customers as components for the smooth functioning and performance of various parts of their end-products. The Industrial Equipment BU segment manufactures and sells turnkey equipment systems comprising coating equipment, cleaning lines, and automation systems that are installed at its customers' production lines. This segment also provides customized operating software for its systems and training, as well as spare-parts, customer service, and other forms of after-sales support. The company also offers advanced materials and nanoproducts; markets and sells industrial machinery and equipment; engages in research and experimental development on engineering, and solar cell business; and provides coating services to end users in the precision engineering and printed circuit boards industries, consultation and technical development services, and coating services for automotive parts and precision components. In addition, it engages in the manufacture and forming of modules; manufacture, processing, and assembly of plastic products; production and sale of auto parts; and trading and sale of electronics and equipment. The company was founded in 1999 and is headquartered in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Electronic Components", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "QZG.SI": {"short_name": "$ Accrelist Ltd", "long_name": "Accrelist Ltd.", "summary": "Accrelist Ltd. operates as a distributor and manufacturers' representative of test equipment for the disk drive industry. It operates through four segments: Financial Technology, Electronic Components Distribution Business Unit (EBU), Mechanical Business Unit (MBU), and Aesthetic Medical Services (AMS). The Financial Technology segment provides financial services, such as crowdfunding to enable users to raise funds for their projects and electronic wallet services granting users an alternate mode of payment. The EBU segment distributes and acts as a representative for a range of active and passive electronic components. The MBU segment offers mold design and fabrication services for consumer electronics, household appliances, and automotive and computer peripherals, as well as precision plastic injection molding services for their customers' finished products. The AMS segment operates four aesthetic medical clinics under the Accrelist Medical Aesthetics brand. The company also provides petroleum, mining, and prospecting services, as well as system integration services; trades in iron ore and coal; and retails pharmaceutical and medical goods. It has operations in Singapore, Malaysia, Indonesia, Thailand, Vietnam, the United States, the People's Republic of China, India, and internationally. The company was formerly known as WE Holdings Ltd. and changed its name to Accrelist Ltd. in November 2016. The company was founded in 1986 and is headquartered in Singapore.", "currency": "SGD", "sector": "Technology", "industry": "Electronic Components", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "VEMLY": {"short_name": "VENTURE CORPORATION LTD", "long_name": "Venture Corporation Limited", "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; manufacturing and trading of mechanical products; development and marketing of color imaging products for label printing; and design, integration, and trading of electronic security systems and products. The company is also involved in the provision of electronics services; engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services. In addition, it engages in the manufacture, design, fabrication, stamping and injection, metal punching, and spraying of industrial metal parts, tools, and dies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.", "currency": "USD", "sector": "Technology", "industry": "Electronic Components", "exchange": "PNK", "market": "us_market", "country": "Singapore", "city": "Singapore"}}