{
    "42E.SI": {
        "short_name": "$ Choo Chiang",
        "long_name": "Choo Chiang Holdings Ltd.",
        "summary": "Choo Chiang Holdings Ltd., an investment holding company, engages in the retail and distribution of electrical products and accessories in Singapore. It operates through two segments, Distribution Business and Property Investment Business. The company offers electrical cables and cable accessories; light switches, circuit breakers, and accessories; lightning accessories; trunking and pipe products; air-conditioner accessories; light fixtures and accessories; ventilating, wall-mounted, and ceiling fans; and power drills and handheld tools. It also provides electrical products and accessories under the CCM and CRM brands. In addition, the company is involved in the assembly of lighting fittings and fixtures; and property investment and real estate management activities. It offers its products for residential and industrial use through 10 retail branches. The company was incorporated in 2014 and is headquartered in Singapore. Choo Chiang Holdings Ltd. is a subsidiary of TL Investment Holdings Pte. Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "573.SI": {
        "short_name": "Challenger",
        "long_name": "Challenger Technologies Limited",
        "summary": "Challenger Technologies Limited operates a chain of information technology (IT) retail stores under the Challenger brand name in Singapore. The company operates through IT Products and Services, Electronic Signage, and Telephonic Call Centre and Data Management Services segments. The IT Products and Services segment retails a selection of IT products, including personal computers, notebooks, printers, scanners, digital imaging solutions, personal digital assistants, mobile and wireless connectivity solutions, audio-visual and projection equipment, and related peripherals. The Electronic Signage segment supplies and installs electronic signages; and provides electronic signage services. The Telephonic Call Centre and Data Management Services segment is involved in the provision of telephonic call center, data management, and direct marketing services. The company also offers procurement services for IT products. In addition, it engages in the online sale of computer hardware, software, and accessories, as well as mobile phones and accessories. As of February 13, 2020, the company operated retail network of 41 stores. Challenger Technologies Limited was founded in 1982 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "AWZ.SI": {
        "short_name": "Multi-Chem",
        "long_name": "Multi-Chem Limited",
        "summary": "Multi-Chem Limited, an investment holding company, distributes information technology products, and manufactures and distributes printed circuit boards (PCB) in Singapore, the People's Republic of China, Australia, and internationally. It operates in two segments, PCB Business and IT Business. The company provides installation, technical, and maintenance services for internet and network products. In addition, it offers PCB manufacturing services, such as mechanical and laser drilling primarily in precision drilling to PCB fabricators. Further, the company distributes a range of specialty chemicals for surface treatment, electroless copper plating, tin/tin lead stripping, and micro-etching; and supplies PCB-related materials and equipment, including plating systems, pulse rectifiers for copper plating, copper and tin anodes for electroplating, entry and back-up materials for drilling, non-woven brushes, dry film and liquid photoresist products, CCL and prepreg products, tacky rollers, tack cloth/wipes, and cleaning machines to remove foreign particles on PCBs. Additionally, it designs and manufactures panel and micro drills; and rents machines, as well as offers software consultancy and implementation services. Multi-Chem Limited was founded in 1985 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "B26.SI": {
        "short_name": "Ban Leong",
        "long_name": "Ban Leong Technologies Limited",
        "summary": "Ban Leong Technologies Limited, together with its subsidiaries, engages in the wholesale and distribution of computer peripherals, accessories, and other multimedia products in Singapore and internationally. It operates through three segments: Multimedia, Data storage, and IT accessories. The Multimedia segment offers audio and visual products, such as ear phones, speakers, cameras, and commercial and consumer displays. The Data Storage segment provides storage of data, such as cloud drives, HDD enclosures, and Blu-ray and portable DVD-RW. The IT Accessories segment offers PC-related accessories, including computer systems, components, peripherals, and printers, as well as mobile products, such as wearables, accessories, and powerpacks. It also provides smart home and robotics solutions. The company distributes its products through e-commerce; retailers and chain stores; and directly to commercial resellers and system integrators. Ban Leong Technologies Limited was incorporated in 1993 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "BDF.SI": {
        "short_name": "Excelpoint",
        "long_name": "Excelpoint Technology Ltd.",
        "summary": "Excelpoint Technology Ltd., an investment holding company, provides electronic components, and engineering design, and supply chain management services. The company is involved in the trading of electronic components; and provision of marketing and technical support services. It offers wireless connectivity and DSP audio enhancement implementation solutions that are used in portable wireless speakers, wireless music headphones, mini combos, sound bar and wireless subwoofers, and audio transmitter dongles; wearable devices and accessories for iPhone and iPad; solutions of Bluetooth enabled massage chairs and lost-and-found tags; and entry-level and mid-tier platforms for wearables and smart accessories applications. The company also provides automotive solutions, including the development of reference car infotainment systems and core boards, which support GPS for navigation, video playback, Bluetooth headset and handfree, Bluetooth music streaming, rearview camera, etc.; connectivity solutions, such as BLE, Bluetooth, BLE/Bluetooth combo, embedded Wi-Fi, and sub-Ghz modules for smart homes; headset solutions; Qualcomm, a smart audio platform; and electric power quality analyzer systems. In addition, it offers Internet of Things solutions for smart buildings, smart agriculture and smart infrastructure. It serves original equipment manufacturers, original design manufacturers, and electronics manufacturing service providers in Hong Kong, the People's Republic of China, Southeast Asia, India, and internationally. The company was founded in 1987 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "C04.SI": {
        "short_name": "Casa",
        "long_name": "Casa Holdings Limited",
        "summary": "Casa Holdings Limited, an investment holding company, distributes home and cooking appliances, kitchen and bathroom fixtures, and accessories in Southeast Asia, South Asia, North Africa, the Middle East, and internationally. It operates through two segments, Trading and Property Development. The company offers hobs, cooker hoods, ovens, microwave ovens, washers, dryers, dishwashers, washing machines, tumble dryers, and fridges under the EF and ELBA brand names; washing machine under the Beko brand; wine coolers under the CHATEAU brand; kitchen sinks, faucets, mirror cabinets, showers, and bathroom accessories under the Rubine brand; bath tubs and shower trays under the BLB brand; and water heaters under the Ferroli brand. It also develops and constructs residential and commercial properties. Casa Holdings Limited was founded in 1976 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "MQR1.F": {
        "short_name": "MULTI-CHEM LTD",
        "long_name": "Multi-Chem Limited",
        "summary": "Multi-Chem Limited, an investment holding company, distributes information technology products, and manufactures and distributes printed circuit boards (PCB) in Singapore, the People's Republic of China, Australia, and internationally. It operates in two segments, PCB Business and IT Business. The company provides installation, technical, and maintenance services for internet and network products. In addition, it offers PCB manufacturing services, such as mechanical and laser drilling primarily in precision drilling to PCB fabricators. Further, the company distributes a range of specialty chemicals for surface treatment, electroless copper plating, tin/tin lead stripping, and micro-etching; and supplies PCB-related materials and equipment, including plating systems, pulse rectifiers for copper plating, copper and tin anodes for electroplating, entry and back-up materials for drilling, non-woven brushes, dry film and liquid photoresist products, CCL and prepreg products, tacky rollers, tack cloth/wipes, and cleaning machines to remove foreign particles on PCBs. Additionally, it designs and manufactures panel and micro drills; and rents machines, as well as offers software consultancy and implementation services. Multi-Chem Limited was founded in 1985 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "NHD.SI": {
        "short_name": "$ Jubilee",
        "long_name": "Jubilee Industries Holdings Ltd.",
        "summary": "Jubilee Industries Holdings Ltd., an investment holding company, manufactures and deals in precision plastic and metal molds. The company operates through two segments, Mechanical Business Unit and Electronics Business Unit. The Mechanical Business Unit segment offers plastic injection molds for consumer electronics, household appliances, medical supplies, automotive, and computer peripherals; and precision plastic injection mold design and fabrication services. This segment provides single-shot, double-shot, vertical, insert, and gas-assisted molding services; and value-added services for plastic decorative purposes, such as laser etching, ultrasonic welding, heat staking, printing, polishing, and sub-assembly services. It also builds engineering tools for customers in the medical and automotive industry. The Electronics Business Unit segment distributes memory devices, radio frequency modules, power management integrated circuits, microcontrollers, transistors, MOSFETs, capacitors, inductors, resistors, crystal oscillators, and connectors, as well as provides industrial power solutions, and design-in and integration services. This segment serves original design manufacturers, original equipment manufacturers, and electronics manufacturers. It has operations in Singapore, the United States, Malaysia, the People's Republic of China, India, Thailand, Vietnam, Indonesia, and other countries. The company was formerly known as JLJ Holdings Limited and changed its name to Jubilee Industries Holdings Ltd. in April 2012. The company was founded in 1993 and is headquartered in Singapore. Jubilee Industries Holdings Ltd. is a subsidiary of Accrelist Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "S69.SI": {
        "short_name": "Serial System",
        "long_name": "Serial System Ltd",
        "summary": "Serial System Ltd, an investment holding company, distributes electronic and electrical components, and consumer products. It operates in three segments: Electronic Components Distribution, Consumer Products Distribution, and Other Businesses. The company offers consumer products, including household appliances and lifestyle goods, such as printer accessories, camera accessories, processors, motherboards, and hard-disk drives. It is also involved in the trading and rental of investment properties; assembly and distribution of medical devices and ethylene oxide sterilization; trading and distribution of IT and photographic products; and distribution and marketing of information technology, computer peripherals, parts, software, and related products. In addition, the company offers hospitality and healthcare, laundry, and project financing services. Further, it manufactures, processes, trades, and exports durian puree and durian related products; provides management, marketing, and administrative services; markets, promotes, sells, exports, and distributes semiconductor components; and offers managed print services, as well as distributes copiers and printers. Additionally, the company is involved in communications and power line construction activities. It serves various industries, such as consumer electronics, telecommunication, household appliances, industrial, electronics manufacturing services, security and surveillance, automotive, and medical. The company operates in Singapore, Malaysia, Thailand, the Philippines, Indonesia, Vietnam, India, Hong Kong, China, South Korea, and Taiwan. The company was founded in 1988 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "city": "Singapore"
    }
}