{
    "1206.HK": {
        "short_name": "TECHNOVATOR",
        "long_name": "Technovator International Limited",
        "summary": "Technovator International Limited, together with its subsidiaries, provides smart energy management products, solutions, and integrated services primarily in the People's Republic of China. The company's Smart Transportation segment offers a series of proprietary software and hardware products, and integrated supervision and control system for rail transit; and building automation systems for use in rail transit and safety door systems, as well as provides integrated solutions comprising planning, procurement, installation, commissioning, and aftersales services. Its Smart Building and Complex segment provides integrated intelligence solutions and efficiency management services, including integrated energy consumption monitoring, energy-saving consultation, and reformation services, as well as full life-cycle services; and supplies and integrates intelligence systems for buildings. The company's Smart Energy segment offers regional energy planning, integrated utilization of industrial waste heat recovery, heat pump, independent temperature and humidity control, and variable air rate technologies for energy cascade utilization, as well as optimization and transformation of energy systems. This segment also provides urban heating network technologies, including distributed variable frequency heating, cooling and heating network balancing, and combined multi-heat sources heating, as well as heating network and source monitoring, and optimal regulation technologies. The company also offers digital video urban surveillance systems for multi-level remote surveillance in the finance, electricity, security, and road traffic industries; and fire alarm systems, which offers online fire control solutions for city authorities and commercial users. The company was formerly known as Technovator Int Private Ltd. and changed its name to Technovator International Limited in September 2011. Technovator International Limited was incorporated in 2005 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "347805",
        "website": "http://www.technovator.com.sg",
        "full_time_employees": 863
    },
    "580.SI": {
        "short_name": "$ Santak",
        "long_name": "Santak Holdings Limited",
        "summary": "Santak Holdings Limited, an investment holding company, manufactures and trades in precision engineering and assembly products. It operates through Precision Engineering and Trading and Distribution segments. The company's Precision Engineering segment manufactures precision machined components for multi-national companies and other contract manufacturers. This segment's products are primarily used in hard-disk drives, fibre-optics connectors, consumer electronic devices, oil and gas equipment, telecommunication devices, mobile phones, optical instrument devices, medical equipment, connectors/contacts, and computer peripherals. Its Trading and Distribution segment engages in the sourcing and supplying of custom-made electronic, electrical, and mechanical components/products. This segment offers die-cast and machined parts, metal enclosures and stamped parts, heatsinks, solenoids, coils, contactless smartcards, security/access control systems, and OEM assembly of card readers. This segment also supplies customized electro-mechanical and mechanical assemblies, sheet metal parts, aluminum and copper heat sinks, wire harnessing, power supplies, and special material PCBs, as well as thermoplastic/BMC/insert molding products. The company operates in Singapore, other ASEAN countries, North Asia, the United States, Europe, and internationally. Santak Holdings Limited was founded in 1978 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "758084",
        "website": "http://www.santak.com.sg",
        "full_time_employees": null
    },
    "8AZ.SI": {
        "short_name": "Aztech Gbl",
        "long_name": "Aztech Global Ltd.",
        "summary": "Aztech Global Ltd., together with its subsidiaries, engages in the research, development, engineering, and manufacturing of IoT devices, data-communication products, and LED lighting products. It operates through IoT Devices and Data-communication Products; LED lighting products; and Others segments. The company provides smart security cameras; IoT lighting products; homeplugs; fibre gateways; dual band Wi-Fi MESH controllers; satellite modems; climate control mattresses; tracking devices; and healthtech products, such as wearable sensors to original equipment manufacturers (OEM) and original design manufacturers (ODM).It also distributes IoT home automation systems that enable users to control devices at home wirelessly through an application on their smartphones or tablets under the Kyla brand names through channel partners and e-commerce platforms. In addition, the company provides LED lighting products, such as luminaires, bulbs, and tubes for use in residential, commercial, industrial, agriculture, refrigeration, and automotive industrial applications; electrical and LED lights, fittings, and parts; plastic injection parts; and multi-communication products and computer peripherals, as well as installs lighting systems. Further, it offers kitchen appliances, including ovens, air fryers, electric kettles, and toasters; and home and living products, such as cordless vacuum cleaners, fans, and air purifiers. The company also provides joint development manufacturing and contract manufacturing services to multinational corporations. The company was formerly known as Aztech Global Pte. Ltd. and changed its name to Aztech Global Ltd. in February 2021. Aztech Global Ltd. was founded in 1986 and is based in Singapore. Aztech Global Ltd. is a subsidiary of Aztech Group Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408694",
        "website": "http://www.aztechglobal.com",
        "full_time_employees": 2685
    },
    "AVV.SI": {
        "short_name": "CEI",
        "long_name": "CEI Limited",
        "summary": "CEI Limited provides contract manufacturing services for the industrial equipment market in the Asia Pacific, Europe, and the United States. It offers printed circuit board and box-build assembly, equipment design, cable harness assembly, and manufacturing services; and value-added services, such as materials management, circuit layout, development engineering and prototype samples, metal stamping, cable harnessing, and precision machined components. The company also designs and manufactures own branded proprietary equipment for the semiconductor industry. It offers its services for electroluminescence displays used in industrial, transportation, and medical applications; medical and health care equipment; office automation equipment such as high speed printers; office equipment, including digital photocopiers; analytical instruments comprising gas and liquid chromatographs, and measurement instruments; aerospace products and oil and gas equipment; industrial safety controllers and environmental sensors; semiconductor equipment; and SMT equipment. The company was formerly known as CEI Contract Manufacturing Limited and changed its name to CEI Limited in April 2016. CEI Limited was founded in 1980 and is headquartered in Singapore. As of April 26, 2021, CEI Limited operates as a subsidiary of AEM Singapore Pte. Ltd.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569707",
        "website": "http://www.cei.com.sg",
        "full_time_employees": null
    },
    "BDA.SI": {
        "short_name": "PNE Industries",
        "long_name": "PNE Industries Ltd",
        "summary": "PNE Industries Ltd, an investment holding company, manufactures, assembles, and trades in electrical and electronic products primarily in Europe, Malaysia, Singapore, and the People's Republic of China. It operates in two segments, Contract Manufacturing and Trading. The Contract Manufacturing segment manufactures electronic controllers, and other electrical and electronic products. The Trading segment manufactures and trades in emergency lighting equipment and related products under PNE brand name. It also provides electrical apparatus, light fittings, and related products. PNE Industries Ltd was founded in 1983 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "339944",
        "website": "http://www.pne.com.sg",
        "full_time_employees": null
    },
    "FLEX": {
        "short_name": "Flex Ltd.",
        "long_name": "Flex Ltd.",
        "summary": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "486123",
        "website": "http://www.flex.com",
        "full_time_employees": null
    },
    "FXI.F": {
        "short_name": "FLEX LTD.",
        "long_name": "Flex Ltd.",
        "summary": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "486123",
        "website": "http://www.flex.com",
        "full_time_employees": 160000
    },
    "J03.SI": {
        "short_name": "Jadason",
        "long_name": "Jadason Enterprises Ltd",
        "summary": "Jadason Enterprises Ltd, an investment holding company, distributes machines and materials for the printed circuit board (PCB) and semi-conductor industries in Singapore, the People's Republic of China, Malaysia, Hong Kong, Taiwan, Japan, and Thailand. The company operates through Equipment and Supplies, and Manufacturing and Support Services segments. It also provides resharpening services to the PCB industry; sales support and procurement services; and drilling services to the PCB and semiconductor industries, as well as installs machines. In addition, the company engages in the distribution of equipment, supplies, and materials; and provision of support services to the PCB and semiconductor industries; lamination of PCBs; and assembly of laser photo plotters, exposure machines, and other PCB equipment for the PCB industry. Further, it engages in trading large format photo masks. Jadason Enterprises Ltd was founded in 1980 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "416237",
        "website": "http://www.jadason.com/indexE.html",
        "full_time_employees": null
    },
    "MZH.SI": {
        "short_name": "Nanofilm",
        "long_name": "Nanofilm Technologies International Limited",
        "summary": "Nanofilm Technologies International Limited provides nanotechnology solutions in Asia. The company operates through Advanced Materials Business Unit (BU), Nanofabrication BU, and Industrial Equipment BU segments. The Advanced Materials BU segment offers advanced materials through surface solution services based on its vacuum coating technologies and processes. The Nanofabrication BU segment manufactures and supplies nanoproducts, which are used by its customers as components for the smooth functioning and performance of various parts of their end-products. The Industrial Equipment BU segment manufactures and sells turnkey equipment systems comprising coating equipment, cleaning lines, and automation systems that are installed at its customers' production lines. This segment also provides customized operating software for its systems and training, as well as spare-parts, customer service, and other forms of after-sales support. The company also offers advanced materials and nanoproducts; markets and sells industrial machinery and equipment; engages in research and experimental development on engineering, and solar cell business; and provides coating services to end users in the precision engineering and printed circuit boards industries, consultation and technical development services, and coating services for automotive parts and precision components. In addition, it engages in the manufacture and forming of modules; manufacture, processing, and assembly of plastic products; production and sale of auto parts; and trading and sale of electronics and equipment. The company was founded in 1999 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "139959",
        "website": "http://www.nti-nanofilm.com",
        "full_time_employees": null
    },
    "QZG.SI": {
        "short_name": "$ Accrelist Ltd",
        "long_name": "Accrelist Ltd.",
        "summary": "Accrelist Ltd. operates as a distributor and manufacturers' representative of test equipment for the disk drive industry. It operates through four segments: Financial Technology, Electronic Components Distribution Business Unit (EBU), Mechanical Business Unit (MBU), and Aesthetic Medical Services (AMS). The Financial Technology segment provides financial services, such as crowdfunding to enable users to raise funds for their projects and electronic wallet services granting users an alternate mode of payment. The EBU segment distributes and acts as a representative for a range of active and passive electronic components. The MBU segment offers mold design and fabrication services for consumer electronics, household appliances, and automotive and computer peripherals, as well as precision plastic injection molding services for their customers' finished products. The AMS segment operates four aesthetic medical clinics under the Accrelist Medical Aesthetics brand. The company also provides petroleum, mining, and prospecting services, as well as system integration services; trades in iron ore and coal; and retails pharmaceutical and medical goods. It has operations in Singapore, Malaysia, Indonesia, Thailand, Vietnam, the United States, the People's Republic of China, India, and internationally. The company was formerly known as WE Holdings Ltd. and changed its name to Accrelist Ltd. in November 2016. The company was founded in 1986 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408564",
        "website": "http://www.accrelist.com.sg",
        "full_time_employees": 1836
    },
    "V03.SI": {
        "short_name": "Venture",
        "long_name": "Venture Corporation Limited",
        "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore, the Asia Pacific, and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, installation, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; development and marketing of color imaging products for label printing; and research and development of biotechnology, life and medical science products. The company is also involved in the provision of engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services; and manufacturing, product design and development, engineering and supply-chain management services. In addition, it engages in the manufacturing, fabricating, and dealing of precision plastic tools, components and sub-assemblies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Further, the company wholesales computer hardware and peripheral equipment; manufactures and repairs engineering and scientific instruments; and manufactures and sells data and telecommunications products in industrial electronics industries. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569873",
        "website": "http://www.venture.com.sg",
        "full_time_employees": 10776
    },
    "VEM.F": {
        "short_name": "VENTURE  SD-,25",
        "long_name": "Venture Corporation Limited",
        "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore, the Asia Pacific, and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, installation, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; development and marketing of color imaging products for label printing; and research and development of biotechnology, life and medical science products. The company is also involved in the provision of engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services; and manufacturing, product design and development, engineering and supply-chain management services. In addition, it engages in the manufacturing, fabricating, and dealing of precision plastic tools, components and sub-assemblies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Further, the company wholesales computer hardware and peripheral equipment; manufactures and repairs engineering and scientific instruments; and manufactures and sells data and telecommunications products in industrial electronics industries. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569873",
        "website": "http://www.venture.com.sg",
        "full_time_employees": 10776
    },
    "VEMLY": {
        "short_name": "VENTURE CORPORATION LTD",
        "long_name": "Venture Corporation Limited",
        "summary": "Venture Corporation Limited provides technology solutions, products, and services in Singapore, the Asia Pacific, and internationally. The company operates through Advanced Manufacturing & Design Solutions, and Technology Products & Design Solutions segments. It engages in the design, manufacture, assemble, installation, and distribution of electronic, and other computer products and peripherals; manufacture and sale of terminal units; development and marketing of color imaging products for label printing; and research and development of biotechnology, life and medical science products. The company is also involved in the provision of engineering, customization, logistics, and repair services; information system development and support services; design solutions and services; administrative and technical, and management services; and manufacturing, product design and development, engineering and supply-chain management services. In addition, it engages in the manufacturing, fabricating, and dealing of precision plastic tools, components and sub-assemblies; design, customization, and marketing of tool-making and precision engineering solutions; manufacture of plastic injection molds and moldings with secondary processes and subassembly; manufacture of high technology products; and import and export of electronic parts, components, equipment, devices, and instruments. Further, the company wholesales computer hardware and peripheral equipment; manufactures and repairs engineering and scientific instruments; and manufactures and sells data and telecommunications products in industrial electronics industries. Venture Corporation Limited was incorporated in 1984 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "569873",
        "website": "http://www.venture.com.sg",
        "full_time_employees": 10776
    }
}