{"1316.TW": {"short_name": "SUN YAD CONSTRUCTION CO LTD", "long_name": "Sun Yad Construction Co.,Ltd", "summary": "Sun Yad Construction Co., Ltd manufactures and sells PU synthetic leather materials in Mainland China, Vietnam, and Southeast Asia. The company offers its products used in manufacturing shoes for men and women. It also trades in, imports, and exports synthetic leather-related materials and optoelectronic materials; and develops, sells, and leases residential buildings. The company was founded in 1988 and is based in Tainan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "1323.TW": {"short_name": "YONYU PLASTICS", "long_name": "Yonyu Plastics Co., Ltd.", "summary": "Yonyu Plastics Co., Ltd. manufactures and sells plastic packaging products worldwide. The company offers home and personal cleaning, pharmaceutical, and green packaging products, as well as cosmetic package materials; and other products comprising cable accessories and other injection/extrusion products. It also provides color matching and master batch compounding, mold design and fabrication, plastic molding, cosmetic ingredient developing and filling, product design, assembly, computer-aided raw color recipe design, injection, blow molding, and tube manufacturing services; and various decoration services, such as printing, hot stamping, labeling, metallization, UV coating, and automated assembly services. Yonyu Plastics Co., Ltd. was founded in 1964 and is based in Tainan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "1409.TW": {"short_name": "SHINKONG SYNTHETIC FIBER", "long_name": "Shinkong Synthetic Fibers Corporation", "summary": "Shinkong Synthetic Fibers Corporation produces and sells polyester fibers and polymers in Taiwan and internationally. Its products primarily include partially oriented yarns, polyester filament yarns, fully drawn yarns, polyester staple fibers, polyester draw textured yarns, industrial yarns, polyester pellets, PET bottle grade resins, PET bottles, PET bottle preforms, engineering polymers, optical films, polyester films, and A-PET sheets. The company principally serves textiles, food, packaging, electronics, and optoelectronics industries. It also offers synthetic resins, plastic products, and polyester films; chemical fiber weaving, printing, and dyeing services; and leasing, investment, human resources management and securities investment consulting, and life and property insurance agency services, as well as electronic information software. In addition, the company manufactures magnetic tapes for recording and video disks, and polyester films; invests in and constructs business and public housing facilities; contracts for various projects, such as air pollution prevention, piping engineering, and machine installation; manufactures synthetic fibers; engages in the wholesale and retail sale of textile products; and manufactures electronic parts and components, and precision chemical materials. Further, it is involved in the precision chemical materials and mold manufacturing wholesale, etc.; consignment trading of securities and futures; and sale and rental of housing and building development projects; and provision of consulting, biotechnology research, and development services. Shinkong Synthetic Fibers Corporation was founded in 1967 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1410.TW": {"short_name": "NAN-YANG DYEING & FINISHING", "long_name": "Nan Yang Dyeing & Finishing Co.,Ltd", "summary": "Nan Yang Dyeing & Finishing Co.,Ltd engages in dyeing, printing, finishing, knitting, processing, and selling fabrics. The company offers cotton, rayon, and chemical fiber knitted fabrics. It also operates as a professional communication semiconductor component packaging and testing foundry. The company was founded in 1964 and is based in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "1413.TW": {"short_name": "HUNG CHOU FIBER IND. CO.  LTD", "long_name": "Hung Chou Fiber Ind. Co., Ltd", "summary": "Hung Chou Fiber Ind. Co., Ltd manufactures and sells polyester filaments in Taiwan. It primarily offers polyester textured yarn for the use in bath towel, facecloth, stuffed toy; silk-linen for light, thick, and thin fabrics; recycled polyester filament yarn for the use in knitted and woven fabrics; filament yarn for socks, weaving, knitting, circular knitting, denim fabric, yoga cloth, and sports wear; flannel yarn for sofa, curtains, bedding, and office furniture etc.; dyeable mixed polyester yarn for the use in knitting and weaving ; and shrinkage fiber for shirt, suits, sportswear, and casual wear. The company was formerly known as Hung Chou Chemical Industries Co. Ltd. and changed its name to Hung Chou Fiber Ind. Co., Ltd in June 2015. Hung Chou Fiber Ind. Co., Ltd was founded in 1968 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1416.TW": {"short_name": "KWONG FONG INDUSTRIES", "long_name": "Kwong Fong Industries Corporation", "summary": "Kwong Fong Industries Corporation, together with its subsidiaries, primarily engages in the construction business in Taiwan. It undertakes residential, and commercial and industrial complex construction projects, as well as operates shopping malls. The company was founded in 1968 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "1418.TW": {"short_name": "TONG-HWA SYNTHETIC FIBER", "long_name": "Tong-Hwa Synthetic Fiber Company Limited", "summary": "Tong-Hwa Synthetic Fiber Company Limited manufactures and sells polyacrylonitrile fibers in the Republic of China. The company was founded in 1970 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1419.TW": {"short_name": "SHINKONG TEXTILE CO. LTD.", "long_name": "Shinkong Textile Co.,Ltd.", "summary": "Shinkong Textile Co.,Ltd. operates as a natural fibers manufacturer. It offers digital print, dyed fabric, reflective yarn, flannel, and bi-stretch fabric services for synthetic fibers. The company also provides base layers, mid layers, and outer wear knits; and wool textile products. Shinkong Textile Co.,Ltd. was founded in 1955 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1423.TW": {"short_name": "REWARD WOOL", "long_name": "Reward Wool Industry Corporation", "summary": "Reward Wool Industry Corporation produces and sells wool products in Taiwan and internationally. It offers wool tops, special processing tops, and others. The company was founded in 1964 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1434.TW": {"short_name": "FORMOSA TAFFETA CO", "long_name": "Formosa Taffeta Co., Ltd.", "summary": "Formosa Taffeta Co., Ltd. operates in the textile industry in Asia. It operates through four segments: First Business Group, Cord Fabric Department, Gasoline Department, and FATC Department. The company engages in researching, developing, warping, sizing, beaming, twisting, designing, weaving, dyeing, printing, and finishing fabrics and textured yarns. It provides polyamine, polyester, sports, functional, and medical fabrics; tire cord fabrics, base cloths of conveyor ducks, chafers for tirelips, anti-puncture fabric for bikes, lining fabric, etc.; cotton, blended, and MVS yarns; and Nano far infrared ray, Nano anion, germanium, fine diner, hollow section insulation, low-pilling, functional, comfort, eco-friendly, protective, and flame resistance fabrics, as well as protective fabrics of uniforms for military, police, and firefighter applications. The company also offers medical protective antibacterial, bullet proof, anti-puncture, and carbon fiber fabrics; prepreg for materials of shells of notebooks and cellphones, bikes, and golf clubs; and carbon fiber fabrics for autos, pipeline reinforcement jackets, PE plastic bags, etc. In addition, it operates gasoline stations; offers petroleum, diesel, lubricant, and car appliances, as well as car washing services; installs and tests various integrated circuits; and engages in processing, and research and development of modules. The company was formerly known as Formosa Fiber Co., Ltd. and changed its name to Formosa Taffeta Co., Ltd. in January 1979. Formosa Taffeta Co., Ltd. was founded in 1973 and is headquartered in Douliu, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Douliou"}, "1439.TW": {"short_name": "CHUWA WOOL INDUSTR", "long_name": "Chuwa Wool Industry Co., (Taiwan) Ltd.", "summary": "Chuwa Wool Industry Co., (Taiwan) Ltd., an investment holding company, engages in trading wool related products in Taiwan, Japan, Korea, Malaysia, and internationally. The company operates through two segments, Sales Department and Lease Department. It also manufactures and sells wool tops, chlorinated wool tops, and chlorinated wool. In addition, the company leases real estate properties. Chuwa Wool Industry Co., (Taiwan) Ltd. was founded in 1964 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1440.TW": {"short_name": "TAINAN SPINNING", "long_name": "Tainan Spinning Co., Ltd.", "summary": "Tainan Spinning Co., Ltd. manufactures, processes, and sells various textile products and synthetic fiber materials in Taiwan, Mainland China, Vietnam, and internationally. The company offers cotton yarns, polyester fibers, polyester filament yarns, drawn textured yarns, polyester chips, pet granules, processed yarns, OE yarns, polyester staple fibers, polyester partial oriented yarns, etc., as well as polyester bottle grade chips and solid-state polymerization. It is also involved in the construction of national citizen buildings; rental and sale of commercial buildings; investment in textile-related industries and other businesses; production, printing, and dyeing of garments; and sales of woven textiles and garments. The company was founded in 1955 and is headquartered in Tainan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "1443.TW": {"short_name": "LILY TEXTILE", "long_name": "Lily Textile Co., Ltd.", "summary": "Lily Textile Co., Ltd. engages in textile and logistics business activities in Taiwan. It offers yarn products. The company also constructs and sells buildings. In addition, it is involved in warehousing, tally, processing, distribution, and information integration services, as well as e-commerce logistics activities. The company was founded in 1961 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1444.TW": {"short_name": "LEALEA ENTERPRISE", "long_name": "Lealea Enterprise Co., Ltd.", "summary": "Lealea Enterprise Co., Ltd. produces and sells polyester DTY to provide raw materials to textile manufacturers in Taiwan and internationally. It offers polyester filament, polyester textured, nylon textured, special polyester textured, conjugated, polyester special functional, recycle polyester, and solution dyed yarns, as well as polyester chips. The company was founded in 1979 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1447.TW": {"short_name": "LI PENG ENTERPRISE", "long_name": "Li Peng Enterprise Co., Ltd.", "summary": "Li Peng Enterprise Co., Ltd. manufactures and sells fabrics and yarns primarily in Asia. The company provides nylon chips, nylon filament yarns, nylon special functional yarns, and solution dyed yarns. It also offers various synthetic fabrics, such as fabrics for industrial purposes; flame retardant and blackout home textile fabrics; and fabrics for sportswear, fashion wear, and uniforms. In addition, it provides polymerization, spinning, and weaving services, as well as dyeing and post-finishing process. Li Peng Enterprise Co., Ltd. was founded in 1975 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1449.TW": {"short_name": "CHIA HER INDUSTRIAL CO", "long_name": "Chia Her Industrial Co., Ltd.", "summary": "Chia Her Industrial Co., Ltd. manufactures and sells textile products in Taiwan. The company's products include performance, fashion, chaser, home, and yarn products; and work wear products for military, police, post office, banks, gas stations, students, etc. It serves various industries comprising fashion, outdoor, sports, home, and automotive. The company is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1451.TW": {"short_name": "NIEN HSING TEXTILE", "long_name": "Nien Hsing Textile Co., Ltd.", "summary": "Nien Hsing Textile Co., Ltd. manufactures and sells yarns, denim fabrics, jeans, and knitwear worldwide. The company was founded in 1986 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "1454.TW": {"short_name": "TAIWAN TAFFETA FABRIC", "long_name": "Taiwan Taffeta Fabric Co., Ltd.", "summary": "Taiwan Taffeta Fabric Co., Ltd. produces and sells polyester fabrics in Taiwan. The company provides polyester, nylon, and interlaced/blended materials that are used in suits, outdoor, urban leisure, and home decoration applications. It also produces suede, jacquard, lightweight, heavy cloth, printed, flame retardant, waterproof and breathable, sandwich cloth, and anti-UV fabrics, as well as quick-drying and keep warm fabrics. Taiwan Taffeta Fabric Co., Ltd. was founded in 1973 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1456.TW": {"short_name": "I-HWA INDUSTRIAL", "long_name": "I-HWA Industrial Co.,Ltd", "summary": "I-HWA Industrial Co., Ltd. engages in textile and real estate businesses in Taiwan. It is involved in the manufacture, processing, and sale of textiles; and investment, trading, leasing, and sale of real estate projects. The company was founded in 1968 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1457.TW": {"short_name": "YI JINN INDUSTRIAL CO", "long_name": "Yi Jinn Industrial Co., Ltd.", "summary": "Yi Jinn Industrial Co., Ltd. engages in the research and development, production, and sale of polyester textured yarns worldwide. It primarily offers polyester filament yarns, polyester/nylon textured yarns, spandex air covering yarns, polyester textured color yarns, and composite yarns, as well as man-made woven and knit fabrics. The company provides its products under the Seagull and GreenGuard brands for application in shirts, suits, sportswear, casual wear, women's suits, home textiles, leisure wears, bath towels, facecloths, stuffed toys, ladies garments'/spring and summer clothes, gentleman's clothes/pants, knitted and woven fabrics, socks, denim fabrics, yoga clothes, underwear's/lingerie's, jackets, and over coats, as well as for weaving, and warp or circular knitting. Yi Jinn Industrial Co., Ltd. was founded in 1981 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "1460.TW": {"short_name": "EVEREST TEXTILE", "long_name": "Everest Textile Co., Ltd.", "summary": "Everest Textile Co., Ltd. manufactures and sells textile products in Taiwan and internationally. It engages in yarn texturizing, weaving, knitting, dyeing, printing, coating, and laminating, as well as garment productions. The company offers membranes, chips and yarns, synthetic leather, industrial and home fabric, organic cotton, and recycled polyester, as well as technical fashion and causal, stretch, air pass, functional fiber, soft shell, and knitting fabrics. The company primarily sells its products under the EVERTEK brand name. Its fabrics are used in sports, outdoor, city, casual, health care, and workwear applications. Everest Textile Co., Ltd. was founded in 1988 and is headquartered in Tainan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "1463.TW": {"short_name": "CHYANG SHENG DYEING & FINISHING", "long_name": "Chyang Sheng Dyeing & Finishing Co., Ltd.", "summary": "Chyang Sheng Dyeing & Finishing Co., Ltd. provides natural and man-made fiber dyeing and finishing products and services in Taiwan. The company is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "1464.TW": {"short_name": "DE LICACY INDUSTRIAL CO", "long_name": "De Licacy Industrial Co., Ltd.", "summary": "De Licacy Industrial Co., Ltd. engages in the research and development, manufacture, and sale of fabrics in Taiwan. It offers P/D and Y/D functional fabrics; and coating, lamination, and bonding fabrics. The company's products include performance and protect fabrics, such as AERO-TECH, easy move, mechanical stretch, wicking, 3D double weaving, high density, feather weight, water repellent, antu-UV, 2 layer lamination, 3 layer soft shell, 2 layer bonding, and functional coating fabrics; and eco green fabrics, including recycled polyester, organic cotton, PFC-free W/R, and DL cool fabrics. It also offers casual and fashion fabrics comprising synthetic yarn dyed, seersucker, dobby design, silky drape, satin, denim look, and beachwear fabrics; and interiors textiles consisting of dense felt like, metallic luster, mat weaving, suede-like, and water and oil repellent/soil release fabrics. The company was founded in 1982 and is headquartered in Tainan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan"}, "1465.TW": {"short_name": "WISHER INDUSTRIAL CO", "long_name": "Wisher Industrial Co., Ltd.", "summary": "Wisher Industrial Co., Ltd. manufactures and sells fabrics. Wisher Industrial Co., Ltd. was founded in 1972 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1466.TW": {"short_name": "ACELON CHEMICAL & FIBER CORPORA", "long_name": "Acelon Chemicals & Fiber Corporation", "summary": "Acelon Chemicals & Fiber Corporation manufactures and sells textile products in Taiwan. The company offers filament yarns, including nylon, polyester, dope dyed, nylon/polyester conjugate, cool, quick dry, stock, and mÃ©lange yarns; and functional fabrics, such as aceice, acestatic, acecool, acebamboo, and acemicro. It also provides finished products, which includes household and personal cleaning products; sport, cool, and yoga towels; and T-shirts, polo shirts, uniforms, and sunscreen jackets. Acelon Chemicals & Fiber Corporation was founded in 1988 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "1467.TW": {"short_name": "TEX-RAY INDUSTRIAL CO LTD", "long_name": "Tex-Ray Industrial Co., Ltd.", "summary": "Tex-Ray Industrial Co., Ltd. manufactures and retails yarns and fabrics. It also manufactures garments. The company was founded in 1978 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "1470.TW": {"short_name": "EVERTEX FABRINOLOGY LTD", "long_name": "evertex fabrinology limited", "summary": "evertex fabrinology limited manufactures and sells fabrics in Taiwan and internationally. The company offers circular and warp knit fabrics, as well as tricot greiges. It is also involved in dyeing and finishing circular and warp knits, as well as woven fabrics for suiting applications. The company was formerly known as Evertex Dyeing & Finishing. evertex fabrinology limited was founded in 1986 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "1473.TW": {"short_name": "TAINAN ENTERPRISES", "long_name": "Tainan Enterprises Co.,Ltd", "summary": "Tainan Enterprises Co., Ltd. operates as a garment OEM manufacturer in Taiwan and internationally. Its principal products include pants, shirts, dresses, skirts, jackets, vests, and coats, as well as tops, shorts, and denim and active wear products. The company offers its products under the TONY WEAR, TONY JEANS, TW.DESIGN, Emely, Emely Sweetie, and RUE 58 brand names. It primarily serves casual apparel retailers. The company was founded in 1961 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1474.TW": {"short_name": "HONMYUE ENTERPRISE CO LTD", "long_name": "Honmyue Enterprise Co., Ltd.", "summary": "Honmyue Enterprise Co., Ltd. operates as a fabric and textile manufacturer in Taiwan. The company offers a range of products, such as fabric/textile materials, including nylon fabrics, polyester fabrics, olefin fabrics, olefin polypropylene fabrics, polyester spun fabrics, vinyl mesh fabrics, textilene fabrics, TC/TR fabrics, yarn dyed fabrics, solution dyed fabrics, etc. It also provides isolation and surgical gowns, surgical drapes, medical scrubs, bedsheets, fitted sheets, pillowcases, body bags, tent fabrics, and masks, as well as other personal protect equipment. The company's products are used in industrial and baggage fabric, outdoor and indoor furnishing fabric, sports apparel fabric, and medical textile applications. Honmyue Enterprise Co., Ltd. was founded in 1970 and is based in Changhua County, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "1476.TW": {"short_name": "ECLAT TEXTILE CO", "long_name": "Eclat Textile Co., Ltd.", "summary": "Eclat Textile Co., Ltd. manufactures and sells knitted fabrics and garments in the Americas, Asia, Europe, the Middle East, Africa, and internationally. The company operates through two segments, Knitted and Clothing. The company offers elastic knit fabrics for use in various sportswear, recreation wear, underwear and pajamas, yoga wear, etc. It also invests in securities, real estate, and manufacturing industries. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "1477.TW": {"short_name": "MAKALOT INDUSTRIAL CO", "long_name": "Makalot Industrial Co., Ltd.", "summary": "Makalot Industrial Co., Ltd. engages in the design, manufacture, and sale of garments for men, women, and children in Taiwan. It offers fashion clothing; sports clothing; sleepwear, including long and short pants, T-shirts, dresses, shirts, inner pajamas, sports suits, jackets, etc.; and ready-to-wear clothing, active wear, loungewear, and gift sets. The company also provides material development, supplier search and management, style design, fashion trend provision, manufacturing, research and development, and logistics and distribution services. It also exports its products to the United States and internationally. The company was founded in 1990 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1506.TW": {"short_name": "RIGHT WAY INDUSTRIAL", "long_name": "Right Way Industrial Co.,Ltd", "summary": "Right Way Industrial Co.,Ltd, together with its subsidiaries, manufactures and sells automobile parts worldwide. The company offers various casting and forging parts with steel or aluminum alloy materials, including pistons, connecting rods, steering knuckles and system parts, suspension control arms, industrial compressor housings, industrial pump chambers, die casting parts, cast iron parts, balance shafts, and suspension components for vehicle and industrial applications. It also provides engine connecting-rods, precision machining parts, ball joints, steering rod assy, suspension control arms, and stabilizer links; and housings, mounts, and supporting brackets. The company serves original equipment manufacturers, suppliers, and aftermarket customers. Right Way Industrial Co.,Ltd was founded in 1964 and is based in Tainan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "1521.TW": {"short_name": "TA YIH INDUSTRIAL CO", "long_name": "Ta Yih Industrial Co., Ltd.", "summary": "Ta Yih Industrial Co., Ltd. engages in the manufacture, sale, and trading of vehicle and auto-bicycle parts in Taiwan and internationally. The company offers automotive lighting products, including head, rear, deck lid, front turn signal, DRL, and fog lamps; and motorcycle lighting products comprising front turn signal, head, and rear lamps. It also provides aerospace lighting products, such as search lights, night vision bezels, ball transfer units, battery cases, cab reading lights, and position lights. In addition, the company offers railway lighting products comprising railways head, tail, indication, saloon LED and fluorescent, LED cab and gooseneck reading, marker, and flashing lights, as well as light control units, aluminum extrusion parts, LED train run number signs, smart electronic ballasts, and LED door open indicators. Further, it processes and sells marine lighting devices and transport components. The company was founded in 1964 and is based in Tainan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Tainan City"}, "1524.TW": {"short_name": "GORDON AUTO BODY PARTS CO", "long_name": "Gordon Auto Body Parts Co., Ltd.", "summary": "Gordon Auto Body Parts Co., Ltd. manufactures and sells automotive sheet metal replacement crash parts worldwide. The company offers fenders, hoods, bumpers, doors, radiator supports, and other products. It also provides AC condensers, handles, mirrors, side panels, tail lamps, tailgates, fender flares, head lamps, inner fenders, steel bumpers, and step bumpers. The company was founded in 1986 and is headquartered in Taoyuan, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "1525.TW": {"short_name": "KIANSHEN CORP", "long_name": "Kian Shen Corporation", "summary": "Kian Shen Corporation manufactures and sells automobile parts. It offers truck/bus frames, electric scooter frames, stamping parts, rear body parts, dies and jigs, suspension components, and high tensile steel products. The company was founded in 1955 and is based in Yangmei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Yangmei"}, "1526.TW": {"short_name": "SUN RACE STURMEY-ARCHER INC", "long_name": "Sun Race Sturmey-Archer Inc.", "summary": "Sun Race Sturmey-Archer Inc. provides bicycle components worldwide. Its products include bottom brackets, brakes, cassettes, chains, free wheels, front cranksets, front and rear derailleurs, hubs, outer casings and inner cables, shifters, and service parts. The company was formerly known as Roots Enterprise Co., Ltd. and changed its name to Sun Race Sturmey-Archer Inc. in 2001. Sun Race Sturmey-Archer Inc. was founded in 1902 and is based in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "1536.TW": {"short_name": "HOTA INDUSTRIAL MFG CO", "long_name": "Hota Industrial Mfg. Co., Ltd.", "summary": "Hota Industrial Mfg. Co., Ltd. designs, manufactures, and sells auto transmission components. It offers transmission products, including planetary gear sets, transfer case components, differentials, output shaft for trucks, hydraulic/water pump gears, output shafts/gears, input and output shafts, motorcycle rear shafts and gear boxes, input gears, and transmission shafts and gear sets for agricultural machinery, as well as gears for compressors, hydraulic pump shafts, forks and sleeves for trucks, motorcycle gears and components, reduction gear sets, and transmission components. The company also provides electric wheelchairs and scooters, and all-terrain vehicles. In addition, it offers gear hobbing, gear shaving, and chamfering machines, as well as optical profile measuring instruments. The company was formerly known as Hota Industrial Development Co., Ltd. and changed its name to Hota Industrial Mfg. Co., Ltd. in 1990. Hota Industrial Mfg. Co., Ltd. was founded in 1966 and is headquartered in Taichung City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "1568.TW": {"short_name": "TSANG YOW INDUSTRIAL CO", "long_name": "Tsang Yow Industrial Co.,Ltd.", "summary": "Tsang Yow Industrial Co.,Ltd. manufactures and supplies transmission system components and assemblies worldwide. It offers automatic and manual transmission, off highway machinery, torque converter, and viscous coupling parts; clutch parts for heavy-duty trucks; and gear boxes. The company was founded in 1985 and is based in Chiayi, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Chiayi"}, "1587.TW": {"short_name": "CRYOMAX COOLING SYSTEM CORP", "long_name": "Cryomax Cooling System Corp.", "summary": "Cryomax Cooling System Corp. manufactures and sells automotive radiators in Taiwan and internationally. It offers copper and aluminum radiators for passenger cars, military vehicles, commercial vehicles/trucks, and forklifts. The company was founded in 1984 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "1598.TW": {"short_name": "DYACO INTERNATIONAL INC", "long_name": "Dyaco International Inc.", "summary": "Dyaco International Inc. designs, manufactures, and distributes fitness, physical therapy, and sports equipment worldwide. It provides cardiovascular equipment for the home, commercial, and medical facilities; and indoor cycling solutions. The company offers its fitness, medical and rehabilitation, and physical therapy equipment to home users, commercial fitness operators, and physical therapy facilities under the Spirit Fitness, Xterra, Johnny G, SOLE Fitness, Philips, UFC, and gym80 brands. Dyaco International Inc. was founded in 1990 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1810.TW": {"short_name": "HOCHENG CORP", "long_name": "Hocheng Corporation", "summary": "Hocheng Corporation provides bathroom products in Taiwan and internationally. It offers toilets, wash basins, faucets, kitchen sinks, bathtubs, vanity cabinets, mirrors, sensor items, accessories, urinals, and other items. Hocheng Corporation was founded in 1931 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "1909.TW": {"short_name": "LONGCHEN PAPER&PACKAGING CO LTD", "long_name": "Longchen Paper & Packaging Co., Ltd.", "summary": "Longchen Paper & Packaging Co., Ltd. engages in the manufacturing, processing and trading of paper raw materials in Taiwan and Mainland China. The company operates through Containerboard, Corrugated Container, Waste Paper, Paper Distribution, and Others segments. It manufactures, processes, and sells paper, paperboard, paper products, novel packaging materials, cartons and paper boxes, package printed, and cogeneration products. The company also manufactures, prints, processes, and trades in corrugated containers; manufactures and sells paper machines; procures and sells waste paper; distributes paper products; and trades in bulk materials. In addition, it engages in the recycling/renewal of energy and resources, including turnkey design, trial-run, and operation of cogeneration and incinerator systems; warehousing; and public waste water treatment activities. Further, the company is involved general investment; wholesale, import, and export of packaging materials, paper products, electronic products, and hardware; provision of consulting services, market information, and investment strategies for investors; and sewage treatment. Additionally, it offers prints for packaging and decoration, and color-printed paper cartons; and manufactures and sells cartons, pearl wool and foam, etc. The company was formerly known as Long Chen Paper Co., Ltd. and changed its name to Longchen Paper & Packaging Co., Ltd. in June 2019. Longchen Paper & Packaging Co., Ltd. was founded in 1978 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2059.TW": {"short_name": "KING SLIDE WORKS CO", "long_name": "King Slide Works Co., Ltd.", "summary": "King Slide Works Co., Ltd., together with its subsidiaries, manufactures, processes, and sells rail kits for cloud computing servers and data devices, furniture accessories, slides, and molds in Taiwan, China, the United States, and internationally. The company offers kitchen/furniture accessories, including metal and wood drawer systems, under mount slides, ball bearing slides, epoxy coating drawer slides, and hinges; consumer electronics, such as mobile phones; and thin server slide rail/cloud computing devices. It also provides products for special applications, such as home appliances, automotive RVs, office equipment, medical, and others. King Slide Works Co., Ltd. was founded in 1986 and is headquartered in Kaohsiung City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Kaohsiung City"}, "2101.TW": {"short_name": "NAN KANG RUBBER TIRE", "long_name": "Nankang Rubber Tire Corp.,Ltd.", "summary": "Nankang Rubber Tire Corp.,Ltd. produces and sells tires in Taiwan and internationally. It offers passenger car, SUV and 4X4 WD, winter, van, motorsport, light truck, and bus and trailer tires. The company was founded in 1959 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2105.TW": {"short_name": "CHENG SHIN RUBBER INDUSTRIES", "long_name": "Cheng Shin Rubber Ind. Co., Ltd.", "summary": "Cheng Shin Rubber Ind. Co., Ltd., together with subsidiaries, processes, manufactures, and trades in bicycle tires, electrical vehicle tires, reclaimed rubbers, rubbers and resins, and other rubber products. It also manufactures and trades in various rubber products and relevant rubber machinery. The company researches, develops, tests, processes, manufactures, exhibits, imports, exports, wholesales, and retails tires for motorcycles, industrial and agricultural mechanical vehicles, passenger cars, trucks, tanks, and bicycles. It also operates a technical center; produces, sells, and maintains models; retails accessories for rubber tires; provides container transportation services; manages racing tracks; and offers warehouse logistic services. In addition, the company provides automobile accessory and related products; rubber-coated bead and belt steel cords; radial tires; and tubes. Further, it is involved in the construction and trading of employees' housings. The company operates in Taiwan, China, the United States, and internationally. Cheng Shin Rubber Ind. Co., Ltd. was founded in 1967 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2106.TW": {"short_name": "KENDA RUBBER INDUSTRY", "long_name": "Kenda Rubber Industrial Co. Ltd.", "summary": "Kenda Rubber Industrial Co. Ltd. designs and sells tires in Taiwan. It offers automotive, bicycle, wheelchair, power sport, and turf/trailer/specialty tires. The company sells its tires through distributors and retailers. Kenda Rubber Industrial Co. Ltd. was founded in 1962 and is based in Yuanlin, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2109.TW": {"short_name": "HWA FONG RUBBER INDUSTRIAL CO", "long_name": "Hwa Fong Rubber Ind. Co., Ltd.", "summary": "Hwa Fong Rubber Ind. Co., Ltd. manufactures and sells rubber and tires in Taiwan and internationally. It offers bicycle, motorcycle, scooter, agricultural, automotive, industrial, truck, bus, and light truck tires and tubes; ATV tires; and special trailer, light truck, and passenger car radial tires. The company was formerly known as Hwa Fong Ind. Co., Ltd. and changed its name to Hwa Fong Rubber Ind. Co., Ltd. in 1970. Hwa Fong Rubber Ind. Co., Ltd. was founded in 1945 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2114.TW": {"short_name": "HSIN YUNG CHIEN CO", "long_name": "Hsin Yung Chien Co., Ltd.", "summary": "Hsin Yung Chien Co., Ltd. manufactures and sells rubber conveyor belts, rubber sheets, and hot-pressing cushion pads and composite materials in Taiwan and internationally. The company's product portfolio includes straight warp, light duty, Chevron, Kevlar, and steel cord conveyor belts; specialty conveyor belts include heat, oil, flame, abrasion, cold, and chemical resistant conveyor belts; and pipe, rip stop, side wall, and EP/NN conveyor belts, as well as seal belts and bucket elevator belts under the KING brand. Its conveyor belts are used in a range of applications comprising mining, steel, aviation, agriculture, logistics, and pier automatic production. The company also provides electronic level hot and solar panel pressing cushion pads under the Silieet brand name. In addition, it offers composite materials for car parts, bicycle parts, and customer goods under the NEWsheet brand name. The company was formerly known as Hsin Yung Chien Industrial Co., Ltd. and changed its name to Hsin Yung Chien Co., Ltd. in 2003. Hsin Yung Chien Co., Ltd. was founded in 1964 and is based in Nantou City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Nantou City"}, "2115.TW": {"short_name": "LU HAI HOLDING CORP", "long_name": "Luhai Holding Corp.", "summary": "Luhai Holding Corp. manufactures and sells tire valves and accessories worldwide. It offers TPMS valves; valves for bicycles, electric bikes, motorcycles, passenger cars/light trucks, trucks/buses, and agricultural/OTR applications; and valve accessories, such as valve core products, valve caps, hexagon nuts, washers, grommets and O-rings, rim nuts, and sleeves. The company also provides valve core and mounting tools; tire pressure detection products, including tire pressure and pen type tire pressure gauges; inflating equipment comprising air chucks, clip-on air chucks, and connectors; and rigid, bent, plastic, and flexible valve extensions, as well as holders. In addition, it offers wheel balance weights and tools; tire repair accessories consisting of skivers, stitchers, scrapers, repair tools, and tire repair units; and tire repair kits. The company serves manufacturers in the tire, automobile, truck, and agriculture vehicle industries. Luhai Holding Corp. was founded in 1980 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2201.TW": {"short_name": "YULON MOTOR CO", "long_name": "Yulon Motor Company Ltd.", "summary": "Yulon Motor Company Ltd. manufactures and markets automobiles and related parts in Taiwan, China, and the Philippines. The company operates through Brand, Supporting, Horizontal, Taiwan Retail, China Retail, and Others segments. It also imports, exports, sells, retails, maintains, repairs, leases, and trades in cars and parts; manages basketball team and related services; and provides investment, general advertising, general advertising planning, taxi, temporary labor, product design, towing, publication, property insurance, management consulting, real estate leasing, buildings and greening, construction project contracting, and factory leasing services. In addition, the company engages in the supply and provision of information software; retail trade of spare parts of vehicles; provision of secondhand cars and car related products, and installment financing services for cars and trucks; metal casting and related business; wholesale and retail sale of batteries; construction industry business; brokerage of electric vehicles; and sale, maintenance, and repair of heavy vehicles and related products. Further, it provides installment loans of consumer goods; consulting services on cars, electronics, textiles, and related products; consulting services for advanced technology, products, and equipment import; computer software maintenance and computer system integration services; loans to car dealers for car purchases; secondhand vehicle consultation and vehicle agency services; and sale, brokerage, and auction services. Additionally, the company engages in the financial lease of equipment; and sale of information software and telecommunications equipment. The company was formerly known as Yulon Machinery Manufacturing Co., Ltd. and changed its name to Yulon Motor Company Ltd. in September 1960. Yulon Motor Company Ltd. was founded in 1953 and is headquartered in Miaoli, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Manufacturers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Miaoli"}, "2206.TW": {"short_name": "SANYANG MOTOR CO LTD", "long_name": "Sanyang Motor Co., Ltd.", "summary": "Sanyang Motor Co., Ltd. manufactures and sells motorcycles and automobiles in Taiwan and internationally. The company offers its products under the SYM brand. It also exports various self-developed machines, and molds and jigs, as well as provides professional services related to prototype parts processing to auto markets. The company was formerly known as Sanyang Industry Co., Ltd. and changed its name to Sanyang Motor Co., Ltd. in January 2015. Sanyang Motor Co., Ltd. was founded in 1954 and is headquartered in Hukou, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Manufacturers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hukou"}, "2207.TW": {"short_name": "HOTAI MOTOR CO", "long_name": "Hotai Motor Co.,Ltd.", "summary": "Hotai Motor Co., Ltd. primarily engages in assembling, trading, importing, selling, and repairing vehicles, automobile air conditioners, and related parts in Taiwan and Mainland China. The company provides products of various auto brands, including TOYOTA, LEXUS, HINO, and TOYOTA industrial equipment. It is also involved in the installment sales and vehicle leasing, used vehicles selling, and property insurance activities. The company was founded in 1947 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto & Truck Dealerships", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2227.TW": {"short_name": "YULON NISSAN MOTOR CO.LTD", "long_name": "Yulon Nissan Motor Co., Ltd", "summary": "Yulon Nissan Motor Co., Ltd. engages in the research, design, development, and sale of vehicles in Taiwan and internationally. The company offers sedan, RV vehicles, and commercial vehicles, as well as related components. It is also involved in the investment activities. The company is headquartered in Miaoli, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Manufacturers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Miaoli"}, "2228.TW": {"short_name": "IRON FORCE INDUSTRIAL CO LTD", "long_name": "Iron Force Industrial Co., Ltd.", "summary": "Iron Force Industrial Co., Ltd. engages in the manufacturing and trading of auto parts, and display and houseware products in Taiwan and internationally. Its auto parts include airbag inflators and precision metal parts for automotive safety systems; steering columns/shafts and diesel engine cooling pipes; high precision metal tubes for seatbelt retractor/pre-tensioner systems; automated machines; and special surface treatments, as well as related components. The company also provides OEM and ODM of customized store display fixtures; display systems design; and retail store design, as well as metal wire related products. In addition, it offers display fixtures, clothes hangers, and mannequins, as well as provides logistic services. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2231.TW": {"short_name": "CUB ELECPARTS INC.", "long_name": "Cub Elecparts Inc.", "summary": "Cub Elecparts Inc. manufactures and supplies automobile electrical and electronic parts in Taiwan. The company offers advanced driver assistance systems; aftermarket service parts comprising sensors and other parts; switches, such as ignition lock, power window, combination, and headlight; OEM products; and tire pressure monitoring sensors. Cub Elecparts Inc. was founded in 1979 and is based in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2241.TW": {"short_name": "AMULAIRE THERMAL TECHNOLOGY INC", "long_name": "Amulaire Thermal Technology, Inc.", "summary": "Amulaire Thermal Technology, Inc. provides cooling fins for green electronic devices in Taiwan, Europe, North America, and Japan. The company offers customized products; metal injection moldings, lower flow resistance, and lighter weight designs; forgings for lower flow resistance and lighter cooling designs; and thermal modules and inverter parts, and heat dissipation systems and high power electronic system parts. Amulaire Thermal Technology, Inc. was founded in 2011 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2430.TW": {"short_name": "TSANN KUEN ENTERPRISE CO", "long_name": "Tsann Kuen Enterprise Co.,Ltd", "summary": "Tsann Kuen Enterprise Co., Ltd., through its subsidiaries, engages in the manufacture and sale of electrical and electronic household appliances in Taiwan and internationally. The company primarily offers six product lines, including grill and outdoor grill, iron, coffee maker, pop-up toaster, oven, microwave oven, and motor products. It also provides light industry products, office equipment and their related modules, and computers and their related facilities or spare parts. In addition, the company offers nonferrous metal composed materials and alloy materials; electronic appliances parts, such as electrical kits, sensors, and sensitive transmitters; and education and training services. Additionally, Tsann Kuen Enterprise Co., Ltd. is involved in the development of computer software, and IC packing and testing. It also engages in retailing electrical appliances through its department stores. The company was founded in 1978 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2442.TW": {"short_name": "JEAN CO LTD", "long_name": "Jean Co.,Ltd", "summary": "Jean Co.,Ltd engages in the design, manufacture, sale, and after-sale service of automotive multimedia systems and telematics, and android smart home systems. The company offers in-car entertainment systems, including flip-down monitors, head rest monitors, and 2DIN monitors. It also engages in real estate business. In addition, the company provides property management services. Jean Co.,Ltd was founded in 1986 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2450.TW": {"short_name": "SENAO INTERNATIONAL CO LTD", "long_name": "Senao International Co., Ltd.", "summary": "Senao International Co., Ltd. sells and distributes mobile devices and accessories primarily in Taiwan and mainland China. It operates through Sales Department and Other Departments segments. The company is also involved in the sale of home appliances, digital products, IoT-related products, and health care products; agency and sale of Chunghwa Telecom telephone numbers; operation of authorized retail stores; and agency of property insurance; and provision of repairs of communication products. In addition, it offers its products and services through special stores and customer service centers. The company was formerly known as Senao Business Development Company Limited and changed its name to Senao International Co., Ltd. in August 1994. Senao International Co., Ltd. was founded in 1979 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2497.TW": {"short_name": "E-LEAD ELECTRONIC CO", "long_name": "E-Lead Electronic Co., Ltd.", "summary": "E-Lead Electronic Co., Ltd. designs and manufactures electronics devices for automotive industry in Taiwan and internationally. The company provides head unit infotainment/navigation systems, rear seat entertainment systems, automotive systems and digital dashboards, and advanced driving assistance systems. It also provides HUD products, including one piece windshield and combiner type and mirror HUD, and floating optical displays; project air products comprising project air computers, game, universal, and video; and eLeadrive, a solution for supporting the Internet of vehicles. E-Lead Electronic Co., Ltd. was founded in 1983 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "2546.TW": {"short_name": "KEDGE CONSTRUCTION CO", "long_name": "Kedge Construction Co., Ltd.", "summary": "Kedge Construction Co. Ltd. constructs, develops, leases, and sells housing and buildings in Taiwan. It also engages in the electrical equipment and fire safety equipment installation, etc.; and general investment activities. The company was founded in 1982 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Residential Construction", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2704.TW": {"short_name": "AMBASSADOR HOTEL", "long_name": "The Ambassador Hotel,Ltd.", "summary": "The Ambassador Hotel,Ltd. operates hotels and restaurants under the Ambassador Hotels and Restaurants, and amba Hotels & Resorts brands in Taiwan. The company was founded in 1962 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2705.TW": {"short_name": "LEOFOO DEVELOPMENT", "long_name": "Leofoo Development Co., Ltd.", "summary": "Leofoo Development Co., Ltd. engages in the tourism and travel industry in Taiwan. It operates hotels under the Courtyard by Marriott Taipei and Leofoo Hotel brands; apartment-style boutique hotel under the Leofoo Residences brand; theme park under the Leofoo Village brand; resort hotel under the Leofoo Resort Guanshi brand; water theme park under the Leofoo Water Park brand; and bakeries under the Elite Bakery, and Elite Concept brands. The company was founded in 1968 and is based in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "2707.TW": {"short_name": "FORMOSA INTERNATIONAL HOTELS CO", "long_name": "Formosa International Hotels Corporation", "summary": "Formosa International Hotels Corporation operates in the hotel industry in Taiwan and internationally. It owns and manages Regent Hotels & Resorts, an international luxury hotel brand; Silks Place, a lifestyle hotel brand; and Just Sleep, an affordable business hotel chain. The company operates 18 hotels with 3,849 rooms and suites. It also operates restaurants in National Palace Museum and various other renowned attractions in Taiwan, as well as operates Domino's Pizza chain in Taiwan. The company was founded in 1991 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2712.TW": {"short_name": "FAR GLORY HOTEL CO LTD", "long_name": "FarGlory Hotel Co.,Ltd", "summary": "FarGlory Hotel Co.,Ltd engages in the operation of Farglory Hotel in Hualien, Taiwan. It offers rooms, dining, weddings and meetings, leisure center, outdoor pool, stores, and spa facilities. The company is based in Hualien, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Resorts & Casinos", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hualien City"}, "2722.TW": {"short_name": "CHATEAU INTERNATIONAL DEVELOPME", "long_name": "Chateau International Development Co., Ltd.", "summary": "Chateau International Development Co., Ltd. engages in the hotel business. It also provides dining services; and sells commodities. The company was founded in 1995 and is headquartered in Pingtung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Resorts & Casinos", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Pingtung"}, "2723.TW": {"short_name": "GOURMET MASTER CO LTD", "long_name": "Gourmet Master Co. Ltd.", "summary": "Gourmet Master Co. Ltd., an investment holding company, operates and franchises a chain of cafes in China, Taiwan, the United States, and internationally. The company operates its cafes under the 85Â°C name that provide coffee, cake, and bakery goods. As of December 31, 2019, it operated approximately 400 stores in Taiwan, 600 stores in China, 65 stores in the United States, 18 stores in Australia, and 8 stores in Hong Kong. It also provides birthday cakes, delicacy cakes, cake rolls, specialty cakes, toasts, Taiwanese/Japanese/European/Danish bread, sandwiches, donuts, coffee, tea, milk tea, smoothies, shakes, and juices; and others, including pineapple cakes, nougats, egg rolls, and gift boxes. Gourmet Master Co. Ltd. was founded in 2005 and is based in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Restaurants", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2727.TW": {"short_name": "WOWPRIME CORP", "long_name": "Wowprime Corp.", "summary": "Wowprime Corp. provides catering services in Taiwan, China, and internationally. The company offers Western steak, Japanese style cuisine, original grilled, Hokkaido kelp hotpot, teppanyaki, Japanese pork chop, hot pot, and Italian veggie cuisines. It operates approximately 20 bands; and 400 restaurants in the United States. The company was founded in 1993 and is based in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Restaurants", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2739.TW": {"short_name": "MY HUMBLE HOUSE HOSPITALITY MGM", "long_name": "My Humble House Hospitality Management Consulting Co., Ltd.", "summary": "My Humble House Hospitality Management Consulting Co., Ltd. operates tourism hotels in Taiwan and internationally. The company also provides hospitality consulting services. Its property portfolio includes the Sheraton Grand Taipei Hotel, Le Meridien Taipei, and Mu Jiao Xi Hotel, as well as My Humble House Art Gallery that presents contemporary works of art. My Humble House Hospitality Management Consulting Co., Ltd. was founded in 2000 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2903.TW": {"short_name": "FAR EASTERN DEPARTMENT STORES L", "long_name": "Far Eastern Department Stores, Ltd.", "summary": "Far Eastern Department Stores, Ltd., togethwer with its subsidiaries, operates department stores, supermarkets, and hypermarkets in Taiwan and Mainland China. The company's products portfolio includes, candies, cookies, cans, entertainment appliances, hardware, furniture, decoration items, hand-made products, stationery, library appliances, CD/DVD, camera appliances, children toys, shoes/hats/raining garments, medicine/medical equipment, cigarettes/wines, rice/corns, salts, clocks/watches/glasses, fresh foods, frozen vegetables, frozen meats/fishes, dry foods, and various flavouring soures; and gold and jewelries, tape recorders, and radar CD players, as well as silk, nylon, and cotton clothes. It also imports, exports, deals, and sells beverages; vendor machines and measurement devices; and vehicles and vehicles parts, as well as repairs vehicles, and wire and wireless telecom appliances. In addition, the company engages in the product distribution and classification, and storage business; construction, leasing, and sale of commercial and residential buildings; parking lots management activities; art gallery, works, and antiques business; and advertisement activities, as well as electronic and children's entertainment playground/facility businesses. Further, it operates restaurants, food courts, and beverage stores; film developer shops; gas stations; and hair salons and beauty services, as well as offers computer and telecom instrument services. The company operates with 10 branch stores. Far Eastern Department Stores, Ltd. was founded in 1967 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "2906.TW": {"short_name": "COLLINS", "long_name": "Collins Co., Ltd.", "summary": "Collins Co., Ltd. exports sundry goods and garments to department stores, warehouse clubs, supermarkets, discounted stores, home centers, drug stores and importers, etc. worldwide. The company's products include tool sets and boxes/auto accessories, garden tools/accessories, houseware/kitchenware, X'mas decorations and lightings, sporting equipment/travel goods, small appliances/lightings, digital products/computer accessories, garments, and indoor and outdoor furniture, as well as bbq grills, firepits, and accessories. It is also involved in the apparel retail; biotechnology and medical care businesses; and provision of surface and storage products. The company was founded in 1969 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2908.TW": {"short_name": "TEST RITE INTERNATIONAL", "long_name": "Test-Rite International Co., Ltd.", "summary": "Test-Rite International Co., Ltd. imports and exports hand tools, auto parts, machinery, furniture, and various home appliances worldwide. The company operates through Retail, Trading, and Construction segments. The company's products include shovels, sprinklers, etc.; Christmas gifts; outdoor tables and chairs, ice buckets, tents, etc.; barbecue stoves and others; hand tools, including axes, saws, wrenches, and pliers; hardware components; automobile accessories and supplies, and their repair and maintenance products; home storage box and cabinet, and do it yourself (DIY) furniture supplies; and travel storage products. Its products also comprise furniture; stationery; computer accessories; ceiling and electric fans; wall, table, and floor lamps; indoor and outdoor lighting products and accessories; consumer electronics, such as blow-dryers, shavers, and infrared detectors; sports and leisure related products, including bicycles, and beauty and health merchandise; recreational products; BBQ grills; mattresses, sofas, sofa beds, and leisure chairs; and healthy grains and tea, organic cotton, cleaning products, personal cleaning products, fair-trade merchandising, and other related products. In addition, the company provides professional services for home improvement, home furnishing, furniture, bedding, interior design, and full-house decorations; and plumbing and electrical maintenance, waterproofing and leak repair services, as well as air conditioning repair advisory services. Further, it provides information software and electronic information; house decoration, hardware, and construction materials; interior design; mechanical and electronic engineering; cleaning service and land scape design; logistics; and other information services, as well as builds dwellings and rents buildings. It operates 27 TLW (DIY) stores, 26 HOLA stores, 2 Crate & Barrel stores, and 9 hoi! stores in Taiwan. The company was founded in 1978 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Home Improvement Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2910.TW": {"short_name": "TONLIN DEPARTMENT STORE CO", "long_name": "Tonlin Department Store Co.,Ltd.", "summary": "Tonlin Department Store Co., Ltd. operates department stores in Taiwan. It offers fashion, beauty, and lifestyle products. The company also operates cafes and restaurants. Tonlin Department Store Co., Ltd. was founded in 1971 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Department Stores", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2911.TW": {"short_name": "LES ENPHANTS", "long_name": "Les Enphants Co., Ltd.", "summary": "Les Enphants Co., Ltd. operates as a retailer of children's wear and accessories. It offers babies and toddlers' apparel, footwear, personal care items, and other child-related accessories. The company also engages in leasing, property management, warehousing, and transportation businesses; and distributing children's toys. It sells products under the owned, licensed, and distributed brands through retail shops, including multiple chain stores, department store outlets, and franchises in Taiwan, China, and Thailand. As of December 31, 2019, it operates 574 physical channels, which include 247 in Taiwan and 327 in China.The company also sells its products through e-commerce and mobile commerce platforms. Les Enphants Co., Ltd. was founded in 1971 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2915.TW": {"short_name": "RUENTEX INDUSTRIES", "long_name": "Ruentex Industries Limited", "summary": "Ruentex Industries Limited engages in textile manufacturing, retailing, marketing, and trading activities. The company offers home decorative and filament fabrics, as well as finished products; cotton dobby, cotton jacquard, yarn dye, and piece dye products; and functional fabrics, including outlast cotton, bamboo, bamboo charcoal, and soybean fabrics. It also retails men's and women's wear, underwear, and bags under the NAUTICA, NAUTICA JEANS, Jeep, KOOKAI lingerie, MORGAN LINGERIE, HECHTER STUDIO, KENNETH COLE, KENNETH COLE REACTION, DANIEL CREMIEUX, and CHARLES RIVER brands. In addition, the company offers planning and design services for elderly homes, mass merchandisers, hypermarkets, parking lots, office buildings, science and technology plants, general housing, etc.; and construction drawing services. Ruentex Industries Limited is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2929.TW": {"short_name": "TOPBI INTERNATIONAL HOLDINGS LT", "long_name": "TOPBI International Holdings Limited", "summary": "TOPBI International Holdings Limited designs and sells children's clothing from 1 to 16 years old. The company offers shorts, trousers, shirts, t-shirts, cotton-padded jacket, wind-coat, etc. It has sales points in 16 provinces and 3 municipalities in China. The company was founded in 2002 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "3607.TW": {"short_name": "COXON PRECISE INDUSTRIAL CO. LT", "long_name": "Coxon Precise Industrial Co., Ltd.", "summary": "Coxon Precise Industrial Co., Ltd. manufactures and sells engineering plastic products in Taiwan and internationally. It is involved in the designing, mold manufacturing, injection molding, coating and printing, assembling, and optical lens processing activities. The company was founded in 1989 and is based in Zhongli, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Zhongli"}, "4306.TW": {"short_name": "YEM CHIO CO LTD", "long_name": "Yem Chio Co., Ltd.", "summary": "Yem Chio Co., Ltd. engages in the biaxially oriented polypropylene film, adhesive tape, packaging material, construction, hotel, and petrochemical businesses worldwide. The company offers petrochemicals, such as acrylic acid; and plain, matt, pearlized cavitated, anti-fog, and heat sealable biaxially oriented polypropylene films. It also provides adhesive tapes, including OPP, super clear, and colored packing tapes, as well as printing tapes; and double-sided, stationery, PVC, masking, cloth, aluminum foil, floral, and Kraft paper tapes. In addition, the company engages in the land development, building construction, real estate, and hotel management businesses. Yem Chio Co., Ltd. was founded in 1977 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "4426.TW": {"short_name": "LI CHENG ENTERPRISE CO. LTD", "long_name": "Li Cheng Enterprise Co., Ltd.", "summary": "Li Cheng Enterprise Co., Ltd. manufactures and sells 3D spacer fabrics worldwide. Its products are used in shoe materials, such as bags, hats, underwear bras, general garments, mattresses, sports Equipment, medical, and automotive materials, etc. The company also provides polyester and nylon monofilaments; and other materials, such as PP and others. Li Cheng Enterprise Co., Ltd. founded 1992 and is based in Douliu, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Douliou"}, "4438.TW": {"short_name": "QUANG VIET ENTERPRISE CO LTD", "long_name": "Quang Viet Enterprise Co., Ltd.", "summary": "Quang Viet Enterprise Co., Ltd. manufactures and supplies garments for outdoor sports in Taiwan and internationally. The company was founded in 1996 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Apparel Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "4536.TW": {"short_name": "TOPKEY CORPORATION", "long_name": "Topkey Corporation", "summary": "Topkey Corporation designs, develops, and manufactures medical components, aviation seatbacks, and bike components in Taiwan. The company offers bicycle frame sets and other accessories; safety products, including helmets; and carbon composite rackets and tennis rackets. It also provides manufacture aircraft composite parts; and medical parts, such It as composite CT tables and accessories, as well as thermoplastic resin and fiber reinforced thermoplastic products. The company was founded in 1980 and is based in Taichung City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung City"}, "4551.TW": {"short_name": "GLOBAL PMX CO LTD", "long_name": "Global PMX Co., Ltd.", "summary": "Global PMX Co., Ltd. manufactures, processes, and sells precision metal components for automotive products, hard disk drives, medical equipment, and various industrial products primarily in the United States, Mainland China, and Japan It offers automotive brake safety systems and precision parts, fuel injection systems, steering systems, thermos regulator systems, medical devices and precision parts, semiconductor equipment flow controller systems, cloud and hard disk precision parts, industrial and optical products, precision metal parts, etc. The company provides precision die, mold standard parts, construction hardware, plumbing products, heating products, hardware components, electronic components, digital cameras, precision dies, and mold standard parts. In addition, it offers computer hardware and software products; and engages in various activities, including industrial plastic products manufacturing, other non-metal products manufacturing, iron and steel casting, iron and steel forging, steel reworks, aluminum reworks, etc. Global PMX Co., Ltd. was founded in 1987 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "4557.TW": {"short_name": "YUSIN HOLDING CORP", "long_name": "Yusin Holding Corp.", "summary": "Yusin Holding Corp. develops, manufactures, processes, trades, and sells vehicle's brake systems in Asia, North America, Central and South America, Europe, and internationally. Its products include brake master cylinders, brake cylinders, clutch master cylinders, clutch cylinders, brake calipers, boosters, brake pads, and other related components for the automobile's brake system. The company also manufactures and sells various vehicles parts, as well as involved in the general investment activities. Yusin Holding Corp. was founded in 1992 and is based in Chiayi, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Chiayi"}, "5706.TW": {"short_name": "PHOENIX TOURS INTL INC", "long_name": "Phoenix Tours International, Inc.", "summary": "Phoenix Tours International, Inc., together with its subsidiaries, provides travel agency services in Taiwan. The company offers foreign group travel, mini and free tour, cruise vacation, international tickets, domestic and international reservations, Taiwan tourism, rail service, online consultation, domestic and international group travel, as well as free travel, passport, and visas for various countries. It also provides Phoenix Portable Cloud App. The company was founded in 1957 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Travel Services", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "6281.TW": {"short_name": "E-LIFE MALL CORPORATION", "long_name": "E-Life Corporation", "summary": "E-Life Corporation engages in the retail of home appliances, computers, and mobile devices in Taiwan. It operates 320 retail stores, as well as an online shopping platform. The company was founded in 1975 and is headquartered in New Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Specialty Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "New Taipei City"}, "6670.TW": {"short_name": "FUSHENG PRECISION CO LTD", "long_name": "FuSheng Precision Co., Ltd.", "summary": "Fusheng Precision Co., Ltd. engages in the contract manufacturing of golf equipment primarily in Japan, the United States, and internationally. The company offers golf club heads, graphite shafts, and assembled clubs, as well as club head accessories; baseball bats; and precision casting parts for aerospace, automobile, and industrial uses. It also manufactures and sells medical equipment; sells titanium tableware and kitchenware; and researches, develops, and manufactures hardware, plastics, printing of packaging, and vacuum technology products. In addition, the company engages in the metal products import and export business; anodizing process; and vacuum coating processing. Fusheng Precision Co., Ltd. was founded in 1953 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "8443.TW": {"short_name": "SHUI-MU INTERNATIONAL CO LTD", "long_name": "Shui-Mu International Company Limited", "summary": "Shui-Mu International Company Limited produces and sells footwear in Taiwan. The company operates approximately 219 stores. Shui-Mu International Company Limited was founded in 1952 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "8454.TW": {"short_name": "MOMO COM INC", "long_name": "momo.com Inc.", "summary": "momo.com Inc. engages in the software design, TV and radio production, radio and TV program distribution, radio and TV advertising, issuing of magazine, and retailing businesses in Taiwan and internationally. It operates through two segments, Television and Magazine Department, and Internet Department. It also offers TV home shopping, online shopping, mail order service, travel service, and property and life insurance sales service. momo.com Inc. was founded in 2004 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Internet Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "8464.TW": {"short_name": "NIEN MADE ENTERPRISE CO LTD", "long_name": "Nien Made Enterprise Co., LTD.", "summary": "Nien Made Enterprise Co., LTD. engages in the research, development, design, manufacture, and sale of various types of window coverings and related components in the United States, Europe, and internationally. The company operates through two segments, Window Coverings and Other. It offers various types of blinds, shutters, shades, and related components; wood blinds and shutter semi-products; cellular, roman, and roller shades; plastic blinds and accessories; and chair covers. The company also designs, manufactures, and sells automated appliances and PVC tubes. In addition, it also engages in manufacturing and selling dehumidifiers and air purifiers; the provision of logistics support services and window coverings documentation processing services; and trading and servicing in window coverings. The company was formerly known as Huan Qiu Shi Jing Co., Ltd. and changed its name to Nien Made Enterprise Co., LTD. in March 2008. Nien Made Enterprise Co., LTD. was founded in 1974 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "8482.TW": {"short_name": "SHANE GLOBAL HOLDING INC", "long_name": "Shane Global Holding Inc.", "summary": "Shane Global Holding Inc. engages in the research and development, production, and sale of indoor furniture. The company offers sofas, beds, footrests, dining chairs, etc.; and other products comprising indoor furniture accessories, fluff-filled toys and leather garments, etc. It sells its products to retail stores in North America. The company was founded in 2014 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "8940.TW": {"short_name": "NEW PALACE INTERNATIONAL CO", "long_name": "New Palace International Co., Ltd.", "summary": "New Palace International Co., Ltd. operates restaurants. It provides food services, wedding banquets, and catering services. The company was founded in 1971 and based in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Restaurants", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "9904.TW": {"short_name": "POU CHEN", "long_name": "Pou Chen Corporation", "summary": "Pou Chen Corporation manufactures and sells athletic, casual, and outdoor shoes in Taiwan and internationally. The company operates as an original equipment manufacturer for international brands, as well as original design manufacturer for athletic footwear, leisure shoes, and sports sandals; and manufacturer for footwear accessories, apparels, and others. It also engages in the retailing of sporting goods and brand licensing business. In addition, the company is involved in the real estate development activities; and tourist hotel business. Pou Chen Corporation was founded in 1969 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "9910.TW": {"short_name": "FENG TAY ENTERPRISE CO LTD", "long_name": "Feng Tay Enterprises Co., Ltd.", "summary": "Feng Tay Enterprises Co., Ltd. produces and sells athletic shoes worldwide. The company was founded in 1971 and is headquartered in Douliu, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Douliou"}, "9911.TW": {"short_name": "TAIWAN SAKURA", "long_name": "Taiwan Sakura Corporation", "summary": "Taiwan Sakura Corporation manufactures and trades in kitchen appliances in Taiwan and internationally. The company offers gas cookers, water heaters and filters, furniture, dish dryers, building materials, metal hardware parts, sports equipment, electric hand tools, range hoods, sanitary equipment, and bathroom products, as well as cabinet of kitchen systems. It also leases real estate properties, as well as trades in various kitchen electrical appliances. The company sells its products through distributors and sales offices. Taiwan Sakura Corporation was founded in 1978 and is headquartered in Taichung City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "9921.TW": {"short_name": "GIANT MANUFACTURING CO", "long_name": "Giant Manufacturing Co., Ltd.", "summary": "Giant Manufacturing Co., Ltd. manufactures and sells bicycles, electric bicycles, and related parts worldwide. It operates through Bicycle, Materials, and Others segments. The company offers on-road, x-road, off-road, youth, rider gear, bike gear, and service gear bicycles. It markets its products through approximately 12,000 retail stores. The company was founded in 1972 and is headquartered in Taichung City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "9935.TW": {"short_name": "CHING FENG HOME FASHIONS CO LTD", "long_name": "Ching Feng Home Fashions Co.,Ltd", "summary": "Ching Feng Home Fashions Co.,Ltd designs, develops, manufactures, and sells home decor products in Taiwan and internationally. It offers aluminum venetian, faux wood venetian, and vinyl venetian and vertical blinds; roman, pleated, and cellular shades; and coral fleece throws and blankets, flannel throws and blankets, faux fur throws, dÃ©cor throws, and comforters. The company also provides decor pillows; and bath products, such as shower curtains and accessories. In addition, it offers beddings, table linens, cushions, and kitchen appliances. The company was founded in 1974 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Furnishings, Fixtures & Appliances", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "9938.TW": {"short_name": "TAIWAN PAIHO", "long_name": "Taiwan Paiho Limited", "summary": "Taiwan Paiho Limited manufactures and sells touch fastener, webbings, elastic, easy tapes, and fabrics in Taiwan and internationally. The company offers general footwear and webbings for garments, shoelaces, and pull strings; touch fasteners; knitted elastic, flat woven elastic, jacquard elastic, and multi-directional textile with elasticity; easy tape products for applications in paper diapers, medical equipment, computer pipelines, outdoor sporting goods, car seats and interiors, and other accessories; bamboo charcoal yarn, bamboo charcoal insulation cotton, recycled pet yarn, and other processed products; powder coating products for use in furniture, appliances, etc.; and jacquard digital woven fabric and jacquard engineered mesh that is used in fabrics for shoes, garments, and hats and bags. It also sells houses and apartment buildings. In addition, the company engages in the production and marketing of computerized embroidery, consumer electronic accessories, chemical fibers, and masks and non-woven products; commercial property management; planning consultant, sale, development, and leasing of real estate; and provision of design decoration services. The company was formerly known as San Ho Hsin Limited and changed its name to Taiwan Paiho Limited in 1986. Taiwan Paiho Limited was founded in 1979 and is headquartered in Changhua, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Changhua"}, "9939.TW": {"short_name": "TAIWAN HON CHUAN ENTERPRISE", "long_name": "Taiwan Hon Chuan Enterprise Co., Ltd.", "summary": "Taiwan Hon Chuan Enterprise Co., Ltd. manufactures and sells beverage packaging materials for beverage manufacturers in Taiwan and internationally. The company offers aluminum, plastic, and metal lug caps; PET bottles/perform products, label products, and tobacco and liquor packaging products; caps, bottles, and labelling production equipment; and LDPE shrinkable films. It also provides hot fill beverage, aseptic beverage, and bottled water filling OEM services. The company was formerly known as Hon Chuan Metal Development Co., Ltd. and changed its name to Taiwan Hon Chuan Enterprise Co., Ltd. in 1999. Taiwan Hon Chuan Enterprise Co., Ltd. was founded in 1969 and is headquartered in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Packaging & Containers", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "9942.TW": {"short_name": "NAK SEALING TECHNOLOGIES CORP", "long_name": "NAK Sealing Technologies Corporation", "summary": "NAK Sealing Technologies Corporation, together with its subsidiaries, manufactures and sells oil seals and technical sealing products for various applications worldwide. It offers automotive seals, including engine, transmission, power steering, axle, shock absorber, and motor seals; and industrial seals comprising pump, gear reducer/gearbox, motor, power tool, robotic arm, wind turbine, and washing machine seals. The company also provides agriculture, construction, and mining seals, such as piston, rod, wiper, and axle/hub seals; and other seals includes V-rings, axial face seals, bonded seals, sleeves, rings, rubber molded parts, and O-ring kits and cords. It serves automotive, industrial, and hydraulic and pneumatic, as well as agricultural, and construction and mining equipment sectors. The company was formerly known as Mao Shun Co. and changed its name to NAK Sealing Technologies Corporation in 2002. NAK Sealing Technologies Corporation was founded in 1976 and is headquartered in Nantou City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Auto Parts", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Nantou City"}, "9943.TW": {"short_name": "HOLIDAY ENTERTAINMENT CO", "long_name": "Holiday Entertainment Co.,Ltd", "summary": "Holiday Entertainment Co., Ltd. provides karaokes and audiovisual equipment in Taiwan. The company operates through Audiovisual Equipment and Copyright Works businesses. It also engages in the management and consultancy for karaoke, as well as restaurant operations. In addition, the company distributes and sells audiovisual equipment and supplies, including boxes. As of December 31, 2013, it operated 52 branches. The company was founded in 1993 and is headquartered in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Leisure", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "9944.TW": {"short_name": "SHINIH ENTERPRISE CO LTD", "long_name": "Shinih Enterprise Co., Ltd.", "summary": "Shinih Enterprise Co., Ltd. manufactures and sells non-woven products in Taiwan and internationally. It provides functional insulation products under the THERMOLITE and CLOMAX brand names; non-woven clothes under the Tyvek name; and paddings, such as vertical folding technology and thermobond fiberfill products. The company also offers various automobile carpets comprising head linings, luggage mats, rear trunk upper hoods, rear trunk mats, wheel cover mats, central floor carpets, floor mats, door panels, and bonnet coverings. In addition, it provides spun bound fabric products, such as electrical materials, agriculture cover fabrics, building construction fabrics, and floor fabrics, as well as medical products, daily usage products, and dye printing non-woven fabric products. Further, the company offers various bedding products under the DACRON and CLOMAX brand names. Shinih Enterprise Co., Ltd. has strategic alliances with Invista. The company was founded in 1962 and is headquartered in Taoyuan City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Textile Manufacturing", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taoyuan City"}, "CMKI": {"short_name": "CMK GAMING INTERNATIONAL INC", "long_name": "CMK Gaming International, Inc.", "summary": "CMK Gaming International, Inc. develops and manufactures casino games and 3D animation products. The company is based in Taichung, Taiwan.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Gambling", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "Taichung"}, "MUGH": {"short_name": "MU GLOBAL HOLDING LIMITED", "long_name": "Mu Global Holding Limited", "summary": "Mu Global Holding Limited, a beauty and wellness company, provides non-surgical spa and wellness services, and spa related products in China. The company's spa services include bedrock bathing/ hot stone bath and quartz therapy. It also offers NVB scent diffusers and mini water purifiers. The company was founded in 2018 and is based in Taipei City, Taiwan.", "currency": "USD", "sector": "Consumer Cyclical", "industry": "Personal Services", "exchange": "PNK", "market": "us_market", "country": "Taiwan", "city": "Taipei"}}