{
    "1269.TWO": {
        "short_name": "KANPAI",
        "long_name": "Kanpai Co., Ltd",
        "summary": "Kanpai Co., Ltd operates restaurants under the Kanpai brand in China. Its restaurants offer yakiniku and beer. The company was founded in 1999 and is based in Taipei City, Taiwan. Kanpai Co., Ltd is a subsidiary of Tokyo Gas Co., Ltd.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "100",
        "website": "http://www.kanpai.com.tw",
        "market_cap": "Mid Cap"
    },
    "1316.TW": {
        "short_name": "SUN YAD CONSTRUCTION CO LTD",
        "long_name": "Sun Yad Construction Co.,Ltd",
        "summary": "Sun Yad Construction Co., Ltd manufactures and sells PU synthetic leather materials in Mainland China, Vietnam, and Southeast Asia. The company offers its products used in manufacturing shoes for men and women. It also trades in, imports, and exports synthetic leather-related materials and optoelectronic materials; and develops, sells, and leases residential buildings. The company was founded in 1988 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.sunyad.com.tw",
        "market_cap": "Mid Cap"
    },
    "1323.TW": {
        "short_name": "YONYU PLASTICS",
        "long_name": "Yonyu Plastics Co., Ltd.",
        "summary": "Yonyu Plastics Co., Ltd. manufactures and sells plastic packaging products worldwide. The company offers home and personal cleaning, pharmaceutical, and green packaging products, as well as cosmetic package materials; and other products comprising cable accessories and other injection/extrusion products. It also provides color matching and master batch compounding, mold design and fabrication, plastic molding, cosmetic ingredient developing and filling, product design, computer-aided raw color recipe design, injection, blow molding, and tube manufacturing services; and various decoration services, such as printing, hot stamping, labeling, metallization, UV coating, and automated assembly services. The company was founded in 1964 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "717",
        "website": "http://www.yonyu.com.tw",
        "market_cap": "Mid Cap"
    },
    "1336.TWO": {
        "short_name": "TAIHAN PRECISION TECHNOLOGY CO ",
        "long_name": "Taihan Precision Technology Co., Ltd.",
        "summary": "Taihan Precision Technology Co., Ltd. designs, manufactures, and sells precision molds primarily for system integrators in worldwide. It offers plastic injection products; surface treatment products, such as painting, NCVM, and IMD products; and assembly/installation and welding products and services. The company's products comprise MFP related components; keyboard frames, keyboards, and handset key tops; mobility products, including handset housings, net book housings, DSC housings, and plastic components of digital photo frames; plastic components of photo printers; and projector housing and other plastic components. It is also involved in the mold and die development and fabrication of automotive plastic components. The company was formerly known as TaiHan Steel Mold Corp. and changed its name to Taihan Precision Technology Co., Ltd. in June 2000. Taihan Precision Technology Co., Ltd. was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.thpt.com.tw",
        "market_cap": "Small Cap"
    },
    "1339.TW": {
        "short_name": "Y.C.C. PARTS MFG CO LTD",
        "long_name": "Y.C.C. Parts Mfg. Co., Ltd.",
        "summary": "Y.C.C. Parts Mfg. Co., Ltd. manufactures and sells auto plastic parts in Taiwan, North America, South America, Europe, and Asia. It offers bumpers, grilles, head lamp mounting panels, valances, head lamps, and other products, as well as bumper covers and lower valances. The company was founded in 1986 and is based in Lukang Town, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Lukang Town",
        "zipcode": "505",
        "website": "http://www.yccco.com.tw",
        "market_cap": "Mid Cap"
    },
    "1409.TW": {
        "short_name": "SHINKONG SYNTHETIC FIBER",
        "long_name": "Shinkong Synthetic Fibers Corporation",
        "summary": "Shinkong Synthetic Fibers Corporation produces and sells polyester fibers and polymers in Taiwan and internationally. Its products primarily include partially oriented yarns, polyester filament yarns, fully drawn yarns, polyester staple fibers, polyester draw textured yarns, industrial yarns, polyester pellets, PET bottle grade resins, PET bottles, PET bottle preforms, engineering polymers, optical films, polyester films, and A-PET sheets. The company principally serves textiles, food, packaging, electronics, and optoelectronics industries. It also offers synthetic resins, plastic products, and polyester films; chemical fiber weaving, printing, and dyeing services; and leasing, investment, human resources management and securities investment consulting, and life and property insurance agency services, as well as electronic information software. In addition, the company manufactures magnetic tapes for recording and video disks, and polyester films; invests in and constructs business and public housing facilities; contracts for various projects, such as air pollution prevention, piping engineering, and machine installation; manufactures synthetic fibers; engages in the wholesale and retail sale of textile products; and manufactures electronic parts and components, and precision chemical materials. Further, it is involved in the precision chemical materials and mold manufacturing wholesale, etc.; consignment trading of securities and futures; and sale and rental of housing and building development projects; and provision of consulting, biotechnology research, and development services. Shinkong Synthetic Fibers Corporation was founded in 1967 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.shinkong.com.tw",
        "market_cap": "Large Cap"
    },
    "1410.TW": {
        "short_name": "NAN-YANG DYEING & FINISHING",
        "long_name": "Nan Yang Dyeing & Finishing Co.,Ltd",
        "summary": "Nan Yang Dyeing & Finishing Co.,Ltd engages in dyeing, printing, finishing, knitting, processing, and selling fabrics. The company offers cotton, rayon, and chemical fiber knitted fabrics. It also operates as a professional communication semiconductor component packaging and testing foundry. The company was founded in 1964 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.nydf.com.tw",
        "market_cap": "Mid Cap"
    },
    "1413.TW": {
        "short_name": "HUNG CHOU FIBER IND. CO.  LTD",
        "long_name": "Hung Chou Fiber Ind. Co., Ltd",
        "summary": "Hung Chou Fiber Ind. Co., Ltd manufactures and sells polyester filaments in Taiwan. It primarily offers polyester textured yarn for the use in bath towel, facecloth, stuffed toy; silk-linen for light, thick, and thin fabrics; recycled polyester filament yarn for the use in knitted and woven fabrics; filament yarn for socks, weaving, knitting, circular knitting, denim fabric, yoga cloth, and sports wear; flannel yarn for sofa, curtains, bedding, and office furniture etc.; dyeable mixed polyester yarn for the use in knitting and weaving ; and shrinkage fiber for shirt, suits, sportswear, and casual wear. The company was formerly known as Hung Chou Chemical Industries Co. Ltd. and changed its name to Hung Chou Fiber Ind. Co., Ltd in June 2015. Hung Chou Fiber Ind. Co., Ltd was founded in 1968 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.hungchou.com.tw",
        "market_cap": "Small Cap"
    },
    "1416.TW": {
        "short_name": "KWONG FONG INDUSTRIES",
        "long_name": "Kwong Fong Industries Corporation",
        "summary": "Kwong Fong Industries Corporation, together with its subsidiaries, primarily engages in the construction business in Taiwan. It undertakes residential, and commercial and industrial complex construction projects, as well as operates shopping malls. The company was founded in 1968 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.kfic.com.tw",
        "market_cap": "Mid Cap"
    },
    "1418.TW": {
        "short_name": "TONG-HWA SYNTHETIC FIBER",
        "long_name": "Tong-Hwa Synthetic Fiber Company Limited",
        "summary": "Tong-Hwa Synthetic Fiber Company Limited manufactures and sells polyacrylonitrile fibers in the Republic of China. The company was founded in 1970 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://thfin.myweb.hinet.net",
        "market_cap": "Small Cap"
    },
    "1419.TW": {
        "short_name": "SHINKONG TEXTILE CO. LTD.",
        "long_name": "Shinkong Textile Co.,Ltd.",
        "summary": "Shinkong Textile Co.,Ltd. operates as a natural fibers manufacturer. It offers digital print, dyed fabric, reflective yarn, flannel, and bi-stretch fabric services for synthetic fibers. The company also provides base layers, mid layers, and outer wear knits; and wool textile products. Shinkong Textile Co.,Ltd. was founded in 1955 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.sktextile.com.tw",
        "market_cap": "Large Cap"
    },
    "1423.TW": {
        "short_name": "REWARD WOOL",
        "long_name": "Reward Wool Industry Corporation",
        "summary": "Reward Wool Industry Corporation produces and sells wool products in Taiwan and internationally. It offers wool tops, special processing tops, and others. The company was founded in 1964 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.reward.com.tw",
        "market_cap": "Mid Cap"
    },
    "1434.TW": {
        "short_name": "FORMOSA TAFFETA CO",
        "long_name": "Formosa Taffeta Co., Ltd.",
        "summary": "Formosa Taffeta Co., Ltd. operates in the textile industry in Asia. It operates through four segments: First Business Group, Cord Fabric Department, Gasoline Department, and FATC Department. The company engages in researching, developing, warping, sizing, beaming, twisting, designing, weaving, dyeing, printing, and finishing fabrics and textured yarns. It provides polyamine, polyester, sports, functional, and medical fabrics; tire cord fabrics, base cloths of conveyor ducks, chafers for tirelips, anti-puncture fabric for bikes, lining fabric, etc.; cotton, blended, and MVS yarns; and Nano far infrared ray, Nano anion, germanium, fine diner, hollow section insulation, low-pilling, functional, comfort, eco-friendly, protective, and flame resistance fabrics, as well as protective fabrics of uniforms for military, police, and firefighter applications. The company also offers medical protective antibacterial, bullet proof, anti-puncture, and carbon fiber fabrics; prepreg for materials of shells of notebooks and cellphones, bikes, and golf clubs; and carbon fiber fabrics for autos, pipeline reinforcement jackets, PE plastic bags, etc. In addition, it operates gasoline stations; offers petroleum, diesel, lubricant, and car appliances, as well as car washing services; installs and tests various integrated circuits; and engages in processing, and research and development of modules. The company was formerly known as Formosa Fiber Co., Ltd. and changed its name to Formosa Taffeta Co., Ltd. in January 1979. Formosa Taffeta Co., Ltd. was founded in 1973 and is headquartered in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliou",
        "zipcode": "640",
        "website": "http://www.ftc.com.tw",
        "market_cap": "Large Cap"
    },
    "1439.TW": {
        "short_name": "CHUWA WOOL INDUSTR",
        "long_name": "Chuwa Wool Industry Co., (Taiwan) Ltd.",
        "summary": "Chuwa Wool Industry Co., (Taiwan) Ltd. sells wool tops, superwash wool tops, and seperwash loose wool products in Taiwan. It also leases real estate properties. The company was founded in 1953 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110055",
        "website": "http://www.chuwa.com.tw",
        "market_cap": "Mid Cap"
    },
    "1440.TW": {
        "short_name": "TAINAN SPINNING",
        "long_name": "Tainan Spinning Co., Ltd.",
        "summary": "Tainan Spinning Co., Ltd. manufactures, processes, and sells various textile products and synthetic fiber materials in Taiwan, Mainland China, Vietnam, and internationally. The company offers cotton yarns, polyester fibers, polyester filament yarns, drawn textured yarns, polyester chips, pet granules, processed yarns, OE yarns, polyester staple fibers, polyester partial oriented yarns, etc., as well as polyester bottle grade chips and solid-state polymerization. It is also involved in the construction of national citizen buildings; rental and sale of commercial buildings; investment in textile-related industries and other businesses; production, printing, and dyeing of garments; and sales of woven textiles and garments. The company was founded in 1955 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "70155",
        "website": "http://www.tainanspin.com.tw",
        "market_cap": "Large Cap"
    },
    "1443.TW": {
        "short_name": "LILY TEXTILE",
        "long_name": "Lily Textile Co., Ltd.",
        "summary": "Lily Textile Co., Ltd. engages in textile and logistics business activities in Taiwan. It offers yarn products. The company also constructs and sells buildings. In addition, it is involved in warehousing, tally, processing, distribution, and information integration services, as well as e-commerce logistics activities. The company was founded in 1961 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lily.com.tw",
        "market_cap": "Small Cap"
    },
    "1444.TW": {
        "short_name": "LEALEA ENTERPRISE",
        "long_name": "Lealea Enterprise Co., Ltd.",
        "summary": "Lealea Enterprise Co., Ltd. produces and sells polyester DTY to provide raw materials to textile manufacturers in Taiwan and internationally. It offers polyester filament, polyester textured, nylon textured, special polyester textured, conjugated, polyester special functional, recycle polyester, and solution dyed yarns, as well as polyester chips. The company was founded in 1979 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lealea.com.tw",
        "market_cap": "Large Cap"
    },
    "1447.TW": {
        "short_name": "LI PENG ENTERPRISE",
        "long_name": "Li Peng Enterprise Co., Ltd.",
        "summary": "Li Peng Enterprise Co., Ltd. manufactures and sells fabrics and yarns primarily in Asia. The company provides nylon chips, nylon filament yarns, nylon special functional yarns, and solution dyed yarns. It also offers various synthetic fabrics, such as fabrics for industrial purposes; flame retardant and blackout home textile fabrics; and fabrics for sportswear, fashion wear, and uniforms. In addition, it provides polymerization, spinning, and weaving services, as well as dyeing and post-finishing process. Li Peng Enterprise Co., Ltd. was founded in 1975 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lealeagroup.com.tw/en/libolon/LIPENG/",
        "market_cap": "Large Cap"
    },
    "1449.TW": {
        "short_name": "CHIA HER INDUSTRIAL CO",
        "long_name": "Chia Her Industrial Co., Ltd.",
        "summary": "Chia Her Industrial Co., Ltd. manufactures and sells textile products in Taiwan. The company's products include performance, fashion, chaser, home, and yarn products; and work wear products for military, police, post office, banks, gas stations, students, etc. It serves various industries comprising fashion, outdoor, sports, home, and automotive. The company is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.chgtex.com",
        "market_cap": "Small Cap"
    },
    "1451.TW": {
        "short_name": "NIEN HSING TEXTILE",
        "long_name": "Nien Hsing Textile Co., Ltd.",
        "summary": "Nien Hsing Textile Co., Ltd. manufactures and sells yarns, denim fabrics, jeans, and knitwear worldwide. The company was founded in 1986 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "356",
        "website": "http://www.nhjeans.com",
        "market_cap": "Mid Cap"
    },
    "1454.TW": {
        "short_name": "TAIWAN TAFFETA FABRIC",
        "long_name": "Taiwan Taffeta Fabric Co., Ltd.",
        "summary": "Taiwan Taffeta Fabric Co., Ltd. produces and sells polyester fabrics in Taiwan. The company provides polyester, nylon, and interlaced/blended materials that are used in suits, outdoor, urban leisure, and home decoration applications. It also produces suede, jacquard, lightweight, heavy cloth, printed, flame retardant, waterproof and breathable, sandwich cloth, and anti-UV fabrics, as well as quick-drying and keep warm fabrics. Taiwan Taffeta Fabric Co., Ltd. was founded in 1973 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.ttfco.com",
        "market_cap": "Small Cap"
    },
    "1457.TW": {
        "short_name": "YI JINN INDUSTRIAL CO",
        "long_name": "Yi Jinn Industrial Co., Ltd.",
        "summary": "Yi Jinn Industrial Co., Ltd. engages in the research and development, production, and sale of polyester textured yarns worldwide. It primarily offers polyester filament yarns, polyester/nylon textured yarns, spandex air covering yarns, polyester textured color yarns, and composite yarns, as well as man-made woven and knit fabrics. The company provides its products under the Seagull and GreenGuard brands for application in shirts, suits, sportswear, casual wear, women's suits, home textiles, leisure wears, bath towels, facecloths, stuffed toys, ladies garments'/spring and summer clothes, gentleman's clothes/pants, knitted and woven fabrics, socks, denim fabrics, yoga clothes, underwear's/lingerie's, jackets, and over coats, as well as for weaving, and warp or circular knitting. Yi Jinn Industrial Co., Ltd. was founded in 1981 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.yijinn.com.tw",
        "market_cap": "Mid Cap"
    },
    "1460.TW": {
        "short_name": "EVEREST TEXTILE",
        "long_name": "Everest Textile Co., Ltd.",
        "summary": "Everest Textile Co., Ltd. manufactures and sells textile products in Taiwan and internationally. It engages in yarn texturizing, weaving, knitting, dyeing, printing, coating, and laminating, as well as garment productions. The company offers membranes, chips and yarns, synthetic leather, industrial and home fabric, organic cotton, and recycled polyester, as well as technical fashion and causal, stretch, air pass, functional fiber, soft shell, and knitting fabrics. The company primarily sells its products under the EVERTEK brand name. Its fabrics are used in sports, outdoor, city, casual, health care, and workwear applications. Everest Textile Co., Ltd. was founded in 1988 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74342",
        "website": "http://www.everest.com.tw",
        "market_cap": "Mid Cap"
    },
    "1463.TW": {
        "short_name": "CHYANG SHENG DYEING & FINISHING",
        "long_name": "Chyang Sheng Dyeing & Finishing Co., Ltd.",
        "summary": "Chyang Sheng Dyeing & Finishing Co., Ltd. provides natural and man-made fiber dyeing and finishing products and services in Taiwan. The company is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "337",
        "website": "http://www.csgroup.com.tw",
        "market_cap": "Mid Cap"
    },
    "1464.TW": {
        "short_name": "DE LICACY INDUSTRIAL CO",
        "long_name": "De Licacy Industrial Co., Ltd.",
        "summary": "De Licacy Industrial Co., Ltd. engages in the research and development, manufacture, and sale of fabrics in Taiwan. It offers P/D and Y/D functional fabrics; and coating, lamination, and bonding fabrics. The company's products include performance and protect fabrics, such as AERO-TECH, easy move, mechanical stretch, wicking, 3D double weaving, high density, feather weight, water repellent, antu-UV, 2 layer lamination, 3 layer soft shell, 2 layer bonding, and functional coating fabrics; and eco green fabrics, including recycled polyester, organic cotton, PFC-free W/R, and DL cool fabrics. It also offers casual and fashion fabrics comprising synthetic yarn dyed, seersucker, dobby design, silky drape, satin, denim look, and beachwear fabrics; and interiors textiles consisting of dense felt like, metallic luster, mat weaving, suede-like, and water and oil repellent/soil release fabrics. The company was founded in 1982 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "74444",
        "website": "http://www.delicacy.com.tw",
        "market_cap": "Mid Cap"
    },
    "1465.TW": {
        "short_name": "WISHER INDUSTRIAL CO",
        "long_name": "Wisher Industrial Co., Ltd.",
        "summary": "Wisher Industrial Co., Ltd. manufactures and sells fabrics. Wisher Industrial Co., Ltd. was founded in 1972 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "103",
        "website": "http://www.wisher.com.tw",
        "market_cap": "Small Cap"
    },
    "1466.TW": {
        "short_name": "ACELON CHEMICAL & FIBER CORPORA",
        "long_name": "Acelon Chemicals & Fiber Corporation",
        "summary": "Acelon Chemicals & Fiber Corporation manufactures and sells textile products in Taiwan. The company offers filament yarns, including nylon, polyester, dope dyed, nylon/polyester conjugate, cool, quick dry, stock, and mÃ©lange yarns; and functional fabrics, such as aceice, acestatic, acecool, acebamboo, and acemicro. It also provides finished products, which includes household and personal cleaning products; sport, cool, and yoga towels; and T-shirts, polo shirts, uniforms, and sunscreen jackets. Acelon Chemicals & Fiber Corporation was founded in 1988 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.acelon.com.tw",
        "market_cap": "Mid Cap"
    },
    "1470.TW": {
        "short_name": "EVERTEX FABRINOLOGY LTD",
        "long_name": "evertex fabrinology limited",
        "summary": "evertex fabrinology limited manufactures and sells fabrics in Taiwan and internationally. The company offers circular and warp knit fabrics, as well as tricot greiges. It is also involved in dyeing and finishing circular and warp knits, as well as woven fabrics for suiting applications. The company was formerly known as Evertex Dyeing & Finishing. evertex fabrinology limited was founded in 1986 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33853",
        "website": "http://www.evertex.tw",
        "market_cap": "Small Cap"
    },
    "1473.TW": {
        "short_name": "TAINAN ENTERPRISES",
        "long_name": "Tainan Enterprises Co.,Ltd",
        "summary": "Tainan Enterprises Co., Ltd. operates as a garment OEM manufacturer in Taiwan and internationally. Its principal products include pants, shirts, dresses, skirts, jackets, vests, and coats, as well as tops, shorts, and denim and active wear products. The company offers its products under the TONY WEAR, TONY JEANS, TW.DESIGN, Emely, Emely Sweetie, and RUE 58 brand names. It primarily serves casual apparel retailers. The company was founded in 1961 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tai-nan.com",
        "market_cap": "Mid Cap"
    },
    "1474.TW": {
        "short_name": "HONMYUE ENTERPRISE CO LTD",
        "long_name": "Honmyue Enterprise Co., Ltd.",
        "summary": "Honmyue Enterprise Co., Ltd. operates as a fabric and textile manufacturer in Taiwan. The company offers a range of products, such as fabric/textile materials, including nylon fabrics, polyester fabrics, olefin fabrics, olefin polypropylene fabrics, polyester spun fabrics, vinyl mesh fabrics, textilene fabrics, TC/TR fabrics, yarn dyed fabrics, solution dyed fabrics, etc. It also provides isolation and surgical gowns, surgical drapes, medical scrubs, bedsheets, fitted sheets, pillowcases, body bags, tent fabrics, and masks, as well as other personal protect equipment. The company's products are used in industrial and baggage fabric, outdoor and indoor furnishing fabric, sports apparel fabric, and medical textile applications. Honmyue Enterprise Co., Ltd. was founded in 1970 and is based in Changhua County, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "50971",
        "website": "http://www.textile-hy.com.tw",
        "market_cap": "Mid Cap"
    },
    "1476.TW": {
        "short_name": "ECLAT TEXTILE CO",
        "long_name": "Eclat Textile Co., Ltd.",
        "summary": "Eclat Textile Co., Ltd. manufactures and sells knitted fabrics and garments in the Americas, Asia, Europe, the Middle East, Africa, and internationally. The company operates through two segments, Knitted and Clothing. The company offers elastic knit fabrics for use in various sportswear, recreation wear, underwear and pajamas, yoga wear, etc. It also invests in securities, real estate, and manufacturing industries. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.eclat.com.tw",
        "market_cap": "Large Cap"
    },
    "1477.TW": {
        "short_name": "MAKALOT INDUSTRIAL CO",
        "long_name": "Makalot Industrial Co., Ltd.",
        "summary": "Makalot Industrial Co., Ltd. engages in the design, manufacture, and sale of garments for men, women, and children in Taiwan. It offers fashion clothing; sports clothing; sleepwear, including long and short pants, T-shirts, dresses, shirts, inner pajamas, sports suits, jackets, etc.; and ready-to-wear clothing, active wear, loungewear, and gift sets. The company also provides material development, supplier search and management, style design, fashion trend provision, manufacturing, research and development, and logistics and distribution services. It also exports its products to the United States and internationally. The company was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.makalot.com.tw",
        "market_cap": "Large Cap"
    },
    "1506.TW": {
        "short_name": "RIGHT WAY INDUSTRIAL",
        "long_name": "Right Way Industrial Co.,Ltd",
        "summary": "Right Way Industrial Co.,Ltd, together with its subsidiaries, manufactures and sells automobile parts worldwide. The company offers various casting and forging parts with steel or aluminum alloy materials, including pistons, connecting rods, steering knuckles and system parts, suspension control arms, industrial compressor housings, industrial pump chambers, die casting parts, cast iron parts, balance shafts, and suspension components for vehicle and industrial applications. It also provides engine connecting-rods, precision machining parts, ball joints, steering rod assy, suspension control arms, and stabilizer links; and housings, mounts, and supporting brackets. The company serves original equipment manufacturers, suppliers, and aftermarket customers. Right Way Industrial Co.,Ltd was founded in 1964 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "717",
        "website": "http://www.rightway.com.tw",
        "market_cap": "Small Cap"
    },
    "1521.TW": {
        "short_name": "TA YIH INDUSTRIAL CO",
        "long_name": "Ta Yih Industrial Co., Ltd.",
        "summary": "Ta Yih Industrial Co., Ltd. engages in the manufacture, sale, and trading of vehicle and auto-bicycle parts in Taiwan and internationally. The company offers automotive lighting products, including head, rear, deck lid, front turn signal, DRL, and fog lamps; and motorcycle lighting products comprising front turn signal, head, and rear lamps. It also provides aerospace lighting products, such as search lights, night vision bezels, ball transfer units, battery cases, cab reading lights, and position lights. In addition, the company offers railway lighting products comprising railways head, tail, indication, saloon LED and fluorescent, LED cab and gooseneck reading, marker, and flashing lights, as well as light control units, aluminum extrusion parts, LED train run number signs, smart electronic ballasts, and LED door open indicators. Further, it processes and sells marine lighting devices and transport components. The company was founded in 1964 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "702",
        "website": "http://www.tayih-ind.com.tw",
        "market_cap": "Mid Cap"
    },
    "1524.TW": {
        "short_name": "GORDON AUTO BODY PARTS CO",
        "long_name": "Gordon Auto Body Parts Co., Ltd.",
        "summary": "Gordon Auto Body Parts Co., Ltd. manufactures and sells automotive sheet metal replacement crash parts worldwide. It offers side panels, wheel flares, tailgates, engine under covers, radiators, mirrors, hoods, handles, fenders, steel and front bumpers, inner fenders, and other products. The company was founded in 1986 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": "http://www.gordon.com.tw",
        "market_cap": "Small Cap"
    },
    "1525.TW": {
        "short_name": "KIANSHEN CORP",
        "long_name": "Kian Shen Corporation",
        "summary": "Kian Shen Corporation manufactures and sells automobile parts. It offers truck/bus frames, electric scooter frames, stamping parts, rear body parts, dies and jigs, suspension components, and high tensile steel products. The company was founded in 1955 and is based in Yangmei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yangmei",
        "zipcode": "326",
        "website": "http://www.kian-shen.com",
        "market_cap": "Mid Cap"
    },
    "1526.TW": {
        "short_name": "SUN RACE STURMEY-ARCHER INC",
        "long_name": "Sun Race Sturmey-Archer Inc.",
        "summary": "Sun Race Sturmey-Archer Inc. provides bicycle components worldwide. Its products include bottom brackets, brakes, cassettes, chains, free wheels, front cranksets, front and rear derailleurs, hubs, outer casings and inner cables, shifters, and service parts. The company was formerly known as Roots Enterprise Co., Ltd. and changed its name to Sun Race Sturmey-Archer Inc. in 2001. Sun Race Sturmey-Archer Inc. was founded in 1902 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33856",
        "website": "http://www.sunrace.com",
        "market_cap": "Mid Cap"
    },
    "1533.TW": {
        "short_name": "MOBILETRON ELECTRONICS",
        "long_name": "Mobiletron Electronics Co.,Ltd.",
        "summary": "Mobiletron Electronics Co., Ltd. designs, manufactures, and sells electronic components for the automotive industry in Taiwan. It offers engine management systems, such as ABS/wheel speed sensors, brake pad wear sensors, crank/cam shaft position sensors, EGR valves, idle air control valves, ignition modules and coils, knock sensors, MAF and Map sensors, MAF sensor cores, oxygen sensors, pick up coils, relays, throttle position sensors, and transmission speed sensors, as well as ignition modules for small engines. The company also provides charging systems, including brush holders, diodes and diode trios, rectifiers, repair circuits, and voltage regulators. In addition, it offers voltage regulators, mobile safety equipment, tire pressure monitoring systems, and power tools. The company also exports its products to approximately 100 countries. Mobiletron Electronics Co., Ltd. was founded in 1982 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "428",
        "website": "http://www.mobiletron.com.tw",
        "market_cap": "Mid Cap"
    },
    "1536.TW": {
        "short_name": "HOTA INDUSTRIAL MFG CO",
        "long_name": "Hota Industrial Mfg. Co., Ltd.",
        "summary": "Hota Industrial Mfg. Co., Ltd. designs, manufactures, and sells auto transmission components. It offers transmission products, including planetary gear sets, transfer case components, differentials, output shaft for trucks, hydraulic/water pump gears, output shafts/gears, input and output shafts, motorcycle rear shafts and gear boxes, input gears, and transmission shafts and gear sets for agricultural machinery, as well as gears for compressors, hydraulic pump shafts, forks and sleeves for trucks, motorcycle gears and components, reduction gear sets, and transmission components. The company also provides electric wheelchairs and scooters, and all-terrain vehicles. In addition, it offers gear hobbing, gear shaving, and chamfering machines, as well as optical profile measuring instruments. The company was formerly known as Hota Industrial Development Co., Ltd. and changed its name to Hota Industrial Mfg. Co., Ltd. in 1990. Hota Industrial Mfg. Co., Ltd. was founded in 1966 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "42881",
        "website": "http://www.hota.com.tw",
        "market_cap": "Large Cap"
    },
    "1563.TWO": {
        "short_name": "S A I",
        "long_name": "SuperAlloy Industrial Co., Ltd.",
        "summary": "SuperAlloy Industrial Co., Ltd. engages in engineering and manufacturing lightweight metal products primarily for the automotive industry. It provides forged aluminum wheels for luxury and sports automobiles; and engineering lightweight suspension components. The company has operations in Taiwan, the United States, the United Kingdom, Germany, other parts of Europe, Australia, Japan, and internationally. SuperAlloy Industrial Co., Ltd. was founded in 1994 and is headquartered in Douliu City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliu City",
        "zipcode": "64064",
        "website": "http://www.superalloyengineering.com",
        "market_cap": "Large Cap"
    },
    "1568.TW": {
        "short_name": "TSANG YOW INDUSTRIAL CO",
        "long_name": "Tsang Yow Industrial Co.,Ltd.",
        "summary": "Tsang Yow Industrial Co.,Ltd. manufactures and supplies transmission system components and assemblies worldwide. It offers automatic and manual transmission, off highway machinery, torque converter, and viscous coupling parts; clutch parts for heavy-duty trucks; and gear boxes. The company was founded in 1985 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": "62154",
        "website": "http://www.tsangyow.com.tw",
        "market_cap": "Mid Cap"
    },
    "1587.TW": {
        "short_name": "CRYOMAX COOLING SYSTEM CORP",
        "long_name": "Cryomax Cooling System Corp.",
        "summary": "Cryomax Cooling System Corp. manufactures and sells automotive radiators in Taiwan and internationally. It offers copper and aluminum radiators for passenger cars, military vehicles, commercial vehicles/trucks, and forklifts. The company was founded in 1984 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "528",
        "website": "http://www.cryomaxcooling.com",
        "market_cap": "Small Cap"
    },
    "1592.TW": {
        "short_name": "ENTEREX INTERNATIONAL LIMITED",
        "long_name": "Enterex International Limited",
        "summary": "Enterex International Limited develops, manufactures, and sells automotive and heavy radiators, and automobile condenser in Taiwan and internationally. The company's principal products include plastic tanks and aluminum core radiators, all aluminum radiators, heavy duty radiators, intercoolers, condensers, and evaporators. Its products are used in passengers' cars, pick-ups, trailers, and generators, as well as for military and agricultural applications. Enterex International Limited was founded in 1984 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "70842",
        "website": "http://www.enterexinternational.com",
        "market_cap": "Small Cap"
    },
    "1598.TW": {
        "short_name": "DYACO INTERNATIONAL INC",
        "long_name": "Dyaco International Inc.",
        "summary": "Dyaco International Inc. designs, manufactures, and distributes fitness, physical therapy, and sports equipment worldwide. It provides cardiovascular equipment for the home, commercial, and medical facilities; and indoor cycling solutions. The company offers its fitness, medical and rehabilitation, and physical therapy equipment to home users, commercial fitness operators, and physical therapy facilities under the Spirit Fitness, Xterra, Johnny G, SOLE Fitness, Philips, UFC, and gym80 brands. Dyaco International Inc. was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10486",
        "website": "http://www.dyaco.com",
        "market_cap": "Large Cap"
    },
    "1736.TW": {
        "short_name": "JOHNSON HEALTH TECH",
        "long_name": "Johnson Health Tech. Co., Ltd.",
        "summary": "Johnson Health Tech. Co., Ltd. provides sports and fitness equipment in Asia and internationally. The company offers electric treadmills, indoor exercise bikes/flywheels, elliptical training products, and weight training/rowing equipment; electric massage chairs, and instep shoulder and neck massage equipment; and fitness accessories, bar/dumbells, yoga supplies, gloves/boxing products, and protective/weight gears. It also provides exercise products, including fitness and bicycle series, marathon products, and GPS sports watch, as well as polar accessories. The company offers its products principally under the Matrix, Vision, and Horizon brand names primarily through stores. Johnson Health Tech. Co., Ltd. was founded in 1975 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.johnsonfitness.com.tw",
        "market_cap": "Large Cap"
    },
    "1810.TW": {
        "short_name": "HOCHENG CORP",
        "long_name": "Hocheng Corporation",
        "summary": "Hocheng Corporation provides bathroom products in Taiwan and internationally. It offers toilets, wash basins, faucets, kitchen sinks, bathtubs, vanity cabinets, mirrors, sensor items, accessories, urinals, and other items. Hocheng Corporation was founded in 1931 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.hcg.com.tw",
        "market_cap": "Mid Cap"
    },
    "1909.TW": {
        "short_name": "LONGCHEN PAPER&PACKAGING CO LTD",
        "long_name": "Longchen Paper & Packaging Co., Ltd.",
        "summary": "Longchen Paper & Packaging Co., Ltd. engages in the manufacturing, processing and trading of paper raw materials in Taiwan and Mainland China. The company operates through Containerboard, Corrugated Container, Waste Paper, Paper Distribution, and Others segments. It manufactures, processes, and sells paper, paperboard, paper products, novel packaging materials, cartons and paper boxes, package printed, and cogeneration products. The company also manufactures, prints, processes, and trades in corrugated containers; manufactures and sells paper machines; procures and sells waste paper; distributes paper products; and trades in bulk materials. In addition, it engages in the recycling/renewal of energy and resources, including turnkey design, trial-run, and operation of cogeneration and incinerator systems; warehousing; and public waste water treatment activities. Further, the company is involved general investment; wholesale, import, and export of packaging materials, paper products, electronic products, and hardware; provision of consulting services, market information, and investment strategies for investors; and sewage treatment. Additionally, it offers prints for packaging and decoration, and color-printed paper cartons; and manufactures and sells cartons, pearl wool and foam, etc. The company was formerly known as Long Chen Paper Co., Ltd. and changed its name to Longchen Paper & Packaging Co., Ltd. in June 2019. Longchen Paper & Packaging Co., Ltd. was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10544",
        "website": "http://www.longchenpaper.com",
        "market_cap": "Large Cap"
    },
    "2059.TW": {
        "short_name": "KING SLIDE WORKS CO",
        "long_name": "King Slide Works Co., Ltd.",
        "summary": "King Slide Works Co., Ltd., together with its subsidiaries, manufactures, processes, and sells rail kits for cloud computing servers and data devices, furniture accessories, slides, and molds in Taiwan, China, the United States, and internationally. The company offers kitchen/furniture accessories, including metal and wood drawer systems, under mount slides, ball bearing slides, epoxy coating drawer slides, and hinges; consumer electronics, such as mobile phones; and thin server slide rail/cloud computing devices. It also provides products for special applications, such as home appliances, automotive RVs, office equipment, medical, and others. King Slide Works Co., Ltd. was founded in 1986 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung City",
        "zipcode": "82150",
        "website": "http://www.kingslide.com",
        "market_cap": "Large Cap"
    },
    "2101.TW": {
        "short_name": "NAN KANG RUBBER TIRE",
        "long_name": "Nankang Rubber Tire Corp.,Ltd.",
        "summary": "Nankang Rubber Tire Corp.,Ltd. produces and sells tires in Taiwan and internationally. It offers passenger car, SUV and 4X4 WD, winter, van, motorsport, light truck, and bus and trailer tires. The company was founded in 1959 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": null,
        "website": "http://www.nankang.com.tw",
        "market_cap": "Large Cap"
    },
    "2102.TW": {
        "short_name": "FEDERAL CORP",
        "long_name": "Federal Corporation",
        "summary": "Federal Corporation produces and sells tires in Taiwan and internationally. The company offers drift, ultra high performance, high performance, passenger car, touring, SUV, commercial, and winter tires. Federal Corporation was founded in 1954 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32068",
        "website": "http://www.federaltire.com.tw",
        "market_cap": "Large Cap"
    },
    "2105.TW": {
        "short_name": "CHENG SHIN RUBBER INDUSTRIES",
        "long_name": "Cheng Shin Rubber Ind. Co., Ltd.",
        "summary": "Cheng Shin Rubber Ind. Co., Ltd., together with subsidiaries, processes, manufactures, and trades in bicycle tires, electrical vehicle tires, reclaimed rubbers, rubbers and resins, and other rubber products. It also manufactures and trades in various rubber products and relevant rubber machinery. The company researches, develops, tests, processes, manufactures, exhibits, imports, exports, wholesales, and retails tires for motorcycles, industrial and agricultural mechanical vehicles, passenger cars, trucks, tanks, and bicycles. It also operates a technical center; produces, sells, and maintains models; retails accessories for rubber tires; provides container transportation services; manages racing tracks; and offers warehouse logistic services. In addition, the company provides automobile accessory and related products; rubber-coated bead and belt steel cords; radial tires; and tubes. Further, it is involved in the construction and trading of employees' housings. The company operates in Taiwan, China, the United States, and internationally. Cheng Shin Rubber Ind. Co., Ltd. was founded in 1967 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "51545",
        "website": "http://www.cst.com.tw",
        "market_cap": "Large Cap"
    },
    "2106.TW": {
        "short_name": "KENDA RUBBER INDUSTRY",
        "long_name": "Kenda Rubber Industrial Co. Ltd.",
        "summary": "Kenda Rubber Industrial Co. Ltd. designs and sells tires in Taiwan. It offers automotive, bicycle, wheelchair, power sport, and turf/trailer/specialty tires. The company sells its tires through distributors and retailers. Kenda Rubber Industrial Co. Ltd. was founded in 1962 and is based in Yuanlin, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "510",
        "website": "http://www.kendatire.com/en-us/",
        "market_cap": "Large Cap"
    },
    "2109.TW": {
        "short_name": "HWA FONG RUBBER INDUSTRIAL CO",
        "long_name": "Hwa Fong Rubber Ind. Co., Ltd.",
        "summary": "Hwa Fong Rubber Ind. Co., Ltd. manufactures and sells rubber and tires in Taiwan and internationally. It offers bicycle, motorcycle, scooter, agricultural, automotive, industrial, truck, bus, and light truck tires and tubes; ATV tires; and special trailer, light truck, and passenger car radial tires. The company was formerly known as Hwa Fong Ind. Co., Ltd. and changed its name to Hwa Fong Rubber Ind. Co., Ltd. in 1970. Hwa Fong Rubber Ind. Co., Ltd. was founded in 1945 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "515",
        "website": "http://www.duro.com.tw",
        "market_cap": "Mid Cap"
    },
    "2114.TW": {
        "short_name": "HSIN YUNG CHIEN CO",
        "long_name": "Hsin Yung Chien Co., Ltd.",
        "summary": "Hsin Yung Chien Co., Ltd. manufactures and sells rubber conveyor belts, rubber sheets, and hot-pressing cushion pads and composite materials in Taiwan and internationally. The company's product portfolio includes straight warp, light duty, Chevron, Kevlar, and steel cord conveyor belts; specialty conveyor belts include heat, oil, flame, abrasion, cold, and chemical resistant conveyor belts; and pipe, rip stop, side wall, and EP/NN conveyor belts, as well as seal belts and bucket elevator belts under the KING brand. Its conveyor belts are used in a range of applications comprising mining, steel, aviation, agriculture, logistics, and pier automatic production. The company also provides electronic level hot and solar panel pressing cushion pads under the Silieet brand name. In addition, it offers composite materials for car parts, bicycle parts, and customer goods under the NEWsheet brand name. The company was formerly known as Hsin Yung Chien Industrial Co., Ltd. and changed its name to Hsin Yung Chien Co., Ltd. in 2003. Hsin Yung Chien Co., Ltd. was founded in 1964 and is based in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54067",
        "website": "http://www.hyc-king.com",
        "market_cap": "Mid Cap"
    },
    "2115.TW": {
        "short_name": "LU HAI HOLDING CORP",
        "long_name": "Luhai Holding Corp.",
        "summary": "Luhai Holding Corp. manufactures and sells tire valves and accessories worldwide. It offers TPMS valves; valves for bicycles, electric bikes, motorcycles, passenger cars/light trucks, trucks/buses, and agricultural/OTR applications; and valve accessories, such as valve core products, valve caps, hexagon nuts, washers, grommets and O-rings, rim nuts, and sleeves. The company also provides valve core and mounting tools; tire pressure detection products, including tire pressure and pen type tire pressure gauges; inflating equipment comprising air chucks, clip-on air chucks, and connectors; and rigid, bent, plastic, and flexible valve extensions, as well as holders. In addition, it offers wheel balance weights and tools; tire repair accessories consisting of skivers, stitchers, scrapers, repair tools, and tire repair units; and tire repair kits. The company serves manufacturers in the tire, automobile, truck, and agriculture vehicle industries. Luhai Holding Corp. was founded in 1980 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.luhai.com.tw",
        "market_cap": "Mid Cap"
    },
    "2201.TW": {
        "short_name": "YULON MOTOR CO",
        "long_name": "Yulon Motor Company Ltd.",
        "summary": "Yulon Motor Company Ltd. manufactures and markets automobiles and related parts in Taiwan, China, and the Philippines. The company operates through Brand, Supporting, Horizontal, Taiwan Retail, China Retail, and Others segments. It also imports, exports, sells, retails, maintains, repairs, leases, and trades in cars and parts; manages basketball team and related services; and provides investment, general advertising, general advertising planning, taxi, temporary labor, product design, towing, publication, property insurance, management consulting, real estate leasing, buildings and greening, construction project contracting, and factory leasing services. In addition, the company engages in the supply and provision of information software; retail trade of spare parts of vehicles; provision of secondhand cars and car related products, and installment financing services for cars and trucks; metal casting and related business; wholesale and retail sale of batteries; construction industry business; brokerage of electric vehicles; and sale, maintenance, and repair of heavy vehicles and related products. Further, it provides installment loans of consumer goods; consulting services on cars, electronics, textiles, and related products; consulting services for advanced technology, products, and equipment import; computer software maintenance and computer system integration services; loans to car dealers for car purchases; secondhand vehicle consultation and vehicle agency services; and sale, brokerage, and auction services. Additionally, the company engages in the financial lease of equipment; and sale of information software and telecommunications equipment. The company was formerly known as Yulon Machinery Manufacturing Co., Ltd. and changed its name to Yulon Motor Company Ltd. in September 1960. Yulon Motor Company Ltd. was founded in 1953 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.yulon-motor.com.tw",
        "market_cap": "Large Cap"
    },
    "2206.TW": {
        "short_name": "SANYANG MOTOR CO LTD",
        "long_name": "Sanyang Motor Co., Ltd.",
        "summary": "Sanyang Motor Co., Ltd. manufactures and sells motorcycles and automobiles in Taiwan and internationally. The company offers its products under the SYM brand. It also exports various self-developed machines, and molds and jigs, as well as provides professional services related to prototype parts processing to auto markets. The company was formerly known as Sanyang Industry Co., Ltd. and changed its name to Sanyang Motor Co., Ltd. in January 2015. Sanyang Motor Co., Ltd. was founded in 1954 and is headquartered in Hukou, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hukou",
        "zipcode": "303",
        "website": "http://www.sanyang.com.tw",
        "market_cap": "Large Cap"
    },
    "2207.TW": {
        "short_name": "HOTAI MOTOR CO",
        "long_name": "Hotai Motor Co.,Ltd.",
        "summary": "Hotai Motor Co., Ltd. primarily engages in assembling, trading, importing, selling, and repairing vehicles, automobile air conditioners, and related parts in Taiwan and Mainland China. The company provides products of various auto brands, including TOYOTA, LEXUS, HINO, and TOYOTA industrial equipment. It is also involved in the installment sales and vehicle leasing, used vehicles selling, and property insurance activities. The company was founded in 1947 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.hotaimotor.com.tw",
        "market_cap": "Large Cap"
    },
    "2227.TW": {
        "short_name": "YULON NISSAN MOTOR CO.LTD",
        "long_name": "Yulon Nissan Motor Co., Ltd",
        "summary": "Yulon Nissan Motor Co., Ltd. engages in the research, design, development, and sale of vehicles in Taiwan and internationally. The company offers sedan, RV vehicles, and commercial vehicles, as well as related components. It is also involved in the investment activities. The company is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Miaoli",
        "zipcode": null,
        "website": "http://www.nissan.com.tw",
        "market_cap": "Large Cap"
    },
    "2228.TW": {
        "short_name": "IRON FORCE INDUSTRIAL CO LTD",
        "long_name": "Iron Force Industrial Co., Ltd.",
        "summary": "Iron Force Industrial Co., Ltd. engages in the manufacturing and trading of auto parts, and display and houseware products in Taiwan and internationally. Its auto parts include airbag inflators and precision metal parts for automotive safety systems; steering columns/shafts and diesel engine cooling pipes; high precision metal tubes for seatbelt retractor/pre-tensioner systems; automated machines; and special surface treatments, as well as related components. The company also provides OEM and ODM of customized store display fixtures; display systems design; and retail store design, as well as metal wire related products. In addition, it offers display fixtures, clothes hangers, and mannequins, as well as provides logistic services. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.ironforce.com.tw",
        "market_cap": "Mid Cap"
    },
    "2230.TWO": {
        "short_name": "C.T.I. TRAFFIC INDUSTRIES CO. L",
        "long_name": "C.T.I. Traffic Industries Co., Ltd.",
        "summary": "C.T.I. Traffic Industries Co., Ltd. manufactures and sells auto engine parts in Taiwan and internationally. The company offers green power products; DLC piston rings comprising black diamond piston rings; gasoline engine oil rings, such as car and auto oil, car piston, engine oil, and piston ring expanders; diesel engine oil rings, including cast iron rings; liner kits; piston kits; and timing kits and components, timing guides, and timing chains, as well as tensioners, and cam and crank gears. It also provides overhaul engine gaskets, which include CYL heads, cylinder head gaskets, automotive and engine oil seals, valve covers, oil pans, and valve stem and engine valve seals, as well as intake, exhaust, and pipe manifolds; engine valves consisting of auto engine valves, engine valve seats, engine bearings, and engine valve guides; and carburetor kits. In addition, the company offers hydraulic brake systems, such as break, master, brake wheel, and brake master cylinders; compression rings, including hook, step, inside cut, under cut, notch, both-side keystone, slip in, and copper plated rings; and jump starters. Its products are used automotive, agriculture, off-highway, and heavy-duty trucks applications. The company was founded in 1973 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.ctico.com.tw",
        "market_cap": "Small Cap"
    },
    "2231.TW": {
        "short_name": "CUB ELECPARTS INC.",
        "long_name": "Cub Elecparts Inc.",
        "summary": "Cub Elecparts Inc. manufactures and supplies automobile electrical and electronic parts in Taiwan. The company offers advanced driver assistance systems; aftermarket service parts comprising sensors and other parts; switches, such as ignition lock, power window, combination, and headlight; OEM products; and tire pressure monitoring sensors. Cub Elecparts Inc. was founded in 1979 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "50648",
        "website": "http://www.cubelec.com.tw",
        "market_cap": "Large Cap"
    },
    "2241.TW": {
        "short_name": "AMULAIRE THERMAL TECHNOLOGY INC",
        "long_name": "Amulaire Thermal Technology, Inc.",
        "summary": "Amulaire Thermal Technology, Inc. provides cooling fins for green electronic devices in Taiwan, Europe, North America, and Japan. The company offers customized products; metal injection moldings, lower flow resistance, and lighter weight designs; forgings for lower flow resistance and lighter cooling designs; and thermal modules and inverter parts, and heat dissipation systems and high power electronic system parts. Amulaire Thermal Technology, Inc. was founded in 2011 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24452",
        "website": "http://www.amulaire.com",
        "market_cap": "Mid Cap"
    },
    "2246.TWO": {
        "short_name": "KGET",
        "long_name": "Kaison Green Energy Technology Co., LTD",
        "summary": "Kaison Green Energy Technology Co., LTD researches and develops, produces, assembles, and sells electric vehicles. The company is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.tw-kget.com",
        "market_cap": "Small Cap"
    },
    "2249.TWO": {
        "short_name": "YOUNG SHINE",
        "long_name": "Young Shine Electric Co., Ltd.",
        "summary": "Young Shine Electric Co., Ltd. manufactures and sells automotive a/c components in Taiwan. The company offers automotive a/c compressors, heat exchangers, and parts. It also exports its products internationally. The company was founded in 2008 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung City",
        "zipcode": "806",
        "website": "http://www.young-shine.com.tw",
        "market_cap": "Small Cap"
    },
    "2430.TW": {
        "short_name": "TSANN KUEN ENTERPRISE CO",
        "long_name": "Tsann Kuen Enterprise Co.,Ltd",
        "summary": "Tsann Kuen Enterprise Co., Ltd., through its subsidiaries, engages in the manufacture and sale of electrical and electronic household appliances in Taiwan and internationally. The company primarily offers six product lines, including grill and outdoor grill, iron, coffee maker, pop-up toaster, oven, microwave oven, and motor products. It also provides light industry products, office equipment and their related modules, and computers and their related facilities or spare parts. In addition, the company offers nonferrous metal composed materials and alloy materials; electronic appliances parts, such as electrical kits, sensors, and sensitive transmitters; and education and training services. Additionally, Tsann Kuen Enterprise Co., Ltd. is involved in the development of computer software, and IC packing and testing. It also engages in retailing electrical appliances through its department stores. The company was founded in 1978 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.tsannkuen.com",
        "market_cap": "Mid Cap"
    },
    "2442.TW": {
        "short_name": "JEAN CO LTD",
        "long_name": "Jean Co.,Ltd",
        "summary": "Jean Co.,Ltd engages in the design, manufacture, sale, and after-sale service of automotive multimedia systems and telematics, and android smart home systems. The company offers in-car entertainment systems, including flip-down monitors, head rest monitors, and 2DIN monitors. It also engages in real estate business. In addition, the company provides property management services. Jean Co.,Ltd was founded in 1986 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.jean.com.tw",
        "market_cap": "Mid Cap"
    },
    "2450.TW": {
        "short_name": "SENAO INTERNATIONAL CO LTD",
        "long_name": "Senao International Co., Ltd.",
        "summary": "Senao International Co., Ltd. sells and distributes mobile devices and accessories primarily in Taiwan and mainland China. It operates through Sales Department and Other Departments segments. The company is also involved in the sale of home appliances, digital products, IoT-related products, and health care products; agency and sale of Chunghwa Telecom telephone numbers; operation of authorized retail stores; and agency of property insurance; and provision of repairs of communication products. In addition, it offers its products and services through special stores and customer service centers. The company was formerly known as Senao Business Development Company Limited and changed its name to Senao International Co., Ltd. in August 1994. Senao International Co., Ltd. was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.senao.com.tw",
        "market_cap": "Mid Cap"
    },
    "2546.TW": {
        "short_name": "KEDGE CONSTRUCTION CO",
        "long_name": "Kedge Construction Co., Ltd.",
        "summary": "Kedge Construction Co. Ltd. constructs, develops, leases, and sells housing and buildings in Taiwan. It also engages in the electrical equipment and fire safety equipment installation, etc.; and general investment activities. The company was founded in 1982 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Residential Construction",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.kedge.com.tw",
        "market_cap": "Mid Cap"
    },
    "2702.TW": {
        "short_name": "HOTEL HOLIDAY GARDEN",
        "long_name": "Hotel Holiday Garden",
        "summary": "Hotel Holiday Garden engages in hotel operation business in Taiwan and the United States. It operates international tourist hotel rooms rental services with Chinese and western restaurants, nightclubs, and swimming pools. The company also offers approximately 270 guest rooms, lobby, banquet hall, gym, and other facilities; and operates an amusement park located next to Taroko Park Shopping Center. In addition, it is involved in general export; hotel rental and catering; and investment businesses. Hotel Holiday Garden was founded in 1958 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "801",
        "website": "http://www.hotelhg.com.tw",
        "market_cap": "Mid Cap"
    },
    "2704.TW": {
        "short_name": "AMBASSADOR HOTEL",
        "long_name": "The Ambassador Hotel,Ltd.",
        "summary": "The Ambassador Hotel,Ltd. operates hotels and restaurants under the Ambassador Hotels and Restaurants, and amba Hotels & Resorts brands in Taiwan. The company was founded in 1962 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10446",
        "website": "http://www.ambassador-hotels.com",
        "market_cap": "Large Cap"
    },
    "2705.TW": {
        "short_name": "LEOFOO DEVELOPMENT",
        "long_name": "Leofoo Development Co., Ltd.",
        "summary": "Leofoo Development Co., Ltd. engages in the tourism and travel industry in Taiwan. It operates hotels under the Courtyard by Marriott Taipei and Leofoo Hotel brands; apartment-style boutique hotel under the Leofoo Residences brand; theme park under the Leofoo Village brand; resort hotel under the Leofoo Resort Guanshi brand; water theme park under the Leofoo Water Park brand; and bakeries under the Elite Bakery, and Elite Concept brands. The company was founded in 1968 and is based in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu",
        "zipcode": null,
        "website": "http://www.leofoo.com.tw",
        "market_cap": "Mid Cap"
    },
    "2707.TW": {
        "short_name": "FORMOSA INTERNATIONAL HOTELS CO",
        "long_name": "Formosa International Hotels Corporation",
        "summary": "Formosa International Hotels Corporation operates in the hotel industry in Taiwan and internationally. It owns and manages Regent Hotels & Resorts, an international luxury hotel brand; Silks Place, a lifestyle hotel brand; and Just Sleep, an affordable business hotel chain. The company operates 18 hotels with 3,849 rooms and suites. It also operates restaurants in National Palace Museum and various other renowned attractions in Taiwan, as well as operates Domino's Pizza chain in Taiwan. The company was founded in 1991 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "104",
        "website": "http://www.fihregent.com",
        "market_cap": "Large Cap"
    },
    "2712.TW": {
        "short_name": "FAR GLORY HOTEL CO LTD",
        "long_name": "FarGlory Hotel Co.,Ltd",
        "summary": "FarGlory Hotel Co.,Ltd engages in the operation of Farglory Hotel in Hualien, Taiwan. It offers rooms, dining, weddings and meetings, leisure center, outdoor pool, stores, and spa facilities. The company is based in Hualien, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hualien City",
        "zipcode": "97449",
        "website": "http://www.farglory-hotel.com.tw",
        "market_cap": "Mid Cap"
    },
    "2718.TWO": {
        "short_name": "PLEASANT HOTELS INTERNATIONAL L",
        "long_name": "Pleasant Hotels International Inc.",
        "summary": "Pleasant Hotels International Inc. engages in the operation of a hotel in Taiwan. The company's hotel features 388 guest rooms, as well as wedding and meeting halls; and a business center, swimming pool, fitness center, and restaurant. Pleasant Hotels International Inc. is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33050",
        "website": "http://www.pleasanthotels.com.tw",
        "market_cap": "Mid Cap"
    },
    "2722.TW": {
        "short_name": "CHATEAU INTERNATIONAL DEVELOPME",
        "long_name": "Chateau International Development Co., Ltd.",
        "summary": "Chateau International Development Co., Ltd. engages in the hotel business. It also provides dining services; and sells commodities. The company was founded in 1995 and is headquartered in Pingtung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Pingtung",
        "zipcode": "94643",
        "website": "http://www.chateau-hotels.com.tw",
        "market_cap": "Mid Cap"
    },
    "2723.TW": {
        "short_name": "GOURMET MASTER CO LTD",
        "long_name": "Gourmet Master Co. Ltd.",
        "summary": "Gourmet Master Co. Ltd., an investment holding company, operates and franchises a chain of cafes in China, Taiwan, the United States, and internationally. The company operates its cafes under the 85Â°C name that provide coffee, cake, and bakery goods. As of December 31, 2019, it operated approximately 400 stores in Taiwan, 600 stores in China, 65 stores in the United States, 18 stores in Australia, and 8 stores in Hong Kong. It also provides birthday cakes, delicacy cakes, cake rolls, specialty cakes, toasts, Taiwanese/Japanese/European/Danish bread, sandwiches, donuts, coffee, tea, milk tea, smoothies, shakes, and juices; and others, including pineapple cakes, nougats, egg rolls, and gift boxes. Gourmet Master Co. Ltd. was founded in 2005 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "408",
        "website": "http://www.85cafe.com",
        "market_cap": "Large Cap"
    },
    "2727.TW": {
        "short_name": "WOWPRIME CORP",
        "long_name": "Wowprime Corp.",
        "summary": "Wowprime Corp. provides catering services in Taiwan and internationally. The company offers steak dishes, Japanese pot dishes, teppanyaki, Japanese dishes, barbecue dishes, Japanese pork chops, vegetable dishes, fried steak, etc. It operates approximately 20 brands; and 400 restaurants in the United States. The company was founded in 1993 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "403",
        "website": "http://www.wowprime.com",
        "market_cap": "Large Cap"
    },
    "2729.TWO": {
        "short_name": "TTFB COMPANY LTD",
        "long_name": "TTFB Company Limited",
        "summary": "TTFB Company Limited operates a chain of restaurants in Taiwan and internationally. The company was founded in 1990 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.ttfb.com",
        "market_cap": "Mid Cap"
    },
    "2730.TWO": {
        "short_name": "MIRAMAR HOSPITALITY CO LTD",
        "long_name": "Miramar Hospitality Co.,Ltd",
        "summary": "Miramar Hospitality Co.,Ltd engages in the hotel business in Taiwan. The company operates Miramar Garden Taipei, a 5-star international business and tourist hotel that provides accommodation services, including deluxe rooms, business rooms, executive deluxe rooms, boss suites, and premier suites; dining services under the Rain Forest, Light CafÃ©, JIU BAR, and Tic-Tac-Toe Bakery names; and conference services, such as conference rooms, and wedding and banquets. It also provides health club, fitness center, outdoor swimming pool, sauna, fitness club membership, and business center facilities. The company is based in Taipei, Taiwan. Miramar Hospitality Co.,Ltd is a subsidiary of Tze Shin International Co. Ltd.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10491",
        "website": "http://www.miramargarden.com.tw",
        "market_cap": "Small Cap"
    },
    "2734.TWO": {
        "short_name": "EZFLY INTERNATIONAL TRAVEL AGEN",
        "long_name": "Ezfly International Travel Agent Co., Ltd.",
        "summary": "Ezfly International Travel Agent Co., Ltd. operates as an online travel agency in Taiwan. The company offers ticket purchase and booking services; and sells domestic air tickets, foreign individual air tickets, and foreign group air tickets. It also provides domestic and international reservation, group travel, mini tour, group and airline free travel, and themed tickets, as well as foreign dynamic packaging free travel, themed project travel, domestic high-speed rail holiday travel, domestic bus travel, various European and Japanese railway ticket, visa, and other travel products. The company offers its services through its ezfly.com website. The company was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.ezfly.com",
        "market_cap": "Small Cap"
    },
    "2736.TWO": {
        "short_name": "HOYA RESORT HOTEL GROUP",
        "long_name": "Hoya Resort Hotel Group",
        "summary": "Hoya Resort Hotel Group operates hotels, resorts, and spas in Taiwan. The company was founded in 1998 and is based in Beinan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Beinan",
        "zipcode": "954",
        "website": "http://www.hoyaresort.com.tw",
        "market_cap": "Small Cap"
    },
    "2739.TW": {
        "short_name": "MY HUMBLE HOUSE HOSPITALITY MGM",
        "long_name": "My Humble House Hospitality Management Consulting Co., Ltd.",
        "summary": "My Humble House Hospitality Management Consulting Co., Ltd. operates tourism hotels in Taiwan and internationally. The company also provides hospitality consulting services. Its property portfolio includes the Sheraton Grand Taipei Hotel, Le Meridien Taipei, and Mu Jiao Xi Hotel, as well as My Humble House Art Gallery that presents contemporary works of art. My Humble House Hospitality Management Consulting Co., Ltd. was founded in 2000 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": null,
        "website": "http://www.mhh-group.com",
        "market_cap": "Mid Cap"
    },
    "2740.TWO": {
        "short_name": "MR ONION CORP",
        "long_name": "Mr. Onion International Co., Ltd",
        "summary": "Mr. Onion International Co., Ltd provides catering services in Taiwan. The company was founded in 1991 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "100",
        "website": "http://www.mr-onion.com",
        "market_cap": "Small Cap"
    },
    "2741.TWO": {
        "short_name": "Oldsichuan",
        "long_name": "Renjie Oldsichuan Catering Management Consultant Co., Ltd.",
        "summary": "Renjie Oldsichuan Catering Management Consultant Co., Ltd. operates a chain of catering facilities in Harbin, Mainland China, and Taiwan. The company was founded in 2007 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "813",
        "website": "http://www.oldsichuan.com.tw",
        "market_cap": "Small Cap"
    },
    "2743.TWO": {
        "short_name": "RICHMOND INTL TRAVEL & TOURS CO",
        "long_name": "Richmond International Travel & Tours Co.,Ltd",
        "summary": "Richmond International Travel & Tours Co.,Ltd provides travel transportation services under the Shan Fu Tourism brand. It offers passenger services, such as passport visa, Wi-fi rental, translator/headset, and tourism encyclopedia; and professional services, such as outbound, inbound, and national tourism, as well as ticket ordering service. The company offers its products through an e-commerce platform. Richmond International Travel & Tours Co.,Ltd was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.travel4u.com.tw",
        "market_cap": "Small Cap"
    },
    "2745.TWO": {
        "short_name": "LIFE TRAVEL & TOURIST SERVICE C",
        "long_name": "Life Travel & Tourist Service Co., Ltd.",
        "summary": "Life Travel & Tourist Service Co., Ltd. provides group tourism products and services to domestic and foreign tourists in Taiwan. The company was founded in 1988 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.lifetour.com.tw",
        "market_cap": "Small Cap"
    },
    "2750.TWO": {
        "short_name": "Orchard Park",
        "long_name": "Hotel Orchard Park CO., LTD.",
        "summary": "Hotel Orchard Park CO., LTD. operates a hotel in Taiwan. The company operates the Orchard Park Hotel, an international tourist hotel with business, holiday, and transit functionalities in Taoyuan's Aerotropolis. Its hotel includes 187 guestrooms, such as deluxe king, executive rooms, Washitsu suites, executive suites, park view suites, and orchard suites. The company also provides Hee Yuet Lau Chinese restaurant, Orchard CafÃ©, Hanamizuki Japanese cuisine, Atrium Bar, Oasis club, banquet hall, conference room, shopping street, and business center services, as well as ball room, meeting room, pavilion, and spa services. Hotel Orchard Park CO., LTD. was founded in 2009 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33742",
        "website": "http://www.hotelorchardpark.com",
        "market_cap": "Small Cap"
    },
    "2752.TWO": {
        "short_name": "TOFU RESTAURANT CO LTD",
        "long_name": "Tofu Restaurant Co., Ltd.",
        "summary": "Tofu Restaurant Co., Ltd engages in the chain restaurant business in Taiwan. It is also involved in the food manufacturing business. Tofu Restaurant Co., Ltd was founded in 1997 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.dubuhouse.com.tw",
        "market_cap": "Mid Cap"
    },
    "2753.TWO": {
        "short_name": "8way",
        "long_name": "Bafang Yunji International Company Limited",
        "summary": "Bafang Yunji International Company Limited operates and franchises restaurants under the BAFANG YUNJI name. The company operates approximately 700 stores in Taiwan; and 100 stores in Hong Kong. The company was founded in 1989 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "25170",
        "website": "http://www.8way.com.tw",
        "market_cap": "Large Cap"
    },
    "2754.TWO": {
        "short_name": "KURA SUSHI ASIA CO LTD",
        "long_name": "Kura Sushi Asia Co., Ltd.",
        "summary": "Kura Sushi Asia Co., Ltd. operates sushi restaurant in Taiwan. Its restaurants offer sushi, warship, hand roll, volume, and side meal products, as well as desserts and drinks. The company was founded in 1977 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": null,
        "website": "http://www.kurasushi.tw",
        "market_cap": "Mid Cap"
    },
    "2755.TWO": {
        "short_name": "YOUNGQIN INTERNATIONAL CO LTD",
        "long_name": "YoungQin International Co., Ltd.",
        "summary": "YoungQin International Co., Ltd. operates restaurants under the MWD brand name. It also operates retail stores that offer fried chicken products under the Fried Chicken Master name. The company has operations in Taiwan and internationally. The company was founded in 2015 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan",
        "zipcode": "320",
        "website": "http://www.www.superqin.com.tw/eng/index.php?code=list&ids=805",
        "market_cap": "Small Cap"
    },
    "2903.TW": {
        "short_name": "FAR EASTERN DEPARTMENT STORES L",
        "long_name": "Far Eastern Department Stores, Ltd.",
        "summary": "Far Eastern Department Stores, Ltd., togethwer with its subsidiaries, operates department stores, supermarkets, and hypermarkets in Taiwan and Mainland China. The company's products portfolio includes, candies, cookies, cans, entertainment appliances, hardware, furniture, decoration items, hand-made products, stationery, library appliances, CD/DVD, camera appliances, children toys, shoes/hats/raining garments, medicine/medical equipment, cigarettes/wines, rice/corns, salts, clocks/watches/glasses, fresh foods, frozen vegetables, frozen meats/fishes, dry foods, and various flavouring soures; and gold and jewelries, tape recorders, and radar CD players, as well as silk, nylon, and cotton clothes. It also imports, exports, deals, and sells beverages; vendor machines and measurement devices; and vehicles and vehicles parts, as well as repairs vehicles, and wire and wireless telecom appliances. In addition, the company engages in the product distribution and classification, and storage business; construction, leasing, and sale of commercial and residential buildings; parking lots management activities; art gallery, works, and antiques business; and advertisement activities, as well as electronic and children's entertainment playground/facility businesses. Further, it operates restaurants, food courts, and beverage stores; film developer shops; gas stations; and hair salons and beauty services, as well as offers computer and telecom instrument services. The company operates with 10 branch stores. Far Eastern Department Stores, Ltd. was founded in 1967 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "220",
        "website": "http://www.feds.com.tw",
        "market_cap": "Large Cap"
    },
    "2906.TW": {
        "short_name": "COLLINS",
        "long_name": "Collins Co., Ltd.",
        "summary": "Collins Co., Ltd. exports sundry goods and garments to department stores, warehouse clubs, supermarkets, discounted stores, home centers, drug stores and importers, etc. worldwide. The company's products include tool sets and boxes/auto accessories, garden tools/accessories, houseware/kitchenware, X'mas decorations and lightings, sporting equipment/travel goods, small appliances/lightings, digital products/computer accessories, garments, and indoor and outdoor furniture, as well as BBQ grills, firepits, and accessories. It is also involved in the apparel retail business; biotechnology and medical care businesses; and provision of surface and storage products. The company was founded in 1969 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10544",
        "website": "http://www.collins.com.tw",
        "market_cap": "Mid Cap"
    },
    "2910.TW": {
        "short_name": "TONLIN DEPARTMENT STORE CO",
        "long_name": "Tonlin Department Store Co.,Ltd.",
        "summary": "Tonlin Department Store Co., Ltd. operates department stores in Taiwan. The company offers fashion, beauty, and lifestyle products. It also operates cafes and restaurants. The company was founded in 1971 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tonlin.com.tw",
        "market_cap": "Mid Cap"
    },
    "2911.TW": {
        "short_name": "LES ENPHANTS",
        "long_name": "Les Enphants Co., Ltd.",
        "summary": "Les Enphants Co., Ltd. operates as a retailer of children's wear and accessories. It offers babies and toddlers' apparel, footwear, personal care items, and other child-related accessories. The company also engages in leasing, property management, warehousing, and transportation businesses; and distributing children's toys. It sells products under the owned, licensed, and distributed brands through retail shops, including multiple chain stores, department store outlets, and franchises in Taiwan, China, and Thailand. As of December 31, 2019, it operates 574 physical channels, which include 247 in Taiwan and 327 in China.The company also sells its products through e-commerce and mobile commerce platforms. Les Enphants Co., Ltd. was founded in 1971 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.enphants.com",
        "market_cap": "Small Cap"
    },
    "2915.TW": {
        "short_name": "RUENTEX INDUSTRIES",
        "long_name": "Ruentex Industries Limited",
        "summary": "Ruentex Industries Limited engages in textile manufacturing, retailing, marketing, and trading activities. The company offers home decorative and filament fabrics, as well as finished products; cotton dobby, cotton jacquard, yarn dye, and piece dye products; and functional fabrics, including outlast cotton, bamboo, bamboo charcoal, and soybean fabrics. It also retails men's and women's wear, underwear, and bags under the NAUTICA, NAUTICA JEANS, Jeep, KOOKAI lingerie, MORGAN LINGERIE, HECHTER STUDIO, KENNETH COLE, KENNETH COLE REACTION, DANIEL CREMIEUX, and CHARLES RIVER brands. In addition, the company offers planning and design services for elderly homes, mass merchandisers, hypermarkets, parking lots, office buildings, science and technology plants, general housing, etc.; and construction drawing services. Ruentex Industries Limited is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.ruentex.com.tw",
        "market_cap": "Large Cap"
    },
    "2916.TWO": {
        "short_name": "MUNSIN GARMENT CORP",
        "long_name": "Munsin Garment Corporation",
        "summary": "Munsin Garment Corporation manufactures and trades in various knitwear garments in Taiwan. The company offers golf apparel, lightweight sportswear, professional bicycles, equestrian sports products, casual wear, cue bags, handbags, protective accessories, special clothing, sneakers, shirts, trousers, and sporting products, as well as jogging, tennis, and football series products. It is also involved in the product distribution, import, and export businesses. Munsin Garment Corporation provides its products under the Munsingwear, Le coq sportif, Felix Buhler, McGREGOR, HAZZYS, ACUPUNCTURE, NARA CAMICIE, Eminento, As know as de base, POU DOU DOU, and Danskin brands. The company was founded in 1966 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.munsin.com.tw",
        "market_cap": "Small Cap"
    },
    "2924.TWO": {
        "short_name": "CAYMAN TUNG LING CO LIMITED",
        "long_name": "Cayman Tung Ling Co., Limited",
        "summary": "Cayman Tung Ling Co., Limited researches, develops, manufactures, and sells various baby apparel and supplies in Taiwan and internationally. It operates through General Merchandise Retailing and Restaurant Entertainment segments. The company offers children's clothing, and baby and children's products, including maternity products, breastfeeding supplies, weaning products, cleaning and care products, cotton-fiber products, inner wear, etc. under the Piyopiyo, Abby Bear, and Kaeru brand names. It also provides catering services; franchises Piyo CASA family restaurant; and leases plant. Cayman Tung Ling Co., Limited was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.piyopiyo.com.tw",
        "market_cap": "Small Cap"
    },
    "2926.TWO": {
        "short_name": "THE ESLITE SPECTRUM CORPORATION",
        "long_name": "The Eslite Spectrum Corporation",
        "summary": "The Eslite Spectrum Corporation operates department stores and shopping malls in Taiwan. It also provides real estate analysis, investment planning, and operation management services. The company engages in the engineering service, catering supplies, retail store and equipment businesses; operation of retail outlets; and supply of professional kitchen/laundry equipment, hotel supplies, exquisite cuisine, wine cellars, and catering stores. Further, it operates a hotel under the Songyan Â\u0091Eslite Travel' name. The company operates 43 stores. It provides its planning, design, sales, installation, and after sales services to international tourist hotels and fast food chain stores, coffee chain stores, Chinese and Western restaurants, clubs, sky kitchens, hospitals, and staff restaurants. The company was founded in 2005 and is based in Taipei, Taiwan. The Eslite Spectrum Corporation is a subsidiary of The Eslite Co., Ltd.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.eslitespectrum.com.tw",
        "market_cap": "Mid Cap"
    },
    "2929.TW": {
        "short_name": "TOPBI INTERNATIONAL HOLDINGS LT",
        "long_name": "TOPBI International Holdings Limited",
        "summary": "TOPBI International Holdings Limited designs and sells children's clothing from 1 to 16 years old. The company offers shorts, trousers, shirts, t-shirts, cotton-padded jacket, wind-coat, etc. It has sales points in 16 provinces and 3 municipalities in China. The company was founded in 2002 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.topbi.com.tw",
        "market_cap": "Mid Cap"
    },
    "2937.TWO": {
        "short_name": "GSEVEN CO LTD",
        "long_name": "Gseven Co., Ltd.",
        "summary": "Gseven Co., Ltd. sells consumer electronic products in Taiwan. The company offers audio, TV projection, health and beauty, digital, and life style products, as well as horn and air conditioning systems, Home theaters, and household and kitchen appliances. It also sells its products through department store counters and outlets. The company was founded in 1994 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "802",
        "website": "http://www.gseven.com.tw",
        "market_cap": "Small Cap"
    },
    "2938.TWO": {
        "short_name": "BEDDING WORLD",
        "long_name": "Bedding World Co., Ltd.",
        "summary": "Bedding World Co., Ltd. engages in the wholesale and retail of furniture, bedding, kitchen utensils, and decorative products in Taiwan. It primarily offers mattresses and beddings. The company was founded in 2004 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.beddingworld.com.tw",
        "market_cap": "Small Cap"
    },
    "2942.TWO": {
        "short_name": "Jing Jan",
        "long_name": "Jing-Jan Retail Business Co., Ltd.",
        "summary": "Jing-Jan Retail Business Co., Ltd. owns and operates a shopping mall. The company is based in Taipei, Taiwan. Jing-Jan Retail Business Co., Ltd. is a subsidiary of Radium Life Technology Co., Ltd.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.qsquare.com.tw",
        "market_cap": "Mid Cap"
    },
    "2948.TWO": {
        "short_name": "Bausen",
        "long_name": "Bausen Inc.",
        "summary": "Bausen Inc. provides home improvement materials in Taiwan and internationally. It offers hardwood flooring, engineered flooring, laminate flooring, and WPC composite flooring products; and floor coverings, moldings, cabinet systems, marble and stone countertops, and home improvement materials and accessories. The company is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Home Improvement Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://bausen.com",
        "market_cap": "Small Cap"
    },
    "3252.TWO": {
        "short_name": "HAIWAN INTERNATIONAL DEVELOPMEN",
        "long_name": "Haiwan International Development Co., Ltd",
        "summary": "Haiwan International Development Co., Ltd engages in the development and leasing of residential buildings. It is also involved in the hotel business; and real estate trading activities. The company was formerly known as Haewan International Development Co., Ltd and changed its name to Haiwan International Development Co., Ltd. in 2014. Haiwan International Development Co., Ltd was founded in 1994 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.haiwan.tw",
        "market_cap": "Small Cap"
    },
    "3522.TWO": {
        "short_name": "TOPLUS GLOBAL CO LTD",
        "long_name": "Toplus Global Co., Ltd.",
        "summary": "Toplus Global Co., Ltd. engages in the food and beverage business in Taiwan. It operates 3 seafood restaurants under the DingXian brand; and 8 wedding halls and 1 marine manor under the AmazingHall brand. The company was founded in 2001 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "235",
        "website": "http://www.toplusglobal.com",
        "market_cap": "Small Cap"
    },
    "3552.TWO": {
        "short_name": "TUNG THIH ELECTRONIC CO. LTD.",
        "long_name": "Tung Thih Electronic Co., Ltd.",
        "summary": "Tung Thih Electronic Co., Ltd. manufactures and supplies automotive electronics in Taiwan, Asia, Europe, the United States, Australia, and internationally. It offers ultrasonic parking assistance systems, vehicle anti-theft devices, car door lock actuators, interior rear mirror systems, car video systems, wireless tire pressure monitor systems, body control modules, and vehicle electric peripherals and services. The company was founded in 1979 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.tungthih.com",
        "market_cap": "Large Cap"
    },
    "3607.TW": {
        "short_name": "COXON PRECISE INDUSTRIAL CO. LT",
        "long_name": "Coxon Precise Industrial Co., Ltd",
        "summary": "Coxon Precise Industrial Co., Ltd manufactures and sells engineering plastic products in Taiwan and internationally. It is involved in the designing, mold manufacturing, injection molding, coating and printing, assembling, and optical lens processing activities. The company was incorporated in 1989 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "ZhonglÃ¬",
        "zipcode": "320",
        "website": "http://www.coxongroup.com",
        "market_cap": "Small Cap"
    },
    "3642.TWO": {
        "short_name": "UNITEL HIGH TECHNOLOGY CORPORAT",
        "long_name": "Unitel High Technology Corporation",
        "summary": "Unitel High Technology Corporation produces and sells custom rubber and plastic parts for use in the commercial and industrial electronic products worldwide. The company offers rubber molding products, such as foot pads, earphone covers, microphone covers, waterproof rings, internal mechanism gaskets, self-adhesive rubber etc.; plastic single and double injection products, including buttons, doors, thrust sliding cover, battery cover switch, headphone jack protection cover etc.; button products; and metal, plastic, and rubber heterogeneous material combination products used for mobile phones, laptops, cameras, and other 3C products. The company was formerly known as Unitel Rubber Corporation and changed its name to Unitel High Technology Corporation in June 2006. Unitel High Technology Corporation was founded in 1989 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "114",
        "website": "http://www.unitelgroups.com",
        "market_cap": "Small Cap"
    },
    "4151.TWO": {
        "short_name": "STRENGTH MASTER FINTNESS TECH C",
        "long_name": "Strength Master Fitness Tech Co.,Ltd.",
        "summary": "Strength Master Fitness Tech Co.,Ltd. manufactures and sells fitness equipment in Taiwan. The company offers treadmills, exercise and recumbent bikes, and elliptical trainers. It also provides Interactive Health Partner, a medically-based system; and Fit Plus(Fit +) App and FitPlus(BLE) App, which moves various functions on treadmills and bike consoles to phones or tablets. The company was founded in 1994 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "513",
        "website": "http://www.strengthmaster.com",
        "market_cap": "Small Cap"
    },
    "4304.TWO": {
        "short_name": "SUNVIC TECHNOLOGY CO. LTD.",
        "long_name": "SunVic Technology Co., Ltd.",
        "summary": "SunVic Technology Co., Ltd. engages in the manufacture and sale of EMI shielding laminate and flexible laminated packaging materials in Taiwan. It offers wire and cable materials, including shielding tapes; foil free edge tapes; and polyester, cotton paper, non-woven, and foam polypropylene strips. The company also provides specialized composite films, such as zipper patches; and other films, as well as vacuum-sealed and thermo-forming, and medical packaging bags. In addition, it offers EMI shielding and ESD packaging materials; industrial composite films; and other tapes. The company was formerly known as Taipei Lamination Industries Inc. and changed its name to SunVic Technology Co., Ltd. in April 2007. SunVic Technology Co., Ltd. was founded in 1971 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.sunvic.com.tw",
        "market_cap": "Small Cap"
    },
    "4305.TWO": {
        "short_name": "SHIH-KUEN PLASTICS",
        "long_name": "Shih-Kuen Plastics Co., Ltd.",
        "summary": "Shih-Kuen Plastics Co., Ltd. produces and supplies plastic sheets. The company offers double polished PVC sheets, including super clear, normal clear, and transparent colored; textured embossing PVC sheet, such as textured embossing, translucent textured, and semi-transparent textured; super clear laminated and colored laminated PVC sheets; and UV stabilized outdoor PVC sheets; cold crack resistant PVC sheeting; and fire flame retardant PVC sheets. Its products are used in home and office supplies, construction and industrial, outdoor PVC waterproof covers, and medical applications. The company was founded in 1986 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "72154",
        "website": "http://www.shihkuen.com.tw",
        "market_cap": "Small Cap"
    },
    "4306.TW": {
        "short_name": "YEM CHIO CO LTD",
        "long_name": "Yem Chio Co., Ltd.",
        "summary": "Yem Chio Co., Ltd. engages in the BOPP film, adhesive tape, packaging material, construction, and hotel businesses worldwide. The company offers anti fog, heat sealable, matt, pearlized cavitated, and plain BOPP films; adhesive tapes, such as OPP packaging, super clear packaging, colored packing, and printing tapes, as well as double-sided, stationery, PVC, masking, cloth, aluminum foil, floral, kraft paper tapes; and packaging materials under the Master Package brand. It is also involved in the land development, building construction, real estate, and hotel management businesses, as well as operates hotels. The company was founded in 1977 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.yemchio.com",
        "market_cap": "Mid Cap"
    },
    "4401.TWO": {
        "short_name": "TOUNG LOONG TEXTILE MFG CO",
        "long_name": "Toung Loong Textile MFG. Co., LTD.",
        "summary": "Toung Loong Textile MFG. Co., LTD. operates as a textile manufacturing company in Taiwan. It develops and produces air and draw textured, shape control twist, alpha yarn, and air textured covered yarns, as well as functional synthetic yarn dyes and sewing threads. The company was founded in 1960 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "220",
        "website": "http://www.tloong.com.tw",
        "market_cap": "Mid Cap"
    },
    "4417.TWO": {
        "short_name": "KING CHOU MARINE TECHNOLOGY CO ",
        "long_name": "King Chou Marine Technology Co., Ltd.",
        "summary": "King Chou Marine Technology Co., Ltd. manufactures and sells netting products for the marine industries under the King Net brand name worldwide. The company offers purse seine, trawl, Danish seine, gill and trammel, trap, and set nets; long line, twine, and rope products; marine hardware products, such as cable clamps, purse rings, snap rings, steel triangles, choker hooks, alloy galv. connecting links, strong C-rings, ring scoopers, splice needles, Samson splicing kits, chains, floats, swivels, and hooks; fish farming and cage nets; and other nets, such as safety, flower, camouflage, and melon nets. It also provides a range of sports nets for soccer, volleyball, baseball, and tennis. The company was formerly known as King Chou Fish Net Mfg. Co., Ltd. and changed its name to King Chou Marine Technology Co., Ltd. in 2002. King Chou Marine Technology Co., Ltd. was founded in 1978 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "806",
        "website": "http://www.king-net.com.tw/en/",
        "market_cap": "Mid Cap"
    },
    "4419.TWO": {
        "short_name": "ENSURE GLOBAL CORP LTD",
        "long_name": "Ensure Global Corp., Ltd.",
        "summary": "Ensure Global Corp., Ltd. manufactures and sells spun-like fabrics and yarns in Taiwan. The company offers air and draw textured yarns; knitted fabrics; and mirror surface wiping clothes. It also provides cotton-like fabric and microfiber products. In addition, the company offers grating, twill, and interweaving products. Further, it provides wind breakers, shirts, knitting sports wears, casual pants, and durable towels. The company was founded in 1991 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "521",
        "website": "http://www.metaltech.com.tw",
        "market_cap": "Small Cap"
    },
    "4420.TWO": {
        "short_name": "KWANG MING SILK MILL CO",
        "long_name": "Kwang Ming Silk Mill Co., Ltd.",
        "summary": "Kwang Ming Silk Mill Co., Ltd. engages in the production and sale of polyester processing yarn. The company offers composite fabrics, special functionality fabrics, synthetic fiber fabrics, and general garments materials, as well as man-made fiber products. It is also involved in real estate leasing and trading business. The company's products are used for fashion clothing, environmental protection functional fabrics, outdoor leisure fabrics, and home decoration, as well as cloth for shoe materials. The company is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.kwangming.com",
        "market_cap": "Small Cap"
    },
    "4426.TW": {
        "short_name": "LI CHENG ENTERPRISE CO. LTD",
        "long_name": "Li Cheng Enterprise Co., Ltd.",
        "summary": "Li Cheng Enterprise Co., Ltd. manufactures and sells 3D spacer fabrics worldwide. Its products are used in shoe materials, such as bags, hats, underwear bras, general garments, mattresses, sports Equipment, medical, and automotive materials, etc. The company also provides polyester and nylon monofilaments; and other materials, such as PP and others. Li Cheng Enterprise Co., Ltd. founded 1992 and is based in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliou",
        "zipcode": "640",
        "website": "http://www.li-cheng.com.tw",
        "market_cap": "Mid Cap"
    },
    "4429.TWO": {
        "short_name": "G FUN INDUSTRIAL CORPORATION",
        "long_name": "GFun Industrial Corporation",
        "summary": "GFun Industrial Corporation manufactures and sells coated and laminated functional fabrics in Taiwan. It offers various functional membranes and fabrics; and develops various types of wick, windproof, water-repellent, anti-UV, anti-bacterial, and abrasion-resistant functional fabrics. The company was founded in 1999 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32849",
        "website": "http://www.gtex.com.tw",
        "market_cap": "Small Cap"
    },
    "4430.TWO": {
        "short_name": "YAO I FABRIC CO. LTD.",
        "long_name": "Yao I Fabric Co., Ltd.",
        "summary": "Yao I Fabric Co., Ltd. manufactures and sells filament and spun products in Taiwan and internationally. Its products include various kinds of fishing, tennis, badminton racket, and cutting lines; industrial wires, mesh cloth chairs, pet mats, breathable beds, knitted cotton car seats, car seats with blankets, and automotive sound-absorbing cotton materials; and environmentally friendly stretch cotton, firewood, stretch cotton, and electronic supplies blankets, as well as shoes with cotton insulation class, and bedding and sofa with a stretch cotton. The company was founded in 1973 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "508",
        "website": "http://www.yaoi.com.tw",
        "market_cap": "Small Cap"
    },
    "4432.TWO": {
        "short_name": "HAKERS ENTERPRISE CO LTD",
        "long_name": "Hakers Enterprise Co., Ltd.",
        "summary": "Hakers Enterprise Co., Ltd. researches, develops, manufactures, and markets garments and other related textile products in Taiwan and internationally. It offers sportswear products, including swim trunks, shorts, jackets, and trousers. The company was founded in 1986 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24872",
        "website": "http://www.haksport.com",
        "market_cap": "Small Cap"
    },
    "4433.TWO": {
        "short_name": "SINGTEX INDUSTRIAL CO LTD",
        "long_name": "Singtex Industrial Co., Ltd.",
        "summary": "Singtex Industrial Co., Ltd. engages in the research and development, and sale of eco-friendly functional textile products in Taiwan. It offers functional fabrics; and functional, specialty, and comfort yarns. The company was founded in 1989 is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24892",
        "website": "http://www.singtex.com",
        "market_cap": "Small Cap"
    },
    "4438.TW": {
        "short_name": "QUANG VIET ENTERPRISE CO LTD",
        "long_name": "Quang Viet Enterprise Co., Ltd.",
        "summary": "Quang Viet Enterprise Co., Ltd. manufactures and supplies garments for outdoor sports in Taiwan and internationally. The company was founded in 1996 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.qve.com.tw",
        "market_cap": "Large Cap"
    },
    "4523.TWO": {
        "short_name": "TAIWAN CALSONIC CO. LTD.",
        "long_name": "Taiwan Calsonic Co., Ltd.",
        "summary": "Taiwan Calsonic Co., Ltd. manufactures and sells car air conditioning products, electronics, and other products in Taiwan. The company offers car air conditioning systems, such as unified central panels, air conditioning controllers, driver alert systems, night vision systems, body control modules, condensers, evaporators, blowers, motors, inter coolers, water cooled radiators, and chip coolers; and engineering products, including vacuum, air, and no fuse breakers, as well as electromagnetic contractors, inverters, programmable controllers, energy saving systems, robots, control devices, and thin film extension products. It also provides power distribution equipment and industry automatic control products, as well as industrial robot/electronic process equipment. The company was founded in 1987 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.twncal.com.tw",
        "market_cap": "Small Cap"
    },
    "4528.TWO": {
        "short_name": "CHIAN HSING FORGING INDUSTRIAL ",
        "long_name": "Chian Hsing Forging Industrial Co., Ltd.",
        "summary": "Chian Hsing Forging Industrial Co., Ltd. manufactures and sells various forged products in Taiwan. Its forged products include hardware, bicycle, motorbike, automobile, and track vehicle parts, as well as industrial engineering vehicle components and other products. The company offers auto parts comprising C.V. joints and driving elements of front wheel; inner races; inner race crosses; bearing cups, pistons, and housings; transmission parts; transmission bearing spang products; transmission joint gears; mandrils, rear axis, and core axis of the generator; air conditioning belt pulleys; bevel gears; magnetic poles and driving gears; motor brake parts; aluminum alloy forging parts that include ammonia cans for auto air-conditioners; flange bases; and pipes, excavator teethes, and tubes. It also provides assorted hardware parts, including impactors, saddles, pneumatic toolings, tone hole parts, and rod couplings, as well as parts of sports goods, which include cranks, high-pressure joints, high-tension bolts/nuts, alloy bearing forgings, and delivering tube forgings. In addition, the company offers motorcycle parts, such as gear shafts, gear blanks, start gears, transmission shafts, and ammonia cans for auto air-conditioners; starting gear and clutch gear forged work products; shaft and axle parts; and clutches, tube yokes, and chain gears. Further, it provides rail parts, which comprise tie plates. The company was formerly known as Hsieh Hsing Iron Factory and changed its name to Chian Hsing Forging Industrial Co., Ltd. in 1980. Chian Hsing Forging Industrial Co., Ltd. was founded in 1971 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.ch-forging.com.tw",
        "market_cap": "Mid Cap"
    },
    "4535.TWO": {
        "short_name": "FINE BLANKING & TOOL CO LTD",
        "long_name": "Fine Blanking & Tool Co., Ltd",
        "summary": "Fine Blanking & Tool Co., Ltd. produces and sells car and motorcycle parts in Taiwan. The company's primary products include precision stamping products, motorcycle and bicycle disc brakes, motorcycle start gears, car seat recliners, car brake parts, automotive safety shackles, and steam locomotive seats. It also provides tubes, seat belt reels, tongues, tappet and shims, frames for airbag, hand brakes, blanking gears, sectors and latches, slide stand, foot support and rest, saddles, handle bar and clamps, triple clamps, ABS phonic wheels, slope plates, bicycle parts, and engine gears and other high precision metal components. In addition, the company offers clutch and gas brake pedal, RAEV, push and pull mechanism, steering assembly, and rack and pinion, as well as medical equipment, sporting goods, and computer parts. Fine Blanking & Tool Co., Ltd. was founded in 1988 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.fineblanking.com.tw",
        "market_cap": "Mid Cap"
    },
    "4536.TW": {
        "short_name": "TOPKEY CORPORATION",
        "long_name": "Topkey Corporation",
        "summary": "Topkey Corporation designs, develops, and manufactures medical components, aviation seatbacks, and bike components in Taiwan. The company offers bicycle frame sets and other accessories; safety products, including helmets; and carbon composite rackets and tennis rackets. It also provides manufacture aircraft composite parts; and medical parts, such It as composite CT tables and accessories, as well as thermoplastic resin and fiber reinforced thermoplastic products. The company was founded in 1980 and is based in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung City",
        "zipcode": "40850",
        "website": "http://www.topkey.com.tw",
        "market_cap": "Large Cap"
    },
    "4543.TWO": {
        "short_name": "MAN ZAI INDUSTRIAL CO LTD",
        "long_name": "Man Zai Industrial Co., Ltd.",
        "summary": "Man Zai Industrial Co., Ltd. manufactures and sells air-conditioner components for vehicles worldwide. The company offers auto air-con modules, including condenser units, evaporator units, and heater cores; automobile and motorcycle aluminum radiators for cooling systems, such as radiator units and oil coolers; and thermal-electric cooling modules comprising thermal modules for CPU, thermal syphon modules, and liquid cooling modules, as well as water-cooled modules for use in CPU, VGA, LED, and auto-electric cooling modules. It also provides aluminum extrusion products that include fittings/brackets/pipes, racket frames, OPC drums, computer heat sinks, and bicycle frames; and air-con and refrigeration products. Man Zai Industrial Co., Ltd. was founded in 1984 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "718",
        "website": "http://www.manzai.com.tw",
        "market_cap": "Small Cap"
    },
    "4551.TW": {
        "short_name": "GLOBAL PMX CO LTD",
        "long_name": "Global PMX Co., Ltd.",
        "summary": "Global PMX Co., Ltd. manufactures, processes, and sells precision metal components for automotive products, hard disk drives, medical equipment, and various industrial products primarily in the United States, Mainland China, and Japan It offers automotive brake safety systems and precision parts, fuel injection systems, steering systems, thermos regulator systems, medical devices and precision parts, semiconductor equipment flow controller systems, cloud and hard disk precision parts, industrial and optical products, precision metal parts, etc. The company provides precision die, mold standard parts, construction hardware, plumbing products, heating products, hardware components, electronic components, digital cameras, precision dies, and mold standard parts. In addition, it offers computer hardware and software products; and engages in various activities, including industrial plastic products manufacturing, other non-metal products manufacturing, iron and steel casting, iron and steel forging, steel reworks, aluminum reworks, etc. Global PMX Co., Ltd. was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22102",
        "website": "http://www.global.com.tw",
        "market_cap": "Large Cap"
    },
    "4557.TW": {
        "short_name": "YUSIN HOLDING CORP",
        "long_name": "Yusin Holding Corp.",
        "summary": "Yusin Holding Corp. develops, manufactures, processes, trades, and sells vehicle's brake systems in Asia, North America, Central and South America, Europe, and internationally. Its products include brake master cylinders, brake cylinders, clutch master cylinders, clutch cylinders, brake calipers, boosters, brake pads, and other related components for the automobile's brake system. The company also manufactures and sells various vehicles parts, as well as involved in the general investment activities. Yusin Holding Corp. was founded in 1992 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": null,
        "website": "http://www.yusin.com",
        "market_cap": "Mid Cap"
    },
    "4950.TWO": {
        "short_name": "MUTTO OPTRONICS CORPORATION",
        "long_name": "Mutto Optronics Corporation",
        "summary": "Mutto Optronics Corporation, together with its subsidiaries, manufactures and sells stainless steel kitchen utensils and refined cutlery sets in the United States, China, Taiwan, and internationally. It is also involved in OEM/ODM knife manufacturing businesses; and investment activities. The company was founded in 2008 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106430",
        "website": "http://www.muttoinc.com",
        "market_cap": "Small Cap"
    },
    "4972.TWO": {
        "short_name": "TONS LIGHTOLOGY INC",
        "long_name": "Tons Lightology Inc.",
        "summary": "Tons Lightology Inc., together with its subsidiaries, designs and manufactures commercial lighting products in Taiwan, rest of Asia, Europe, Oceania, and internationally. The company offers light-emitting diode, high-intensity discharge, fluorescent, and halogen lighting products. Its indoor lighting products include tracks and structures, luminaires for tracks, recessed downlights, frameless and adjustable downlights, assemblies, surface-mounted ceiling lights, pendant lights, wall lights, display spotlights, linear lights, task lights, and micro track lights. The company's outdoor lighting products comprise outdoor downlights, outdoor ceiling lights, outdoor wall lights, in-ground lights, projectors, flood lights, bollards, and outdoor accessories. Its products are used for architectural, retail display, residential, entertainment, outdoor area and commercial/industrial lighting applications. Tons Lightology Inc. was founded in 1992 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "23845",
        "website": "http://www.tonslight.com",
        "market_cap": "Small Cap"
    },
    "5102.TWO": {
        "short_name": "FU-CHIAN TIRE CO",
        "long_name": "Fu Chian Tire Co.,Ltd.",
        "summary": "Fu Chian Tire Co.,Ltd. manufactures and sells retread tires in Taiwan. The company also offers high and low temperature tread rubber products, gums, backing products, rubber flooring products, silicone products, rubber compounds, and other rubber products. It is also involved in the provision of rubber manufacturing machines, as well as in the import and export activities. Fu Chian Tire Co.,Ltd. was founded in 1949 and is based in Yuanlin City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yuanlin",
        "zipcode": null,
        "website": "http://www.fuchian.com.tw",
        "market_cap": "Small Cap"
    },
    "5263.TWO": {
        "short_name": "BROGENT TECHNOLOGIES INC",
        "long_name": "Brogent Technologies Inc.",
        "summary": "Brogent Technologies Inc., a technology company, provides digital content creation services in Taiwan. Its business primarily includes software and hardware research and development, manufacturing and system integration, theater design, and planning, and construction capabilities. The company's products include i-Ride, a flying theater built on six degrees of freedom motion platform; m-Ride, a flying theater built on the design of 180-degree rotating gondolas; d-Ride, a media based interactive dark ride solution for gaming; and GestureMagic that offers effect-driven 4D experience in gaming. It also provides v-Ride 360, a cylinder screen that provides 360-degree panorama balloon ride; t-Ride, a Jurassic age ride; and Q-Ride, an ultrarealistic ocean VR adventure. Brogent Technologies Inc. was founded in 2001 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "80661",
        "website": "http://www.brogent.com",
        "market_cap": "Mid Cap"
    },
    "5301.TWO": {
        "short_name": "CJW INTERNATIONAL CO LTD",
        "long_name": "CJW International Co., Ltd.",
        "summary": "CJW International Co., Ltd. designs and sells jewelry products, and tobacco and alcohol in Taiwan. The company offers diamond, jade, and coral jewelry products. It is also involved in the wholesale and retail of beauty products. The company was founded in 1967 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Luxury Goods",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.cjwtaiwan.com",
        "market_cap": "Small Cap"
    },
    "5306.TWO": {
        "short_name": "KMC (KUEI MENG) INTERNATIONAL I",
        "long_name": "KMC (Kuei Meng) International Inc.",
        "summary": "KMC (Kuei Meng) International Inc. manufactures and sells various types of chains, motorcycle components, and vehicle components in Asia, Europe, and the United States. The company offers bicycle chains, such as road bike, mountain bike, BMX, E-bike, and rust buster chain series products, as well as EcoProTech chains. It also provides motorcycle chain and gears, including standard driving, heavy duty, cam, and silent chain series products, as well as standard driving sprockets, and chain and sprocket kits. In addition, the company offers automobile timing systems and garage door openers. Further, it is involved in investing activities. The company was formerly known as CNet Technology Inc. and changed its name to KMC (Kuei Meng) International Inc. in July 2012. KMC (Kuei Meng) International Inc. was founded in 1977 and is headquartered in Tainan City, Taiwan. KMC (Kuei Meng) International Inc. is a subsidiary of KMC Transton Industries Limited.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "710",
        "website": "http://www.kmc-international.com",
        "market_cap": "Large Cap"
    },
    "5364.TWO": {
        "short_name": "LEALEA HOTELS & RESORTS CO LTD",
        "long_name": "Lealea Hotels & Resorts Co., Ltd.",
        "summary": "Lealea Hotels & Resorts Co., Ltd. operates hotel under the LEALEA GARDEN HOTEL in Taiwan. The company was formerly known as I-Future Co., Ltd. Lealea Hotels & Resorts Co., Ltd. is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.lealeahotel.com/en/about/",
        "market_cap": "Small Cap"
    },
    "5475.TWO": {
        "short_name": "GLOTECH INDUSTRIAL CORP",
        "long_name": "Glotech Industrial Corp.",
        "summary": "Glotech Industrial Corp. produces and sells e-glass fiber fabrics in Taiwan and internationally. It offers fiber glass fabrics and yarns that are used as composite materials. The company was formerly known as A Johnson Composite Inc. and changed its name to Glotech Industrial Corp. in May 2011. Glotech Industrial Corp. was founded in 1997 and is headquartered in Yangmei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yangmei",
        "zipcode": "32669",
        "website": "http://www.glotechgf.com",
        "market_cap": "Mid Cap"
    },
    "5530.TWO": {
        "short_name": "LUNGYEN LIFE SERVICE CO LTD",
        "long_name": "Lungyen Life Service Corporation",
        "summary": "Lungyen Life Service Corporation provides funeral services in Taiwan. It is also involved in the development and lease of interment premises; sale and rental of residence and business buildings; invests in securities; provision of architecture and civil engineering services; and sale of cremated remains storage facilities. The company was formerly known as Dahan Development Corp. Lungyen Life Service Corporation was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.lungyengroup.com.tw",
        "market_cap": "Large Cap"
    },
    "5701.TWO": {
        "short_name": "JANFUSUN FANCYWORLD CORP",
        "long_name": "Janfusun Fancyworld Corp.",
        "summary": "Janfusun Fancyworld Corp. operates theme parks and holiday hotels in Taiwan. It also operates department stores, as well as an online store for ticket and reservation services. The company was founded in 1986 and is based in Yunlin, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yunlin",
        "zipcode": null,
        "website": "http://www.janfusun.com.tw",
        "market_cap": "Small Cap"
    },
    "5703.TWO": {
        "short_name": "THE LANDIS TAIPEI HOTEL CO. LTD",
        "long_name": "The Landis Taipei Hotel Co., Ltd",
        "summary": "The Landis Taipei Hotel Co., Ltd operates a hotel in Taipei City, Taiwan. The company operates The Landis Taipei Hotel, which offers superior and deluxe rooms, disable rooms, executive and corner suites, dining and meeting rooms, banquet halls, and wedding and travel packages, as well as fitness center, business center, and lounge facilities. It also engages in restaurant, cafe, and bar businesses. The company was founded in 1977 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://taipei.landishotelsresorts.com",
        "market_cap": "Small Cap"
    },
    "5704.TWO": {
        "short_name": "HOTEL ROYAL CHIHPEN",
        "long_name": "Hotel Royal Chihpen",
        "summary": "Hotel Royal Chihpen operates a resort hotel in Taiwan. Its resort hotel comprises 183 guest accommodations, as well as offers recreational facilities and amenities. The company is based in Taitung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taitung",
        "zipcode": "354",
        "website": "http://www.hotel-royal-chihpen.com.tw",
        "market_cap": "Small Cap"
    },
    "5706.TW": {
        "short_name": "PHOENIX TOURS INTL INC",
        "long_name": "Phoenix Tours International, Inc.",
        "summary": "Phoenix Tours International, Inc., together with its subsidiaries, provides travel agency services in Taiwan. The company offers foreign group travel, mini and free tour, cruise vacation, international tickets, domestic and international reservations, Taiwan tourism, rail service, online consultation, domestic and international group travel, as well as free travel, passport, and visas for various countries. It also provides Phoenix Portable Cloud App. The company was founded in 1957 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "104",
        "website": "http://www.travel.com.tw",
        "market_cap": "Mid Cap"
    },
    "5903.TWO": {
        "short_name": "TAIWAN FAMILYMART CO",
        "long_name": "Taiwan FamilyMart Co., Ltd.",
        "summary": "Taiwan FamilyMart Co., Ltd. operates various convenience stores in Taiwan and internationally. The company engages in the provision of warehouse tally services; electronic information services; system integrated services; sales and services of computer software and related equipment; logistics activities; manufacturing of food; and trucking, staffing, and packaging services. In addition, it wholesales and retails books and magazines, and household merchandise. As of December 31, 2019, the company operated 3,548 stores in Taiwan; and 2,801 stores in China. Taiwan FamilyMart Co., Ltd. was founded in 1988 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "107",
        "website": "http://www.family.com.tw",
        "market_cap": "Large Cap"
    },
    "5904.TWO": {
        "short_name": "POYA INTERNATIONAL CO LTD",
        "long_name": "POYA International Co., Ltd.",
        "summary": "POYA International Co., Ltd. operates personal beauty and daily merchandise stores in Taiwan. The company's stores offer makeup products and cosmetics, jewelries, daily goods, snacks, fashion hosieries, hardware products, underwear and pajamas, etc. As of April 30, 2020, it has operated 239 stores. The company was formerly known as POYA Department Store Co., Ltd. and changed its name to POYA International Co., Ltd. in June 2000. POYA International Co., Ltd. was founded in 1997 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.poya.com.tw",
        "market_cap": "Large Cap"
    },
    "5905.TWO": {
        "short_name": "NAN REN LAKE LEISURE AMUSEMENT ",
        "long_name": "Nan Ren Lake Leisure Amusement Co., Ltd.",
        "summary": "Nan Ren Lake Leisure Amusement Co., Ltd. provides leisure and recreation facilities in Taiwan. It operates the National Museum of Marine Biology and Aquarium, an underwater tunnel, a resort and sleepover, dining service area, and underground food shopping mall, as well as Nargo electronic mall, an online shopping platform. The company was founded in 1989 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "802",
        "website": "http://www.nanrenhu.com.tw",
        "market_cap": "Mid Cap"
    },
    "6222.TWO": {
        "short_name": "SOARING TECHNOLOGY CO",
        "long_name": "Soaring Technology Co.,Ltd.",
        "summary": "Soaring Technology Co.,Ltd. manufactures and sells liquid crystal displays and lighting products in Taiwan and internationally. It offers LED bulbs and lamps, LED tubes, and LED indoor and outdoor fixtures, as well as dimmers, switches, and plugs. The company was founded in 1986 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22161",
        "website": "http://www.sotac.com.tw",
        "market_cap": "Small Cap"
    },
    "6584.TWO": {
        "short_name": "NAN JUEN",
        "long_name": "Nan Juen International Co., Ltd.",
        "summary": "Nan Juen International Co., Ltd. manufactures and trades in steel-ball bearing slides and other products in Taiwan, the Americas, and internationally. The company was formerly known as Nan Juen Industrial Corporation and changed its name to Nan Juen International Co., Ltd. in September 1996. Nan Juen International Co., Ltd. in 1984 and is headquartered in New Taipei City, Taiwan. Nan Juen International Co., Ltd. is a subsidiary of Repon Industrial Corporation.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "239",
        "website": "http://www.repongroup.com",
        "market_cap": "Small Cap"
    },
    "6670.TW": {
        "short_name": "FUSHENG PRECISION CO LTD",
        "long_name": "FuSheng Precision Co., Ltd.",
        "summary": "Fusheng Precision Co., Ltd. engages in the contract manufacturing of golf equipment primarily in Japan, the United States, and internationally. The company offers golf club heads, graphite shafts, and assembled clubs, as well as club head accessories; baseball bats; and precision casting parts for aerospace, automobile, and industrial uses. It also manufactures and sells medical equipment; sells titanium tableware and kitchenware; and researches, develops, and manufactures hardware, plastics, printing of packaging, and vacuum technology products. In addition, the company engages in the metal products import and export business; anodizing process; and vacuum coating processing. Fusheng Precision Co., Ltd. was founded in 1953 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.fusheng-precision.com",
        "market_cap": "Large Cap"
    },
    "6740.TWO": {
        "short_name": "Mobix",
        "long_name": "Mobix Corporation",
        "summary": "Mobix Corporation operates mobile based e-commerce platform in Taiwan. The company was founded in 2016 and is based in Taipei, Taiwan. Mobix Corporation is a subsidiary of Kuobrothers Corp.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.mobix.com.tw",
        "market_cap": "Small Cap"
    },
    "6804.TWO": {
        "short_name": "Axman",
        "long_name": "Axman Enterprise Co., Ltd.",
        "summary": "Axman Enterprise Co., Ltd. designs, develops, manufactures, tests, and sells bicycles. It provides road bikes, mountain bikes, and carbon fiber frames. The company was founded in 1985 and is based in Changhua County, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "515",
        "website": "http://www.axman.com.tw",
        "market_cap": "Small Cap"
    },
    "7566.TWO": {
        "short_name": "AYDC",
        "long_name": "Argo Yachts Development Co.,Ltd.",
        "summary": "Argo Yachts Development Co., Ltd. engages in the operation of water recreation activities and ship leasing business in Taiwan. The company was founded in 2003 is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "70967",
        "website": null,
        "market_cap": "Mid Cap"
    },
    "8044.TWO": {
        "short_name": "PCHOME ONLINE INC.",
        "long_name": "PChome Online Inc.",
        "summary": "PChome Online Inc. provides e-commerce and portal services in China and internationally. It operates through E-Commerce-Sales, Market Place, and Other segments. The company operates PChome 24h Shopping, PChome Shopping, and PChome Global Shopping Websites. It also operates portals that provide a range of network services, including news platforms, stock markets, email, Kaza personal blog, news, travel, car-buying, customized photo album, search channels, etc., as well as online adverting services, such as display advertising and display network. In addition, the company offers type II telecommunications, magazine publication, international trade and investment, online payment processing, travel agency, information, transportation and logistics, clothing sales, information processing, electronic information, and Internet services. PChome Online Inc. was founded in 1996 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.pchome.com.tw",
        "market_cap": "Large Cap"
    },
    "8107.TWO": {
        "short_name": "TAYIH KENMOS AUTO PARTS CO LTD",
        "long_name": "Tayih Kenmos Auto parts Co., Ltd.",
        "summary": "Tayih Kenmos Auto parts Co., Ltd. researches, develops, manufactures, and sells automotive blow molding and filtration parts in Taiwan and internationally. It offers automobile cabin air filters, automatic transmission filters, home air purifier filters, face masks, and other products; running boards; and pickup sport bars, tonneau covers, and other exteriors. The company was founded in 1998 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "745",
        "website": "http://www.kenmos.com.tw",
        "market_cap": "Small Cap"
    },
    "8255.TWO": {
        "short_name": "ACTRON TECHNOLOGY CORP",
        "long_name": "Actron Technology Corporation",
        "summary": "Actron Technology Corporation designs, develops, manufactures, and sells electronic components of vehicles for automakers worldwide. It offers high and low cup, and JP pressfit diodes; dish diodes; and TO-220, standard, micro, and jumbo button diodes. The company also provides alternators, regulators, and anti-lock brake system controls. Actron Technology Corporation was founded in 1998 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": "http://www.actron.com.tw",
        "market_cap": "Large Cap"
    },
    "8359.TWO": {
        "short_name": "CASHBOX",
        "long_name": "Cashbox Partyworld Co., Ltd.",
        "summary": "Cashbox Partyworld Co., Ltd. primarily engages in the karaoke business in Taiwan and China. The company conducts its operations through Services Industries segment. It offers karaoke entertainment services. The company is also involved the distribution and trade of karaoke equipment and supplies; sale of food and beverages; retail of stationery, toys, entertainment products, books, and tobacco; and management consulting business. It operates 12 branches and 16 direct stores. The company was formerly known as Cashbox Consulting Co., Ltd. and changed its name to Cashbox Partyworld Co., Ltd. in September 2000. Cashbox Partyworld Co., Ltd. was founded in 1986 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.cashboxparty.com",
        "market_cap": "Large Cap"
    },
    "8433.TWO": {
        "short_name": "BON FAME CO LTD",
        "long_name": "Bon Fame Co., Ltd.",
        "summary": "Bon Fame Co., Ltd. operates in fashion market in Taiwan. It offers hair accessories, jewelry, hairstyling products, beauty tools, bags and purses, fashion accessories, and novelty products, as well as event products, such as kid's masks. The company was founded in 1985 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.bonfame.com",
        "market_cap": "Mid Cap"
    },
    "8454.TW": {
        "short_name": "MOMO COM INC",
        "long_name": "momo.com Inc.",
        "summary": "momo.com Inc. engages in the software design, TV and radio production, radio and TV program distribution, radio and TV advertising, issuing of magazine, and retailing businesses in Taiwan and internationally. It operates through two segments, Television and Magazine Department, and Internet Department. It also offers TV home shopping, online shopping, mail order service, travel service, and property and life insurance sales service. momo.com Inc. was founded in 2004 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11493",
        "website": "http://www.fmt.com.tw",
        "market_cap": "Large Cap"
    },
    "8464.TW": {
        "short_name": "NIEN MADE ENTERPRISE CO LTD",
        "long_name": "Nien Made Enterprise Co., LTD.",
        "summary": "Nien Made Enterprise Co., LTD. engages in the research, development, design, manufacture, and sale of various types of window coverings and related components in the United States, Europe, and internationally. The company operates through two segments, Window Coverings and Other. It offers various types of blinds, shutters, shades, and related components; wood blinds and shutter semi-products; cellular, roman, and roller shades; plastic blinds and accessories; and chair covers. The company also designs, manufactures, and sells automated appliances and PVC tubes. In addition, it also engages in manufacturing and selling dehumidifiers and air purifiers; the provision of logistics support services and window coverings documentation processing services; and trading and servicing in window coverings. The company was formerly known as Huan Qiu Shi Jing Co., Ltd. and changed its name to Nien Made Enterprise Co., LTD. in March 2008. Nien Made Enterprise Co., LTD. was founded in 1974 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40878",
        "website": "http://www.nienmade.com.tw",
        "market_cap": "Large Cap"
    },
    "8472.TWO": {
        "short_name": "GOMAJI CORP LTD",
        "long_name": "GOMAJI Corp., LTD",
        "summary": "GOMAJI Corp., LTD provides e-commerce and advertising services in Taiwan. The company was founded in 1999 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.gomaji.com",
        "market_cap": "Small Cap"
    },
    "8477.TWO": {
        "short_name": "KUOBROTHERS CORP",
        "long_name": "Kuobrothers Corp.",
        "summary": "Kuobrothers Corp. operates B2C e-commerce business under the Living Bazaar name In Taiwan. The company provides online shopping platform for daily consumables, electric apparatuses, household commodities, storage and decoration devices, and delicacies. It also operates online trading platforms under the MobiX and MySport brand names. The company was founded in 2012 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.kuobrothers.com",
        "market_cap": "Small Cap"
    },
    "8482.TW": {
        "short_name": "SHANE GLOBAL HOLDING INC",
        "long_name": "Shane Global Holding Inc.",
        "summary": "Shane Global Holding Inc. engages in the research and development, production, and sale of indoor furniture. The company offers sofas, beds, footrests, dining chairs, etc.; and other products comprising indoor furniture accessories, fluff-filled toys and leather garments, etc. It sells its products to retail stores in North America. The company was founded in 2014 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "106",
        "website": "http://www.shaneglobal.com.tw",
        "market_cap": "Mid Cap"
    },
    "8916.TWO": {
        "short_name": "KWONG LUNG ENTERPRISE",
        "long_name": "Kwong Lung Enterprise Co., Ltd.",
        "summary": "Kwong Lung Enterprise Co., Ltd. manufactures and sells apparel in Taiwan, China, Vietnam, and Japan. The company operates through Apparel department, Down Material Department, and Home Textile Department segments. It offers down and bedding; wholesale of outdoor supplies, household wares, clothing, and related packaging materials; food; and import and export of goods and technology. The company provides down products, including natural down, water repellent down, antibacterial deodorant down, color down, and flame retardant, as well as Thermobrid plus products for use in outdoor and home textile. In addition, it provides clothing products, such as snowboard wear, skiing wear, mountain climbing jackets, seamless wind and rain-proof jackets, biking wear, sportswear, jeans, casual jackets and pants, etc. Further, it manufactures winter quilts, cushions, seating pads, sofas, pillows, sleeping bags, gloves, and home decoration products. It also offers bedding products under the Kong lung brand. Kwong Lung Enterprise Co., Ltd. was founded in 1966 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10682",
        "website": "http://www.klf.com.tw",
        "market_cap": "Mid Cap"
    },
    "8916A.TWO": {
        "short_name": "KWONG LUNG ENTERPRISE",
        "long_name": "Kwong Lung Enterprise Co., Ltd.",
        "summary": "Kwong Lung Enterprise Co., Ltd. manufactures and sells apparel in Taiwan, China, Vietnam, and Japan. The company operates through Apparel department, Down Material Department, and Home Textile Department segments. It offers down and bedding; wholesale of outdoor supplies, household wares, clothing, and related packaging materials; food; and import and export of goods and technology. The company provides down products, including natural down, water repellent down, antibacterial deodorant down, color down, and flame retardant, as well as Thermobrid plus products for use in outdoor and home textile. In addition, it provides clothing products, such as snowboard wear, skiing wear, mountain climbing jackets, seamless wind and rain-proof jackets, biking wear, sportswear, jeans, casual jackets and pants, etc. Further, it manufactures winter quilts, cushions, seating pads, sofas, pillows, sleeping bags, gloves, and home decoration products. It also offers bedding products under the Kong lung brand. Kwong Lung Enterprise Co., Ltd. was founded in 1966 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10682",
        "website": "http://www.klf.com.tw",
        "market_cap": "Mid Cap"
    },
    "8932.TWO": {
        "short_name": "MAX ZIPPER CO. LTD.",
        "long_name": "Max Zipper Co., Ltd.",
        "summary": "Max Zipper Co., Ltd. manufactures and markets zippers worldwide. It offers nylon, delrin, metal, invisible, specialized, water repellent, heat transfer, pattern tape, coil vacuum, satin tape, chameleon, reflective, spear teach, weave tape, delrin inkjet, and contrast slit zippers; invisible, nylon, delrin, metal, and tape attachable sliders; plastic and spring lock sliders; and metal, plastic, diamante, cord, leather, woven, and stone pullers. The company also provides special slider treatment, such as pattern coating and double plating services. Max Zipper Co., Ltd. offers its products under the MAX brand. The company was formerly known as Horng Dah Zippers Co. Ltd. and changed its name to Max Zipper Co., Ltd. in September 2009. Max Zipper Co., Ltd. was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.maxzip.com.tw",
        "market_cap": "Small Cap"
    },
    "8933.TWO": {
        "short_name": "IDEAL BIKE CORP",
        "long_name": "Ideal Bike Corporation",
        "summary": "Ideal Bike Corporation manufactures and sells bicycles worldwide. The company was founded in 1980 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "435",
        "website": "http://www.idealbike.com.tw",
        "market_cap": "Mid Cap"
    },
    "8938.TWO": {
        "short_name": "ADVANCED INTERNATIONAL MULTITEC",
        "long_name": "Advanced International Multitech Co., Ltd.",
        "summary": "Advanced International Multitech Co., Ltd. manufactures and sells golf club heads, shafts, golf club sets, golf balls, carbon fiber components, aviation products, and composite materials worldwide. The company offers various golf products, including metal woods, irons/wedges, putters, graphite shafts, and club assemblies; carbon fiber bicycle components, such as frames, forks, and parts; DIZO bicycles; and investment casting services for components of aircraft interior, bike, industrial, and hardware in titanium and stainless steel. It also provides composite products, such as aircraft interiors comprising seat backrests, seat pads, and seat arm rests; automotive products consisting of engine covers, spoilers, and driving shafts; electronic device protectors, such as laptop carbon covers and pad soft goods; and industrial structures, including robot arm accessories, frame tubes, and assistive devices. In addition, the company offers prepreg products. Advanced International Multitech Co., Ltd. was founded in 1987 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.adgroup.com.tw",
        "market_cap": "Large Cap"
    },
    "8940.TW": {
        "short_name": "NEW PALACE INTERNATIONAL CO",
        "long_name": "New Palace International Co., Ltd.",
        "summary": "New Palace International Co., Ltd. operates restaurants. The company provides food, wedding banquet, and catering services. New Palace International Co., Ltd. was founded in 1971 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.newpalace.com.tw",
        "market_cap": "Small Cap"
    },
    "9904.TW": {
        "short_name": "POU CHEN",
        "long_name": "Pou Chen Corporation",
        "summary": "Pou Chen Corporation manufactures and sells athletic, casual, and outdoor shoes in Taiwan and internationally. It operates as an original equipment manufacturer for international brands, as well as original design manufacturer for athletic footwear, leisure shoes, and sports sandals; and manufacturer for footwear accessories, apparels, and others. The company also engages in the retailing of sporting goods and brand licensing business. In addition, it is involved in the real estate development activities; and tourist hotel business. Pou Chen Corporation was founded in 1969 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40764",
        "website": "http://www.pouchen.com",
        "market_cap": "Large Cap"
    },
    "9910.TW": {
        "short_name": "FENG TAY ENTERPRISE CO LTD",
        "long_name": "Feng Tay Enterprises Co., Ltd.",
        "summary": "Feng Tay Enterprises Co., Ltd. produces and sells athletic shoes worldwide. The company was founded in 1971 and is headquartered in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliou",
        "zipcode": "64064",
        "website": "http://www.fengtay.com",
        "market_cap": "Large Cap"
    },
    "9911.TW": {
        "short_name": "TAIWAN SAKURA",
        "long_name": "Taiwan Sakura Corporation",
        "summary": "Taiwan Sakura Corporation manufactures and trades in kitchen appliances in Taiwan and internationally. The company offers gas cookers, water heaters and filters, furniture, dish dryers, building materials, metal hardware parts, sports equipment, electric hand tools, range hoods, sanitary equipment, and bathroom products, as well as cabinet of kitchen systems. It also leases real estate properties, as well as trades in various kitchen electrical appliances. The company sells its products through distributors and sales offices. Taiwan Sakura Corporation was founded in 1978 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.sakura.com.tw",
        "market_cap": "Large Cap"
    },
    "9914.TW": {
        "short_name": "MERIDA INDUSTRY",
        "long_name": "Merida Industry Co., Ltd.",
        "summary": "Merida Industry Co., Ltd. manufactures and sells bicycles and related parts in Taiwan, China, Hong Kong, and Europe. It offers machine bicycles, e-bikes, fitness bikes, road bikes, and trekking and city bikes, as well as bikes for youth, kids, and women. It also provides speedometers; handlebars, stems, grips and bartapes, pedals and quickreleases, saddles, seatposts and clamps, and EQ and spare parts; bags, backpacks, brackets, lights, pumps, bottles and cages, tools, and locks; and apparel, such as jerseys, shorts, jackets and vests, gloves, socks, and sunglasses. Merida Industry Co., Ltd. was founded in 1972 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "515",
        "website": "http://www.merida.tw",
        "market_cap": "Large Cap"
    },
    "9921.TW": {
        "short_name": "GIANT MANUFACTURING CO",
        "long_name": "Giant Manufacturing Co., Ltd.",
        "summary": "Giant Manufacturing Co., Ltd. manufactures and sells bicycles, electric bicycles, and related parts worldwide. It operates through Bicycle, Materials, and Others segments. The company offers on-road, x-road, off-road, youth, rider gear, bike gear, and service gear bicycles. It markets its products through approximately 12,000 retail stores. The company was founded in 1972 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40763",
        "website": "http://www.giant-bicycles.com",
        "market_cap": "Large Cap"
    },
    "9935.TW": {
        "short_name": "CHING FENG HOME FASHIONS CO LTD",
        "long_name": "Ching Feng Home Fashions Co.,Ltd",
        "summary": "Ching Feng Home Fashions Co.,Ltd designs, develops, manufactures, and sells home decor products in Taiwan and internationally. It offers aluminum venetian, faux wood venetian, and vinyl venetian and vertical blinds; roman, pleated, and cellular shades; and coral fleece throws and blankets, flannel throws and blankets, faux fur throws, dÃ©cor throws, and comforters. The company also provides decor pillows; and bath products, such as shower curtains and accessories. In addition, it offers beddings, table linens, cushions, and kitchen appliances. The company was founded in 1974 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.chingfeng.com",
        "market_cap": "Mid Cap"
    },
    "9938.TW": {
        "short_name": "TAIWAN PAIHO",
        "long_name": "Taiwan Paiho Limited",
        "summary": "Taiwan Paiho Limited manufactures and sells touch fastener, webbings, elastic, easy tapes, and fabrics in Taiwan and internationally. The company offers general footwear and webbings for garments, shoelaces, and pull strings; touch fasteners; knitted elastic, flat woven elastic, jacquard elastic, and multi-directional textile with elasticity; easy tape products for applications in paper diapers, medical equipment, computer pipelines, outdoor sporting goods, car seats and interiors, and other accessories; bamboo charcoal yarn, bamboo charcoal insulation cotton, recycled pet yarn, and other processed products; powder coating products for use in furniture, appliances, etc.; and jacquard digital woven fabric and jacquard engineered mesh that is used in fabrics for shoes, garments, and hats and bags. It also sells houses and apartment buildings. In addition, the company engages in the production and marketing of computerized embroidery, consumer electronic accessories, chemical fibers, and masks and non-woven products; commercial property management; planning consultant, sale, development, and leasing of real estate; and provision of design decoration services. The company was formerly known as San Ho Hsin Limited and changed its name to Taiwan Paiho Limited in 1986. Taiwan Paiho Limited was founded in 1979 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "508",
        "website": "http://www.paiho.com",
        "market_cap": "Large Cap"
    },
    "9939.TW": {
        "short_name": "TAIWAN HON CHUAN ENTERPRISE",
        "long_name": "Taiwan Hon Chuan Enterprise Co., Ltd.",
        "summary": "Taiwan Hon Chuan Enterprise Co., Ltd. manufactures and sells beverage packaging materials for beverage manufacturers in Taiwan and internationally. The company offers aluminum, plastic, and metal lug caps; PET bottles/perform products, label products, and tobacco and liquor packaging products; caps, bottles, and labelling production equipment; and LDPE shrinkable films. It also provides hot fill beverage, aseptic beverage, and bottled water filling OEM services. The company was formerly known as Hon Chuan Metal Development Co., Ltd. and changed its name to Taiwan Hon Chuan Enterprise Co., Ltd. in 1999. Taiwan Hon Chuan Enterprise Co., Ltd. was founded in 1969 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": null,
        "website": "http://www.honchuan.com",
        "market_cap": "Large Cap"
    },
    "9942.TW": {
        "short_name": "NAK SEALING TECHNOLOGIES CORP",
        "long_name": "NAK Sealing Technologies Corporation",
        "summary": "NAK Sealing Technologies Corporation, together with its subsidiaries, manufactures and sells oil seals and technical sealing products for various applications worldwide. It offers automotive seals, including engine, transmission, power steering, axle, shock absorber, and motor seals; and industrial seals comprising pump, gear reducer/gearbox, motor, power tool, robotic arm, wind turbine, and washing machine seals. The company also provides agriculture, construction, and mining seals, such as piston, rod, wiper, and axle/hub seals; and other seals includes V-rings, axial face seals, bonded seals, sleeves, rings, rubber molded parts, and O-ring kits and cords. It serves automotive, industrial, and hydraulic and pneumatic, as well as agricultural, and construction and mining equipment sectors. The company was formerly known as Mao Shun Co. and changed its name to NAK Sealing Technologies Corporation in 2002. NAK Sealing Technologies Corporation was founded in 1976 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54065",
        "website": "http://www.nak.com.tw",
        "market_cap": "Mid Cap"
    },
    "9943.TW": {
        "short_name": "HOLIDAY ENTERTAINMENT CO",
        "long_name": "Holiday Entertainment Co.,Ltd",
        "summary": "Holiday Entertainment Co., Ltd. provides karaokes and audiovisual equipment in Taiwan. The company operates through Audiovisual Equipment and Copyright Works businesses. It also engages in the management and consultancy for karaoke, as well as restaurant operations. In addition, the company distributes and sells audiovisual equipment and supplies, including boxes. As of December 31, 2013, it operated 52 branches. The company was founded in 1993 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": null,
        "website": "http://www.holiday.com.tw",
        "market_cap": "Mid Cap"
    },
    "9944.TW": {
        "short_name": "SHINIH ENTERPRISE CO LTD",
        "long_name": "Shinih Enterprise Co., Ltd.",
        "summary": "Shinih Enterprise Co., Ltd. manufactures and sells non-woven products in Taiwan and internationally. It provides functional insulation products under the THERMOLITE and CLOMAX brand names; non-woven clothes under the Tyvek name; and paddings, such as vertical folding technology and thermobond fiberfill products. The company also offers various automobile carpets comprising head linings, luggage mats, rear trunk upper hoods, rear trunk mats, wheel cover mats, central floor carpets, floor mats, door panels, and bonnet coverings. In addition, it provides spun bound fabric products, such as electrical materials, agriculture cover fabrics, building construction fabrics, and floor fabrics, as well as medical products, daily usage products, and dye printing non-woven fabric products. Further, the company offers various bedding products under the DACRON and CLOMAX brand names. Shinih Enterprise Co., Ltd. has strategic alliances with Invista. The company was founded in 1962 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33452",
        "website": "http://www.shinih.com.tw",
        "market_cap": "Mid Cap"
    },
    "9950.TWO": {
        "short_name": "EMINENT LUGGAGE CORPORATION",
        "long_name": "Eminent Luggage Corporation",
        "summary": "Eminent Luggage Corporation designs, manufactures, and sells luggage products worldwide. The company provides a range of ABS, PP, PC, nylon, and polyester cases; bags and leisure products; and hard shell and beauty cases, soft luggage, trolleys, suitcase sets, business suitcases, and laptop backpacks. It offers its products under the Eminent, Case-Star, Mine, and Probeetle brands. Eminent Luggage Corporation was founded in 1979 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "711",
        "website": "http://www.eminent.com",
        "market_cap": "Small Cap"
    },
    "9951.TWO": {
        "short_name": "MACAUTO INDUSTRIAL CO",
        "long_name": "Macauto Industrial Co., Ltd.",
        "summary": "Macauto Industrial Co., Ltd. engages in the manufacture and sale of automotive sunshade products. The company offers automotive interiors, such as Sunshades for roof systems, luggage cover systems, side and rear window shades, wind deflectors, divider net systems, and mobile phone/tablet holder. It also provides garden tools, including cordless electric mower, electric wheelbarrows, and robotic golf caddy cart. Macauto Industrial Co., Ltd. was founded in 1979 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "710",
        "website": "http://www.macauto-group.com",
        "market_cap": "Mid Cap"
    },
    "9960.TWO": {
        "short_name": "DACOME INTERNATIONAL LTD",
        "long_name": "Dacome International Ltd.",
        "summary": "Dacome International Ltd. distributes golf brands in Taiwan, the United States, and Japan. The company offers balls, golf products, footwear, bags, apparel, hats, belts, gloves, accessories, audiovisual books, team gifts, and gift certificates, as well as training supplies. It also markets its products through its Website, golfshop.com.tw; and provides golf equipment bidding, golf courses booking, golf tours at home and abroad, golf skills teaching, handicap system, etc. The company was founded in 2000 and is headquartered in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": null,
        "website": "http://www.golfshop.com.tw",
        "market_cap": "Small Cap"
    },
    "CMKI": {
        "short_name": "CMK GAMING INTERNATIONAL INC",
        "long_name": "CMK Gaming International, Inc.",
        "summary": "CMK Gaming International, Inc. develops and manufactures casino games and 3D animation products. The company is based in Taichung, Taiwan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Gambling",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "403",
        "website": null,
        "market_cap": "Small Cap"
    },
    "MUGH": {
        "short_name": "MU GLOBAL HOLDING LIMITED",
        "long_name": "Mu Global Holding Limited",
        "summary": "Mu Global Holding Limited, a beauty and wellness company, provides non-surgical spa and wellness services, and spa related products in China. The company's spa services include bedrock bathing/ hot stone bath and quartz therapy. It also offers NVB scent diffusers and mini water purifiers. The company was founded in 2018 and is based in Taipei City, Taiwan.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "103",
        "website": null,
        "market_cap": "Small Cap"
    }
}