{
    "1419.TW": {
        "short_name": "SHINKONG TEXTILE CO. LTD.",
        "long_name": "Shinkong Textile Co.,Ltd.",
        "summary": "Shinkong Textile Co.,Ltd. operates as a natural fibers manufacturer. It offers digital print, dyed fabric, reflective yarn, flannel, and bi-stretch fabric services for synthetic fibers. The company also provides base layers, mid layers, and outer wear knits; and wool textile products. Shinkong Textile Co.,Ltd. was founded in 1955 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.sktextile.com.tw",
        "market_cap": "Small Cap"
    },
    "1473.TW": {
        "short_name": "TAINAN ENTERPRISES",
        "long_name": "Tainan Enterprises Co.,Ltd",
        "summary": "Tainan Enterprises Co., Ltd. operates as a garment OEM manufacturer in Taiwan and internationally. Its principal products include pants, shirts, dresses, skirts, jackets, vests, and coats, as well as tops, shorts, and denim and active wear products. The company offers its products under the TONY WEAR, TONY JEANS, TW.DESIGN, Emely, Emely Sweetie, and RUE 58 brand names. It primarily serves casual apparel retailers. The company was founded in 1961 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.tai-nan.com",
        "market_cap": "Micro Cap"
    },
    "1477.TW": {
        "short_name": "MAKALOT INDUSTRIAL CO",
        "long_name": "Makalot Industrial Co., Ltd.",
        "summary": "Makalot Industrial Co., Ltd. engages in the design, manufacture, and sale of garments for men, women, and children in Taiwan. It offers fashion clothing; sports clothing; sleepwear, including long and short pants, T-shirts, dresses, shirts, inner pajamas, sports suits, jackets, etc.; and ready-to-wear clothing, active wear, loungewear, and gift sets. The company also provides material development, supplier search and management, style design, fashion trend provision, manufacturing, research and development, and logistics and distribution services. It also exports its products to the United States and internationally. The company was founded in 1990 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110",
        "website": "http://www.makalot.com.tw",
        "market_cap": "Mid Cap"
    },
    "2916.TWO": {
        "short_name": "MUNSIN GARMENT CORP",
        "long_name": "Munsin Garment Corporation",
        "summary": "Munsin Garment Corporation manufactures and trades in various knitwear garments in Taiwan. The company offers golf apparel, lightweight sportswear, professional bicycles, equestrian sports products, casual wear, cue bags, handbags, protective accessories, special clothing, sneakers, shirts, trousers, and sporting products, as well as jogging, tennis, and football series products. It is also involved in the product distribution, import, and export businesses. Munsin Garment Corporation provides its products under the Munsingwear, Le coq sportif, Felix Buhler, McGREGOR, HAZZYS, ACUPUNCTURE, NARA CAMICIE, Eminento, As know as de base, POU DOU DOU, and Danskin brands. The company was founded in 1966 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.munsin.com.tw",
        "market_cap": "Nano Cap"
    },
    "2924.TWO": {
        "short_name": "CAYMAN TUNG LING CO LIMITED",
        "long_name": "Cayman Tung Ling Co., Limited",
        "summary": "Cayman Tung Ling Co., Limited researches, develops, manufactures, and sells various baby apparel and supplies in Taiwan and internationally. It operates through General Merchandise Retailing and Restaurant Entertainment segments. The company offers children's clothing, and baby and children's products, including maternity products, breastfeeding supplies, weaning products, cleaning and care products, cotton-fiber products, inner wear, etc. under the Piyopiyo, Abby Bear, and Kaeru brand names. It also provides catering services; franchises Piyo CASA family restaurant; and leases plant. Cayman Tung Ling Co., Limited was founded in 1988 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "115",
        "website": "http://www.piyopiyo.com.tw",
        "market_cap": "Nano Cap"
    },
    "2929.TW": {
        "short_name": "TOPBI INTERNATIONAL HOLDINGS LT",
        "long_name": "TOPBI International Holdings Limited",
        "summary": "TOPBI International Holdings Limited designs and sells children's clothing from 1 to 16 years old. The company offers shorts, trousers, shirts, t-shirts, cotton-padded jacket, wind-coat, etc. It has sales points in 16 provinces and 3 municipalities in China. The company was founded in 2002 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "11494",
        "website": "http://www.topbi.com.tw",
        "market_cap": "Micro Cap"
    },
    "4432.TWO": {
        "short_name": "HAKERS ENTERPRISE CO LTD",
        "long_name": "Hakers Enterprise Co., Ltd.",
        "summary": "Hakers Enterprise Co., Ltd. researches, develops, manufactures, and markets garments and other related textile products in Taiwan and internationally. It offers sportswear products, including swim trunks, shorts, jackets, and trousers. The company was founded in 1986 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24872",
        "website": "http://www.haksport.com",
        "market_cap": "Nano Cap"
    },
    "4438.TW": {
        "short_name": "QUANG VIET ENTERPRISE CO LTD",
        "long_name": "Quang Viet Enterprise Co., Ltd.",
        "summary": "Quang Viet Enterprise Co., Ltd. manufactures and supplies garments for outdoor sports in Taiwan and internationally. The company was founded in 1996 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.qve.com.tw",
        "market_cap": "Small Cap"
    },
    "8932.TWO": {
        "short_name": "MAX ZIPPER CO. LTD.",
        "long_name": "Max Zipper Co., Ltd.",
        "summary": "Max Zipper Co., Ltd. manufactures and markets zippers worldwide. It offers nylon, delrin, metal, invisible, specialized, water repellent, heat transfer, pattern tape, coil vacuum, satin tape, chameleon, reflective, spear teach, weave tape, delrin inkjet, and contrast slit zippers; invisible, nylon, delrin, metal, and tape attachable sliders; plastic and spring lock sliders; and metal, plastic, diamante, cord, leather, woven, and stone pullers. The company also provides special slider treatment, such as pattern coating and double plating services. Max Zipper Co., Ltd. offers its products under the MAX brand. The company was formerly known as Horng Dah Zippers Co. Ltd. and changed its name to Max Zipper Co., Ltd. in September 2009. Max Zipper Co., Ltd. was founded in 1978 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.maxzip.com.tw",
        "market_cap": "Nano Cap"
    }
}