{
    "2201.TW": {
        "short_name": "YULON MOTOR CO",
        "long_name": "Yulon Motor Company Ltd.",
        "summary": "Yulon Motor Company Ltd. manufactures and markets automobiles and related parts in Taiwan, China, and the Philippines. The company operates through Brand, Supporting, Horizontal, Taiwan Retail, China Retail, and Others segments. It also imports, exports, sells, retails, maintains, repairs, leases, and trades in cars and parts; manages basketball team and related services; and provides investment, general advertising, general advertising planning, taxi, temporary labor, product design, towing, publication, property insurance, management consulting, real estate leasing, buildings and greening, construction project contracting, and factory leasing services. In addition, the company engages in the supply and provision of information software; retail trade of spare parts of vehicles; provision of secondhand cars and car related products, and installment financing services for cars and trucks; metal casting and related business; wholesale and retail sale of batteries; construction industry business; brokerage of electric vehicles; and sale, maintenance, and repair of heavy vehicles and related products. Further, it provides installment loans of consumer goods; consulting services on cars, electronics, textiles, and related products; consulting services for advanced technology, products, and equipment import; computer software maintenance and computer system integration services; loans to car dealers for car purchases; secondhand vehicle consultation and vehicle agency services; and sale, brokerage, and auction services. Additionally, the company engages in the financial lease of equipment; and sale of information software and telecommunications equipment. The company was formerly known as Yulon Machinery Manufacturing Co., Ltd. and changed its name to Yulon Motor Company Ltd. in September 1960. Yulon Motor Company Ltd. was founded in 1953 and is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "2206.TW": {
        "short_name": "SANYANG MOTOR CO LTD",
        "long_name": "Sanyang Motor Co., Ltd.",
        "summary": "Sanyang Motor Co., Ltd. manufactures and sells motorcycles and automobiles in Taiwan and internationally. The company offers its products under the SYM brand. It also exports various self-developed machines, and molds and jigs, as well as provides professional services related to prototype parts processing to auto markets. The company was formerly known as Sanyang Industry Co., Ltd. and changed its name to Sanyang Motor Co., Ltd. in January 2015. Sanyang Motor Co., Ltd. was founded in 1954 and is headquartered in Hukou, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Hukou"
    },
    "2227.TW": {
        "short_name": "YULON NISSAN MOTOR CO.LTD",
        "long_name": "Yulon Nissan Motor Co., Ltd",
        "summary": "Yulon Nissan Motor Co., Ltd. engages in the research, design, development, and sale of vehicles in Taiwan and internationally. The company offers sedan, RV vehicles, and commercial vehicles, as well as related components. It is also involved in the investment activities. The company is headquartered in Miaoli, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Miaoli"
    },
    "2246.TWO": {
        "short_name": "KGET",
        "long_name": "Kaison Green Energy Technology Co., LTD",
        "summary": "Kaison Green Energy Technology Co., LTD researches and develops, produces, assembles, and sells electric vehicles. The company is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    }
}