{
    "1506.TW": {
        "short_name": "RIGHT WAY INDUSTRIAL",
        "long_name": "Right Way Industrial Co.,Ltd",
        "summary": "Right Way Industrial Co.,Ltd, together with its subsidiaries, manufactures and sells automobile parts worldwide. The company offers various casting and forging parts with steel or aluminum alloy materials, including pistons, connecting rods, steering knuckles and system parts, suspension control arms, industrial compressor housings, industrial pump chambers, die casting parts, cast iron parts, balance shafts, and suspension components for vehicle and industrial applications. It also provides engine connecting-rods, precision machining parts, ball joints, steering rod assy, suspension control arms, and stabilizer links; and housings, mounts, and supporting brackets. The company serves original equipment manufacturers, suppliers, and aftermarket customers. Right Way Industrial Co.,Ltd was founded in 1964 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "1521.TW": {
        "short_name": "TA YIH INDUSTRIAL CO",
        "long_name": "Ta Yih Industrial Co., Ltd.",
        "summary": "Ta Yih Industrial Co., Ltd. engages in the manufacture, sale, and trading of vehicle and auto-bicycle parts in Taiwan and internationally. The company offers automotive lighting products, including head, rear, deck lid, front turn signal, DRL, and fog lamps; and motorcycle lighting products comprising front turn signal, head, and rear lamps. It also provides aerospace lighting products, such as search lights, night vision bezels, ball transfer units, battery cases, cab reading lights, and position lights. In addition, the company offers railway lighting products comprising railways head, tail, indication, saloon LED and fluorescent, LED cab and gooseneck reading, marker, and flashing lights, as well as light control units, aluminum extrusion parts, LED train run number signs, smart electronic ballasts, and LED door open indicators. Further, it processes and sells marine lighting devices and transport components. The company was founded in 1964 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Tainan City"
    },
    "1524.TW": {
        "short_name": "GORDON AUTO BODY PARTS CO",
        "long_name": "Gordon Auto Body Parts Co., Ltd.",
        "summary": "Gordon Auto Body Parts Co., Ltd. manufactures and sells automotive sheet metal replacement crash parts worldwide. The company offers fenders, hoods, bumpers, doors, radiator supports, and other products. It also provides AC condensers, handles, mirrors, side panels, tail lamps, tailgates, fender flares, head lamps, inner fenders, steel bumpers, and step bumpers. The company was founded in 1986 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "1525.TW": {
        "short_name": "KIANSHEN CORP",
        "long_name": "Kian Shen Corporation",
        "summary": "Kian Shen Corporation manufactures and sells automobile parts. It offers truck/bus frames, electric scooter frames, stamping parts, rear body parts, dies and jigs, suspension components, and high tensile steel products. The company was founded in 1955 and is based in Yangmei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Yangmei"
    },
    "1526.TW": {
        "short_name": "SUN RACE STURMEY-ARCHER INC",
        "long_name": "Sun Race Sturmey-Archer Inc.",
        "summary": "Sun Race Sturmey-Archer Inc. provides bicycle components worldwide. Its products include bottom brackets, brakes, cassettes, chains, free wheels, front cranksets, front and rear derailleurs, hubs, outer casings and inner cables, shifters, and service parts. The company was formerly known as Roots Enterprise Co., Ltd. and changed its name to Sun Race Sturmey-Archer Inc. in 2001. Sun Race Sturmey-Archer Inc. was founded in 1902 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taoyuan City"
    },
    "1536.TW": {
        "short_name": "HOTA INDUSTRIAL MFG CO",
        "long_name": "Hota Industrial Mfg. Co., Ltd.",
        "summary": "Hota Industrial Mfg. Co., Ltd. designs, manufactures, and sells auto transmission components. It offers transmission products, including planetary gear sets, transfer case components, differentials, output shaft for trucks, hydraulic/water pump gears, output shafts/gears, input and output shafts, motorcycle rear shafts and gear boxes, input gears, and transmission shafts and gear sets for agricultural machinery, as well as gears for compressors, hydraulic pump shafts, forks and sleeves for trucks, motorcycle gears and components, reduction gear sets, and transmission components. The company also provides electric wheelchairs and scooters, and all-terrain vehicles. In addition, it offers gear hobbing, gear shaving, and chamfering machines, as well as optical profile measuring instruments. The company was formerly known as Hota Industrial Development Co., Ltd. and changed its name to Hota Industrial Mfg. Co., Ltd. in 1990. Hota Industrial Mfg. Co., Ltd. was founded in 1966 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taichung"
    },
    "1568.TW": {
        "short_name": "TSANG YOW INDUSTRIAL CO",
        "long_name": "Tsang Yow Industrial Co.,Ltd.",
        "summary": "Tsang Yow Industrial Co.,Ltd. manufactures and supplies transmission system components and assemblies worldwide. It offers automatic and manual transmission, off highway machinery, torque converter, and viscous coupling parts; clutch parts for heavy-duty trucks; and gear boxes. The company was founded in 1985 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Chiayi"
    },
    "1587.TW": {
        "short_name": "CRYOMAX COOLING SYSTEM CORP",
        "long_name": "Cryomax Cooling System Corp.",
        "summary": "Cryomax Cooling System Corp. manufactures and sells automotive radiators in Taiwan and internationally. It offers copper and aluminum radiators for passenger cars, military vehicles, commercial vehicles/trucks, and forklifts. The company was founded in 1984 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "2101.TW": {
        "short_name": "NAN KANG RUBBER TIRE",
        "long_name": "Nankang Rubber Tire Corp.,Ltd.",
        "summary": "Nankang Rubber Tire Corp.,Ltd. produces and sells tires in Taiwan and internationally. It offers passenger car, SUV and 4X4 WD, winter, van, motorsport, light truck, and bus and trailer tires. The company was founded in 1959 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    },
    "2105.TW": {
        "short_name": "CHENG SHIN RUBBER INDUSTRIES",
        "long_name": "Cheng Shin Rubber Ind. Co., Ltd.",
        "summary": "Cheng Shin Rubber Ind. Co., Ltd., together with subsidiaries, processes, manufactures, and trades in bicycle tires, electrical vehicle tires, reclaimed rubbers, rubbers and resins, and other rubber products. It also manufactures and trades in various rubber products and relevant rubber machinery. The company researches, develops, tests, processes, manufactures, exhibits, imports, exports, wholesales, and retails tires for motorcycles, industrial and agricultural mechanical vehicles, passenger cars, trucks, tanks, and bicycles. It also operates a technical center; produces, sells, and maintains models; retails accessories for rubber tires; provides container transportation services; manages racing tracks; and offers warehouse logistic services. In addition, the company provides automobile accessory and related products; rubber-coated bead and belt steel cords; radial tires; and tubes. Further, it is involved in the construction and trading of employees' housings. The company operates in Taiwan, China, the United States, and internationally. Cheng Shin Rubber Ind. Co., Ltd. was founded in 1967 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "2106.TW": {
        "short_name": "KENDA RUBBER INDUSTRY",
        "long_name": "Kenda Rubber Industrial Co. Ltd.",
        "summary": "Kenda Rubber Industrial Co. Ltd. designs and sells tires in Taiwan. It offers automotive, bicycle, wheelchair, power sport, and turf/trailer/specialty tires. The company sells its tires through distributors and retailers. Kenda Rubber Industrial Co. Ltd. was founded in 1962 and is based in Yuanlin, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "2109.TW": {
        "short_name": "HWA FONG RUBBER INDUSTRIAL CO",
        "long_name": "Hwa Fong Rubber Ind. Co., Ltd.",
        "summary": "Hwa Fong Rubber Ind. Co., Ltd. manufactures and sells rubber and tires in Taiwan and internationally. It offers bicycle, motorcycle, scooter, agricultural, automotive, industrial, truck, bus, and light truck tires and tubes; ATV tires; and special trailer, light truck, and passenger car radial tires. The company was formerly known as Hwa Fong Ind. Co., Ltd. and changed its name to Hwa Fong Rubber Ind. Co., Ltd. in 1970. Hwa Fong Rubber Ind. Co., Ltd. was founded in 1945 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "2114.TW": {
        "short_name": "HSIN YUNG CHIEN CO",
        "long_name": "Hsin Yung Chien Co., Ltd.",
        "summary": "Hsin Yung Chien Co., Ltd. manufactures and sells rubber conveyor belts, rubber sheets, and hot-pressing cushion pads and composite materials in Taiwan and internationally. The company's product portfolio includes straight warp, light duty, Chevron, Kevlar, and steel cord conveyor belts; specialty conveyor belts include heat, oil, flame, abrasion, cold, and chemical resistant conveyor belts; and pipe, rip stop, side wall, and EP/NN conveyor belts, as well as seal belts and bucket elevator belts under the KING brand. Its conveyor belts are used in a range of applications comprising mining, steel, aviation, agriculture, logistics, and pier automatic production. The company also provides electronic level hot and solar panel pressing cushion pads under the Silieet brand name. In addition, it offers composite materials for car parts, bicycle parts, and customer goods under the NEWsheet brand name. The company was formerly known as Hsin Yung Chien Industrial Co., Ltd. and changed its name to Hsin Yung Chien Co., Ltd. in 2003. Hsin Yung Chien Co., Ltd. was founded in 1964 and is based in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Nantou City"
    },
    "2115.TW": {
        "short_name": "LU HAI HOLDING CORP",
        "long_name": "Luhai Holding Corp.",
        "summary": "Luhai Holding Corp. manufactures and sells tire valves and accessories worldwide. It offers TPMS valves; valves for bicycles, electric bikes, motorcycles, passenger cars/light trucks, trucks/buses, and agricultural/OTR applications; and valve accessories, such as valve core products, valve caps, hexagon nuts, washers, grommets and O-rings, rim nuts, and sleeves. The company also provides valve core and mounting tools; tire pressure detection products, including tire pressure and pen type tire pressure gauges; inflating equipment comprising air chucks, clip-on air chucks, and connectors; and rigid, bent, plastic, and flexible valve extensions, as well as holders. In addition, it offers wheel balance weights and tools; tire repair accessories consisting of skivers, stitchers, scrapers, repair tools, and tire repair units; and tire repair kits. The company serves manufacturers in the tire, automobile, truck, and agriculture vehicle industries. Luhai Holding Corp. was founded in 1980 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "2228.TW": {
        "short_name": "IRON FORCE INDUSTRIAL CO LTD",
        "long_name": "Iron Force Industrial Co., Ltd.",
        "summary": "Iron Force Industrial Co., Ltd. engages in the manufacturing and trading of auto parts, and display and houseware products in Taiwan and internationally. Its auto parts include airbag inflators and precision metal parts for automotive safety systems; steering columns/shafts and diesel engine cooling pipes; high precision metal tubes for seatbelt retractor/pre-tensioner systems; automated machines; and special surface treatments, as well as related components. The company also provides OEM and ODM of customized store display fixtures; display systems design; and retail store design, as well as metal wire related products. In addition, it offers display fixtures, clothes hangers, and mannequins, as well as provides logistic services. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2231.TW": {
        "short_name": "CUB ELECPARTS INC.",
        "long_name": "Cub Elecparts Inc.",
        "summary": "Cub Elecparts Inc. manufactures and supplies automobile electrical and electronic parts in Taiwan. The company offers advanced driver assistance systems; aftermarket service parts comprising sensors and other parts; switches, such as ignition lock, power window, combination, and headlight; OEM products; and tire pressure monitoring sensors. Cub Elecparts Inc. was founded in 1979 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "2241.TW": {
        "short_name": "AMULAIRE THERMAL TECHNOLOGY INC",
        "long_name": "Amulaire Thermal Technology, Inc.",
        "summary": "Amulaire Thermal Technology, Inc. provides cooling fins for green electronic devices in Taiwan, Europe, North America, and Japan. The company offers customized products; metal injection moldings, lower flow resistance, and lighter weight designs; forgings for lower flow resistance and lighter cooling designs; and thermal modules and inverter parts, and heat dissipation systems and high power electronic system parts. Amulaire Thermal Technology, Inc. was founded in 2011 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2442.TW": {
        "short_name": "JEAN CO LTD",
        "long_name": "Jean Co.,Ltd",
        "summary": "Jean Co.,Ltd engages in the design, manufacture, sale, and after-sale service of automotive multimedia systems and telematics, and android smart home systems. The company offers in-car entertainment systems, including flip-down monitors, head rest monitors, and 2DIN monitors. It also engages in real estate business. In addition, the company provides property management services. Jean Co.,Ltd was founded in 1986 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "2497.TW": {
        "short_name": "E-LEAD ELECTRONIC CO",
        "long_name": "E-Lead Electronic Co., Ltd.",
        "summary": "E-Lead Electronic Co., Ltd. designs and manufactures electronics devices for automotive industry in Taiwan and internationally. The company provides head unit infotainment/navigation systems, rear seat entertainment systems, automotive systems and digital dashboards, and advanced driving assistance systems. It also provides HUD products, including one piece windshield and combiner type and mirror HUD, and floating optical displays; project air products comprising project air computers, game, universal, and video; and eLeadrive, a solution for supporting the Internet of vehicles. E-Lead Electronic Co., Ltd. was founded in 1983 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Changhua"
    },
    "4306.TW": {
        "short_name": "YEM CHIO CO LTD",
        "long_name": "Yem Chio Co., Ltd.",
        "summary": "Yem Chio Co., Ltd. engages in the biaxially oriented polypropylene film, adhesive tape, packaging material, construction, hotel, and petrochemical businesses worldwide. The company offers petrochemicals, such as acrylic acid; and plain, matt, pearlized cavitated, anti-fog, and heat sealable biaxially oriented polypropylene films. It also provides adhesive tapes, including OPP, super clear, and colored packing tapes, as well as printing tapes; and double-sided, stationery, PVC, masking, cloth, aluminum foil, floral, and Kraft paper tapes. In addition, the company engages in the land development, building construction, real estate, and hotel management businesses. Yem Chio Co., Ltd. was founded in 1977 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4551.TW": {
        "short_name": "GLOBAL PMX CO LTD",
        "long_name": "Global PMX Co., Ltd.",
        "summary": "Global PMX Co., Ltd. manufactures, processes, and sells precision metal components for automotive products, hard disk drives, medical equipment, and various industrial products primarily in the United States, Mainland China, and Japan It offers automotive brake safety systems and precision parts, fuel injection systems, steering systems, thermos regulator systems, medical devices and precision parts, semiconductor equipment flow controller systems, cloud and hard disk precision parts, industrial and optical products, precision metal parts, etc. The company provides precision die, mold standard parts, construction hardware, plumbing products, heating products, hardware components, electronic components, digital cameras, precision dies, and mold standard parts. In addition, it offers computer hardware and software products; and engages in various activities, including industrial plastic products manufacturing, other non-metal products manufacturing, iron and steel casting, iron and steel forging, steel reworks, aluminum reworks, etc. Global PMX Co., Ltd. was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "4557.TW": {
        "short_name": "YUSIN HOLDING CORP",
        "long_name": "Yusin Holding Corp.",
        "summary": "Yusin Holding Corp. develops, manufactures, processes, trades, and sells vehicle's brake systems in Asia, North America, Central and South America, Europe, and internationally. Its products include brake master cylinders, brake cylinders, clutch master cylinders, clutch cylinders, brake calipers, boosters, brake pads, and other related components for the automobile's brake system. The company also manufactures and sells various vehicles parts, as well as involved in the general investment activities. Yusin Holding Corp. was founded in 1992 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Chiayi"
    },
    "9942.TW": {
        "short_name": "NAK SEALING TECHNOLOGIES CORP",
        "long_name": "NAK Sealing Technologies Corporation",
        "summary": "NAK Sealing Technologies Corporation, together with its subsidiaries, manufactures and sells oil seals and technical sealing products for various applications worldwide. It offers automotive seals, including engine, transmission, power steering, axle, shock absorber, and motor seals; and industrial seals comprising pump, gear reducer/gearbox, motor, power tool, robotic arm, wind turbine, and washing machine seals. The company also provides agriculture, construction, and mining seals, such as piston, rod, wiper, and axle/hub seals; and other seals includes V-rings, axial face seals, bonded seals, sleeves, rings, rubber molded parts, and O-ring kits and cords. It serves automotive, industrial, and hydraulic and pneumatic, as well as agricultural, and construction and mining equipment sectors. The company was formerly known as Mao Shun Co. and changed its name to NAK Sealing Technologies Corporation in 2002. NAK Sealing Technologies Corporation was founded in 1976 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Nantou City"
    }
}