{
    "1336.TWO": {
        "short_name": "TAIHAN PRECISION TECHNOLOGY CO ",
        "long_name": "Taihan Precision Technology Co., Ltd.",
        "summary": "Taihan Precision Technology Co., Ltd. designs, manufactures, and sells precision molds primarily for system integrators in worldwide. It offers plastic injection products; surface treatment products, such as painting, NCVM, and IMD products; and assembly/installation and welding products and services. The company's products comprise MFP related components; keyboard frames, keyboards, and handset key tops; mobility products, including handset housings, net book housings, DSC housings, and plastic components of digital photo frames; plastic components of photo printers; and projector housing and other plastic components. It is also involved in the mold and die development and fabrication of automotive plastic components. The company was formerly known as TaiHan Steel Mold Corp. and changed its name to Taihan Precision Technology Co., Ltd. in June 2000. Taihan Precision Technology Co., Ltd. was founded in 1987 and is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.thpt.com.tw",
        "full_time_employees": null
    },
    "1339.TW": {
        "short_name": "Y.C.C. PARTS MFG CO LTD",
        "long_name": "Y.C.C. Parts Mfg. Co., Ltd.",
        "summary": "Y.C.C. Parts Mfg. Co., Ltd. manufactures and sells auto plastic parts in Taiwan, North America, South America, Europe, and Asia. It offers bumpers, grilles, head lamp mounting panels, valances, head lamps, and other products, as well as bumper covers and lower valances. The company was founded in 1986 and is based in Lukang Town, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Lukang Town",
        "zipcode": "505",
        "website": "http://www.yccco.com.tw",
        "full_time_employees": null
    },
    "1506.TW": {
        "short_name": "RIGHT WAY INDUSTRIAL",
        "long_name": "Right Way Industrial Co.,Ltd",
        "summary": "Right Way Industrial Co.,Ltd, together with its subsidiaries, manufactures and sells automobile parts worldwide. The company offers various casting and forging parts with steel or aluminum alloy materials, including pistons, connecting rods, steering knuckles and system parts, suspension control arms, industrial compressor housings, industrial pump chambers, die casting parts, cast iron parts, balance shafts, and suspension components for vehicle and industrial applications. It also provides engine connecting-rods, precision machining parts, ball joints, steering rod assy, suspension control arms, and stabilizer links; and housings, mounts, and supporting brackets. The company serves original equipment manufacturers, suppliers, and aftermarket customers. Right Way Industrial Co.,Ltd was founded in 1964 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "717",
        "website": "http://www.rightway.com.tw",
        "full_time_employees": null
    },
    "1521.TW": {
        "short_name": "TA YIH INDUSTRIAL CO",
        "long_name": "Ta Yih Industrial Co., Ltd.",
        "summary": "Ta Yih Industrial Co., Ltd. engages in the manufacture, sale, and trading of vehicle and auto-bicycle parts in Taiwan and internationally. The company offers automotive lighting products, including head, rear, deck lid, front turn signal, DRL, and fog lamps; and motorcycle lighting products comprising front turn signal, head, and rear lamps. It also provides aerospace lighting products, such as search lights, night vision bezels, ball transfer units, battery cases, cab reading lights, and position lights. In addition, the company offers railway lighting products comprising railways head, tail, indication, saloon LED and fluorescent, LED cab and gooseneck reading, marker, and flashing lights, as well as light control units, aluminum extrusion parts, LED train run number signs, smart electronic ballasts, and LED door open indicators. Further, it processes and sells marine lighting devices and transport components. The company was founded in 1964 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "702",
        "website": "http://www.tayih-ind.com.tw",
        "full_time_employees": null
    },
    "1524.TW": {
        "short_name": "GORDON AUTO BODY PARTS CO",
        "long_name": "Gordon Auto Body Parts Co., Ltd.",
        "summary": "Gordon Auto Body Parts Co., Ltd. manufactures and sells automotive sheet metal replacement crash parts worldwide. It offers side panels, wheel flares, tailgates, engine under covers, radiators, mirrors, hoods, handles, fenders, steel and front bumpers, inner fenders, and other products. The company was founded in 1986 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": "http://www.gordon.com.tw",
        "full_time_employees": 478
    },
    "1525.TW": {
        "short_name": "KIANSHEN CORP",
        "long_name": "Kian Shen Corporation",
        "summary": "Kian Shen Corporation manufactures and sells automobile parts. It offers truck/bus frames, electric scooter frames, stamping parts, rear body parts, dies and jigs, suspension components, and high tensile steel products. The company was founded in 1955 and is based in Yangmei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yangmei",
        "zipcode": "326",
        "website": "http://www.kian-shen.com",
        "full_time_employees": null
    },
    "1526.TW": {
        "short_name": "SUN RACE STURMEY-ARCHER INC",
        "long_name": "Sun Race Sturmey-Archer Inc.",
        "summary": "Sun Race Sturmey-Archer Inc. provides bicycle components worldwide. Its products include bottom brackets, brakes, cassettes, chains, free wheels, front cranksets, front and rear derailleurs, hubs, outer casings and inner cables, shifters, and service parts. The company was formerly known as Roots Enterprise Co., Ltd. and changed its name to Sun Race Sturmey-Archer Inc. in 2001. Sun Race Sturmey-Archer Inc. was founded in 1902 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33856",
        "website": "http://www.sunrace.com",
        "full_time_employees": null
    },
    "1533.TW": {
        "short_name": "MOBILETRON ELECTRONICS",
        "long_name": "Mobiletron Electronics Co.,Ltd.",
        "summary": "Mobiletron Electronics Co., Ltd. designs, manufactures, and sells electronic components for the automotive industry in Taiwan. It offers engine management systems, such as ABS/wheel speed sensors, brake pad wear sensors, crank/cam shaft position sensors, EGR valves, idle air control valves, ignition modules and coils, knock sensors, MAF and Map sensors, MAF sensor cores, oxygen sensors, pick up coils, relays, throttle position sensors, and transmission speed sensors, as well as ignition modules for small engines. The company also provides charging systems, including brush holders, diodes and diode trios, rectifiers, repair circuits, and voltage regulators. In addition, it offers voltage regulators, mobile safety equipment, tire pressure monitoring systems, and power tools. The company also exports its products to approximately 100 countries. Mobiletron Electronics Co., Ltd. was founded in 1982 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "428",
        "website": "http://www.mobiletron.com.tw",
        "full_time_employees": 1024
    },
    "1536.TW": {
        "short_name": "HOTA INDUSTRIAL MFG CO",
        "long_name": "Hota Industrial Mfg. Co., Ltd.",
        "summary": "Hota Industrial Mfg. Co., Ltd. designs, manufactures, and sells auto transmission components. It offers transmission products, including planetary gear sets, transfer case components, differentials, output shaft for trucks, hydraulic/water pump gears, output shafts/gears, input and output shafts, motorcycle rear shafts and gear boxes, input gears, and transmission shafts and gear sets for agricultural machinery, as well as gears for compressors, hydraulic pump shafts, forks and sleeves for trucks, motorcycle gears and components, reduction gear sets, and transmission components. The company also provides electric wheelchairs and scooters, and all-terrain vehicles. In addition, it offers gear hobbing, gear shaving, and chamfering machines, as well as optical profile measuring instruments. The company was formerly known as Hota Industrial Development Co., Ltd. and changed its name to Hota Industrial Mfg. Co., Ltd. in 1990. Hota Industrial Mfg. Co., Ltd. was founded in 1966 and is headquartered in Taichung City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "42881",
        "website": "http://www.hota.com.tw",
        "full_time_employees": 1279
    },
    "1563.TWO": {
        "short_name": "S A I",
        "long_name": "SuperAlloy Industrial Co., Ltd.",
        "summary": "SuperAlloy Industrial Co., Ltd. engages in engineering and manufacturing lightweight metal products primarily for the automotive industry. It provides forged aluminum wheels for luxury and sports automobiles; and engineering lightweight suspension components. The company has operations in Taiwan, the United States, the United Kingdom, Germany, other parts of Europe, Australia, Japan, and internationally. SuperAlloy Industrial Co., Ltd. was founded in 1994 and is headquartered in Douliu City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliu City",
        "zipcode": "64064",
        "website": "http://www.superalloyengineering.com",
        "full_time_employees": null
    },
    "1568.TW": {
        "short_name": "TSANG YOW INDUSTRIAL CO",
        "long_name": "Tsang Yow Industrial Co.,Ltd.",
        "summary": "Tsang Yow Industrial Co.,Ltd. manufactures and supplies transmission system components and assemblies worldwide. It offers automatic and manual transmission, off highway machinery, torque converter, and viscous coupling parts; clutch parts for heavy-duty trucks; and gear boxes. The company was founded in 1985 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": "62154",
        "website": "http://www.tsangyow.com.tw",
        "full_time_employees": null
    },
    "1587.TW": {
        "short_name": "CRYOMAX COOLING SYSTEM CORP",
        "long_name": "Cryomax Cooling System Corp.",
        "summary": "Cryomax Cooling System Corp. manufactures and sells automotive radiators in Taiwan and internationally. It offers copper and aluminum radiators for passenger cars, military vehicles, commercial vehicles/trucks, and forklifts. The company was founded in 1984 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "528",
        "website": "http://www.cryomaxcooling.com",
        "full_time_employees": null
    },
    "1592.TW": {
        "short_name": "ENTEREX INTERNATIONAL LIMITED",
        "long_name": "Enterex International Limited",
        "summary": "Enterex International Limited develops, manufactures, and sells automotive and heavy radiators, and automobile condenser in Taiwan and internationally. The company's principal products include plastic tanks and aluminum core radiators, all aluminum radiators, heavy duty radiators, intercoolers, condensers, and evaporators. Its products are used in passengers' cars, pick-ups, trailers, and generators, as well as for military and agricultural applications. Enterex International Limited was founded in 1984 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "70842",
        "website": "http://www.enterexinternational.com",
        "full_time_employees": null
    },
    "2101.TW": {
        "short_name": "NAN KANG RUBBER TIRE",
        "long_name": "Nankang Rubber Tire Corp.,Ltd.",
        "summary": "Nankang Rubber Tire Corp.,Ltd. produces and sells tires in Taiwan and internationally. It offers passenger car, SUV and 4X4 WD, winter, van, motorsport, light truck, and bus and trailer tires. The company was founded in 1959 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": null,
        "website": "http://www.nankang.com.tw",
        "full_time_employees": null
    },
    "2102.TW": {
        "short_name": "FEDERAL CORP",
        "long_name": "Federal Corporation",
        "summary": "Federal Corporation produces and sells tires in Taiwan and internationally. The company offers drift, ultra high performance, high performance, passenger car, touring, SUV, commercial, and winter tires. Federal Corporation was founded in 1954 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32068",
        "website": "http://www.federaltire.com.tw",
        "full_time_employees": null
    },
    "2105.TW": {
        "short_name": "CHENG SHIN RUBBER INDUSTRIES",
        "long_name": "Cheng Shin Rubber Ind. Co., Ltd.",
        "summary": "Cheng Shin Rubber Ind. Co., Ltd., together with subsidiaries, processes, manufactures, and trades in bicycle tires, electrical vehicle tires, reclaimed rubbers, rubbers and resins, and other rubber products. It also manufactures and trades in various rubber products and relevant rubber machinery. The company researches, develops, tests, processes, manufactures, exhibits, imports, exports, wholesales, and retails tires for motorcycles, industrial and agricultural mechanical vehicles, passenger cars, trucks, tanks, and bicycles. It also operates a technical center; produces, sells, and maintains models; retails accessories for rubber tires; provides container transportation services; manages racing tracks; and offers warehouse logistic services. In addition, the company provides automobile accessory and related products; rubber-coated bead and belt steel cords; radial tires; and tubes. Further, it is involved in the construction and trading of employees' housings. The company operates in Taiwan, China, the United States, and internationally. Cheng Shin Rubber Ind. Co., Ltd. was founded in 1967 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "51545",
        "website": "http://www.cst.com.tw",
        "full_time_employees": 28596
    },
    "2106.TW": {
        "short_name": "KENDA RUBBER INDUSTRY",
        "long_name": "Kenda Rubber Industrial Co. Ltd.",
        "summary": "Kenda Rubber Industrial Co. Ltd. designs and sells tires in Taiwan. It offers automotive, bicycle, wheelchair, power sport, and turf/trailer/specialty tires. The company sells its tires through distributors and retailers. Kenda Rubber Industrial Co. Ltd. was founded in 1962 and is based in Yuanlin, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "510",
        "website": "http://www.kendatire.com/en-us/",
        "full_time_employees": null
    },
    "2109.TW": {
        "short_name": "HWA FONG RUBBER INDUSTRIAL CO",
        "long_name": "Hwa Fong Rubber Ind. Co., Ltd.",
        "summary": "Hwa Fong Rubber Ind. Co., Ltd. manufactures and sells rubber and tires in Taiwan and internationally. It offers bicycle, motorcycle, scooter, agricultural, automotive, industrial, truck, bus, and light truck tires and tubes; ATV tires; and special trailer, light truck, and passenger car radial tires. The company was formerly known as Hwa Fong Ind. Co., Ltd. and changed its name to Hwa Fong Rubber Ind. Co., Ltd. in 1970. Hwa Fong Rubber Ind. Co., Ltd. was founded in 1945 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "515",
        "website": "http://www.duro.com.tw",
        "full_time_employees": null
    },
    "2114.TW": {
        "short_name": "HSIN YUNG CHIEN CO",
        "long_name": "Hsin Yung Chien Co., Ltd.",
        "summary": "Hsin Yung Chien Co., Ltd. manufactures and sells rubber conveyor belts, rubber sheets, and hot-pressing cushion pads and composite materials in Taiwan and internationally. The company's product portfolio includes straight warp, light duty, Chevron, Kevlar, and steel cord conveyor belts; specialty conveyor belts include heat, oil, flame, abrasion, cold, and chemical resistant conveyor belts; and pipe, rip stop, side wall, and EP/NN conveyor belts, as well as seal belts and bucket elevator belts under the KING brand. Its conveyor belts are used in a range of applications comprising mining, steel, aviation, agriculture, logistics, and pier automatic production. The company also provides electronic level hot and solar panel pressing cushion pads under the Silieet brand name. In addition, it offers composite materials for car parts, bicycle parts, and customer goods under the NEWsheet brand name. The company was formerly known as Hsin Yung Chien Industrial Co., Ltd. and changed its name to Hsin Yung Chien Co., Ltd. in 2003. Hsin Yung Chien Co., Ltd. was founded in 1964 and is based in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54067",
        "website": "http://www.hyc-king.com",
        "full_time_employees": 121
    },
    "2115.TW": {
        "short_name": "LU HAI HOLDING CORP",
        "long_name": "Luhai Holding Corp.",
        "summary": "Luhai Holding Corp. manufactures and sells tire valves and accessories worldwide. It offers TPMS valves; valves for bicycles, electric bikes, motorcycles, passenger cars/light trucks, trucks/buses, and agricultural/OTR applications; and valve accessories, such as valve core products, valve caps, hexagon nuts, washers, grommets and O-rings, rim nuts, and sleeves. The company also provides valve core and mounting tools; tire pressure detection products, including tire pressure and pen type tire pressure gauges; inflating equipment comprising air chucks, clip-on air chucks, and connectors; and rigid, bent, plastic, and flexible valve extensions, as well as holders. In addition, it offers wheel balance weights and tools; tire repair accessories consisting of skivers, stitchers, scrapers, repair tools, and tire repair units; and tire repair kits. The company serves manufacturers in the tire, automobile, truck, and agriculture vehicle industries. Luhai Holding Corp. was founded in 1980 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.luhai.com.tw",
        "full_time_employees": 1445
    },
    "2228.TW": {
        "short_name": "IRON FORCE INDUSTRIAL CO LTD",
        "long_name": "Iron Force Industrial Co., Ltd.",
        "summary": "Iron Force Industrial Co., Ltd. engages in the manufacturing and trading of auto parts, and display and houseware products in Taiwan and internationally. Its auto parts include airbag inflators and precision metal parts for automotive safety systems; steering columns/shafts and diesel engine cooling pipes; high precision metal tubes for seatbelt retractor/pre-tensioner systems; automated machines; and special surface treatments, as well as related components. The company also provides OEM and ODM of customized store display fixtures; display systems design; and retail store design, as well as metal wire related products. In addition, it offers display fixtures, clothes hangers, and mannequins, as well as provides logistic services. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "221",
        "website": "http://www.ironforce.com.tw",
        "full_time_employees": null
    },
    "2230.TWO": {
        "short_name": "C.T.I. TRAFFIC INDUSTRIES CO. L",
        "long_name": "C.T.I. Traffic Industries Co., Ltd.",
        "summary": "C.T.I. Traffic Industries Co., Ltd. manufactures and sells auto engine parts in Taiwan and internationally. The company offers green power products; DLC piston rings comprising black diamond piston rings; gasoline engine oil rings, such as car and auto oil, car piston, engine oil, and piston ring expanders; diesel engine oil rings, including cast iron rings; liner kits; piston kits; and timing kits and components, timing guides, and timing chains, as well as tensioners, and cam and crank gears. It also provides overhaul engine gaskets, which include CYL heads, cylinder head gaskets, automotive and engine oil seals, valve covers, oil pans, and valve stem and engine valve seals, as well as intake, exhaust, and pipe manifolds; engine valves consisting of auto engine valves, engine valve seats, engine bearings, and engine valve guides; and carburetor kits. In addition, the company offers hydraulic brake systems, such as break, master, brake wheel, and brake master cylinders; compression rings, including hook, step, inside cut, under cut, notch, both-side keystone, slip in, and copper plated rings; and jump starters. Its products are used automotive, agriculture, off-highway, and heavy-duty trucks applications. The company was founded in 1973 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.ctico.com.tw",
        "full_time_employees": null
    },
    "2231.TW": {
        "short_name": "CUB ELECPARTS INC.",
        "long_name": "Cub Elecparts Inc.",
        "summary": "Cub Elecparts Inc. manufactures and supplies automobile electrical and electronic parts in Taiwan. The company offers advanced driver assistance systems; aftermarket service parts comprising sensors and other parts; switches, such as ignition lock, power window, combination, and headlight; OEM products; and tire pressure monitoring sensors. Cub Elecparts Inc. was founded in 1979 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "50648",
        "website": "http://www.cubelec.com.tw",
        "full_time_employees": null
    },
    "2241.TW": {
        "short_name": "AMULAIRE THERMAL TECHNOLOGY INC",
        "long_name": "Amulaire Thermal Technology, Inc.",
        "summary": "Amulaire Thermal Technology, Inc. provides cooling fins for green electronic devices in Taiwan, Europe, North America, and Japan. The company offers customized products; metal injection moldings, lower flow resistance, and lighter weight designs; forgings for lower flow resistance and lighter cooling designs; and thermal modules and inverter parts, and heat dissipation systems and high power electronic system parts. Amulaire Thermal Technology, Inc. was founded in 2011 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24452",
        "website": "http://www.amulaire.com",
        "full_time_employees": 353
    },
    "2249.TWO": {
        "short_name": "YOUNG SHINE",
        "long_name": "Young Shine Electric Co., Ltd.",
        "summary": "Young Shine Electric Co., Ltd. manufactures and sells automotive a/c components in Taiwan. The company offers automotive a/c compressors, heat exchangers, and parts. It also exports its products internationally. The company was founded in 2008 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung City",
        "zipcode": "806",
        "website": "http://www.young-shine.com.tw",
        "full_time_employees": null
    },
    "2442.TW": {
        "short_name": "JEAN CO LTD",
        "long_name": "Jean Co.,Ltd",
        "summary": "Jean Co.,Ltd engages in the design, manufacture, sale, and after-sale service of automotive multimedia systems and telematics, and android smart home systems. The company offers in-car entertainment systems, including flip-down monitors, head rest monitors, and 2DIN monitors. It also engages in real estate business. In addition, the company provides property management services. Jean Co.,Ltd was founded in 1986 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.jean.com.tw",
        "full_time_employees": null
    },
    "3552.TWO": {
        "short_name": "TUNG THIH ELECTRONIC CO. LTD.",
        "long_name": "Tung Thih Electronic Co., Ltd.",
        "summary": "Tung Thih Electronic Co., Ltd. manufactures and supplies automotive electronics in Taiwan, Asia, Europe, the United States, Australia, and internationally. It offers ultrasonic parking assistance systems, vehicle anti-theft devices, car door lock actuators, interior rear mirror systems, car video systems, wireless tire pressure monitor systems, body control modules, and vehicle electric peripherals and services. The company was founded in 1979 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.tungthih.com",
        "full_time_employees": null
    },
    "3642.TWO": {
        "short_name": "UNITEL HIGH TECHNOLOGY CORPORAT",
        "long_name": "Unitel High Technology Corporation",
        "summary": "Unitel High Technology Corporation produces and sells custom rubber and plastic parts for use in the commercial and industrial electronic products worldwide. The company offers rubber molding products, such as foot pads, earphone covers, microphone covers, waterproof rings, internal mechanism gaskets, self-adhesive rubber etc.; plastic single and double injection products, including buttons, doors, thrust sliding cover, battery cover switch, headphone jack protection cover etc.; button products; and metal, plastic, and rubber heterogeneous material combination products used for mobile phones, laptops, cameras, and other 3C products. The company was formerly known as Unitel Rubber Corporation and changed its name to Unitel High Technology Corporation in June 2006. Unitel High Technology Corporation was founded in 1989 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "114",
        "website": "http://www.unitelgroups.com",
        "full_time_employees": null
    },
    "4305.TWO": {
        "short_name": "SHIH-KUEN PLASTICS",
        "long_name": "Shih-Kuen Plastics Co., Ltd.",
        "summary": "Shih-Kuen Plastics Co., Ltd. produces and supplies plastic sheets. The company offers double polished PVC sheets, including super clear, normal clear, and transparent colored; textured embossing PVC sheet, such as textured embossing, translucent textured, and semi-transparent textured; super clear laminated and colored laminated PVC sheets; and UV stabilized outdoor PVC sheets; cold crack resistant PVC sheeting; and fire flame retardant PVC sheets. Its products are used in home and office supplies, construction and industrial, outdoor PVC waterproof covers, and medical applications. The company was founded in 1986 and is based in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "72154",
        "website": "http://www.shihkuen.com.tw",
        "full_time_employees": 112
    },
    "4306.TW": {
        "short_name": "YEM CHIO CO LTD",
        "long_name": "Yem Chio Co., Ltd.",
        "summary": "Yem Chio Co., Ltd. engages in the BOPP film, adhesive tape, packaging material, construction, and hotel businesses worldwide. The company offers anti fog, heat sealable, matt, pearlized cavitated, and plain BOPP films; adhesive tapes, such as OPP packaging, super clear packaging, colored packing, and printing tapes, as well as double-sided, stationery, PVC, masking, cloth, aluminum foil, floral, kraft paper tapes; and packaging materials under the Master Package brand. It is also involved in the land development, building construction, real estate, and hotel management businesses, as well as operates hotels. The company was founded in 1977 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.yemchio.com",
        "full_time_employees": null
    },
    "4523.TWO": {
        "short_name": "TAIWAN CALSONIC CO. LTD.",
        "long_name": "Taiwan Calsonic Co., Ltd.",
        "summary": "Taiwan Calsonic Co., Ltd. manufactures and sells car air conditioning products, electronics, and other products in Taiwan. The company offers car air conditioning systems, such as unified central panels, air conditioning controllers, driver alert systems, night vision systems, body control modules, condensers, evaporators, blowers, motors, inter coolers, water cooled radiators, and chip coolers; and engineering products, including vacuum, air, and no fuse breakers, as well as electromagnetic contractors, inverters, programmable controllers, energy saving systems, robots, control devices, and thin film extension products. It also provides power distribution equipment and industry automatic control products, as well as industrial robot/electronic process equipment. The company was founded in 1987 and is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.twncal.com.tw",
        "full_time_employees": 288
    },
    "4528.TWO": {
        "short_name": "CHIAN HSING FORGING INDUSTRIAL ",
        "long_name": "Chian Hsing Forging Industrial Co., Ltd.",
        "summary": "Chian Hsing Forging Industrial Co., Ltd. manufactures and sells various forged products in Taiwan. Its forged products include hardware, bicycle, motorbike, automobile, and track vehicle parts, as well as industrial engineering vehicle components and other products. The company offers auto parts comprising C.V. joints and driving elements of front wheel; inner races; inner race crosses; bearing cups, pistons, and housings; transmission parts; transmission bearing spang products; transmission joint gears; mandrils, rear axis, and core axis of the generator; air conditioning belt pulleys; bevel gears; magnetic poles and driving gears; motor brake parts; aluminum alloy forging parts that include ammonia cans for auto air-conditioners; flange bases; and pipes, excavator teethes, and tubes. It also provides assorted hardware parts, including impactors, saddles, pneumatic toolings, tone hole parts, and rod couplings, as well as parts of sports goods, which include cranks, high-pressure joints, high-tension bolts/nuts, alloy bearing forgings, and delivering tube forgings. In addition, the company offers motorcycle parts, such as gear shafts, gear blanks, start gears, transmission shafts, and ammonia cans for auto air-conditioners; starting gear and clutch gear forged work products; shaft and axle parts; and clutches, tube yokes, and chain gears. Further, it provides rail parts, which comprise tie plates. The company was formerly known as Hsieh Hsing Iron Factory and changed its name to Chian Hsing Forging Industrial Co., Ltd. in 1980. Chian Hsing Forging Industrial Co., Ltd. was founded in 1971 and is based in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "407",
        "website": "http://www.ch-forging.com.tw",
        "full_time_employees": null
    },
    "4535.TWO": {
        "short_name": "FINE BLANKING & TOOL CO LTD",
        "long_name": "Fine Blanking & Tool Co., Ltd",
        "summary": "Fine Blanking & Tool Co., Ltd. produces and sells car and motorcycle parts in Taiwan. The company's primary products include precision stamping products, motorcycle and bicycle disc brakes, motorcycle start gears, car seat recliners, car brake parts, automotive safety shackles, and steam locomotive seats. It also provides tubes, seat belt reels, tongues, tappet and shims, frames for airbag, hand brakes, blanking gears, sectors and latches, slide stand, foot support and rest, saddles, handle bar and clamps, triple clamps, ABS phonic wheels, slope plates, bicycle parts, and engine gears and other high precision metal components. In addition, the company offers clutch and gas brake pedal, RAEV, push and pull mechanism, steering assembly, and rack and pinion, as well as medical equipment, sporting goods, and computer parts. Fine Blanking & Tool Co., Ltd. was founded in 1988 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.fineblanking.com.tw",
        "full_time_employees": 1013
    },
    "4543.TWO": {
        "short_name": "MAN ZAI INDUSTRIAL CO LTD",
        "long_name": "Man Zai Industrial Co., Ltd.",
        "summary": "Man Zai Industrial Co., Ltd. manufactures and sells air-conditioner components for vehicles worldwide. The company offers auto air-con modules, including condenser units, evaporator units, and heater cores; automobile and motorcycle aluminum radiators for cooling systems, such as radiator units and oil coolers; and thermal-electric cooling modules comprising thermal modules for CPU, thermal syphon modules, and liquid cooling modules, as well as water-cooled modules for use in CPU, VGA, LED, and auto-electric cooling modules. It also provides aluminum extrusion products that include fittings/brackets/pipes, racket frames, OPC drums, computer heat sinks, and bicycle frames; and air-con and refrigeration products. Man Zai Industrial Co., Ltd. was founded in 1984 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "718",
        "website": "http://www.manzai.com.tw",
        "full_time_employees": null
    },
    "4551.TW": {
        "short_name": "GLOBAL PMX CO LTD",
        "long_name": "Global PMX Co., Ltd.",
        "summary": "Global PMX Co., Ltd. manufactures, processes, and sells precision metal components for automotive products, hard disk drives, medical equipment, and various industrial products primarily in the United States, Mainland China, and Japan It offers automotive brake safety systems and precision parts, fuel injection systems, steering systems, thermos regulator systems, medical devices and precision parts, semiconductor equipment flow controller systems, cloud and hard disk precision parts, industrial and optical products, precision metal parts, etc. The company provides precision die, mold standard parts, construction hardware, plumbing products, heating products, hardware components, electronic components, digital cameras, precision dies, and mold standard parts. In addition, it offers computer hardware and software products; and engages in various activities, including industrial plastic products manufacturing, other non-metal products manufacturing, iron and steel casting, iron and steel forging, steel reworks, aluminum reworks, etc. Global PMX Co., Ltd. was founded in 1987 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "22102",
        "website": "http://www.global.com.tw",
        "full_time_employees": null
    },
    "4557.TW": {
        "short_name": "YUSIN HOLDING CORP",
        "long_name": "Yusin Holding Corp.",
        "summary": "Yusin Holding Corp. develops, manufactures, processes, trades, and sells vehicle's brake systems in Asia, North America, Central and South America, Europe, and internationally. Its products include brake master cylinders, brake cylinders, clutch master cylinders, clutch cylinders, brake calipers, boosters, brake pads, and other related components for the automobile's brake system. The company also manufactures and sells various vehicles parts, as well as involved in the general investment activities. Yusin Holding Corp. was founded in 1992 and is based in Chiayi, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Chiayi",
        "zipcode": null,
        "website": "http://www.yusin.com",
        "full_time_employees": null
    },
    "5102.TWO": {
        "short_name": "FU-CHIAN TIRE CO",
        "long_name": "Fu Chian Tire Co.,Ltd.",
        "summary": "Fu Chian Tire Co.,Ltd. manufactures and sells retread tires in Taiwan. The company also offers high and low temperature tread rubber products, gums, backing products, rubber flooring products, silicone products, rubber compounds, and other rubber products. It is also involved in the provision of rubber manufacturing machines, as well as in the import and export activities. Fu Chian Tire Co.,Ltd. was founded in 1949 and is based in Yuanlin City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yuanlin",
        "zipcode": null,
        "website": "http://www.fuchian.com.tw",
        "full_time_employees": null
    },
    "5306.TWO": {
        "short_name": "KMC (KUEI MENG) INTERNATIONAL I",
        "long_name": "KMC (Kuei Meng) International Inc.",
        "summary": "KMC (Kuei Meng) International Inc. manufactures and sells various types of chains, motorcycle components, and vehicle components in Asia, Europe, and the United States. The company offers bicycle chains, such as road bike, mountain bike, BMX, E-bike, and rust buster chain series products, as well as EcoProTech chains. It also provides motorcycle chain and gears, including standard driving, heavy duty, cam, and silent chain series products, as well as standard driving sprockets, and chain and sprocket kits. In addition, the company offers automobile timing systems and garage door openers. Further, it is involved in investing activities. The company was formerly known as CNet Technology Inc. and changed its name to KMC (Kuei Meng) International Inc. in July 2012. KMC (Kuei Meng) International Inc. was founded in 1977 and is headquartered in Tainan City, Taiwan. KMC (Kuei Meng) International Inc. is a subsidiary of KMC Transton Industries Limited.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "710",
        "website": "http://www.kmc-international.com",
        "full_time_employees": null
    },
    "8107.TWO": {
        "short_name": "TAYIH KENMOS AUTO PARTS CO LTD",
        "long_name": "Tayih Kenmos Auto parts Co., Ltd.",
        "summary": "Tayih Kenmos Auto parts Co., Ltd. researches, develops, manufactures, and sells automotive blow molding and filtration parts in Taiwan and internationally. It offers automobile cabin air filters, automatic transmission filters, home air purifier filters, face masks, and other products; running boards; and pickup sport bars, tonneau covers, and other exteriors. The company was founded in 1998 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "745",
        "website": "http://www.kenmos.com.tw",
        "full_time_employees": null
    },
    "8255.TWO": {
        "short_name": "ACTRON TECHNOLOGY CORP",
        "long_name": "Actron Technology Corporation",
        "summary": "Actron Technology Corporation designs, develops, manufactures, and sells electronic components of vehicles for automakers worldwide. It offers high and low cup, and JP pressfit diodes; dish diodes; and TO-220, standard, micro, and jumbo button diodes. The company also provides alternators, regulators, and anti-lock brake system controls. Actron Technology Corporation was founded in 1998 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "338",
        "website": "http://www.actron.com.tw",
        "full_time_employees": null
    },
    "9942.TW": {
        "short_name": "NAK SEALING TECHNOLOGIES CORP",
        "long_name": "NAK Sealing Technologies Corporation",
        "summary": "NAK Sealing Technologies Corporation, together with its subsidiaries, manufactures and sells oil seals and technical sealing products for various applications worldwide. It offers automotive seals, including engine, transmission, power steering, axle, shock absorber, and motor seals; and industrial seals comprising pump, gear reducer/gearbox, motor, power tool, robotic arm, wind turbine, and washing machine seals. The company also provides agriculture, construction, and mining seals, such as piston, rod, wiper, and axle/hub seals; and other seals includes V-rings, axial face seals, bonded seals, sleeves, rings, rubber molded parts, and O-ring kits and cords. It serves automotive, industrial, and hydraulic and pneumatic, as well as agricultural, and construction and mining equipment sectors. The company was formerly known as Mao Shun Co. and changed its name to NAK Sealing Technologies Corporation in 2002. NAK Sealing Technologies Corporation was founded in 1976 and is headquartered in Nantou City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Nantou City",
        "zipcode": "54065",
        "website": "http://www.nak.com.tw",
        "full_time_employees": null
    },
    "9951.TWO": {
        "short_name": "MACAUTO INDUSTRIAL CO",
        "long_name": "Macauto Industrial Co., Ltd.",
        "summary": "Macauto Industrial Co., Ltd. engages in the manufacture and sale of automotive sunshade products. The company offers automotive interiors, such as Sunshades for roof systems, luggage cover systems, side and rear window shades, wind deflectors, divider net systems, and mobile phone/tablet holder. It also provides garden tools, including cordless electric mower, electric wheelbarrows, and robotic golf caddy cart. Macauto Industrial Co., Ltd. was founded in 1979 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "710",
        "website": "http://www.macauto-group.com",
        "full_time_employees": null
    }
}