{
    "2903.TW": {
        "short_name": "FAR EASTERN DEPARTMENT STORES L",
        "long_name": "Far Eastern Department Stores, Ltd.",
        "summary": "Far Eastern Department Stores, Ltd., togethwer with its subsidiaries, operates department stores, supermarkets, and hypermarkets in Taiwan and Mainland China. The company's products portfolio includes, candies, cookies, cans, entertainment appliances, hardware, furniture, decoration items, hand-made products, stationery, library appliances, CD/DVD, camera appliances, children toys, shoes/hats/raining garments, medicine/medical equipment, cigarettes/wines, rice/corns, salts, clocks/watches/glasses, fresh foods, frozen vegetables, frozen meats/fishes, dry foods, and various flavouring soures; and gold and jewelries, tape recorders, and radar CD players, as well as silk, nylon, and cotton clothes. It also imports, exports, deals, and sells beverages; vendor machines and measurement devices; and vehicles and vehicles parts, as well as repairs vehicles, and wire and wireless telecom appliances. In addition, the company engages in the product distribution and classification, and storage business; construction, leasing, and sale of commercial and residential buildings; parking lots management activities; art gallery, works, and antiques business; and advertisement activities, as well as electronic and children's entertainment playground/facility businesses. Further, it operates restaurants, food courts, and beverage stores; film developer shops; gas stations; and hair salons and beauty services, as well as offers computer and telecom instrument services. The company operates with 10 branch stores. Far Eastern Department Stores, Ltd. was founded in 1967 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "New Taipei City"
    },
    "2910.TW": {
        "short_name": "TONLIN DEPARTMENT STORE CO",
        "long_name": "Tonlin Department Store Co.,Ltd.",
        "summary": "Tonlin Department Store Co., Ltd. operates department stores in Taiwan. It offers fashion, beauty, and lifestyle products. The company also operates cafes and restaurants. Tonlin Department Store Co., Ltd. was founded in 1971 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei City"
    }
}