{
    "1316.TW": {
        "short_name": "SUN YAD CONSTRUCTION CO LTD",
        "long_name": "Sun Yad Construction Co.,Ltd",
        "summary": "Sun Yad Construction Co., Ltd manufactures and sells PU synthetic leather materials in Mainland China, Vietnam, and Southeast Asia. The company offers its products used in manufacturing shoes for men and women. It also trades in, imports, and exports synthetic leather-related materials and optoelectronic materials; and develops, sells, and leases residential buildings. The company was founded in 1988 and is based in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": null,
        "website": "http://www.sunyad.com.tw",
        "market_cap": 2166892032
    },
    "9904.TW": {
        "short_name": "POU CHEN",
        "long_name": "Pou Chen Corporation",
        "summary": "Pou Chen Corporation manufactures and sells athletic, casual, and outdoor shoes in Taiwan and internationally. It operates as an original equipment manufacturer for international brands, as well as original design manufacturer for athletic footwear, leisure shoes, and sports sandals; and manufacturer for footwear accessories, apparels, and others. The company also engages in the retailing of sporting goods and brand licensing business. In addition, it is involved in the real estate development activities; and tourist hotel business. Pou Chen Corporation was founded in 1969 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40764",
        "website": "http://www.pouchen.com",
        "market_cap": 108736552960
    },
    "9910.TW": {
        "short_name": "FENG TAY ENTERPRISE CO LTD",
        "long_name": "Feng Tay Enterprises Co., Ltd.",
        "summary": "Feng Tay Enterprises Co., Ltd. produces and sells athletic shoes worldwide. The company was founded in 1971 and is headquartered in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliou",
        "zipcode": "64064",
        "website": "http://www.fengtay.com",
        "market_cap": 177217880064
    },
    "9950.TWO": {
        "short_name": "EMINENT LUGGAGE CORPORATION",
        "long_name": "Eminent Luggage Corporation",
        "summary": "Eminent Luggage Corporation designs, manufactures, and sells luggage products worldwide. The company provides a range of ABS, PP, PC, nylon, and polyester cases; bags and leisure products; and hard shell and beauty cases, soft luggage, trolleys, suitcase sets, business suitcases, and laptop backpacks. It offers its products under the Eminent, Case-Star, Mine, and Probeetle brands. Eminent Luggage Corporation was founded in 1979 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "711",
        "website": "http://www.eminent.com",
        "market_cap": 1816906880
    }
}