{"2908.TW": {"short_name": "TEST RITE INTERNATIONAL", "long_name": "Test-Rite International Co., Ltd.", "summary": "Test-Rite International Co., Ltd. imports and exports hand tools, auto parts, machinery, furniture, and various home appliances worldwide. The company operates through Retail, Trading, and Construction segments. The company's products include shovels, sprinklers, etc.; Christmas gifts; outdoor tables and chairs, ice buckets, tents, etc.; barbecue stoves and others; hand tools, including axes, saws, wrenches, and pliers; hardware components; automobile accessories and supplies, and their repair and maintenance products; home storage box and cabinet, and do it yourself (DIY) furniture supplies; and travel storage products. Its products also comprise furniture; stationery; computer accessories; ceiling and electric fans; wall, table, and floor lamps; indoor and outdoor lighting products and accessories; consumer electronics, such as blow-dryers, shavers, and infrared detectors; sports and leisure related products, including bicycles, and beauty and health merchandise; recreational products; BBQ grills; mattresses, sofas, sofa beds, and leisure chairs; and healthy grains and tea, organic cotton, cleaning products, personal cleaning products, fair-trade merchandising, and other related products. In addition, the company provides professional services for home improvement, home furnishing, furniture, bedding, interior design, and full-house decorations; and plumbing and electrical maintenance, waterproofing and leak repair services, as well as air conditioning repair advisory services. Further, it provides information software and electronic information; house decoration, hardware, and construction materials; interior design; mechanical and electronic engineering; cleaning service and land scape design; logistics; and other information services, as well as builds dwellings and rents buildings. It operates 27 TLW (DIY) stores, 26 HOLA stores, 2 Crate & Barrel stores, and 9 hoi! stores in Taiwan. The company was founded in 1978 and is headquartered in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Home Improvement Retail", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}}