{"2704.TW": {"short_name": "AMBASSADOR HOTEL", "long_name": "The Ambassador Hotel,Ltd.", "summary": "The Ambassador Hotel,Ltd. operates hotels and restaurants under the Ambassador Hotels and Restaurants, and amba Hotels & Resorts brands in Taiwan. The company was founded in 1962 and is based in Taipei, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei"}, "2705.TW": {"short_name": "LEOFOO DEVELOPMENT", "long_name": "Leofoo Development Co., Ltd.", "summary": "Leofoo Development Co., Ltd. engages in the tourism and travel industry in Taiwan. It operates hotels under the Courtyard by Marriott Taipei and Leofoo Hotel brands; apartment-style boutique hotel under the Leofoo Residences brand; theme park under the Leofoo Village brand; resort hotel under the Leofoo Resort Guanshi brand; water theme park under the Leofoo Water Park brand; and bakeries under the Elite Bakery, and Elite Concept brands. The company was founded in 1968 and is based in Hsinchu, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Hsinchu"}, "2707.TW": {"short_name": "FORMOSA INTERNATIONAL HOTELS CO", "long_name": "Formosa International Hotels Corporation", "summary": "Formosa International Hotels Corporation operates in the hotel industry in Taiwan and internationally. It owns and manages Regent Hotels & Resorts, an international luxury hotel brand; Silks Place, a lifestyle hotel brand; and Just Sleep, an affordable business hotel chain. The company operates 18 hotels with 3,849 rooms and suites. It also operates restaurants in National Palace Museum and various other renowned attractions in Taiwan, as well as operates Domino's Pizza chain in Taiwan. The company was founded in 1991 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}, "2739.TW": {"short_name": "MY HUMBLE HOUSE HOSPITALITY MGM", "long_name": "My Humble House Hospitality Management Consulting Co., Ltd.", "summary": "My Humble House Hospitality Management Consulting Co., Ltd. operates tourism hotels in Taiwan and internationally. The company also provides hospitality consulting services. Its property portfolio includes the Sheraton Grand Taipei Hotel, Le Meridien Taipei, and Mu Jiao Xi Hotel, as well as My Humble House Art Gallery that presents contemporary works of art. My Humble House Hospitality Management Consulting Co., Ltd. was founded in 2000 and is based in Taipei City, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Lodging", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taipei City"}}