{
  "2712.TW": {
    "city": "Hualien City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Resorts & Casinos",
    "long_name": "FarGlory Hotel Co.,Ltd",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FAR GLORY HOTEL CO LTD",
    "state": null,
    "summary": "FarGlory Hotel Co.,Ltd engages in the operation of Farglory Hotel in Hualien, Taiwan. It offers rooms, dining, weddings and meetings, leisure center, outdoor pool, stores, and spa facilities. The company is based in Hualien, Taiwan.",
    "website": "http://www.farglory-hotel.com.tw",
    "zipcode": "97449"
  },
  "2722.TW": {
    "city": "Pingtung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Resorts & Casinos",
    "long_name": "Chateau International Development Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "CHATEAU INTERNATIONAL DEVELOPME",
    "state": null,
    "summary": "Chateau International Development Co., Ltd. engages in the hotel business. It also provides dining services; and sells commodities. The company was founded in 1995 and is headquartered in Pingtung, Taiwan.",
    "website": "http://www.chateau-hotels.com.tw",
    "zipcode": "94643"
  },
  "2750.TWO": {
    "city": "Taoyuan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Resorts & Casinos",
    "long_name": "Hotel Orchard Park CO., LTD.",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Orchard Park",
    "state": null,
    "summary": "Hotel Orchard Park CO., LTD. operates a hotel in Taiwan. The company operates the Orchard Park Hotel, an international tourist hotel with business, holiday, and transit functionalities in Taoyuan's Aerotropolis. Its hotel includes 187 guestrooms, such as deluxe king, executive rooms, Washitsu suites, executive suites, park view suites, and orchard suites. The company also provides Hee Yuet Lau Chinese restaurant, Orchard Café, Hanamizuki Japanese cuisine, Atrium Bar, Oasis club, banquet hall, conference room, shopping street, and business center services, as well as ball room, meeting room, pavilion, and spa services. Hotel Orchard Park CO., LTD. was founded in 2009 and is based in Taoyuan City, Taiwan.",
    "website": "http://www.hotelorchardpark.com",
    "zipcode": "33742"
  },
  "3252.TWO": {
    "city": "Taichung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Resorts & Casinos",
    "long_name": "Haiwan International Development Co., Ltd",
    "market": "tw_market",
    "market_cap": "Nano Cap",
    "sector": "Consumer Cyclical",
    "short_name": "HAIWAN INTERNATIONAL DEVELOPMEN",
    "state": null,
    "summary": "Haiwan International Development Co., Ltd engages in the development and leasing of residential buildings. It is also involved in the hotel business; and real estate trading activities. The company was formerly known as Haewan International Development Co., Ltd and changed its name to Haiwan International Development Co., Ltd. in 2014. Haiwan International Development Co., Ltd was founded in 1994 and is based in Taichung, Taiwan.",
    "website": "http://www.haiwan.tw",
    "zipcode": null
  },
  "5905.TWO": {
    "city": "Kaohsiung",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Resorts & Casinos",
    "long_name": "Nan Ren Lake Leisure Amusement Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "NAN REN LAKE LEISURE AMUSEMENT ",
    "state": null,
    "summary": "Nan Ren Lake Leisure Amusement Co., Ltd. provides leisure and recreation facilities in Taiwan. It operates the National Museum of Marine Biology and Aquarium, an underwater tunnel, a resort and sleepover, dining service area, and underground food shopping mall, as well as Nargo electronic mall, an online shopping platform. The company was founded in 1989 and is based in Kaohsiung City, Taiwan.",
    "website": "http://www.nanrenhu.com.tw",
    "zipcode": "802"
  }
}
