{"2723.TW": {"short_name": "GOURMET MASTER CO LTD", "long_name": "Gourmet Master Co. Ltd.", "summary": "Gourmet Master Co. Ltd., an investment holding company, operates and franchises a chain of cafes in China, Taiwan, the United States, and internationally. The company operates its cafes under the 85Â°C name that provide coffee, cake, and bakery goods. As of December 31, 2019, it operated approximately 400 stores in Taiwan, 600 stores in China, 65 stores in the United States, 18 stores in Australia, and 8 stores in Hong Kong. It also provides birthday cakes, delicacy cakes, cake rolls, specialty cakes, toasts, Taiwanese/Japanese/European/Danish bread, sandwiches, donuts, coffee, tea, milk tea, smoothies, shakes, and juices; and others, including pineapple cakes, nougats, egg rolls, and gift boxes. Gourmet Master Co. Ltd. was founded in 2005 and is based in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Restaurants", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "2727.TW": {"short_name": "WOWPRIME CORP", "long_name": "Wowprime Corp.", "summary": "Wowprime Corp. provides catering services in Taiwan, China, and internationally. The company offers Western steak, Japanese style cuisine, original grilled, Hokkaido kelp hotpot, teppanyaki, Japanese pork chop, hot pot, and Italian veggie cuisines. It operates approximately 20 bands; and 400 restaurants in the United States. The company was founded in 1993 and is based in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Restaurants", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}, "8940.TW": {"short_name": "NEW PALACE INTERNATIONAL CO", "long_name": "New Palace International Co., Ltd.", "summary": "New Palace International Co., Ltd. operates restaurants. It provides food services, wedding banquets, and catering services. The company was founded in 1971 and based in Taichung, Taiwan.", "currency": "TWD", "sector": "Consumer Cyclical", "industry": "Restaurants", "exchange": "TAI", "market": "tw_market", "country": "Taiwan", "city": "Taichung"}}