{
    "2430.TW": {
        "short_name": "TSANN KUEN ENTERPRISE CO",
        "long_name": "Tsann Kuen Enterprise Co.,Ltd",
        "summary": "Tsann Kuen Enterprise Co., Ltd., through its subsidiaries, engages in the manufacture and sale of electrical and electronic household appliances in Taiwan and internationally. The company primarily offers six product lines, including grill and outdoor grill, iron, coffee maker, pop-up toaster, oven, microwave oven, and motor products. It also provides light industry products, office equipment and their related modules, and computers and their related facilities or spare parts. In addition, the company offers nonferrous metal composed materials and alloy materials; electronic appliances parts, such as electrical kits, sensors, and sensitive transmitters; and education and training services. Additionally, Tsann Kuen Enterprise Co., Ltd. is involved in the development of computer software, and IC packing and testing. It also engages in retailing electrical appliances through its department stores. The company was founded in 1978 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.tsannkuen.com",
        "market_cap": "Mid Cap"
    },
    "2450.TW": {
        "short_name": "SENAO INTERNATIONAL CO LTD",
        "long_name": "Senao International Co., Ltd.",
        "summary": "Senao International Co., Ltd. sells and distributes mobile devices and accessories primarily in Taiwan and mainland China. It operates through Sales Department and Other Departments segments. The company is also involved in the sale of home appliances, digital products, IoT-related products, and health care products; agency and sale of Chunghwa Telecom telephone numbers; operation of authorized retail stores; and agency of property insurance; and provision of repairs of communication products. In addition, it offers its products and services through special stores and customer service centers. The company was formerly known as Senao Business Development Company Limited and changed its name to Senao International Co., Ltd. in August 1994. Senao International Co., Ltd. was founded in 1979 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": null,
        "website": "http://www.senao.com.tw",
        "market_cap": "Mid Cap"
    },
    "2906.TW": {
        "short_name": "COLLINS",
        "long_name": "Collins Co., Ltd.",
        "summary": "Collins Co., Ltd. exports sundry goods and garments to department stores, warehouse clubs, supermarkets, discounted stores, home centers, drug stores and importers, etc. worldwide. The company's products include tool sets and boxes/auto accessories, garden tools/accessories, houseware/kitchenware, X'mas decorations and lightings, sporting equipment/travel goods, small appliances/lightings, digital products/computer accessories, garments, and indoor and outdoor furniture, as well as BBQ grills, firepits, and accessories. It is also involved in the apparel retail business; biotechnology and medical care businesses; and provision of surface and storage products. The company was founded in 1969 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10544",
        "website": "http://www.collins.com.tw",
        "market_cap": "Mid Cap"
    },
    "2937.TWO": {
        "short_name": "GSEVEN CO LTD",
        "long_name": "Gseven Co., Ltd.",
        "summary": "Gseven Co., Ltd. sells consumer electronic products in Taiwan. The company offers audio, TV projection, health and beauty, digital, and life style products, as well as horn and air conditioning systems, Home theaters, and household and kitchen appliances. It also sells its products through department store counters and outlets. The company was founded in 1994 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "802",
        "website": "http://www.gseven.com.tw",
        "market_cap": "Small Cap"
    },
    "8433.TWO": {
        "short_name": "BON FAME CO LTD",
        "long_name": "Bon Fame Co., Ltd.",
        "summary": "Bon Fame Co., Ltd. operates in fashion market in Taiwan. It offers hair accessories, jewelry, hairstyling products, beauty tools, bags and purses, fashion accessories, and novelty products, as well as event products, such as kid's masks. The company was founded in 1985 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.bonfame.com",
        "market_cap": "Mid Cap"
    }
}