{
    "1409.TW": {
        "short_name": "SHINKONG SYNTHETIC FIBER",
        "long_name": "Shinkong Synthetic Fibers Corporation",
        "summary": "Shinkong Synthetic Fibers Corporation produces and sells polyester fibers and polymers in Taiwan and internationally. Its products primarily include partially oriented yarns, polyester filament yarns, fully drawn yarns, polyester staple fibers, polyester draw textured yarns, industrial yarns, polyester pellets, PET bottle grade resins, PET bottles, PET bottle preforms, engineering polymers, optical films, polyester films, and A-PET sheets. The company principally serves textiles, food, packaging, electronics, and optoelectronics industries. It also offers synthetic resins, plastic products, and polyester films; chemical fiber weaving, printing, and dyeing services; and leasing, investment, human resources management and securities investment consulting, and life and property insurance agency services, as well as electronic information software. In addition, the company manufactures magnetic tapes for recording and video disks, and polyester films; invests in and constructs business and public housing facilities; contracts for various projects, such as air pollution prevention, piping engineering, and machine installation; manufactures synthetic fibers; engages in the wholesale and retail sale of textile products; and manufactures electronic parts and components, and precision chemical materials. Further, it is involved in the precision chemical materials and mold manufacturing wholesale, etc.; consignment trading of securities and futures; and sale and rental of housing and building development projects; and provision of consulting, biotechnology research, and development services. Shinkong Synthetic Fibers Corporation was founded in 1967 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.shinkong.com.tw",
        "market_cap": 35098628096
    },
    "1410.TW": {
        "short_name": "NAN-YANG DYEING & FINISHING",
        "long_name": "Nan Yang Dyeing & Finishing Co.,Ltd",
        "summary": "Nan Yang Dyeing & Finishing Co.,Ltd engages in dyeing, printing, finishing, knitting, processing, and selling fabrics. The company offers cotton, rayon, and chemical fiber knitted fabrics. It also operates as a professional communication semiconductor component packaging and testing foundry. The company was founded in 1964 and is based in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.nydf.com.tw",
        "market_cap": 2220750080
    },
    "1413.TW": {
        "short_name": "HUNG CHOU FIBER IND. CO.  LTD",
        "long_name": "Hung Chou Fiber Ind. Co., Ltd",
        "summary": "Hung Chou Fiber Ind. Co., Ltd manufactures and sells polyester filaments in Taiwan. It primarily offers polyester textured yarn for the use in bath towel, facecloth, stuffed toy; silk-linen for light, thick, and thin fabrics; recycled polyester filament yarn for the use in knitted and woven fabrics; filament yarn for socks, weaving, knitting, circular knitting, denim fabric, yoga cloth, and sports wear; flannel yarn for sofa, curtains, bedding, and office furniture etc.; dyeable mixed polyester yarn for the use in knitting and weaving ; and shrinkage fiber for shirt, suits, sportswear, and casual wear. The company was formerly known as Hung Chou Chemical Industries Co. Ltd. and changed its name to Hung Chou Fiber Ind. Co., Ltd in June 2015. Hung Chou Fiber Ind. Co., Ltd was founded in 1968 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "114",
        "website": "http://www.hungchou.com.tw",
        "market_cap": 1591949568
    },
    "1416.TW": {
        "short_name": "KWONG FONG INDUSTRIES",
        "long_name": "Kwong Fong Industries Corporation",
        "summary": "Kwong Fong Industries Corporation, together with its subsidiaries, primarily engages in the construction business in Taiwan. It undertakes residential, and commercial and industrial complex construction projects, as well as operates shopping malls. The company was founded in 1968 and is headquartered in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": null,
        "website": "http://www.kfic.com.tw",
        "market_cap": 2288973824
    },
    "1418.TW": {
        "short_name": "TONG-HWA SYNTHETIC FIBER",
        "long_name": "Tong-Hwa Synthetic Fiber Company Limited",
        "summary": "Tong-Hwa Synthetic Fiber Company Limited manufactures and sells polyacrylonitrile fibers in the Republic of China. The company was founded in 1970 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "100",
        "website": "http://thfin.myweb.hinet.net",
        "market_cap": 616202880
    },
    "1423.TW": {
        "short_name": "REWARD WOOL",
        "long_name": "Reward Wool Industry Corporation",
        "summary": "Reward Wool Industry Corporation produces and sells wool products in Taiwan and internationally. It offers wool tops, special processing tops, and others. The company was founded in 1964 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.reward.com.tw",
        "market_cap": 2954840064
    },
    "1434.TW": {
        "short_name": "FORMOSA TAFFETA CO",
        "long_name": "Formosa Taffeta Co., Ltd.",
        "summary": "Formosa Taffeta Co., Ltd. operates in the textile industry in Asia. It operates through four segments: First Business Group, Cord Fabric Department, Gasoline Department, and FATC Department. The company engages in researching, developing, warping, sizing, beaming, twisting, designing, weaving, dyeing, printing, and finishing fabrics and textured yarns. It provides polyamine, polyester, sports, functional, and medical fabrics; tire cord fabrics, base cloths of conveyor ducks, chafers for tirelips, anti-puncture fabric for bikes, lining fabric, etc.; cotton, blended, and MVS yarns; and Nano far infrared ray, Nano anion, germanium, fine diner, hollow section insulation, low-pilling, functional, comfort, eco-friendly, protective, and flame resistance fabrics, as well as protective fabrics of uniforms for military, police, and firefighter applications. The company also offers medical protective antibacterial, bullet proof, anti-puncture, and carbon fiber fabrics; prepreg for materials of shells of notebooks and cellphones, bikes, and golf clubs; and carbon fiber fabrics for autos, pipeline reinforcement jackets, PE plastic bags, etc. In addition, it operates gasoline stations; offers petroleum, diesel, lubricant, and car appliances, as well as car washing services; installs and tests various integrated circuits; and engages in processing, and research and development of modules. The company was formerly known as Formosa Fiber Co., Ltd. and changed its name to Formosa Taffeta Co., Ltd. in January 1979. Formosa Taffeta Co., Ltd. was founded in 1973 and is headquartered in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliou",
        "zipcode": "640",
        "website": "http://www.ftc.com.tw",
        "market_cap": 52913684480
    },
    "1439.TW": {
        "short_name": "CHUWA WOOL INDUSTR",
        "long_name": "Chuwa Wool Industry Co., (Taiwan) Ltd.",
        "summary": "Chuwa Wool Industry Co., (Taiwan) Ltd. sells wool tops, superwash wool tops, and seperwash loose wool products in Taiwan. It also leases real estate properties. The company was founded in 1953 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "110055",
        "website": "http://www.chuwa.com.tw",
        "market_cap": 2300000000
    },
    "1440.TW": {
        "short_name": "TAINAN SPINNING",
        "long_name": "Tainan Spinning Co., Ltd.",
        "summary": "Tainan Spinning Co., Ltd. manufactures, processes, and sells various textile products and synthetic fiber materials in Taiwan, Mainland China, Vietnam, and internationally. The company offers cotton yarns, polyester fibers, polyester filament yarns, drawn textured yarns, polyester chips, pet granules, processed yarns, OE yarns, polyester staple fibers, polyester partial oriented yarns, etc., as well as polyester bottle grade chips and solid-state polymerization. It is also involved in the construction of national citizen buildings; rental and sale of commercial buildings; investment in textile-related industries and other businesses; production, printing, and dyeing of garments; and sales of woven textiles and garments. The company was founded in 1955 and is headquartered in Tainan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "70155",
        "website": "http://www.tainanspin.com.tw",
        "market_cap": 44734140416
    },
    "1443.TW": {
        "short_name": "LILY TEXTILE",
        "long_name": "Lily Textile Co., Ltd.",
        "summary": "Lily Textile Co., Ltd. engages in textile and logistics business activities in Taiwan. It offers yarn products. The company also constructs and sells buildings. In addition, it is involved in warehousing, tally, processing, distribution, and information integration services, as well as e-commerce logistics activities. The company was founded in 1961 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lily.com.tw",
        "market_cap": 1969277312
    },
    "1444.TW": {
        "short_name": "LEALEA ENTERPRISE",
        "long_name": "Lealea Enterprise Co., Ltd.",
        "summary": "Lealea Enterprise Co., Ltd. produces and sells polyester DTY to provide raw materials to textile manufacturers in Taiwan and internationally. It offers polyester filament, polyester textured, nylon textured, special polyester textured, conjugated, polyester special functional, recycle polyester, and solution dyed yarns, as well as polyester chips. The company was founded in 1979 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lealea.com.tw",
        "market_cap": 12068245504
    },
    "1447.TW": {
        "short_name": "LI PENG ENTERPRISE",
        "long_name": "Li Peng Enterprise Co., Ltd.",
        "summary": "Li Peng Enterprise Co., Ltd. manufactures and sells fabrics and yarns primarily in Asia. The company provides nylon chips, nylon filament yarns, nylon special functional yarns, and solution dyed yarns. It also offers various synthetic fabrics, such as fabrics for industrial purposes; flame retardant and blackout home textile fabrics; and fabrics for sportswear, fashion wear, and uniforms. In addition, it provides polymerization, spinning, and weaving services, as well as dyeing and post-finishing process. Li Peng Enterprise Co., Ltd. was founded in 1975 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.lealeagroup.com.tw/en/libolon/LIPENG/",
        "market_cap": 10417768448
    },
    "1449.TW": {
        "short_name": "CHIA HER INDUSTRIAL CO",
        "long_name": "Chia Her Industrial Co., Ltd.",
        "summary": "Chia Her Industrial Co., Ltd. manufactures and sells textile products in Taiwan. The company's products include performance, fashion, chaser, home, and yarn products; and work wear products for military, police, post office, banks, gas stations, students, etc. It serves various industries comprising fashion, outdoor, sports, home, and automotive. The company is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "105",
        "website": "http://www.chgtex.com",
        "market_cap": 1795765632
    },
    "1451.TW": {
        "short_name": "NIEN HSING TEXTILE",
        "long_name": "Nien Hsing Textile Co., Ltd.",
        "summary": "Nien Hsing Textile Co., Ltd. manufactures and sells yarns, denim fabrics, jeans, and knitwear worldwide. The company was founded in 1986 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "356",
        "website": "http://www.nhjeans.com",
        "market_cap": 4187699968
    },
    "1454.TW": {
        "short_name": "TAIWAN TAFFETA FABRIC",
        "long_name": "Taiwan Taffeta Fabric Co., Ltd.",
        "summary": "Taiwan Taffeta Fabric Co., Ltd. produces and sells polyester fabrics in Taiwan. The company provides polyester, nylon, and interlaced/blended materials that are used in suits, outdoor, urban leisure, and home decoration applications. It also produces suede, jacquard, lightweight, heavy cloth, printed, flame retardant, waterproof and breathable, sandwich cloth, and anti-UV fabrics, as well as quick-drying and keep warm fabrics. Taiwan Taffeta Fabric Co., Ltd. was founded in 1973 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.ttfco.com",
        "market_cap": 1239517952
    },
    "1457.TW": {
        "short_name": "YI JINN INDUSTRIAL CO",
        "long_name": "Yi Jinn Industrial Co., Ltd.",
        "summary": "Yi Jinn Industrial Co., Ltd. engages in the research and development, production, and sale of polyester textured yarns worldwide. It primarily offers polyester filament yarns, polyester/nylon textured yarns, spandex air covering yarns, polyester textured color yarns, and composite yarns, as well as man-made woven and knit fabrics. The company provides its products under the Seagull and GreenGuard brands for application in shirts, suits, sportswear, casual wear, women's suits, home textiles, leisure wears, bath towels, facecloths, stuffed toys, ladies garments'/spring and summer clothes, gentleman's clothes/pants, knitted and woven fabrics, socks, denim fabrics, yoga clothes, underwear's/lingerie's, jackets, and over coats, as well as for weaving, and warp or circular knitting. Yi Jinn Industrial Co., Ltd. was founded in 1981 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei City",
        "zipcode": "114",
        "website": "http://www.yijinn.com.tw",
        "market_cap": 4307431936
    },
    "1460.TW": {
        "short_name": "EVEREST TEXTILE",
        "long_name": "Everest Textile Co., Ltd.",
        "summary": "Everest Textile Co., Ltd. manufactures and sells textile products in Taiwan and internationally. It engages in yarn texturizing, weaving, knitting, dyeing, printing, coating, and laminating, as well as garment productions. The company offers membranes, chips and yarns, synthetic leather, industrial and home fabric, organic cotton, and recycled polyester, as well as technical fashion and causal, stretch, air pass, functional fiber, soft shell, and knitting fabrics. The company primarily sells its products under the EVERTEK brand name. Its fabrics are used in sports, outdoor, city, casual, health care, and workwear applications. Everest Textile Co., Ltd. was founded in 1988 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "74342",
        "website": "http://www.everest.com.tw",
        "market_cap": 5273060352
    },
    "1463.TW": {
        "short_name": "CHYANG SHENG DYEING & FINISHING",
        "long_name": "Chyang Sheng Dyeing & Finishing Co., Ltd.",
        "summary": "Chyang Sheng Dyeing & Finishing Co., Ltd. provides natural and man-made fiber dyeing and finishing products and services in Taiwan. The company is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "337",
        "website": "http://www.csgroup.com.tw",
        "market_cap": 2548091392
    },
    "1464.TW": {
        "short_name": "DE LICACY INDUSTRIAL CO",
        "long_name": "De Licacy Industrial Co., Ltd.",
        "summary": "De Licacy Industrial Co., Ltd. engages in the research and development, manufacture, and sale of fabrics in Taiwan. It offers P/D and Y/D functional fabrics; and coating, lamination, and bonding fabrics. The company's products include performance and protect fabrics, such as AERO-TECH, easy move, mechanical stretch, wicking, 3D double weaving, high density, feather weight, water repellent, antu-UV, 2 layer lamination, 3 layer soft shell, 2 layer bonding, and functional coating fabrics; and eco green fabrics, including recycled polyester, organic cotton, PFC-free W/R, and DL cool fabrics. It also offers casual and fashion fabrics comprising synthetic yarn dyed, seersucker, dobby design, silky drape, satin, denim look, and beachwear fabrics; and interiors textiles consisting of dense felt like, metallic luster, mat weaving, suede-like, and water and oil repellent/soil release fabrics. The company was founded in 1982 and is headquartered in Tainan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan",
        "zipcode": "74444",
        "website": "http://www.delicacy.com.tw",
        "market_cap": 6787590144
    },
    "1465.TW": {
        "short_name": "WISHER INDUSTRIAL CO",
        "long_name": "Wisher Industrial Co., Ltd.",
        "summary": "Wisher Industrial Co., Ltd. manufactures and sells fabrics. Wisher Industrial Co., Ltd. was founded in 1972 and is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "103",
        "website": "http://www.wisher.com.tw",
        "market_cap": 1341710592
    },
    "1466.TW": {
        "short_name": "ACELON CHEMICAL & FIBER CORPORA",
        "long_name": "Acelon Chemicals & Fiber Corporation",
        "summary": "Acelon Chemicals & Fiber Corporation manufactures and sells textile products in Taiwan. The company offers filament yarns, including nylon, polyester, dope dyed, nylon/polyester conjugate, cool, quick dry, stock, and mÃ©lange yarns; and functional fabrics, such as aceice, acestatic, acecool, acebamboo, and acemicro. It also provides finished products, which includes household and personal cleaning products; sport, cool, and yoga towels; and T-shirts, polo shirts, uniforms, and sunscreen jackets. Acelon Chemicals & Fiber Corporation was founded in 1988 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": null,
        "website": "http://www.acelon.com.tw",
        "market_cap": 2073078016
    },
    "1470.TW": {
        "short_name": "EVERTEX FABRINOLOGY LTD",
        "long_name": "evertex fabrinology limited",
        "summary": "evertex fabrinology limited manufactures and sells fabrics in Taiwan and internationally. The company offers circular and warp knit fabrics, as well as tricot greiges. It is also involved in dyeing and finishing circular and warp knits, as well as woven fabrics for suiting applications. The company was formerly known as Evertex Dyeing & Finishing. evertex fabrinology limited was founded in 1986 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33853",
        "website": "http://www.evertex.tw",
        "market_cap": 1389425408
    },
    "1474.TW": {
        "short_name": "HONMYUE ENTERPRISE CO LTD",
        "long_name": "Honmyue Enterprise Co., Ltd.",
        "summary": "Honmyue Enterprise Co., Ltd. operates as a fabric and textile manufacturer in Taiwan. The company offers a range of products, such as fabric/textile materials, including nylon fabrics, polyester fabrics, olefin fabrics, olefin polypropylene fabrics, polyester spun fabrics, vinyl mesh fabrics, textilene fabrics, TC/TR fabrics, yarn dyed fabrics, solution dyed fabrics, etc. It also provides isolation and surgical gowns, surgical drapes, medical scrubs, bedsheets, fitted sheets, pillowcases, body bags, tent fabrics, and masks, as well as other personal protect equipment. The company's products are used in industrial and baggage fabric, outdoor and indoor furnishing fabric, sports apparel fabric, and medical textile applications. Honmyue Enterprise Co., Ltd. was founded in 1970 and is based in Changhua County, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "50971",
        "website": "http://www.textile-hy.com.tw",
        "market_cap": 2143300480
    },
    "1476.TW": {
        "short_name": "ECLAT TEXTILE CO",
        "long_name": "Eclat Textile Co., Ltd.",
        "summary": "Eclat Textile Co., Ltd. manufactures and sells knitted fabrics and garments in the Americas, Asia, Europe, the Middle East, Africa, and internationally. The company operates through two segments, Knitted and Clothing. The company offers elastic knit fabrics for use in various sportswear, recreation wear, underwear and pajamas, yoga wear, etc. It also invests in securities, real estate, and manufacturing industries. The company was founded in 1977 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "248",
        "website": "http://www.eclat.com.tw",
        "market_cap": 171205017600
    },
    "2915.TW": {
        "short_name": "RUENTEX INDUSTRIES",
        "long_name": "Ruentex Industries Limited",
        "summary": "Ruentex Industries Limited engages in textile manufacturing, retailing, marketing, and trading activities. The company offers home decorative and filament fabrics, as well as finished products; cotton dobby, cotton jacquard, yarn dye, and piece dye products; and functional fabrics, including outlast cotton, bamboo, bamboo charcoal, and soybean fabrics. It also retails men's and women's wear, underwear, and bags under the NAUTICA, NAUTICA JEANS, Jeep, KOOKAI lingerie, MORGAN LINGERIE, HECHTER STUDIO, KENNETH COLE, KENNETH COLE REACTION, DANIEL CREMIEUX, and CHARLES RIVER brands. In addition, the company offers planning and design services for elderly homes, mass merchandisers, hypermarkets, parking lots, office buildings, science and technology plants, general housing, etc.; and construction drawing services. Ruentex Industries Limited is based in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "104",
        "website": "http://www.ruentex.com.tw",
        "market_cap": 46826975232
    },
    "4401.TWO": {
        "short_name": "TOUNG LOONG TEXTILE MFG CO",
        "long_name": "Toung Loong Textile MFG. Co., LTD.",
        "summary": "Toung Loong Textile MFG. Co., LTD. operates as a textile manufacturing company in Taiwan. It develops and produces air and draw textured, shape control twist, alpha yarn, and air textured covered yarns, as well as functional synthetic yarn dyes and sewing threads. The company was founded in 1960 and is headquartered in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "220",
        "website": "http://www.tloong.com.tw",
        "market_cap": 4925711872
    },
    "4417.TWO": {
        "short_name": "KING CHOU MARINE TECHNOLOGY CO ",
        "long_name": "King Chou Marine Technology Co., Ltd.",
        "summary": "King Chou Marine Technology Co., Ltd. manufactures and sells netting products for the marine industries under the King Net brand name worldwide. The company offers purse seine, trawl, Danish seine, gill and trammel, trap, and set nets; long line, twine, and rope products; marine hardware products, such as cable clamps, purse rings, snap rings, steel triangles, choker hooks, alloy galv. connecting links, strong C-rings, ring scoopers, splice needles, Samson splicing kits, chains, floats, swivels, and hooks; fish farming and cage nets; and other nets, such as safety, flower, camouflage, and melon nets. It also provides a range of sports nets for soccer, volleyball, baseball, and tennis. The company was formerly known as King Chou Fish Net Mfg. Co., Ltd. and changed its name to King Chou Marine Technology Co., Ltd. in 2002. King Chou Marine Technology Co., Ltd. was founded in 1978 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "806",
        "website": "http://www.king-net.com.tw/en/",
        "market_cap": 3174103808
    },
    "4419.TWO": {
        "short_name": "ENSURE GLOBAL CORP LTD",
        "long_name": "Ensure Global Corp., Ltd.",
        "summary": "Ensure Global Corp., Ltd. manufactures and sells spun-like fabrics and yarns in Taiwan. The company offers air and draw textured yarns; knitted fabrics; and mirror surface wiping clothes. It also provides cotton-like fabric and microfiber products. In addition, the company offers grating, twill, and interweaving products. Further, it provides wind breakers, shirts, knitting sports wears, casual pants, and durable towels. The company was founded in 1991 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "521",
        "website": "http://www.metaltech.com.tw",
        "market_cap": 414553088
    },
    "4420.TWO": {
        "short_name": "KWANG MING SILK MILL CO",
        "long_name": "Kwang Ming Silk Mill Co., Ltd.",
        "summary": "Kwang Ming Silk Mill Co., Ltd. engages in the production and sale of polyester processing yarn. The company offers composite fabrics, special functionality fabrics, synthetic fiber fabrics, and general garments materials, as well as man-made fiber products. It is also involved in real estate leasing and trading business. The company's products are used for fashion clothing, environmental protection functional fabrics, outdoor leisure fabrics, and home decoration, as well as cloth for shoe materials. The company is based in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": null,
        "website": "http://www.kwangming.com",
        "market_cap": 1132739968
    },
    "4426.TW": {
        "short_name": "LI CHENG ENTERPRISE CO. LTD",
        "long_name": "Li Cheng Enterprise Co., Ltd.",
        "summary": "Li Cheng Enterprise Co., Ltd. manufactures and sells 3D spacer fabrics worldwide. Its products are used in shoe materials, such as bags, hats, underwear bras, general garments, mattresses, sports Equipment, medical, and automotive materials, etc. The company also provides polyester and nylon monofilaments; and other materials, such as PP and others. Li Cheng Enterprise Co., Ltd. founded 1992 and is based in Douliu, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Douliou",
        "zipcode": "640",
        "website": "http://www.li-cheng.com.tw",
        "market_cap": 4170149376
    },
    "4429.TWO": {
        "short_name": "G FUN INDUSTRIAL CORPORATION",
        "long_name": "GFun Industrial Corporation",
        "summary": "GFun Industrial Corporation manufactures and sells coated and laminated functional fabrics in Taiwan. It offers various functional membranes and fabrics; and develops various types of wick, windproof, water-repellent, anti-UV, anti-bacterial, and abrasion-resistant functional fabrics. The company was founded in 1999 and is based in Taoyuan, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "32849",
        "website": "http://www.gtex.com.tw",
        "market_cap": 1250340096
    },
    "4430.TWO": {
        "short_name": "YAO I FABRIC CO. LTD.",
        "long_name": "Yao I Fabric Co., Ltd.",
        "summary": "Yao I Fabric Co., Ltd. manufactures and sells filament and spun products in Taiwan and internationally. Its products include various kinds of fishing, tennis, badminton racket, and cutting lines; industrial wires, mesh cloth chairs, pet mats, breathable beds, knitted cotton car seats, car seats with blankets, and automotive sound-absorbing cotton materials; and environmentally friendly stretch cotton, firewood, stretch cotton, and electronic supplies blankets, as well as shoes with cotton insulation class, and bedding and sofa with a stretch cotton. The company was founded in 1973 and is based in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "508",
        "website": "http://www.yaoi.com.tw",
        "market_cap": 1457496576
    },
    "4433.TWO": {
        "short_name": "SINGTEX INDUSTRIAL CO LTD",
        "long_name": "Singtex Industrial Co., Ltd.",
        "summary": "Singtex Industrial Co., Ltd. engages in the research and development, and sale of eco-friendly functional textile products in Taiwan. It offers functional fabrics; and functional, specialty, and comfort yarns. The company was founded in 1989 is based in New Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "New Taipei City",
        "zipcode": "24892",
        "website": "http://www.singtex.com",
        "market_cap": 1794971648
    },
    "5475.TWO": {
        "short_name": "GLOTECH INDUSTRIAL CORP",
        "long_name": "Glotech Industrial Corp.",
        "summary": "Glotech Industrial Corp. produces and sells e-glass fiber fabrics in Taiwan and internationally. It offers fiber glass fabrics and yarns that are used as composite materials. The company was formerly known as A Johnson Composite Inc. and changed its name to Glotech Industrial Corp. in May 2011. Glotech Industrial Corp. was founded in 1997 and is headquartered in Yangmei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Yangmei",
        "zipcode": "32669",
        "website": "http://www.glotechgf.com",
        "market_cap": 3082829824
    },
    "8916.TWO": {
        "short_name": "KWONG LUNG ENTERPRISE",
        "long_name": "Kwong Lung Enterprise Co., Ltd.",
        "summary": "Kwong Lung Enterprise Co., Ltd. manufactures and sells apparel in Taiwan, China, Vietnam, and Japan. The company operates through Apparel department, Down Material Department, and Home Textile Department segments. It offers down and bedding; wholesale of outdoor supplies, household wares, clothing, and related packaging materials; food; and import and export of goods and technology. The company provides down products, including natural down, water repellent down, antibacterial deodorant down, color down, and flame retardant, as well as Thermobrid plus products for use in outdoor and home textile. In addition, it provides clothing products, such as snowboard wear, skiing wear, mountain climbing jackets, seamless wind and rain-proof jackets, biking wear, sportswear, jeans, casual jackets and pants, etc. Further, it manufactures winter quilts, cushions, seating pads, sofas, pillows, sleeping bags, gloves, and home decoration products. It also offers bedding products under the Kong lung brand. Kwong Lung Enterprise Co., Ltd. was founded in 1966 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10682",
        "website": "http://www.klf.com.tw",
        "market_cap": 5668431360
    },
    "8916A.TWO": {
        "short_name": "KWONG LUNG ENTERPRISE",
        "long_name": "Kwong Lung Enterprise Co., Ltd.",
        "summary": "Kwong Lung Enterprise Co., Ltd. manufactures and sells apparel in Taiwan, China, Vietnam, and Japan. The company operates through Apparel department, Down Material Department, and Home Textile Department segments. It offers down and bedding; wholesale of outdoor supplies, household wares, clothing, and related packaging materials; food; and import and export of goods and technology. The company provides down products, including natural down, water repellent down, antibacterial deodorant down, color down, and flame retardant, as well as Thermobrid plus products for use in outdoor and home textile. In addition, it provides clothing products, such as snowboard wear, skiing wear, mountain climbing jackets, seamless wind and rain-proof jackets, biking wear, sportswear, jeans, casual jackets and pants, etc. Further, it manufactures winter quilts, cushions, seating pads, sofas, pillows, sleeping bags, gloves, and home decoration products. It also offers bedding products under the Kong lung brand. Kwong Lung Enterprise Co., Ltd. was founded in 1966 and is headquartered in Taipei, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taipei",
        "zipcode": "10682",
        "website": "http://www.klf.com.tw",
        "market_cap": 5269941248
    },
    "9938.TW": {
        "short_name": "TAIWAN PAIHO",
        "long_name": "Taiwan Paiho Limited",
        "summary": "Taiwan Paiho Limited manufactures and sells touch fastener, webbings, elastic, easy tapes, and fabrics in Taiwan and internationally. The company offers general footwear and webbings for garments, shoelaces, and pull strings; touch fasteners; knitted elastic, flat woven elastic, jacquard elastic, and multi-directional textile with elasticity; easy tape products for applications in paper diapers, medical equipment, computer pipelines, outdoor sporting goods, car seats and interiors, and other accessories; bamboo charcoal yarn, bamboo charcoal insulation cotton, recycled pet yarn, and other processed products; powder coating products for use in furniture, appliances, etc.; and jacquard digital woven fabric and jacquard engineered mesh that is used in fabrics for shoes, garments, and hats and bags. It also sells houses and apartment buildings. In addition, the company engages in the production and marketing of computerized embroidery, consumer electronic accessories, chemical fibers, and masks and non-woven products; commercial property management; planning consultant, sale, development, and leasing of real estate; and provision of design decoration services. The company was formerly known as San Ho Hsin Limited and changed its name to Taiwan Paiho Limited in 1986. Taiwan Paiho Limited was founded in 1979 and is headquartered in Changhua, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Changhua",
        "zipcode": "508",
        "website": "http://www.paiho.com",
        "market_cap": 27978819584
    },
    "9944.TW": {
        "short_name": "SHINIH ENTERPRISE CO LTD",
        "long_name": "Shinih Enterprise Co., Ltd.",
        "summary": "Shinih Enterprise Co., Ltd. manufactures and sells non-woven products in Taiwan and internationally. It provides functional insulation products under the THERMOLITE and CLOMAX brand names; non-woven clothes under the Tyvek name; and paddings, such as vertical folding technology and thermobond fiberfill products. The company also offers various automobile carpets comprising head linings, luggage mats, rear trunk upper hoods, rear trunk mats, wheel cover mats, central floor carpets, floor mats, door panels, and bonnet coverings. In addition, it provides spun bound fabric products, such as electrical materials, agriculture cover fabrics, building construction fabrics, and floor fabrics, as well as medical products, daily usage products, and dye printing non-woven fabric products. Further, the company offers various bedding products under the DACRON and CLOMAX brand names. Shinih Enterprise Co., Ltd. has strategic alliances with Invista. The company was founded in 1962 and is headquartered in Taoyuan City, Taiwan.",
        "currency": "TWD",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taoyuan City",
        "zipcode": "33452",
        "website": "http://www.shinih.com.tw",
        "market_cap": 2378532608
    }
}