{
    "CAPMAN.HE": {
        "short_name": "CapMan Plc",
        "long_name": "CapMan Oyj",
        "summary": "CapMan Oyj is a private equity firm specializing in growth capital investments, industry consolidation, middle market buyouts, credit and mezzanine financing in unquoted companies. The firm focuses on mature companies in the non-strategic sectors serving Russia's large middle class. It targets companies in the technology, manufacturing, consumer goods and services, financial services, media, energy, transportation, service, retail, information technology, telecommunications, medical technology, healthcare, life sciences, e-commerce, home improvement, business services, infrastructure, real estate and private healthcare sectors. It can invest in both private as well as listed companies. The firm typically invests in companies based in the Nordic countries and Russia and also targets Central and Eastern Europe. In Russia, it focuses on investments in small and mid-sized companies with a particular focus on rural areas. With respect to middle market buyouts, the firm invests between Â\u008015 million ($16.63 million) and Â\u008075 million ($83.15 million) in equity capital in companies with Net sales between Â\u008050 million ($55.43 million) and Â\u0080300 million ($332.59 million) and/or Â\u008010 million ($12.78 million) to Â\u008030 million ($38.35 million) in mezzanine capital in companies with net sales ranging from Â\u008050 million ($63.92 million) to Â\u0080500 million ($639.27 million) and enterprise values between Â\u00805 million ($6.47 million) to Â\u0080500 million ($673.24 million). Its technology investments range from Â\u00803 million ($3.83 million) to Â\u008015 million ($19.17 million) in companies with sales more than Â\u00802 million ($2.55 million). The firm invests between Â\u00802 million ($2.55 million) and Â\u00807 million ($8.94million) in the life sciences sector in companies with sales between Â\u00802 million ($2.55 million) to Â\u008020 million ($25.57 million). In Russia, it seeks to invest between Â\u00805 million ($6.39 million) to Â\u008015 million ($19.17 million) equity per transaction in companies having enterprise value between Â\u00805 million ($6.39 million) to Â\u008050 million ($63.92 million), sales ranging from Â\u00805 million ($6.39 million) to Â\u0080100 million ($127.85 million). Within infrastructure, it seeks to invest between Â\u008020 million ($22.57 million) and Â\u008050 million ($56.41 million). The firm also targets Nordic publicly listed companies with a market capitalization ranging between Â\u0080100 million ($131.93 million) and Â\u0080700 million ($923.48 million), and a particular focus on undervalued companies. The firm seeks to hold significant minority shareholdings in listed small and mid-cap companies and also prefers to take majority stake in companies. For Russian companies, the firm typically takes equity stake between 10 percent and 49 percent. It typically exits its investments in three to six years through trade sales and IPOs. The firm exits growth companies between four to seven years. CapMan Oyj was founded in 1989 and is based in Helsinki, Finland with additional offices in Stockholm, Sweden; Luxembourg; St. Petersburg, Russia; Copenhagen, Denmark; London, United Kingdom; and Guernsey, Channel Islands.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00130",
        "website": "http://www.capman.com",
        "market_cap": 441462560
    },
    "EAB.HE": {
        "short_name": "EAB Group Oyj",
        "long_name": "EAB Group Oyj",
        "summary": "EAB Group Oyj is a publicly owned investment manager. The firm provides its services to private customers, companies and institutions. It manages mutual funds and special investment funds. The firm primarily invests in equity and fixed income, with a few investments in real estate. EAB Group Oyj is based in Finland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00100",
        "website": "http://www.eabgroup.fi",
        "market_cap": 48309800
    },
    "EQV1V.HE": {
        "short_name": "eQ Oyj",
        "long_name": "eQ Oyj",
        "summary": "eQ Oyj is a publicly owned investment manager. The firm through its subsidiaries provides asset management, corporate finance and investments. The firm specializing in fund of funds investments and secondary transactions. It seeks to make primary investments to funds being raised and to acquire commitments in the secondary market. The firm invests in venture capital and middle market funds, buyout funds, and private equity funds in the technology sector. It seeks to invest in funds based in Baltic States, Northern Europe, North America, South America, Southern Europe, CEE/SEE, Africa, United States, Western Europe, EU, Finland, Benelux, Asia, Germany, Switzerland, United Kingdom, France, Russia/CIS, Nordic Region, the former Soviet republics, and Eastern Europe. In its own funds, it invests predominantly in Northern European and North-American funds that are in the size bracket of Â\u008050 and Â\u0080500 million. In its client mandates, it invests in European buyout funds of any size. Typically the funds we invest in acquire majority positions in target companies. The firm was formerly known as Amanda Capital Oyj. eQ Oyj was founded in 2000 and is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00100",
        "website": "http://www.eq.fi",
        "market_cap": 801694336
    },
    "SIEVI.HE": {
        "short_name": "Sievi Capital plc",
        "long_name": "Sievi Capital Plc",
        "summary": "Sievi Capital Plc is a principal investment firm specializing in capital investments in small and medium-sized enterprises, in turnover and net result in the medium term and long term. The firm focuses on industrial companies, either listed or unlisted. It primarily invests in investments in Denmark, Finland, Iceland, Norway, and Sweden. It seeks to acquire a significant holding and seeks a board seat on its investee companies. The firm also makes financial investments in shares, ETF instruments, structured products, corporate bonds, and other fixed-income investments. It seeks to have majority stakes. For financial investments, it holds its investments for less than three years. It seeks to make balance sheet investments. The firm was formerly known as Scanfil plc and changed its name to Sievi Capital Oyj in 2011. Sievi Capital Plc is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00100",
        "website": "http://www.sievicapital.fi/en/",
        "market_cap": 78871152
    },
    "TAALA.HE": {
        "short_name": "Taaleri Oyj",
        "long_name": "Taaleri Oyj",
        "summary": "Taaleri Oyj is a publicly owned asset management holding company. The firm provides its services to private individuals, institutional investors and companies. Through its subsidiaries, the firm provides wealth management and trading services to its clients. It launches equity, fixed income, and real estate mutual funds through its subsidiaries. Through its subsidiaries, the firm invests in the public equity, fixed income, and real estate markets across the globe. It was formerly known as Taaleritehdas Oyj. Taaleri Oyj is based in Helsinki, Finland with additional offices in Tampere, Finland; Turku, Finland; Pori, Finland; Oulu, Finland; and Lahti, Finland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00130",
        "website": "http://www.taaleri.com/fi",
        "market_cap": 295793504
    },
    "TITAN.HE": {
        "short_name": "Titanium Oyj",
        "long_name": "Titanium Oyj",
        "summary": "Titanium Oyj operates as a fund management company in Finland. The company offers services in the areas of asset management, mutual funds, investment funds, insurance mediation, securities brokerage, and investment advisory. It serves retail investors, businesses, and institutions. It serves retail investors, businesses, and institutions. The company was founded in 2009 and is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00100",
        "website": "http://www.titanium.fi",
        "market_cap": 132102952
    },
    "WE3.F": {
        "short_name": "SIEVI CAPITAL OYJ",
        "long_name": "Sievi Capital Plc",
        "summary": "Sievi Capital Plc is a principal investment firm specializing in capital investments in small and medium-sized enterprises, in turnover and net result in the medium term and long term. The firm focuses on industrial companies, either listed or unlisted. It primarily invests in investments in Denmark, Finland, Iceland, Norway, and Sweden. It seeks to acquire a significant holding and seeks a board seat on its investee companies. The firm also makes financial investments in shares, ETF instruments, structured products, corporate bonds, and other fixed-income investments. It seeks to have majority stakes. For financial investments, it holds its investments for less than three years. It seeks to make balance sheet investments. The firm was formerly known as Scanfil plc and changed its name to Sievi Capital Oyj in 2011. Sievi Capital Plc is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Asset Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00100",
        "website": "http://www.sievicapital.fi/en/",
        "market_cap": 76352688
    }
}