{
  "ACG1V.HE": {
    "city": "Espoo",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Electronic Components",
    "long_name": "Aspocomp Group Oyj",
    "market": "fi_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "Aspocomp Group Plc",
    "state": null,
    "summary": "Aspocomp Group Oyj manufactures and sells printed circuit boards (PCBs) in Finland, Europe, and internationally. It offers high density interconnection, multilayer, high speed digital, advanced high density interconnection, and high frequency PCBs, as well as PCBs with component cooling. The company's PCB's are used in various applications in automotive electronics, semiconductor industry, telecommunication infrastructure, and industrial electronics as well as security, and defense and aerospace sectors. It also provides design support, logistics, volume supply, and PCB trading services. Aspocomp Group Oyj was founded in 1999 and is headquartered in Espoo, Finland.",
    "website": "http://aspocomp.com",
    "zipcode": "02150"
  },
  "ICP1V.HE": {
    "city": "Helsinki",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Electronic Components",
    "long_name": "Incap Oyj",
    "market": "fi_market",
    "market_cap": "Micro Cap",
    "sector": "Technology",
    "short_name": "Incap Corporation",
    "state": null,
    "summary": "Incap Oyj, together with its subsidiaries, provides electronics manufacturing services in Europe, North-America, South-America, Asia, Africa, and Australia. The company offers PCB assembly and manufacturing, box-build assembly, and prototyping and engineering services, as well as cable, wire harness, and magnetic assemblies. It also offers prototypes and pre-series; and tester development products. The company serves aerospace, automotive, consumer electronics, data storage and media, defense, environment/green energy, food and vending, industrial controls and automation, medical, oil and gas mining, power, security, scientific/ instrumentation, telecom, and transport and infrastructure sectors. Incap Oyj was incorporated in 1985 and is headquartered in Helsinki, Finland.",
    "website": "http://incapcorp.com",
    "zipcode": "00180"
  },
  "S0A.MU": {
    "city": "Sievi",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "MUN",
    "industry": "Electronic Components",
    "long_name": "Scanfil Oyj",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "SCANFIL OYJ",
    "state": null,
    "summary": "Scanfil Oyj operates as a contract manufacturer and system supplier for the electronics industry worldwide. The company provides product design, product manufacturing, material procurement and logistics solutions, as well as after-sales services, such as maintenance and spare parts services. It also offers video surveillance systems and equipment, communications network devices, audio communications products, health technology devices and systems, electricity and automation system modules, renewable energy production converters and inverters, frequency converters, elevator and forklift control systems, analyzers, lift control systems, analyzers, various slot and vending machines, defense industry devices, and meteorological instruments. The company serves customers in communication, consumer applications, energy and automation, industrial, and medtech and life science, as well as companies operating in fields related to urbanization. The company was founded in 1976 and is headquartered in Sievi, Finland.",
    "website": "http://www.scanfil.com",
    "zipcode": "85410"
  },
  "SCANFL.HE": {
    "city": "Sievi",
    "country": "Finland",
    "currency": "EUR",
    "exchange": "HEL",
    "industry": "Electronic Components",
    "long_name": "Scanfil Oyj",
    "market": "fi_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "Scanfil Plc",
    "state": null,
    "summary": "Scanfil Oyj operates as a contract manufacturer and system supplier for the electronics industry worldwide. The company provides product design, product manufacturing, material procurement and logistics solutions, as well as after-sales services, such as maintenance and spare parts services. It also offers video surveillance systems and equipment, communications network devices, audio communications products, health technology devices and systems, electricity and automation system modules, renewable energy production converters and inverters, frequency converters, elevator and forklift control systems, analyzers, lift control systems, analyzers, various slot and vending machines, defense industry devices, and meteorological instruments. The company serves customers in communication, consumer applications, energy and automation, industrial, and medtech and life science, as well as companies operating in fields related to urbanization. The company was founded in 1976 and is headquartered in Sievi, Finland.",
    "website": "http://www.scanfil.com",
    "zipcode": "85410"
  }
}
