{
    "49U.F": {
        "short_name": "MUSTI GROUP OYJ",
        "long_name": "Musti Group Oyj",
        "summary": "Musti Group Oyj operates as a pet care specialist in Finland, Sweden, and Norway. The company offers a range of pet products in the food and non-food categories under own and third-party brands. It also provides pet grooming, nail clipping, body maintenance, and dietary planning, as well as veterinary and training services. The company sells its products under the Musti ja Mirri, Arken Zoo, Musti, Djurmagazinet, Peten Koiratarvike, Vetzoo, and Animail brands. As of September 30, 2020, it operated 293 owned and franchised stores, as well as online stores. The company was founded in 1988 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00620",
        "website": "http://www.mustigroup.com",
        "market_cap": 969012224
    },
    "FONDIA.HE": {
        "short_name": "Fondia Oyj",
        "long_name": "Fondia Oyj",
        "summary": "Fondia Oyj provides legal services primarily in Finland, Sweden, Estonia, and Lithuania. The company offers legal department as a service; legal advisory services for public and private companies, real estate companies, investors, growth companies, associations, and trusts; and legal services in the area of taxation. It also provides dispute resolution services relating to employment, manager, and shareholder agreements; construction; delivery, service, and co-operation agreements; IT agreements; franchising agreements; sales, lease, and trade agreements; unfair trading and IPR cases; claims for damages; and various criminal cases. In addition, the company offers various service packages, including startup shareholders' agreement; and data protection officer as a service. Fondia Oyj was founded in 2004 and is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00100",
        "website": "http://fondia.com/en",
        "market_cap": 29758646
    },
    "HARVIA.HE": {
        "short_name": "Harvia Plc",
        "long_name": "Harvia Oyj",
        "summary": "Harvia Oyj, through its subsidiaries, manufactures and distributes traditional, steam, and infrared saunas. The company offers sauna heaters, sauna rooms, control units, and steam generators; sauna heater spare parts, sauna stones, hot water containers, steam room elements, sauna lighting solutions, and waterproof sauna speakers; and sauna accessories, such as sauna scents, buckets, ladles, and thermometers. It also provides wood-heated saunas; precut saunas and saunas interior products; ready-made saunas; infrared cabins and tailor-made infrared saunas; spa products, including spa modules and accessories, steam generators, and luminous; and cooking and home heating products. In addition, the company offers sauna installation, maintenance, and repair services; and infrared radiators and sauna equipment. Further, it engages in real estate business. The company offers its products to retailers and wholesalers through a network of dealers. It operates in Finland, Germany, other Scandinavia countries, other EU countries, Russia, North America, and internationally. Harvia Oyj was founded in 1950 and is headquartered in Muurame, Finland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Muurame",
        "zipcode": "40951",
        "website": "http://www.harvia.fi",
        "market_cap": 750429056
    },
    "MUSTI.HE": {
        "short_name": "Musti Group Plc",
        "long_name": "Musti Group Oyj",
        "summary": "Musti Group Oyj operates as a pet care specialist in Finland, Sweden, and Norway. The company offers a range of pet products in the food and non-food categories under own and third-party brands. It also provides pet grooming, nail clipping, body maintenance, and dietary planning, as well as veterinary and training services. The company sells its products under the Musti ja Mirri, Arken Zoo, Musti, Djurmagazinet, Peten Koiratarvike, Vetzoo, and Animail brands. As of September 30, 2020, it operated 293 owned and franchised stores, as well as online stores. The company was founded in 1988 and is headquartered in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "state": null,
        "city": "Helsinki",
        "zipcode": "00620",
        "website": "http://www.mustigroup.com",
        "market_cap": 1031014592
    }
}