{
    "PBY-UN.TO": {
        "short_name": "CANSO CREDIT INCOME FUND UNITS",
        "long_name": "Canso Credit Trust - Canso Credit Income Fund",
        "summary": "Canso Credit Trust - Canso Credit Income Fund is a closed ended fixed income mutual fund launched by Lysander Funds Limited. The fund is managed by Canso Investment Counsel Ltd. It invests in the fixed income markets of Canada. The fund primarily invests in corporate bonds. It employs fundamental analysis with bottom-up and deep value approach to create its portfolio. The fund benchmarks the performance of its portfolio against the DEX Universe Corporate Bond Index. Canso Credit Trust - Canso Credit Income Fund was formed on July 16, 2010 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Richmond Hill",
        "zipcode": "L4B 1J8",
        "website": "http://lysanderfunds.com/canso-credit-income-fund",
        "market_cap": 210276608
    },
    "WFS.TO": {
        "short_name": "WORLD FINANCIAL SPLIT CORP",
        "long_name": "World Financial Split Corp.",
        "summary": "World Financial Split Corp is an equity mutual fund launched and managed by Strathbridge Asset Management Inc. It invests in public equity markets across the globe. The fund also invests some portion of its portfolio in derivative instruments. It invests in the stocks of companies operating in the financial services sector. The fund invests in the stocks of large cap companies. World Financial Split Corp was formed on December 5, 2003 and is domiciled in Canada.",
        "currency": "CAD",
        "sector": "Financial",
        "industry": "Asset Management",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "state": "ON",
        "city": "Toronto",
        "zipcode": "M5H 3T9",
        "website": null,
        "market_cap": 3563220
    }
}