{
    "169.F": {
        "short_name": "AEROPORTO GUG.MARCO.D.BO.",
        "long_name": "Aeroporto Guglielmo Marconi di Bologna S.p.A.",
        "summary": "Aeroporto Guglielmo Marconi di Bologna S.p.A. develops, manages, and maintains an airport in Bologna. The company operates through Aviation, Non-Aviation, and Other segments. It manages and develops the airport infrastructure of Bologna, including terminal, baggage sorting, car parking, traffic, and cargo storage, as well as airside areas. The company also provides security services and services to passengers with reduced mobility; offers information to the public and airport users; operates as a handler for general aviation; develops, revamps, and expands airport infrastructure, including installations and equipment; and handles cargo and mail at the airport. In addition, it offers parking management services; retail sub concessions and advertising space services; and car rentals and business lounge services, as well as manages real estate properties. Aeroporto Guglielmo Marconi di Bologna S.p.A. is based in Bologna, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "BO",
        "city": "Bologna",
        "zipcode": "40132",
        "website": "http://www.bologna-airport.it",
        "market_cap": "Small Cap"
    },
    "1F8.F": {
        "short_name": "FINCANTIERI SPA  O.N.",
        "long_name": "Fincantieri S.p.A.",
        "summary": "Fincantieri S.p.A. operates in the shipbuilding industry. The company operates in three segments: Shipbuilding; Offshore and Specialized Vessels; and Equipment, Systems and Services. The Shipbuilding segment designs and constructs cruise ships; ferries, including cruise, Ro-Pax, and due fuel ferries; naval vessels, such as aircraft carriers, destroyers, frigates, corvettes, patrol vessels, amphibious and logistic support ships, multirole and research vessels, special vessels, and submarines; and mega yachts, as well as expedition cruise vessels. The Offshore and Specialized Vessels segment designs and constructs offshore support vessels, specialized ships, and vessels for offshore wind farms and open ocean aquaculture, as well as other products in the field of drill ships and semi-submersible drilling rigs. This segment also provides electrical systems, including engineering, manufacturing, installation, integration testing, and commissioning services. The Equipment, Systems and Services segment provides stabilization, propulsion, and positioning and power generation systems; ship automation systems, steam turbines, and ship accommodation systems; entertainment systems and steel structures; cabins and public areas; catering; and electric, electronic, and electromechanical integrated systems. This segment also offers ship repairs, refitting, refurbishment, conversions, and product lifecycle management services, as well as after-sales support services. In addition, it is involved in the dry-dock management; project management; accommodation installation; and pipe installation. Further, the company provides electrical parts, technical and logistics engineering services, and ship interiors. It primarily serves ship owners and the defense sector worldwide. The company was founded in 1959 and is based in Trieste, Italy. Fincantieri S.p.A. is a subsidiary of CDP Industria S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "TS",
        "city": "Trieste",
        "zipcode": "34121",
        "website": "http://www.fincantieri.com",
        "market_cap": "Small Cap"
    },
    "29O.F": {
        "short_name": "CARRARO S.P.A.  EO 0,52",
        "long_name": "Carraro S.p.A.",
        "summary": "Carraro S.p.A. manufactures and sells power transmission systems for tractors and off-highway vehicles in Italy, other European countries, North and South America, Asia, and other non-European countries. The company gears, axles, and transmissions systems for agricultural, construction, and automotive equipment; tractors; transmission/engine systems for the material handling industry; and high-precision gears and drive shafts for industrial plants, escalators, robotics, and wind turbines, as well as for the railway industry. It also provides engineering and after sales services; and original spare parts. The company was founded in 1932 and is headquartered in Campodarsego, Italy. Carraro S.p.A. is a subsidiary of Finaid S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "PD",
        "city": "Campodarsego",
        "zipcode": "35011",
        "website": "http://www.carraro.com",
        "market_cap": "Micro Cap"
    },
    "2EJ.F": {
        "short_name": "BIANCAMANO S.P.A. EO -,01",
        "long_name": "Biancamano S.p.A.",
        "summary": "Biancamano S.p.A., together with its subsidiaries, operates in the environmental hygiene sector. The company provides integrated waste management services, including treatment of the organic fraction, re-use and recycling of materials, incineration and waste-to-energy, and landfilling. It is also involved in the management of municipal hygiene services for local authorities and large private businesses. The company was founded in 1973 and is based in Rozzano, Italy. Biancamano S.p.A. is a subsidiary of Biancamano Holding SA.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Rozzano",
        "zipcode": "20089",
        "website": "http://www.gruppobiancamano.it",
        "market_cap": "Nano Cap"
    },
    "2GV.F": {
        "short_name": "TESMEC S.P.A.",
        "long_name": "Tesmec S.p.A.",
        "summary": "Tesmec S.p.A. designs, produces, and markets products and solutions for the construction, maintenance, and streamlining of infrastructures relating to the transmission of electrical power, data, and material transport in Italy, rest of Europe, the Middle East, Africa, North and Central America, and BRIC and other countries. It operates through Energy, Trencher, and Rail segments. The company offers stringing machines, accessories, and tools, including winches, pullers, tensioners, puller-tensioners, reel and drum elevators, ropes, pulleys, head boards, trolleys, light alloy structures, and safety devices, as well as additional devices, equipment, and accessories for underground cables laying. It also provides energy automation products comprising powerline communication systems, teleprotection equipment, remote terminal units, smart metering tools, protection relays, T-protection and measure relays, directional fault detectors, portable discoverers, pole discoverers, and smart sensors; and engineering, integration, training, commissioning, and after-sale support services. In addition, the company offers trenchers, surface miners, multifunctional machines, georadar explorer accessories, minitrenches, automatic machine guidance systems, control systems, and remote monitoring systems; and railway catenary installation products, including constant tension stringing units, catenary maintenance multipurpose units, track maintenance units, and the pantograph for catenary parameters measurement. Further, it provides consultancy and excavation services for power lines and fiber optic cables. Tesmec S.p.A. was founded in 1951 and is headquartered in Grassobbio, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "BG",
        "city": "Grassobbio",
        "zipcode": "24050",
        "website": "http://www.tesmec.com",
        "market_cap": "Micro Cap"
    },
    "2ZP.F": {
        "short_name": "AVIO S.P.A.",
        "long_name": "Avio S.p.A.",
        "summary": "Avio S.p.A., through its subsidiaries, engages in the construction and development of space launchers, and solid and liquid propulsion systems for space travel in Italy and internationally. The company offers propulsion boosters, liquid oxygen turbo pumps, and aerodynamic control surfaces, motors, as well as tactical products, such as sensor block and ECU. It offers space launchers under the VEGA and ARIANE names. Avio S.p.A. has a strategic partnership with SoftInWay Group Inc. to develop new propulsion systems for small satellite launchers. The company was founded in 1984 and is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00187",
        "website": "http://www.avio.com",
        "market_cap": "Small Cap"
    },
    "3K4.F": {
        "short_name": "SCIUKER FRAMES SPA",
        "long_name": "Sciuker Frames S.p.A.",
        "summary": "Sciuker Frames S.p.A. designs, manufactures, and sells aluminum wood and structural glass wood windows in Italy. It also offers aluminum shutters. The company is headquartered in Contrada, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "AV",
        "city": "Contrada",
        "zipcode": "83020",
        "website": "http://www.sciuker.it",
        "market_cap": "Micro Cap"
    },
    "3OM.F": {
        "short_name": "OPENJOBMETIS S.P.A.  EO 1",
        "long_name": "Openjobmetis S.p.A.",
        "summary": "Openjobmetis S.p.A. operates as an employment agency in Italy. It offers temporary or permanent placement, staff leasing, personnel recruitment and selection, training, and outplacement services, as well as manages employment relationship from the bureaucratic-administrative aspects to training. The company also provides digital head hunting services; family assistants for elderly and non-self-sufficient; and online recruitment services for people with disabilities. It offers its services to the naval, industrial, health, large-scale retail trade, bank and finance, information and communication technology, agro-industrial, hotel, restaurant, and catering sectors. Openjobmetis S.p.A. was founded in 2011 and is headquartered in Gallarate, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "VA",
        "city": "Gallarate",
        "zipcode": "21013",
        "website": "http://www.openjobmetis.it",
        "market_cap": "Micro Cap"
    },
    "3OY1.F": {
        "short_name": "MAIRE TECNIMONT SPA",
        "long_name": "Maire Tecnimont S.p.A.",
        "summary": "Maire Tecnimont S.p.A. provides plant engineering services and works in Italy and internationally. The company's Hydrocarbons segment designs and constructs plants, including separation, treatment, liquefaction, transportation, storage, regasification, and compression and pumping stations principally for the natural gas chain; and chemical and petrochemical industry plants for the production of polyethylene and polypropylene, ethylene oxide, ethylene glycol, purified terephthalic acid, ammonia, urea, and fertilizers; and hydrocarbon electric power plants, and waste-to-energy and district heating plants. This segment also issues licenses on patented technology and proprietary know-how to urea producers; and is involved in activities related to sulphur recovery process, hydrogen production, and high temperature furnaces. The company's Green Energy segment offers mechanical plastics recycling and promotion of recycled chemicals; and develops additives and substitutes to oil for fuels or plastics from renewables activities. In addition, this segment provides maintenance and facility management services; general services for temporary construction facilities; and infrastructure design and construction services. Further, it undertakes works on renewables sector plants, which primarily include solar and wind plants. The company is headquartered in Milan, Italy. Maire Tecnimont S.p.A. is a subsidiary of GLV Capital S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20124",
        "website": "http://www.mairetecnimont.com",
        "market_cap": "Small Cap"
    },
    "3S0.F": {
        "short_name": "F.I.L.A. S.P.A.",
        "long_name": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A.",
        "summary": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A. produces and markets coloring, designing, modelling, writing, and painting objects worldwide. It provides pencils, crayons, modelling clays, chalks, oil colours, acrylics, watercolors, paints, and paper products for the fine arts, school, and leisure sectors. The company offers its products under the GIOTTO, DAS, LYRA, Canson, Maimeri, Daler-Rowney Lukas, Ticonderoga, Pacon, Strathmore, Princeton, and Arches brands. It sells its products through a distribution network of 35 commercial branches to wholesalers, office/school suppliers, mass-market retailers, distributors, and B2B operators, as well as online channels. The company was founded in 1920 and is headquartered in Pero, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Pero",
        "zipcode": "20016",
        "website": "http://www.filagroup.it",
        "market_cap": "Small Cap"
    },
    "4YQ.F": {
        "short_name": "GVS S.P.A.",
        "long_name": "GVS S.p.A.",
        "summary": "GVS S.p.A., together with its subsidiaries, produces and sells plastic filters and components for healthcare, life science, automotive, appliance, safety, and commercial and industrial filtration applications in Italy and internationally. It offers health care products, such as healthcare gas/air and liquid filtration products for anesthesia, surgery insufflation, ventilation, blood filtration, transfusion, infusion, and hemodialysis; and syringe and capsule filters, liquid sample microbiology products, and protein microarray products, as well as microporous filtration, protein transfer, and nucleic acid binding membranes for laboratory solutions. The company also offers automotive products, including fuel and diesel injector, ABS/ESP-braking, steering and transmission, fuel tank, and SCR technology-urea filters, as well as ventilation membranes and throttle bodies; and sheet and panel filters, bag and cartridge filters, HEPA and high capacity HEPA products, carbon and molecular filtration products, and accessories and housings for commercial and industrial applications. In addition, it provides cylinder and conical, circular, radial or standard, square or rectangular, and pad and pre-filters for use in appliances; respiratory safety and bio-safety products for personal protection applications; and OEM membranes comprising polyethersulfone, polycarbonate track etched, polyester track etched, polyvinylidene difluoride, nylon, nitrocellulose, cellulose acetate, and rigenerated cellulose membranes. GVS S.p.A. was formerly known as GVS S.r.l. and changed its name to GVS S.p.A. in 20001. The company was founded in 1979 and is based in Zola Predosa, Italy. GVS S.p.A. operates as a subsidiary of GVS Group S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "BO",
        "city": "Zola Predosa",
        "zipcode": "40069",
        "website": "http://www.gvs.com",
        "market_cap": "Mid Cap"
    },
    "6JG.F": {
        "short_name": "OSAI AUTOMATION SYSTEM",
        "long_name": "OSAI Automation System S.p.A.",
        "summary": "OSAI Automation System S.p.A. engages in the automation and robotics, electronic, laser micromachining, and semiconductor businesses in Italy and internationally. Its Automation and Robotics division offers Benches, an ergonomically designed modular workbench; rotary tables; lines; modular assembly line; and NeoTray, a vertical magazine suitable to manage blister for loading/unloading purpose. The company's Electronic division offers scalable and modular odd-shape assemblies, including Neoplace 304 modula for assembling ODD-shapes; Neomark Easy, a topnotch equipment for customer who need in line machines; Neo router modular, a solution for mechanical separation of PCB panels; Neocut Shape, which performs cutting operations without mechanical stresses on components; and NeoTray, a vertical magazine suitable to manage blister for loading/unloading purpose. The company's Semiconductor division provides Osai neohandler, a notch solution for semiconductor companies for testing MEMS and power devices in mass production; Osai power module test handler, an equipment for testing power modules; and Osai's burn-in loader/unloader solutions for pre-test operations. Its Laser Micromachining division offers DM2c, a laser marking system; fineweld 300, a laser welding system; fineplast 140R, a system for welding plastic components; and finecut 300, a system to laser cut metallic components. The company was founded in 1991 and is based in Turin, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "TO",
        "city": "Turin",
        "zipcode": "10010",
        "website": "http://www.osai-as.com",
        "market_cap": "Micro Cap"
    },
    "7PI.F": {
        "short_name": "POSTE ITALIANE SPA EO-,51",
        "long_name": "Poste Italiane SpA",
        "summary": "Poste Italiane SpA provides postal, logistics, and financial and insurance products and services in Italy. It operates in four segments: Mail, Parcels and Distribution; Payments, Mobile and Digital; Financial Services; and Insurance Services. The Mail, Parcels and Distribution segment offers letter post, express delivery, logistics, parcels, and philately services. As of December 31, 2020, it operated a network of 12,765 post offices in Italy. The Payments, Mobile and Digital segment provides payment services, card payments, and mobile telecommunications services, as well as digital services for the public sector. The Financial Services segment is involved in the collection of various forms of savings deposits; provision of payment and foreign currency exchange services, as well as investment services; and promotion and arrangement of loans issued by banks and other authorized financial institutions. The Insurance Services segment offers life and casualty insurance products. Poste Italiane SpA was founded in 1862 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00144",
        "website": "http://www.posteitaliane.it",
        "market_cap": "Large Cap"
    },
    "7UP.F": {
        "short_name": "CLABO S.P.A.",
        "long_name": "Clabo S.p.A.",
        "summary": "Clabo S.p.A. designs, produces, and distributes refrigerated showcases and furniture for the food retail market worldwide. It offers refrigerated showcases for ice-cream and pastry products exhibition and conservation; and furniture for bars, pastry parlors, cafÃ©s, and canteens under the ORION, FB, ARTIC, BOCCHINI, and EASY BEST brand names. The company was founded in 2001 and is headquartered in Jesi, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "AN",
        "city": "Jesi",
        "zipcode": "60035",
        "website": "http://www.clabo.it",
        "market_cap": "Nano Cap"
    },
    "9KI.F": {
        "short_name": "IGEAMED S.P.A.",
        "long_name": "Igeamed S.p.A.",
        "summary": "Igeamed S.p.A. provides consulting, engineering, training, and medical services. The company offers EHS consulting services, such as health and safety, environmental, and energy management; engineering services, including process safety, maintenance engineering, safety engineering, and infrastructure engineering; and corporate healthcare services comprising occupational medicine, workplace health promotion, and corporate welfare, as well as consultancy services related to green power projects. It also provides business assurance, product control and development, infrastructure control, and innovation and smart industry solutions; training solutions for risk management and managerial competence comprising EHS Future Academy, Corporate Future Academy, and Business Assurance Academy; and digital software solutions for the safety in the workplace, risk assessment, and management of corporate assets. The company was founded in 1979 and is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00153",
        "website": "http://www.igeam.it",
        "market_cap": null
    },
    "9NM.F": {
        "short_name": "COMAL S.P.A.",
        "long_name": "Comal S.p.A.",
        "summary": "Comal S.p.A. engages in the design and construction of photovoltaic systems in Italy and South Africa. It offers equipment and machinery maintenance services for thermal energy production plants; alternator and turbine maintenance services; sun hunter tracker services; and shelter services. The company was founded in 2001 and is headquartered in Montalto di Castro, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "VT",
        "city": "Montalto Di Castro",
        "zipcode": "01014",
        "website": "http://www.comalgroup.com",
        "market_cap": "Nano Cap"
    },
    "ACI.F": {
        "short_name": "ASTALDI S.P.A.  O.N.",
        "long_name": "Astaldi S.p.A.",
        "summary": "Astaldi S.p.A. designs, develops, and operates public infrastructure and civil engineering works in Italy and internationally. It undertakes transport infrastructure projects, including roads, bridges/viducts, railways, undergrounds, subways, stations, motorways, and tunnels; water and energy plants, such as hydroelectric plants, dams, aqueducts, and power stations. It is also involved in the civil and industrial buildings comprising schools, hospitals, underground rail stations, car parks, and exhibition spaces; and plant design and engineering, as well as offers operation and maintenance services. The company was founded in 1929 and is headquartered in Rome, Italy. Astaldi S.p.A. is a subsidiary of Webuild S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00156",
        "website": "http://www.astaldi.com",
        "market_cap": "Small Cap"
    },
    "ADB.MI": {
        "short_name": "AEROPORTO GUGLIELMO MARCONI DI ",
        "long_name": "Aeroporto Guglielmo Marconi di Bologna S.p.A.",
        "summary": "Aeroporto Guglielmo Marconi di Bologna S.p.A. develops, manages, and maintains an airport in Bologna. The company operates through Aviation, Non-Aviation, and Other segments. It manages and develops the airport infrastructure of Bologna, including terminal, baggage sorting, car parking, traffic, and cargo storage, as well as airside areas. The company also provides security services and services to passengers with reduced mobility; offers information to the public and airport users; operates as a handler for general aviation; develops, revamps, and expands airport infrastructure, including installations and equipment; and handles cargo and mail at the airport. In addition, it offers parking management services; retail sub concessions and advertising space services; and car rentals and business lounge services, as well as manages real estate properties. Aeroporto Guglielmo Marconi di Bologna S.p.A. is based in Bologna, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BO",
        "city": "Bologna",
        "zipcode": "40132",
        "website": "http://www.bologna-airport.it",
        "market_cap": "Small Cap"
    },
    "AEU.F": {
        "short_name": "PRYSMIAN S.P.A.  EO 0,10",
        "long_name": "Prysmian S.p.A.",
        "summary": "Prysmian S.p.A. produces, distributes, and sells cables and systems, and related accessories for the energy and telecommunications industries worldwide. The company operates through three segments: Energy, Projects, and Telecom. The Energy segment comprising trade and installers; power distribution and overhead transmission lines; and industrial and network components for various industries, which includes oil and gas, downhole technology, elevators, automotive, nuclear, mining, marine, and infrastructure sectors, as well as for renewable energy field, military, railways, and cranes. The Projects segment designs, manufactures, and installs high and extra high voltage cables for underground and submarine power transmission; high voltage cabling systems for terrestrial and submarine applications; provides submarine interconnections between countries and between off shore wind farms and the mainland, which is used for generation and distribution of electricity. The Telecom segment manufactures cable systems and connectivity products comprising optical fiber, optical cables, connectivity components and accessories, optical ground wires, and copper cables used in telecommunication networks. Prysmian S.p.A. is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20126",
        "website": "http://www.prysmiangroup.com",
        "market_cap": "Mid Cap"
    },
    "ALEAC.PA": {
        "short_name": "EDILIZIACROBATICA",
        "long_name": "EdiliziAcrobatica S.p.A.",
        "summary": "EdiliziAcrobatica S.p.A. engages in the outdoor construction works in Italy. It provides a range of services, such as renovation, restoration, cleaning, and installation and maintenance. The company was founded in 1994 and is headquartered in Genova, Italy. EdiliziAcrobatica S.p.A. is a subsidiary of Arim Holding S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Italy",
        "state": "GE",
        "city": "Genova",
        "zipcode": "16129",
        "website": "http://www.ediliziacrobatica.com",
        "market_cap": "Micro Cap"
    },
    "AST.MI": {
        "short_name": "ASTALDI",
        "long_name": "Astaldi S.p.A.",
        "summary": "Astaldi S.p.A. designs, develops, and operates public infrastructure and civil engineering works in Italy and internationally. It undertakes transport infrastructure projects, including roads, bridges/viducts, railways, undergrounds, subways, stations, motorways, and tunnels; water and energy plants, such as hydroelectric plants, dams, aqueducts, and power stations. It is also involved in the civil and industrial buildings comprising schools, hospitals, underground rail stations, car parks, and exhibition spaces; and plant design and engineering, as well as offers operation and maintenance services. The company was founded in 1929 and is headquartered in Rome, Italy. Astaldi S.p.A. is a subsidiary of Webuild S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00156",
        "website": "http://www.astaldi.com",
        "market_cap": "Small Cap"
    },
    "AT.MI": {
        "short_name": "ASTM",
        "long_name": "ASTM S.p.A.",
        "summary": "ASTM S.p.A., an industrial holding company, operates in the sectors of motorway management, infrastructure engineering and construction projects, and transport and mobility technology. The company operates through five segments: Motorway Sector (Operating Activities), Motorway/EPC Sector Planning and Construction Activities-IFRIC 12, EPC Sector, Technology Sector, Services Sector. As of June 30, 2020, the company managed a motorway network of approximately 4,594 km, which included 1,423 km network in Italy, as well as 3,171 km located internationally. It also designs and builds principal transport infrastructure works, roads, motorways, railways, underground railways, bridges, viaducts, and tunnels; and civil and industrial construction works, such as hospitals, shopping centers, and airports, as well as electrical and electromechanical systems. In addition, the company designs, builds, and manages infrastructure network monitoring systems, info mobility products, toll collection products, etc.; develops technological software, primarily application software that manages road databases; and engages in the engineering and integration of technologies and instruments to carry out tools for photographic, geometric, and topographic surveys of infrastructures. Further, it develops and implements technologies in the service of safety and assisted driving of vehicles; and operates in the lease sector of both fiber optics and sites for the positioning of transmission devices for companies operating in the mobile telephony sector. Additionally, ASTM S.p.A. is involved in the design, construction, and management of systems for safety, mobility information, toll collection, and telecommunications. The company was formerly known as Autostrada Torino Milano S.p.A. and changed its name to ASTM S.p.A. in January 2013. ASTM S.p.A. was founded in 1928 and is based in Turin, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TO",
        "city": "Turin",
        "zipcode": "10144",
        "website": "http://www.astm.it",
        "market_cap": "Mid Cap"
    },
    "ATASF": {
        "short_name": "ATLANTIA SPA",
        "long_name": "Atlantia SpA",
        "summary": "Atlantia SpA, through its subsidiaries, engages in the construction and operation of motorways, airports and transport infrastructure, parking areas, and intermodal systems worldwide. It operates and manages approximately 13,000 kilometers of toll motorways. The company manages, maintains, constructs, and widens related motorways operated under concession; and provides support for the Italian motorway operators. It also operates and expands Rome's Fiumicino and Ciampino airports; and operates the airports of Nice, Cannes-Mandelieu, and Saint-Tropez. In addition, the company engages in the design, project management, controlling, and maintenance of road and airport infrastructures; and operation of toll payment systems, as well as provides assistance and toll management services. Further, it operates free-flow tolling systems, traffic and transport management systems, and electronic payment systems. Additionally, the company offers insurance brokerage, as well as engineering services. Atlantia SpA was incorporated in 1950 and is headquartered in Rome, Italy.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00159",
        "website": "http://www.atlantia.it",
        "market_cap": "Large Cap"
    },
    "ATASY": {
        "short_name": "ATLANTIA SPA",
        "long_name": "Atlantia SpA",
        "summary": "Atlantia SpA, through its subsidiaries, engages in the construction and operation of motorways, airports and transport infrastructure, parking areas, and intermodal systems worldwide. It operates and manages approximately 13,000 kilometers of toll motorways. The company manages, maintains, constructs, and widens related motorways operated under concession; and provides support for the Italian motorway operators. It also operates and expands Rome's Fiumicino and Ciampino airports; and operates the airports of Nice, Cannes-Mandelieu, and Saint-Tropez. In addition, the company engages in the design, project management, controlling, and maintenance of road and airport infrastructures; and operation of toll payment systems, as well as provides assistance and toll management services. Further, it operates free-flow tolling systems, traffic and transport management systems, and electronic payment systems. Additionally, the company offers insurance brokerage, as well as engineering services. Atlantia SpA was incorporated in 1950 and is headquartered in Rome, Italy.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00159",
        "website": "http://www.atlantia.it",
        "market_cap": "Large Cap"
    },
    "ATH.MI": {
        "short_name": "AMBIENTHESIS",
        "long_name": "Ambienthesis S.p.A.",
        "summary": "Ambienthesis S.p.A. engages in the remediation, environmental remediation and treatment, recovery, and disposal of special, hazardous, and non-hazardous waste in Italy. The company designs, constructs, and manages systems for the disposal and recovery of industrial waste, as well as energy production; provides disposal services to various civil and industrial liquid waste; and stores various waste, such as batteries, paint, T/F containers, drugs, acids, bases, and reagents. It also offers remediation of contaminated sites. In addition, it installs fixed waste treatment/recovery plants and mobile systems. The company is based in Segrate, Italy. Ambienthesis S.p.A. is a subsidiary of Greenthesis SpA.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Segrate",
        "zipcode": "20090",
        "website": "http://www.ambienthesis.it",
        "market_cap": "Micro Cap"
    },
    "ATL.MI": {
        "short_name": "ATLANTIA",
        "long_name": "Atlantia SpA",
        "summary": "Atlantia SpA, through its subsidiaries, engages in the construction and operation of motorways, airports and transport infrastructure, parking areas, and intermodal systems worldwide. It operates and manages approximately 13,000 kilometers of toll motorways. The company manages, maintains, constructs, and widens related motorways operated under concession; and provides support for the Italian motorway operators. It also operates and expands Rome's Fiumicino and Ciampino airports; and operates the airports of Nice, Cannes-Mandelieu, and Saint-Tropez. In addition, the company engages in the design, project management, controlling, and maintenance of road and airport infrastructures; and operation of toll payment systems, as well as provides assistance and toll management services. Further, it operates free-flow tolling systems, traffic and transport management systems, and electronic payment systems. Additionally, the company offers insurance brokerage, as well as engineering services. Atlantia SpA was incorporated in 1950 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00159",
        "website": "http://www.atlantia.it",
        "market_cap": "Large Cap"
    },
    "ATL.VI": {
        "short_name": "ATLANTIA SPA",
        "long_name": "Atlantia SpA",
        "summary": "Atlantia SpA, through its subsidiaries, engages in the construction and operation of motorways, airports and transport infrastructure, parking areas, and intermodal systems worldwide. It operates and manages approximately 13,000 kilometers of toll motorways. The company manages, maintains, constructs, and widens related motorways operated under concession; and provides support for the Italian motorway operators. It also operates and expands Rome's Fiumicino and Ciampino airports; and operates the airports of Nice, Cannes-Mandelieu, and Saint-Tropez. In addition, the company engages in the design, project management, controlling, and maintenance of road and airport infrastructures; and operation of toll payment systems, as well as provides assistance and toll management services. Further, it operates free-flow tolling systems, traffic and transport management systems, and electronic payment systems. Additionally, the company offers insurance brokerage, as well as engineering services. Atlantia SpA was incorporated in 1950 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00159",
        "website": "http://www.atlantia.it",
        "market_cap": "Large Cap"
    },
    "AU9.F": {
        "short_name": "ATLANTIA S.P.A.",
        "long_name": "Atlantia SpA",
        "summary": "Atlantia SpA, through its subsidiaries, engages in the construction and operation of motorways, airports and transport infrastructure, parking areas, and intermodal systems worldwide. It operates and manages approximately 13,000 kilometers of toll motorways. The company manages, maintains, constructs, and widens related motorways operated under concession; and provides support for the Italian motorway operators. It also operates and expands Rome's Fiumicino and Ciampino airports; and operates the airports of Nice, Cannes-Mandelieu, and Saint-Tropez. In addition, the company engages in the design, project management, controlling, and maintenance of road and airport infrastructures; and operation of toll payment systems, as well as provides assistance and toll management services. Further, it operates free-flow tolling systems, traffic and transport management systems, and electronic payment systems. Additionally, the company offers insurance brokerage, as well as engineering services. Atlantia SpA was incorporated in 1950 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00159",
        "website": "http://www.atlantia.it",
        "market_cap": "Large Cap"
    },
    "AU9A.F": {
        "short_name": "ATLANTIA SPA ADR 1/2/EO 1",
        "long_name": "Atlantia SpA",
        "summary": "Atlantia SpA, through its subsidiaries, engages in the construction and operation of motorways, airports and transport infrastructure, parking areas, and intermodal systems worldwide. It operates and manages approximately 13,000 kilometers of toll motorways. The company manages, maintains, constructs, and widens related motorways operated under concession; and provides support for the Italian motorway operators. It also operates and expands Rome's Fiumicino and Ciampino airports; and operates the airports of Nice, Cannes-Mandelieu, and Saint-Tropez. In addition, the company engages in the design, project management, controlling, and maintenance of road and airport infrastructures; and operation of toll payment systems, as well as provides assistance and toll management services. Further, it operates free-flow tolling systems, traffic and transport management systems, and electronic payment systems. Additionally, the company offers insurance brokerage, as well as engineering services. Atlantia SpA was incorporated in 1950 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Infrastructure Operations",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00159",
        "website": "http://www.atlantia.it",
        "market_cap": "Large Cap"
    },
    "AUTME.MI": {
        "short_name": "AUTOSTRADE MERID",
        "long_name": "Autostrade Meridionali S.p.A.",
        "summary": "Autostrade Meridionali S.p.A. operates the Naples-Pompeii-Salerno motorway in Italy. Its motorway body maintenance activities include paving, green works, horizontal and vertical signs, plants, runways, and station buildings. The company was founded in 1925 and is based in Naples, Italy. Autostrade Meridionali S.p.A. is a subsidiary of Autostrade per l'Italia S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": null,
        "city": "Naples",
        "zipcode": "80143",
        "website": "http://www.autostrademeridionali.it",
        "market_cap": "Micro Cap"
    },
    "AV.MI": {
        "short_name": "ANTARES VISION",
        "long_name": "Antares Vision S.p.A.",
        "summary": "Antares Vision S.p.A. provides track and trace, and inspection systems for the security and traceability of the products. It offers track and trace products, including serialization modules, aggregation systems, software suites, verification and decommissioning solutions, logistics and warehouse tracking system, and bottle tracking system for food, cosmetics, medical, pharmaceutical, and beverage sectors. The company also provides beverage inspection solutions, including glass inspection system, cap level control system, bottle orientation system, bottle visual rotating system, and printing control system; food inspection solutions comprising contamination detection system and container inspection system; cosmetic inspection solutions; inspection solutions for medical devices; pharmaceutical inspection machines, such as tablets and capsules inspector, parenteral visual rotating inspections system, raised stopper inspection system, and LYO-check system; and turnkey inspection solutions for beverage from FT system. In addition, it offers smart data management solutions for accurate statistics, predictive analysis, and business intelligence; remote support, software maintenance, and on site intervention services; certification training courses; remote assistance services; spare parts; and consulting services. Antares Vision S.p.A. was founded in 2007 and is headquartered in Travagliato, Italy. Antares Vision S.p.A. is a subsidiary of Regolo S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Travagliato",
        "zipcode": "25039",
        "website": "http://www.antaresvision.com",
        "market_cap": "Small Cap"
    },
    "AVIO.MI": {
        "short_name": "AVIO",
        "long_name": "Avio S.p.A.",
        "summary": "Avio S.p.A., through its subsidiaries, engages in the construction and development of space launchers, and solid and liquid propulsion systems for space travel in Italy and internationally. The company offers propulsion boosters, liquid oxygen turbo pumps, and aerodynamic control surfaces, motors, as well as tactical products, such as sensor block and ECU. It offers space launchers under the VEGA and ARIANE names. Avio S.p.A. has a strategic partnership with SoftInWay Group Inc. to develop new propulsion systems for small satellite launchers. The company was founded in 1984 and is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00187",
        "website": "http://www.avio.com",
        "market_cap": "Small Cap"
    },
    "B.MI": {
        "short_name": "BASTOGI SPA",
        "long_name": "Bastogi S.p.A.",
        "summary": "Bastogi S.p.A., through its subsidiaries, operates in the real estate, entertainment, art and culture, and other sectors in Italy. The company develops and operates real estate properties; manages multi-purpose venues for music, shows, and sport, as well as venues held through concessions; and produces musical and theatre contents. It also hosts presentations, business conventions, conferences, shows, fashion shows, exhibitions, cultural appointments, photo shoots, receptions, and gala dinners; and provides integrated services for the management, enhancement, and conservation of works of art and precious objects. In addition, the company manages a four star business hotel; and offers trade services to small and medium companies, as well as a range of services in the education and training, food and wine, design, and organization and location for events. Bastogi S.p.A. was founded in 1862 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20137",
        "website": "http://www.bastogi.com",
        "market_cap": "Micro Cap"
    },
    "B2AA.F": {
        "short_name": "BIOERA SPA",
        "long_name": "Bioera S.p.A.",
        "summary": "Bioera S.p.A. engages in the production and sale of organic products, natural cosmetics, and traditional food products in Italy. The company markets its products under the KI, Crudigno, and Fonte della Vita brand names. Bioera S.p.A. distributes its products through outsourcers. The company was founded in 2004 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20122",
        "website": "http://www.bioera.it",
        "market_cap": "Nano Cap"
    },
    "BAOA.F": {
        "short_name": "BASTOGI SPA",
        "long_name": "Bastogi S.p.A.",
        "summary": "Bastogi S.p.A., through its subsidiaries, operates in the real estate, entertainment, art and culture, and other sectors in Italy. The company develops and operates real estate properties; manages multi-purpose venues for music, shows, and sport, as well as venues held through concessions; and produces musical and theatre contents. It also hosts presentations, business conventions, conferences, shows, fashion shows, exhibitions, cultural appointments, photo shoots, receptions, and gala dinners; and provides integrated services for the management, enhancement, and conservation of works of art and precious objects. In addition, the company manages a four star business hotel; and offers trade services to small and medium companies, as well as a range of services in the education and training, food and wine, design, and organization and location for events. Bastogi S.p.A. was founded in 1862 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20137",
        "website": "http://www.bastogi.com",
        "market_cap": "Micro Cap"
    },
    "BCM.MI": {
        "short_name": "BIANCAMANO",
        "long_name": "Biancamano S.p.A.",
        "summary": "Biancamano S.p.A., together with its subsidiaries, operates in the environmental hygiene sector. The company provides integrated waste management services, including treatment of the organic fraction, re-use and recycling of materials, incineration and waste-to-energy, and landfilling. It is also involved in the management of municipal hygiene services for local authorities and large private businesses. The company was founded in 1973 and is based in Rozzano, Italy. Biancamano S.p.A. is a subsidiary of Biancamano Holding SA.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Rozzano",
        "zipcode": "20089",
        "website": "http://www.gruppobiancamano.it",
        "market_cap": "Nano Cap"
    },
    "BI2.F": {
        "short_name": "BIESSE S.P.A.  EO 1",
        "long_name": "Biesse S.p.A.",
        "summary": "Biesse S.p.A. operates in the market for machinery and systems for processing wood, glass, stone, plastic, and metal in Western Europe, the Asia-Pacific, Eastern Europe, North America, and internationally. It operates through five segments: Wood, Glass & Stone, Mechatronics, Tooling, and Components. The Wood segment engages in the production, distribution, installation, and after-sales service of machines and systems for woodworking and composite materials processing. The Glass & Stone segment is involved in the production, distribution, installation, and after-sales service of glass and stone processing machines. The Mechatronics segment produces and distributes industrial mechanical and electronic components. The Tooling segment produces and distributes glass and stone processing tools for various machines on the market. The Components segment produces and distributes other components related to additional precision processing. The company offers its products under the Biesse and Intermac brands. It serves the automotive, aerospace, marine, technical articles, wind energy, defense, medical, construction, and signage sectors. The company was founded in 1969 and is headquartered in Pesaro, Italy. Biesse S.p.A. is a subsidiary of Bi.Fin. S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "PS",
        "city": "Pesaro",
        "zipcode": "61122",
        "website": "http://www.biesse.com",
        "market_cap": "Small Cap"
    },
    "BIE.MI": {
        "short_name": "BIOERA",
        "long_name": "Bioera S.p.A.",
        "summary": "Bioera S.p.A. engages in the production and sale of organic products, natural cosmetics, and traditional food products in Italy. The company markets its products under the KI, Crudigno, and Fonte della Vita brand names. Bioera S.p.A. distributes its products through outsourcers. The company was founded in 2004 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20122",
        "website": "http://www.bioera.it",
        "market_cap": "Nano Cap"
    },
    "BSS.MI": {
        "short_name": "BIESSE",
        "long_name": "Biesse S.p.A.",
        "summary": "Biesse S.p.A. operates in the market for machinery and systems for processing wood, glass, stone, plastic, and metal in Western Europe, the Asia-Pacific, Eastern Europe, North America, and internationally. It operates through five segments: Wood, Glass & Stone, Mechatronics, Tooling, and Components. The Wood segment engages in the production, distribution, installation, and after-sales service of machines and systems for woodworking and composite materials processing. The Glass & Stone segment is involved in the production, distribution, installation, and after-sales service of glass and stone processing machines. The Mechatronics segment produces and distributes industrial mechanical and electronic components. The Tooling segment produces and distributes glass and stone processing tools for various machines on the market. The Components segment produces and distributes other components related to additional precision processing. The company offers its products under the Biesse and Intermac brands. It serves the automotive, aerospace, marine, technical articles, wind energy, defense, medical, construction, and signage sectors. The company was founded in 1969 and is headquartered in Pesaro, Italy. Biesse S.p.A. is a subsidiary of Bi.Fin. S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "PS",
        "city": "Pesaro",
        "zipcode": "61122",
        "website": "http://www.biesse.com",
        "market_cap": "Small Cap"
    },
    "CARR.MI": {
        "short_name": "CARRARO",
        "long_name": "Carraro S.p.A.",
        "summary": "Carraro S.p.A. manufactures and sells power transmission systems for tractors and off-highway vehicles in Italy, other European countries, North and South America, Asia, and other non-European countries. The company gears, axles, and transmissions systems for agricultural, construction, and automotive equipment; tractors; transmission/engine systems for the material handling industry; and high-precision gears and drive shafts for industrial plants, escalators, robotics, and wind turbines, as well as for the railway industry. It also provides engineering and after sales services; and original spare parts. The company was founded in 1932 and is headquartered in Campodarsego, Italy. Carraro S.p.A. is a subsidiary of Finaid S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "PD",
        "city": "Campodarsego",
        "zipcode": "35011",
        "website": "http://www.carraro.com",
        "market_cap": "Micro Cap"
    },
    "CLA.MI": {
        "short_name": "CLABO",
        "long_name": "Clabo S.p.A.",
        "summary": "Clabo S.p.A. designs, produces, and distributes refrigerated showcases and furniture for the food retail market worldwide. It offers refrigerated showcases for ice-cream and pastry products exhibition and conservation; and furniture for bars, pastry parlors, cafÃ©s, and canteens under the ORION, FB, ARTIC, BOCCHINI, and EASY BEST brand names. The company was founded in 2001 and is headquartered in Jesi, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "AN",
        "city": "Jesi",
        "zipcode": "60035",
        "website": "http://www.clabo.it",
        "market_cap": "Nano Cap"
    },
    "CMB.MI": {
        "short_name": "CEMBRE",
        "long_name": "Cembre S.p.A.",
        "summary": "Cembre S.p.A., together with its subsidiaries, manufactures and sells electrical connectors and related tools in Italy, rest of Europe, and internationally. The company offers pre-insulated, un-insulated, and other types of electrical connectors, as well as flexible braids for earthing moving elements; mechanical tools for crimping electrical connectors, and cutting and preparing cables; hydraulic tools for crimping electrical connectors, and cutting and preparing conductors; products for railway electrical connections; and machinery for track maintenance; and hand tools. It also provides cable glands and fixing components, brass and steel cable glands and fixing components, brass extensions, brass reducer bushes and converters, rutaseal grommets, and modular retaining clips; and identification and labeling systems, such as thermal transfer systems, manual cable marking systems, document wallets, and warning labels. In addition, the company offers heat-shrinkable tubing products, cable ties and tooling, cable and conduit clips, cable preparation tools, hand tools, insulated covers for uninsulated connectors, and cast resin cable joints. Its products are used in power production and transport, electrical systems, and industrial and railway applications. The company was founded in 1969 and is headquartered in Brescia, Italy. Cembre S.p.A. is a subsidiary of Lysne S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Brescia",
        "zipcode": "25135",
        "website": "http://www.cembre.it",
        "market_cap": "Small Cap"
    },
    "CML.MI": {
        "short_name": "COMAL",
        "long_name": "Comal S.p.A.",
        "summary": "Comal S.p.A. engages in the design and construction of photovoltaic systems in Italy and South Africa. It offers equipment and machinery maintenance services for thermal energy production plants; alternator and turbine maintenance services; sun hunter tracker services; and shelter services. The company was founded in 2001 and is headquartered in Montalto di Castro, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VT",
        "city": "Montalto Di Castro",
        "zipcode": "01014",
        "website": "http://www.comalgroup.com",
        "market_cap": "Nano Cap"
    },
    "COM.MI": {
        "short_name": "COMER INDUSTRIES",
        "long_name": "Comer Industries S.p.A.",
        "summary": "Comer Industries S.p.A. designs and produces engineering systems and mechatronic solutions for power transmission applications worldwide. The company's product includes gearboxes, powertrain, planetary drives, slew drives and wheel drives, as well as standard and professional driveshafts, and spare parts. Its products are used in agri applications comprising land preparation, soil tillage, crop treatment, forage and hay, and forage mixing and distribution machines; biogas systems; corn and grain headers; combines and forage harvesters; and tractors, as well as industrial applications consisting of construction, road construction, forestry, mining, and water treatment machines; material handling; and renewable energy applications. Comer Industries S.p.A. was founded in 1970 and is headquartered in Reggiolo, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Farm & Heavy Construction Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RE",
        "city": "Reggiolo",
        "zipcode": "42046",
        "website": "http://www.comerindustries.com",
        "market_cap": "Small Cap"
    },
    "DAN.MI": {
        "short_name": "DANIELI & C",
        "long_name": "Danieli & C. Officine Meccaniche S.p.A.",
        "summary": "Danieli & C. Officine Meccaniche S.p.A. designs, builds, and sells plants for the iron and steel industry worldwide. It operates in two segments, Plant Making and Steel Making. The company designs and builds plants for various process areas, including mines; pellet production plants; blast furnaces; direct reduction; scrap shredders; steelworks for production of liquid steel; and continuous casting for blooms and billets, slabs, and thin slabs. It also designs and builds rolling mills for long products and seamless tubes; lines for welded tubes; hot and cold rolling mills for flat products; process lines for flat products; and plants for dimensional checking and for non-destructive quality control, and conditioning plants. In addition, the company offers plants for secondary processing, such as peeling, straightening, 2-roll reeling, and drawing machines; forging presses and manipulators, and forging plants; extrusion presses for ferrous and non-ferrous materials; plants for longitudinal cutting and for transversal cutting; plant automation systems; and cranes and lifting equipment. Further, it is involved in the production and sale of special steel comprising ingots, blooms, billets, and forged and rolled products; and structural steel comprising high carbon steel, as well as case-hardened, hardened and tempered, and surface hardened steel for use in various engineering components. The company was founded in 1914 and is headquartered in Buttrio, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "UD",
        "city": "Buttrio",
        "zipcode": "33042",
        "website": "http://www.danieli.com",
        "market_cap": "Small Cap"
    },
    "DANR.MI": {
        "short_name": "DANIELI & C RISP NC",
        "long_name": "Danieli & C. Officine Meccaniche S.p.A.",
        "summary": "Danieli & C. Officine Meccaniche S.p.A. designs, builds, and sells plants for the iron and steel industry worldwide. It operates in two segments, Plant Making and Steel Making. The company designs and builds plants for various process areas, including mines; pellet production plants; blast furnaces; direct reduction; scrap shredders; steelworks for production of liquid steel; and continuous casting for blooms and billets, slabs, and thin slabs. It also designs and builds rolling mills for long products and seamless tubes; lines for welded tubes; hot and cold rolling mills for flat products; process lines for flat products; and plants for dimensional checking and for non-destructive quality control, and conditioning plants. In addition, the company offers plants for secondary processing, such as peeling, straightening, 2-roll reeling, and drawing machines; forging presses and manipulators, and forging plants; extrusion presses for ferrous and non-ferrous materials; plants for longitudinal cutting and for transversal cutting; plant automation systems; and cranes and lifting equipment. Further, it is involved in the production and sale of special steel comprising ingots, blooms, billets, and forged and rolled products; and structural steel comprising high carbon steel, as well as case-hardened, hardened and tempered, and surface hardened steel for use in various engineering components. The company was founded in 1914 and is headquartered in Buttrio, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "UD",
        "city": "Buttrio",
        "zipcode": "33042",
        "website": "http://www.danieli.com",
        "market_cap": "Small Cap"
    },
    "DAS.F": {
        "short_name": "DANIELI + C.",
        "long_name": "Danieli & C. Officine Meccaniche S.p.A.",
        "summary": "Danieli & C. Officine Meccaniche S.p.A. designs, builds, and sells plants for the iron and steel industry worldwide. It operates in two segments, Plant Making and Steel Making. The company designs and builds plants for various process areas, including mines; pellet production plants; blast furnaces; direct reduction; scrap shredders; steelworks for production of liquid steel; and continuous casting for blooms and billets, slabs, and thin slabs. It also designs and builds rolling mills for long products and seamless tubes; lines for welded tubes; hot and cold rolling mills for flat products; process lines for flat products; and plants for dimensional checking and for non-destructive quality control, and conditioning plants. In addition, the company offers plants for secondary processing, such as peeling, straightening, 2-roll reeling, and drawing machines; forging presses and manipulators, and forging plants; extrusion presses for ferrous and non-ferrous materials; plants for longitudinal cutting and for transversal cutting; plant automation systems; and cranes and lifting equipment. Further, it is involved in the production and sale of special steel comprising ingots, blooms, billets, and forged and rolled products; and structural steel comprising high carbon steel, as well as case-hardened, hardened and tempered, and surface hardened steel for use in various engineering components. The company was founded in 1914 and is headquartered in Buttrio, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "UD",
        "city": "Buttrio",
        "zipcode": "33042",
        "website": "http://www.danieli.com",
        "market_cap": "Small Cap"
    },
    "DBA.MI": {
        "short_name": "DBA GROUP",
        "long_name": "DBA Group S.p.A.",
        "summary": "DBA Group S.p.A. provides consultancy, architecture, engineering, and project management services. It offers architectural and design study, feasibility study and master planning, and general and specialist works supervision services; preliminary examination, geometric and specialized survey, consulting and technical, workplace safety, quality audit, H and S, and administrative test services; and bid and tender management, construction and installation management, testing and commissioning management, provisioning and deprovisioning circuits, inventory systems update, test and suitability, reporting, business intelligence, and document management, as well as quality, health, and safety audit services. The company also provides energy efficiency services comprising energy audit, efficiency improvement interventions design, and monitoring and energy consumption control systems. In addition, it engages in project management, process analysis and optimization, ICT consulting, software architecture and system design, user training, help desk, and maintenance and technical assistance, as well as software development, implementation, installation, and testing; and IT outsourcing, consulting, hosting, and virtualization, as well as system integration. Further, the company provides cyber security services, including information security and business continuity consulting, privacy, security information and event management, identity and access management, infrastructure security, security assessments and information system audit, penetration test and vulnerability assessment, security check, information security monitoring and management, certification preparation program, and IT security and compliance education and awareness services; and SAP solutions. It serves real estate, telecommunications and media, energy and utilities, alternative fuels and oil, transport and logistics, and other markets. The company was founded in 1991 and is based in Villorba, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TV",
        "city": "Villorba",
        "zipcode": "31020",
        "website": "http://www.dbagroup.it",
        "market_cap": "Nano Cap"
    },
    "DNIYY": {
        "short_name": "DANIELI & C",
        "long_name": "Danieli & C. Officine Meccaniche S.p.A.",
        "summary": "Danieli & C. Officine Meccaniche S.p.A. designs, builds, and sells plants for the iron and steel industry worldwide. It operates in two segments, Plant Making and Steel Making. The company designs and builds plants for various process areas, including mines; pellet production plants; blast furnaces; direct reduction; scrap shredders; steelworks for production of liquid steel; and continuous casting for blooms and billets, slabs, and thin slabs. It also designs and builds rolling mills for long products and seamless tubes; lines for welded tubes; hot and cold rolling mills for flat products; process lines for flat products; and plants for dimensional checking and for non-destructive quality control, and conditioning plants. In addition, the company offers plants for secondary processing, such as peeling, straightening, 2-roll reeling, and drawing machines; forging presses and manipulators, and forging plants; extrusion presses for ferrous and non-ferrous materials; plants for longitudinal cutting and for transversal cutting; plant automation systems; and cranes and lifting equipment. Further, it is involved in the production and sale of special steel comprising ingots, blooms, billets, and forged and rolled products; and structural steel comprising high carbon steel, as well as case-hardened, hardened and tempered, and surface hardened steel for use in various engineering components. The company was founded in 1914 and is headquartered in Buttrio, Italy.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "UD",
        "city": "Buttrio",
        "zipcode": "33042",
        "website": "http://www.danieli.com",
        "market_cap": "Small Cap"
    },
    "EDAC.MI": {
        "short_name": "EDILIZIACROBATICA",
        "long_name": "EdiliziAcrobatica S.p.A.",
        "summary": "EdiliziAcrobatica S.p.A. engages in the outdoor construction works in Italy. It provides a range of services, such as renovation, restoration, cleaning, and installation and maintenance. The company was founded in 1994 and is headquartered in Genova, Italy. EdiliziAcrobatica S.p.A. is a subsidiary of Arim Holding S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "GE",
        "city": "Genova",
        "zipcode": "16129",
        "website": "http://www.ediliziacrobatica.com",
        "market_cap": "Micro Cap"
    },
    "EENNF": {
        "short_name": "ENAV S.P.A.",
        "long_name": "ENAV S.p.A.",
        "summary": "ENAV S.p.A. provides air navigation services in Italy, rest of Europe, and internationally. The company operates through Air Navigation Services, Maintenance Services, and AIM Software Solutions segments. It offers air traffic control services, including air traffic handling, ATM platform, surveillance and navigation, and telecoms; airspace design; meteorology services, such as weather reports and forecasts; aeronautical information; flight inspection; engineering and maintenance; research and innovation; air traffic management training; and online services. The company also engages in the international activities, such as European aviation safety, network management, and deployment management; and the provision of business consulting services comprising aeronautical consulting and design, training, and flight calibration. In addition, it installs, maintains, and monitors various hardware and software systems; and develops and tests new technologies, as well as offers consultancy and services to international markets. Further, the company develops software solutions for aeronautical information management and air traffic management, as well as provides associated commercial and maintenance services. ENAV S.p.A. is based in Rome, Italy.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00138",
        "website": "http://www.enav.it",
        "market_cap": "Mid Cap"
    },
    "EK4.F": {
        "short_name": "EMAK SPA  EO 0,26",
        "long_name": "Emak S.p.A.",
        "summary": "Emak S.p.A., together with its subsidiaries, develops, manufactures, and markets various products in the outdoor power equipment, pumps and high pressure water jetting, and components and accessories business areas. The company offers brush cutters, lawnmowers, garden tractors, chainsaws, tillers, motor hoes, and walking tractors for gardening, forestry, and small agricultural equipment under the Oleo-Mac, Efco, Bertolini, Nibbi, and Staub brands. It also provides centrifugal and diaphragm pumps for agriculture; piston pumps for the industrial sector; professional and semi-professional high-pressure washers, floor washing drying machines, and vacuum cleaners; and hydrodynamic units and urban cleaning machines under the Comet, HPP, Lemasa, PTC Waterjetting Equipment, PTC Urban Cleaning Equipment, and Lavor brands. In addition, the company offers lines and heads for brush-cutters; chainsaw accessories; pistols, valves, and nozzles for pressure cleaners and agricultural applications; precision farming sensors and computers; and technical seats and spare parts for tractors under the Tecomec, Mecline, and Sabart brands, as well as other third party brands. It serves customers through specialized dealers, and own branches, as well as through a network of distributors. The company has operations in Italy, rest of Europe, the Americas, Asia, Africa, and Oceania. Emak S.p.A. was founded in 1972 and is headquartered in Bagnolo in Piano, Italy. Emak S.p.A. is a subsidiary of Yama S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RE",
        "city": "Bagnolo In Piano",
        "zipcode": "42011",
        "website": "http://www.emak.it",
        "market_cap": "Small Cap"
    },
    "EM.MI": {
        "short_name": "EMAK",
        "long_name": "Emak S.p.A.",
        "summary": "Emak S.p.A., together with its subsidiaries, develops, manufactures, and markets various products in the outdoor power equipment, pumps and high pressure water jetting, and components and accessories business areas. The company offers brush cutters, lawnmowers, garden tractors, chainsaws, tillers, motor hoes, and walking tractors for gardening, forestry, and small agricultural equipment under the Oleo-Mac, Efco, Bertolini, Nibbi, and Staub brands. It also provides centrifugal and diaphragm pumps for agriculture; piston pumps for the industrial sector; professional and semi-professional high-pressure washers, floor washing drying machines, and vacuum cleaners; and hydrodynamic units and urban cleaning machines under the Comet, HPP, Lemasa, PTC Waterjetting Equipment, PTC Urban Cleaning Equipment, and Lavor brands. In addition, the company offers lines and heads for brush-cutters; chainsaw accessories; pistols, valves, and nozzles for pressure cleaners and agricultural applications; precision farming sensors and computers; and technical seats and spare parts for tractors under the Tecomec, Mecline, and Sabart brands, as well as other third party brands. It serves customers through specialized dealers, and own branches, as well as through a network of distributors. The company has operations in Italy, rest of Europe, the Americas, Asia, Africa, and Oceania. Emak S.p.A. was founded in 1972 and is headquartered in Bagnolo in Piano, Italy. Emak S.p.A. is a subsidiary of Yama S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RE",
        "city": "Bagnolo In Piano",
        "zipcode": "42011",
        "website": "http://www.emak.it",
        "market_cap": "Small Cap"
    },
    "ENAV.MI": {
        "short_name": "ENAV",
        "long_name": "ENAV S.p.A.",
        "summary": "ENAV S.p.A. provides air navigation services in Italy, rest of Europe, and internationally. The company operates through Air Navigation Services, Maintenance Services, and AIM Software Solutions segments. It offers air traffic control services, including air traffic handling, ATM platform, surveillance and navigation, and telecoms; airspace design; meteorology services, such as weather reports and forecasts; aeronautical information; flight inspection; engineering and maintenance; research and innovation; air traffic management training; and online services. The company also engages in the international activities, such as European aviation safety, network management, and deployment management; and the provision of business consulting services comprising aeronautical consulting and design, training, and flight calibration. In addition, it installs, maintains, and monitors various hardware and software systems; and develops and tests new technologies, as well as offers consultancy and services to international markets. Further, the company develops software solutions for aeronautical information management and air traffic management, as well as provides associated commercial and maintenance services. ENAV S.p.A. is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00138",
        "website": "http://www.enav.it",
        "market_cap": "Mid Cap"
    },
    "ENV.F": {
        "short_name": "ENAV S.P.A.  EO 1",
        "long_name": "ENAV S.p.A.",
        "summary": "ENAV S.p.A. provides air navigation services in Italy, rest of Europe, and internationally. The company operates through Air Navigation Services, Maintenance Services, and AIM Software Solutions segments. It offers air traffic control services, including air traffic handling, ATM platform, surveillance and navigation, and telecoms; airspace design; meteorology services, such as weather reports and forecasts; aeronautical information; flight inspection; engineering and maintenance; research and innovation; air traffic management training; and online services. The company also engages in the international activities, such as European aviation safety, network management, and deployment management; and the provision of business consulting services comprising aeronautical consulting and design, training, and flight calibration. In addition, it installs, maintains, and monitors various hardware and software systems; and develops and tests new technologies, as well as offers consultancy and services to international markets. Further, the company develops software solutions for aeronautical information management and air traffic management, as well as provides associated commercial and maintenance services. ENAV S.p.A. is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00138",
        "website": "http://www.enav.it",
        "market_cap": "Mid Cap"
    },
    "ESAU.MI": {
        "short_name": "ESAUTOMOTION",
        "long_name": "Esautomotion S.p.A.",
        "summary": "Esautomotion S.p.A., an industrial company, develops, manufactures, and sells industrial automation products and services in Italy. It primarily provides CNC and software to manage a range of machines. The company offers CNC for bending and other applications; conventional motors and drives, and integrated drivers; remote peripheral modules, including rack mounted, stand alone, I/O ring, can bus, and digital axes interfaces; and bi-rotary cutting heads. It also provides sales, installation support, telephone assistance, on-site support, remote diagnostic, spare parts reparation, and technical services. The company offers its products and services for metal forming, such as bending, shearing, and press brake; cutting includes laser, marble, oxi and plasma, waterjet, and punching press cutting; woodworking machines; transfer machine; weighing; glass cutting table, and drilling, milling, and grinding machines; and robot applications. It also exports its products to approximately 18 countries. The company was formerly known as Esa GV. Esautomotion S.p.A. was founded in 1962 and is based in Carpi, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MO",
        "city": "Carpi",
        "zipcode": "41012",
        "website": "http://www.esautomotion.it",
        "market_cap": "Nano Cap"
    },
    "FCT.MI": {
        "short_name": "FINCANTIERI",
        "long_name": "Fincantieri S.p.A.",
        "summary": "Fincantieri S.p.A. operates in the shipbuilding industry. The company operates in three segments: Shipbuilding; Offshore and Specialized Vessels; and Equipment, Systems and Services. The Shipbuilding segment designs and constructs cruise ships; ferries, including cruise, Ro-Pax, and due fuel ferries; naval vessels, such as aircraft carriers, destroyers, frigates, corvettes, patrol vessels, amphibious and logistic support ships, multirole and research vessels, special vessels, and submarines; and mega yachts, as well as expedition cruise vessels. The Offshore and Specialized Vessels segment designs and constructs offshore support vessels, specialized ships, and vessels for offshore wind farms and open ocean aquaculture, as well as other products in the field of drill ships and semi-submersible drilling rigs. This segment also provides electrical systems, including engineering, manufacturing, installation, integration testing, and commissioning services. The Equipment, Systems and Services segment provides stabilization, propulsion, and positioning and power generation systems; ship automation systems, steam turbines, and ship accommodation systems; entertainment systems and steel structures; cabins and public areas; catering; and electric, electronic, and electromechanical integrated systems. This segment also offers ship repairs, refitting, refurbishment, conversions, and product lifecycle management services, as well as after-sales support services. In addition, it is involved in the dry-dock management; project management; accommodation installation; and pipe installation. Further, the company provides electrical parts, technical and logistics engineering services, and ship interiors. It primarily serves ship owners and the defense sector worldwide. The company was founded in 1959 and is based in Trieste, Italy. Fincantieri S.p.A. is a subsidiary of CDP Industria S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TS",
        "city": "Trieste",
        "zipcode": "34121",
        "website": "http://www.fincantieri.com",
        "market_cap": "Small Cap"
    },
    "FDA.MI": {
        "short_name": "FIDIA",
        "long_name": "Fidia S.p.A.",
        "summary": "Fidia S.p.A., together with its subsidiaries, designs, manufactures, and sells high speed milling systems and computerized numerical control machines, milling heads, related software, and accessories. The company's accessories comprise HMS, a device for measuring and compensating geometric error on continuous or indexed bi-rotary heads and roto-tilting tables; TMSC, a device to measure length and diameter of the tool, as well as to check the shape; K5 tracer, a solution to perform continuous scanning of 3D surfaces; pushbutton panels; XPower digital drives for axis and spindle movement; and I/O Line input/output modules. Its software solutions include ViMill, an anti-collision solution; HiMonitor, a software to monitor activities of the machine; Velocity 5, a solution for axes control to enhance the performances of the machine; HiMill, a computer aided manufacturing software for the machining of dies, models, and aeronautical components; Isograph solution, a user interface; and procedure-PRX, a solution for customized automation. The company serves automotive, aerospace, and power generation industries in Italy, rest of Europe, Asia, North and South America, and internationally. Fidia S.p.A. was founded in 1974 and is headquartered in San Mauro Torinese, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TO",
        "city": "San Mauro Torinese",
        "zipcode": "10099",
        "website": "http://www.fidia.it",
        "market_cap": "Nano Cap"
    },
    "FILA.MI": {
        "short_name": "FILA",
        "long_name": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A.",
        "summary": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A. produces and markets coloring, designing, modelling, writing, and painting objects worldwide. It provides pencils, crayons, modelling clays, chalks, oil colours, acrylics, watercolors, paints, and paper products for the fine arts, school, and leisure sectors. The company offers its products under the GIOTTO, DAS, LYRA, Canson, Maimeri, Daler-Rowney Lukas, Ticonderoga, Pacon, Strathmore, Princeton, and Arches brands. It sells its products through a distribution network of 35 commercial branches to wholesalers, office/school suppliers, mass-market retailers, distributors, and B2B operators, as well as online channels. The company was founded in 1920 and is headquartered in Pero, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Pero",
        "zipcode": "20016",
        "website": "http://www.filagroup.it",
        "market_cap": "Small Cap"
    },
    "FINMF": {
        "short_name": "LEONARDO SPA",
        "long_name": "Leonardo S.p.a.",
        "summary": "Leonardo S.p.a. engages in the helicopters, defense electronics and security systems, aeronautics, space, and other businesses in Italy, the United Kingdom, rest of Europe, the United States, and internationally. It researches, designs, develops, produces, supports, and markets a range of helicopters for commercial, public service, and security and defense applications. The company also offers multi-mission, tactical transport, combat, and trainer aircraft; airborne solutions, such as components, airborne sensors, and effectors in the electromagnetic spectrum, as well as ISR/information/intelligence, surveillance, targeting acquisition, and reconnaissance; unmanned aerial systems; and aero structures. In addition, it provides command, control, communications, and computers solutions for the digital battlefield; air defense solutions; air traffic control and management; vehicle systems; land weapon systems; soldier systems; force protection and border control products; radars; communication products; optronics; electronic warfare products; and unmanned systems for land operations. Further, the company offers command and control, maritime domain awareness, and weapon systems for sea; and cyber and digital solutions, professional communications, operation and control products, and handling systems. Additionally, it provides services and infrastructures, space and alliance, payloads and equipment, and programs for space, as well as services and trainings. The company was formerly known as Leonardo Â\u0096 Finmeccanica S.p.a. and changed its name to Leonardo S.p.a. in January 2017. Leonardo S.p.a. was founded in 1948 and is headquartered in Rome, Italy.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00195",
        "website": "http://www.leonardocompany.com/en/home",
        "market_cap": "Mid Cap"
    },
    "FINMY": {
        "short_name": "LEONARDO SPA",
        "long_name": "Leonardo S.p.a.",
        "summary": "Leonardo S.p.a. engages in the helicopters, defense electronics and security systems, aeronautics, space, and other businesses in Italy, the United Kingdom, rest of Europe, the United States, and internationally. It researches, designs, develops, produces, supports, and markets a range of helicopters for commercial, public service, and security and defense applications. The company also offers multi-mission, tactical transport, combat, and trainer aircraft; airborne solutions, such as components, airborne sensors, and effectors in the electromagnetic spectrum, as well as ISR/information/intelligence, surveillance, targeting acquisition, and reconnaissance; unmanned aerial systems; and aero structures. In addition, it provides command, control, communications, and computers solutions for the digital battlefield; air defense solutions; air traffic control and management; vehicle systems; land weapon systems; soldier systems; force protection and border control products; radars; communication products; optronics; electronic warfare products; and unmanned systems for land operations. Further, the company offers command and control, maritime domain awareness, and weapon systems for sea; and cyber and digital solutions, professional communications, operation and control products, and handling systems. Additionally, it provides services and infrastructures, space and alliance, payloads and equipment, and programs for space, as well as services and trainings. The company was formerly known as Leonardo Â\u0096 Finmeccanica S.p.a. and changed its name to Leonardo S.p.a. in January 2017. Leonardo S.p.a. was founded in 1948 and is headquartered in Rome, Italy.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00195",
        "website": "http://www.leonardocompany.com/en/home",
        "market_cap": "Mid Cap"
    },
    "FM.MI": {
        "short_name": "FIERA MILANO",
        "long_name": "Fiera Milano SpA",
        "summary": "Fiera Milano SpA, together with its subsidiaries, operates in the exhibition and congress industry in Italy and internationally. It operates through Italian Exhibitions Business, Foreign Exhibitions Business, Media, and Congresses segments. The company is involved in organizing and hosting exhibitions, fairs, and other events; promoting and making available equipped exhibition spaces; and staging exhibitions, as well as offers project support, ancillary, and end services to exhibitors and visitors. It also produces content; and offers online and offline publishing, destination management and logistics, stand-fitting, technical, and other exhibition site services. The company was founded in 1920 and is headquartered in Rho, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Rho",
        "zipcode": "20017",
        "website": "http://www.fieramilano.it",
        "market_cap": "Small Cap"
    },
    "FM3.F": {
        "short_name": "FIERA MILANO S.P.A.",
        "long_name": "Fiera Milano SpA",
        "summary": "Fiera Milano SpA, together with its subsidiaries, operates in the exhibition and congress industry in Italy and internationally. It operates through Italian Exhibitions Business, Foreign Exhibitions Business, Media, and Congresses segments. The company is involved in organizing and hosting exhibitions, fairs, and other events; promoting and making available equipped exhibition spaces; and staging exhibitions, as well as offers project support, ancillary, and end services to exhibitors and visitors. It also produces content; and offers online and offline publishing, destination management and logistics, stand-fitting, technical, and other exhibition site services. The company was founded in 1920 and is headquartered in Rho, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Rho",
        "zipcode": "20017",
        "website": "http://www.fieramilano.it",
        "market_cap": "Small Cap"
    },
    "FMNB.F": {
        "short_name": "LEONARDO S.P.A.  EO 4,40",
        "long_name": "Leonardo S.p.a.",
        "summary": "Leonardo S.p.a. engages in the helicopters, defense electronics and security systems, aeronautics, space, and other businesses in Italy, the United Kingdom, rest of Europe, the United States, and internationally. It researches, designs, develops, produces, supports, and markets a range of helicopters for commercial, public service, and security and defense applications. The company also offers multi-mission, tactical transport, combat, and trainer aircraft; airborne solutions, such as components, airborne sensors, and effectors in the electromagnetic spectrum, as well as ISR/information/intelligence, surveillance, targeting acquisition, and reconnaissance; unmanned aerial systems; and aero structures. In addition, it provides command, control, communications, and computers solutions for the digital battlefield; air defense solutions; air traffic control and management; vehicle systems; land weapon systems; soldier systems; force protection and border control products; radars; communication products; optronics; electronic warfare products; and unmanned systems for land operations. Further, the company offers command and control, maritime domain awareness, and weapon systems for sea; and cyber and digital solutions, professional communications, operation and control products, and handling systems. Additionally, it provides services and infrastructures, space and alliance, payloads and equipment, and programs for space, as well as services and trainings. The company was formerly known as Leonardo Â\u0096 Finmeccanica S.p.a. and changed its name to Leonardo S.p.a. in January 2017. Leonardo S.p.a. was founded in 1948 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00195",
        "website": "http://www.leonardocompany.com/en/home",
        "market_cap": "Mid Cap"
    },
    "FNL.MI": {
        "short_name": "FINLOGIC",
        "long_name": "Finlogic S.p.A.",
        "summary": "Finlogic S.p.A. designs, manufactures, and distributes labels in Italy and internationally. The company offers adhesive labels for use in the foodstuff, logistic, pharmaceutical, healthcare, and cosmetic sectors; and thermal transfer ribbons, including wax, wax/resin, and resin ribbons for printing on paper and synthetic materials. It also provides digital color printers for use in various production areas, such as food, industry, wine, chemical, cosmetic, and other areas under the DTM, Swift color, and VIPColor brands; and thermal transfer printers for use in label and bar code printing, printing on plastic paper and PVC, weather resistant labels, and production lines under the Sato, INTERMEC, Zebra, Datamax, and Argox brand name. In addition, the company offers bar code laser mobile computer and barcode scanners under the Intermec, Datalogic, Honeywell, Motorola and Symbol, and Opticon brands. Finlogic S.p.A. was founded in 2003 and is based in Bollate, Italy. Finlogic S.p.A. is a subsidiary of BF capital S.R.L.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Bollate",
        "zipcode": "20021",
        "website": "http://www.finlogic.it",
        "market_cap": "Nano Cap"
    },
    "FNM.MI": {
        "short_name": "FNM",
        "long_name": "FNM S.p.A.",
        "summary": "FNM S.p.A. manages and maintains railway network in Italy. The company offers engineering and design, railway and Malpensa express, railway replacement and school bus, public road transport, freight transportation, and electric car sharing services, as well as digital solutions for transport and mobility, digital payments, and optical fibre. It also provides energy services. The company was formerly known as Ferrovie Nord Milano. The company was founded in 1877 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20123",
        "website": "http://www.fnmgroup.it",
        "market_cap": "Small Cap"
    },
    "FUM.MI": {
        "short_name": "FRANCHI UMBERTO MARMI",
        "long_name": "Franchi Umberto Marmi S.p.A.",
        "summary": "Franchi Umberto Marmi SPA engages in the extraction and supply of marbles. The company was founded in 1971 and is based in Carrara, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MS",
        "city": "Carrara",
        "zipcode": "54033",
        "website": "http://www.franchigroup.it",
        "market_cap": "Small Cap"
    },
    "FVI.MI": {
        "short_name": "FERVI",
        "long_name": "Fervi S.p.A.",
        "summary": "Fervi S.p.A. designs, manufactures, sources, and sells machinery, tools, and equipment. Its products include metal and wood working, finishing, and lifting and handling machinery, as well as presses and hydraulic pumps, lathes, mills and drills, and car and motorcycle workshop products; machinery accessories, which include machine vices, tables and dividers, chucks and live centers, tool posts and tool holders, turning and milling, and other machinery accessories; and abrasives, such as flap discs, cutting wheels, cleaning and polishing products, abrasive belts, abrasive wheels, and wire brushes. The company also provides micrometers, dial indicators, measuring tools, scales, analogic and digital meters, precision tapes, and levels and goniometers, as well as calipers, height gauges, and protractors; gauge blocks, screw gauges, and hole plain gauges; dial and digital calipers, magnifier lens and multimeters, micrometers and feelers, rulers, screw pitch gauges, and vernier calipers; and square, levels, and measuring tapes, as well as cleaning and maintenance products. In addition, it offers hardware products, such as wrenches, cutting tools, socket wrenches and screw extractors, screwdrivers and hand riveters, pliers, hammers, files, workshop furniture, and sets and fastenings. Further, the company provides cutting tools, including milling tools, taps and dies, sprays and greaser guns, drills and hole saws, inserts, lathe tools, tool bits, thread repair tools, and bandsaw and saw blades. Additionally, it offers bench vices, clamps and anvils, soldering and hot air guns, and equipment for liquid and fluids; and general tools for construction and packaging, pneumatic, gardening, and safety and protection, as well as heaters, lighting products, and lenses. The company was formerly known as Veprug S.r.l. Fervi S.p.A. is based in Vignola, Italy. Fervi S.p.A. is a subsidiary of 1979 Investimenti S.R.L.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MO",
        "city": "Vignola",
        "zipcode": "41058",
        "website": "http://www.fervi.com",
        "market_cap": "Nano Cap"
    },
    "GEL.MI": {
        "short_name": "GEL",
        "long_name": "Gel S.p.A.",
        "summary": "Gel S.p.A. engages in the design, manufacture, and sale of water treatment products in Italy. The company offers filters, water softeners, dosing units, reverse osmosis, and conditioning products for private users; and leachate, medical water, mobile plants, food and beverage, drinking water, and desalination solutions for industrial users. It also provides magnetic scale reducers, column filters, metering pumps, antilegionella systems, UV sterilizers, water purifiers, measuring and control instruments, and neutralizing filters for acidic condensates; descaling chemicals, technical products, and equipment for flushing and filling; and conditioners, such as heating, cooling, solar thermal, and water systems, as well as steam generators for professional users. GEL S.p.A. was founded in 1979 and is based in Castelfidardo, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "AN",
        "city": "Castelfidardo",
        "zipcode": "60022",
        "website": "http://www.gel.it",
        "market_cap": "Nano Cap"
    },
    "GPI.MI": {
        "short_name": "GPI",
        "long_name": "GPI SpA",
        "summary": "GPI SpA provides ICT healthcare solutions for various public and private sector in Italy and internationally. Its products and services portfolio includes information systems and hi-tech platform for healthcare services, automated warehouse system for hospital and pharmacies, telemedicine and virtual care, DTM services, and e-payment solutions. It develops an EHR platform for diagnosis and treatment; clinical collaboration platform that enables clinicians to share patient information, such as reports, images, and structured data; IT solution for the management of various processes of neonatal intensive care unit, such as medical treatment, assistance, and information exchange between medical staff and parents; and a modular hospital information system to manage various clinical activities in private and public hospitals. The company also offers solutions for automated drug storage and picking system; a virtual care solution for patients', doctors, and healthcare operators; and Phebo, a platform for H2T evaluation of biometrics observations for tele-monitoring, virtual care, and telemedicine activities. The company was founded in 1988 and is based in Trento, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TN",
        "city": "Trento",
        "zipcode": "38123",
        "website": "http://www.gpi.it",
        "market_cap": "Micro Cap"
    },
    "GVS.MI": {
        "short_name": "GVS",
        "long_name": "GVS S.p.A.",
        "summary": "GVS S.p.A., together with its subsidiaries, produces and sells plastic filters and components for healthcare, life science, automotive, appliance, safety, and commercial and industrial filtration applications in Italy and internationally. It offers health care products, such as healthcare gas/air and liquid filtration products for anesthesia, surgery insufflation, ventilation, blood filtration, transfusion, infusion, and hemodialysis; and syringe and capsule filters, liquid sample microbiology products, and protein microarray products, as well as microporous filtration, protein transfer, and nucleic acid binding membranes for laboratory solutions. The company also offers automotive products, including fuel and diesel injector, ABS/ESP-braking, steering and transmission, fuel tank, and SCR technology-urea filters, as well as ventilation membranes and throttle bodies; and sheet and panel filters, bag and cartridge filters, HEPA and high capacity HEPA products, carbon and molecular filtration products, and accessories and housings for commercial and industrial applications. In addition, it provides cylinder and conical, circular, radial or standard, square or rectangular, and pad and pre-filters for use in appliances; respiratory safety and bio-safety products for personal protection applications; and OEM membranes comprising polyethersulfone, polycarbonate track etched, polyester track etched, polyvinylidene difluoride, nylon, nitrocellulose, cellulose acetate, and rigenerated cellulose membranes. GVS S.p.A. was formerly known as GVS S.r.l. and changed its name to GVS S.p.A. in 20001. The company was founded in 1979 and is based in Zola Predosa, Italy. GVS S.p.A. operates as a subsidiary of GVS Group S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BO",
        "city": "Zola Predosa",
        "zipcode": "40069",
        "website": "http://www.gvs.com",
        "market_cap": "Mid Cap"
    },
    "IB.MI": {
        "short_name": "INIZIATIVE BRESCIANE",
        "long_name": "Iniziative Bresciane S.p.A.",
        "summary": "Iniziative Bresciane S.p.A. designs, constructs, and operates small and medium-sized hydroelectric plants in Italy. Its hydroelectric plants are located in the provinces of Brescia, Bergamo, and Cremona. The company was founded in 1988 and is based in Breno, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Breno",
        "zipcode": "25043",
        "website": "http://www.iniziativebrescianespa.it",
        "market_cap": "Micro Cap"
    },
    "ILP.MI": {
        "short_name": "ILPRA",
        "long_name": "ILPRA S.p.A.",
        "summary": "ILPRA S.p.A. designs, produces, and sells packaging machines worldwide. It offers tray sealers, fillers and sealers, thermoformers, form fill seal, traysealers seal box, fill seal, and buckets fillers. The company's products are used in the packaging of food products, such as meat and poultry, fish and seafood, milk and dairy products, agricultural products, water and drinks, cold cuts and cured meat, sauces and dipping, sweets and desserts, bread and bakery products, fresh pasta, pet food, ready meals, and preserves; non-food products, including stationery, electronic components, mechanical components, chemical products, household articles, and perfumes and cosmetics; and medical devices, disposable and injectable products, pharmaceutical products, and medical instruments. It also provides personalized consultancy, training course, service and maintenance, revamping and retrofitting, and showroom and testing room services, as well as spare parts and used machines. The company was founded in 1955 and is based in Mortara, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "PV",
        "city": "Mortara",
        "zipcode": "27036",
        "website": "http://www.ilpra.com",
        "market_cap": "Micro Cap"
    },
    "IMPJY": {
        "short_name": "WEBUILD SPA UNSP ADR EACH REPR ",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Mid Cap"
    },
    "IP.MI": {
        "short_name": "INTERPUMP GROUP",
        "long_name": "Interpump Group S.p.A.",
        "summary": "Interpump Group S.p.A. manufactures and markets high pressure plunger pumps in Italy, rest of Europe, North America, the Far East, Oceania, and internationally. It operates in two segments, Hydraulic Sector and Water Jetting Sector. The Hydraulic Sector segment produces and sells power take-offs that transmit drive from an industrial vehicle engine or transmission through hydraulic components; hydraulic cylinders that are components of hydraulic systems of various vehicle types; front-end and underbody cylinders for use in industrial vehicles in the construction sector; double acting cylinders, which are used in a range of applications, such as earthmoving and agricultural machinery, cranes and truck cranes, waste compactors, etc.; hydraulic lines and fittings that are used in hydraulic equipment and water systems; and pumps, directional controls, valves, other hydraulic components, and ancillary products. The Water Jetting Sector segment provides high pressure pumps and systems that are used in a range of industrial sectors for the conveyance of fluids. This segment's high pressure plunger pumps are the primary components of pressure washers, as well as used for car wash installations, forced lubrication systems for machine tools, and inverse osmosis systems for seawater desalination plants. Its very high-pressure pumps and systems are used for cleaning surfaces, ship hulls, and various hoses; removing machining burr; cutting and removing cement, asphalt, and paint coatings from stone, cement, and metal surfaces; and cutting solid materials. This segment also engages in drawing, blanking, and pressing sheet metals; and providing high pressure homogenizers, mixers, agitators, piston pumps, values, and other machines for use in the food processing, chemicals, cosmetics, and pharmaceutical industries. The company also engages in the research and development activities. Interpump Group S.p.A. was founded in 1977 and is based in Sant'Ilario d'Enza, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RE",
        "city": "Sant'ilario D'enza",
        "zipcode": "42049",
        "website": "http://www.interpumpgroup.it",
        "market_cap": "Mid Cap"
    },
    "IPJ1.F": {
        "short_name": "WEBUILD S.P.A.",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Mid Cap"
    },
    "IRC.MI": {
        "short_name": "IRCE",
        "long_name": "IRCE S.p.A.",
        "summary": "IRCE S.p.A. manufactures and sells winding wires and electrical cables in Italy and internationally. The company offers enameled copper and aluminum round wires, and copper and aluminum rectangular wires for use in electric motors, generators, transformers, compressors, inductors, relays, solenoid valves, etc. It also provides wiring cables, low voltage and medium voltage building and industrial cables, data cables, and power cords with plugs for the construction of electricity plants in residential and industrial buildings, as well as for the wiring and cabling of electrical appliances. The company was founded in 1947 and is based in Imola, Italy. IRCE S.p.A. is a subsidiary of Aequafin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BO",
        "city": "Imola",
        "zipcode": "40026",
        "website": "http://www.irce.it",
        "market_cap": "Micro Cap"
    },
    "IRQ.SG": {
        "short_name": "IRCE S.P.A. Azioni nom. EO 0,52",
        "long_name": "IRCE S.p.A.",
        "summary": "IRCE S.p.A. manufactures and sells winding wires and electrical cables in Italy and internationally. The company offers enameled copper and aluminum round wires, and copper and aluminum rectangular wires for use in electric motors, generators, transformers, compressors, inductors, relays, solenoid valves, etc. It also provides wiring cables, low voltage and medium voltage building and industrial cables, data cables, and power cords with plugs for the construction of electricity plants in residential and industrial buildings, as well as for the wiring and cabling of electrical appliances. The company was founded in 1947 and is based in Imola, Italy. IRCE S.p.A. is a subsidiary of Aequafin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Italy",
        "state": "BO",
        "city": "Imola",
        "zipcode": "40026",
        "website": "http://www.irce.it",
        "market_cap": "Micro Cap"
    },
    "LDO.MI": {
        "short_name": "LEONARDO",
        "long_name": "Leonardo S.p.a.",
        "summary": "Leonardo S.p.a. engages in the helicopters, defense electronics and security systems, aeronautics, space, and other businesses in Italy, the United Kingdom, rest of Europe, the United States, and internationally. It researches, designs, develops, produces, supports, and markets a range of helicopters for commercial, public service, and security and defense applications. The company also offers multi-mission, tactical transport, combat, and trainer aircraft; airborne solutions, such as components, airborne sensors, and effectors in the electromagnetic spectrum, as well as ISR/information/intelligence, surveillance, targeting acquisition, and reconnaissance; unmanned aerial systems; and aero structures. In addition, it provides command, control, communications, and computers solutions for the digital battlefield; air defense solutions; air traffic control and management; vehicle systems; land weapon systems; soldier systems; force protection and border control products; radars; communication products; optronics; electronic warfare products; and unmanned systems for land operations. Further, the company offers command and control, maritime domain awareness, and weapon systems for sea; and cyber and digital solutions, professional communications, operation and control products, and handling systems. Additionally, it provides services and infrastructures, space and alliance, payloads and equipment, and programs for space, as well as services and trainings. The company was formerly known as Leonardo Â\u0096 Finmeccanica S.p.a. and changed its name to Leonardo S.p.a. in January 2017. Leonardo S.p.a. was founded in 1948 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00195",
        "website": "http://www.leonardocompany.com/en/home",
        "market_cap": "Mid Cap"
    },
    "LDO.VI": {
        "short_name": "LEONARDO SPA",
        "long_name": "Leonardo S.p.a.",
        "summary": "Leonardo S.p.a. engages in the helicopters, defense electronics and security systems, aeronautics, space, and other businesses in Italy, the United Kingdom, rest of Europe, the United States, and internationally. It researches, designs, develops, produces, supports, and markets a range of helicopters for commercial, public service, and security and defense applications. The company also offers multi-mission, tactical transport, combat, and trainer aircraft; airborne solutions, such as components, airborne sensors, and effectors in the electromagnetic spectrum, as well as ISR/information/intelligence, surveillance, targeting acquisition, and reconnaissance; unmanned aerial systems; and aero structures. In addition, it provides command, control, communications, and computers solutions for the digital battlefield; air defense solutions; air traffic control and management; vehicle systems; land weapon systems; soldier systems; force protection and border control products; radars; communication products; optronics; electronic warfare products; and unmanned systems for land operations. Further, the company offers command and control, maritime domain awareness, and weapon systems for sea; and cyber and digital solutions, professional communications, operation and control products, and handling systems. Additionally, it provides services and infrastructures, space and alliance, payloads and equipment, and programs for space, as well as services and trainings. The company was formerly known as Leonardo Â\u0096 Finmeccanica S.p.a. and changed its name to Leonardo S.p.a. in January 2017. Leonardo S.p.a. was founded in 1948 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00195",
        "website": "http://www.leonardocompany.com/en/home",
        "market_cap": "Mid Cap"
    },
    "LUVE.MI": {
        "short_name": "LUVE",
        "long_name": "LU-VE S.p.A.",
        "summary": "LU-VE S.p.A. manufactures and sells refrigeration and air conditioning products in Italy and internationally. The company's products consisting commercial and industrial coolers, air coolers, tubeless steel condensers, air cooled condensers, dry coolers, and accessories and special products. It offers its products for industrial and commercial refrigeration, and air conditioning, as well as energy, power, industrial, and OEM applications. LU-VE S.p.A. is headquartered in Uboldo, Italy. LU-VE S.p.A. is a subsidiary of Finami S.R.L.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VA",
        "city": "Uboldo",
        "zipcode": "21040",
        "website": "http://www.luve.it",
        "market_cap": "Small Cap"
    },
    "MARP.MI": {
        "short_name": "MARZOCCHI POMPE",
        "long_name": "Marzocchi Pompe S.p.A.",
        "summary": "Marzocchi Pompe S.p.A. engages in the design, manufacture, and sale of external gear pumps and motors in Italy and internationally. The company offers ELIKA Marzocchi pumps, micro pumps, aluminum gear motors, motors and pumps with flanges, built in valves, bearing support products, aluminum gear pumps, hi-low pumps, short pumps, modular pumps, pumps for power units, and fittings and seals kits. Its products are used in textile machines, machine tools, plastic injection machines, medical equipment, energy, mobile, and automotive, etc. The company was founded in 1949 and is based in Casalecchio di Reno, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BO",
        "city": "Casalecchio Di Reno",
        "zipcode": "40033",
        "website": "http://marzocchipompe.com",
        "market_cap": "Nano Cap"
    },
    "MLITN.PA": {
        "short_name": "ITALY INNOVAZIONI",
        "long_name": "Italy Innovazioni S.P.A.",
        "summary": "Italy Innovazioni S.P.A. engages in the design, prototyping, production, and marketing of electric outlets for homes and offices in Italy and internationally. Its products include Hide, a recessed electrical outlet; SlideBox, an adjustable electrical box; and SuperDual, a multistandard socket. The company is based in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Electrical Equipment & Parts",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00187",
        "website": "http://www.italyinnovazioni.com",
        "market_cap": "Nano Cap"
    },
    "MT.MI": {
        "short_name": "MAIRE TECNIMONT",
        "long_name": "Maire Tecnimont S.p.A.",
        "summary": "Maire Tecnimont S.p.A. provides plant engineering services and works in Italy and internationally. The company's Hydrocarbons segment designs and constructs plants, including separation, treatment, liquefaction, transportation, storage, regasification, and compression and pumping stations principally for the natural gas chain; and chemical and petrochemical industry plants for the production of polyethylene and polypropylene, ethylene oxide, ethylene glycol, purified terephthalic acid, ammonia, urea, and fertilizers; and hydrocarbon electric power plants, and waste-to-energy and district heating plants. This segment also issues licenses on patented technology and proprietary know-how to urea producers; and is involved in activities related to sulphur recovery process, hydrogen production, and high temperature furnaces. The company's Green Energy segment offers mechanical plastics recycling and promotion of recycled chemicals; and develops additives and substitutes to oil for fuels or plastics from renewables activities. In addition, this segment provides maintenance and facility management services; general services for temporary construction facilities; and infrastructure design and construction services. Further, it undertakes works on renewables sector plants, which primarily include solar and wind plants. The company is headquartered in Milan, Italy. Maire Tecnimont S.p.A. is a subsidiary of GLV Capital S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20124",
        "website": "http://www.mairetecnimont.com",
        "market_cap": "Small Cap"
    },
    "OJM.MI": {
        "short_name": "OPENJOBMETIS",
        "long_name": "Openjobmetis S.p.A.",
        "summary": "Openjobmetis S.p.A. operates as an employment agency in Italy. It offers temporary or permanent placement, staff leasing, personnel recruitment and selection, training, and outplacement services, as well as manages employment relationship from the bureaucratic-administrative aspects to training. The company also provides digital head hunting services; family assistants for elderly and non-self-sufficient; and online recruitment services for people with disabilities. It offers its services to the naval, industrial, health, large-scale retail trade, bank and finance, information and communication technology, agro-industrial, hotel, restaurant, and catering sectors. Openjobmetis S.p.A. was founded in 2011 and is headquartered in Gallarate, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Staffing & Employment Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VA",
        "city": "Gallarate",
        "zipcode": "21013",
        "website": "http://www.openjobmetis.it",
        "market_cap": "Micro Cap"
    },
    "OS.MI": {
        "short_name": "OFFICINA STELLARE",
        "long_name": "Officina Stellare S.p.A.",
        "summary": "Officina Stellare S.p.A. designs and produces telescopes, and opto-mechanical and aerospace instrumentation for ground and space based applications worldwide. It serves aerospace, defense, earth observation, astronomy and science research, and laser communication sectors. The company was founded in 2009 and is headquartered in Sarcedo, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VI",
        "city": "Sarcedo",
        "zipcode": "36030",
        "website": "http://www.officinastellare.com",
        "market_cap": "Micro Cap"
    },
    "OSA.MI": {
        "short_name": "OSAI AUTOMATION SYSTEM",
        "long_name": "OSAI Automation System S.p.A.",
        "summary": "OSAI Automation System S.p.A. engages in the automation and robotics, electronic, laser micromachining, and semiconductor businesses in Italy and internationally. Its Automation and Robotics division offers Benches, an ergonomically designed modular workbench; rotary tables; lines; modular assembly line; and NeoTray, a vertical magazine suitable to manage blister for loading/unloading purpose. The company's Electronic division offers scalable and modular odd-shape assemblies, including Neoplace 304 modula for assembling ODD-shapes; Neomark Easy, a topnotch equipment for customer who need in line machines; Neo router modular, a solution for mechanical separation of PCB panels; Neocut Shape, which performs cutting operations without mechanical stresses on components; and NeoTray, a vertical magazine suitable to manage blister for loading/unloading purpose. The company's Semiconductor division provides Osai neohandler, a notch solution for semiconductor companies for testing MEMS and power devices in mass production; Osai power module test handler, an equipment for testing power modules; and Osai's burn-in loader/unloader solutions for pre-test operations. Its Laser Micromachining division offers DM2c, a laser marking system; fineweld 300, a laser welding system; fineplast 140R, a system for welding plastic components; and finecut 300, a system to laser cut metallic components. The company was founded in 1991 and is based in Turin, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TO",
        "city": "Turin",
        "zipcode": "10010",
        "website": "http://www.osai-as.com",
        "market_cap": "Micro Cap"
    },
    "PA6.F": {
        "short_name": "PRIMA INDUSTRIE  EO 2,50",
        "long_name": "Prima Industrie SpA",
        "summary": "Prima Industrie SpA develops, manufactures, and markets laser systems for industrial applications, sheet metal processing machines, and industrial electronics and laser sources. The company operates in two divisions, PRIMA POWER and PRIMA ELECTRO. The PRIMA POWER division designs, manufactures, and sells laser machines for cutting, welding, and punching of three-dimensional and two-dimensional metallic components; and sheet metal processing machines that use mechanical tools, such as punchers, integrated punching and shearing systems, integrated punching and laser cutting systems, panel bending products, bending machines, and automated systems. The Prima Electro division is involved in the development, construction, and sale of electronic power and control components, and high-power laser sources for industrial applications. The company operates in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. Prima Industrie SpA was founded in 1977 and is headquartered in Collegno, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "TO",
        "city": "Collegno",
        "zipcode": "10093",
        "website": "http://www.primaindustrie.com",
        "market_cap": "Micro Cap"
    },
    "PGC.F": {
        "short_name": "POLIGRAFICA S.F.  EO 5,16",
        "long_name": "Poligrafica S. Faustino S.p.A.",
        "summary": "Poligrafica S. Faustino S.p.A. engages in the printing business in Italy. It is also involved in direct marketing, electronic document management, e-procurement, and creation of tools for games and competitions. In addition, the company produces labels and packaging products; and operates as a digital marketing agency. The company was founded in 1957 and is headquartered in Castrezzato, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "BS",
        "city": "Castrezzato",
        "zipcode": "25030",
        "website": "http://www.psf.it",
        "market_cap": "Nano Cap"
    },
    "PLC.MI": {
        "short_name": "PLC",
        "long_name": "PLC S.p.A.",
        "summary": "PLC S.p.A. acts as a general contractor in the construction of renewable energy power plants in Italy and internationally. The company operates in two segments, Construction and Services. It constructs turnkey plants for the production of electrical energy from renewable sources; and monitors and maintains electrical power grids, transformers, and accessory plants of wind farms and photovoltaic plants, as well as offers installation, maintenance, and repair services for inverters. The company also markets wind generators and components for wind generators and wind farms, as well as provides maintenance, assembly, disassembly, and management services, including electrical and civil works. The company was formerly known as Industria e Innovazione S.p.A. and changed its name to PLC S.p.A. in July 2018. PLC S.p.A. is based in Milan, Italy. PLC S.p.A is a subsidiary of Fraes S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20123",
        "website": "http://www.plc-spa.com",
        "market_cap": "Micro Cap"
    },
    "PMT.MI": {
        "short_name": "PROMOTICA",
        "long_name": "Promotica S.p.A.",
        "summary": "Promotica S.p.A. operates in the loyalty marketing sector in Italy. It designs, organizes, and manages promotional operations and campaigns. The company was founded in 2003 and is headquartered in Desenzano del Garda, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Desenzano Del Garda",
        "zipcode": "25015",
        "website": "http://www.promotica.it",
        "market_cap": "Micro Cap"
    },
    "PRI.MI": {
        "short_name": "PRIMA INDUSTRIE",
        "long_name": "Prima Industrie SpA",
        "summary": "Prima Industrie SpA develops, manufactures, and markets laser systems for industrial applications, sheet metal processing machines, and industrial electronics and laser sources. The company operates in two divisions, PRIMA POWER and PRIMA ELECTRO. The PRIMA POWER division designs, manufactures, and sells laser machines for cutting, welding, and punching of three-dimensional and two-dimensional metallic components; and sheet metal processing machines that use mechanical tools, such as punchers, integrated punching and shearing systems, integrated punching and laser cutting systems, panel bending products, bending machines, and automated systems. The Prima Electro division is involved in the development, construction, and sale of electronic power and control components, and high-power laser sources for industrial applications. The company operates in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. Prima Industrie SpA was founded in 1977 and is headquartered in Collegno, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TO",
        "city": "Collegno",
        "zipcode": "10093",
        "website": "http://www.primaindustrie.com",
        "market_cap": "Micro Cap"
    },
    "PSF.MI": {
        "short_name": "POLIGRAF. S. F.",
        "long_name": "Poligrafica S. Faustino S.p.A.",
        "summary": "Poligrafica S. Faustino S.p.A. engages in the printing business in Italy. It is also involved in direct marketing, electronic document management, e-procurement, and creation of tools for games and competitions. In addition, the company produces labels and packaging products; and operates as a digital marketing agency. The company was founded in 1957 and is headquartered in Castrezzato, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Castrezzato",
        "zipcode": "25030",
        "website": "http://www.psf.it",
        "market_cap": "Nano Cap"
    },
    "PST.MI": {
        "short_name": "POSTE ITALIANE",
        "long_name": "Poste Italiane SpA",
        "summary": "Poste Italiane SpA provides postal, logistics, and financial and insurance products and services in Italy. It operates in four segments: Mail, Parcels and Distribution; Payments, Mobile and Digital; Financial Services; and Insurance Services. The Mail, Parcels and Distribution segment offers letter post, express delivery, logistics, parcels, and philately services. As of December 31, 2020, it operated a network of 12,765 post offices in Italy. The Payments, Mobile and Digital segment provides payment services, card payments, and mobile telecommunications services, as well as digital services for the public sector. The Financial Services segment is involved in the collection of various forms of savings deposits; provision of payment and foreign currency exchange services, as well as investment services; and promotion and arrangement of loans issued by banks and other authorized financial institutions. The Insurance Services segment offers life and casualty insurance products. Poste Italiane SpA was founded in 1862 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00144",
        "website": "http://www.posteitaliane.it",
        "market_cap": "Large Cap"
    },
    "PST.VI": {
        "short_name": "POSTE ITALIANE SPA",
        "long_name": "Poste Italiane SpA",
        "summary": "Poste Italiane SpA provides postal, logistics, and financial and insurance products and services in Italy. It operates in four segments: Mail, Parcels and Distribution; Payments, Mobile and Digital; Financial Services; and Insurance Services. The Mail, Parcels and Distribution segment offers letter post, express delivery, logistics, parcels, and philately services. As of December 31, 2020, it operated a network of 12,765 post offices in Italy. The Payments, Mobile and Digital segment provides payment services, card payments, and mobile telecommunications services, as well as digital services for the public sector. The Financial Services segment is involved in the collection of various forms of savings deposits; provision of payment and foreign currency exchange services, as well as investment services; and promotion and arrangement of loans issued by banks and other authorized financial institutions. The Insurance Services segment offers life and casualty insurance products. Poste Italiane SpA was founded in 1862 and is headquartered in Rome, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "VIE",
        "market": "at_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00144",
        "website": "http://www.posteitaliane.it",
        "market_cap": "Large Cap"
    },
    "PV0.F": {
        "short_name": "PIOVAN S.P.A.",
        "long_name": "Piovan S.p.A.",
        "summary": "Piovan S.p.A., through its subsidiaries, engages in the development and production of automation systems for storage, transport, and processing of plastics, and food powders and non-plastics in Europe, the Middle East, Africa, Asia, North America, and South America. The company offers feeding and conveying products, including automatic and manual coupling stations, receivers, system receivers, vacuum units, singe phase hopper loaders, and production monitoring products; and drying and dehumidifying products, such as auto-adaptive central drying, rotor drying, single and double desiccant tower drying, compressed air drying, hot air drying, and crystallization systems, as well as mold and other drying systems. It also provides dosing and blending systems comprising quantum gravimetric batch blenders, LGR cooled masterbatch metering units, LG continuous masterbatch dosing units, LV volumetric masterbatch dosing units, MDW gravimetric batch blenders, and MDP volumetric dosing units; and granulation systems, single shaft shredders, dust collectors, and dust separation systems. In addition, the company offers temperature control units; process water cooling systems; and analysis instruments. Further, it provides software products that include Winfactory 4.0, a supervision software for process control and management; and Winenergy, a proprietary software for monitoring and analyzing energy consumption, as well as help desk, maintenance contracts, training, equipment overhauling, engineering, installation, and energy audit services, as well as spare parts. The company's products has applications in PET preforms and bottles, rigid packaging, automotive components, technical parts, medical solutions, thermoforming and technical sheets, flexible films, fibers and strapping, and recycling and compounds, as well as pipes, profiles, and cables. The company was founded in 1934 and is headquartered in Santa Maria di Sala, Italy. Piovan S.p.A. is a subsidiary of Pentafin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "VE",
        "city": "Santa Maria Di Sala",
        "zipcode": "30036",
        "website": "http://www.piovan.com",
        "market_cap": "Small Cap"
    },
    "PVN.MI": {
        "short_name": "PIOVAN",
        "long_name": "Piovan S.p.A.",
        "summary": "Piovan S.p.A., through its subsidiaries, engages in the development and production of automation systems for storage, transport, and processing of plastics, and food powders and non-plastics in Europe, the Middle East, Africa, Asia, North America, and South America. The company offers feeding and conveying products, including automatic and manual coupling stations, receivers, system receivers, vacuum units, singe phase hopper loaders, and production monitoring products; and drying and dehumidifying products, such as auto-adaptive central drying, rotor drying, single and double desiccant tower drying, compressed air drying, hot air drying, and crystallization systems, as well as mold and other drying systems. It also provides dosing and blending systems comprising quantum gravimetric batch blenders, LGR cooled masterbatch metering units, LG continuous masterbatch dosing units, LV volumetric masterbatch dosing units, MDW gravimetric batch blenders, and MDP volumetric dosing units; and granulation systems, single shaft shredders, dust collectors, and dust separation systems. In addition, the company offers temperature control units; process water cooling systems; and analysis instruments. Further, it provides software products that include Winfactory 4.0, a supervision software for process control and management; and Winenergy, a proprietary software for monitoring and analyzing energy consumption, as well as help desk, maintenance contracts, training, equipment overhauling, engineering, installation, and energy audit services, as well as spare parts. The company's products has applications in PET preforms and bottles, rigid packaging, automotive components, technical parts, medical solutions, thermoforming and technical sheets, flexible films, fibers and strapping, and recycling and compounds, as well as pipes, profiles, and cables. The company was founded in 1934 and is headquartered in Santa Maria di Sala, Italy. Piovan S.p.A. is a subsidiary of Pentafin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VE",
        "city": "Santa Maria Di Sala",
        "zipcode": "30036",
        "website": "http://www.piovan.com",
        "market_cap": "Small Cap"
    },
    "REN.MI": {
        "short_name": "RENERGETICA",
        "long_name": "Renergetica S.p.A.",
        "summary": "Renergetica S.p.A., a smart energy company, provides a suite of development, engineering, and asset management services for renewable energy plants and energy storage solutions worldwide. The company's development services include market analysis and feasibility, project feasibility, authorization, and project sale. It also provides engineering services, such as due diligence, design, and owner engineering; and engages in the engineering and project management of solar, wind, and hydro power plants of third parties, as well as hybrid systems. In addition, the company engages in the provision of technical and administrative management services for the solar and wind plants comprising plant control and monitoring, maintenance supervision, commercial and insurance management, and budgeting and reporting services. The company was founded in 2008 and is based in Genova, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "GE",
        "city": "Genoa",
        "zipcode": "16123",
        "website": "http://www.renergetica.com",
        "market_cap": "Nano Cap"
    },
    "ROS.MI": {
        "short_name": "ROSSS",
        "long_name": "Rosss S.p.A.",
        "summary": "Rosss S.p.A. provides metal shelving for offices, storages, warehouses, shops, and supermarkets primarily in Italy. The company offers heavy storage shelves, such as iron fist pallet racks, iron fist drive in shelves, dublez shelvings, sequoia cantilevers, mammuth super pallet racks, and tree cheese scalera. It also provides lightweight storage shelves, including unimondial hook shelving; Unimondial Galv, a galvanized hook shelving; Unizinc Easy, an interlocking shelving; and Train, a compactable shelf. In addition, the company offers Mecano, a mezzanine without welding; Ti-Abbraccio ergonomic check-out counters; and anti-seismic, self-supporting, and integrated systems. It also exports its products to approximately 50 countries. Rosss S.p.A. was founded in 1981 and is headquartered in Florence, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Business Equipment & Supplies",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": null,
        "city": "Florence",
        "zipcode": "50038",
        "website": "http://www.rosss.it",
        "market_cap": "Nano Cap"
    },
    "SAB.MI": {
        "short_name": "SABAF",
        "long_name": "Sabaf S.p.A.",
        "summary": "Sabaf S.p.A. designs, manufactures, and sells components for household cooking appliances. It operates through Gas Parts, Hinges, and Electronic Components segments. The company offers taps with or without a flame failure device that are used in free-standing cookers or in built-in hobs; thermostats with or without a flame failure device used in free-standing cookers and built-in ovens; and burners, as well as gas burners for ovens and grills. It also provides hinges for use in household appliances, such as built-in ovens, free-standing cookers, washing machines, dishwashers, ovens, and microwaves; electronic control boards, timers, display, and power supply units for ovens, kitchen hoods, vacuum cleaners, refrigerators, and freezers; and a range of accessories, including electrodes, micro switch harnesses, injectors, micro switches, fittings and plugs, thermocouples, and screws and brackets. The company offers its products to customers in Italy, Western Europe, Eastern Europe, the Middle East, Africa, Asia, Oceania, South America, North America, and Mexico. Sabaf S.p.A. was founded in 1950 and is headquartered in Ospitaletto, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Ospitaletto",
        "zipcode": "25035",
        "website": "http://www.sabaf.it",
        "market_cap": "Small Cap"
    },
    "SCF.MI": {
        "short_name": "SALCEF GROUP",
        "long_name": "Salcef Group S.p.A.",
        "summary": "Salcef Group S.p.A. designs, constructs, and maintains railway infrastructure and civil works worldwide. The company is involved in the renewal and replacement of railway lines and sleepers, cleaning and replacement of ballasts, levelling of tracks, reactivation of lines, and destressing activities; construction of ballasted and ballastless tracks; execution of light civil and infrastructural works, such as industrial engineering, restyling bridges and tunnels, modernizing stations, building small underpasses and overpasses, and rebuilding road networks; and provision of rail grinding, welding, compaction, and sand and dust extraction services. It also designs, constructs, sells, and maintains rolling stock and railway equipment, including modular platforms, motor trolleys, trolleys with cranes, concrete dispencers, and track positioning jigs, as well as provides used equipment and after-sales service. In addition, the company engages in the design, construction, installation, renewal, and maintenance of various electrification systems for railway, metro, and tram lines; signalling, technological, and telecommunication systems; and electrical transmission and overhead power lines, as well as underground cables. Further, it manufactures and sells various types of railway sleepers, precast reinforced concrete slabs, and precast tunnel lining segments; undertakes architectural, structural, and plant engineering projects comprising railway stations, bridges and viaducts, railway tunnels, and environmental mitigation works; and offers design and engineering services railway and infrastructures works. The company was founded in 1949 and is headquartered in Rome, Italy. Salcef Group S.p.A. is a subsidiary of Finhold S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00158",
        "website": "http://www.salcef.com",
        "market_cap": "Small Cap"
    },
    "SCK.MI": {
        "short_name": "SCIUKER FRAMES",
        "long_name": "Sciuker Frames S.p.A.",
        "summary": "Sciuker Frames S.p.A. designs, manufactures, and sells aluminum wood and structural glass wood windows in Italy. It also offers aluminum shutters. The company is headquartered in Contrada, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "AV",
        "city": "Contrada",
        "zipcode": "83020",
        "website": "http://www.sciuker.it",
        "market_cap": "Micro Cap"
    },
    "SEB.MI": {
        "short_name": "SEBINO",
        "long_name": "Sebino S.p.A.",
        "summary": "Sebino S.p.A. engages in the design, development, installation, and maintenance of fire-fighting systems for the detection of fires or intrusions. It also provides security system integration services for smoke detection, anti-intrusion, access control, video surveillance with video analysis, and other systems; and services for system, fire prevention, security, smoke detection, and CCTV. The company was founded in 1979 and is headquartered in Madone, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BG",
        "city": "Madone",
        "zipcode": "24040",
        "website": "http://www.sebino.eu",
        "market_cap": "Micro Cap"
    },
    "SECN.L": {
        "short_name": "SEC NEWGATE S.P.A. ORD NPV (CDI",
        "long_name": "SEC Newgate S.p.A.",
        "summary": "SEC Newgate S.p.A., through its subsidiaries, provides public relations, advocacy, communications, and public affairs services in Italy, the United Kingdom, Belgium, Colombia, Spain, Poland, France, Germany, Australia, Hong Kong, China, Singapore, the United Arab Emirates, and Morocco. It provides a range of communications, public affairs, and integrated services specializing in corporate and financial communications, consumer PR, investor relations, financial communications, B2B PR, public affairs, digital services, research, analytics, and media planning and buying. The company was formerly known as SEC S.p.A and changed its name to SEC Newgate S.p.A. in September 2019. SEC Newgate S.p.A. was founded in 1989 and is headquartered in Milan, Italy.",
        "currency": "GBp",
        "sector": "Industrials",
        "industry": "Consulting Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20125",
        "website": "http://www.secnewgate.com",
        "market_cap": null
    },
    "SGC.MI": {
        "short_name": "SG COMPANY",
        "long_name": "SG Company S.p.A.",
        "summary": "SG Company S.p.A. provides live and digital communication services for B2B, B2C, and BTL markets. The company was founded in 2000 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20145",
        "website": "http://www.sg-company.it",
        "market_cap": "Nano Cap"
    },
    "SIO.MI": {
        "short_name": "SIRIO",
        "long_name": "Sirio S.p.A",
        "summary": "Sirio S.p.A operates in the hospital catering sector in Italy. It also operates franchised stores under the Burger King brand name. Sirio S.p.A was founded in 1993 and is based in Ravenna, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RA",
        "city": "Ravenna",
        "zipcode": "48124",
        "website": "http://www.siriospa.it",
        "market_cap": "Nano Cap"
    },
    "SIT.MI": {
        "short_name": "SIT",
        "long_name": "SIT S.p.A.",
        "summary": "SIT S.p.A. develops, manufactures, and sells measuring devices and systems for the domestic gas equipment worldwide. The company offers mechanical controls, such as electrical on off, electrical and air/gas modulation, mixer, and thermostatic and manual controls; electronic controls, including burner controls, heat recovery units, and controls for appliances; fans for condensing and atmospheric boilers, and electric fans for pellet stoves-extractor hoods and air recirculation; and integrated systems. It also provides sensors comprising thermocouples, oxyprotectors, oxypilots, sensing elements, temperature sensors devices, pressure switches, and pilot burners; flue kits consisting of coaxial and twin flue systems, exhaust and condensing kits, roof terminal and cascade systems, and condensate traps; fans for range hoods; accessories; and gas meters. The company was founded in 1953 and is headquartered in Padua, Italy. SIT S.p.A. is a subsidiary of SIT Technologies Spa.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "PD",
        "city": "Padua",
        "zipcode": "35129",
        "website": "http://www.sitgroup.it",
        "market_cap": "Micro Cap"
    },
    "SITI.MI": {
        "short_name": "SITI - B&T",
        "long_name": "SITI - B&T Group S.p.A.",
        "summary": "SITI - B&T Group S.p.A. engages in the production of plants for the tile manufacturing industry worldwide. The company also provides digital decorating machines and digital graphic design projects; plants for sanitary ware; and finishing systems for ceramic materials. In addition, it offers technical assistance for the installation, maintenance, and modernization of production lines. The company was founded in 1961 and is based in Formigine, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MO",
        "city": "Formigine",
        "zipcode": "41043",
        "website": "http://www.siti-bt.com",
        "market_cap": "Nano Cap"
    },
    "SJW.SG": {
        "short_name": "Ambienthesis S.p.A. Azioni nom.",
        "long_name": "Ambienthesis S.p.A.",
        "summary": "Ambienthesis S.p.A. engages in the remediation, environmental remediation and treatment, recovery, and disposal of special, hazardous, and non-hazardous waste in Italy. The company designs, constructs, and manages systems for the disposal and recovery of industrial waste, as well as energy production; provides disposal services to various civil and industrial liquid waste; and stores various waste, such as batteries, paint, T/F containers, drugs, acids, bases, and reagents. It also offers remediation of contaminated sites. In addition, it installs fixed waste treatment/recovery plants and mobile systems. The company is based in Segrate, Italy. Ambienthesis S.p.A. is a subsidiary of Greenthesis SpA.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Waste Management",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Segrate",
        "zipcode": "20090",
        "website": "http://www.ambienthesis.it",
        "market_cap": "Micro Cap"
    },
    "SM5.SG": {
        "short_name": "SABAF S.P.A. Azioni nom. EO 1",
        "long_name": "Sabaf S.p.A.",
        "summary": "Sabaf S.p.A. designs, manufactures, and sells components for household cooking appliances. It operates through Gas Parts, Hinges, and Electronic Components segments. The company offers taps with or without a flame failure device that are used in free-standing cookers or in built-in hobs; thermostats with or without a flame failure device used in free-standing cookers and built-in ovens; and burners, as well as gas burners for ovens and grills. It also provides hinges for use in household appliances, such as built-in ovens, free-standing cookers, washing machines, dishwashers, ovens, and microwaves; electronic control boards, timers, display, and power supply units for ovens, kitchen hoods, vacuum cleaners, refrigerators, and freezers; and a range of accessories, including electrodes, micro switch harnesses, injectors, micro switches, fittings and plugs, thermocouples, and screws and brackets. The company offers its products to customers in Italy, Western Europe, Eastern Europe, the Middle East, Africa, Asia, Oceania, South America, North America, and Mexico. Sabaf S.p.A. was founded in 1950 and is headquartered in Ospitaletto, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Italy",
        "state": "BS",
        "city": "Ospitaletto",
        "zipcode": "25035",
        "website": "http://www.sabaf.it",
        "market_cap": "Small Cap"
    },
    "SOM.MI": {
        "short_name": "SOMEC",
        "long_name": "Somec S.p.A.",
        "summary": "Somec S.p.A. engineers, designs, and manufactures glass envelopes and faÃ§ades, special architectural projects, public areas interiors, and professional cooking equipment in Italy and internationally. It offers doors and windows, balcony balustrades and partitions, prefabricated balconies, continuous glass walls, skylights and winter gardens, and wheelhouse and special glazing products, as well as fire resistant products. The company also provides marine refitting services; and designs, produces, and commissions catering solutions for cruise ships. In addition, it offers marine interiors outfitting services, including newbuilding and refit of cruise liners, private yachts, and military vessels; and engineer solutions for building faÃ§ades and architectural interior projects. Further, the company is involved in the design, engineering, and production of combination ovens for professional appliances. Somec S.p.A. was founded in 1978 and is headquartered in San Vendemiano, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TV",
        "city": "San Vendemiano",
        "zipcode": "31020",
        "website": "http://www.somecgroup.com",
        "market_cap": "Micro Cap"
    },
    "SRI.MI": {
        "short_name": "SERVIZI ITALIA",
        "long_name": "Servizi Italia S.p.A.",
        "summary": "Servizi Italia S.p.A. provides integrated services for the rental, washing, and sterilization of textiles and surgical instruments to public and private hospital facilities. The company offers wash-hire services, including planning and provision of integrated rental services; reconditioning services, such as disinfection, washing, finishing, and packaging; and logistics services for textile items, mattresses, and accessories. Its wash-hire services also comprise rental and washing of high visibility '118' emergency service items; and logistics and management of hospital wardrobes. The company also provides linen sterilization services, which include planning and rental of sterile medical devices, such as linens for operating theatres and scrubs, as well as personal protection equipment comprising gloves and masks. In addition, it offers surgical instruments sterilization services, including planning and provision of washing, packaging, and sterilization of surgical instruments and accessories for operating theatres, as well as planning, installation, and renovation of sterilization centers. It provides its services in central and northern Italy, Turkey, India, Albania, and Morocco, as well as in Sao Paulo, Brazil. The company was founded in 1986 and is headquartered in Castellina di Soragna, Italy. Servizi Italia S.p.A. is a subsidiary of Aurum S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "PR",
        "city": "Castellina Di Soragna",
        "zipcode": "43019",
        "website": "http://www.si-servizitalia.com",
        "market_cap": "Micro Cap"
    },
    "TES.MI": {
        "short_name": "TESMEC",
        "long_name": "Tesmec S.p.A.",
        "summary": "Tesmec S.p.A. designs, produces, and markets products and solutions for the construction, maintenance, and streamlining of infrastructures relating to the transmission of electrical power, data, and material transport in Italy, rest of Europe, the Middle East, Africa, North and Central America, and BRIC and other countries. It operates through Energy, Trencher, and Rail segments. The company offers stringing machines, accessories, and tools, including winches, pullers, tensioners, puller-tensioners, reel and drum elevators, ropes, pulleys, head boards, trolleys, light alloy structures, and safety devices, as well as additional devices, equipment, and accessories for underground cables laying. It also provides energy automation products comprising powerline communication systems, teleprotection equipment, remote terminal units, smart metering tools, protection relays, T-protection and measure relays, directional fault detectors, portable discoverers, pole discoverers, and smart sensors; and engineering, integration, training, commissioning, and after-sale support services. In addition, the company offers trenchers, surface miners, multifunctional machines, georadar explorer accessories, minitrenches, automatic machine guidance systems, control systems, and remote monitoring systems; and railway catenary installation products, including constant tension stringing units, catenary maintenance multipurpose units, track maintenance units, and the pantograph for catenary parameters measurement. Further, it provides consultancy and excavation services for power lines and fiber optic cables. Tesmec S.p.A. was founded in 1951 and is headquartered in Grassobbio, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Industrial Machinery",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BG",
        "city": "Grassobbio",
        "zipcode": "24050",
        "website": "http://www.tesmec.com",
        "market_cap": "Micro Cap"
    },
    "TFI.MI": {
        "short_name": "TREVI FIN IND",
        "long_name": "TREVI - Finanziaria Industriale S.p.A.",
        "summary": "TREVI - Finanziaria Industriale S.p.A., together with its subsidiaries, provides foundation engineering services worldwide. It offers foundation engineering services for civil works and infrastructure projects; and constructs equipment for special foundations. The company also engages in the construction of drill rigs for the extraction of hydrocarbons and water exploration; and provides oil drilling services. In addition, it manufactures and markets plant and equipment for foundation engineering; and drilling equipment for the extraction of hydrocarbons and water exploration. The company was founded in 1957 and is based in Cesena, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "FO",
        "city": "Cesena",
        "zipcode": "47522",
        "website": "http://www.trevifin.com",
        "market_cap": "Micro Cap"
    },
    "TM3.F": {
        "short_name": "ASTM S.P.A.",
        "long_name": "ASTM S.p.A.",
        "summary": "ASTM S.p.A., an industrial holding company, operates in the sectors of motorway management, infrastructure engineering and construction projects, and transport and mobility technology. The company operates through five segments: Motorway Sector (Operating Activities), Motorway/EPC Sector Planning and Construction Activities-IFRIC 12, EPC Sector, Technology Sector, Services Sector. As of June 30, 2020, the company managed a motorway network of approximately 4,594 km, which included 1,423 km network in Italy, as well as 3,171 km located internationally. It also designs and builds principal transport infrastructure works, roads, motorways, railways, underground railways, bridges, viaducts, and tunnels; and civil and industrial construction works, such as hospitals, shopping centers, and airports, as well as electrical and electromechanical systems. In addition, the company designs, builds, and manages infrastructure network monitoring systems, info mobility products, toll collection products, etc.; develops technological software, primarily application software that manages road databases; and engages in the engineering and integration of technologies and instruments to carry out tools for photographic, geometric, and topographic surveys of infrastructures. Further, it develops and implements technologies in the service of safety and assisted driving of vehicles; and operates in the lease sector of both fiber optics and sites for the positioning of transmission devices for companies operating in the mobile telephony sector. Additionally, ASTM S.p.A. is involved in the design, construction, and management of systems for safety, mobility information, toll collection, and telecommunications. The company was formerly known as Autostrada Torino Milano S.p.A. and changed its name to ASTM S.p.A. in January 2013. ASTM S.p.A. was founded in 1928 and is based in Turin, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "TO",
        "city": "Turin",
        "zipcode": "10144",
        "website": "http://www.astm.it",
        "market_cap": "Mid Cap"
    },
    "TPS.MI": {
        "short_name": "TPS",
        "long_name": "Technical Publications Service S.p.A.",
        "summary": "Technical Publications Service S.p.A. provides technical and engineering services for the aeronautical industry in Italy. It also provides support services to the customers in the design of complex, mechanical, structural, electrical, and avionics systems; and technical publishing and training services. In addition, the company develops and integrates avionics systems for military and civilian aircrafts, such as multipurpose screens, FMS and navigation, and communication radio systems; and offers cost engineering services, as well as provides information technology services. The company was founded in 1964 and is based in Gallarate, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VA",
        "city": "Gallarate",
        "zipcode": null,
        "website": "http://www.tps-group.it",
        "market_cap": "Nano Cap"
    },
    "TV92.F": {
        "short_name": "TREVI-FIN. INDUSTR.",
        "long_name": "TREVI - Finanziaria Industriale S.p.A.",
        "summary": "TREVI - Finanziaria Industriale S.p.A., together with its subsidiaries, provides foundation engineering services worldwide. It offers foundation engineering services for civil works and infrastructure projects; and constructs equipment for special foundations. The company also engages in the construction of drill rigs for the extraction of hydrocarbons and water exploration; and provides oil drilling services. In addition, it manufactures and markets plant and equipment for foundation engineering; and drilling equipment for the extraction of hydrocarbons and water exploration. The company was founded in 1957 and is based in Cesena, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "FO",
        "city": "Cesena",
        "zipcode": "47522",
        "website": "http://www.trevifin.com",
        "market_cap": "Micro Cap"
    },
    "TWL.MI": {
        "short_name": "TRAWELL CO",
        "long_name": "TraWell Co S.p.A.",
        "summary": "TraWell Co S.p.A., together with its subsidiaries, provides baggage protection services at airports in Europe, Russia, North America, and South America. It offers luggage wrapping, baggage tracking, bike box, luggage storage, and bag weighing scale services; and various travel accessories and products. The company also provides SafeBag24, a lost and found concierge service. In addition, it offers additional services, such as luggage deposits, luggage deliveries, concierge services, etc. The company was formerly known as Safe Bag S.p.A. and changed its name to TraWell Co S.p.A. in November 2018. TraWell Co S.p.A. was founded in 1997 and is headquartered in Gallarate, Italy. TraWell Co S.p.A. operates as a subsidiary of RG Holding S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "VA",
        "city": "Gallarate",
        "zipcode": "21013",
        "website": "http://www.safe-bag.com",
        "market_cap": "Nano Cap"
    },
    "TYA.MI": {
        "short_name": "TOSCANA AEROPORTI",
        "long_name": "Toscana Aeroporti S.p.A.",
        "summary": "Toscana Aeroporti S.p.A. operates and manages Florence and Pisa airports in Italy. It manages handling activities; and provides warehousing, freight forwarding, and air courier services. The company also offers restaurants, catering, and food services, as well as parking services. In addition, it engages in advertising and real estate activities. The company was formerly known as SocietÃ  Aeroporto Toscano (S.A.T.) Galileo Galilei S.p.A. and changed its name to Toscana Aeroporti S.p.A. in June 2015. The company was founded in 1978 and is headquartered in Florence, Italy. Toscana Aeroporti S.p.A. is a subsidiary of Corporacion America Italia S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Airports & Air Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "FI",
        "city": "Florence",
        "zipcode": "50127",
        "website": "http://www.toscana-aeroporti.com",
        "market_cap": "Micro Cap"
    },
    "VE.MI": {
        "short_name": "VISIBILIA EDITORE",
        "long_name": "Visibilia Editore S.p.a.",
        "summary": "Visibilia Editore S.p.a. edits, publishes, and distributes furniture, hi-tech, and cinema related brochures, journals, and periodicals in Italy. The company also provides technical and editorial assistance and consultancy services. In addition, it collects and manages advertising in periodicals by printed paper, as well as in digital formats through customized solutions using the Google AdWords platform. The company was founded in 1999 and is based in Milan, Italy. Visibilia Editore S.p.a. is a subsidiary of Visibilia S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": null,
        "city": "Milan",
        "zipcode": "20122",
        "website": "http://www.visibiliaeditore.it",
        "market_cap": "Nano Cap"
    },
    "VIM.MI": {
        "short_name": "VIMI FASTENERS",
        "long_name": "vimi fasteners S.p.a.",
        "summary": "Vimi Fasteners S.p.A. manufactures and supplies various fastener systems for the automotive, industrial engine and vehicle, oil and gas, and aerospace and motorsport markets in Italy. The company offers crankcase screws and studs, cylinder head screws, flywheel bolts, bearing cap screws, connecting rod screws, screws for timing belt pulleys, adjusting screws for rocker arm distribution, and studs for exhaust systems and turbocharger screws; and turbocharger shafts, high temperature resistance studs and screws, and pins. It also provides exhaust manifold and exhaust systems, including locking knurling studs, and special screws and studs for high temperature applications; power transmission products; braking systems; and suspensions and wheel hubs. The company was formerly known as Viterie Mirabello. Vimi Fasteners S.p.A. founded in 1967 and is headquartered in Novellara, Italy. Vimi Fasteners S.p.A. operates as a subsidiary of Finregg S.p.a.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Tools & Accessories",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RE",
        "city": "Novellara",
        "zipcode": "42017",
        "website": "http://www.vimifasteners.com",
        "market_cap": "Nano Cap"
    },
    "WBD.MI": {
        "short_name": "WEBUILD",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Mid Cap"
    },
    "WBDR.MI": {
        "short_name": "WEBUILD RSP",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Small Cap"
    },
    "WMC.MI": {
        "short_name": "WM CAPITAL",
        "long_name": "WM Capital S.p.A.",
        "summary": "WM Capital S.p.A. engages in the development of business format franchising worldwide. Its activities include strategic support to growth and internationalization; entry mode strategies and development of foreign brands in the Italian market; assessment, analysis, and launch of franchise format in various industries; and franchisees research and match. The company serves fashion, energy, health and wellness, food, information technology, travel, and service industries. WM Capital S.p.A. is headquartered in Milan, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Specialty Business Services",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20146",
        "website": "http://www.wmcapital.it",
        "market_cap": "Nano Cap"
    },
    "YRM.MI": {
        "short_name": "ROSETTI MARINO",
        "long_name": "Rosetti Marino SpA",
        "summary": "Rosetti Marino SpA provides integrated services to the oil and gas, renewables, chemical, power generation, shipbuilding, and superyacht industrial sectors in Italy and internationally. The company offers engineering, procurement, construction, and installation (EPCI) services for offshore infrastructures, such as integrated topsides, living quarters, jackets, brownfield projects, upgrade and revamping projects, and subsea templates and manifolds, as well as power generation, compression, and utility modules; and onshore infrastructures, including gas/oil separation plants, compression and pumping stations, gathering stations, oil and gas power plants and substations, and process equipment. It also operates as an EPCI contractor for topside of electrical substations, power generation and utility modules, jackets, and transition pieces. In addition, the company offers conceptual and feasibility study, engineering, asset management, operation and maintenance, revamping/modification, mechanical completion and commissioning, and environmental and HSE study services. Further, it provides shipbuilding products comprising LNG-fueled vessels, tugboats, platform supply vessels, anchor handling tugs, anchor handling tug supply vessels, harbor and ocean going tugs, and RO/RO PAX ferries. The company was founded in 1925 and is headquartered in Ravenna, Italy. Rosetti Marino SpA is a subsidiary of Rosfin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RA",
        "city": "Ravenna",
        "zipcode": "48122",
        "website": "http://www.rosetti.it",
        "market_cap": "Micro Cap"
    }
}