{
  "3S0.F": {
    "city": "Pero",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Business Equipment & Supplies",
    "long_name": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "F.I.L.A. S.P.A.",
    "state": "MI",
    "summary": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A. produces and markets coloring, designing, modelling, writing, and painting objects worldwide. It provides pencils, crayons, modelling clays, chalks, oil colours, acrylics, watercolors, paints, and paper products for the fine arts, school, and leisure sectors. The company offers its products under the GIOTTO, DAS, LYRA, Canson, Maimeri, Daler-Rowney Lukas, Ticonderoga, Pacon, Strathmore, Princeton, and Arches brands. It sells its products through a distribution network of 35 commercial branches to wholesalers, office/school suppliers, mass-market retailers, distributors, and B2B operators, as well as online channels. The company was founded in 1920 and is headquartered in Pero, Italy.",
    "website": "http://www.filagroup.it",
    "zipcode": "20016"
  },
  "FILA.MI": {
    "city": "Pero",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Business Equipment & Supplies",
    "long_name": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A.",
    "market": "it_market",
    "market_cap": "Small Cap",
    "sector": "Industrials",
    "short_name": "FILA",
    "state": "MI",
    "summary": "F.I.L.A. - Fabbrica Italiana Lapis ed Affini S.p.A. produces and markets coloring, designing, modelling, writing, and painting objects worldwide. It provides pencils, crayons, modelling clays, chalks, oil colours, acrylics, watercolors, paints, and paper products for the fine arts, school, and leisure sectors. The company offers its products under the GIOTTO, DAS, LYRA, Canson, Maimeri, Daler-Rowney Lukas, Ticonderoga, Pacon, Strathmore, Princeton, and Arches brands. It sells its products through a distribution network of 35 commercial branches to wholesalers, office/school suppliers, mass-market retailers, distributors, and B2B operators, as well as online channels. The company was founded in 1920 and is headquartered in Pero, Italy.",
    "website": "http://www.filagroup.it",
    "zipcode": "20016"
  },
  "FNL.MI": {
    "city": "Bollate",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Business Equipment & Supplies",
    "long_name": "Finlogic S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "FINLOGIC",
    "state": "MI",
    "summary": "Finlogic S.p.A. designs, manufactures, and distributes labels in Italy and internationally. The company offers adhesive labels for use in the foodstuff, logistic, pharmaceutical, healthcare, and cosmetic sectors; and thermal transfer ribbons, including wax, wax/resin, and resin ribbons for printing on paper and synthetic materials. It also provides digital color printers for use in various production areas, such as food, industry, wine, chemical, cosmetic, and other areas under the DTM, Swift color, and VIPColor brands; and thermal transfer printers for use in label and bar code printing, printing on plastic paper and PVC, weather resistant labels, and production lines under the Sato, INTERMEC, Zebra, Datamax, and Argox brand name. In addition, the company offers bar code laser mobile computer and barcode scanners under the Intermec, Datalogic, Honeywell, Motorola and Symbol, and Opticon brands. Finlogic S.p.A. was founded in 2003 and is based in Bollate, Italy. Finlogic S.p.A. is a subsidiary of BF capital S.R.L.",
    "website": "http://www.finlogic.it",
    "zipcode": "20021"
  },
  "ROS.MI": {
    "city": "Florence",
    "country": "Italy",
    "currency": "EUR",
    "exchange": "MIL",
    "industry": "Business Equipment & Supplies",
    "long_name": "Rosss S.p.A.",
    "market": "it_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "ROSSS",
    "state": null,
    "summary": "Rosss S.p.A. provides metal shelving for offices, storages, warehouses, shops, and supermarkets primarily in Italy. The company offers heavy storage shelves, such as iron fist pallet racks, iron fist drive in shelves, dublez shelvings, sequoia cantilevers, mammuth super pallet racks, and tree cheese scalera. It also provides lightweight storage shelves, including unimondial hook shelving; Unimondial Galv, a galvanized hook shelving; Unizinc Easy, an interlocking shelving; and Train, a compactable shelf. In addition, the company offers Mecano, a mezzanine without welding; Ti-Abbraccio ergonomic check-out counters; and anti-seismic, self-supporting, and integrated systems. It also exports its products to approximately 50 countries. Rosss S.p.A. was founded in 1981 and is headquartered in Florence, Italy.",
    "website": "http://www.rosss.it",
    "zipcode": "50038"
  }
}
