{
    "3OY1.F": {
        "short_name": "MAIRE TECNIMONT SPA",
        "long_name": "Maire Tecnimont S.p.A.",
        "summary": "Maire Tecnimont S.p.A. provides plant engineering services and works in Italy and internationally. The company's Hydrocarbons segment designs and constructs plants, including separation, treatment, liquefaction, transportation, storage, regasification, and compression and pumping stations principally for the natural gas chain; and chemical and petrochemical industry plants for the production of polyethylene and polypropylene, ethylene oxide, ethylene glycol, purified terephthalic acid, ammonia, urea, and fertilizers; and hydrocarbon electric power plants, and waste-to-energy and district heating plants. This segment also issues licenses on patented technology and proprietary know-how to urea producers; and is involved in activities related to sulphur recovery process, hydrogen production, and high temperature furnaces. The company's Green Energy segment offers mechanical plastics recycling and promotion of recycled chemicals; and develops additives and substitutes to oil for fuels or plastics from renewables activities. In addition, this segment provides maintenance and facility management services; general services for temporary construction facilities; and infrastructure design and construction services. Further, it undertakes works on renewables sector plants, which primarily include solar and wind plants. The company is headquartered in Milan, Italy. Maire Tecnimont S.p.A. is a subsidiary of GLV Capital S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20124",
        "website": "http://www.mairetecnimont.com",
        "market_cap": "Small Cap"
    },
    "ACI.F": {
        "short_name": "ASTALDI S.P.A.  O.N.",
        "long_name": "Astaldi S.p.A.",
        "summary": "Astaldi S.p.A. designs, develops, and operates public infrastructure and civil engineering works in Italy and internationally. It undertakes transport infrastructure projects, including roads, bridges/viducts, railways, undergrounds, subways, stations, motorways, and tunnels; water and energy plants, such as hydroelectric plants, dams, aqueducts, and power stations. It is also involved in the civil and industrial buildings comprising schools, hospitals, underground rail stations, car parks, and exhibition spaces; and plant design and engineering, as well as offers operation and maintenance services. The company was founded in 1929 and is headquartered in Rome, Italy. Astaldi S.p.A. is a subsidiary of Webuild S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00156",
        "website": "http://www.astaldi.com",
        "market_cap": "Small Cap"
    },
    "AST.MI": {
        "short_name": "ASTALDI",
        "long_name": "Astaldi S.p.A.",
        "summary": "Astaldi S.p.A. designs, develops, and operates public infrastructure and civil engineering works in Italy and internationally. It undertakes transport infrastructure projects, including roads, bridges/viducts, railways, undergrounds, subways, stations, motorways, and tunnels; water and energy plants, such as hydroelectric plants, dams, aqueducts, and power stations. It is also involved in the civil and industrial buildings comprising schools, hospitals, underground rail stations, car parks, and exhibition spaces; and plant design and engineering, as well as offers operation and maintenance services. The company was founded in 1929 and is headquartered in Rome, Italy. Astaldi S.p.A. is a subsidiary of Webuild S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00156",
        "website": "http://www.astaldi.com",
        "market_cap": "Small Cap"
    },
    "AT.MI": {
        "short_name": "ASTM",
        "long_name": "ASTM S.p.A.",
        "summary": "ASTM S.p.A., an industrial holding company, operates in the sectors of motorway management, infrastructure engineering and construction projects, and transport and mobility technology. The company operates through five segments: Motorway Sector (Operating Activities), Motorway/EPC Sector Planning and Construction Activities-IFRIC 12, EPC Sector, Technology Sector, Services Sector. As of June 30, 2020, the company managed a motorway network of approximately 4,594 km, which included 1,423 km network in Italy, as well as 3,171 km located internationally. It also designs and builds principal transport infrastructure works, roads, motorways, railways, underground railways, bridges, viaducts, and tunnels; and civil and industrial construction works, such as hospitals, shopping centers, and airports, as well as electrical and electromechanical systems. In addition, the company designs, builds, and manages infrastructure network monitoring systems, info mobility products, toll collection products, etc.; develops technological software, primarily application software that manages road databases; and engages in the engineering and integration of technologies and instruments to carry out tools for photographic, geometric, and topographic surveys of infrastructures. Further, it develops and implements technologies in the service of safety and assisted driving of vehicles; and operates in the lease sector of both fiber optics and sites for the positioning of transmission devices for companies operating in the mobile telephony sector. Additionally, ASTM S.p.A. is involved in the design, construction, and management of systems for safety, mobility information, toll collection, and telecommunications. The company was formerly known as Autostrada Torino Milano S.p.A. and changed its name to ASTM S.p.A. in January 2013. ASTM S.p.A. was founded in 1928 and is based in Turin, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TO",
        "city": "Turin",
        "zipcode": "10144",
        "website": "http://www.astm.it",
        "market_cap": "Mid Cap"
    },
    "AUTME.MI": {
        "short_name": "AUTOSTRADE MERID",
        "long_name": "Autostrade Meridionali S.p.A.",
        "summary": "Autostrade Meridionali S.p.A. operates the Naples-Pompeii-Salerno motorway in Italy. Its motorway body maintenance activities include paving, green works, horizontal and vertical signs, plants, runways, and station buildings. The company was founded in 1925 and is based in Naples, Italy. Autostrade Meridionali S.p.A. is a subsidiary of Autostrade per l'Italia S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": null,
        "city": "Naples",
        "zipcode": "80143",
        "website": "http://www.autostrademeridionali.it",
        "market_cap": "Small Cap"
    },
    "DBA.MI": {
        "short_name": "DBA GROUP",
        "long_name": "DBA Group S.p.A.",
        "summary": "DBA Group S.p.A. provides consultancy, architecture, engineering, and project management services. It offers architectural and design study, feasibility study and master planning, and general and specialist works supervision services; preliminary examination, geometric and specialized survey, consulting and technical, workplace safety, quality audit, H and S, and administrative test services; and bid and tender management, construction and installation management, testing and commissioning management, provisioning and deprovisioning circuits, inventory systems update, test and suitability, reporting, business intelligence, and document management, as well as quality, health, and safety audit services. The company also provides energy efficiency services comprising energy audit, efficiency improvement interventions design, and monitoring and energy consumption control systems. In addition, it engages in project management, process analysis and optimization, ICT consulting, software architecture and system design, user training, help desk, and maintenance and technical assistance, as well as software development, implementation, installation, and testing; and IT outsourcing, consulting, hosting, and virtualization, as well as system integration. Further, the company provides cyber security services, including information security and business continuity consulting, privacy, security information and event management, identity and access management, infrastructure security, security assessments and information system audit, penetration test and vulnerability assessment, security check, information security monitoring and management, certification preparation program, and IT security and compliance education and awareness services; and SAP solutions. It serves real estate, telecommunications and media, energy and utilities, alternative fuels and oil, transport and logistics, and other markets. The company was founded in 1991 and is based in Villorba, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "TV",
        "city": "Villorba",
        "zipcode": "31020",
        "website": "http://www.dbagroup.it",
        "market_cap": "Small Cap"
    },
    "IB.MI": {
        "short_name": "INIZIATIVE BRESCIANE",
        "long_name": "Iniziative Bresciane S.p.A.",
        "summary": "Iniziative Bresciane S.p.A. designs, constructs, and operates small and medium-sized hydroelectric plants in Italy. Its hydroelectric plants are located in the provinces of Brescia, Bergamo, and Cremona. The company was founded in 1988 and is based in Breno, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "BS",
        "city": "Breno",
        "zipcode": "25043",
        "website": "http://www.iniziativebrescianespa.it",
        "market_cap": "Small Cap"
    },
    "IMPJY": {
        "short_name": "WEBUILD SPA UNSP ADR EACH REPR ",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Mid Cap"
    },
    "IPJ1.F": {
        "short_name": "WEBUILD S.P.A.",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Small Cap"
    },
    "MT.MI": {
        "short_name": "MAIRE TECNIMONT",
        "long_name": "Maire Tecnimont S.p.A.",
        "summary": "Maire Tecnimont S.p.A. provides plant engineering services and works in Italy and internationally. The company's Hydrocarbons segment designs and constructs plants, including separation, treatment, liquefaction, transportation, storage, regasification, and compression and pumping stations principally for the natural gas chain; and chemical and petrochemical industry plants for the production of polyethylene and polypropylene, ethylene oxide, ethylene glycol, purified terephthalic acid, ammonia, urea, and fertilizers; and hydrocarbon electric power plants, and waste-to-energy and district heating plants. This segment also issues licenses on patented technology and proprietary know-how to urea producers; and is involved in activities related to sulphur recovery process, hydrogen production, and high temperature furnaces. The company's Green Energy segment offers mechanical plastics recycling and promotion of recycled chemicals; and develops additives and substitutes to oil for fuels or plastics from renewables activities. In addition, this segment provides maintenance and facility management services; general services for temporary construction facilities; and infrastructure design and construction services. Further, it undertakes works on renewables sector plants, which primarily include solar and wind plants. The company is headquartered in Milan, Italy. Maire Tecnimont S.p.A. is a subsidiary of GLV Capital S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20124",
        "website": "http://www.mairetecnimont.com",
        "market_cap": "Small Cap"
    },
    "PLC.MI": {
        "short_name": "PLC",
        "long_name": "PLC S.p.A.",
        "summary": "PLC S.p.A. acts as a general contractor in the construction of renewable energy power plants in Italy and internationally. The company operates in two segments, Construction and Services. It constructs turnkey plants for the production of electrical energy from renewable sources; and monitors and maintains electrical power grids, transformers, and accessory plants of wind farms and photovoltaic plants, as well as offers installation, maintenance, and repair services for inverters. The company also markets wind generators and components for wind generators and wind farms, as well as provides maintenance, assembly, disassembly, and management services, including electrical and civil works. The company was formerly known as Industria e Innovazione S.p.A. and changed its name to PLC S.p.A. in July 2018. PLC S.p.A. is based in Milan, Italy. PLC S.p.A is a subsidiary of Fraes S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20123",
        "website": "http://www.plc-spa.com",
        "market_cap": "Small Cap"
    },
    "SCF.MI": {
        "short_name": "SALCEF GROUP",
        "long_name": "Salcef Group S.p.A.",
        "summary": "Salcef Group S.p.A. designs, constructs, and maintains railway infrastructure and civil works worldwide. The company is involved in the renewal and replacement of railway lines and sleepers, cleaning and replacement of ballasts, levelling of tracks, reactivation of lines, and destressing activities; construction of ballasted and ballastless tracks; execution of light civil and infrastructural works, such as industrial engineering, restyling bridges and tunnels, modernizing stations, building small underpasses and overpasses, and rebuilding road networks; and provision of rail grinding, welding, compaction, and sand and dust extraction services. It also designs, constructs, sells, and maintains rolling stock and railway equipment, including modular platforms, motor trolleys, trolleys with cranes, concrete dispencers, and track positioning jigs, as well as provides used equipment and after-sales service. In addition, the company engages in the design, construction, installation, renewal, and maintenance of various electrification systems for railway, metro, and tram lines; signalling, technological, and telecommunication systems; and electrical transmission and overhead power lines, as well as underground cables. Further, it manufactures and sells various types of railway sleepers, precast reinforced concrete slabs, and precast tunnel lining segments; undertakes architectural, structural, and plant engineering projects comprising railway stations, bridges and viaducts, railway tunnels, and environmental mitigation works; and offers design and engineering services railway and infrastructures works. The company was founded in 1949 and is headquartered in Rome, Italy. Salcef Group S.p.A. is a subsidiary of Finhold S.r.l.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RM",
        "city": "Rome",
        "zipcode": "00158",
        "website": "http://www.salcef.com",
        "market_cap": "Small Cap"
    },
    "TFI.MI": {
        "short_name": "TREVI FIN IND",
        "long_name": "TREVI - Finanziaria Industriale S.p.A.",
        "summary": "TREVI - Finanziaria Industriale S.p.A., together with its subsidiaries, provides foundation engineering services worldwide. It offers foundation engineering services for civil works and infrastructure projects; and constructs equipment for special foundations. The company also engages in the construction of drill rigs for the extraction of hydrocarbons and water exploration; and provides oil drilling services. In addition, it manufactures and markets plant and equipment for foundation engineering; and drilling equipment for the extraction of hydrocarbons and water exploration. The company was founded in 1957 and is based in Cesena, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "FO",
        "city": "Cesena",
        "zipcode": "47522",
        "website": "http://www.trevifin.com",
        "market_cap": "Small Cap"
    },
    "TM3.F": {
        "short_name": "ASTM S.P.A.",
        "long_name": "ASTM S.p.A.",
        "summary": "ASTM S.p.A., an industrial holding company, operates in the sectors of motorway management, infrastructure engineering and construction projects, and transport and mobility technology. The company operates through five segments: Motorway Sector (Operating Activities), Motorway/EPC Sector Planning and Construction Activities-IFRIC 12, EPC Sector, Technology Sector, Services Sector. As of June 30, 2020, the company managed a motorway network of approximately 4,594 km, which included 1,423 km network in Italy, as well as 3,171 km located internationally. It also designs and builds principal transport infrastructure works, roads, motorways, railways, underground railways, bridges, viaducts, and tunnels; and civil and industrial construction works, such as hospitals, shopping centers, and airports, as well as electrical and electromechanical systems. In addition, the company designs, builds, and manages infrastructure network monitoring systems, info mobility products, toll collection products, etc.; develops technological software, primarily application software that manages road databases; and engages in the engineering and integration of technologies and instruments to carry out tools for photographic, geometric, and topographic surveys of infrastructures. Further, it develops and implements technologies in the service of safety and assisted driving of vehicles; and operates in the lease sector of both fiber optics and sites for the positioning of transmission devices for companies operating in the mobile telephony sector. Additionally, ASTM S.p.A. is involved in the design, construction, and management of systems for safety, mobility information, toll collection, and telecommunications. The company was formerly known as Autostrada Torino Milano S.p.A. and changed its name to ASTM S.p.A. in January 2013. ASTM S.p.A. was founded in 1928 and is based in Turin, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "TO",
        "city": "Turin",
        "zipcode": "10144",
        "website": "http://www.astm.it",
        "market_cap": "Mid Cap"
    },
    "TV92.F": {
        "short_name": "TREVI-FIN. INDUSTR.",
        "long_name": "TREVI - Finanziaria Industriale S.p.A.",
        "summary": "TREVI - Finanziaria Industriale S.p.A., together with its subsidiaries, provides foundation engineering services worldwide. It offers foundation engineering services for civil works and infrastructure projects; and constructs equipment for special foundations. The company also engages in the construction of drill rigs for the extraction of hydrocarbons and water exploration; and provides oil drilling services. In addition, it manufactures and markets plant and equipment for foundation engineering; and drilling equipment for the extraction of hydrocarbons and water exploration. The company was founded in 1957 and is based in Cesena, Italy.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Italy",
        "state": "FO",
        "city": "Cesena",
        "zipcode": "47522",
        "website": "http://www.trevifin.com",
        "market_cap": "Small Cap"
    },
    "WBD.MI": {
        "short_name": "WEBUILD",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Small Cap"
    },
    "WBDR.MI": {
        "short_name": "WEBUILD RSP",
        "long_name": "Webuild S.p.A.",
        "summary": "Webuild S.p.A. engages in the construction activities worldwide. The company designs and builds works and infrastructure for the mobility, hydroelectric energy, water, green buildings, and tunnelling sectors. It also undertakes the construction of airports and civil and industrial construction; railways and subways; and highways, roads, and bridges, as well as dams and hydroelectric power plants. The company is headquartered in Milan, Italy. Webuild S.p.A. is a subsidiary of Salini Costruttori S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "MI",
        "city": "Milan",
        "zipcode": "20142",
        "website": "http://www.webuildgroup.com",
        "market_cap": "Small Cap"
    },
    "YRM.MI": {
        "short_name": "ROSETTI MARINO",
        "long_name": "Rosetti Marino SpA",
        "summary": "Rosetti Marino SpA provides integrated services to the oil and gas, renewables, chemical, power generation, shipbuilding, and superyacht industrial sectors in Italy and internationally. The company offers engineering, procurement, construction, and installation (EPCI) services for offshore infrastructures, such as integrated topsides, living quarters, jackets, brownfield projects, upgrade and revamping projects, and subsea templates and manifolds, as well as power generation, compression, and utility modules; and onshore infrastructures, including gas/oil separation plants, compression and pumping stations, gathering stations, oil and gas power plants and substations, and process equipment. It also operates as an EPCI contractor for topside of electrical substations, power generation and utility modules, jackets, and transition pieces. In addition, the company offers conceptual and feasibility study, engineering, asset management, operation and maintenance, revamping/modification, mechanical completion and commissioning, and environmental and HSE study services. Further, it provides shipbuilding products comprising LNG-fueled vessels, tugboats, platform supply vessels, anchor handling tugs, anchor handling tug supply vessels, harbor and ocean going tugs, and RO/RO PAX ferries. The company was founded in 1925 and is headquartered in Ravenna, Italy. Rosetti Marino SpA is a subsidiary of Rosfin S.p.A.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "state": "RA",
        "city": "Ravenna",
        "zipcode": "48122",
        "website": "http://www.rosetti.it",
        "market_cap": "Small Cap"
    }
}