{
    "0A4H.L": {
        "short_name": "STONECO LTD STONECO ORD SHS CLA",
        "long_name": "StoneCo Ltd.",
        "summary": "StoneCo Ltd. provides financial technology solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. It distributes its solutions, principally through proprietary Stone Hubs, which offer hyper-local sales and services; and technology and solutions to digital merchants through sales and technical personnel and software vendors, as well as sells solutions to brick-and-mortar and digital merchants through sales team. As of December 31, 2020, the company served approximately 652,600 clients primarily small-and-medium-sized businesses; and 260 integrated partners, such as global payment service providers, digital marketplaces, and integrated software vendors. The company was founded in 2000 and is headquartered in George Town, Cayman Islands. StoneCo Ltd. is a subsidiary of HR Holdings, LLC.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "0Q0.F": {
        "short_name": "STONECO  A  DL-,000079365",
        "long_name": "StoneCo Ltd.",
        "summary": "StoneCo Ltd. provides financial technology solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. It distributes its solutions, principally through proprietary Stone Hubs, which offer hyper-local sales and services; and technology and solutions to digital merchants through sales and technical personnel and software vendors, as well as sells solutions to brick-and-mortar and digital merchants through sales team. As of December 31, 2020, the company served approximately 652,600 clients primarily small-and-medium-sized businesses; and 260 integrated partners, such as global payment service providers, digital marketplaces, and integrated software vendors. The company was founded in 2000 and is headquartered in George Town, Cayman Islands. StoneCo Ltd. is a subsidiary of HR Holdings, LLC.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "4927.TW": {
        "short_name": "APEX INTERNATIONAL CO LTD",
        "long_name": "Apex International Co., Ltd.",
        "summary": "Apex International Co., Ltd. manufactures and sells printed circuit boards in Taiwan. The company offers double-sided and multi-layer printed circuit boards for use in LCD TVs, hard disks, printers, set-top boxes, router, telephone, car audio, and navigator. It also exports its products. The company was founded in 2001 and is based in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "4943.TW": {
        "short_name": "CONCRAFT HOLDING CO LTD",
        "long_name": "Concraft Holding Co., Ltd.",
        "summary": "Concraft Holding Co., Ltd. develops, manufactures, and sells connectors under the CONCRAFT brand name in China, Taiwan, and internationally. The company offers various types of connectors that are used in notebooks, mobile devices, LED TVs, set top boxes, networking, etc.; acoustic components, including receiver, speaker, speaker box, and speaker module components; and optical components, such as VCM components, yokes, lens holders, and base products for use in various electronic devices comprising digital cameras, cell phone cameras, webcams, car cams and security cameras, etc. It also provides automotive components, which include sensor parts, in-car cameras, press fit connectors, ABS controllers and components, fuel injectors, mechatronics parts, ECU parts, solenoid valves, lamp holders, and switchers; and medical components, such as filters, silicone masks, biopsy forceps, valve parts, T- connectors and Y- connectors, luer- connectors, syringe plungers, blood glucose housing parts, and blood pressure housing parts. The company was founded in 1991 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "4966.TWO": {
        "short_name": "PARADE TECHNOLOGIES LTD",
        "long_name": "Parade Technologies, Ltd.",
        "summary": "Parade Technologies, Ltd., a fabless semiconductor company, designs, develops, and sells high-speed interface standards, and touch controller and display processing integrated circuit (IC) chips for products used in computers, consumer electronics, and display panels. The company offers display port LCD timing controllers, embedded display port timing controllers, display port format converters, display port transmitters and receivers, and scalers with display port and high definition multimedia interface (HDMI) inputs; high-speed interface solutions; display port based solutions; display port repeater and switch products, including serial advanced technology architecture, PCI express, HDMI/DVI, and universal serial bus products; source drivers; and truetouch controllers, and touch and display driver integrations, as well as mixed-signal ICs. It operates in South Korea, China, Taiwan, Japan, and internationally. Parade Technologies, Ltd. was founded in 2005 and is headquartered in George Town, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "4991.TWO": {
        "short_name": "GCS HOLDINGS INC",
        "long_name": "GCS Holdings, Inc.",
        "summary": "GCS Holdings, Inc., together with its subsidiaries, manufactures compound semiconductor wafer and foundry related services in China, the United States, Taiwan, and internationally. It also manufactures and sells optoelectronics technology products and optical chips, as well as grants royalty rights for intellectual property. In addition, the company develops, manufactures, and sells mobile phone radio frequency, filter, optical communication chip, power management, and optical fiber products, as well as positive, intrinsic, negative components, and avalanche photo diodes for telecommunication systems and data communication networks; and engages in manufacturing, retailing, and wholesaling telecommunication devices and electronic components. Further, it provides product design, outsourcing management, and research development services. The company serves wireless devices and fiber-optic communication providers. GCS Holdings, Inc. was founded in 1997 and is based in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "5225.TW": {
        "short_name": "EASTECH HOLDING LTD",
        "long_name": "Eastech Holding Limited",
        "summary": "Eastech Holding Limited, together with its subsidiaries, researches and develops, designs, manufactures, and sells speaker systems and earphones in China, Hong Kong, Japan, South Korea, the Netherlands, Sweden, and internationally. It offers home audio products, such as Dolby atoms sound bars, sound bars with wireless surround, and google voice assistant (GVA)/Alexa speaker systems, and home theaters; car speakers; personal audio products comprising Bluetooth and Airplay 2 and Wi-Fi speakers, VUI GVA AI speakers, true wireless stereo speaker/earphone, etc.; premium and automotive transducers under the PUNKTKILDE brand; and molds and acoustic kits. It also engages in the import and export trading of audio and headphone products, machinery, and equipment. The company was formerly known as Eastern Technologies Holding Limited and changed its name to Eastech Holding Limited in June 2017. Eastech Holding Limited was founded in 1971 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "5284.TW": {
        "short_name": "JPP HOLDING COMPANY LIMITED",
        "long_name": "JPP Holding Company Limited",
        "summary": "JPP Holding Company Limited manufactures and sells various mechanical parts, enclosures, and electronic products for the aerospace, telecommunication, electronics, energy, healthcare, and food industries in the Cayman Islands and internationally. The company offers enclosures of flight control computers; and mechanical parts for the cockpit electronics of aircraft with a range of equipment, subsystems, and systems for flight control, navigation, communication, electrical systems, etc. It also provides monitor control cabinets, optical fiber communication system cabinets, 3G telecommunication cabinets, 4G LTE telecommunication cabinets, telephone system switch box+ IP phone system cabinets, telecommunication system cooling set-up boxes, multi-media self-refill billing machines, and bill's for exchange system casing and related products. In addition, the company offers mechanical parts and sub-assemblies of 3D motion picture projectors for digital cinema, surveillance system, and camera internal assembly components; industrial ventilation system chassis; and cash register assemblies. Further, it provides solar system related mechanical parts and assemblies, and solar power AC/DC power converter enclosures; mechanical parts of X-rays, medical displays, surgical operation tables, pharmaceutical carts, MRI cabinets, etc.; and mechanical parts and enclosures of automatic check weighers, metal detectors, meat analyzers, milk analyzers, etc. Additionally, the company designs, manufactures, and sells customized precision sheet metal products; and provision of after-sale services, and aerospace surface treatment and industrial painting services. It serves customers operating in the communications, electronics, aerospace, medical, green energy, food equipment, automobiles, transportation, and other industries. The company was founded in 1998 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "6451.TW": {
        "short_name": "SHUNSIN TECHNOLOGY HOLDINGS LTD",
        "long_name": "ShunSin Technology Holdings Limited",
        "summary": "ShunSin Technology Holdings Limited, through its subsidiaries, engages in the assembly, testing, and sales of various integrated circuits related to semiconductors in Mainland China, the United States, Taiwan, Malaysia, Singapore, and internationally. It offers semiconductor integrated circuit, such as power amplifier (PA), antenna switch module, filter, duplexer, etc. packaging and testing services for communication modules of smart phones; wafer thinning, cutting, and packaging inspection services for module processes; sensors, including micro electro-mechanical systems (MEMS) packaging and testing services for gyroscopes, ambient light sensors, etc. for use in sensing module of smart mobile phone; optical transceiver module packaging and testing services for storage and transmission of enterprise servers and cloud servers; and hybrid integrated circuit module for medical electronics, such as microphone module for hearing aids. The company also provides assembling and testing of automotive electronic parts for vehicle smart keys and vehicle media control system; 3d sensing front-end modules for biometric module of smartphone; and smartwatch mainboard assembly and testing for personal sports and intelligent health monitoring. Its products include system in package module, including 2G/2.5G/3G/4G front end and PA, PA, WiFi front end, mobile WiFi, and antenna switch modules; optical transceivers; thick film integrated circuits; finger print sensor products; micro vibration motors; concentrated photovoltaic (CPV) modules comprising CPV front end modules, electrical and optical sub-assemblies, and receivers; and MEMS modules and sensors, such as accelerometers, gyroscopes, G-sensors, pressure and gesture sensors, light and proximity sensors, BAW filters, and TOF sensors. ShunSin Technology Holdings Limited was founded in 2008 and is headquartered in Grand Cayman, the Cayman Islands. ShunSin Technology Holdings Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "6456.TW": {
        "short_name": "GENERAL INTERFACE SOLUTION HOLD",
        "long_name": "General Interface Solution (GIS) Holding Limited",
        "summary": "General Interface Solution (GIS) Holding Limited engages in the research, development, production, and sales of touch and display modules in the United States, China, Singapore, Japan, Taiwan, and internationally. The company offers touch display solutions combining cover glass, touch sensors, and TFT-LCD display modules, as well as provides after sales services. It is also involved in the manufacture and sale of biometric systems, touch systems, and flat panel displays, as well as its materials; sale of fingerprint recognition products; and research of biomedical services. The company's products are used in wearable devices, mobile phones, tablet PCs, notebooks, automotive devices, AIO products, PND, portable TVs, and interactive whiteboards. General Interface Solution (GIS) Holding Limited was founded in 2011 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "6672.TW": {
        "short_name": "VENTEC INTERNATIONAL GROUP CO L",
        "long_name": "Ventec International Group Co.,Ltd.",
        "summary": "Ventec International Group Co., Ltd. designs, develops, manufactures, and sells copper clad laminates, aluminum-backed laminates, and prepreg bonding materials. Its products include standard FR4, lead free assembly, halogen free products, tec-thermal/thermal management and insulated metal substrate, thermal interface material, polyimide, tec-speed/signal integrity products, flex/flex rigid products, plastic interleaver and release film consumables, drill entry and exit material, copper foils and ACF, and masslam and drill products, as well as products for special applications. The company's products are used for the fabrication of various printed circuit board applications. It also engages in general investment and international trade business. The company operates in China, the United Kingdom, the United States, Germany, and Taiwan. Ventec International Group Co., Ltd. was founded in 2000 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "AIQ.L": {
        "short_name": "AIQ LIMITED ORD GBP0.01 (DI)",
        "long_name": "AIQ Limited",
        "summary": "AIQ Limited focuses on social commerce businesses comprising social media platforms. It primarily focuses on seeking opportunities in data mining, artificial intelligence technologies, and social and online media, such as instant messaging platforms, as well as in the e-commerce sector. The company was incorporated in 2017 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "GBp",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "FAN.F": {
        "short_name": "FABRINET  DL-,01",
        "long_name": "Fabrinet",
        "summary": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "FN": {
        "short_name": "Fabrinet",
        "long_name": "Fabrinet",
        "summary": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "George Town"
    },
    "OIIM": {
        "short_name": "O2Micro International Limited",
        "long_name": "O2Micro International Limited",
        "summary": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Malaysia, Korea, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "OMXA.F": {
        "short_name": "O2MICRO I.ADR DL-00002/50",
        "long_name": "O2Micro International Limited",
        "summary": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Malaysia, Korea, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "STNE": {
        "short_name": "StoneCo Ltd.",
        "long_name": "StoneCo Ltd.",
        "summary": "StoneCo Ltd. provides financial technology solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. It distributes its solutions, principally through proprietary Stone Hubs, which offer hyper-local sales and services; and technology and solutions to digital merchants through sales and technical personnel and software vendors, as well as sells solutions to brick-and-mortar and digital merchants through sales team. As of December 31, 2020, the company served approximately 652,600 clients primarily small-and-medium-sized businesses; and 260 integrated partners, such as global payment service providers, digital marketplaces, and integrated software vendors. The company was founded in 2000 and is headquartered in George Town, Cayman Islands. StoneCo Ltd. is a subsidiary of HR Holdings, LLC.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "George Town"
    }
}