{
    "4927.TW": {
        "short_name": "APEX INTERNATIONAL CO LTD",
        "long_name": "Apex International Co., Ltd.",
        "summary": "Apex International Co., Ltd. manufactures and sells printed circuit boards in Taiwan. The company offers double-sided and multi-layer printed circuit boards for use in LCD TVs, hard disks, printers, set-top boxes, router, telephone, car audio, and navigator. It also exports its products. The company was founded in 2001 and is based in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "1208",
        "website": "http://www.apex-intl.com.tw",
        "market_cap": "Small Cap"
    },
    "4943.TW": {
        "short_name": "CONCRAFT HOLDING CO LTD",
        "long_name": "Concraft Holding Co., Ltd.",
        "summary": "Concraft Holding Co., Ltd. develops, manufactures, and sells connectors under the CONCRAFT brand name in China, Taiwan, and internationally. The company offers various types of connectors that are used in notebooks, mobile devices, LED TVs, set top boxes, networking, etc.; acoustic components, including receiver, speaker, speaker box, and speaker module components; and optical components, such as VCM components, yokes, lens holders, and base products for use in various electronic devices comprising digital cameras, cell phone cameras, webcams, car cams and security cameras, etc. It also provides automotive components, which include sensor parts, in-car cameras, press fit connectors, ABS controllers and components, fuel injectors, mechatronics parts, ECU parts, solenoid valves, lamp holders, and switchers; and medical components, such as filters, silicone masks, biopsy forceps, valve parts, T- connectors and Y- connectors, luer- connectors, syringe plungers, blood glucose housing parts, and blood pressure housing parts. The company was founded in 1991 and is headquartered in Grand Cayman, Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.concraft.com.tw",
        "market_cap": "Small Cap"
    },
    "5284.TW": {
        "short_name": "JPP HOLDING COMPANY LIMITED",
        "long_name": "JPP Holding Company Limited",
        "summary": "JPP Holding Company Limited manufactures and sells various mechanical parts, enclosures, and electronic products for the aerospace, telecommunication, electronics, energy, healthcare, and food industries in the Cayman Islands and internationally. The company offers enclosures of flight control computers; and mechanical parts for the cockpit electronics of aircraft with a range of equipment, subsystems, and systems for flight control, navigation, communication, electrical systems, etc. It also provides monitor control cabinets, optical fiber communication system cabinets, 3G telecommunication cabinets, 4G LTE telecommunication cabinets, telephone system switch box+ IP phone system cabinets, telecommunication system cooling set-up boxes, multi-media self-refill billing machines, and bill's for exchange system casing and related products. In addition, the company offers mechanical parts and sub-assemblies of 3D motion picture projectors for digital cinema, surveillance system, and camera internal assembly components; industrial ventilation system chassis; and cash register assemblies. Further, it provides solar system related mechanical parts and assemblies, and solar power AC/DC power converter enclosures; mechanical parts of X-rays, medical displays, surgical operation tables, pharmaceutical carts, MRI cabinets, etc.; and mechanical parts and enclosures of automatic check weighers, metal detectors, meat analyzers, milk analyzers, etc. Additionally, the company designs, manufactures, and sells customized precision sheet metal products; and provision of after-sale services, and aerospace surface treatment and industrial painting services. It serves customers operating in the communications, electronics, aerospace, medical, green energy, food equipment, automobiles, transportation, and other industries. The company was founded in 1998 and is headquartered in George Town, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.jppholding.com",
        "market_cap": "Micro Cap"
    },
    "6456.TW": {
        "short_name": "GENERAL INTERFACE SOLUTION HOLD",
        "long_name": "General Interface Solution (GIS) Holding Limited",
        "summary": "General Interface Solution (GIS) Holding Limited engages in the research, development, production, and sales of touch and display modules in the United States, China, Singapore, Japan, Taiwan, and internationally. The company offers touch display solutions combining cover glass, touch sensors, and TFT-LCD display modules, as well as provides after sales services. It is also involved in the manufacture and sale of biometric systems, touch systems, and flat panel displays, as well as its materials; sale of fingerprint recognition products; and research of biomedical services. The company's products are used in wearable devices, mobile phones, tablet PCs, notebooks, automotive devices, AIO products, PND, portable TVs, and interactive whiteboards. General Interface Solution (GIS) Holding Limited was founded in 2011 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1205",
        "website": "http://www.gis-touch.com",
        "market_cap": "Small Cap"
    },
    "6672.TW": {
        "short_name": "VENTEC INTERNATIONAL GROUP CO L",
        "long_name": "Ventec International Group Co.,Ltd.",
        "summary": "Ventec International Group Co., Ltd. designs, develops, manufactures, and sells copper clad laminates, aluminum-backed laminates, and prepreg bonding materials. Its products include standard FR4, lead free assembly, halogen free products, tec-thermal/thermal management and insulated metal substrate, thermal interface material, polyimide, tec-speed/signal integrity products, flex/flex rigid products, plastic interleaver and release film consumables, drill entry and exit material, copper foils and ACF, and masslam and drill products, as well as products for special applications. The company's products are used for the fabrication of various printed circuit board applications. It also engages in general investment and international trade business. The company operates in China, the United Kingdom, the United States, Germany, and Taiwan. Ventec International Group Co., Ltd. was founded in 2000 and is headquartered in Grand Cayman, the Cayman Islands.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "Grand Cayman",
        "zipcode": "KY1-1208",
        "website": "http://www.ventec-group.com",
        "market_cap": "Small Cap"
    },
    "FAN.F": {
        "short_name": "FABRINET  DL-,01",
        "long_name": "Fabrinet",
        "summary": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.fabrinet.com",
        "market_cap": "Mid Cap"
    },
    "FN": {
        "short_name": "Fabrinet",
        "long_name": "Fabrinet",
        "summary": "Fabrinet provides optical packaging and precision optical, electro-mechanical, and electronic manufacturing services in North America, the Asia-Pacific, and Europe. The company offers a range of advanced optical and electro-mechanical capabilities in the manufacturing process, including process design and engineering, supply chain management, manufacturing, printed circuit board assembly, advanced packaging, integration, final assembly, and testing. Its products include switching products, including reconfigurable optical add-drop multiplexers, optical amplifiers, modulators, and other optical components and modules that enable network managers to route voice, video, and data communications traffic through fiber optic cables at various wavelengths, speeds, and over various distances. The company's products also comprise tunable lasers, transceivers, and transponders; and active optical cables, which provide high-speed interconnect capabilities for data centers and computing clusters, as well as Infiniband, Ethernet, fiber channel, and optical backplane connectivity. In addition, it provides solid state, diode-pumped, gas, and fiber lasers used in semiconductor processing, biotechnology and medical device, metrology, and material processing industries; and differential pressure, micro-gyro, fuel, and other sensors used in automobiles, as well as non-contact temperature measurement sensors for the medical industry. Further, the company designs and fabricates application-specific crystals, lenses, prisms, mirrors, laser components, and substrates; and other custom and standard borosilicate, clear fused quartz, and synthetic fused silica glass products. It serves original equipment manufacturers of optical communication components, modules and sub-systems, industrial lasers, automotive components, medical devices, and sensors. The company was incorporated in 1999 and is based in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Cayman Islands",
        "state": null,
        "city": "George Town",
        "zipcode": "KY1-9005",
        "website": "http://www.fabrinet.com",
        "market_cap": "Mid Cap"
    }
}