{
    "6451.TW": {
        "short_name": "SHUNSIN TECHNOLOGY HOLDINGS LTD",
        "long_name": "ShunSin Technology Holdings Limited",
        "summary": "ShunSin Technology Holdings Limited, through its subsidiaries, engages in the assembly, testing, and sales of various integrated circuits related to semiconductors in Mainland China, the United States, Taiwan, Malaysia, Singapore, and internationally. It offers semiconductor integrated circuit, such as power amplifier (PA), antenna switch module, filter, duplexer, etc. packaging and testing services for communication modules of smart phones; wafer thinning, cutting, and packaging inspection services for module processes; sensors, including micro electro-mechanical systems (MEMS) packaging and testing services for gyroscopes, ambient light sensors, etc. for use in sensing module of smart mobile phone; optical transceiver module packaging and testing services for storage and transmission of enterprise servers and cloud servers; and hybrid integrated circuit module for medical electronics, such as microphone module for hearing aids. The company also provides assembling and testing of automotive electronic parts for vehicle smart keys and vehicle media control system; 3d sensing front-end modules for biometric module of smartphone; and smartwatch mainboard assembly and testing for personal sports and intelligent health monitoring. Its products include system in package module, including 2G/2.5G/3G/4G front end and PA, PA, WiFi front end, mobile WiFi, and antenna switch modules; optical transceivers; thick film integrated circuits; finger print sensor products; micro vibration motors; concentrated photovoltaic (CPV) modules comprising CPV front end modules, electrical and optical sub-assemblies, and receivers; and MEMS modules and sensors, such as accelerometers, gyroscopes, G-sensors, pressure and gesture sensors, light and proximity sensors, BAW filters, and TOF sensors. ShunSin Technology Holdings Limited was founded in 2008 and is headquartered in Grand Cayman, the Cayman Islands. ShunSin Technology Holdings Limited is a subsidiary of Foxconn (Far East) Limited.",
        "currency": "TWD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "OIIM": {
        "short_name": "O2Micro International Limited",
        "long_name": "O2Micro International Limited",
        "summary": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Malaysia, Korea, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    },
    "OMXA.F": {
        "short_name": "O2MICRO I.ADR DL-00002/50",
        "long_name": "O2Micro International Limited",
        "summary": "O2Micro International Limited, together with its subsidiaries, designs, develops, and markets integrated circuits and solutions for power management components and systems in China, the United States, Taiwan, Japan, Malaysia, Korea, Singapore, and internationally. The company offers analog and mixed-signal integrated circuits that manage and provide power for LCD and LED lighting; control and monitor battery charging and discharging in portable electronic devices and vehicles; perform DC/DC and AC/DC conversion; and provides select and switch functionality between power sources, and LED drivers for backlighting products. Its products are primarily used in the consumer electronics, computer, industrial, communication, and automotive markets for applications, including LCD and LED monitors, LCD and LED televisions, notebook and tablet computers, low/zero emission vehicles, mobile phones, power tools, energy efficient technology relating to batteries, LED lighting, including general lighting and portable electronics devices. The company sells its products through direct sales force, independent sales representatives, or distributors to OEMs, ODMs, and module makers. It also licenses its proprietary intellectual property to third parties; and provides design and engineering support services. The company was founded in 1995 and is headquartered in George Town, the Cayman Islands.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Semiconductors",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Cayman Islands",
        "city": "Grand Cayman"
    }
}