{
    "3IR.F": {
        "short_name": "INTERRA RES CONS.  SD-,25",
        "long_name": "Interra Resources Limited",
        "summary": "Interra Resources Limited, an investment holding company, engages in the petroleum exploration and production activities in Indonesia and Myanmar. It also holds 60% interests in two onshore producing oil fields in the Chauk and Yenangyaung covering an area of approximately 1800 square kilometers located on the north of Yangon; and a 67.5% interest in the Kuala Pambuang block covering an area of approximately 1,631 square kilometers located to the southwest of Palangkaraya. The company trades in heavy machineries. Interra Resources Limited was incorporated in 1973 and is based in Singapore.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239693",
        "website": "http://www.interraresources.com",
        "market_cap": "Nano Cap"
    },
    "41H.SI": {
        "short_name": "$ BlackGoldNatural",
        "long_name": "BlackGold Natural Resources Limited",
        "summary": "BlackGold Natural Resources Limited, an investment holding company, engages in the exploration and mining of coal in Indonesia. The company holds interest in PT Samantaka Batubara concession covering an area of approximately 15,000 hectares located in Riau, Sumatra. It focuses on supplying coal to power plants located in Riau. BlackGold Natural Resources Limited is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038987",
        "website": "http://www.blackgold-group.com",
        "market_cap": "Nano Cap"
    },
    "594.SI": {
        "short_name": "CAPALLIANZ HOLDINGS LTD",
        "long_name": "CapAllianz Holdings Limited",
        "summary": "CWX Global Limited, an investment holding company, engages in the exploration, development, and production of oil and gas in Singapore and Thailand. It operates in two segments, Oil and Gas, and Investment and Trading. The company primarily holds 20% interest in three producing concessions, including SW1, L44/43, and L33/43 located in Phetchabun Basin, Thailand. It also invests in private equity deals; pre-initial public offerings; initial public offerings; and fixed income and hybrid instruments; and trades in equities, commodities, and other financial instruments. The company was formerly known as Loyz Energy Limited and changed its name to CWX Global Limited in October 2017. CWX Global Limited was incorporated in 1999 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "228095",
        "website": "http://cwxglobal.com",
        "market_cap": "Nano Cap"
    },
    "5AL.SI": {
        "short_name": "$ Annica",
        "long_name": "Annica Holdings Limited",
        "summary": "Annica Holdings Limited, an investment holding company, engages in the trading of oil and gas equipment for the oil and gas exploration, production, and petrochemical industries. It is also involved in designing industrial plant engineering service systems, as well as in the general wholesale and trading activities. In addition, the company engages in the design, engineering, procurement, construction, and commissioning of solar photovoltaic systems and related products. Further, the company is involved in the recycling, renewable energy, and green technology business. Additionally, the company is involved in the operation of electric energy generation facilities; manufacture of fabricated metal products; and construction of utility projects. It has operations in Singapore, Malaysia, Indonesia, Thailand, Vietnam, China, Brunei, Myanmar, and internationally. The company was incorporated in 1983 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "408567",
        "website": "http://www.annica.com.sg",
        "market_cap": "Nano Cap"
    },
    "5GI.SI": {
        "short_name": "Interra Resource^",
        "long_name": "Interra Resources Limited",
        "summary": "Interra Resources Limited, an investment holding company, engages in the petroleum exploration and production activities in Indonesia and Myanmar. It also holds 60% interests in two onshore producing oil fields in the Chauk and Yenangyaung covering an area of approximately 1800 square kilometers located on the north of Yangon; and a 67.5% interest in the Kuala Pambuang block covering an area of approximately 1,631 square kilometers located to the southwest of Palangkaraya. The company trades in heavy machineries. Interra Resources Limited was incorporated in 1973 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "239693",
        "website": "http://www.interraresources.com",
        "market_cap": "Nano Cap"
    },
    "5NF.SI": {
        "short_name": "Mencast^",
        "long_name": "Mencast Holdings Ltd.",
        "summary": "Mencast Holdings Ltd., an investment holding company, provides engineering and maintenance, repair, and overhaul solutions in Singapore, Asia, and internationally. It operates through Offshore & Engineering, Marine, and Energy Services segments. The Offshore & Engineering segment inspects, maintains, and fabricates offshore structures; and offers engineering and other onshore structures-related services to the construction and infrastructure, oil and gas, energy and utilities, and water treatment and reclamation sectors. It also designs, procures, fabricates, and installs structural and precision engineering systems and plants; and provides rope access, subsea ROV, and commercial diving services for the offshore marine, and oil and gas industries, as well as industrial rope access services to bridges, tunnels, and other construction projects. The Marine segment manufactures and refurbishes sterngears; offers ship inspection, repair and maintenance, and engineering and fabrication services at shipyards, anchorages, ports, wharves and jetties, and onboard vessels; and provides diving services, and dredging and reclamation works. The Energy Services segment is involved in the chemical decontamination of exhumes, semi-robotic oil tank de-sludging, air-fin cooling cleaning, hydro cleaning, furnace decoking and pigging, and heat-exchange re-tubing; encapsulation of wastes prior for landfill disposal; and design and launch of carbon footprint initiatives. The company also supplies oil and gas equipment; repairs tankers and other ocean-going vessels; wholesales marine equipment and accessories; and offers engineering design and consultancy services. Mencast Holdings Ltd. was founded in 1981 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "609161",
        "website": "http://www.mencast.com.sg",
        "market_cap": "Nano Cap"
    },
    "5OQ.SI": {
        "short_name": "$ Teho Intl",
        "long_name": "TEHO International Inc Ltd.",
        "summary": "TEHO International Inc Ltd., an investment holding company, provides marine and offshore solutions in Singapore, Europe, South East Asia, the United States, East Asia, the Middle East, and internationally. The company operates through Marine & Offshore, and Property Development segments. It offers rigging, mooring, lifting, and safety systems for marine, offshore oil and gas, and construction industries. The company also distributes provides engineered products used in marine and offshore industries, such as rig builders, HVAC contractors, oil companies, cruise vessel builders, and ship and rig owners, as well as EPCs and EPCIs. In addition, it offers water treatment solutions by reverse osmosis desalination technology for the marine and offshore, resort, and other industries. Further, the company develops residential, commercial, and mixed-use projects; and provides real estate consultancy services. TEHO International Inc Ltd. was founded in 1986 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "149544",
        "website": "http://teho.com.sg",
        "market_cap": "Nano Cap"
    },
    "5OR.SI": {
        "short_name": "$ Heatec Jietong",
        "long_name": "Heatec Jietong Holdings Ltd.",
        "summary": "Heatec Jietong Holdings Ltd. provides piping and heat exchanger services for the marine, petrochemical, and oil and gas industries. The company operates through three segments: Piping, Heat Exchanger, and Chemical Cleaning. It offers piping services, such as pipeline structure, restoration and installation works for various pipes and systems to shipyards in Singapore; conducts process piping works, including piping fabrication for floating production, storage and offloading (FPSO) turrets; and specializes in FPSO and oil rig high-pressure piping works. The company also services various types of heat exchangers that are utilized on board marine vessels and onshore petrochemical plants and refinery in mainland China and the Philippines. Its heat exchanger services include on-site inspection, engineering, consultancy, fabrication, and restoration of main engine charged air coolers, condensers, heaters, fresh water generators, and other heat transfer applications. In addition, it designs and builds customized skids and modules; and provides chemical cleaning, hot oil flushing, and hydrojetting solutions to the marine, petrochemical, and the chemical industries. Heatec Jietong Holdings Ltd. was founded in 1990 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "637076",
        "website": "http://www.heatecholdings.com",
        "market_cap": "Nano Cap"
    },
    "5UN.SI": {
        "short_name": "$ Sincap",
        "long_name": "Sincap Group Limited",
        "summary": "Sincap Group Limited, an investment holding company, engages in the trading of thermal coal in Singapore. The company operates through two segments, Coal Products; and Property Development and Investment. It also develops and invests in properties, as well as provides logistic management services. The company was founded in 1999 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048624",
        "website": "http://www.sincapgroup.com.sg",
        "market_cap": "Nano Cap"
    },
    "8KW.F": {
        "short_name": "JADESTONE ENERGY  LS -,50",
        "long_name": "Jadestone Energy Inc.",
        "summary": "Jadestone Energy PLC operates as an independent oil and gas production company in the Asia Pacific region. The company holds 100% operated working interests in the Stag oilfield and the Montara project located in offshore Australia; and two gas development blocks in Southwest Vietnam. It also has a 90% interest in the Lemang production sharing contract located in onshore Sumatra, Indonesia. The company was incorporated in 2021 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "079909",
        "website": "http://www.jadestone-energy.com",
        "market_cap": "Small Cap"
    },
    "AUE.SI": {
        "short_name": "Golden Energy",
        "long_name": "Golden Energy and Resources Limited",
        "summary": "Golden Energy and Resources Limited, an investment holding company, engages in the exploration, mining, marketing, and trading of thermal coal. The company operates through Energy Coal, Metallurgical Coal, and Non-Coal Business segments. It holds interests in five coal mining concession areas that covers an area of approximately 66,204 hectares located in South Kalimantan, Central Kalimantan, Jambi, and South Sumatra Basin in Indonesia; and owns forestry concession rights of 265,095 hectares in Kalimantan, as well also owns the rights to mine approximately 2.9 billion tonnes of thermal coal resources with coal reserves of approximately 1.0 billion tonnes. The company also holds interest in 6 development mines to mine approximately 1.7 billion tonnes of energy coal resources with coal reserves of approximately 130 million tonnes in Australia. In addition, it offers management consultancy services. The company is also engaged in mining of gold. Golden Energy and Resources Limited operates in China, Indonesia, India, South Korea, Spain, and internationally. The company is based in Singapore. Golden Energy and Resources Limited is a subsidiary of PT Dian Swastatika Sentosa Tbk.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049705",
        "website": "http://www.gear.com.sg",
        "market_cap": "Small Cap"
    },
    "BDU.SI": {
        "short_name": "Federal Int",
        "long_name": "Federal International (2000) Ltd",
        "summary": "Federal International (2000) Ltd, an investment holding company, operates as an integrated service provider and procurement specialist in the oil and gas, and energy industries. It operates through six segments: Trading, Manufacturing/Design/Research and Development, Marine Logistics, Energy and Utilities, Resources, and Corporate and Others. The Trading segment assembles and distributes flowline control products; distributes oilfield drilling equipment for use on onshore and offshore rigs and drilling platforms; and offers fire protection and detection systems. It also provides electrical products for marine, coal mining, oil and gas, petrochemical, and pharmaceutical industries. The Manufacturing/Design/Research and Development segment researches, develops, designs, and manufactures flowline control products, high pressure and temperature valves, and related oilfield products. The Marine Logistics segment charters vessels to the offshore oil and gas, and other related industries. The Energy and Utilities segment procures and constructs projects of waste water treatment facility; and provides wastewater treatment services to the end-users. The Resources segment is involved in the mining and sale of coal and other natural resources. The Corporate and Others segment operates and maintains oil and gas facility services. The company also offers management and consultancy services for environmental-related projects; and project consultancy services. In addition, it supplies raw water and treated industrial tap water; and operates as a hardware merchant. The company operates in the People's Republic of China, Canada, Indonesia, Malaysia, the Philippines, Singapore, Thailand, the United States, the United Kingdom, Vietnam, and internationally. Federal International (2000) Ltd was founded in 1974 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "619868",
        "website": "http://federal-int.com.sg",
        "market_cap": "Nano Cap"
    },
    "BLH.SI": {
        "short_name": "Hai Leck",
        "long_name": "Hai Leck Holdings Limited",
        "summary": "Hai Leck Holdings Limited, an investment holding company, provides engineering, procurement, and construction project services and maintenance services to the oil and gas, petrochemical, pharmaceutical, and utilities industries in Singapore. The company operates in two segments, Project and Maintenance Services and Contact Centre Services. It offers mechanical engineering services in structural steel, and piping fabrication and installation, as well as in plant equipment installation, maintenance, modifications, and repairs to oil refinery, petrochemical, chemical, and power plants. The company also provides scaffolding services that are related to erection of scaffolds used to support workmen in the construction or repair of buildings and other large structures; corrosion prevention services using high pressure blasting equipment and cleaning processes to remove surface contaminants before the application of a coat of paint onto clean surfaces of metal structures; thermal protection and insulation services; and refractory and passive fireproofing services, as well as general civil engineering services. In addition, it offers maintenance services on routine and turnaround basis; and call center, telecommunication, and information technology services, as well as asset management, and business and management consultancy services. Further, the company is involved in trading and contracting for thermal insulations, refractories, and fire-protection for steel structures. Hai Leck Holdings Limited was founded in 1975 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "637357",
        "website": "http://www.haileck.com",
        "market_cap": "Micro Cap"
    },
    "BLZ.SI": {
        "short_name": "Advanced",
        "long_name": "Advanced Holdings Ltd.",
        "summary": "Advanced Holdings Ltd., an investment holding company, engages in the design, fabrication, and supply of process equipment, technologies, and analytical and instrumentation systems for oil and gas, petrochemical, and chemical industries. Its systems and products include ball valves, boiling point analyzers, catalyst metering packages, chemical dosing systems, photometers, gas odorisation systems, gas analyzers, sensors, near infrared online process analyzers, process analyzer systems, process cloud point analyzers, sample point interfaces, sampling conditioning systems, specialty valves, thermosets, viscometers, and analyzers and systems. The company also provides biofuels process technologies and plant equipment; and fiber-optic based spectrophotometers for chemical analysis in the chemical process industry. In addition, it engages in the engineering, construction, startup, commissioning, operation, and maintenance of biodiesel plants; and marketing and sale of guided wave products, process equipment, analyzers, measurement and controls systems, etc. The company operates in the People's Republic of China, the United States, Singapore, the Middle East, Netherlands, Kazakhstan, South Korea, Thailand, Vietnam, Indonesia, Malaysia, other European Countries, other Asian countries, and internationally. Advanced Holdings Ltd. was founded in 1993 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "738319",
        "website": "http://www.advancedholdings.com",
        "market_cap": "Nano Cap"
    },
    "BMT.SI": {
        "short_name": "New Silkroutes",
        "long_name": "New Silkroutes Group Limited",
        "summary": "New Silkroutes Group Limited, an investment holding company, primarily operates in the healthcare and energy sectors. It operates in Trading of Oil and Gas, and Healthcare segments. The Trading of Oil and Gas segment trades in petrochemical products; generates power; and invests in strategic petrochemical assets. The Healthcare segment owns and operates primary care medical and dental clinics; and provides hospital development and management services. It owns 16 clinics comprising one dental specialist clinic, eight dental clinics, five family medicine clinics, one aesthetic clinic, and one traditional Chinese medicine clinic. This segment also runs employee healthcare benefits programs; offers systems integration services to hospitals and healthcare facilities; distributes dental and medical supplies; and manufactures disposable medical consumables, such as hospital gowns, linen, personal protective equipment, and masks. It also distributes health supplements and Chinese proprietary medicines; provides clinical management and healthscience consultancy services; and offers business, management, and investment consultancy, as well as management services. In addition, the company is involved in the wholesale and retail trading of crude oil, intermediate fuel oil, and other distillates; and chartering of ships. It has operations in Australia, Cambodia, China, India, Singapore, South Korea, Switzerland, the United Arab Emirates, and Vietnam. The company was formerly known as Digiland International Limited and changed its name to New Silkroutes Group Limited in July 2015. New Silkroutes Group Limited was incorporated in 1994 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119962",
        "website": "http://www.newsilkroutes.org",
        "market_cap": "Nano Cap"
    },
    "BTP.SI": {
        "short_name": "Baker Technology",
        "long_name": "Baker Technology Limited",
        "summary": "Baker Technology Limited, together with its subsidiaries, manufactures and provides specialized marine offshore equipment and services for the oil and gas industry in the Asia Pacific, Africa, the Middle East, America, Singapore, China, and internationally. Its products and services include offshore pedestal cranes; steel products and components, including rack chords and pinions; ancillary equipment, such as elevating systems, skidding systems, raw water towers, and winches; and mechanical handling equipment, as well as design and engineering services. The company also designs, constructs, operates, and charters mobile offshore units, offshore supply vessels, and critical equipment and components for the offshore marine industry; and provides offshore marine logistics support services. In addition, it offers engineering services and other services, such as project management, quality assurance, maintenance and repair, and construction supervision services. The company was formerly known as Wassall Asia Pacific Limited and changed its name to Baker Technology Limited in July 2000. Baker Technology Limited was incorporated in 1981 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629124",
        "website": "http://www.bakertech.com.sg",
        "market_cap": "Nano Cap"
    },
    "BWEK.OL": {
        "short_name": "BW EPIC KOSAN LTD",
        "long_name": "BW Epic Kosan Ltd.",
        "summary": "BW Epic Kosan Ltd., together with its subsidiaries, owns and operates a fleet of pressurized gas carriers in Southeast Asia, Europe, West Africa, and the United States. The company operates a fleet of 76 vessels that provide seaborne services for the transportation of liquefied petroleum gas and petrochemicals, which serve as a link in the international gas and petrochemical supply chains of various oil and commodity trading houses. It also offers commercial and technical management services for various ship owners, as well as engages in vessel owning and chartering activities. The company was formerly known as Epic Gas Ltd and changed its name to BW Epic Kosan Ltd in March 2021. The company was incorporated in 2012 and is headquartered in Singapore. BW Epic Kosan Ltd. is a subsidiary of BW Group Limited.",
        "currency": "NOK",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "OSL",
        "market": "no_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "059818",
        "website": "http://www.bwek.com",
        "market_cap": "Micro Cap"
    },
    "C13.SI": {
        "short_name": "CH Offshore",
        "long_name": "CH Offshore Ltd.",
        "summary": "CH Offshore Ltd., an investment holding company, provides marine support services to the offshore oil and gas industry. It is involved in the ownership and chartering of vessels. The company provides various services, including offshore construction support; support services to offshore drilling rigs and installations, such as towing, anchor-handling, and supply of dangerous goods, as well as supply of deck, liquid, and dry bulk cargoes; and field support services comprising emergency response, rescue, fire-fighting, anti-pollution, etc. It operates through a fleet of eleven anchor handling tug supply vessels. The company was formerly known as Mico Line Pte Ltd and changed its name to CH Offshore Ltd. in September 1990. The company was founded in 1976 and is based in Singapore. CH Offshore Ltd. is a subsidiary of BT Investment Pte Ltd.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "629131",
        "website": "http://www.choffshore.com.sg",
        "market_cap": "Nano Cap"
    },
    "EZIDF": {
        "short_name": "EZION HOLDINGS LTD",
        "long_name": "Ezion Holdings Limited",
        "summary": "Ezion Holdings Limited, an investment holding company, develops, owns, and charters offshore assets to support the offshore energy markets in Singapore, India, Brunei, Thailand, the Middle East, Nigeria, and internationally. The company operates through Liftboats, Jack-Up Rigs, Offshore Support Logistics Services, and Others segments. It owns, charters, and manages rigs and vessels involved in the production, maintenance, and exploration phases of the oil and gas, and offshore windfarm industries. The company also provides shipping agency and management services, as well as undertakes engineering works; financing services; and cargo transportation services. In addition, it holds assets or investments involved in renewable energy, and other oil and gas related industries. The company was incorporated in 1999 and is based in Singapore.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "119968",
        "website": "http://www.ezionholdings.com",
        "market_cap": "Micro Cap"
    },
    "FQ7.SI": {
        "short_name": "Jasper Inv",
        "long_name": "Jasper Investments Limited",
        "summary": "Jasper Investments Limited, an investment holding company, manages vessels and provides barge transportation services in the North Asian region. The company's transportation services include chartering and operating various vessels and transportation equipment for the infrastructure players in the reclamation, construction, and earthwork sectors. It also acts as a contractor for project management of infrastructural works. The company was incorporated in 1987 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Midstream",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "589472",
        "website": "http://www.jasperinvests.com",
        "market_cap": "Nano Cap"
    },
    "G92.SI": {
        "short_name": "China Aviation",
        "long_name": "China Aviation Oil (Singapore) Corporation Ltd",
        "summary": "China Aviation Oil (Singapore) Corporation Ltd. engages in trading jet fuel and other petroleum products to airline companies worldwide. It operates through three segments: Middle Distillates, Other Oil Products, and Investments in Oil-Related Assets. The company engages in trading and supplying gas oils, fuel oils, crude oils, and gasoline and aviation gasolines. It also invests in oil-related assets. The company was incorporated in 1993 and is headquartered in Singapore. China Aviation Oil (Singapore) Corporation Ltd. is a subsidiary of China National Aviation Fuel Group Limited.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038988",
        "website": "http://www.caosco.com",
        "market_cap": "Small Cap"
    },
    "IX2.SI": {
        "short_name": "PEC",
        "long_name": "PEC Ltd.",
        "summary": "PEC Ltd. provides mechanical engineering and contracting services to the oil and gas, petrochemical, pharmaceutical, and oil and chemical terminal industries. The company operates in three segments: Project Works; Plant Maintenance and Related Services; and Other Operations. It offers engineering, procurement, and construction (EPC) services, as well as engineering design and maintenance services; EPC project management and consultancy services; plant maintenance services, including plant turnarounds and upgrading, and makes up services; and engineering, mechanical, piping, structural, tankage, electrical and instrumentation, heat treatment, testing and isolation, painting and blasting, scaffolding, insulation and refractories, fireproofing, and hydro jetting services. The company also provides heavy machineries and equipment leasing services; civil, mechanical, and electrical engineering project services; and engineering technology, economic environmental, and health consultancy services. In addition, it engages in the provision of information technology and consultancy services; and marketing and provision of CAR-BER tools and services. The company serves in Singapore, India, Malaysia, China, Indonesia, Myanmar, Thailand, Vietnam, and the United Arab Emirates. PEC Ltd. was founded in 1982 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628144",
        "website": "http://www.peceng.com",
        "market_cap": "Micro Cap"
    },
    "JSE.L": {
        "short_name": "JADESTONE ENERGY PLC ORD 50P",
        "long_name": "Jadestone Energy plc",
        "summary": "Jadestone Energy plc operates as an independent oil and gas development and production company in the Asia Pacific region. The company holds 100% operated working interests in the Stag oilfield and the Montara project located in offshore Western Australia; and two gas development blocks in Southwest Vietnam. It also holds a 90% interest in the Lemang production sharing contract located in onshore Sumatra, Indonesia; and a 69% operated interest in the Maari project located in offshore New Zealand. The company is headquartered in Singapore.",
        "currency": "GBp",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "079909",
        "website": "http://www.jadestone-energy.com",
        "market_cap": null
    },
    "M05.SI": {
        "short_name": "MTQ",
        "long_name": "MTQ Corporation Limited",
        "summary": "MTQ Corporation Limited, together with its subsidiaries, provides engineering solutions for oilfield equipment in Singapore, the Kingdom of Bahrain, Australia, the United Kingdom, and Indonesia. It offers engineering services for the servicing, manufacturing, assembly, and fabrication of oilfield equipment, such as valves and blow-out-preventers; rents and sells oilfield equipment and spare parts, such as heat exchanger mud coolers, shale shakers, drilling and spares handling tools, BOP pressure test units and torque tools, valves, mud pumps, drillpipe protectors, safety equipment, and pipeline products, as well as drilling spools, adaptors, and related pressure control drilling equipment; and designs and manufactures proprietary and custom-built pipe support and pipe suspension solutions for the oil and gas industry. The company is also involved in the manufacture of high pressure piping; general steel fabrication and repairing of oilfield equipment; and fabrication of pressure vessels. The company was formerly known as Metalock Singapore Limited and changed its name to MTQ Corporation Limited in 2003. MTQ Corporation Limited was founded in 1959 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "128373",
        "website": "http://www.mtq.com.sg",
        "market_cap": "Nano Cap"
    },
    "QPE.F": {
        "short_name": "PEC LTD.",
        "long_name": "PEC Ltd.",
        "summary": "PEC Ltd. provides mechanical engineering and contracting services to the oil and gas, petrochemical, pharmaceutical, and oil and chemical terminal industries. The company operates in three segments: Project Works; Plant Maintenance and Related Services; and Other Operations. It offers engineering, procurement, and construction (EPC) services, as well as engineering design and maintenance services; EPC project management and consultancy services; plant maintenance services, including plant turnarounds and upgrading, and makes up services; and engineering, mechanical, piping, structural, tankage, electrical and instrumentation, heat treatment, testing and isolation, painting and blasting, scaffolding, insulation and refractories, fireproofing, and hydro jetting services. The company also provides heavy machineries and equipment leasing services; civil, mechanical, and electrical engineering project services; and engineering technology, economic environmental, and health consultancy services. In addition, it engages in the provision of information technology and consultancy services; and marketing and provision of CAR-BER tools and services. The company serves in Singapore, India, Malaysia, China, Indonesia, Myanmar, Thailand, Vietnam, and the United Arab Emirates. PEC Ltd. was founded in 1982 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Equipment & Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "628144",
        "website": "http://www.peceng.com",
        "market_cap": "Micro Cap"
    },
    "RE4.SI": {
        "short_name": "Geo Energy Res",
        "long_name": "Geo Energy Resources Limited",
        "summary": "Geo Energy Resources Limited, an investment holding company, engages in the mining, production, and trading of coal. The company operates through Coal Mining, Coal Trading, and Mining Services segments. The Coal Mining segment engages in the production and sale of coal. The Coal Trading segment is involved in the purchase and sale of coal from third parties. The Mining Services segment provides mining contracting and project management services for mining activities conducted at third party mines. The company owns and operates PT Bumi Enggang Khatulistiwa mining concession that covers approximately 4,570 hectares of land located in Kutai Barat, East Kalimantan; the PT Sungai Danau Jaya mining concession that covers 235.5 hectares of land located in Tanah Bumbu, South Kalimantan; PT Tanah Bumbu Resources mining concession covering an area of 489 hectares of land located in Tanah Bumbu, South Kalimantan; and PT Surya Tambang Tolindo mining concession covering an area of 4,600 hectares in Kutai Barat, East Kalimantan. It also engages in the power generation and general trading activities; and operates as a multimedia supplier, as well as offers management consultant services. The company operates in Indonesia, the People's Republic of China, Thailand, India, the Philippines, Vietnam, Korea, and Pakistan. Geo Energy Resources Limited was founded in 2008 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "018982",
        "website": "http://www.geocoal.com",
        "market_cap": "Micro Cap"
    },
    "RXI.F": {
        "short_name": "REX INTL HOLDINGS LTD",
        "long_name": "Rex International Holding Limited",
        "summary": "Rex International Holding Limited, an investment holding company, operates as an oil exploration and production company worldwide. Its Oil and Gas segment is involved in oil and gas exploration and production with concessions located in Oman and Norway. The company's Non-Oil and Gas segment offers Rex Virtual Drilling technology to look for oil using conventional geological and geophysical studies. The company also holds interests in PL263D and PL263E licences located on the Halten Terrace in the Norwegian Sea. Rex International Holding Limited was incorporated in 2013 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049145",
        "website": "http://www.rexih.com",
        "market_cap": "Micro Cap"
    },
    "T13.SI": {
        "short_name": "RH PetroGas",
        "long_name": "RH PetroGas Limited",
        "summary": "RH Petrogas Limited, an investment holding company, engages in the exploration, development, and production of oil and gas resources in Indonesia, the People's Republic of China, Singapore, and Malaysia. The company holds a 60% working interest in the Kepala Burung production sharing contract (PSC) that covers an area of approximately 872 square kilometers (km2) located onshore in the Bird's Head area of West Papua in eastern Indonesia; and a 33.2142% working interest in the Salawati Kepala Burung PSC covering a total area of 1,097 km2 onshore and offshore in the Bird's Head area of West Papua, Indonesia. It also has a 40.8% working interest in the SK331 PSC covering an area of 8,963 km2 located onshore Sarawak in East Malaysia. The company was formerly known as T8ri-M Technologies Singapore Limited and changed its name to RH Petrogas Limited in November 2009. RH Petrogas Limited was incorporated in 1987 and is headquartered in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "117612",
        "website": "http://www.rhpetrogas.com",
        "market_cap": "Nano Cap"
    },
    "UF7N.SG": {
        "short_name": "Golden Energy & Resources Ltd.R",
        "long_name": "Golden Energy and Resources Limited",
        "summary": "Golden Energy and Resources Limited, an investment holding company, engages in the exploration, mining, marketing, and trading of thermal coal. The company operates through Energy Coal, Metallurgical Coal, and Non-Coal Business segments. It holds interests in five coal mining concession areas that covers an area of approximately 66,204 hectares located in South Kalimantan, Central Kalimantan, Jambi, and South Sumatra Basin in Indonesia; and owns forestry concession rights of 265,095 hectares in Kalimantan, as well also owns the rights to mine approximately 2.9 billion tonnes of thermal coal resources with coal reserves of approximately 1.0 billion tonnes. The company also holds interest in 6 development mines to mine approximately 1.7 billion tonnes of energy coal resources with coal reserves of approximately 130 million tonnes in Australia. In addition, it offers management consultancy services. The company is also engaged in mining of gold. Golden Energy and Resources Limited operates in China, Indonesia, India, South Korea, Spain, and internationally. The company is based in Singapore. Golden Energy and Resources Limited is a subsidiary of PT Dian Swastatika Sentosa Tbk.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Thermal Coal",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "049705",
        "website": "http://www.gear.com.sg",
        "market_cap": "Small Cap"
    },
    "VVL.SI": {
        "short_name": "$ AlphaDX",
        "long_name": "Alpha DX Group Limited",
        "summary": "Alpha DX Group Limited, an investment holding company, engages in the exploration and production of oil and gas assets. The company focuses on the development of independently certified oil and gas assets of proven reserves, and proven and probable reserves. It holds 36.2% interest in the Mustang project, a prospective project in the Southern Miluveach Unit, which encompasses approximately 7,680 acres located in the North Slope oil productive region of Alaska, the United States. The company was formerly known as Alpha Energy Holdings Limited and changed its name to Alpha DX Group Limited in March 2021. Alpha DX Group Limited was founded in 1990 and is based in Singapore.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas E&P",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "398007",
        "website": "http://alpha-dx.com.sg",
        "market_cap": "Nano Cap"
    },
    "VZ8.F": {
        "short_name": "CHINA AVIATION OIL SD-,25",
        "long_name": "China Aviation Oil (Singapore) Corporation Ltd",
        "summary": "China Aviation Oil (Singapore) Corporation Ltd. engages in trading jet fuel and other petroleum products to airline companies worldwide. It operates through three segments: Middle Distillates, Other Oil Products, and Investments in Oil-Related Assets. The company engages in trading and supplying gas oils, fuel oils, crude oils, and gasoline and aviation gasolines. It also invests in oil-related assets. The company was incorporated in 1993 and is headquartered in Singapore. China Aviation Oil (Singapore) Corporation Ltd. is a subsidiary of China National Aviation Fuel Group Limited.",
        "currency": "EUR",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "038988",
        "website": "http://www.caosco.com",
        "market_cap": "Small Cap"
    },
    "Y35.SI": {
        "short_name": "AnAn Intl",
        "long_name": "AnAn International Limited",
        "summary": "AnAn International Limited, an investment holding company, engages in the trading of petrochemical, fuel oil, and petroleum products. It offers crude oil; light ends products, such as LPG, NGLs, naphtha, gasoline and blending components, etc.; middle distillates products, including kerosene and diesel; heavy ends products, which include vacuum gasoil, straight-run fuel oil, cracked fuel oil, asphalt, etc.; and chemical products comprising paraxylene, mixed xylenes, glycol, styrene, natural runner, etc. The company also engages in the derivatives trading of energy commodities, as well as invests in energy sector. It has operations in Europe, Singapore, Hong Kong, the People's Republic of China, and internationally. The company was formerly known as CEFC International Limited and changed its name to AnAn International Limited in September 2017. AnAn International Limited was incorporated in 2004 and is based in Singapore. AnAn International Limited is a subsidiary of AnAn Group (Singapore) Pte. Ltd.",
        "currency": "SGD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Singapore",
        "state": null,
        "city": "Singapore",
        "zipcode": "048616",
        "website": "http://www.ananinternational.com",
        "market_cap": "Micro Cap"
    }
}