{"594.SI": {"short_name": "$ CWX Global", "long_name": "CWX Global Limited", "summary": "CWX Global Limited, an investment holding company, engages in the exploration, development, and production of oil and gas in Singapore and Thailand. It operates in two segments, Oil and Gas, and Investment and Trading. The company primarily holds 20% interest in three producing concessions, including SW1, L44/43, and L33/43 located in Phetchabun Basin, Thailand. It also invests in private equity deals; pre-initial public offerings; initial public offerings; and fixed income and hybrid instruments; and trades in equities, commodities, and other financial instruments. The company was formerly known as Loyz Energy Limited and changed its name to CWX Global Limited in October 2017. CWX Global Limited was incorporated in 1999 and is based in Singapore.", "currency": "SGD", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "SES", "market": "sg_market", "country": "Singapore", "city": "Singapore"}, "JSE.L": {"short_name": "JADESTONE ENERGY INC COM SHS NP", "long_name": "Jadestone Energy Inc.", "summary": "Jadestone Energy Inc., together with its subsidiaries, engages in the production, development, exploration, and appraisal of oil and gas assets in Australia, Vietnam, and the Philippines. The company holds 100% interests in the Stag oilfield and the Montara project located in offshore Western Australia, as well as two gas development blocks in Southwest Vietnam. It also has an option to acquire a 69% interest in the Maari Project situated in New Zealand. As of December 31, 2019, it had proved plus probable reserves of 41.8 million barrels of oil equivalent. Jadestone Energy Inc. is headquartered in Singapore.", "currency": "GBp", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "LSE", "market": "gb_market", "country": "Singapore", "city": "Singapore"}, "RXI.F": {"short_name": "REX INTL HOLDINGS LTD", "long_name": "Rex International Holding Limited", "summary": "Rex International Holding Limited, an investment holding company, operates as an oil exploration and production company worldwide. Its Oil and Gas segment is involved in oil and gas exploration and production with concessions located in Oman and Norway. The company's Non-Oil and Gas segment offers Rex Virtual Drilling technology to look for oil using conventional geological and geophysical studies. The company also holds interests in PL263D and PL263E licences located on the Halten Terrace in the Norwegian Sea. Rex International Holding Limited was incorporated in 2013 and is headquartered in Singapore.", "currency": "EUR", "sector": "Energy", "industry": "Oil & Gas E&P", "exchange": "FRA", "market": "dr_market", "country": "Singapore", "city": "Singapore"}}