{
  "3IR.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Oil & Gas E&P",
    "long_name": "Interra Resources Limited",
    "market": "dr_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "INTERRA RES CONS.  SD-,25",
    "state": null,
    "summary": "Interra Resources Limited, an investment holding company, engages in the petroleum exploration and production activities in Indonesia and Myanmar. It also holds 60% interests in two onshore producing oil fields in the Chauk and Yenangyaung covering an area of approximately 1800 square kilometers located on the north of Yangon; and a 67.5% interest in the Kuala Pambuang block covering an area of approximately 1,631 square kilometers located to the southwest of Palangkaraya. The company trades in heavy machineries. Interra Resources Limited was incorporated in 1973 and is based in Singapore.",
    "website": "http://www.interraresources.com",
    "zipcode": "239693"
  },
  "594.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Oil & Gas E&P",
    "long_name": "CapAllianz Holdings Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "CAPALLIANZ HOLDINGS LTD",
    "state": null,
    "summary": "CWX Global Limited, an investment holding company, engages in the exploration, development, and production of oil and gas in Singapore and Thailand. It operates in two segments, Oil and Gas, and Investment and Trading. The company primarily holds 20% interest in three producing concessions, including SW1, L44/43, and L33/43 located in Phetchabun Basin, Thailand. It also invests in private equity deals; pre-initial public offerings; initial public offerings; and fixed income and hybrid instruments; and trades in equities, commodities, and other financial instruments. The company was formerly known as Loyz Energy Limited and changed its name to CWX Global Limited in October 2017. CWX Global Limited was incorporated in 1999 and is based in Singapore.",
    "website": "http://cwxglobal.com",
    "zipcode": "228095"
  },
  "5GI.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Oil & Gas E&P",
    "long_name": "Interra Resources Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "Interra Resource^",
    "state": null,
    "summary": "Interra Resources Limited, an investment holding company, engages in the petroleum exploration and production activities in Indonesia and Myanmar. It also holds 60% interests in two onshore producing oil fields in the Chauk and Yenangyaung covering an area of approximately 1800 square kilometers located on the north of Yangon; and a 67.5% interest in the Kuala Pambuang block covering an area of approximately 1,631 square kilometers located to the southwest of Palangkaraya. The company trades in heavy machineries. Interra Resources Limited was incorporated in 1973 and is based in Singapore.",
    "website": "http://www.interraresources.com",
    "zipcode": "239693"
  },
  "8KW.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Oil & Gas E&P",
    "long_name": "Jadestone Energy Inc.",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Energy",
    "short_name": "JADESTONE ENERGY  LS -,50",
    "state": null,
    "summary": "Jadestone Energy PLC operates as an independent oil and gas production company in the Asia Pacific region. The company holds 100% operated working interests in the Stag oilfield and the Montara project located in offshore Australia; and two gas development blocks in Southwest Vietnam. It also has a 90% interest in the Lemang production sharing contract located in onshore Sumatra, Indonesia. The company was incorporated in 2021 and is headquartered in Singapore.",
    "website": "http://www.jadestone-energy.com",
    "zipcode": "079909"
  },
  "JSE.L": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "GBp",
    "exchange": "LSE",
    "industry": "Oil & Gas E&P",
    "long_name": "Jadestone Energy plc",
    "market": "gb_market",
    "market_cap": null,
    "sector": "Energy",
    "short_name": "JADESTONE ENERGY PLC ORD 50P",
    "state": null,
    "summary": "Jadestone Energy plc operates as an independent oil and gas development and production company in the Asia Pacific region. The company holds 100% operated working interests in the Stag oilfield and the Montara project located in offshore Western Australia; and two gas development blocks in Southwest Vietnam. It also holds a 90% interest in the Lemang production sharing contract located in onshore Sumatra, Indonesia; and a 69% operated interest in the Maari project located in offshore New Zealand. The company is headquartered in Singapore.",
    "website": "http://www.jadestone-energy.com",
    "zipcode": "079909"
  },
  "RXI.F": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Oil & Gas E&P",
    "long_name": "Rex International Holding Limited",
    "market": "dr_market",
    "market_cap": "Micro Cap",
    "sector": "Energy",
    "short_name": "REX INTL HOLDINGS LTD",
    "state": null,
    "summary": "Rex International Holding Limited, an investment holding company, operates as an oil exploration and production company worldwide. Its Oil and Gas segment is involved in oil and gas exploration and production with concessions located in Oman and Norway. The company's Non-Oil and Gas segment offers Rex Virtual Drilling technology to look for oil using conventional geological and geophysical studies. The company also holds interests in PL263D and PL263E licences located on the Halten Terrace in the Norwegian Sea. Rex International Holding Limited was incorporated in 2013 and is headquartered in Singapore.",
    "website": "http://www.rexih.com",
    "zipcode": "049145"
  },
  "T13.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Oil & Gas E&P",
    "long_name": "RH PetroGas Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "RH PetroGas",
    "state": null,
    "summary": "RH Petrogas Limited, an investment holding company, engages in the exploration, development, and production of oil and gas resources in Indonesia, the People's Republic of China, Singapore, and Malaysia. The company holds a 60% working interest in the Kepala Burung production sharing contract (PSC) that covers an area of approximately 872 square kilometers (km2) located onshore in the Bird's Head area of West Papua in eastern Indonesia; and a 33.2142% working interest in the Salawati Kepala Burung PSC covering a total area of 1,097 km2 onshore and offshore in the Bird's Head area of West Papua, Indonesia. It also has a 40.8% working interest in the SK331 PSC covering an area of 8,963 km2 located onshore Sarawak in East Malaysia. The company was formerly known as T8ri-M Technologies Singapore Limited and changed its name to RH Petrogas Limited in November 2009. RH Petrogas Limited was incorporated in 1987 and is headquartered in Singapore.",
    "website": "http://www.rhpetrogas.com",
    "zipcode": "117612"
  },
  "VVL.SI": {
    "city": "Singapore",
    "country": "Singapore",
    "currency": "SGD",
    "exchange": "SES",
    "industry": "Oil & Gas E&P",
    "long_name": "Alpha DX Group Limited",
    "market": "sg_market",
    "market_cap": "Nano Cap",
    "sector": "Energy",
    "short_name": "$ AlphaDX",
    "state": null,
    "summary": "Alpha DX Group Limited, an investment holding company, engages in the exploration and production of oil and gas assets. The company focuses on the development of independently certified oil and gas assets of proven reserves, and proven and probable reserves. It holds 36.2% interest in the Mustang project, a prospective project in the Southern Miluveach Unit, which encompasses approximately 7,680 acres located in the North Slope oil productive region of Alaska, the United States. The company was formerly known as Alpha Energy Holdings Limited and changed its name to Alpha DX Group Limited in March 2021. Alpha DX Group Limited was founded in 1990 and is based in Singapore.",
    "website": "http://alpha-dx.com.sg",
    "zipcode": "398007"
  }
}
