{
    "2208.TW": {
        "short_name": "CSBC CORPORATION TAIWAN",
        "long_name": "CSBC Corporation",
        "summary": "CSBC Corporation engages in building, manufacturing, and repairing various ships and onshore equipment. The company offers bulk, cement, and product carriers; and container ships, reefer vessels, tankers, tug boats, and naval ships, as well as oil drilling rigs. It also provides marine works; offshore wind turnkey services; and engineering services, such as manufacture, installation, assembly, and shipping of domestic and international ship unloaders, as well as level luffing cranes. In addition, the company manufactures marine hardware comprising rudder and stern frames, and lashing bridges; and offers ship coating, anti-corrosion coating on large steel structures, surface treatment, and professional coating services. It operates in Taiwan, Singapore, Marshall Islands, Hong Kong, Panama, and internationally. The company was formerly known as China Shipbuilding Corporation and changed its name to CSBC Corporation in March 2007. CSBC Corporation was founded in 1973 and is headquartered in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "81234",
        "website": "http://www.csbcnet.com.tw",
        "full_time_employees": null
    },
    "4541.TWO": {
        "short_name": "MAGNATE TECHNOLOGY CO LTD",
        "long_name": "Magnate Technology Co., Ltd.",
        "summary": "Magnate Technology Co., Ltd. manufactures and sells aerospace components and assemblies in Taiwan. The company offers landing gears, aerospace comprehensives, engine casings, and heat exchangers. It also provides other precision machinery components and assemblies, and food industry machinery. The company was founded in 1987 and is based in Kaohsiung City, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "821",
        "website": "http://www.maicl.com",
        "full_time_employees": 586
    },
    "4546.TWO": {
        "short_name": "CHPC",
        "long_name": "Chaheng Precision Co., Ltd.",
        "summary": "Chaheng Precision Co., Ltd. develops, manufactures, and sells aero-engine components in Taiwan. The company offers aero-engine fan blades, compressor and combustor assemblies, and OGV diffusers; and toles, oil collectors, flow dividers, rings, thermy off plates, cones, inner barrels, fans, and dome combustion chamber baffles. It also provides aero-engine assemblies and other products, including bracket, compressor actuation linkage assy, fan bootstrap bracket, seal, manifold-low pressure turbine and machining bracket, probe, and retaining seal, as well as stationary-AIR, AFT, BRG, and 4B pressure seal. The company was founded in 1997 and is based in Kaohsiung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Kaohsiung",
        "zipcode": "821",
        "website": "http://www.chaheng.com",
        "full_time_employees": 239
    },
    "6753.TWO": {
        "short_name": "LUNGTEH",
        "long_name": "Lungteh Shipbuilding Co., Ltd.",
        "summary": "Lungteh Shipbuilding Co, Ltd. designs and builds ships. It engages in building work boats, including environmental services craft and other special purpose vessels, as well as passenger ferries and naval combat boats. The company was founded in 1979 and is based in Dongshan, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Aerospace & Defense",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Dongshan",
        "zipcode": "269",
        "website": "http://www.lungteh.com",
        "full_time_employees": 541
    }
}