{
    "1809.TW": {
        "short_name": "CHINA GLAZE CO",
        "long_name": "China Glaze Co.,Ltd.",
        "summary": "China Glaze Co., Ltd. manufactures and sells ceramic glaze materials. The company offers frits, pigments, ameloblasts, zirconium silicates, print glazes, vetrosa glazes, and digital inks. It also provides building construction materials, such as crystal glass; ceramic tiles; and photoelectric and nano materials. The company was founded in 1973 and is headquartered in Hsinchu, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Hsinchu City",
        "zipcode": "31061",
        "website": "http://www.china-glaze.com.tw/Entaiwan/AboutUs.aspx",
        "market_cap": 2480573696
    },
    "2062.TW": {
        "short_name": "SUNSPRING METAL CORPORATION",
        "long_name": "Sunspring Metal Corporation",
        "summary": "Sunspring Metal Corporation manufactures and sells zinc, brass, and plastic parts worldwide. The company offers components for bathroom accessories, door hardware, and communications equipment. It serves hardware, automotive, kitchen and bath plumbing, communications equipment, and other related industries. Sunspring Metal Corporation was founded in 1973 and is headquartered in Taichung, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Taichung",
        "zipcode": "40757",
        "website": "http://www.sunspring.com.tw",
        "market_cap": 4572542464
    },
    "8930.TWO": {
        "short_name": "CKM APPLIED MATERIALS CORP",
        "long_name": "CKM Applied Materials Corp.",
        "summary": "CKM Applied Materials Corp. develops metal building materials in Taiwan. The company offers ceiling suspension systems, such as exposed T grids and partition frame systems; metal ceilings, including flat, perforated, embossed, mesh, baffle, curve, linear grid, honeycomb, extrusion, crossing, triangular, strip, and cell ceilings; and micro-perforated acoustical panels. Its products are used in governmental buildings, hospitals, schools, department stores, hotels, factories, public and residential buildings, and commercial buildings. The company was formerly known as CKM Building Material Corp. and changed its name to CKM Applied Materials Corp. in July 2017. The company was founded in 1982 and is headquartered in Tainan city, Taiwan.",
        "currency": "TWD",
        "sector": "Industrials",
        "industry": "Building Products & Equipment",
        "exchange": "TWO",
        "market": "tw_market",
        "country": "Taiwan",
        "state": null,
        "city": "Tainan City",
        "zipcode": "72042",
        "website": "http://www.ckm.com.tw",
        "market_cap": 1167503872
    }
}