{
  "2371.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Conglomerates",
    "long_name": "Tatung Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "TATUNG CO LTD",
    "state": null,
    "summary": "Tatung Co., Ltd., through its subsidiaries, provides power, consumer, and system solutions in Taiwan, China, Asia, Europe, the United States, Southeast Asia, and internationally. The company operates through four segments: Optical Department, Machinery and Energy Department, Consumer Products Department, and Real Estate Development Department. It offers products and services, such as steel manufacturing machinery, industrial appliances, household appliances, refrigerators, air conditioners, metal processing machineries, electronic products, wires and cables, chemicals, cookware products, wood-made products, plastics, office equipment, audio products, precision meters, and transmission equipment. The company also provides products and services that include transportation facilities, health care products, microbe fermentation products, construction, furniture products, solar wafers, water treatment engineering, telecommunication equipment, parking facilities, automation machinery, semiconductors, and real estate development and leasing. In addition, it engages in publishing magazines, as well as offering customs brokerage; the general import and export business; and development and leasing of industrial parks. Tatung Co., Ltd. was founded in 1918 and is headquartered in Taipei, Taiwan.",
    "website": "http://www.tatung.com",
    "zipcode": "10435"
  },
  "3027.TW": {
    "city": "New Taipei City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Conglomerates",
    "long_name": "Billion Electric Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "BILLION ELECTRONIC",
    "state": null,
    "summary": "Billion Electric Co., Ltd. designs, produces, and distributes power transformers, power supplies, and other power-related products in Australia, South Africa, Southeast Asia, Middle East, the United States, the United Kingdom, Turkey, Europe, Central and South America, and internationally. It offers machine to machine and Internet of Things products for the telecommunication industry; xDSL, xDSL wireless AP, xDSL wireless AP VoIP, and active Ethernet fiber series products; indoor and outdoor LED drivers, AC/DC power adaptors, and POE injectors; network/telecom products comprising in-home broadband, enterprise networking, and outdoor 4G/LTE routers; and green energy and storage products. The company also provides OBD and an on-line GPS tracking system; dual LTE modules; and fleet management tracking solutions. In addition, it offers network communication solutions for electronic transactions in retail stores, chain stores, POS systems, ATMs, multi-purpose kiosks and vending machines. The company provides its products under the BILLION brand. Billion Electric Co., Ltd. was founded in 1973 and is headquartered in New Taipei City, Taiwan.",
    "website": "http://www.billion.com.tw",
    "zipcode": "23146"
  },
  "8410.TWO": {
    "city": "Tainan City",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TWO",
    "industry": "Conglomerates",
    "long_name": "Sentien Printing Factory Co., Ltd.",
    "market": "tw_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "SENTIEN PRINTING FACTORY CO LTD",
    "state": null,
    "summary": "Sentien Printing Factory Co., Ltd. produces, supplies, and sells heat transfer, insert mold, and in-mold label and release foils in Taiwan. Its heat transfer films are used in house wares, cosmetics, stationeries, appliances, and janitorial applications; and in-mold labels are used in plastic plates or cups applications. The company's in-mold decoration films are used in consumer electronic products, appliances, and automotive interior components applications; and insert molding films are used in smart appliances, and interior and exterior of automobiles and motorbikes applications. Sentien Printing Factory Co., Ltd. was founded in 1956 and is based in Tainan City, Taiwan.",
    "website": "http://www.sentien.com.tw",
    "zipcode": "709"
  },
  "9945.TW": {
    "city": "Taipei",
    "country": "Taiwan",
    "currency": "TWD",
    "exchange": "TAI",
    "industry": "Conglomerates",
    "long_name": "Ruentex Development Co.,Ltd.",
    "market": "tw_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "RUENTEX DEVELOPMENT CO LTD",
    "state": null,
    "summary": "Ruentex Development Co., Ltd. provides construction and civil engineering contracting services in Taiwan and China. The company is involved in the construction of residential buildings through subcontracting; lease and sale of commercial buildings; trade of construction materials; sale of related merchandise; operation of supermarkets and shopping malls; undertaking of construction and civil engineering activities; and import/export, manufacture, and planning of precast constructional components, such as beams, columns, and walls, as well as provision of relevant electrical and mechanical works. It also installs cables, elevators, and fire safety equipment; operates department store; and manufactures waste disposal and pollution prevention equipment. In addition, the company offers mansions management, retirement home, general property management, maintenance, security, and building rental and selling services; investment management consulting and construction engineering, interior decoration and garden greening design and construction, and congregate housing services; and personal insurance products, including life insurance, health insurance, and damage insurance or annuity. Further, it manufactures, processes, spins, textiles, and sells garments, as well as involved in telecommunications enterprises and communication engineering activities; and manufactures, distributes, and sells building materials. The company was formerly known as Ruentex Construction Co., Ltd. and changed its name to Ruentex Development Co., Ltd. in July 2002. Ruentex Development Co., Ltd. was founded in 1977 and is headquartered in Taipei, Taiwan.",
    "website": "http://rcweb.ruentex.com.tw/RUENTEX",
    "zipcode": "10492"
  }
}
